{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great City Location!”", "Author": "Sharela21", "ReviewID": "UR125840315", "Content": "Arrived at the apartment in the evening with a young child. We were checked in immediately and ordered a meal from room service. Fantastic quick service, lovely meal and well presented. The apartment was on the 16th floor and very spacious, clean and we immediately felt at home. Great views of the modern city on one side and the old town and sea on the other side. Great facilities on site, we used the gym and pool a few times. Very friendly staff. It's a short drive from the airport, one of my favourite places was on our door step - Tim Hortons, I was in heaven! The metro is right outside the hotel and a great way to get around Dubai, very clean and reliable services. The taxis are also reasonable. A great central location with a fantastic view of the Burj Al Khalifa at the front of these apartments. I would definately stay here again.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salmiyah, Kuwait", "Title": "“A very nice place to stay in Dubai”", "Author": "Ihab A", "ReviewID": "UR125743122", "Content": "We spent 3 nights in this hotel by end of February. We arrived by noon and we found that all the appartments are busy. The front office was very helpful and they advised that the room will be ready in 30 Min. We went to the supermarket behind the hotel. When we returned we were allocated in an appartment in the 31st floor. A very nice view over the gulf. The appartment was will equiped, nice and clean. The housekeeping is done on daily basis. The whole family like the place and we will return back to it.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Planet_Earth", "Title": "“Great location”", "Author": "ekatreturns", "ReviewID": "UR125734818", "Content": "My wife and I spent two nights at the Chelsea Tower Hotel Apartments in Dubai. The staff was extremely friendly and helpful from the reception to the maintenance and cleaning staff. The rooms are clean and surprisingly spacious for the price. I was really impressed with the quality to cost ratio. The location is the biggest selling point of this property. If you come in via Etihad Airways coach service the depot is in the same building. The Dubai Metro station is right out side of the hotel. The Metro is a great way to get to the other parts of Dubai such as the Mall of the Emirates and the Marina area, as well as the airport. There is a great restaurant attached to the hotel that is also a great value with delicious Middle Eastern cuisine. The only downside for me was the lack of a bar. If you want a cocktail with your dinner you will have to go elsewhere. And the increasingly common practice of charging for internet access. At around a hundred and fifty dollars a night, you'd think they could throw in internet service. Overall I think it would be hard to find a better hotel, with a better location, for a better price.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Croydon, United Kingdom", "Title": "“Location and Family Friendly”", "Author": "9934sam", "ReviewID": "UR125698515", "Content": "Just returned from 6 nights in Dubai, 3 night at the Chelsea Towers. 50AED from the airport by taxi. Great drive from the airport. Booked a 2 bedroom and asked for high level. I was given a 3 bedroom on 16th floor. Views of the see and the Sail hotel Room 1602. Fantasic. Travelled with mother of 70, sister 50, son 3 years old, me 42. Bought a metro ticket pass for 1 day 16 AED, went to Dubai Mall, one stop away, as the metro is right outside the hotel. From the station there is a complimentary bus to the mall. Don't queue, just run and jump on, as everyone else did. Great mall, could spend all day there. So much for the kids, everyone really. Affordable good food, shops for every budget, very easy. Takes more than a day to get around. The Aquarium in 50AED for 3 year olds upwards. This also included the underwater zoo that is located on a upper level next to the food court. It's not made clear to you, so don't miss out. We thought it was expensive for the aquarium as we went round in around 30 mins, but when we read our receipt we realised that the zoo was included and went after lunch and that was around 45 mins to get round. My little boy loved it, it had a Nemo fish tank with all the fish from Nemo. The taxi to the Apartment is only 10-12AED, so it worth getting a taxi if there are a few of you, but we did enjoy riding the Metro, just for the experience. We didn't use the ice ring , but it looked good. You must see the indoor waterfall. We went back in the night and watch the water Fountain show, which is to Arabic music, it funs every 30 mins. The Burj Khalifah is 100 AED if you book in advance and it does get booked up so book as soon as you arrive or before hand if you can. You can go up immediately for 400 AED, but we felt that it was too expensive. You can stay up there as long as you like, once up there. There are lots of supermarkets along the main road within 5 mins walk, the open until 2am and there is one 5 mins away that is 24 hours. They are very good and stock absolutely everything from toothpaste, mouthwash to fruit, beans, crisps, tea coffee, bread , just everything and all the well know brands. The apartments are clean and tidy. Rooms are large and comfortable. The pools are warm and the gym is well equipped. We had room service once, and it was well price and good food. There is pizza hut next door, Applbey which does great food for everyone, very well prices, KFC, Burgerking within 10 mins walk. McDonald within 15 mins walk. There are great restaurants in the hotels if you don't want fast food that are also well priced. Dubai Mall is the best place to eat if everyone like different food. The food court is amazing, it has some great restaurants and not just fast food. Juicebars, oriental, italian, american, even fish and chips. Also wonderful homemade pasta place. There are eateries outside near the water fountain show which are also great. Just about everything, even fine dining. The staff are very friendly and helpful, I would definintely stay there again. NB you can't take photos in the pool", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“good but had to push staff”", "Author": "bzzzz_12", "ReviewID": "UR124558827", "Content": "impressive and well situated building, given room on 1st floor which was obviously not cleaned, sofas and chairs stained, floors dirty. after talk with reception I asked them to see the room but instead they took us to another room which was clean and v good. great size of rooms, cleaned well, staff v friendly. pool and gym excellent, good selection of free weights also. supermarket/KFC/starbucks/Applebees/metro station all just outside within 5-10 mins, taxi's cheap, airport 9km away 20 mins drive. valet parking v handy and free. would stay agin , would have been 5 stars if not for initial dirty room - staff were keen to help after short talk", "Date": "February 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Spacious”", "Author": "Just1Trip", "ReviewID": "UR124195569", "Content": "If you're looking for a spacious yet cost effective accomodation, this is the place. Clean and simple, the room we had was enormous with three massive bedrooms, three toilets and two bathrooms. Fully equipped kitchen with dishwasher, washing machine, dryer and fridge and a seperate dining area and lounge area with flat screen tv and dvd player. Not many options to eat near by but train station close by and a mini market to stock up on essentials just behind the building. Customer service was friendly but nothing to rave about. Fabulous pool on the rooftop with lifeguard , however, be careful on the very slippery floor. Didn't make for a relaxing time by the pool when young kids got out in fear they would smash their heads on the floor but as long as you were in the water it was beautiful. Overall, a comfortable stay.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Wonderful stay”", "Author": "Raj76London", "ReviewID": "UR123600551", "Content": "We stayed in a 3 bed apartment for 9 days (grandparents, parents and 2 kids) The service at hotel is great, all the staff are very friendly and helpful, pool is nice, even used the gym a couple of times. We had a problem with our fridge, it was replaced within 2 hours The apartment was cleaned every day to a high standard. Location is a short ride from the airport (40 Dirhams), metro stop right outside, good local take aways, not far from the malls, hypermarket a 5min walk, a bit further for the attractions (metro/taxi will get you there) Would stay here again (my wife has high standards when it comes to hotels, she was impressed)", "Date": "January 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Trinidad", "Title": "“Good place, but probably not best location for tourist type activity”", "Author": "Ninjaman0714", "ReviewID": "UR123384944", "Content": "I lived at these apartments for ~8 months over a period from Sept 2010 to Dec 2011. I had a 2 bedroom apartment on the 41st floor. If located somewhere good or bad really just depends on what you are looking for. It is pretty close to the Dubai Mall, which is about 5 minutes by taxi. A Metro Station is literally right in front of the building, which is convenient - you can get to anywhere along Sheik Zayed using the Metro. Mall of the Emirates is the other big mall, and the Metro Station there connects directly with the mall. Lots of food places within 10 mins walk along the street, pubs in the hotels, and with a convenient mini-mart 2 buildings down. If you plan to be doing tourist type activity and partying, then this is probably not the right area to be looking for, and you should look further down Sheik Zayed, more like in the Marina area. To get to the Marina from Chelsea by taxi will cost about 50 Dhs, so you're looking at 100 Dhs cab fare for every round trip. Madenat Souk near the Burj Al Arab will be about 60-70 Dhs round trip. It adds up to a lot if you are frequenting that side of town. The apartment was spacious, though a bit old (not very old though). They have 1, 2 and 3 bedroom apartments available, I never saw a 3 bedroom. Mine had 2-1/2 bathrooms, with the master en suite. The master has large window-walls right around (mine was a corner) which overlooked Sheik Zayed and the Burj Khalifa. At night, this was a particularly nice view. I always kept the blinds and curtains pulled back. Small TV included in the master. Larger (42\" I think) included in the living room. As I mentioned before, the age is starting to tell on a few things, such as the furniture, but it's not too bad. Big dining room table also in the apartment. The 2nd bedroom feels a bit cramped, but both bedrooms have good closet space. Bathrooms are decent enough. Since I had the apartment booked on long term, I had cleaning done 3 times a week - 2 full cleanings, and 1 half cleaning (sheets not changed unless specifically requested). Be sure to find out what exactly is included before booking in terms of cleaning schedules. For bed sheet changes, you generally have to specify that you want it done. Cleaning was good, nothing exceptional but pretty standard for a hotel. Kitchen is pretty decent, with a nice stove. Fridge is good size for a couple, washing machine and dryer included in the kitchen, along with dishwasher, microwave, and toaster. Be sure you ask about the washer and dryer, as I believe the 1 bedroom apartments have the 2-in-1 washer / dryer combo, which from what I've heard do not get the job done. Also, be sure to check for the instruction booklet of the appliances in the kitchen, otherwise you will be scratching your head. The service at Chelsea could be better. Any problems you have, when you speak with the front desk, they send someone from \"Engineering\" or \"Maintenance\" to sort it out. For simple issues, that's fine, but for bigger problems, you're facing a task. The personnel they send up are always just simple troubleshooting technicians, and no matter how much you explain the problem to the front desk or the Techs, and inform them of what you've tried already, they show up and do the same thing. After some time, my dryer simply was not functioning well. These dryers have no vent, so there is a water collection sump at the base that has to be emptied every 1 or 2 loads (note also that this is not in the manual, so look out). It turns out the dryer required a major servicing. Every time I called the front desk to tell them it was not working properly, they would sent up an \"Engineer\" who is usually an Indian or Philippino technician. He shows up, checks the water sump, and puts on the dryer. He hears it running, so then tells me it is working. After about 5 days of going through this every evening, and trying to tell him that it is running but not drying (a concept he never understood or simply did not know enough English to understand), I eventually got my secretary involved and had the matter escalated, when it finally got sorted out. There were multiple instances of similar occurrences regarding service, which was pretty frustrating at times. They offer apartments on both long term and short term stays, so the price varies a bit depending on your booking. Overall, I would say it was a good place to stay, but if you're easily frustrated with service, and / or going to be very touristy on your visit, then look elsewhere.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oslo", "Title": "“Great apartment in a central location”", "Author": "OsloKrisa", "ReviewID": "UR123259151", "Content": "The Chelsea tower is a great place to stay in Dubai, as it is close to Dubai Mall and only a taxi ride away from all attractions. The hotel/apartment complex is right next to a metro station, which is very convenient. We were upgraded to a two bedroom suite, which was a great surprise. The living room was large and there were two bathrooms and three WC´s in the apartment, so more than enough to accomodate most families. The apartment was clean and comfortable, especially since they clean your flat every day of your stay. There is a restaurant in the hotel, but it was mostly empty, so I would recommend walking to one of the many bars and restaurants in the close vicinity. Longs bar is very close and very cozy in a British bar sense of way. Most of the restaurants are in the adjacent hotels, but there is a variety of fast-food joints on the strip in front of the hotel. The apartment has a fully equipped kitchen, and there is a large supermarket just behind the hotel and it´s possible to order room service. The television has arabic and international channels, including movie channels in english. Be aware that you are not allowed to enjoy alcoholic drinks at the pool area, and neither smoke. In your room you may of course enjoy the drinks of your choice so I recommend stocking up on whatever you need at Dubai Airport Arrivals Duty Free, as there are no liquor stores available to tourists in Dubai. I would definitly recommend the Chelsea suites and might just stay there again next time we visit Dubai.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“very good location, nice apartment”", "Author": "wollienook", "ReviewID": "UR122910246", "Content": "Our apartment was very specious and nice. Enough equipment, great location and great facilities. The apartment was clean and serviced daily. Close to everything and staff were helpful. However, we did have difficulties during check-in because they had reserved the wrong sized apartment and also for check-out they tried to charge us for an extra night and booking an airport taxi was not a breeze either. Besides that though, it was a pleasant stay and if we were to come back, we would consider staying at Chelsea Tower again.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Loved our stay!”", "Author": "MarinaB2", "ReviewID": "UR122873015", "Content": "+++++++: Great location, metro within a hand reach... lots of restaurants, hotels with night bars/clubs, different shops... on the backstreet there is a large supermarket Union Coop where u can buy absolutely everything you need for cooking or anything else....pharmacies nearby... groceries....beauty salons..... Wonderfully furnished apartments....we were upgraded FOC to a 2b/r flat and it was fabulous! very cosy beds, fully fitted bathrooms, with extra toilet, good size living and dining rooms. Fully equipped kitchen, it made our stay so easy! flat screen TVs with plenty of English language channels in the living room and master bedroom. large wardrobes...beautiful tiles...very clean....daily housekeeping ------------: Breakfast in the cafeteria was not good at all...some fruit looked spoilt, and some of them were actually spoilt....poor selection of everything else....even coffee was not pleasant... so if you are looking for a good buffet breakfast, needs to find some other place... otherwise, better to buy food and have quick breakfast in the apartment.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Great Location next to Metro”", "Author": "Lee M", "ReviewID": "UR122777017", "Content": "We stayed here over New Year and were not disappointed. There were 4 adults and an infant staying in a 2 bedroom apartment, and despite the bedrooms being a little on the small side the apartment itself was very clean and well worth the money. We were given a room with fantastic views of the Burj Kalifa and ocean in the distance, which was brilliant when watching the fireworks. The staff were always extremely helpful with any requests made and the hotel location was really useful as right next to Financial Centre station so easy to get around Dubai. Will definitely stay here next time we visit Dubai", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Chelsea tower, very central and nice”", "Author": "Jeanne70", "ReviewID": "UR122652862", "Content": "Chelsea tower is a thin and very tall tower on the Sheikh Zayed road in the central part of Dubai just in front of the Dubai Financial center metro station which makes it perfect if you want to use the metro, it is also very easy to get a taxi from there and it is not far from the biggest shopping mall: Dubai mall. Another advantage of the location is, if you use Etihad airlines, their office is just there as well as the special shuttle bus which takes the passengers from Dubai to the airport in Abu Dhabi so that can be very convenient. Chelsea Tower offers furnished apartments for short let (by the day but it can be longer), from one bedroom to three bedrooms.The apartments are quite large and well equiped. The two bedrooms have a good, separated and well equiped kitchen (with washing machine, real cooker...), they also have two very good and clean bathrooms, one en-suite for the master bedroom. The decor is neutral, in shade of brown and beige but pleasant. If you come by car there is a good and big car park, the valets are very very helpful with the luggages and are used to deal with enormous amounts because some clients come with big cars and big families with lot of luggages from the emirates and countries around. There is a nice outdoor swimming pool at the top of the car park and a good gym, the public beach of Jumeira is not far away and quite nice. There is a coffee shop in the tower and lot of restaurants, fast foods (Pizza Hut, KFC, Applebees, Tim Horton cafe shop...) around. I think that Chelsea Tower is a good place to stay a few days in Dubai, especially if you want to do some shopping or for business (the conference center is not far, on the other side ofthe Sheikh Zayed road, as well as the Dubai Financial center, with beautiful top end restaurants (Zuma, la Petite Maison, Caramel).", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kuwait", "Title": "“Everything you need within reach of baby steps!”", "Author": "lizjuric", "ReviewID": "UR122648719", "Content": "Picked this place because of our budget and reviews. It was perfect. We stayed up until New Year and could watch the fireworks of Burj Khalifa from our bed if we wanted to! The metro is right in front of the hotel, 1 stop away from Dubai Mall and about 8 stops or so from Emirates Mall! Taxi rank is right in front of the hotel also and car rental next door! The staff is excellent and very friendly. We have been to Dubai several times and this lot were the BEST! We booked a 1 bedroom but were upgraded to a 2 bedroom! The only negative is the breakfast was very disappointing and like most hotels in Dubai WIFI isn't free. I think a modern city like Dubai should have free wifi! Having said that, I would go back in a heartbeat!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kranj, Slovenia", "Title": "“Good vacation”", "Author": "MarkoKranj", "ReviewID": "UR122561558", "Content": "I stayed here 1 week with wife and a child. Hotel was very good choice for its good location in the city. It is close to shoping centres and beach. Staff was helpfull.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Craven Arms, United Kingdom", "Title": "“Christmas and New Year stay.”", "Author": "autumn-dawn", "ReviewID": "UR122552174", "Content": "My husband myself and our Twelve year old daughter stayed at the Chelsea Tower Apartments over Christmas and New year. We had a Two bedroom apartment which was spacious and with great views out to the ocean in the distance. The staff was excellent and always friendly, we had a problem with a light switch and maintenance arrived very quickly and sorted it. These apartments are in an excellent location on the Sheik Zayhed Road with the Metro at the front of the hotel (right outside) and also taxis always available and very cheap. Dubai Mall is close at hand but being central everywhere is easily accessible, with pubs restaurants and fast food places within easy walking distance. I would recommend the Chelsea Towers for anyone looking for a Central location and good value accommodation.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hawalli, Kuwait", "Title": "“Very convenient for a family trip”", "Author": "Jenan2000", "ReviewID": "UR122076660", "Content": "I traveled with my husband, my 3 children and our nanny so we wanted a convenient place suitable for a family with a teenager and kids. Chelsea tower apartments was a very good choice. The location is great, just few steps to the Financial center metro station, close to everything; supermarkets, cafes and restaurants. It is in Shaikh Zayed road. Our apartment was spacious and clean. 3 bedrooms and 3 bathrooms in the 23rd floor. All rooms are big and there is a sofabed in the living room as well. So this apartment is suitable for 8 person. The view was really nice. Burj Al-Arab and the world island can be seen clearly from our apartment ( #2302). The service is 5 stars. We had a problem with our Fridge the first day and they came just minutes after calling them and replaced it. All the employees are amazing from the bellboy to the receptionists to the room service....Always helpful and smiling. There is a gym and a swimming pool on the 6th floor. The only thing I wish to change in this hotel is the small lobby. If it's bit bigger then there will be no fault in this hotel :)", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tarlac,Philippines", "Title": "“LOCATION,ROOMS,SERVICE!!!SUPERB!”", "Author": "iamatarlaquena", "ReviewID": "UR121910170", "Content": "LOCATION- just right that the Metro train doorstep ( right beside Financial Centre Station)!!! Excellent location! ROOMS- Its a hotel apartment so I had 3 rooms,3 bathroom with a dining and mini-kitchen!!! Wonderful...Rooms are so big! View of my room was Breathtaking ( I was at Room 3305)! SERVICE- that's the first thing I look for! Very Good Customer Service! If I will go back to Dubai! I'd go back to this hotel!", "Date": "December 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Accra, Ghana", "Title": "“Hotel that is what it says on its webiste - an apartment hotel”", "Author": "simonaccra", "ReviewID": "UR121846365", "Content": "Good location on Sheikh Zayed Road right by the Financial District metro. Got fast food and a selection of cafes and restaurants in easy walking distance as well as other hotels for grander dining. For a long stay (am here for 6 nights) great that it is an apartment hotel as all rooms come with a kitchen with appliances, plates , pots etc. Makes a change to cook in sometimes , even for those in Dubai on business. Supermarket is in walking distance selling basics for breakfast etc. The malls have supermarkets - Dubai Mall has a Waitrose seeling UK favourites for those that miss them and international cuisine too. Hotel has room service too along with a restaurant for breakfast, lunch and dinner. I was upgraded from a one room apartment to a three bedroomed one - so much space! For those travellng by Ethihad Airways from Abu Dhabi their Dubai 'terminal' is right next to the hotel and the bus from Abu Dhabi airport terminates there. For Dubai passengers the airport is only about 20 mins away (50 Dhs from airport, cheaper to the airport. The reception area is underwhelming and don't judge the rooms on it - but once in the rooms the apartment hotel concept comes into its own. Being able to open a window in the kitchen would be nice to get rid of cooking smells.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Muscat, Oman", "Title": "“Great Location Spacious Accomodation”", "Author": "SHVISH", "ReviewID": "UR121655081", "Content": "The hotel apartment has a great location close to the Downtown and quick access to Shiekh Zayed Road. There are a lot of eating places and access to malls and other attractions are good. The view from the aprtments on the sea view side is great specially from the higher floors. Stayed in a 3 bedroom aprtment which was spacious and comfortable. However the living room furniture was a bit old and stained and needs replacement. Explanation for the use of ktichen equipment was also not easily available and should be provided for ease of use. Net - net a decent place to stay.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iran", "Title": "“A spacious and comfortable hotel”", "Author": "ShararehMoradi", "ReviewID": "UR120854146", "Content": "The hotel rooms were very clean and spacious and had all the facilities needed. The only problem was that the hotel staff were very straight face But helpful, everything was new and the housekeeping was on time and good.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yorkshire, England", "Title": "“Very friendly staff!”", "Author": "elainep08", "ReviewID": "UR120497153", "Content": "I stayed here numerous times whilst my husband was on business in Dubai between Aug 2010 and April 2011 for a month at a time. We were supposed to be in a 1 bed appt but nearly always got upgraded to a 2 or 3 bed. The appts are spacious, well equipped and mostly clean. The lounge furniture is getting a bit tatty and could do with a good clean but overall the place is very good. The staff are very friendly and always welcomed us back even helping to carry our grocery shopping up to our appt. The pool is lovely and heated in the winter months so you are still able to swim. The metro station is very close by as are numerous hotels with bars. There's a good supermarket across the road with an upstairs clothes dept where you can buy everyday clothes at reasonable prices; especially children's stuff. I would definitely recommend this apartment hotel.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Great for the price and ideal if you want space!”", "Author": "oxymoron32", "ReviewID": "UR120066393", "Content": "I have stayed here a number of times and will continue to do so! Clean, good location, spacious and ideal if you dont like being stuck in one room as is the case with hotels! I would recommend, for its cost, quality and location!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great Value”", "Author": "Jamesti", "ReviewID": "UR119980353", "Content": "For the price, this is an excellent choice. We stayed in a 3 bed apartment although we only booked a 2 bed. Plenty of space in all rooms as well as having a luggage room. Location is great for business been on the main road, however, I'm not sure this would be so good for a holiday base. The staff were very pleasant and polite. Wifi is an extra (approx£100.00 for a week) and a bit in and out if running more than one device. We didn't eat at the restaurant as the hotel dies not have an alcohol licence! There are plenty of Hotels around though with great bars and restaurants. Longs bar serves fantastic food and has happy hour daily till 20.00, however, can get very loud and busy later on. The roof bar on the 42nd floor of the four points has great views. Overall I will definitely stay again and is great value for money.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bahrain", "Title": "“Very Pleaseant Accommodation And Would Use Again”", "Author": "Dempseg", "ReviewID": "UR119318227", "Content": "Staff very helpful, without exception. Location ideal for Metro or taxis not a problem. Pool and gym very modern and clean. Apartments large and separate kitchen had all you needed for taking care of yourself. Bedrooms en-suite with lots of storage, ideal for business and or vacation - although not on beach (to those not familiar with Dubai). Located right outside the FINANCE station. Stayed for business visiting Gitex 10th - 13th October, used metro for 6 trips to Gitex (two stations) at a cost of AED 14 only!!", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Apartment in Central Dubai”", "Author": "cynthiacalleja", "ReviewID": "UR118555343", "Content": "Visited dubai in august and stayed at Chelsea Tower which was very central. The staff were very helpful and let us check in early in the morning. They evern upgraded us to 3 room apt from a 2 room at no extra cost. Pool was very clean, and gym was very welcoming too. Would recommend this place to my family and friends", "Date": "September 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Best alternative to a hotel”", "Author": "SimChan", "ReviewID": "UR118481909", "Content": "I've been to Dubai mostly for business and in such cases staying close to work is most important. For this I found Chelsea Towers extremely useful. It's bang in the middle of Sheikh Zayed Rd and has a metro station RIGHT outside. The place is sweaky clean with spacious rooms. We've always travelled as a team so getting a suite has made most sense for us. The 2 times I've stayed here, I've had a room on the 34th floor facing all of Sheikh Zayed and it's sweeping view. You can even see Burj Khalifa clearly from here making it s spectacular view in the night. However if you're looking for a place with great food, wouldn't recommend this place. Although there are scores of options nearby including Wagamamas, Applebees & Pizza Hut. If you're looking for some authentic Arabic food then most places are again only about a 15-20 min drive away. Would definitely recommend if you want to feel like you're in the middle of all the opulence of Dubai without having to shell 1000s of dollars!", "Date": "September 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bhubaneswar, India", "Title": "“Good rooms to stay”", "Author": "BASISPRADHAN82", "ReviewID": "UR118409365", "Content": "I loved the beds.. excellent beds and room in general. Slightly away from city centre but never mind. Good cafes and eat out inside the hotel , dance shows as well .Service was not upto the mark but hey you would at times like to be left alone dont you? Lots of africans were staying when I was around. The hotel can provide taxis or can arrange for you. they can exchange money for you. Food was good with good choices. I nomally prefer royal ascot but this is slightly cheap to stay.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Simply Great”", "Author": "EuroTrav2011", "ReviewID": "UR118048573", "Content": "I stayed with my family for a week, our booing was for 2 bedrooms apartment but we were happily surprised to receive an upgrade - at check in- to a bigger 3 bedrooms apartment. The facility is very nice inside and outside, they have a multistory building for parking right on the back of the main building The apartments are perfectly located on Sheikh Zayed Road and right at the entrance of the DFC metro station. I highly recommend for families, try to get high floor apartment ....the view is amazing", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Scotland", "Title": "“Lived in the Chelsea Towers for 3 Months”", "Author": "BHoody", "ReviewID": "UR117967388", "Content": "We stayed in a two bedroom apartment on the 24th Floor room 2401. The apartment looked over Jumeriah which was very nice and we had lovely views of the world, Deria and Jumeriah itself. There are two mosques very close by which you can hear on the call to prayers, this did not bother us as it was nice to listen to. The apartment itself was cleaned on a three weekly basis however, I did my own cleaning as the staffs cleaning was not up to my standard also with two young children we needed it to be clean. The beds were comfy although the rooms were a little small, we had two bathrooms with a toilet just when you came in the door which we used as store cupboard. The apartments are very noisey and if you complain nothing is done we lived there for 3 months and would say that in this time we never got one full nights sleep and were on the telephone to security most evening complaining about noise from other guests. Just to make you away the apartments are used by alot of Arab families (big families) the children run about the hotel at all hours and they are very loud. We ordered room service on several ocassions which was good but anyone will delivery to you and the delivery service is very good. There is a shop next door called Broadway which sells everything that you need and there is also a COOP just across the road which sells everything that a westener needs. There is also a little park across the road Satwa park which was a godsend for me as I had two young children with us, however it is worht noting that the parks are only for Woman and Children throughout the week and also residents only. The staff in the parks wever very helpful and loved to give you info if you need it. The pool was also very good and the staff were lovely and helped my twins play in the pool, however again there are alot of Arab children who do not listen to the life guards and run about and cause a disturbance for everyone else at the pool. The pool is cleaned every day but there is a problem with pigeon poo around the pool area. Overall the Chelsea Towers would be ok for a short term stay but not for long term, the location is excellent as you are right beside the financial center metro stop which takes you to any of the malls or to old Dubai.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Mahboulah", "Title": "“Enjoyed my stay and will return!”", "Author": "Adelo47", "ReviewID": "UR117370379", "Content": "Firstly let me say that this is the first time I stayed in an apartment instead of a Hotel; this was like a hotel suite but at a cheaper price. The Chelsea Tower Hotel & Apartments is conveniently located near the the monorail where you can take a one train stop to the Dubai Mall or about 4-5 stops to Emirates Mall. Albeit Ramadan we still had a great time because restaurants and the hotel provided delivery - most importantly Duty Free was still available to buy alcohol; even the restaurant bars served alcohol after iftar. Service in the hotel is wonderful; from the reception to housekeeping....I have no complaints about my stay. I am looking forward to go back, still looking for a home away from home.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Very convenient location just outside the metro”", "Author": "DXBHackett", "ReviewID": "UR115838527", "Content": "We stayed in Chelsea for a month when we first moved to Dubai at Christmas, so it was practically second home (in the absense of the first!). We had a very spacious 3 bedroom appartment with 2 bathrooms (one ensuite) and a large living-dining area. It looks just like the pictures people posted so I assume they are all very similar. The view from the high up is amazing, the whole Sheikh Zayed Road is like something from a sci-fi movie... You are either facing the town /SZR or the sea, I am not sure what is more breath-taking. The facilities are very reasonable, with own swimming pool on the roof-top of an adjacent building. Not checked the gym out but it looked fine. The flat was well equipped, although we did have to ask for extra stuff like more saucepans, and we needed extra hangers - I can't fanthom how they expect a family of 4 to survive with 10 hangers between them for a month! The house-keeping was reasonably receptive and the porters super-friendly with kids. Cleaner came every day and didn't expect any tips. Generally, lower level staff were much nicer than managers and receptionists. What we didn't like: having to pay for the internet, having to pay a cash deposit at check in and the washing machine, it was a bit stinky. It also took ages to work out how to switch on the cooker, but it's probably just us! One thing to moan above - we hated the fire-alarm: it went off at 3 am one morning and we evacuated 56 flights of stairs. We were all huddled outside for nearly 2 hours, the police came and went and nobody, absolutely nobody seemed to know what's going on. After 2 hours they started giving water to kids and soon after we were allowed back into the room (around 5 am!). The children were scared there will be more arabic blasting out of the loud speakers and slept with us for what was left of the night. All together, not an experience I want to re-live again! I think they should review their procedures... They have a restaurant downstairs. We've not tried it and the breakfasts were not included but I know they do room service. All in all, very pleasant and probably cheaper than a conventional hotel.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Nice and would definately stay here again”", "Author": "vishalgoenka", "ReviewID": "UR114146363", "Content": "nice hotel on main sheikh zayed road sort of city centre. we book for a single bedroom apartment but they upgraded us to a 3 bedroom apartment for free. Very neat and clean hotel. They have a lebanses restaurants 24 hours very close 2 mins walking from the hotel which is a bonus.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Enjoyable stay at the Chelsea Tower”", "Author": "travellingwithinfant", "ReviewID": "UR108030064", "Content": "On the plus-side: the 3 bedroom apartment was great and very spacious. Downsides were: the sofabed in the lounge area was incredibly uncomfortable to sleep on. Breakfast was very average for the price. But all in all a good stay. Would definitely recommend.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Getting better all the time”", "Author": "TurboKev", "ReviewID": "UR106923648", "Content": "Now back here since January and getting better all the time. Potentially this could become home for a few years. Service levels are excellent in all areas but I must admit I don't use the cafe. Not that's a reflection on the cafe but being resident I have lots of choices. Location is great with Metro right outside and taxis cheap and always waiting for hire. View from my 43rd floor appartment is nice. Burj kalifa from the lounge and Jumeira, QEII and SZR from the three bedrooms. Extremely clean and quiet. Reception can get busy at check-in / check-out times especially during local holidays but no great problem. Gym and pool seem never to be crowded.", "Date": "May 5, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Adelaide", "Title": "“Excellent stay at Chelsea Tower Apartments”", "Author": "delasmum", "ReviewID": "UR106912823", "Content": "We had an upgrade to a 3 bedroom apartment on arrival (booked a 2 bedroom apartment) which was greatly appreciated and very clean and spacious. The staff were polite and efficient. It is a great location on Sheikh Zayed road with a supermarket nearby. The metro is directly outside which is cheap and easy to use. Taxis are also cheap an readily available out the front. I would recommend a stay at this Hotel.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Happy Memories”", "Author": "VashdevBajaj", "ReviewID": "UR104526426", "Content": "Honestly when I read the reviews and saw the pictures of the hotel, we were expecting a decent looking, but since we wanted to stay on Sheikh Zayed Road hotel it suited us . It turned out to be better than we expected it to be. Great location, Public transport was a at your doorstep ( Taxi & metro ).. As I was with my,wife and one more couple ( close fiends ), we had opted for a two bedroom apartment. The master bedroom was great, but the second bedroom did not have an attached bathroom ( it was across in the passage ) . That was the only hitch for us. It also had a powder room in the living room. Staff at the Reception, House keeping, Bell Desk, Security and the Restaurant was helpful and friendly. Never ate at the hotel so cannot comment on the food. If you compare its tariff with other hotels in the vicinity in the 4 star category its a GREAT DEAL. If only the second bedroom had an attached bathroom ( since this was important in our case ), would have been perfect and scored a 9/10 but because of this shortcoming would give it a 8/10. All in all we have come back with happy memories with a desire to go back soon.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“This hotel..... OMG”", "Author": "killbot2000", "ReviewID": "UR103759634", "Content": "THE nicest hotel I have ever stayed in, the hotel itself practically made the holiday. We flew from Dublin to Abu Dhabi on Etihad about forty mins away from Dubai but fear not Etihad provide a free shuttle service from the airport to Dubai and it leaves you right outside Chelsea Tower we didn't realize this till we got to Abu Dhabi (the shuttle doesn't go anywhere else jut Abu Dhabi airport to Chelsea Tower). With the time difference we were quite early but the hotel staff made a call and let us check in early about 8.00am we had mentioned to the staff that it was our first time in the UAE and I think they upgrade us because the apartment was beyond amazing we were on the 43 floor there were 3 bedrooms, a living room, a kitchen and 2 bathrooms and the views from the room were some of the best I've ever seen from a hotel. It was so good we are afraid to go back because our expectations are so high. Good location aswell there is an elevated train system running up and down takes you to a lot of places goes to DXB airport aswell i presume most people would be coming from there rather than Abu Dhabi.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Muscat, Oman", "Title": "“Only hotel to charge for ice?”", "Author": "ChrisSakhalin", "ReviewID": "UR98199977", "Content": "We recently stayed at the Chelsea Tower on a visit from Oman. The location is quite good as is near metro stop and has some eating possibilities near by. There are a lot of apartment and only a tiny reception area so expect it to be crowded. Rooms are ok. Could be cleaner but they are a bit old so somewhat worn. But it must be the only place I have had to pay for ice! Not expensive but I guess it's the principle. Pool is ok and was quiet when we were there even though the hotel was full.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Excellent .... best decision while on a shopping spree.”", "Author": "Arabian_Quest", "ReviewID": "UR94506878", "Content": "Since we were travelling with two infants, I and my wife did a lot of research before choosing Chelsea Tower. We got mixed reviews from different website but experienced an excellent and courteous service. The staff was well trained and well mannered, and knew how to deal with customer requests. Its just that one should give respect to service level guys, when he/she expects the same from them. The apartment given to us was in the mid level floors (25th) yet had excellent views Burj Khalifah from one of the bedrooms. The kitchen is well maintained with nearly all the accessories one may need while on a leisure trip. Above all, the location is in middle of Dubai and right opposite to the Metro station, though we only used taxis, which aren’t as expensive as in some other countries. I had an excellent experience and would recommend it to all who travel for leisure/touristic purposes.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Writing as a Long-Term Guest”", "Author": "mfandrew", "ReviewID": "UR82956193", "Content": "The staff at the Chelsea Tower, starting from the Front Desk, to Consierge and Bell-Hops, to Housekeeping, Engineering, Gym, etc. are first class and incredibley guest-focused. I have been staying at the Chelsea Tower Hotel and the entire staff, every single person, has made me feel like they are my family away from home. Courteous, respectful, efficient and guest-focused. I am very impressed and very grateful to the staff.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saudi Arabia", "Title": "“Good location, nice facility, not well maintained”", "Author": "expatrick", "ReviewID": "UR81131436", "Content": "We spent three nights last weekend and were upgraded from the two-bedroom unit we reserved to a three bedroom with a a view of the ocean from the 26th. floor. the location is good, since it's close to the transit system and a grocery store that sells bacon (a big treat for us since we live in Saudi). It was nice to have our own rooms and a full kitchen to make breakfast. The health club and pool are also good and very easy to get to. We noted several things in the room that were broken or not working properly. In all fairness, I didn't complain, as I feared they would send in a team of repairmen in during our stay. The parking garage is also very narrow and difficult to manuver but they offer free valet service so you can have them park for you.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stavanger, Norway", "Title": "“7 weeks at Chelsea and I could write a book...”", "Author": "gregas", "ReviewID": "UR78534133", "Content": "I stayed at Chelsea Tower Hotel Apartments for about 7 weeks from early July to mid-September 2010 for the time of my work in a financial company in Dubai, United Arab Emirates. Upon arrival on July 1st, I was looking for a two bedroom apartment near Dubai International Financial Centre / Sheikh Zayed Road. The HR of the company I was working for provided me with a list of corporate agreements for employees in Dubai office. Chelsea was one of them and since my other friends were already staying there, the location was very good to my work and also the room we were offered was satisfactory, we accepted the offer, despite some preliminary doubts. Let me take this step by step. -Reservation Our contact person at Chelsea, Mrs. Mamta (Sales Director) was very kind to provide detailed information about the property, what it has to offer and about the 'very good offer' she can give me as a employee of a valuable company that Chelsea has been cooperating since its opening in 2005. We ended up paying 480 AED per day = 102 EUR (based on a monthly rate of 14.500 AED including internet). Despite declaring at the beginning that we would like to stay for 7 weeks, we were only offered the rate of 480 AED pr day for the first month, and thereafter a rack rate based on a shorter stay, which turned out to nearly 800 AED per day, so nearly a double of what we would have to pay for the first month. Mamta offered us to switch to a one-bedroom for the remaining time of our corporate stay in Dubai. Just to make it clear: me and my colleague from the company should share the same bedroom for 3 weeks to get the same price of 480 AED. Not only was it ridicolous by this lady that pretends to be a professional sales agent, but it was also directly offensive. Since we were running out of time and were exhausted by going from hotel to hotel in the 50 degrees C heat, we ended up booking the two bedroom apartment for one month. Once the time of the reservation was getting close to its expiry, i again asked Ms. Mamta if we can get it extended for the same rate, to which she replied that it is not possible since the hotel is having high occupancy (very doubtful since it was mid summer with temperatures hoovering 60 degrees C and a quick search on Chelsea's website showed me a wide availability, so a clear lie) and that she cannot do that. I was literally so fed up of this person that I considered finding another hotel, but since I was leaving then for a 4-5 days trip to Lebanon and Syria, I took the step of complaining to the CEO of the company I worked for and had it not been for action from my supervisor, Ms. Mamta had not approved it, but in the end, I received this very comic e-mail that it is NOW possible to offer us the same rate which previously it was not. Draw your own conclusions. I call it for very unprofessional behaviour. -Room We were assigned a two bedroom apartment on the 42nd or 43th floor (cant recall it precisely), but immediately after checking in I asked for a new room, as the air coming from the air condition in this room was very humid and it was not smelling very well. It may have most likely been due to the fact that it is July in Dubai, the warmest month of the year, and since that room was at the altidute of around 200-250 meters, with the hot wind from the desert blowing just outside the window and temperatures peaking at 60 degrees, the Air Condition may have taken the suffer of it. We were given another room (4601) on the 46th floor. The room itself had an amazing view, facing the North-Eastern side of Sheikh Zayed Rd and to the North we could see Dubai World in its full shape, an amazing view to wake up to and also to fall asleep by. Amenities in the room were as expected, the huge LCD (42'' ??) TV in the living room had some issues with its quality, not sure if the provider was to be blamed. We had two bedrooms, one master and a second one, both with their private bathrooms. The bathtube had some marks of being used for 5 years, the kitchen had all amenities one needed. Said in one sentence: the apartment had everything one could possibly need for a longer term, from pots, cutlery etc. There is however one important issue that the hotel should work on: internet connection: ridiculous that it is wired, so no wireless is offered and to get wireless we had to 'rent' a router that looked like a time machine from late 1990's, the wireless router was unsecured, thus anyone in the vicinity of our room could log in to our wireless router and eat up the bandwith of our internet connection, for which you have to pay extra by the way. We were also asked to pay extra for the router (300 AED +/- 75 EUR for one month) something we refused. The wireless was in the end not used that much, as it was insecure, very slow and the connection was breaking down very often. The IT manager, when I asked to see him, behaved like the General Manager of the hotel and were talking to me like he a man \"that orders a pizza on the phone and asking for 5 min deliver\", mean and unpolite. The issue remain unsolved. -Service After speaking to several employees of the hotel (more than 5-6) and after living at this hotel for 6-7 weeks I can say that the staff is well underpaid (paying housekeeping 200-250 USD per month in Dubai, accommodating them in a labour camp where they share the room with three other people working in Chelsea) you cannot expect full and top service from them. The concierge ltierally does not exist at this hotel, although I do remember the thin Indian boy in the lobby that always was smiling and whenever I asked him to post some letters for me, he was always very helpful. I cannot really say that the front-desk staff were efficient and they always gave me and my collegaue the look like \"you corporate customers staying with us for a long time become from time to time a 'pain in the a**' as it is commonly expressed in the USA\". The food at the restaurant was not of top quality, although the people there were friendly. I do not expect and I actually do not like fake smiles from hotel employees but when you live at the same place for so long time, it would be at least descent by the hotel staff to be a little more polite. I had several unnecessary argues with the laundy service about the costs since someone there clearly does not know how to use the calculator to count the proper cost. There were however people that were nice, the housekeeping staff (I think one was aged 20 or 22 when I asked him how old he was and the second one was a bit older 27 or 28) were always nice when we saw them, although they were cleaning the room when we were at work. The cleaning service of the room was done remarkable. -Valet Parking Living in Dubai without a car is really difficult, so I decided to rent a car for one month, a Ford Explorer. Valet parking was efficient, they never crashed the car, although at some point I was glad to have a full insurance on the car in case that would happen. One comment here that of 40 times I called the front desk and security to bring the car down from the parking house and have it ready by a certain time, in about 20 times this was never done and several times I was late for work because of this. -Pool / Gym Pool was always occupied by screaming kids, in most cases from Saudi Arabia that clearly were raised with different norms, since they disregarded other people in the pool. I tried swimming twice, but then gave it up. The gym was functionable, never full, the equipment was slightly out-dated, but then if you want to do some work out in the air conditioned environment, you dont really have an option when its 50-60 degrees outside and where you will be de-hydrated after 10-15 minutes. -Pro's - Con's Main + was the room, the view, the location. The - is high price, unpolite reservation representative (sales director - Ms. Mamta) that should learn the basics of working in the hotel business and especially since this is Dubai. Other - is relatively poor service, mistreatment of the staff (read: underpaid) The biggest minus however is a severe security breach of the hotel's front desk. While I was on a four day trip in Lebanon, I received a call from my friend that was asking me where I put the book I borrowed from him. Apparently he asked at the front desk for a key to our apartment stating that he knows me and that he is a friend of mine and they just gave it to HIM !!! If I would be the General Mananger of this hotel, I would seriously consider some proper training of their employees done by the HR. Overall I would NOT recommend this hotel due to points stated above.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Very good for a long term stay-3 months”", "Author": "TurboKev", "ReviewID": "UR78106343", "Content": "I was recommended here by an old friend. Convenient for the metro and malls etc. Very clean and hte staff attentive. Valet parking (free) is handy after a long day and the pool etc very clean and new gym equipment is nice. The on site restaurant only average but there are 30+ outlets ranging from coffee bars to high end eateries in walking distance. Taxis always available by the metro station (100mtrs walk) and cheap.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saudi Arabia", "Title": "“A nice stay at Chelsea Tower”", "Author": "emeyg", "ReviewID": "UR73211472", "Content": "We enjoyed our stay at Chelsea Tower very much. The metro station is exactly infront of the tower and mini market is nearby. Pizza Hut and Apple Bees are a few step away. The aminities at the tower are very good. The apartments has a safe box, washing machine, a dryer, dishwashing machine, a microwave, a toaser, a coffee making machine, a referigrator and a freezer, cooking utensils and a water boiler. You just need to bring some stuff for the kitchen like a small towel to wipe the table, washing detergents for dishes and clothes. That's all!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Far Away", "Title": "“Family Friendly!”", "Author": "IluvMalaysia", "ReviewID": "UR61610010", "Content": "A great place to stay when you are a group, family or looking for space and apartment qualities. I'm late to put up this review. For this American in the Middle East who loves to travel to Asia I really would recommend this place for all. I actually have sent friends to see for themselves. I traveled with my husband and 12, 8 and 4 month old. It was easy to get to on Sheikh Zayed Road. We had Applebee's next door and Nando's close by. A grocery store behind us. The malls weren't too far. It was a great location. We had a car of our own but the metro was down stairs. The 2 bedroom was spacious and well kept. The housekeeping, who were men (I've only seen this in the mid east) did a good job and were nice about leaving extra towels. The kitchen had a washer/dry, dish washer, stove/oven and a full fridge. The dish were was complete and well taken care of. Toaster, Electric water kettle, microwave. We had a nice view of Sheikh Zayed which kept the kids busy watching the monorail and cars. LOL! The couch in the living room pulled out into a bed. So we had alot of space. It was quite nice. The beds were clean and crisp. Only complaints, in the bedroom the air vent faced the head of the bed which made me stuffy. The pool was a walk to get to and dh and dd didn't like that. Otherwise, a great experience for this growing family. Hope this helps!", "Date": "April 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Basingstoke, United Kingdom", "Title": "“Very comfortable and well equiped self catering appartments”", "Author": "Travellingbunch100", "ReviewID": "UR59109447", "Content": "We travelled to Dubai for a period of 10 days with our 6 and 8 year olds plus 2 friends. The hotel was in a great location with many of the popular attractions being only a short taxi journey. It was well equipped, reasonably clean (I am a little on the OCD side!) and was plenty big enough to accommodate 4 adults and 2 children. The pool was a good size, very clean and amused the children for hours on end.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Clean, Bright Apartment - Great Accommodation”", "Author": "BeHappy65", "ReviewID": "UR57425439", "Content": "Located on Sheik Zayed Road. Staff were really helpful, we were able to check in 6 hours early, as I flight landed during the night, we got to the Apartments at 4am in the morning and they let us check-in at 6am - that was really great of them. Apartments are based near lots of eating places within walking distance and there is also a supermarket nearby which you can walk to as well. There is a swimming pool and steam rooms, lifeguard on duty at swimming pool at all times. The pool closed at 10pm which we thought was too early really, as when you are on holiday you want to have access to the pool at all times. We found all the staff really friendly and very helpful and room service was very good as well. You can use the hotel taxis (these are more expensive) or just walk to the road and taxis are plentiful and cheap. We got taxis everywhere we went. The price for these apartments is quite steep tho. Good location everything was just a short taxi drive away. Would definitely stay there again, if I got a special deal with them.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Tiverton, United Kingdom", "Title": "“Important info”", "Author": "mazjohn", "ReviewID": "UR36465879", "Content": "Please note the info on this site is not correct!! The map shows the location of the Chelsea Tower, not the Chelsea Gardens. Chelsea Gardens is located in Discovery Gardens, near Jebel Ali and close to the Ibn Battuta Mall. There is nothing wrong with this location but it is much further out of downtown than indicated here. I should know - I used to live in The Gardens and watched Discovery Gardens being built!!", "Date": "August 2, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Dirty, Dull and Tired and that's just the ladies of the night..the hotel was worse!”", "Author": "LondonWorldexplorer", "ReviewID": "UR31957014", "Content": "From the moment we had booked this hotel, we knew we had taken a risk as none of had stayed at this place before. It seemed cheap for Dubai and in a good location. However, from the moment of arrival to the departure our holiday was ruined. The hotel placed us in smoking rooms even though we requested non-smoking due to one of the group being severely asmatic. We also requested rooms above the 4th, this request was also ignored until we decided to complain. At this point we hadn't even checked-in!! The rooms were poor, in every aspect of the word. The decor, the bed, the bathroom, the security, the TV, and even for a bunch of backpackers..this was too much! I would be very careful of using the Safari group this hotel recommends as one of my friend nearly died on the quad biking event! There is NO health and safety code, you simply are given the keys and off you go!! I would never recommend this hotel to any of my friends or family, so please consider an alternative before you book! The Lotus hotel across the road seemed much better.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mumbai", "Title": "“Excellent Stay in this hotel with family”", "Author": "hipposcuba", "ReviewID": "UR30502109", "Content": "This is perffect place to stay with a family. I was with wife and 10 and 6 year old sons. The apartment was a 2 bedroom, HUGE! (larger than homes in Bombay!), had the works. Large living and dining area, bedroom with twin beds for kids, and master bed with queen bed for us. 3 bathrooms, and the kitchen. Man....Stove, oven, micro, fridge, deepfreezer, washing machine. What more do you need with kids, morning milk, evening snacks etc etc. Perfect. Located on Sheikh Zayed Road and central (too bad the metro rail work blocks the front) but we got taxis on call, and were close to the malls. In fact the metro stop is RIGHT THERE. Next time, I have to go up and catch the metro. The staff were friendly, breakfast was good. Its a must for business execs and families.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Loved this hotel”", "Author": "tbabsLondon", "ReviewID": "UR21548870", "Content": "I stayed in this hotel with my partner from 22October-27October 2008.The price for the is good for the services.We book 1bedroom apartment and end up in 2bedroom,very clean and tiding apartment.if you need to use internet everyday you need to think about the price as its AED110 per day,AED40 for an hour and AED30for half hour in this Hotel.there is internet cafe at the printing shop 5minutes from the Hotel.This Hotel is in good location on the service road on sheikh zayed road very close to many clubs,bars,shopping centre and business offices.The loaction is excellent.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“A Good Value For A Centrally-Located Apartment”", "Author": "whereisjennifer", "ReviewID": "UR20153275", "Content": "We have stayed at the Chelsea Towers several times. I would not consider it a full-service hotel, but rather an apartment-hotel with some front desk assistance. The apartments are comfortably furnished and spacious (try to get one higher up for a very nice view of the city & gulf) but not overly ritzy. It is very convenient for a family or friends traveling together. We do have a baby, and the tile floor was not particularly suitable for her. The pool area is very nice and has plenty of shelter from sun/wind. The location to all of Dubai is excellent, as it is centrally located. Dubai has world-class traffic, so location is everything. There are a small variety of acceptable restaurants within walking distance. Big tip: if you need a taxi for a specific time (or a large taxi), come downstairs early - don't just call down & order one! It will likely not be there when you come down. Don't expect full service here - just expect plenty of elbow room and a good location. Dubai hotels are VERY EXPENSIVE, and we have found this a suitable choice.", "Date": "September 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Wonderful Place to Stay”", "Author": "Rnka", "ReviewID": "UR14988380", "Content": "We stayed at this hotel for a week and had a wonderful time. The staff was very friendly, got upgraded from a one bedroom suite to a 3 bedroom suite. Spacious kitchen, very clean rooms. I would absolutely stay here again and its wonderful for those who have kids.", "Date": "April 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eindhoven, Holland", "Title": "“To mr Yesser, the respectful restaurant manager”", "Author": "mataleo", "ReviewID": "UR14307681", "Content": "We stayed from 11 till march 13 2008. We had to work for the Fiteselektor event The staff was very good and the rooms are very okay. The food from the restaurant was very good. Thank you for having me / us. Leo [--]", "Date": "March 15, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Highly recommended”", "Author": "andybr", "ReviewID": "UR13958739", "Content": "Stayed there over Christmas 2007 and found the whole experience excellent. Was in a 3 bedroom appartment (for family of 5). It was huge. All the 3 bed appartments are above the 25th floor (we were on 29th). We had a sea view. Room service available from the cafe on the ground floor - no alcohol. But food service very quick. You can have breakfast in the cafe as well. And amazingly it is not a rip off given the captive audience. Pick up a menu from the cafe and take it back to your room for ease of ordering. Eating out is also easy as you can walk to 10 restaurants within 5 mins (including the 5 star Shangri-La where they do an excellent fixed price buffet meal). Room (maid) service good. It is really an appartment block with some communal facilities but really didn't miss the facilities of a true 4/5* hotel. No big lobby to stroll around in etc but then we were out most of the time. Excellent valet parking set up if you have a car with you. Everything very new and very modern (style). Kitchen equipment a bit basic - really geared towards eating pre cooked food rather than cooking for your self. But good sized fridge and freezer. No noise issue on the 29th floor! Pool/sauna good but not exceptional (and outside of course). Small business centre if you need Internet access (you can buy it for 30 mins if you want). Ethernet in the room if you have a laptop with you.", "Date": "March 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ljubljana", "Title": "“Great hotel - even better service!”", "Author": "nejcusa", "ReviewID": "UR13642266", "Content": "The hotel is great!!! The rooms are large (we had an apartment with 3 bedrooms, living room, kitchen, 3 bathrooms). Very good service in the entire hotel! Great location as well!", "Date": "February 18, 2008"}], "HotelInfo": {"Name": "Chelsea Tower Hotel Apartments", "HotelURL": "/ShowUserReviews-g295424-d566082-Reviews-Chelsea_Tower_Hotel_Apartments-Dubai.html", "Price": "$110 - $353*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Sheikh Zayed Road</span> | <span class=\"extended-address\">PO Box 118049</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "566082", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/48/75/19/getlstd-property-photo.jpg"}}