{"Reviews": [{"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“cheap, clean, safe, but not that comfy...”", "Author": "Phoenix_ArizonaCorey", "ReviewID": "UR115966552", "Content": "Great safe location for a great price!” The location was great, 1 mile walk (25min) from Zona Rosa, 5 Minute walk to metro and Reforma, Between 10$-20$ taxi ride to the airport! all around awesome! HOWEVER!!.... The room we got was a standard King room... the bed was extremly weird since it was two twins stuck together, whenever my boyfriend tried to cuddle me, he fell thru the crack. The bathroom was 1 star... no tub, tiny bathroom, only soap given, very uncomfortable shower and towels. NO view whatsoever. No breakfast, no business center, however wireless Internet is free. I would not recommend this hotel for anyone other than people needing a budget clean place... Definitly go to Chapultepec park, and go to the Zona Rosa and Condesa for good bars. Dont go on a tour group to the pyramids, as you can rent a taxivan anywhere for up to 7 people for around $80 USD a day including driver and he will wait for you there!", "Date": "July 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Oaxaca, Mexico", "Title": "“I always read the reviews but THIS HOTEL made me write my first one”", "Author": "mitzelm", "ReviewID": "UR95617857", "Content": "The only reason I booked this hotel was because it was close to Reforma Ave.,and because it offered breakfast. For the same price I could've booked the Radisson Flamingo. (33 dlls plus 2 kids and taxes 58.60 per night) But i chose this one....BIG MISTAKE. First of all it's one block from reforma...but that street is under constuction so you have to walk around and it can be quite dangerous at night especially with kids. At check-in I asked the receptionist about breakfast and she told me it was from 8-10. So the next day I arrived there and she said they didn't have anything to eat.... She knew all along.....I could tell in her face.... I guess they don't serve breakfast on sundays, but when you make a reservation it doesn't say that. .and they didn't refund the extra I paid for the kids' breakfast. I was furious I asked for the manager but I guess no one works sundays. We had no option but to go to the closest store, grab some milk for the kids and cofee, and on my way back I gave her the receipt(7 dlls) The next day they gave me my $7 but this episode almost ruined my vacation. My family lives in Mexico City told me that for under 50 dlls the best hotel would've been 'El Ejecutivo' on Reforma. So PLEASE read the reviews!!!", "Date": "February 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cabo San Lucas", "Title": "“terrible place”", "Author": "uncleho69", "ReviewID": "UR78057714", "Content": "we booked a room and got the \"garden suite\" which turned out to be a dark hole on the ground floor behind the recepcion desk with a window looking onto a concrete wall of the next door building. we arrived late and tried to settle in for the night ...........but the two seperate beds that we had where so hard that none of us could go to sleep,at 3 am I went to the recepcion to ask if they had another room with diferent matresses,the girl told me to check in the morning after eleven there would be check outs and we could choose another room after a torturing 6 more hrs we got up and really saw where we had landed,the room was a dump with stained carpet and walls a tiny bathroom with towels so thin that the morning mist made them drip with water and one tiny piece of soap. going back to the front desk the girl attending had changed shift and we found another friendly lady who told us the Hotel was booked and there would be no room change possible - we left even so we had 4 nights paid in advance there was no offer of reimbursement or anything I definatly do not recomend this place.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“I hate their \"in your face\" attitude”", "Author": "286", "ReviewID": "UR65780371", "Content": "When I checked in, I was told that the price is 30 dollars per day. Then one day when I walked out of the lobby, they asked me to pay 35 dollars per day. I argued that on hotels.com, the price is only 30. I showed them the website using my phone. It turns out that the final price on hotels.com is 38 (including tax and fee). After see this, the staff insisted charging me 38 instead of 35, and her argument is that \"You like Internet price, and I am charging you the Internet price\". What's more. Though the quotes were in terms of dollars, they charged me in pesos, and \"their exchange ratio\" was in their favor", "Date": "May 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“so many lies”", "Author": "atulgandecha", "ReviewID": "UR31064779", "Content": "there was no concierge. Had to store our luggage in the toilet after we checked out by ourselves. it was insecure and no help was given in bringing our luggage down . The receptionist did not speak English . The food was terrible", "Date": "May 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mexico Cty", "Title": "“A Great & Inexpensive to Stay”", "Author": "Grandmasharpe", "ReviewID": "UR28094467", "Content": "I stayed for one week. My room was very clean, employees very helpful and the location super. Walking distance to Bellas Artes and Centro Historico and Zone Rosa. A short bus ride to Cahpultepec park. There is a shopping mall with-in a short walk. If one is in Mexico City for any length on business the rooms are equipped a small refrig. two burner hot plate and micro-wave. The rooms also have eating utensils. I defiantly stay again.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Jerusalem - Israel", "Title": "“Bad Hotel”", "Author": "AminJerusalem_Israel", "ReviewID": "UR18445918", "Content": "We were a group of 4 people. We stayed our last night in Mexico in this terrible hotel as we returned from Acapulco. When we arrived there, the hotel looked very bad even before you enter there. Don't look at the photos in the internet because I think that they were taken when the hotel was new. The hotel was under renovation when we were there. The smell of the paint was very bad. Also the smell of the carpets in the room was very bad, and we found cockroch the room. Also the bathroom smells very bad. Towels were very thin and there was no shampoo in the hotel. Our reservation was for two double rooms and they were not able to fulfill this, so they gave us a triple room and a single room. In addition to that, the staff don't speak a single word in English. We wanted to book a Taxi to go to the airport. The staff didn't understand what we want and they were not able to help us. I went to a close hotel to help me in the Taxi reservation. Simply don't go there. Believe me it had been very bad experience. You can contact me if you need further info. amin_tabri@yahoo.com", "Date": "July 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Great Location”", "Author": "Uhrichsville", "ReviewID": "UR12854586", "Content": "My wife and I stayed at this hotel from Jan.13-19, 2008. The hotel is very basic but very clean. They gave us fresh clean towels everyday and the water is very hot. We had a junior suite which included a fridge, two hot plates, a micro- wave and a sink. The room was cleaned everyday. The location was excellent. One block to the Reforma and Insurgentes crossroads. Bus transportation was excellent, however make sure you have change. We walked to the Zocala but we en;joy walking. To Chap. Park is quite a hike. Take a bus, walk under the bridge and you will be there. GREAT PARK. There is a little store on Paris and Madrid for little things. There is a ragged old man who hangs around the hotel. He gives good advice and speaks fine English. He is harmless but is a gentleman. There are resturants on Paris that serve decent meals for a decent price. Don't expect breakfast before 9:30. The counter people in the hotel speak some English. Learn some simple Spanish before you go to Mexico City Enjoyed but was careful!", "Date": "January 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "charlotte", "Title": "“avoid the food there”", "Author": "georgeofthequeencity", "ReviewID": "UR8239855", "Content": "This is a modest hotel. Very basic but also very clean!! However, the food service on site is HORRIBLE. The food is simple and the price higher than they advertise on site. Good simple hotel ( do not mind the pictures this is a SIMPLE hotel). Avoid the food on site.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pasadina", "Title": "“great locations”", "Author": "mishelleita", "ReviewID": "UR8041275", "Content": "I stayed at Casa de la condesa Reforma for 1 month , it is a very nice hotel with a great location , just 1 block from the main Av Reforma ,so you can walk easy to all the places. The rooms in the hotel are very confortable ,very clean and they have free internet access with high speed, that was perfect for me. The staff is so friendly and helpful , they realy make me feel great.", "Date": "July 2, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Roma", "Title": "“usable only for the cheap rate”", "Author": "pissenti", "ReviewID": "UR7568934", "Content": "The only positive note in this hotel is the face and the friendness of the front desk chica. This hotel is usable only for its \"cheap\" rate applied, and for one or two nights. The breakfast is very very poor, do not use it, go outside. The hotel position is good ma the taxi driver was in difficulties to found it. I'll not use it again and not suggest to other.", "Date": "May 9, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Canadian in NZ", "Title": "“Casa de Condesa Reforma”", "Author": "pebblesbanban", "ReviewID": "UR7477386", "Content": "Well we are from Canada and we were travelling throughout Mexico on our way around the world. We stayed at this hotel for two seperate nights as it was a cheap alternative and close to the center..well its a good walk but i think its in a good position. The people at the desk are accomodating and so are the ladies who clean the room. The rooms are ok. The kitchen is very basic not many cooking utensils are available. The beds are comfortable only i began geting itchy. It also can get a little cold at night. The bathroom is basic and the shower head was a little annoying. But overall not bad.", "Date": "April 27, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Great little hotel!”", "Author": "diannejt", "ReviewID": "UR5354528", "Content": "We were very pleasantly surprised by this hotel. We picked it because we got a good deal online but were a little concerned about being in a \"cheap\" hotel in Mexico City and figured we could just change to another hotel if this one was bad. We ended up staying longer than we had booked for because we liked it so much. It was clean and cute with a nice little cafe in the lobby and Mexican decor. Our junior suite had a basic, but nice little kitchen & living room, and plenty of room for two (separate bedroom which was great, though the layouts differ from room to room). The carpet was brand new in our room and everything was clean. There was plenty of hot water, cable TV, and huge closets (though, oddly, no coathangers). The staff were friendly and extremely accommodating. Our Spanish is dreadful but the staff had a great sense of humor about it and were able to help out with some English (depending on who was behind the front desk at the time). The location is great--very central. The immediate surroundings aren{t that nice (not awful but nothing to write home about) however it is only one block to Reforma (the big main street cutting through the city), a 10 minute walk to the Zona Rosa, and a 20 minute walk to the historic downtown area. If you don{t like to walk, a Metro station is nearby. We found the location ideal. I wasn{t worried about the less than perfect surroundings since it isn{t wise to walk around Mexico City at night anyway (it was fine during the day). Cabs are cheap and can drop you right at the door after dark. The front desk will happily call a taxi for you. I would absolutely recommend this place, especially if you are on a budget and/or you like to have access to kitchen facilities. We will stay there again the next time we{re in Mexico City.", "Date": "June 16, 2006"}], "HotelInfo": {"Name": "Condesa Reforma", "HotelURL": "/ShowUserReviews-g150800-d567128-Reviews-Condesa_Reforma-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$45 - $60*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Madrid 5</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06030</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "567128", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8b/d1/8bd1070022282ad97ef91c2ef3bf5bee3large.jpg"}}