{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Redditch, United Kingdom", "Title": "“The WORST hotel experience...ever!”", "Author": "Hudson_TD", "ReviewID": "UR125145732", "Content": "This is a belated review since I have only just discovered TripAdvisor! I wish I had known about it before. A trip to Paris is an unforgettable, wonderful experience. A trip to the Hotel Antin Saint Georges is unforgettable for completely different reasons. To summarise; this hotel is dirty, dusty, poorly equipped, dangerous and noisy. The location, albeit, is mediocre. Everything else, however, is simply dreadful. You may think as we did; \"well, we are only going to Paris for a few days. It doesn't matter where we stay - we don't intend on spending much time in our room.\" Right? Wrong! Every second in this hotel is a dismal one. Worst of all, perhaps, is the team of staff. They are rude, not slightly interested in helping you and the maid will shout at you at 8:30am and tell you to leave (in a language which was neither French or English). To provide some specific detail; the corridors were almost pitch black. I tripped over the stairs several times. There is no elevator at the Hotel Antin - there isn't light to guide you up the stairs. The hotel room was approximately the size of my shoe. In this hotel room were blackened, burnt walls, a broken mirror (which had been fixed with gaffa tape) and a broken front door and bathroom door. Nothing makes you feel safer. The only redeeming quality of this terrible hotel is that it is located directly above one of the main metro lines in Paris. This may appear to be a wonderful thing when you are concerned about getting around. Do not be fooled! The train going past every fifteen mintues is not a Godsend. It is not a convenience. At two, three and four in the morning it is anything but a convenience. The breakfast did not appear to exist. Seriously...a bowl of cornflakes? Is this the kind of breakfast you would expect? No, I think not. I am very much looking forward to returning to Paris. But mark my words - I will not be returning to this hotel. Stay away - it is not worth a euro!", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Newbury, United Kingdom", "Title": "“Don't know where they've got the photos from”", "Author": "Turnipatron", "ReviewID": "UR121651759", "Content": "Stayed here back in July (bit late for a review but at least it is an honest and not heat of the moment one). Hotel is fine to stay in for one maybe 2 nights. Location is spot on for the Pigalle (moulin rouge) area of Paris, and not too far from Montmatre. There is a Metro station literally 30 seconds walk from the front door. Breakfast was OK, (bread, butter, jam, hot drinks and a bit of cereal) Price considering the general prices of central Paris wasn't too bad, but not good enough to make me stay again! Negatives were that the photos were NOT the same hotel. I genuinely don't know how they have gotten away with that! Regardless we ended up with a room with two beds which meant it was massive, so good thing there, but floor was covered in old blackened chewing gum, bathroom was small, damp and you felt less clean using it! No view whatsoever (literally a view of a wall 20 cm on one side and the pipes and back of the building on another side. Generally OK for a one nighter if you are out seeing a show where there will be plenty to drink, other than that consider elsewhere first in my opinion.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Hole in the ceiling”", "Author": "yentihw y", "ReviewID": "UR119893051", "Content": "Concierge did not offer maps or any other touristy information. You have to give your key in every time you leave the hotel 'for security reasons'. There is a lift which is nice if you have heavy luggage. It's a good location, 10 mins walk from Moulin Rouge and Sacre Coeur. Lots of brasseries to have breakfast at. Do not waste money on the hotel's breakfast. The room was ok, a decent size, but there was a gaping hole in the ceiling with exposed wires. The street noise was horrendous and it was hot but because of the noise, we couldn't keep it open. You could hear anyone wearing high heels coming from a mile away and car sounded like freight trains. The room was very clean and the pillows were good. Our bed sunk in the middle so I spent our 3 night rolling my husband back to his side of our double bed. The price was right though, and we didn't spend a lot of time in our room in the end.", "Date": "October 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“We have seen worse, location and price worth it all”", "Author": "HeartinNature", "ReviewID": "UR115887334", "Content": "Going into the room made us cringe but we have seen worse and it wasn't as bad as we had feared (going by the reviews of other tourists). The room was dark, one double bed was awful that it sunk in the middle and the floor was uneven. That was the worst. The better aspects were that though the rooms did not have tea coffee making facilities, they filled our flask with hot water, the reception staff spoke English and they provided breakfast (though expensive and without eggs). The location of the hotel just next to the metro was a life saver.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "capnhist", "Title": "“Meh”", "Author": "capnhist", "ReviewID": "UR115360451", "Content": "Stayed here late June 2011, and I wasn't all that impressed. It was a fairly middle-of-the-road place without anything particularly bad, but nothing particularly good, either. The sleeping area was small but the bathroom was quite large by Parisian standards. The front desk staff were friedly enough. The best thing about the hotel is easily its location -- It's within a 10 or 15 minute walk of Sacre Coeur, and 30 minutes on foot from Gare St. Lazare.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Top location, save your money and stay here!”", "Author": "klingadvisor", "ReviewID": "UR113375917", "Content": "My partner selected this small B&B just on the outskirts of the bustling city center and I must say in terms of location, this is a perfect choice for this who wish to save their pennies (or euro’s) and be within a short train ride from many of the city’s top attractions. Upon arrival sliding doors opened up into a fairly swanky foyer, but the remainder of the hotel really justified the fee we forked out for this, not that we minded at all! The receptionist was courteous, extremely efficient and stored our baggage until we retuned when the room was ready. In terms of the room, ‘compact’ is the word I would associate, but for us adventure-seekers, we are not looking to be cooped up in a hotel/resort on our trips and holidays. In fact, the bathroom was of a decent size, and about 2 thirds the size of the actual bedroom! All in-room facilities were in decent working order so no complaints there. Bed was comfortable enough with a firm mattress. The hotel includes breakfast for each guest and was satisfactory enough, although there are some great bakeries just a short walk away. The real benefit of the hotel was the close proximity of the Metro station, which was literally a 20 second walk from the entrance of the Antin. I thoroughly enjoyed my stay in Paris and had no qualms with this hotel.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Horrible customer service, Dont beleive the hotel photos!!”", "Author": "global737", "ReviewID": "UR106907024", "Content": "I have traveled throughout Europe on many occasions, so I know what to expect in regards to rooms. However this Hotel is NOT what it advertises. We booked our room through hotels.com with the intentions of having 1 queen bed and two single beds with a shower. Not only did we not receive those rooms, they don't even have those type of rooms. We were given a room with 2 queen beds. The room was in horrible condition, with stained carpets, dirty walls and a outside view of the pipes. The toilet was on one side of the room with no fan or window and the door would not close properly. On the other side of the room was the shower tub and sink. The tub was very slippery and had no curtain to keep the water from splashing all over the floor. As much as you tried, the water would end up all over the floor. There towels were also in bad condition and worn out. The super mini size TV did not work as well. We were very dissatified with the room, so we talked to the front desk to find a solution. They had none. Their solution was to pay $80 euros more per night and get one queen bed extra room. They did not want to accept their hotels condition and were stating that they didnt think it was all that bad. We ended up talking to their hotel manager the next morning and without much options decided to get 2 smaller rooms for #30 euros more per night. The smaller rooms had one queen bed and were slightly better condtion than the larger room. It did have a shower in it, but was very cramped and had no room to move around. This hotel is not very customer friendly and they dont look to assist you. Even with all these issues they refused to at least comp us for a free breakfast for one day. By the way, dont waste your 10 euros on their lousy breakfast. Much better bakeries just down the street. In regards to noise, on some nights there was so much noise from the local cafes that you could not get any sleep. This went on beyond 2 in the morning. Internet service was just as bad as well. No free internet. You paid 1 euro for each 10 minutes, which would be fine if it actually worked. Looked like the service was on dial up. The only good thing about this hotel is that the metro station is 1 minute from the hotel and that there are lots of markets and cafes nearby. However, I DO NOT RECOMMEND THIS HOTEL!. I would rate it as a 2 star, just to be nice.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Plovdiv, Bulgaria", "Title": "“Great location but dirty and noisy a little bit”", "Author": "didaka", "ReviewID": "UR105770261", "Content": "I stayed in the hotel for three nights. It is only 10 minutes walking distance from Moulin Rouge and Sacre-Coeur Basilica. It is also close to Saint Georges metro station from where you can reach most of the sightseeings in no time. The room was small with small and uncomfortable bathroom. The room was quite dirty. There were stains on the carpet and on the walls. There were hairs in the bathroom, most probably from the previous guests. The wardrobe also was very small. My room was on the sixth floor and I could hear the noise from the street, however on the lower floors during the night you can feel the running trains from the metro. It was extremely noisy on the first and the second floors which were shaking all the time from the passing trains. The breakfast was nothing special. They serve croissants, cinnamon rolls and danishes only. I'll definitely not recommend this hotel.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Brentwood, United Kingdom", "Title": "“Avoid Avoid Avoid”", "Author": "BL1P1982", "ReviewID": "UR103602433", "Content": "I stayed in this hotel with my partner on 5 February 2011. All i can say is thank god we were only there for one night. I booked this hotel through a agency website (cant remember whcih one) and from looking at the pictures and descriptions of the rooms the hotel looked very good value for money. The hotel is situated in the north of the city and is a ten minute walk from the Moulin Rouge. As such, it was pretty good in terms of location. Upon arrival the reception appeared presentable and the receptioist was very helpful with our questions. However, things changed quickly when we got into our room. The first room we were allocated was on the first floor overlooking the road. Someone had just finished comking a ciggy in there and it STUNK of stale smoke, really disgusting. The room was tiny, no joke, one of us had to sit on the bed whilst the other was moving around the room. The bathroom was filthy with mould and mildew everywhere (stomach churning in fact), the bed was really lumpy, pillows were not worth having they were so flat and to top it off there was some pub hair left in the bed which suggested the sheets had either not been changed or cleaned properly. The receptionist was helpful and very apologetic and helped us changed rooms. The second room was slightly bigger and cleaner although still not what i was expecting from having looked at the hotel's website. Sleep quality would have been a bit of an issue had a not had a fair bit to drink at the Mouin Rouge that night. To be frank, i loved Paris but you would have to pay me to go back to this hotel.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Just what we needed”", "Author": "rare-traveler1979", "ReviewID": "UR103055593", "Content": "Reasonable place to stay, when exploring Paris on budget. Great location, by my opinion. On one side walking distance to Pigalle (up the road 20-30 mins) and further to Montmartre. In other direction Opera and Louvre (45 min.). We had great weather, so we did most of our exploring on foot, but Metro station is just few meters from the hotel, which is great benefit. We stayed for 3 nights, spent most of the time outside and there is really nothing to complain about..", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Nice price, nice location! Would stay again.”", "Author": "Scarlett000074", "ReviewID": "UR90872688", "Content": "The Antin Saint Georges served it's purpose and was very close to a grocery store and metro. They offer wi-fi for an additional cost, but it was reasonable. They do not offer a shuttle which I felt a little mislead by this information. All in all, I researched and found that the Roissybus is an excellent option if you need a shuttle from De Gaulle Airport. You can locate it outside of terminals and it will drop you off right at the Opera house. Just a 15 minute walk or 5 minute taxi ride from there. The Roissybus was only 9.40 Euros one way. The hotel is right at the Metro Station \"St. Georges\" on line 12.", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Great value”", "Author": "stmh1", "ReviewID": "UR90747437", "Content": "We stayed int his hotel a while back and it was great. Clean and regulary cleaned. Good breakfast and excellen location. Rooms are not huge, but you won't be spending much time in the room on a city break. Would highly recommend.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Galway, Ireland", "Title": "“this place is not at all worth staying”", "Author": "dravijitbiswas", "ReviewID": "UR89647269", "Content": "this place is terrible , more like a shabby student accomodation.The room was very small, dirty ,no facility tea or coffee in the room. There was a tv which had programs in french only - u have learn french to stay in the hotel.That hotel was very boring.The hotel is not the same in the picture.It was the worst hotel ever.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Leamington Spa, United Kingdom", "Title": "“Good location but shabby room”", "Author": "mickhibbert", "ReviewID": "UR87476683", "Content": "Tiny shabby room, but clean, with good PVC double glazing. Location very good, with quite good continental breakfast and very pleasant and helpful staff. Access to room via dark and awkward corridors, broken mirror and shower door would prevent me from wanting to return.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Misled by photos,shoddy,disgusting dump.”", "Author": "traddy", "ReviewID": "UR85200500", "Content": "We went for 4 nights,didn't expect the Ritz but somewhere basic and clean.We had a 3rd floor room,broken shower and dirty grey towels and SILVERFISH,Limited wardrobe space,broken mirror and stained carpet and filthy curtains.Asked to change room but told all rooms were the same and full.It kind of ruined what we thought would be a lovely weekend for us.What we would term in the old days\"A FLEA PIT\".", "Date": "October 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "dartmouth", "Title": "“NOISY, DIRTY, MOULDY, UNSAFE, UNPLEASANT STAFF NOTHING LIKE THE AA WRITE UP.”", "Author": "bella18Dartmouth", "ReviewID": "UR83112313", "Content": "As a treat for my daughter's 21st we were very disappointed - A broom cupboard on the 6th floor overlooking crumbling masonary, dirty, mould under the windows, the internal fire escape were the main stairs, cleaners wedged towels in the fire doors to keep them open. Asked to move room given a room on the first floor, felt every metro train rumbling beneath us, which made a change from the noise of the traffic. bedside shelves, carpet, very dirty, chewing gum stuck on the floor. no lock on the bathroom door. various bits of bath, ceilings falling off. the one staff member on duty did not help could not leave his desk. All he worried about that we were checking out early due to all of the above, that they would still charge me for the rest of the stay. ABSOLUTELY APPALLING - We have compained to AA getaways on 24th August, they said they would investigate on 1.9 still no reply after 6 weeks, even after a chase up e mail and letter.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Incline Village, Nevada", "Title": "“I'd stay there again”", "Author": "TahoeJeni", "ReviewID": "UR82769223", "Content": "During my recent trip with my 8-year-old boys, I stayed at the Hotel Antin St. Georges and was quite satisfied with my stay. Our room was quiet, spacious, and clean. The hotel is very near a metro stop and popular attractions. The front desk was accommodating and maid service did their job well. The only complaints I would have is that there were a few stains on the carpet, a few unattractive areas on the tile in the bathroom, a loose closet door handle, and the wall paper looked tired in places. BUT, the pros far out weighed the cons for us and we'd stay there again. For the price, I couldn't ask for more.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“2 star? No star really.....”", "Author": "Hudron", "ReviewID": "UR79039892", "Content": "We stayed at this hotel in july and was shocked how bad it was. The location is ok as its near a train station, the hotel itself is just bad. The rooms and corridors are tiny. The shower was hanging off the wall and leaking. The room stank = really smelled so we opened windows when we arrived back in our rooms every night. We were unlucky to arrive when it was pouring and was soaked. We asked if we could have or make tea (as no facilities in room) and was told no by the bored receptionist who was near the kitchen. The walls = paperthin....seriously. We could hear everything in other rooms and in the end said shut up to make people talk more quietly at night time!! No safe which made it worse when my wallet was stolen on a train. There was one receptionist who looked like tina fey and she was great with knowledge and did try to help when possible.She is the only good thing about the hotel.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Noisy, dirty and overpriced but good location”", "Author": "SBUK", "ReviewID": "UR76077616", "Content": "I had chosen the St Georges Antin as part of an AA Eurostar deal at a great price and this was the only reason I stayed there after our arrival - had I been forking out the 80/90 Euros per night that they charge, plus 10 Euros for breakfast, I would have run a mile. The first room we got was 001 on the ground floor - if they offer you this room say no! It's a \"superior\" room (probably because you could swing a cat in it, having seen the others), but it was appalling. Dingy, with very little lighting. Looking out onto bins. Stuffy. Cracks in the bath. No shower curtain. One plug socket, which I had to unplug the phone to get to. No drawers. Dirty surfaces and net curtains. One curtain hanging off. In between the lift and laundry closet. I had about an hour of sleep that night. I listened to every conversation in reception (in between the metro rattling the floor and the lift going up and down) till about 3am. I finally nodded off and at 5am they started getting the breakfast stuff ready so I listened to crockery and more conversation till 7am when I got up. This wouldn't have been as bad had I shut the window, but then I'd have suffocated. Rock and a hard place, huh? The girl on reception (one of two who were actually pleasant enough to bother saying hello each day) wasn't surprised in the slightest and found us another room instantly. This was a vast improvement in terms of light and noise but I could touch all of the walls from my lying position in bed and it was still dirty. There was once again no air-conditioning and the smell of ammonia in the bathroom was hard to bear. The shower cubicle was blackened with mould in parts and one side wouldn't close. I wouldn't put my bare feet on either the carpet or tiles. The towels were all a bit old and worn and grubby. However the street noise was much reduced and I slept through for the rest of the week. Breakfast was ok for 10 Euros I suppose. The bread was nice, the pastries a little stale and overdone on a couple of occasions. The selection was poor though. If you're looking to fill up on stodge before sight-seeing it's enough, but I couldn't get excited about a bit of baguette and jam. There were only croissants on our last day. The girls serving also didn't clean tables between guests but just put a new place setting down, so often someone else's crumbs and splodges of jam would still be there. This was my 6th time in Paris so I know not to expect the standards that you'd get in, say, a UK Travelodge; but for me the St Georges was a bridge too far. I've previously stayed in 30 Euro youth hostels a little further out but of a much higher standard. St Georges is right by the metro and really handy for all of the centre - but for me, I'd rather spend ten minutes extra on the metro and have a nice, cheap room in a hostel. I've also stayed in hotels that are supposed to be of a similar quality in a similar location that were much better. A definite no-go!!", "Date": "August 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“What a disappointment”", "Author": "Belledej0ur", "ReviewID": "UR72387720", "Content": "Good location and close to metro BUT Very small, smelly rooms and tatty. Broken mirror, hole in the sheets and broken shower door. Hot and stuffy but when you open the window, it was noisy. AND so different from the pictures on the internet !!!! Depending on who is at reception guess but on our first day we experienced an unfriendly reception with an attitude \"take it or leave it\" when we asked if we could change room. Dirty linen and sheets were left in the corridor until gone past lunchtime, which meant we had to climb over to get to our room. Continental breakfast adequate. Maybe they've renovated some rooms but not all of them by the look of it. Shame !", "Date": "July 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Don't Stay Here!!!!!!!!!!”", "Author": "aig2010", "ReviewID": "UR71327860", "Content": "Our room on the 3rd floor was not large enough to \"swing a cat\" in. The noise from the street was horrendeous - all night long and there is no AirCon - the place was stifling. We requested a move on day 2 and were moved to a Superior Room at an extra €10 per night. Yes it was bigger, but out of date on the ground floor and had windows opening onto a yard with bins and laundry on it. Quieter - well no Street noise, but the metro shook the room! Thouht we had booked breakfast - then got stung for an extra 20€ a day for stale mini croissants and a distinct lack of choice in jams! Generally the building is badly laid out and corridor lighting difficult to locate. The \"Upgrade\" to \"Colonial Style\" is a free photos of EXPats on elephants an a couple of pieces of menorabilia. Oh and if you want to use the internet (in full view of every guest\" its 1€ a minute - funny thin but the connection is extremely slow. Moral DONT GO!", "Date": "July 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Aussie", "Title": "“location great forget the rest”", "Author": "mumma-aussie", "ReviewID": "UR69417874", "Content": "My mum and I booked months in advance but a twin room was not available so they put a single bed in the already tiny room, the next night we moved to a twin room, very shabby, just clean, noisy rumble each time the metro goes underneath, very old rooms in need of a renovation...........the location is fantastic close to metro lots of shops and restaurants near by..............enjoyed Paris, disappointed by the hotel although the staff were friendly we would not stay there again and not recommend it", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Great Location, Value for Money - We Recommend!”", "Author": "The_Wee_Mawn", "ReviewID": "UR66519724", "Content": "We had booked the hotel, then read the revies and were a little wary before we arrived. However, knowing that we had booked it for value and location, not luxury, we feel we got what we were looking for. The rooms were a little small, but there was a bed and a bathroom - all you need when on a 3 day visit to see as much of Paris as you can! The hotel is situated close to the metro (1 mins walk), but this did not disturb us at all at night. It is also just a 10 mins walk to Sacre de Couer which is beautiful and where you can find great food! And, you are only 15 mins on the metro from all the main attractions. For anyone not looking for luxury, but a base to stay at value, we would recommend!", "Date": "June 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "uk", "Title": "“Don't be put off!”", "Author": "zackkery", "ReviewID": "UR65515128", "Content": "I booked this hotel and THEN read the reviews...I was terrified that it would be a total disaster! When we arrived, we were told that we would have a double room, although I had booked and paid for a twin room - seems this happens a lot. I had taken all my print outs with me so could prove what I'd booked. the receptionist tried to dismiss me with a \"it's not my problem..\" type of attitude, but I stood my ground, told her it was not acceptable and was definitely not MY problem - I had booked and paid in advance for a twin room and that is what I wanted. After telling me the hotel was full etc I offered them the chance for us to be moved to a better hotel for the same money, as it was not my fault. She made a phone call and a twin double bedded room was then available, room 400. It was great, comfy, clean and with private bathroom. The breakfast was more than adequate - filled up on that before venturing off for the day. To be honest, we don't stay in our room for long-only to sleep as we're out seeing interesting stuff, and this hotel is in a great situation for all the sights, PLUS the Roissy CDG airport shuttle bus drops off and picks up at The Opera; a stop or two away from the hotel for 9 Euros each way. We had a fab time and WOULD return!", "Date": "May 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Just say no”", "Author": "LandyLover", "ReviewID": "UR63599355", "Content": "I've stayed in some fleapits in my time but this one was pretty horrible. I know Paris is expensive for hotel rooms but at almost 100 euros a night I expect the basics - a clean room, a decent shower, and a good night's sleep. The reception has obviously been jazzed up and looks quite inviting, and the hotel is very close to the metro (although the nearest metro stop is on line 12 which isn't the most convenient line for many touristy things). However the problems started upon entering the room... Despite requesting a non-smoking room (and I believe the hotel being non-smoking?) someone had obviously been recently smoking in this room, as it stank so bad it gave me a cough after two nights sleeping there (the hotel was full so no alternative rooms were available). There were cigarette butts in the flower box in the window too which also was delightful. The bedside shelf looked like it had been used to stub out cigarettes too. The bathroom was in a hideous old-fashioned pink shade which last was fashionable in the 1970s, the shower head did not have a wall mounting and there was no shower curtain, so taking a shower involved holding the shower head and usually flooding the floor. The bath had chunks of enamel taken out of it and mould round the grout. My room at least did not have some of the \"views\" you can see in the photos from other reviewers here, it faced onto the street. However the first floor location, poor sound insulation, thin curtains, and the relatively busy uphill road ensured noisy traffic throughout the night, especially from those Parisien Vespa owners who like to drill holes in their exhausts to make their scooters louder. You can probably do better than this in Paris by sleeping on the street. Avoid.", "Date": "May 8, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "2"}, "AuthorLocation": "devon", "Title": "“Rubbish”", "Author": "sdlanger", "ReviewID": "UR63422338", "Content": "Do not go to this hotel, we left after half an hour of arriving! We booked through the hotel website and were told check in was at 12 from there hotel confirmation but when we got there the very rude receptionist told us we were wrong and that check in was at 1pm. We then waited until some other visitors who were waiting asked if they could leave there bags in there room and then go get food elsewhere. They were given the key and did that. We then asked and were told rudely we would have to wait. I asked why it wasnt possible for us and I was then told I was a stupid english by the receptionist! Shocked as I was, i asked her to repeat what she had said and got the same answer. I asked to speak to the manager and she refused saying they were not available. I said that we would like to speak to the manager and this wasnt the way to speak to customers and the receptionist told us to either wait for our room or leave, it was our choice. We did leave and found a very nice hotel near st lazarre. Before writing a review on here, I gave the hotel a chance to apologise after writing a letter to the manager about our visit to ask for our deposit back, I have heard no reply or seen my money! I repeat DO NOT BOOK at this hotel!", "Date": "May 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "london", "Title": "“Not for romance”", "Author": "bitsy1d", "ReviewID": "UR55458638", "Content": "The hotel was in a great location, a short walk to Mont Matre and the Moulin rouge and the metro was next door. However it was so close to the metro that every 5 minutes when a train passed, the room would shake and it was very noisy. We went for a romantic getaway and i was very unimpressed with the hotel. we got a standard double which had a double bed with nothing else. there was a tiny closet, and a chair with no where to store luggage. the bathroom was a good size but very dated, with cracked tiles and no shower curtain so it was baths every morning- not great when you're in a rush to explore the city. the staff were OK, not overly friendly nor rude but acted like they wanted to be elsewhere. the breakfast was basic but nice- croissants, cereal, bread, juice, coffee/tea yoghurt and tinned fruit. On the third night i started to feel itchy and uncomfortable and caught bedbugs- not great for the romantic trip we had planned! Not worth the money.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "oxford", "Title": "“nice hotel but...”", "Author": "chefchef", "ReviewID": "UR52559328", "Content": "Beware - they had our confirmed booking for 7 months but when we arrived they told us that there had been a flood in our room & they sent us to a horible hotel up the road with no apologies, no help with bags & told us to return 2 nights later when our room would be ready. As it was late & we were pretty tired we went but returned within the hour to complain - there was only the night manager there but the next morning when I went back angry they miraculously told me that our room would be ready that night after all. I asked to see the room but they said it was too dangerous because of the water & electricity but when we checked in later that day everything was all normal - no sign of a flood & the carpet having been taken out to dry as they had said. The receptionist at the hotel they sent us to said that they get sent people from the antin st. george all the time & we wondered whether someone else had been sent there to enable us to have a room for the rest of our 5 night stay. The hotel itself is good, breakfast is good, everything is clean & the staff were nice - shame about the lies.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "dublin", "Title": "“best value for the money and great location”", "Author": "marius_cretu", "ReviewID": "UR49776040", "Content": "We stayed four people in a quadruple room with two double beds from 12 to 16.11.2009. Good quality room, with TV, very clean, frendly and helpfull staff who speak english. The room was cleaned daily and very quiet. We didn't had a room with a view but that wasn't a issue for us because we were away the entire day visiting. Centrally located next to St George Metro Station(1 min distance), there is loads within waking distance, Place Pigalle, Gare Du Nord, Gare De L'est, Moulin Rouge, MonteMartre. The location is great, on a small one way street, there's a supermarket very closed by and all the surroundings streets are full with small shops where you can buy fresh cofee and pastries. There are a few restaurants and shops for take away food (italian, lebanese, vietnamese,chinese,thai). We will definetly go back.", "Date": "November 21, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Kent", "Title": "“Excellent Location but Noisy”", "Author": "JRRKent", "ReviewID": "UR46994140", "Content": "Excellent location for the St-Georges metro station (1 minute walk) and Monmartre (10-15 minute walk). The standard of the room, en-suite bathroom and the buffet breakfast were good for a city centre hotel. The only issue is the rooms have no air conditioning, we had to open the windows on the first night. Even with ear plugs the street noise was loud and it carried on for most of the night. After that we just kept the double glazed windows shut which does cut out most of the noise.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "North West UK", "Title": "“Location, location , location!”", "Author": "Kalamaki-Rob", "ReviewID": "UR44675621", "Content": "The convenience of this hotel is the main plus of this hotel. Centrally located next to St George on the Metro there is loads within waking distance, Pigalle, Gard Du Nord, Gare De L'est, Moulin Rouge ..... The hotel is has an decent reception area and welcoming and helpful staff but the rooms are a little tired and could do with a bit of an ugrade soon but the room we had was comfortable enough. We were on the 6th floor and the slope of the roof impinged on head room - showering was different. No complimentary drink in the room was a con. We went across the road to the supermarket fo a bottle of wine but don't forget your corkscrew! I's recommend this hotel if the price is right.", "Date": "September 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Maryland", "Title": "“Great Location”", "Author": "Lovestotravel4485", "ReviewID": "UR43653350", "Content": "The locations was central to almost everything...MonteMarte, Moulin Rouge, and the subway was just around the corner. If you are traveling in pairs.....DON'T stay in a regular double room. You can't move around in it, one has to get on the bed so the other can get to the bathroom. Once we were able to upgrade to a superior room, things were better. Breakfast cost 5 euros and consisted of coffee, tea and croissants. The staff was hospitable. The rooms are relatively clean...However, I did get some bed bug bites, also, neither room we had supplied a shower curtain and you have to lay down in the tub to use the sprayer. It was funny, but also a bit of a pain. Not sure why there were no shower curtains. Room 502 and room 205. Thankfully we did not spend much time in the room....there is a friendly bar/pub 2 numbers down. If you want a quiet street...THIS is not the one for you...The trash trucks are running constantly.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "ajmull", "Title": "“Fairly Typical Paris Hotel - Just off the main Tourist areas”", "Author": "ajmull", "ReviewID": "UR37251962", "Content": "Spent 5 nights here with wife and 2 sons in mid July 09 Rooms are small - but not bad by Paris standards and the reception staff are fairly helpful (by Paris standards) The breakfast was included and made the hotel deal competitive. Breakfast is of course Croissants , Pastries etc with coffee. Some cereals , but beware the milk is longlife and lukewarm , so its not like a nice bowl of Kelloggs with ice cold milk in UK!! Breakfast is a minimum of 10 Euro per person if buying elsewhere , so this hotel does save you a little if its included. The area is ok - 2 mins from tube and about 10 mins walk from Moulin Rouge, Taxi to main tourist areas (Eiffel etc) will be about 10 Euro , some drivers will surcharge you for luggage and kids though!!# Taxi to CDG Airport - 65 Euro , only a little more than the cost of train for 4 and considerably more relaxing! In summary - you can only judge Paris if you have been there before , you can't compare to UK hotels as they will almost always be cheaper and have larger more modern rooms , but this is Paris - not Milton Keynes", "Date": "August 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "UK tightwad", "Title": "“Location makes it”", "Author": "Syphon", "ReviewID": "UR36766588", "Content": "Hotel was booked online in advance - the pictures of the recently refurbished rooms on the website didn't reflect our room. However, the room, albeit tight with 4 of us in, was clean and everything worked. The lack of aircon was made up for by the windows which opened on the street. The noise of the traffic took the edge off this, though. Staff were a bit hit-and-miss: one girl was very helpful, the others didn't seem that bothered. Breakfast, we thought, was a bit steep at 10 Euros (including kids). There are loads of cafes just down the street near the church/metro (Notre Dame de Lorette) which are better value and more Parisienne. The location of the hotel gives it a thumbs up: we walked to the hotel from Gare du Nord, and then walked from the hotel to Opera and the Arc de Triomphe. We also walked up to Pigalle and Moulin Rouge. The Metros at Saint Georges and Notre Dame de Lorette on line 12 gave us access to the rest of Paris. 10 ticket carnets at Euro 11.60 were a good buy.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Antin (was Modial) a perfect stay, for a bit more...”", "Author": "Swissrmeadventure", "ReviewID": "UR36293817", "Content": "We went over for the Fete De La Musique on Midsummer day - as we have in previous years - and found the hotel Antin (was hotel Modial 2 years ago) upgraded, refurbished and comfortable. It is right next to St Georges Metro and is a mere 5/10 minute walk to Pigalle/Moulin Rouge and very close to Montmarte (where a lot of the festival that we were interested in going to was). You can walk there from Gare du Nord in 15 minutes, which is what we did. The surrounding area has loads of cafes and restaurants to try. The room is ample size, cleanly kept and with beautiful Parisian long windows, overlooking other beautiful Parisian rooftops. It has gone up in price to 80EU a night but that is still good for a comfortable, clean and central room in Paris.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver", "Title": "“Small, interesting hotel close to Moulin Rouge”", "Author": "This_Is_Us_2009", "ReviewID": "UR35785445", "Content": "Stayed a week. The reviews I read on this hotel were dead on for the most part. Few complaints: no alarm clock in the room, the walls are paper thin and I could hear everything in the room next door (and I mean everything..........especially the young couple doing the \"deed\"). My room faced the street, so I had to leave the windows open for air since there is no AC. You will not get any sleep. Nothing but loud traffic and people talking/yelling on the street all hours of the night! The floors squeaked and the carpet looked old and never vacummed. And, I would recommend skipping the 10 euro breakfast. Just buy street food and pay a fraction of the cost. Spend your $$$ on eating at bakeries and eat baguettes and simple foods. Avoid the classy, overpriced restaurants cuz if you end up staying at this hotel, you're most likely on a budget! And now the good stuff................the bathroom was very clean and so was the bedding. Comfy bed (granted European rooms are smaller than North American). The decor was modern and clean. Nice, small flat screen TV. The young girl with glasses at the reception was very nice and helpful. The hotel is only a 10 min walk to the Moulin Rouge and close to little restaurants and cafes. And the metro station is a 30 sec walk so easy to get around Paris. I would give this hotel a 7 out of 10. Enjoy Paris!!!!!!!!!!!!!!", "Date": "July 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sevenoaks, Kent UK", "Title": "“would recommend and come back again”", "Author": "Abie18", "ReviewID": "UR35016543", "Content": "I had very low expectations coming but I was pleasantly surprised! Very near Saint Georges station in line 12 of Metro which makes it really accessible to everything - just don't attempt to walk to them if you're not really familiar with the streets. From the Eurostar station at Gare du Nord you can take 3 short trains - line 4, line 2 and line 12 and a 2 minute walk. We had no trouble finding it when we got off the Metro station. The staff was pleasant and speaks good English, they are very much willing to be of assistance to us for any weird/ silly queries about Paris. The rooms albeit small are clean, (from day one to the last) the TV was flat screen and mounted (and actually has CNN), the breakfast was a buffet and enough to last you till lunch time. For the price we paid I believe this hotel is a good value for money. Our room was on the first floor and facing the highway and being summer, we had to keep our windows open when we were there (it turned out we had to go back between sight seeing to nap and rest our feet) and the noise from the street made it hard for me to sleep and rest, I can also hear the Metro trains passing 2 floors below which was a bit freaky. Having a glass of wine during dinner helped these so in the end they weren't that big a deal. The shop/supermarket along the same street was very convenient and we bought a 6-pack of bottled water for around 1.63 euros. (it can go up to 2 euros near the sights for 1 bottle) We also bought some fruits and some exquisite cakes on the next street parallel to the hotel and they were cheap and a must for a night cap. You can bring food into your room and even borrow utensils/crockery from the hotel kitchen. (just ask reception and bring it back clean afterwards) The hotel doesn't have it's own restaurant but the area has loads to choose from - even if you get hungry around 10:30 at night like we did and decide to go on a prowl. Some of the cafe's/restos nearby can be a bit pricey so be sure to lookout for something more budget friendly. I enjoyed my stay enough to say that I would recommend it to anyone on a tight budget and has the right expectation. You get what you pay for. I would definitely consider coming back to this hotel unless I get lucky enough to afford something more luxurious. Overall, it was a really lovely stay.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Shanghai", "Title": "“Better than expected, good location and good price”", "Author": "mxu", "ReviewID": "UR33616031", "Content": "30s walk to Station St-georges of Line12. Ok lobby ok reception ok doorway. Met 3 staffs, the girl was the best and was willing to spk En. The lift was out of order at our arrival in the late eve, so we had to carry our 18kg bag by the stair. But the lift was repaired the next day, surprise, so no carry-down for check out. We didn't expect high so the room was better than our expectation. The room 530 was about 9 square meter, with a 4 squre meter bathroom and a small balcony. In addition, there's one narrow desk and one 19inch LCD on the wall. The closet is at the door way separated by a two-side door, door to close the doorway and to close the bathroom. The window glass was two-layer, but a little noisy from the stree still can squeeze into the room, but no bother. We stayed there for two nights and the room was enough confortable. Shower cabine was a bit too small but the water was good, good German equipment too. There's no wifi, but I didn't have mood for internet at all after arriving such a city as a tourist. 10euro for breakfast was too much even though a lot of people was there eating, some were from neighborhood? The living zone where the hotel locates offers lots of cafe, boulancherie, boucherie et marche. We had out breakfast out there and packed salad, meet, drink, fruit for pic-nic at Versaille.", "Date": "June 30, 2009"}], "HotelInfo": {"Name": "Hotel Antin Saint Georges", "HotelURL": "/ShowUserReviews-g187147-d567404-Reviews-Hotel_Antin_Saint_Georges-Paris_Ile_de_France.html", "Price": "$113 - $169*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">21 Rue Notre Dame de Lorette</span> | <span class=\"extended-address\">09 Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75009</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "567404", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3d/40/3d40700e6db2c434dad84ebd5edf42aa3large.jpg"}}