{"Reviews": [{"Content": "Great Location! We stayed at the Soggiorno Antica Torre in Florence for 2 nights in September. Once you know where to go this place is very easy to find. The cab dropped us off from the train station right in front of the door (10 Euro ride), its between 2 restaurants, right on Soggiorno Plaza. We had instructions to get into the room, etc. and everything flowed very easily. We stayed in the gold suite, which was very spacious, large bathroom (small shower). While the location is great, close to everything, I would recommend staying in an inside room. I could not believe how noisy the square is in the middle of the night and very early in the morning. I woke up at 2.30 am with a couple of people yelling at each other, then again around 6.30 am with trash collection and street sweeping. Luckily I had ear plugs and they came in handy for those 2 nights. As with most hotels and BB's on this trip, the soaps were tiny, no conditioner, shampoo really small, so make sure you take your own travel shampoos  conditioners. Great hair dryers in all hotels, you don't need to bring your own.", "Date": "Oct 9, 2008", "ReviewID": "UR121523415", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "Travelgirl056"}, {"Content": "Perfect Location       entrance to hotel", "Date": "Sep 1, 2007", "ReviewID": "UR533139897", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Kittybug"}, {"Content": "Great Stay If you are looking for room service and staff available to serve your every whim... this is not the place for you.However, if you are looking for absolute superb location, clean accomodations, friendly staff willing to help when requested and value, then consider the Antica Torre.Simply stated, you can't beat the location as it is steps away from everything in Florence and the activity at the Piazza itself is constant.The furnishings are understated, clean, very nice and the bathrooms sizeable. For you shower gurus... water pressure was fine :) The accomodation was perfect for us as given our desire to take in what Florence had to offer and being able to launch our daily activities from this location was fantastic.The staff is at the property from 8:30 to around 3:00 and were pleasantly available to help in any way, museum reservations, restaurant recommendations, etc.Our taxi from the airport pulled right up to the front of the building and in we went (having read the directions on entry from the hotel). As noted in prior reviews, you must walk (carry luggage) up a good size flight of stairs to get to the elevator to the rooms so be prepared. I am pretty particular about the places we stay when we travel and I would not hesitate to recommend to you this property assuming you are not in need of 24 hour staff availability. We booked through [--] and communicated directly with the Antica Torre staff that kindly answered my every question.", "Date": "Jun 8, 2007", "ReviewID": "UR967911903", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Conchobar"}, {"Content": "Great location but service low-key We came here from a slight shabby place outside Firenze that had amazing service... this was the opposite. The facilities are excellent, although the flight of stairs isn't much fun with a suitcase, it was nice to have been warned (from other reviews) and so we were prepared! The service was pretty much non-existent... we hardly saw anyone and when we did generally they weren't that helpful. Perhaps that's intentional and they want to leave you alone.The two big pluses for Antica Torre are the rooms, just instantly relaxing (although at the back was noisy into the night with the sounds from the restaurant kitchens below) and the location... it's just the best! However, avoid the restaurants nearby (as in any of the tourist locations), there's a great little coffee and pastry shop directly opposite - quick cheap breakfast and enough to give you the energy to walk a bit further. We ate amazing food in Firenze but also some dreadful stuff (usually when we broke our own rule!) - proximity to squares and tourist features was the key. That said, it's an amazing city and this is an amazing location from which to see it... a little oasis!", "Date": "Jan 30, 2007", "ReviewID": "UR604247340", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "hbbnz"}, {"Content": "Good and Bad If you're looking for location, this is a great choice. The room is clean, and the bathroom is huge. However, there is very little help from the staff, and must walk up three sets of stairs just to get to the lift, so if you have a lot of heavy luggage, this is not a good place. Breakfast, we found out after the fact, is not included.", "Date": "Sep 1, 2006", "ReviewID": "UR789161203", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Don2814"}, {"Content": "What a treasure - don't tell anyone!       Pink Room", "Date": "Jun 16, 2006", "ReviewID": "UR774701060", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lynneharvey"}, {"Content": "Beatiful terrace breakfast; clean lovely rooms We stayed here with another couple and loved it. The rooms were clean and plenty big and well-appointed. The view from our balcony was fantastic. Our favorite part was the delicious breakfast on the rooftop terrace with a wonderful view of Florence as seen from up high. The staff was very nice, helpful and accomodating. They lock the main doors at 8pm so do remember to take your key or you will feel locked out of the fortress! There are two small elevators and a wide central staircase. The location is very close to the river, near restaurants, famous churches, one bridge down from the Ponte Vecchio. I would stay there again.", "Date": "Jun 6, 2006", "ReviewID": "UR403522178", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "loveltotravel"}, {"Content": "Great Location!       Piazza della Signoria", "Date": "Jun 3, 2006", "ReviewID": "UR741264134", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "ViajeraDC"}, {"Content": "Terrific Hidden Gem       Unmarked door between \"David\"  \"Il Bargello\"", "Date": "Apr 20, 2006", "ReviewID": "UR175533526", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Peripatetic1"}, {"Content": "Hotel/ residence and restaurant July 5, 2005 Just got back to California from a 3 wk trip to Tuscany, Italy. Want to share some recommendations in Florence because I watched so many American tourists make uninformed decisions about hotels and restaurants, especially because it was very hot in late June and early July.Instead of a tourist-type hotel, I stayed at a place called Soggiorno Antica Torre in Piazza della Signoria which I think is the most beautiful plaza, 30 steps from the Uffizi museum. Antica Torre is on the third floor only, and has an interesting history. The decor is sparcely elegant with prized furniture making me feel as though I were living Florentine history. The ambiance made my stay enormously peaceful because reception is open only certain hours a day so the rest of the time one uses the keys to the outside door, inside door, and room. Only restriction is checking in on arrival day before 7 pm, or making phone arrangements if you can't. Air conditioning is perfect, I was always comfortable during 95 Farenheit days, and the huge, marble bathrooms are gorgeous. I was the envy of tourists dining outside on the plaza when they watched me use my key and enter through the beautiful wooden door. It's very near the Duomo and Ponte Vecchio, perfect location. Suggest you get exact directions because the numbering in the plaza is bizarre. The only downside is breakfast which is meager, but served as though you are a guest in someone's home. I paid 110 Euro per day. Also, I suggest that you do not stand in line for the over priced cafes and restaurants on and nearby the piazza. Frommer's recommends a fabulous restaurant called Il Barroccio, right off the Duomo square, Via della Vigna Vecchia #31. It's run by a wonderful man, is intimate and delightful, serving the best food I had in Tuscany, medium priced. The recorded music playing is contemporary and entriguing.", "Date": "Jul 17, 2005", "ReviewID": "UR457841511", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "bello!!!   showReview(13310947, 'full');", "Date": "Feb 6, 2008", "ReviewID": "UR175560666", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Biodda"}, {"Content": "L'unica cosa che mi ha dato un...   showReview(11398234, 'full');", "Date": "Oct 16, 2006", "ReviewID": "UR147312299", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d567530-r20755159-Soggiorno_Antica_Torre-Florence_Tuscany.html", "HotelID": "567530", "Price": "$176"}}