{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Nice and cozy hotel”", "Author": "Dukulainen", "ReviewID": "UR125982478", "Content": "It's a small family run hotel. We were here only for one night. We reached the hotel around 1 o'clock in the morning and the main door was locked. We rang the bell and after a few minutes, a boy (around 13 years) came, warring a pair of shorts and a blazer straight over the skin. That was quite a funny appearance. The stairs are very narrow and like a spiral but the room was ok. It was clean, with a nice bathroom. Nothing spectacular but ok. The breakfast was good, again, nothing spectacular but ok. The location of this hotel is very good, a few meters from the Blue Mosque. If we will ever be again to Istanbul, we will go to the same place.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“Average rating but just right for a budget”", "Author": "Grayontheroad", "ReviewID": "UR122608641", "Content": "Conveniently located just below Hagia Sofia and the Blue Mosque, this small hotel has very clean, comfortable rooms a little on the small side but certainly more than adequate for what we needed. Their restaurant is just below sidewalk level and spills out into seating on the sidewalk when the weather is good. Their rooftop bar and restaurant offers a pretty good view of the Sea of Marmera and (if you sit in the right spot) the roofline of Hagia Sofia--nights are the best time here. This is a friendly, family-run place with free wifi, convenience, and all the basic needs.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Aleppo, Syria", "Title": "“Very good for the price”", "Author": "tbremer", "ReviewID": "UR121585088", "Content": "I went with a friend for the weekend in November to Istanbul. We were just looking for a place that was clean and modern that we could sleep in, since we would be out all day. The hotel is small, and the rooms are small, but they are clean and the bathroom looked liked it was renovated relatively recently. Overall, it was a good experience and I recommend staying there again. Do not expect anything fancy, but if you just want something simple, clean, and affordable, I highly recommend this place.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Aydin, Turkey", "Title": "“worst place Ä±n sultanahmet”", "Author": "Shona T", "ReviewID": "UR118645701", "Content": "we arrived at the airport expecting to be picked up as arrange by the hotel only to find nobody there, when i phoned the hotel they told me to get a taxi, on arrival at the hotel they said they didn't have our booking which had been booked in May!They offered us another hotel away in the back of beyond, which we went to see, all uphill with our suitcases, however upon seeing this other hotel we declined and travelled back to this hotel again. Ä° had booked 2 double rooms as i travelled with 3 otherr ladies. 2 of them were put into the hotel next door for one night while myself and a friend stayed there, then the next day my other 2 friends were given a room. We had book a trip to princes island the next day and had asked for breakfast early, however when we came down the stairs the door was locked and nobody there, we had to wake the lad up to let us out and the breakfast area in the restaurant was closed. they also advertise a roof terrace, this was closed when we were there and it didn't look like it had been used for a while. the geakfast was mediocre to say the least, i have been to Ä°stanbul many times and i can honestly say this was the worst breakfast i have seen. We ended up getting patries from the bakery 2 doors up which were lovely. On the morning we were leaving i was asked why i had complained to a third party about the hotel and that i shouldn't have!!!!! Ä° wouldn't stay here again if i was offered it free and would recommend it to anyone.", "Date": "September 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Not a place for a young single woman”", "Author": "PK_66", "ReviewID": "UR114976762", "Content": "Out of 25 countries... this experience was the worst i have endured. The positives are the location is good once you are there, but no taxi driver has any idea how to find it. The muslim chants from the blue mosque are beautiful. The hotel's food was very poor. A \"staff\" member broke into my room whilst i was asleep and tried to have sex with me, but I barricaded myself in the bathroom. No young woman should travel to Turkiye alone!", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Welwyn Garden City, United Kingdom", "Title": "“terrible, not a 3-star”", "Author": "190740Claire", "ReviewID": "UR114765252", "Content": "very dirty rooms, breakfast is the same every day: bread and cheese, I will not say anything about their coffee, it was the worst coffee I had ever had. A very noisy place, with music playing all night, didnt sleep at all. There is no reception, manager, nobody, :(", "Date": "June 26, 2011"}, {"Ratings": {"Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "globetrotter", "Title": "“Great for dinner on the roof terrace...”", "Author": "magicpixiejo", "ReviewID": "UR114645036", "Content": "I didn't stay at Sunrise but had dinner and drinks there a couple of times during my stay in Istanbul. The food was good, they had an excellent (local) wine selection and the staff were incredibly friendly...and their company made for a fun evening! Above all, the roof terrace has fab views of the Blue Mosque...a great place for a sunset drink...and then you can be lazy and decide to stay for dinner too!", "Date": "June 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Berlin, Germany", "Title": "“Avoid this hotel at all costs”", "Author": "corrado12345", "ReviewID": "UR110367136", "Content": "I get to this Hotel actually by chance. I booked a room with sea view and balcony at Daisy Hotel to have a special week-end with my girlfriend for her birthday 2 months in advance. Arrived there, there was no room for us. The guy from Daisy Hotel claimed they made a mistake with the reservation. Well, -- happens. The guy from Daisy Hotel brought us to an alternative hotel in the vicinity, which was Sunrise Hotel. The guy showed us the alternative room: small, with no balcony and without sea view (There is no sea view at Sunrise Hotel except on the tiny terrace and except if you bend out the window in room 108. Be aware if they claim something different in their homepage). We arranged with the guy from Daisy Hotel a discount on the price for the inconvenience and due to no sea view and to smaller room, 165 Euro instead of 195 Euro for 3 nights. Daisy had then to pay the difference of the price to Sunrise in case of such. At this point the guy from Daisy left us and people at Sunrise \"took care\" of us. They were very rude with us and we had to wait 20 minutes to be able to check-in. Eventually we could check-in. The room was horrible. It was very dirty and there were brownish-red incrustations on the sheet. Besides, the WC didn't work. We went down at the reception and they say they will clean the room and fix the problem with the WC. At this point we went out for lunch and we get back after at least 1 h. The room was still dirty, there was a lot of dust and sole spots on the floor and the WC still didn't work. They didn't change the sheet on the bed, they simply put a fresh one on the top of it. That was too much for us, we decided to leave and wanted to get the money back. We had to discuss 10 minutes with them in order to get it. They claimed we already checked-in and we should pay the first night (55 Euro) even if it was 2 pm. I was also concerned about the recipe they gave us - more a sheet of paper than an official recipe - and I was worried they claimed we didn't pay yet. At the end we could get all the money back.This is a family-owned hotel and is very difficult to talk with a manager or to complain for the service. They were totally rude with us and absolutely not professional. The only good point is the central position of the hotel, and I suspect they only rely on this positive point. Most of the client are tourist and most probably won't get back to Istanbul very soon, and the hotel is very aware of this. I strongly suggest you avoid this place if you don't want to get bad surprises. I hope to be of any help for future travelers. We loose half a day of our holiday in Istanbul because of Daisy and Sunrise Hotels. Holidays should not start like that.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lund, Sweden", "Title": "“Perfect”", "Author": "VjollcaB", "ReviewID": "UR103470819", "Content": "The hotel is very nice, clean and staff also. In the lowseasons low prices, and very nice service!", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“it's a fairy place with very unusual atmospehere that makes you feel life”", "Author": "agentvictoria", "ReviewID": "UR98065765", "Content": "small hotel in the old part of Istanbul, for those who are tired of fussy cities and want to spend some time in a quiet and relaxing atmosphere. Very close to Blue Mosque and Aya Sophia, and some small ancient, but extremely beautiful mosque, just some 5 mins, with nice narrow streets with old wooden buildings on the way to sea front. Very friendly staff always ready to help... Not many people, mostly Europeans, living in a hotel... Very tasty national food, especially dishes Anatolia ;)) Lovely terrace at night, early morning and late evening...... especially, with having traditional Turkish coffee, local konyak and water pipe. unusual place with very good energy that helps to feel & understand Istanbul", "Date": "February 26, 2011"}, {"Ratings": {"Overall": "2.0", "Service": "1"}, "AuthorLocation": "Sydney", "Title": "“Food and service is horrible”", "Author": "js5004", "ReviewID": "UR87825069", "Content": "We didn't stay this hotel but we had a dinner in the restaurant which is in the part of the hotel. The name of the restuarant is Safak. The location is good. away from the busy main street. However the quality of food and service was bad. We ordered mix Mezze for our entry. It was average. Then we ordered mixed kebab and lamb casserole for our main. The meat was cold and the portion was really tiny. And the taste was worse than street kebab. I had look the kitchen after been to the bathroom and I realised that they dont have a proper kitchen. They don't have a grill. They just have a little stove. No wonder meat qulaity was bad. When we pay the bill, we were charged 10% extra for the tax and it wasnt written anywhere in the menu. Overall I didnt enjoy food and service at all. I recommend not to go this restuarant. I am not sure the hotel but i guess hotel wont be better than restaurant.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Budva, Montenegro", "Title": "“I will not come back to this hotel!!!”", "Author": "Bonochka", "ReviewID": "UR86197445", "Content": "I was there in October with my friend. It was my second time in Istanbul and first (and last) time in this hotel. Actually, location is super, but honestly it can not be ***stars hotel. First of all we was there 6 days and there was no cleaning at all. Third day come lady but she just change towels (not all). Breakfast is terrible. Every morning the same: boiled eggs, some cheese, tomato, cucumber and small packages of butter and honey. There was one family with us which bought breakfast every morning in the shop and brought in a restaurant. In the ground floor of the hotel is restaurant and in the evening they are starting with very loud music. I couldn't sleep and I had to go downstairs to ask them to turn off the music. Doors in the bathroom was broken and there was very bad smell....... As I understood, the owner and all employees are one family and they was very nice and hospitable, but I now that for the same money you can find much better hotel and service.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely, friendly hotel in central location”", "Author": "Musil100", "ReviewID": "UR69721430", "Content": "This is a great value little hotel, very clean with a good little restaurant and very helpful and friendly staff. I had a few days in Istanbul to explore the sites and this was in the perfect location, close (but not too close!!) to the central area. I would defintely come back here again.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Welwyn Garden City, United Kingdom", "Title": "“This is not a 3-star hotel”", "Author": "190740Claire", "ReviewID": "UR67796118", "Content": "I would say it is a 1- star hotel. Nobody cleaned the rooms during our 3-day stay. You could hear the music from their restaurant till 2 ocloc'k at tnight. So many sleepless nights at this hotel. ..I would NOT recommend it to my friends.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Wonderful people and service.”", "Author": "cindysaur", "ReviewID": "UR62366509", "Content": "The service was personal and outstanding, they really made our stay an absolute pleasure. Owner, Ercan, always friendly and accommodating, going out of his way to take care of us. Bar/ waiter, Salih, really went the extra mile and took excellent care of us! Very entertaining and knows his wine. Excellent location.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Englan", "Title": "“Excellent hotel”", "Author": "Spanish66", "ReviewID": "UR61911279", "Content": "Fantastic central location very close to the Blue Mosque and Grand Bazzars, beautiful views of the sea from the roof top terrence. Excellent rooms, lovely and clean, staff were very friendly and helpful. The bar and restaurant had a fantastic atmosphere, overall had a great stay and would definately recommend this hotel.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "maarssen", "Title": "“nice and friendly”", "Author": "lomboks53", "ReviewID": "UR53688761", "Content": "We have a very nice stay in the Sunrise hotel. Friendly and helpfull personel. Good breakfast and a fine restaurant. The hotel is situated in the centre of the old city. All highlights are on walking distance. This hotel is not yet suitable for disabled people. Rob & lies from Holland", "Date": "January 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Salt Lake City", "Title": "“Quaint, family-run hotel”", "Author": "tilfyre", "ReviewID": "UR30054068", "Content": "We stayed here for 4 nights. Probably would pick a different place if we were ever to return to Istanbul. I would rate this a one-star hotel. Pros: -Good breakfast in the restaurant -Good location in the Sultanhamet -Friendly family that runs the place -Inexpensive. Cons: -Locked out at main entrance after returning at 2am. Room key does not work on main entrance. No advance warning that door is locked at night time. Very difficult to reach someone to unlock for us. (knocking on doors, persistent calling) -Locked in at 6am. Had early departure, and had advised the hotel the day before. Again, very difficult to to reach someone to unlock for us. -Very noisy central stairway can be heard from inside room -No top sheet, only bottom sheet and itchy blanket -Unpredictable hot water -WiFi signal only available on ground level and very unpredictable -Bathroom could have been cleaner", "Date": "May 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Stockholm", "Title": "“YUCKY and WEIRD”", "Author": "D-TAdventures", "ReviewID": "UR28454960", "Content": "We had not booked a room for the last night of our 9 day trip within Turkey since this was our first time here and while we had booked a hotel for the first 3 days in Istanbul, (we were traveling in other parts in between) I didn't want to book a room in the same hotel if we had been unhappy with it the first time....BIG MISTAKE. Pictures, etc. didn't look too bad on the site when we decided to book with Sunrise, so with a day to spare before needing a room before flying back home, we tried it. Upon arrival, we \"checked-in\" (really, just showed up) and were shown our room - just behind the check-in podium. It was fairly large with a sitting area and an adequate bathroom. When getting into bed that night, there was no bed sheet, just a regular sheet placed on the mattress and a furry blanket to put over ourselves (which included human hairs sticking to it). After getting over this, I laid my head on the pillow and it smelled like someone else had been sleeping on it....gross! The next morning, we awoke eager to get our breakfast and check-out behind us. The restaurant where you have breakfast is attached to the hotel so we tried to tried the front door of the hotel to get out and go to the restaurant next door and it was locked.....waited for the 'cook' (I think it was the owner's mom) to butt out her cigarette and unlock the door to let us out....Then, we went into the restaurant since eating outdoors would have been too cold, we were surprised to see a man sleeping on one of the booth seats with a blanket over him.....a little uncomfortable and we opted to freeze and eat outside. We have come to the conclusion that we think our last minute booking took the family out of their own bedroom...and although very generous and accommodating, completely unprofessional and unsanitary. Breakfast was fine, but we would never consider going back.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Luck to meet Murat - Ercan”", "Author": "haydut", "ReviewID": "UR7481539", "Content": "suzana lee & mark London-uk Thank you Murat,Ercan,Sevim We stayed at sunrise hotel last week. And we loved the family very very much. They are very nice and firendly. We really want to visit again the city and family. Hotel is magnificent , I will recemend to everyone I know.", "Date": "April 29, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "edinburgh", "Title": "“a good story...”", "Author": "rmitch614", "ReviewID": "UR7340868", "Content": "I would like to review the Sunrise Hotel, however I never got the chance to stay here despite making a reservation more than two weeks in advance. Here is the story: Having just taken a 14-hour train ride to Istanbul, we arrived at the hotel and were immediately told that there was a problem with our reservation. The concierge reassured us that they had another place for us so I figured they had another location in the city and we were simply being moved there for our 2-night stay. How wrong I was. We were picked up by 2 sketchy, overly cologned men in a random car and driven 5 minutes away to a youth hostel that had absolutely no association with the Sunrise Hotel. We had booked a twin room with private ensuite at the Sunrise, and while we were given the same at this youth hostel, it wasnâ€™t exactly what we were expecting. The sheets were dirty (we could actually see marks on them), there was unidentified trash under no bed, toilet paper was nowhere to be found, and there was actually a hair on the soap provided! We went to bed fearing for out health and safety. We ended up checking out after one night and moving to a friendsâ€™ hostel (for a lot cheaper and nicer environment!). They tried to charge us the same amount as the Sunrise but luckily we were able to barter $20 off the price (we were still clearly robbed). While Istanbul was absolutely gorgeous and one of the most amazing places I have ever seen, the lack of professionalism from the Sunrise was very disappointing. If there was a problem with our booking, they should have written back so we could have booked somewhere else instead of shipping us off to some creepy, unsanitary hostel. If youâ€™re staying at the Sunrise, I might advise calling ahead to make sure they have a room for you, lest you end up in the same ill-fated situation that I encountered. At least it makes a good story right?", "Date": "April 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "praque", "Title": "“lovely hotel”", "Author": "ameliatyler", "ReviewID": "UR6817364", "Content": "Staff were friendly and welcoming, Rooms were comfortable and stylish and the food was excellent. The bathroom was amazing!", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MADRID", "Title": "“Thank you brothers”", "Author": "JUANBRYANT", "ReviewID": "UR6786248", "Content": "The brothers (ERCAN and MURAT) are so helpful and so friendly. The service is fantastic. The room is sufficient and comfy. As we are from China, we are not familiar with central heating system, we felt very cold at night. So they were kind enough to lend us a heater in the middle of the night (3am). Thank you so much! They were very accomodating when we had a late flight on daparture date and they allowed us to leave our luggage at the counter .They also arranged for late room cleaning so that we can check out alittle later. Total customer service! The breakfast was nice, fresh from the oven when we gave them our choice. There were three or two choices on the menu. The location was fabulous. Within walking distance to Blue Mosque and Sultanahmetion, to a huge Grand Bazaar and more......The bus service near the hotel goes all the way into central area. The toilet is super clean. Spotless....... Their sister Sevim provided kettle as compared to some 4-star hotel in some europe place which did not. We were pleasantly surprised. Just to inform, there is no lift (all the bed and breakfast there has no lift anyway). Nothing bad to say....... Will absolutely stay there again and again.", "Date": "February 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "milano", "Title": "“nice hotel”", "Author": "andreaMilano", "ReviewID": "UR6559122", "Content": "I stayed in Sunrise Hotel last week and I liked them. The hotel is small but has nice and large rooms. I had all my dinners at their restaurants. Sevim's foods were excellent. Thanks again all of you.", "Date": "January 6, 2007"}], "HotelInfo": {"Name": "Sunrise Hotel", "HotelURL": "/ShowUserReviews-g293974-d567678-Reviews-Sunrise_Hotel-Istanbul.html", "Price": "$66 - $140*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kucuk Ayasofya Caddesi No:36 Sultanahmet</span> | <span class=\"extended-address\">Sultanahmet</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34400</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "567678", "ImgURL": "http://www.venere.com/img/hotel/8/3/0/4/224038/224038.jpg"}}