{"Reviews": [{"Content": "Central, convenient and clean Il Porcellini is a great place for someone on a budget to stay . It is clean and very central for the Duomo, the Uffizi, the Ponte Vecchio and other 'must see' locations. There is a kitchen if you want to self-cater, no food provided on site but lots of places to eat within yards of the front door. Not a destination in itself but you don't go to Florence to sit in your hotel room.", "Date": "Oct 14, 2008", "ReviewID": "UR282751487", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "awle"}, {"Content": "Great hotel and a great location We stayed in this hotel for 2 nights and it was everything we needed and everything we expected--no surprises. The location was absolutely PERFECT. Although if you have a room in the front you will hear the street noise from the street merchants in the piazza across the street. Simply ask for a room in the back.The air conditioned room was a comfortable place to crash and a place to drop the shopping bags we collected throughout the day. And compared to the other hotels in the area it was a great value. Although the breakfast was nothing but some pre-wrapped croissants, breads, and spreads. I would definitely recommend this to budget travellers simply looking for a no-frills place to stay.NOTE that I found this hotel listed on 2 travel sites-- Venere.com and Travelocity. The total on Travelocity was $375 (US dollars). The total on Venere.com was $255. Same dates same room. My advice--do your shopping (also try contacting the hotel directly). You pay the hotel directly through Venere and it may not post on your account until a week or so after the stay.", "Date": "Sep 21, 2008", "ReviewID": "UR787550219", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "TMeric2"}, {"Content": "Brilliant Hotel! Me and my friend stayed at Il Porcellino in Florence and had a fab time. The hotel is slap bang in the middle of Florence within walking distance of all the sights, in a lovely market square. Which can be noisy early in the morning as the market traders are setting up but i managed to get used to the noise and quite liked the experience of staying in a busy Florentine market. Maybe its best to take ear plugs if you're a light sleeper! Although there is no breakfast provided the hotel has a nice little kitchen you can use to store your cereal, bread, juice etc. The rooms were decorated nicely with air conditioning and TV. Bathroom was cleaned daily. The staff originally made a mix up with our reservation, we had asked for twin beds for 4 nights. They mis booked us and could only provide a twin room for the last night, but they did offer us 2 single rooms for the first 3 nights, which we accepted gratefully as we had our heart set on this hotel due to its location and bargain price. The staff was very friendly and always replied to emails promptly.I quite liked the fact it was quite a private hotel with the door code to come and go as you please. Overall I would recommend this hotel and Florence in general is a beautiful place. Would definitely go back.", "Date": "Oct 11, 2007", "ReviewID": "UR191087478", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "tcotton"}, {"Content": "Wouldn't stay there again We stayed there for 3 nights and I found it not worth the money. Our double room was shabby. The bedspread was dirty/stained. The bathroom smelled funny. The shower enclosure was rusty and mildewed. I didn't want to walk barefoot in the room or bathroom. I felt like it was a lot of money for the accomodations. The best thing I can say about it was the location was great, but I have stayed in nicer places in the same vicinity for less.", "Date": "Jun 14, 2007", "ReviewID": "UR178324992", "Ratings": {"Service": "-1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "GeorgiaItalytraveler"}, {"Content": "Basic Room in Good Location       View of room from window", "Date": "Jun 4, 2007", "ReviewID": "UR268099724", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "FlexibleYuppie"}, {"Content": "Great location, needs updating Stayed here for 3 nights in late May 2007Pros - Location is excellent - close to all major tourist attractions and it's not that noisy as the market begins setting up at around 8am and is shut by 6pm.Cons - booked through Expedia which listed it as a BB. In reality, there is no second B - on arrival, the in-room brochure tells you to go across the street for breakfast at the special rate of 6E/person. Also, we arrived at 11.30am and could not get into the building (front desk is only open from 8-10am and 5-7pm and the front door is locked). If a cleaning lady hadn't turned up at 12pm we would have been stuck with our luggage until 5pm - best to call ahead and ask if someone will be there. Finally, as with other reviews, the bathrooms are very smelly (old plumbing probably) and the rooms could use an update.Overall the place is OK, but could be great if they improved customer service and applied a fresh coat of paint", "Date": "Jun 4, 2007", "ReviewID": "UR947798968", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "5"}, "Author": "Bear29NewYork"}, {"Content": "Great location, but.... The pros: Great location. Uffizi is about a five minute walk away. All the major sites are within walking distance (though this would be true for other venues as well).The cons: My room was essentially a closet (so beware if you book single occupancy). I think the room might have been about 7 or 8 feet wide. The bathroom had a funny odor - old plumbing? Very noisy. The clamour from the market will wake you up (very early) each morning.Not really a good a value for the money spent.I booked through venere.com. If you do decide to stay here, book directly through their website and save some euros.I wouldn't stay here again.", "Date": "May 28, 2007", "ReviewID": "UR539268003", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "4"}, "Author": "Traveller228"}, {"Content": "If only the owner was as charming as the property !!! We knew we would be arriving late at night and so we asked for directions in advance. The directions were just awful and we drove around for a VERY long time! We finally paid a cabdriver and followed him to the location only to find that the place was locked tight. Not a problem, we thought - we would just call and get the access code. Uhhhhhh nope! The owner does NOT answer his phone. We ended up staying the first night in our car :( !!! Now, in defense of the proprietor, they did email us entrance instructions prior to our arrival, but they also said that if we had ANY problem, we could just call.When we finally got into our room the next morning, it was really charming and absolutely immaculate. And, the location couldn't have been better for us. It made up for the terrible first night in our very small rented Fiat. On our last day, we asked the proprietor if he could somehow make good on the fact that we never got to stay in the room on the first night. His answer was a very curt NO. We then asked if we could check out an hour or two later than the scheduled checkout, as we didn't want to leave our luggage in the car as we continued to tour Florence. Once again, a VERY curt NO ! Frankly, given that we paid for the room for a night that we were not able to gain access, I found it unreasonable. I also think it's very poor business to leave guests with an in case of trouble or emergency phone number that is not answered.", "Date": "Oct 31, 2006", "ReviewID": "UR946956769", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "5"}, "Author": "katiecakes"}, {"Content": "Good location and wonderful for the price.       View of the Mercado out of the window of our room", "Date": "Jul 27, 2006", "ReviewID": "UR630747637", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "bguy24"}, {"Content": "A gem in the heart of Florence! What a steal! Il Porcellino is a six room guest house in the heart of Florence. The owner greeted us with a warm smile and helped carry our bags up the 2 flights of stairs to our room. Our room was large and charming and the owner gave us excellent dinner recommendations every night with the tip tell them that you are staying at Il Porcellino. They only down side is that there is a leather market right in front of the hotel. The vendors start setting up their stands around 8AM every morning which can be a bit loud. We stayed in room number 3 (in the back) in order to avoid the noise from the market. Its still a little loud if you want to sleep with your windows open, but we were only awoken once out of four mornings. Overall this is a quaint hotel just a block from the Piazza della Signora and 3 short blocks to the Ponte Vecchio. It's a steal for the money! I highly recommend this hotel!", "Date": "May 16, 2006", "ReviewID": "UR619715179", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hostess' local knowledge was priceless       The room's window opened to the alley", "Date": "May 16, 2006", "ReviewID": "UR699804715", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Deroc"}, {"Content": "Excellent hotel! This was a great BB with an excellent location. The owner was very friendly and helpful and spoke great English. The location is right next to the Mercado Nuovo in the heart of Florence. The room was clean and spacious. The value was great (paid a little over $100/night) for the center of Florence. The only drawbacks would be there is no breakfast provided, and the noise from the Mercado could be disturbing if you want to sleep in. Otherwise, an excellent value!", "Date": "Jan 21, 2006", "ReviewID": "UR449426015", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "El hotel me parece excelente...   showReview(20522117, 'full');", "Date": "Sep 20, 2008", "ReviewID": "UR333426035", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Bien mais le bruit des...   showReview(12805863, 'full');", "Date": "Dec 30, 2007", "ReviewID": "UR371221414", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Beste Lage alle Sehensw眉rdigkeiten zu Fu脽 zu erreichen   showReview(11667195, 'full');", "Date": "Oct 14, 2007", "ReviewID": "UR938062750", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Un bon accueil, la bonne...   showReview(12650472, 'full');", "Date": "May 26, 2007", "ReviewID": "UR324362245", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "Il Porcellino Tourist House 猫...   showReview(11401134, 'full');", "Date": "Mar 8, 2007", "ReviewID": "UR375052056", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d567765-r20871674-Il_Porcellino-Florence_Tuscany.html", "HotelID": "567765", "Price": "$160"}}