{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Clean, great value”", "Author": "DaisyMalu", "ReviewID": "UR17630636", "Content": "Hotel in Parione (aka Dipendienza Smeraldo) was a great find. Located just a few minutes from Campo di Fiori on a quiet side street, it was peaceful and exceptionally clean. The room was a bit small - but that is standard in Europe. Make sure when you go, you check in at Hotel Smeraldo and they will provide you with a key and walk you across the street to the new property.", "Date": "July 7, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego, California", "Title": "“basic hotel with EXCELLENT location”", "Author": "NayKat", "ReviewID": "UR8861659", "Content": "Stayed at Hotel in Parione for 2 nights during Oct 2006. Once we located the hotel, we had to back track to another hotel to check in (which was a bit different...). The room itself is clean, basic and quiet. Location is EXCELLENT ! Paid 125 Euro for per night.", "Date": "September 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jacksonville, FL", "Title": "“Loved Hotel in parione”", "Author": "mayerfan83", "ReviewID": "UR8280316", "Content": "We stayed there for our honeymoon and it was the best hotel we stayed in while in Italy. Your room looks right out onto the street which is loaded with lots of little stores and an awesome bakery right next door. Super Clean rooms and bathroom, amazing view of rome from the rooftop deck which is like having your own deck since everytime we went up to it NOONE was there. Very private and you can walk EVEYWHERE, we never took a cab once!! Campo de fiori is probably 1 block away which is great for conveniene since thats where all the action is at night.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Copenhagen", "Title": "“All you need is...”", "Author": "HHHCopenhagen", "ReviewID": "UR7645599", "Content": "If you are a tourist in Rome and all you really need is at place to store your luggage and sleep, In Parione is the place for you! It's clean, it's not expensive, and the location is absolutely PERFECT! If you are looking for excellent service, a great breakfast and an impressive hotel, In Parione is NOT for you. You have to take it for what it is - a perfect place to stay the night. There are so many things to see and do in Rome - so many options - so my advise to you would be: don't waste your time (and money) on a hotel.", "Date": "May 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Loud and Lame”", "Author": "Hampy", "ReviewID": "UR6751951", "Content": "My wife and I stayed in this hotel on our Honeymoon in September 2006. It sounds like we stayed in the same room as the reviewer from San Diego. High heels were clomping above us at all hours of the night; construction RIGHT outside our room door began every morning at 8am; other guests yelling at each other in the middle of the night; front desk clerk recommending overpriced restaurants. My wife stayed at their sister Hotel the previous year and was much happier. We will not stay here again.", "Date": "February 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfectly Adequate”", "Author": "Mitford", "ReviewID": "UR6160713", "Content": "This hotel is in the perfect location, within walking distance to lots of the main attractions and close to all the action around Campo de Fiori. The room and bathroom are pretty basic, but we didn't spend a lot of time there, so didn't care. The only complaint is that there was building work going on in the hotel or just next door, which started at 8am on the Monday morning-slightly early for us! Other than that, it was perfectly adequate for us and I would recommend it to people looking for a cheap hotel in a great location.", "Date": "November 21, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "methuen, ma", "Title": "“Questionable Ethics”", "Author": "bim36bo", "ReviewID": "UR6121407", "Content": "DO NOT BOOK THIS HOTEL UNLESS YOU ARE \"ABSOLUTELY\" SURE YOU WANT TO STAY HERE (or their sister hotel, Smeraldo). I had made reservations for Hotel in Parione 10/02/06 for May of 2007 and cancelled 10/04 due to my husbands health and his doctors recommendation. There policy is NO cancellation!! Regardless that they have 7 months to book the room. Since then I have checked the policy of all other credible hotels and the policies vary from cancelling 1 week before to 1 night before, but this practice is unheard of. By the way, I did offer to pay any fees incurred by the charge card company and they agreed to bill me 1/2 the nightly rate. This didn't happen. They charged my credit card for one full night ,(which I am disputing) because they \"changed their mind\".", "Date": "November 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Will not stay there again...”", "Author": "doggiedaiz", "ReviewID": "UR6032967", "Content": "I spent one night at the Hotel in Parione just so I could catch my early flight out of Rome the next day. Most everything in my price range was completely booked so I stayed here thanks to the great central location. The location did turn out to be perfect and the room was extremely clean but that is about all I liked about this place. The staff was abrupt with me and one of them down right rude. My TV didn't work. The water pressure in the shower was great but the shower base was only about an inch deep so I had to turn the water way down so it wouldn't overflow onto the floor. So much for good water pressure! The worst of it was the noise on the street just below my window. The closed window and shutters did NOT block out the street noise at all! It was Saturday night so the loud people were out until about 3am. I wanted to sleep wearing my earplugs but then I wouldn't hear my 5am alarm... so I was stuck trying to sleep with all the noise. There was also a women upstairs from me who must have been wearing heels. The sound of her shoes clomping around on the hard floors echoed through my room. It sounded like hammering in the middle of the night. Last but not least, everytime a door would close on my floor the slaming noise would also echo through my room startling me each time. Not fun when contemplating 24 hours of travel to get home starting the next morning!!", "Date": "October 31, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Perfect Location!”", "Author": "loveineurope", "ReviewID": "UR6024374", "Content": "My husband and I just got back from 5 nights at Hotel in Parione, which by the way will be changing it's name to Smeraldo Hotel( the name of it's sister hotel). We enjoyed our stay very much. We had room 102 and it had a window looking out over the street. Our room was fairly large by European standards. We had a very nice queen size bed with room to walk around. The room was very clean with ammenities that you don't find in all 2 star European hotels. We had nice big towels, shampoo, air conditioning and a hair dryer. Yes, the bathroom was fairly small but suited our needs just fine. Although the staff wasn't extremely friendly they were very courteus and helpful at all times. It was noisy at times. When the shower was running in the next room it was very noisy. Since we were in Rome we were expecting noise so it didn't bother us much. The best thing about this hotel was the wonderful location. We were able to walk just about anywhere we wanted. It was just around the corner from Campo de Fiori and just a short walk to our favorite spot Piazza Navona. With the Rick Steve's 2006 guide book we paid only 115 euros a night which we think is a bargain for this hotel in this terrifice location. We would definitely stay here again.", "Date": "October 29, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belfast, Northern Ireland", "Title": "“Great location”", "Author": "N_Irish_CityTravel", "ReviewID": "UR5884727", "Content": "This hotel is in a fantastic location - very short walk to Campo di Fiori or Piazza Navona. A 15 or 20 minute stroll to Colosseum, or the Vaitcan in the opposite direction. The hotel is very clean. Don't expect huge rooms - particularly the single room. The width of the room is a single bed and doorway. The length of the room is the length of the single bed. The bathroom is the width of a shower door. BUT, with a location like this it's to be expected. The double rooms I saw were slightly larger relatively speaking - i.e. there was room to walk around the bed! This was the second time I stayed in the hotel, and maybe the staff were just having an \"off\" week - or perhaps it was I had just arrived from a hotel where I couldn't believe just how friendly the staff actually were, but I felt a little off-put by some of the staff.", "Date": "September 28, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“Comfortable Stay in Great Location”", "Author": "bostontraveler2", "ReviewID": "UR5610058", "Content": "We had a pleasant stay at In Parione in early May. In Parione is a small hotel steps from the Campo de Fiori and surrounded by shops and cafes. The location is very good and we were able to walk most places including to the Vatican, back from the Forum, from Trevi Fountain, and to Piazza Navona. All within steps from the hotel is a good place for lunch (Cafe Modern and try the antipasto buffet), a nice cafe for a morning Cappuccino, and a good bakery right next door. The rooms are small but clean and serviceable. We had a courtyard room with French doors leading onto a small balcony. We made the mistake of leaving these doors open the first evening only to realize that the hotel’s elevator is also in the courtyard by guests who were returning home late. This is not a flashy or luxurious hotel, but a clean and comfortable hotel at a good price in a great location. We had no problems during our stay and the hotel can’t be beat for the price.", "Date": "August 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Virginia", "Title": "“Great location”", "Author": "Virginia creeper1", "ReviewID": "UR5395259", "Content": "My wife and I stayed at Hotel in Parione in May 2006 for 125 Euros/ night. The room was on a \"courtyard\" (other walls visible, but not the ground) and was very quiet at night. The room and bath are quite small, but comfortable and very clean. The location is teriffic. The street is one-way and narrow enough to discourage much traffic, and main streets are 1-2 blocks away. Convenient buses on Corso Vittorio Emanuele and trams to Trastaverse, but if you like to walk you can get to most of Rome's sites easily on foot from here - Vitt. Emmauele monument, forum, Spanish steps, Trevi Fountain .... We'd stay here again - it seemed a good value at the price. The hotel claims to offer breakfast for 7 Euros, but we never saw a sign of life at the small coffee machine/ breakfast table on the 2nd floor - perhaps they'd come if you called them. There's plenty of food available just outside except for Sunday morning, when most cafe-bars and bakeries don't open until 10:00 or later. They also tried to sell us opera tickets- must get a good commission. There's plenty of entertainment in Rome.", "Date": "June 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Rome 2006”", "Author": "A TripAdvisor Member", "ReviewID": "UR5332127", "Content": "My husband and I just returned from a trip to Rome, Venice and Florence. To get to the hotel you can catch a taxi for about $70 american dollars or you can take the leonardo express train and then the bus for about $12 US a peice. The hotel was very clean and centrally located. The bus stop is just a few minutes away, although you should make sure to lock your backpacks and ride with your hand in your wallet pocket. We had both a camera stolen out of my backpack in the metro and an attempted wallet snatching on the bus. The city is wonderful but you should take caution on public transportation, especially a full bus or metro. They distract you by pushing and all the while they have their hands in your pocket. The hotel has a bakery next door that is good for breakfast and a cheap lunch. Down the street and around the corner an \"internet point\" to check your e-mail. There is also a small supermarket that is close for buying water, snacks and fruit. You can also find an insalata rica just down the street for dinner. The restaurant just down the corner is good but a bit expensive - trattoria moderna. Campo de Fiore which is close is a good place for young people but I would recommend Pizza Navona instead for a comfortable night stroll. The hotel recommends and opera which we attended. It was nice enough for a person that is not a great fan of opera. If you are a true fan, I would recommend an actual opera house. We never ate breakfast at the hotel but the staff was attentive and English is spoken for those of you who dont dare attempt your Italian. The shower is extremly small in the double rooms. My husband sometimes needed to open the door to scrub his legs and don't get me started on the shaving! It was cold most days and there was rain. Pack a light jacket and an umbrella just in case.", "Date": "June 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Washington state", "Title": "“Superb location”", "Author": "Madcapmary", "ReviewID": "UR4939537", "Content": "Hotel in Parione Superb location. This tiny 15-room hotel bordered by Campo dei Fiore, Via Giubbonari, one of Rome’s great shopping streets and within spittin’ distance to Piazza Navona, Pantheon, rapid transit, and the Jewish Ghetto, was a good choice for me. Maybe because I speak some Italian and booked far in advance I was given a fine room at 95 euros a night. It was beautifully decorated, had a tiny but spotless marble and travertine bath and the room faced the street with a view of San Carlo ai Catinari and neighboring apartments. Musicians played Italian love songs and Sinatra tunes from morning to night. An Internet shop was half a block away, bakery next door, spa and salon two doors away, bar where I had my daily cappuccino and cornetti kitty corner and a fully functioning ATM Bancomat one block away on via del Monte di Farina. However, none of the desk clerks spoke “perfect” English or even close, the TV was characteristically temperamental (but who cared?), the street is narrow so taxi drivers hated it, the area is dreadfully dirty but oh, the atmosphere! The shopping! The food! The people! I would stay at Parione again in a flash.", "Date": "April 5, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Cleveland OH", "Title": "“A mixed experience”", "Author": "Chowlover", "ReviewID": "UR4830029", "Content": "We spent 3 nights at the Hotel in Parione. The room was small but scrupulously clean. There was peeling paint and plaster here and there, however. The room has a balcony about 3' x 2'; in the air shaft outside was the counterweight and other elevator components. Whenever anyone used the elevator, there was a loud THUNK and musical bells (all night long). We wanted to close the windows to block out this noise (as well as the loud family living across the way), but the air conditioner blew only hot air (the desk clerk told us that A/C doesn't come on until June although our reservation indicated that the room WAS air-conditioned), so our choices were either to sweat (it was warm during our trip) or be kept awake by the noise. The location was excellent (close to Piazza Navona and Campo dei Fiori, but on a side street with an excellent bakery next door). The desk staff was friendly and helpful. The TV was missing its remote control, and it took a day until the clerk could locate a replacement. As another reviewer noted, the shower is small (don't drop that soap!); the water temperature fluctuated quite a bit as well.", "Date": "April 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Torrevieja, Spain", "Title": "“Sweet surroundings”", "Author": "A TripAdvisor Member", "ReviewID": "UR4474074", "Content": "The location of this hotel, in the heart of Campo de Fiori, couldn't be sweeter. It is right in the middle of everything. The front desk spoke perfect English and were always willing to help us out. The roof/terrance sets the scene for a romantic evening in Rome (even in freezing February!). A perfect coffee shop is right across the street, the most amazing bakery, is right next to the hotel, a small market is right around the corner. We loved it there. (Plus, the rooms were nice, clean and well taken care of each day). It was a treat!", "Date": "February 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Belgium", "Title": "“Happy with hotel, but no internet”", "Author": "LSUvetgirl", "ReviewID": "UR4362124", "Content": "My friends and I stayed at in Parione for 4 nights in early January. I was very happy with the location of the hotel; an easy walk to the Campo dei Fiori, Trastevere, the Forum, Pantheon, and Piazza Navona. The streets were full of people until the wee small hours of the morning, but our room (only on the first floor, facing the street) was well insulated from the road noise. My only complaint, however, is that their web site staed that all rooms had internet access, which is NOT true. We brought our laptop and when we asked downstairs the desk clerk said there was no internet access and looked at us irritatedly when we suggested that their web site should be changed to be a bit less misleading. He handed us a flier for an internet cafe. On the plus side, there is a nice, roomy lift, and the rooftop garden was a nice little bonus. The helpfulness of the desk clerks was quite variable. We encountered some that were extremely friendly and helpful, offering wonderful dining recommendations, etc. and some that were downright surly. All in all, for 80 euros a night in the low season, I would definitely stay here again.", "Date": "January 19, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Israel", "Title": "“Great Location”", "Author": "Halutznik", "ReviewID": "UR4093973", "Content": "We chose this hotel because of reviews we had read and especially because of the location. It's located on a narrow cobblestone street walking distance from the Forum, Piazza Navone and the Pantheon. It's a neighborhood with lots of character and we loved it. There is no lobby just a reception desk at the end of a narrow hallway. They were extremely helpful at the reception. We had three rooms - 2 doubles and a triple. All of the rooms were simple and clean. The TVs were very small with limited viewing (only CNN for English speakers). But we weren't there to watch TV so that was ok. The price did not include breakfast although for an additional 7 Euro per person you can have breakfast in their small dining area. There is also a terrific bakery just next store. We bought breakfast and ate it on the lovely rooftop patio atop the hotel.", "Date": "November 8, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Spotless and charming”", "Author": "dibaxter", "ReviewID": "UR3987125", "Content": "We (2 couples) stayed at Hotel In Parione for 7 nights in September. I can't say enough about its great location and the friendly and helpful staff. It is indeed small, but all our needs were well met. The king-size beds are super comfortable and the beautiful marble bathrooms just sparkled. Each day when we returned from hours of walking around the city, we'd take a snack and a couple of cold ones to the tiny rooftop terrace where we could escape the street noise, relax and recharge, and discuss our dinner destination. It's nothing fancy, just a table and a couple of plastic chairs, a few potted tropical plants and the air conditioning units (partially hidden by lattice), but it's a little bonus that you probably don't get at many other hotels. Who wants to relax with a store-bought birra while sitting on the bed in your room? I can't wait to return to Rome and stay at Hotel In Parione again!", "Date": "October 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Rome's Hotel In Parione is The Greatest!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3777353", "Content": "Rome’s Hotel in Parione is The Greatest! 10 years ago, my family and I spent a wonderful vacation in Rome, staying at the inexpensive, yet comfortable and centrally located Hotel Piccolo in picturesque Via dei Chiavari close to Campo de’Fiori in the center of Rome. In August 2005, on our return to the Eternal City, we re-visited this tiny hotel, now upgraded, refurbished and renamed Hotel In Parione. Hotel In Parione now boasts a gleaming new lift, all rooms have en suite bathrooms, air conditioning, telephone and satellite TV. Extra touches, such as plenty of soft fresh towels, soaps plus a hairdryer in the bathroom are included and certainly not commonly found in hotels costing a mere 85 Euro for a double room in the High Season in one of Europe’s capital cities! The room we were given was compact, clean and comfortable. The huge bed was ultra-comfortable and the entire room, carpet and furnishings were spotlessly clean. The bathroom was immaculate and the warm invigorating shower most welcome in the heat of Summer. A sink, toilet and bidet completed our gleamingly tiled en suite. The manager, Eugenio, and every one of his most helpful, charming multilingual staff attended to our every need and query. This service commenced many months prior to our arrival, with helpful Email correspondence to all our questions and reservations. Upon arrival, as ordered by Eugenio, a taxi was waiting for us at Rome Fiumicino airport and another was ordered for us upon our sad departure at a flat rate of 55 Euro and 48 Euro respectively for the trips. Breakfast is an optional extra and we found this most enjoyable and nourishing before a hard day of sightseeing. Breakfast is served at the sister hotel, Smeralda, just opposite Hotel In Parione, at a cost of 7 Euros each. Excursions to all parts of Rome are organized by the Hotel reception, should you not feel like foot slogging it as we did. Theater bookings are also arranged by them. A tour was organized by Hotel In Parione for us to Hadrian’s Villa and the Villa d’Este on our last afternoon in Rome. We were picked up at the Hotel and dropped again close to the Hotel that evening, at an all inclusive cost of 50 Euros per person. This 4-hour tour included a multilingual and very informative tour guide as well as all entry fees. Being close to most major noteworthy sights in Rome means minimal transport costs and is the ultimate bonus of staying at Hotel In Parione. My husband and I walked nearly everywhere and thus were able to see the most important historical sites such as the Pantheon, Piazza Navona, Spanish Steps, St. Peter’s, the Forum and Colosseum in just a few short days without the hassle and expense of public transport. If you are footsore, however, the Hotel is situated within 5 minutes’ walk of Piazza Argentina, from where buses depart to all parts of the city 24 hours a day. Just next to Piazza Argentina is the ancient Area Sacra, where (unknown to many tourists) on 15th March, 44 BC Julius Caesar was assassinated. Now Area Sacra is home to Rome’s huge colony of stray cats, lovingly cared for and fed by the citizens of this great city. Being in the historic Campo de’Fiori area is to experience Roman life as no other tourist is able to. By day, a colorful fruit and vegetable market is held in the square. Locals flock to this area in the evenings for its excellent and inexpensive trattoria, where the atmosphere, food and vino cannot be beaten. On our last evening in Rome, we had a wonderful meal at Tosca, a pavement trattoria in Largo dei Chiavari, just a stone’s throw from Hotel In Parione in the company of some friendly young Romans out on the town. To many, a holiday spent in Rome, alas, means also a fortune spent on accommodation. This need not be the case if you choose Hotel In Parione! When we tossed our coins in the Trevi Fountain, we certainly meant to return to Rome – and then naturally to Hotel In Parione!", "Date": "August 16, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Excellent budget option in Rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR3739459", "Content": "I will not repeat the very nicely detailed review of the visitor from June 2005 listed above, but I second all of his or her observations. This little hotel is very clean and quite comfortable. The air-conditioning (so very welcome in the heat of August) worked quite well in the small room and the noise of the street did not affect our sleeping at all. The location is superb and our price of 80 euro/night was exceptional. August is not a great time to be in Rome as it's very hot and most of the restaurants are closed, so I'm sure our rates reflected that, but I will always check In Parione in the future before booking anywhere else in Rome, as it would be a great deal at higher prices as well. Skip any included breakfast as options abound surrounding the hotel. The bakery downstairs offers great pastries but does not serve coffee. Another option we really liked was the Bernasconi, just around the corner on Piazza Cairoli. Their cornetti and cappuccino were very good and the counter staff was very nice and helpful. The only word of caution about the hotel is that the shower is exceedingly small and large travelers may find it difficult to use.", "Date": "August 5, 2005"}], "HotelInfo": {"Name": "Hotel in Parione", "HotelURL": "/ShowUserReviews-g187791-d568903-Reviews-Hotel_in_Parione-Rome_Lazio.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via dei Chiavari, 32</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "568903", "ImgURL": ""}}