{"Reviews": [{"Content": "Very good hotel and location I stayed here in September 07 and was delighted with the choice.It was still being renovated at this time but it didn't really affect us at all. Front desk were helpful and spoke english and were always on hand to write out locations on cards to give to the taxi drivers (this is v.important as taxi drivers generally won't be able to read the western alphabet on maps....why would they!?).The room was spacious, as was the bathroom and there was plenty of closet space. This came in particularly handy after a couple of visits to the silk markets!The bar was opened a few days after we arrived and it was decent enough. I can't comment on the restaurant or breakfast as we didn't try it while we were there.The subway stop is right outside the hotel which is great, especially when the main shopping street is 2 stops away and Tiananmen/Forbidden City a further stop on. I found the taxis great once you got over the language barrier. They were cheap, friendly and didn't try to rip you off.The one negative comment I'd have about the hotel is the gym and pool area. The gym consisted of one multipurpose machine. I couldn't even be bothered! The pool was fine but the changing areas were filthy. I only went down there once over ten days because of this.Overall a really good hotel for the money we paid but the gym could do with a bit of work.", "Date": "Mar 27, 2008", "ReviewID": "UR187610388", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "CMcC--Ireland-"}, {"Content": "Very comfortable and great value       view from room at Beijing News Plaza", "Date": "Feb 18, 2006", "ReviewID": "UR702319951", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "muy buen hotel   showReview(7286126, 'full');", "Date": "Apr 6, 2007", "ReviewID": "UR798642036", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "charliecai"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294212-d570095-r14567144-Beijing_News_Plaza_Hotel-Beijing.html", "HotelID": "570095", "Price": "$372"}}