{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eastbourne", "Title": "“Perfect London base for your London holiday”", "Author": "Septemberdawn1958", "ReviewID": "UR126251691", "Content": "The first thing we noticed as we arrived was the friendly and helpful staff at the Reception. They allowed us to store my daughter's wheelchair in a very convenient place and helped us to make our way to the lift. The hotel itself is very attractively decorated, and despite being New Year's Eve, very peaceful. Everywhere was clean, warm and very comfortable. Our room was extremely nice. Twin beds with neat attractive covers. Ample storage space is provided, along with the very necessary kettle and tea/coffee making requirements. Often we are rather disappointed with bathrooms in hotels, but this was an absolutely lovely one. Clean, warm and bright with both bath and shower! The water ran hot at all times and we were both able to have a bath during the afternoon, and showers when we returned from the incredible firework displays on the Thames. Lovely fresh, soft towels and tiny soaps and shower gels were provided, and the toilet was not only spotless, but had a paper cover over it. The view was lovely, at the back we looked over the tops of the buildings to the awesome skyline of london. In the front you would have lovely views of the square, and its gardens. We slept perfectly and in the morning went downstairs to sample the breakfast. The room was a little bare, but clean and tidy. The food was really good, and our waitress was helpful. It would be nice if the room were more attractive but we could not fault the service. The position of the hotel is so convenient for transport with stations around the corner, bus stops only five minutes from the door, and plenty of good eating places and entertainment only a road or two away. We enjoyed our stay so much that we have already re-booked for the Queen's Jubilee weekend, and intend to use this hotel again and again. The only downside that we experienced was the steps at the front and the lack of a disabled entrance. This was, however, a small price to pay for such a lovely hotel, a really perfect base for your London holiday!", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“great budget hotel”", "Author": "laurie t", "ReviewID": "UR125185412", "Content": "stayed here for 4 nights reception very helpfull,room clean and tidy tea & coffee great shower room 2 minute walk from tube station choice of full english or continental breakfast great budget hotel would stay again", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sisi, Crete", "Title": "“Nice and clean”", "Author": "Stefanos81", "ReviewID": "UR124258690", "Content": "If you are looking for a nice, basic and clean room then Chrysos is what you looking for. 2 minutes walk from paddington station!", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“You Get What You Pay For.”", "Author": "marcuslikus", "ReviewID": "UR123265788", "Content": "I used airline miles for my stay. Had I actually spent money, I'd probably have some different things to say. The place was very clean, I will say that. The public areas and my room were spotless. It could've used some fresh paint here and there. I stayed in a standard single. It was small, certainly by American standards, but I've actually had smaller rooms in Italy. The location was fantastic - 2 minute walk to Paddington. I picked this hotel because of the location first and foremost, and secondly it didn't eat up all my air miles. Front desk staff were perfunctory. They weren't rude. They just weren't overtly friendly. Would I stay here again? No. Would I recommend anyone to stay here? No.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Stirling", "Title": "“A good Hotel for a family”", "Author": "Kachanovka9", "ReviewID": "UR122568760", "Content": "Whilst this is not the usual Hotel for us and it is on the basic side, the fact that we could have a four bedded room for the night made all the difference. A problem is that if one is early one has to leave ones luggage in the entrance at one's own risk. There was no choice at breakfast except Continental or English, which consisted of one egg, a sausage, a piece of bacon and oh horror, baked beans. They did bring one without beaked beans when requested.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“staying in London”", "Author": "Dirk K", "ReviewID": "UR121791782", "Content": "The hotel is located in Paddington, and is 3 min away from Paddington station, so location is perfect. The reception is friendly, but the hotel niet some updating, like dripping taps,no airconditioner and the rooms are average, I have mentioned that there is a leak n the bathroom and nothing has been done about in the four days we stayed there, the breakfast is very plane and measured,again the staff is very helpfull.Otherwise the location is great, but the hotel is weathered.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Basic”", "Author": "goldfisharenice", "ReviewID": "UR119449792", "Content": "Everything but the room was pleasant.. staff, exterior, lobby etc.. but the room was a disappointment, looking as though a few second-hand pieces of furniture were scattered in the room. The rooms felt like an afterthought. It is centrally-located, but we stayed down the street another night for cheaper at a much nicer hotel. I wouldn't recommend it.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“London Stay”", "Author": "RosieR4", "ReviewID": "UR119242058", "Content": "We were booked into this hotel for 10 nights and it was certainly very convenient for the tube and mainline station. Also plenty of restaurants and cafes at the end of the square. The bathroom had no ventilation and was musty. It would have been nice to get a new soap while we were there. The room was clean and adequate as we didn't spend a lot of time there. Breakfast so so and the kitchen would benefit from a new toaster. found the staff at reception very obliging. there was a lift. Strange to have to request a hair dryer from reception rather than one in the room. I borrowed an iron but no ironing board so ironed on the bed.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "ATHENS GREECE", "Title": "“Quiet and cean”", "Author": "ARISTEIDIS P", "ReviewID": "UR119000601", "Content": "I satayed in the hotel 2 nights.Thahotel was situated 200 metres from Paddigton station (easy connection with Heathrow airport) and was near the centre of the city.The hotel was clean,the room also.There was free coffee in the room.The room was very small but very quiet.The staff in reception and in restaurant was polite.The only bad was the breakfast.I ate both days one fried egg,one slace of bakon,beans and one mall saussage served in a dish (no possibility for more).Anyway I think that the hotel waqs good for the money I gave", "Date": "October 6, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Ontario, Canada", "Title": "“Great location-”", "Author": "Goingtochicago", "ReviewID": "UR118024061", "Content": "We spent 5 nights at Chrysos Hotel in June of this year. Great budget hotel, which we found to be very clean. We enjoyed the full English breakfast (but agree that having the same food day after day gets repetitive). I would have appreciated having fresh fruit (oranges, apples and bananas would have been a definite plus) but not having them was not a big deal either. Coffee was really bad and we should have taken our bodum (which travels with us) down to the dining room. Again, not that big a deal since we were able to get our dose in our room upstairs. We did have a reservation situation, as we reserved double non-smoking accommodations and were given a triple (!) smoking room. This was a problem the first night, since our neighbours were very heavy smokers, but by keeping the windows open we were able to get rid of the smoke smell. As for the three single beds, well, let's just say it was not the most romantic room we ever had! Hotel management offered to switch us to a non-smoking room, but we ended up declining when they told us that we would loose the great view of the park if we moved, as all their non-smoking rooms are on the other side of the building (which to me is unfair to non-smokers). All in all, though, for the price and the location, I would recommend this place.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Tondela, Portugal", "Title": "“It could be so much better”", "Author": "Traveler1956110", "ReviewID": "UR115842785", "Content": "We went to London as a group of three people and we stayed at Chrysos Hotel for seven nights. Not good!! The building, yet very nice in the outside, in a garden-square, was very weird in the inside: strange closed dark places separate the bedrooms from the hallway; the floor of our bedroom was covered with an old carpet; we couldn't close the window and my bed was right on top of it; the cloths used in beds had holes and stains; the breakfast room was a bit dark and a little depressive due to the extremely sad furniture and the lack of sympathy of the staff (except one nice young girl); there was no variety in the breakfast, so you eat almost the same every mornings. And strange things happened: once we entered our bedroom and we found the bed coverings «scrambled» over the wardrobe. The staff gave us a very motivating explanation: they didn’t know. Though I must say the bathroom was extremely clean, the front desk staff very helpful and the butter served in the breakfast was very good! The hotel is located in a very interesting multicultural area of London, were you can find restaurants and supermarkets.", "Date": "July 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“A good option for a good value stay - good breakfast too”", "Author": "sirduncs", "ReviewID": "UR102182971", "Content": "I've stayed here for a few nights a week over the space of a fortnight. This is a good option if you want a comfy budget hotel, friendly staff, free wifi, and a decent breakfast - all within a 2 minute walk of Paddington station. Week 1 I was in a single room on floor 5 - which was tiny, but clean, and quiet. Week 2 I was in a double room on the 4th floor - this was bigger, had tea and coffee making facilities, and was much comfier. Plus points here : the rooms are clean, tidily appointed and furnished, and have double glazing, so exterior noise is greatly reduced considering Paddington station is around the corner. There are also a small number of rooms on each floor, so noise is reduced as you don't have so many people banging doors etc. I stayed in another hotel in Norfolk Square before this one - this one however is far, far better. The breakfast is small, but there's no supplement for having a cooked English breakfast, and there is plenty to eat with toast and cereal too. The breakfast room is a decent size, too. Wifi is free - it didn't work on the 5th floor, but worked fine on the 4th floor and in the lobby. I would (and have) stayed here again.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“great hotel”", "Author": "erotberg", "ReviewID": "UR97130312", "Content": "great place to stay when visting london for a few days. 3 minutes from padington station. big and clean rooms. defently will come back next time visiting london. free wi-fi in the room with no charge. breakfast is o.k and the staff is great and very helpful.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Nice clean rooms but very small”", "Author": "soho12", "ReviewID": "UR96910103", "Content": "Very slow elevator/lift but a good experience in all and a nice quiet location very close to Paddington station. Good breakfast even though some of the staff seemed to hate their job, service here was good though.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dartmouth, Canada", "Title": "“Average Hotel, Good Location”", "Author": "bygeorgew", "ReviewID": "UR87779712", "Content": "We booked this through our Canadian Travel Agency and it was OK. The room was very small and a bit noisy. I had to go to the lobby to get the free wireless internet connection; free was positive, reception so-so. Breakfast was good and plentiful. It is a good location, very near the Paddington Tube station so convenient for getting around. Reception staff were friendly and helpful.This hotel is on a Square with hotels all along both sides of the square. If you are looking at cheap, it's OK. If you want better value, you can find it elsewhere.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sale, UK", "Title": "“perfect for Paddington - lots of options in the area”", "Author": "JDsale", "ReviewID": "UR86057264", "Content": "Stayed here the day before I flew out of Heathrow and it was perfect for what I wanted. A clean, well-located hotel within a three minute walk of the train to Heathrow, with lots of dining options in very close vicinity. It was quiet at night and the waitress served breakfast was perfectly acceptable. I would stay here again as I think its a better option than staying at the airport due to it's proximity to the Heathrow trains and there being more eating and drinking options.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Good Location - Enjoyed Our Stay”", "Author": "Cundy", "ReviewID": "UR66940027", "Content": "We stayed at this hotel for 6 nights. It is situated on a quiet street with a lovely small park at the front. We found our room very clean (although small in size) and the bed comfortable. Found the staff very helpful with our requests. Breakfast each morning (was a choice of continental or full english) was very enjoyable. A short 5 minute walk to Paddington Station - what more could you want.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“just not as good as other hotels in London”", "Author": "TomCorbett", "ReviewID": "UR62208872", "Content": "We dropped our luggage at the reception around lunch time Friday when we arrived and went back into town. When we arrived in the evening and went into our room, they had put the central heating on maximum and the room was like a sauna! Breakfast was mediocre. Location-wise. Yes, it's OK, close to Lancaster Gate Tube station, but there are just a lot of other hotels better located. The Premier Inn near Paddington to name on. And price-wise that is a much better deal.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good Value, Great Location - Would stay again!”", "Author": "KatLM", "ReviewID": "UR58698778", "Content": "We stayed here for 5 nights, and found reception very helpful when checking in, although our room wasn't ready when we arrived we could leave our bags in the lobby. Not a secure luggage room but it was safe enough to not worry us. The room was quite small but that is what we were expecting, and as a place to sleep it was fine. We were right next to the elevator on the 3rd floor, and initially I was unhappy with the room as the elevator was very loud when opening and closing, and I thought it might keep me awake at night. However I ended up having no troubles sleeping. The english breakfast was very nice, and the continental selection what you would expect, cereal, toast, juice. The wireless internet did not work in our room, it sometimes worked in our friend's room as they were on the 2nd floor, so we had to go to the lobby to use the internet there. It was free, and whilst it would cut out every so often was still quite acceptable. Located right near Paddington Station, in a pleasant looking square I found the location couldn't have been better considering the price range. Would definately reccommend to others and stay here again.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Good location, Great Value”", "Author": "Bruce_McKinley", "ReviewID": "UR58573894", "Content": "Stayed here in Jan 2010 while travelling through-out Europe. The location is fantastic being just a few minutes walk from Paddington Station where you can catch the tube to the local attractions. The staff were friendly and the included English breakfast was large and a nice way to start the day. Be aware that the elevator is old and can be quite noisy but due to the minimal amount of rooms on each floor it did not affect our sleep at all. Also the included WiFi will only work on the lower floors but there are comfortable lounges in the lobby where you can sit and make use of your own laptop computer. Overall great value as we got a discount on the room for booking online.", "Date": "March 14, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "B.C.", "Title": "“Bed Bugs...refused refund!”", "Author": "moonriverbc", "ReviewID": "UR48988353", "Content": "2 hours after checking in we found a bed bug in our room, which we discreetly took to show the manager and said we would have to find another hotel and asked for a refund. He assured us we had to get our refund back in Canada thru our travel agent via the booking agent, but it would be \"no problem\". He admitted bed bugs were a problem in the whole area. Upon return, we found he had wrote an email to the booking agent blatantly lying and we were unable to get a refund. These are very unethical people! Do not stay here!", "Date": "November 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Canberra Australia", "Title": "“Great location very poor customer service Glenda Australia”", "Author": "Glenda2009", "ReviewID": "UR47365936", "Content": "We arrived mid afternoon to be told our room was not ready. We were left sitting for over half an hour. Whilst we were waiting for our room a guest requested an iron, they couldn't be bothered to track one down so told her there wasn't any available. Another lady turned up for an interview which was held at the front desk for all to hear. Another guest booked in and was told there were no single rooms available and she had been upgraded to a family room. After sitting in reception for fourty five minutes I questioned the manager about our room only to be told it had been ready for some time and given a key to a grotty room out the back with old furniture and minimum facilities. It is a shame as the Hotel is in a great location in Paddington.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "biggleswade", "Title": "“Clean and friendly, needs a makeover though!”", "Author": "stephenbailey120", "ReviewID": "UR46843422", "Content": "My wife and I have just spent 2 nights at the Chrysos which was a little disappointing. Whilst the hotel was generally very clean,all the staff very friendly and the hotel in an excellent location, we thought it was not good value for what we paid. Our room (No 34) was very small for a twin, should have been a single really! The bathroom is tiny,I am not large (11 stone) and found washing in the sink a problem. I guess a larger person would have to keep the bathroom door open to manoeuvre around it! There were many faults, sink plug would not work (2 calls for the maintenance guy) T.V. reception awful (new cable fitted) radiator control fell off (re-fitted by me) free WI-Fi unavailable from 3rd floor upwards (confirmed by other guests) and to top it off the reading lamp failed on our second night. Looks as if they have carried out some refurbishing, new beds,bedding, curtains and bathroom fittings but have not redecorated which spoils the overall appearance. I would recommend this hotel though as I guess not everyone has had a bad experience and given that there were some very good points to the hotel. To be honest if my wife was not in St Mary's Hospital having a heart operation I would have kicked up more of a fuss.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Child friendly hotel in excellent location”", "Author": "RobbyEngland", "ReviewID": "UR36708411", "Content": "We stayed ay the hotel for a weekend in a family room. The room wasn't huge but there was plenty of space for 3 of us. It was spotlessly clean and the staff were all pleasant and helpful. It is 5mins walk from Paddington Station and just round the corner from The big bus tour route where you can pick up tour bus to Hyde Park and all round London sights. Hyde Park and Oxford St are a 15-20min level walk away. Paddington mainline and tube stations are 5mins walk away. There are lots of cafes,restaurants and takeaways just around the corner but the hotel is in a quiet square with a small park in front. We chose to have continental breakfast but full english was available. I particularly liked that the 11 yr old child with us was made so welcome by everyone,especially the front of house staff.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Lyon", "Title": "“It's alright, there are worse places”", "Author": "Miromax", "ReviewID": "UR36355039", "Content": "The hotel is located on a small street just in front of a park. The roads form a rectangle around the park and it is basically only hotels all around the park. Only local circulation is allowed around the park, so you can't get squished by a car as long as you remain there. The exterior is quite nice, well it is basically identical to all the hotels next to it. The area seems pretty safe at night, there's a lot of tourists so it's not uncommon to see people roaming around late and I didn't see any bothersome or suspicious people. There's a bigger street right next to the park and there's two pubs, an italian restaurant, two tiny stores selling food and cigarettes(they stay open late), at basically a 30 second walk. I don't recommend going to the italian restaurant, the food isn't really good and it's very noisy. I wanted pasta with sauce rosée, but they didn't have any on their menu, what kind of italian restaurant doesn't have that? Anyways... The paddington station and the metro entrance are a 2 minutes walk away. Although it's nice, I don't find this particularly relevant. The paddington station is only good if you plan on taking a train towards the west-north outskirts of the city, if you plan on going towards another direction you will need to use a different station. Moving around is very easy in london, it's maybe a 20 minute ride in metro to arrive to another train station. Don't pick this hotel if it's just for the paddington station. Now for the hotel itself. The first thing I noticed was the smell, and the carpets. Now there is always - constantly - a lady spraying air fresheners, everywhere and on everything. In fact, as we were entering the hotel, the lady was spraying some on the sofas in front of the counter. And for the week I was there, a lady could always be spotted in the process of spraying, on the carpet, in the air, no place is left unsprayed. Now the most troublesome aspect of all in this hotel is the carpets. These carpets are literally full of moisture, you can smell and see it immediately. At some places, the carpet is stained and wet - as if someone had put water on it. The smell is really bad at some places. This is no doubt the reason why they constantly spray air fresheners, in an attempt to cover up this smell. To me this is utterly ridiculous, obviously the owner is no good at understanding the concept of taking care of a building. The carpets are puffy and attract moisture, they need to be removed and replaced with industrial carpets before the moisture starts to rot the flooring. They also need to open the windows or install a dehumidifier to make sure not too much moisture accumulates. They also need to stop spraying, it's very bad for health. The walls are also full of moisture at certain spots, it's a real problem. Don't pick this hotel if you have allergies to this. Now - the room. Luckily, my room was OK. The carpet was good, and there wasn't any moisture inside. Everything was good with it, until I checked the bed. Hairs from the previous people. And the more I looked in the small cracks and spaces, the more hairs I found. I resigned myself to sleeping on top of the cover and using the blanket I got on the airplane, and not using the pillow. Definitively not fun. I'm not sure if they even changed the sheets or if they just left those of the people before me. That's probably the worse stuff to happen in a room. The dinning room is downstairs, which kind of sucks and is a waste because there's a park in front of the hotel, if they had made the dinning room upstairs them we could have seen outside while eating, which would have been cool. Luckily, there's no carpets in the dinning room, and no spraying, so you're not likely to vomit your food. The hot breakfast is alright.. I suppose, to some standards. It's basically bacon or sausages, eggs, ham, and beans. I can't really think of something more unhealthy than that. It's kind of fun the first 2 days, I never eat stuff like that usually. But for a week? You get real tired of it. There's toasts and cereals. Now here's the thing about the cereals, one particular cereal tasted like moisture. I don't know what happened to it, but it absorbed moisture or the smell of moisture, anyway something definitively happened. I don't know where they store this stuff, but yeah that's really gross. You're way better off getting a hotel without any breakfast plan and just go to a family restaurant and eat what you actually want for breakfast. Or go to a grocery store and buy something there. The staff is made out of at 90% of the breakfast staff ladies, who also are the cleaning ladies. Most of them seem foreign, and work there for money, not really sure what's the pattern there. They're mostly nice. The counter staff is greek, and one in particular was nice and helpful. Actually this hotel is owned by a greek business guy, hence the weird \"chrysos\" name. I believe I saw the owner, he didn't identify himself as such, but he acted like he owned the place, so either the owner or the friend of the owner. I met other tourists who went to slightly cheaper more popular hotels like the royal national, and the president hotel and they had absolutely awful times. Noisy, dirty and such. This hotel seems like a decent hotel considering there is basically nothing good in the price-range. If you're poor, you should consider this hotel. If you pick another hotel at the same price, you might end up with something really awful. Atleast this was somewhat decent, and it's a very small hotel, so it's not as overbearing If you can afford more expensive hotels, go for it, in london most hotels suck except those you pay more for. I hope you enjoyed my throughout review :P", "Date": "July 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "athens", "Title": "“Very Good Location - Simple and Clean”", "Author": "midias", "ReviewID": "UR34888472", "Content": "In an expensive city like London , Chrysos offers reasonable prices in a very good location (near Paddington station) .The rooms are small but clean and the breakfast is good .I always stay there and nothing disatisfied me ever .", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Loved it!”", "Author": "Jaye_See", "ReviewID": "UR21805462", "Content": "We travelled to London on the 1st November 2008 and stayed for 7 nights at Chrysos. We checked the hotel's review in tripadvisor before we made the booking. I must say that the hotel and its service exceeded our expectations. Of course, one should not compare it to a 5 star hotel but it's good value for the money we paid. The service we received from the front desk was very good and friendly. The room we had was very clean. The size of the bathroom was alright compared to some other hotels which I have stayed. Also, the water pressure in the shower was good and heater in the room was adequately warm. Breakfast was the usual choice of English or continental breakfast. What we expecially like about the hotel is, it is located very closeby to paddington station, about 4 to 5 min walk away and its location is equally convenient for those who use the Heathrow Express from or to the airport, like we did. There are a few pubs and restaurants around the vicinity of the hotel, which made food easily available. Also, there is a convenient store located closeby the hotel. Overall we enjoyed our stay in this hotel and we will definitely go back there again in our next trip!", "Date": "November 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Very Good Value”", "Author": "MaryCairn", "ReviewID": "UR20446007", "Content": "I stayed here for a week in July with my husband and teenage son in a triple room. I had expected the room to be extremely small but while it was smaller than North American standards, we had ample room and did not feel confined. The room was immaculate and always kept clean by housekeeping staff. It was a hot week in London when we were there so we appreciated that the window could open and we left it ajar all the while we were there as the hotel does not have air conditioning. Our only complaint was that the bathroom was far too hot - we asked to have the heat turned off but that only happened once and then it was on again - think it was the towel bar. The breakfast is adequate and enough to get you started. Location is excellent and like others have said, just a few minutes from the Paddington Station which is also convenient for the Heathrow express. Good grocery marts in the Paddington station which we used frequently to buy water and fruit. Hotel and location was very quiet as well. Front desk was also very helpful. If you take any of the Premier Tours, the pick up is at the Hilton right beside Paddington Station and this was great for us, since we took 2 of the tours out of the city. Would definitely recommend this hotel and would stay there again.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palermo", "Title": "“The Perfect Hotel”", "Author": "GiovanniPalermo", "ReviewID": "UR19137002", "Content": "I've been in Chrysos Hotel with my wife and my son of 9 years old in July 2008: I' had seen some reviews about this Hotel and I had chosen it for the cheap price (less than 600 pounds for a triple room for 7 days - breakfast aan taxes included), but when I arrived I was very surprised 'cause it was better than I could imagine; the recepionist and all the staff was kind and polite, the room was large, clean and in excellent condition with a big window looking at a nice park just in front of the hotel. The breakfast was OK (there was'nt plenty of food but, anyway, it was enough for my taste). The hotel is in Norfolk Square, a green and nice place with a lot of other cheap hotels. Nearby Norfolk Square there are a lot of restaurants, fast food, bars, grocery. I advice to eat to \"Dickens Tavern\", a nice Pub where you can eat in a relaxing envirement spending not more than 7 or 8 pounds for each one. Here you can find not only turists, bat also native. There is another good reason to stay in Chrysos hotel: the underground station (Paddington) is far only two blocks and so, it' easy to reach every part of London in short time. If you want to walk, you can reach in five minute Hyde Park where you can relax yourself. Next time I'll go to London I'm sure I'll come back to Chrysos Hotel!", "Date": "August 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vladimir, Russia", "Title": "“Good place to stay”", "Author": "PSW_No1", "ReviewID": "UR17895626", "Content": "A nice 3* hotel in a good place in London. It is 2 minutes walk from Paddington, both the railway and tube stations. Or 6 minutes walk from The Lancaster Gate underground staion. Not to mention also 5 mintes walk distamce to Hyde Park and Kensington Gardens. As for service - IMHO it's the best you would expect in a small 3* hotel: polite and helpful personnel, clean rooms (though really small ones), clean facilities, everyday room service, substantial English breakfast well served and long lasting - up to 10:00 AM. Pleae note: hairdryer and kettle in the room are not provided by default, you need to request it. As you request - no problem, they give it to you. Nico, the hotel manager appeared to be absolutely reasonable and helpful. BTW, among usual free maps in the lobby they had red maps of London that provide 20% discounts for different places of interest in London. We used it, it works. So my wife and me, we stayed there for a week, and found our stay quite comfortable and worth the money we have paid for it.", "Date": "July 15, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Alberta", "Title": "“Disliked the Chrysos”", "Author": "SheilaAlberta", "ReviewID": "UR14470046", "Content": "We recently stayed 4 nights at the Chrysos hotel and were very disappointed with our stay. The room was so small we could hardly fit in with our luggage. The bed was placed under the window and you had to climb over it to get in, a hard back chair was at the end on the bed and allowed no room to walk around. The glass ceiling light was cracked and the room was very, very hot, but we could not leave the window open, while out, as the window was next to the fire exit stairs. The fire exit was used all hours of the night and the door was always being slammed, this made it very hard to sleep. We were very concerned with safety and the fact that people were coming up the fire exit. We reported this to the desk and were told they had adult teams staying with them. The shower head was not properly attached to the wall and the shower stall is so small, even for the average person. We recieved only soap as an amenity. At breakfast the juice/milk containers were always empty, There was no yogurt or fruit with the continetal breakfast and the toast was the thinest bread I have ever seen in my life and for some reason, 3 mornings only 1 side of the toast was toasted. We requested brown bread, but had no luck in recieving it. The cooked breakfast was not good, the egg was unedible, it had been cooked a long time prior to being served. We never found the bar that was advertised, but I did get a hairdryer after asking at the desk . We would not reccomend this hotel to anyone going to London. I have just seen this hotel advertised in a package deal as a 3 star plus, which is ridiculous.", "Date": "March 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Blackpool", "Title": "“2 Star Room”", "Author": "TheWanderer999", "ReviewID": "UR13453109", "Content": "I agree with the reviewer from Antwerp. I booked a triple room and was expecting a 3 star room. What I got was a two star room. The balcony window/door was flimsy and insecure, The bathroom had no toilet brush and 1 ply toilet roll. the soap was not replaced with new soap. The bathroom door was baddly fitted and stuck. The bedding was clean, the decor was basic, the flooring was cushioned vinyl rather than carpet. We were promised Satellite TV and Internet in the rooms...not likely! Didn't want to risk the inclusive breakfast given the overall ambience, which is more guest house than hotel really.", "Date": "February 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "johannesburg", "Title": "“Everything you want & great staff”", "Author": "RebeccaF", "ReviewID": "UR12318383", "Content": "We stayed here Dec 07 and from the minute we got there we were treated very well by all staff, extremely friendly & professional. The location is 1 minute from the underground & all other transport. Lots of shop & restaurants seconds away. Rooms are small but clean and the breakfast is an added extra. I will stay here again!", "Date": "January 4, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent hotel, great experience!”", "Author": "raindog71", "ReviewID": "UR10018832", "Content": "This is a great little hotel in a quiet square about 2 minutes from Paddington Station. Lots of shops, restaurants, internet cafes and a handy all night corner shop just down the street. Room was very nice and comfortable, very very clean. Not large, but that's to be expected in London! Complimentary Continental or English breakfast is offered as well, a nice added perk. You won't leave hungry, that's for sure! Very friendly staff, always saying hello when we would arrive back at the hotel at night. All in all, excellent hotel, and I would stay here again, no question.", "Date": "September 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "fife", "Title": "“great location”", "Author": "FifeWasps", "ReviewID": "UR7969508", "Content": "Great,quiet location...5 mins walk to Paddington Station...lots of eating places on your doorstep...clean hotel...free breakfast included which was good...not much in the way of amenities but for a great price and a good location with friendly staff this hotel is hard to beat...sure you could spend £100's more on better quality hotels but at the end of the day in London you only want a good bed at the end of a tiring day. Highly recommended", "Date": "June 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Antwerp", "Title": "“Less than it looks”", "Author": "meAntwerp", "ReviewID": "UR6576812", "Content": "I stayed at this hotel for four nights with Christmass 2006. I booked a triple room in a what they call a 3 star hotel. What we actually got was a maximum 2 star bedroom with many problems: - the central heating was broken - we couldn't open the windows - the whole room really needed a paintjob - there are no internet facilities in the room (although they write it on their flyers) - the breakfast was just bad (only one slice of cheese per person) - the promised me a room with a couch corner, but there wasn't The pluspoints are that the internet is free, but when you want to use it you got to go to the reception. Further are the personel very helpfull and it's only 5 min walking from the hotel to the nearest underground station.", "Date": "January 11, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Centrally located, well priced”", "Author": "abhy", "ReviewID": "UR5181398", "Content": "Well priced, functional and well located overlooking a Square (which means a garden) in Paddington, London. Extreme value for money and would not hesistate to recommend to anyone who wants Central London at a reasonable price. 10 mins away from Oxford Street. A smiley and friendly receptionist - makes all the difference to an extra *.", "Date": "May 19, 2006"}], "HotelInfo": {"Name": "Chrysos Hotel", "HotelURL": "/ShowUserReviews-g186338-d570524-Reviews-Chrysos_Hotel-London_England.html", "Price": "$138 - $554*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">25 - 27 Norfolk Square</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 1RX</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "570524", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/9d/09/f5/main-entrance.jpg"}}