{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Scranton, Pennsylvania", "Title": "“Terrible, Disgusting and Outdated!!”", "Author": "Trukse", "ReviewID": "UR140035780", "Content": "This Motel is disgusting!! The rooms smell like terrible and were dirty, the beds were the most uncomfortable beds we have ever slept on and the bathrooms were full of mold and mildew!! The exterior of the hotel is completely outdated and not at all like the pictures shown on the webside (which must have been taken 10-15 years ago) This motel should not even be open for business, it needs major renovations!! I would not recommend staying at this motel if you value your money at all!!!!", "Date": "September 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "anurse98", "Title": "“August 2012”", "Author": "anurse98", "ReviewID": "UR139423899", "Content": "Our experience with this hotel was horrible. Most of the staff was arrogant. The price was no cheaper than most of the other hotels for the end of August. The room was dirty and the bathroom was covered with mildew. Would not recommend this hotel to anyone. The hotel did refund our money and it is in a nice location.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“Family? Look elsewhere.”", "Author": "lds1s", "ReviewID": "UR139311617", "Content": "By far, the worst accommodations, even at this price, I've ever had. Much of bathroom was broken, moldy, and/or dirty. I could scrape soap residue off shower wall with fingernail. Wallpaper was patched numerous times. Clothes rack fell off its makeshift holders and cracked wife on the head. Thankful that kids are unharmed. I would not pay $39/night for this room again, let alone the $149/night labor day weekend price extorted.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brush Valley, Pennsylvania, United States", "Title": "“August 2012”", "Author": "Cindy_K74", "ReviewID": "UR139275253", "Content": "We stayed for three nights. Great Location...very close to the boardwalk and restaurants. Our room was clean and the beds were comfortable. There was a small refrigerator in the room. The oceanfront view was great. Staff was friendly and helpful. Would definitely stay here again.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bel Air, Maryland", "Title": "“Labor day weekend 2011”", "Author": "Travel662", "ReviewID": "UR137635024", "Content": "We stayed here last year for a long weekend at the beach. Very affordable and close to the boardwalk. The rooms are clean and basic, but how long are you in the room? The beds are quite comfortable, and it has a small frig. A microwave in each room would be a plus! We will definitely return for another stay !", "Date": "August 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Overall pleased :)”", "Author": "kdbond", "ReviewID": "UR137585275", "Content": "We decided to book at the Seabonay based on cost and location. After reading all the reviews here, we did not have high expectations going in so we were not surprised that the motel was old. We were given a third floor room, which is smoking floor...being non smokers the rooms smell bothered us but it was tolerable...people were smoking on all floors as were staff so dont think it would have mattered what kind of room we had. The room was definitely run down and bathroom was old as well. Air conditioning didnt work great but we didnt go there to sit in motel room. It served its purpose for comfortable beds ( no bed bugs), a hot shower and great oceanfront location. We would comeback to Seabonay.", "Date": "August 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York", "Title": "“A disappointment!”", "Author": "Deb H", "ReviewID": "UR137500032", "Content": "This motel is outdated. The pictures were very deceiving. It's very old. The outside and the rooms are not clean. The airconditioning did not work well. The terrace looks like it's going to fall apart. However, the pool was nice and the beach view was nice. If they fixed it up and modernized it, it would be a great place to stay. Not worth the money spent for an oceanview room.", "Date": "August 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Westbury, New York", "Title": "“THE WORST EXPERIENCE OF MY LIFE”", "Author": "tgurl18", "ReviewID": "UR137489820", "Content": "Upon arrival, we requested an earlier check in because our trip there took less time then expected, they would not accommodate us or even give us some place to change to use the pool. When we finally arrived in our room, it had a very musty smell. We got ready and went out for the night. When we got back to the room, it smelled like weed. It was horrible, and one of the guests in our party is allergic, so she spent most of the night on the balcony while we tried to air out the room. Called the front desk about the issue and we were told to call back and speak with a manager at another time. One of us twisted our ankle while out that night. When we went to the ice machine, it did not work. Again back to the front desk for a NASTY response of its broken, go to 7-11. The next day we had the do not disturb sign on the door and the maid walked right in and woke us up. This was not appreciated. We went out for the day and again came back to a room smelling of weed. We Were told that the general manager would be in the next morning and to call and ask for him anytime after 8. We went out that night and came back to no parking, which I found odd since I was specifically told that there is one spot for every guest. After walking around the lot for a few minutes I found multiple cars without parking passes, that I was told must be in the car or we will be towed! I went into the office and spoke with Yudi. I explained the situation and asked him to come check the cars and make sure they should be there, because I know they have all of the car info on hand. If they are cars that are not supposed to be there, to please have them towed since I am paying to be here, I would like to be able to park. His response was, \"Can you find somewhere else to park because sometimes our guests have guests and they need a place to park as well.\" Which to me meant I am too lazy to leave this office, please stop bothering me. I called the next morning and tried to remain as calm as possible while talking to the manager, Brooke. I explained to him all of our awful experiences since we had arrived and all he could say was I don't know what to tell you, and that weed is the least of his problems, at least it wasn't heroin or cocaine. After that the other guest went down to the office to talk to him face to face. He lied to her and said I never said that but she was being irrational. He then went on for 10 minutes about how long he has been doing this and how many different states he has worked in. I waited for the relevance in all of this, I am still waiting for it. He told us we can leave, and get a refund for the last night, or he can move us to an ocean front room. I found this odd because I was told they were fully booked for the weekend, another lie. We went to the new room and while it did not smell like weed, the air conditioner barely worked, the towel rack fell off of the wall, and the door had to screws sticking out of the back of it. Three of us cut ourselves on them. I then covered them with bandaids. The three of us will be going to get tetanus shots. If there is anything our insurance doesn't cover, even a co-pay, they can expect a bill. An absolutely vacation ruining experience. I am very upset to have wasted that money. DO NOT STAY HERE EVER!!!!! MOLDY, DISGUSTING, COLLAPSING, HORRIBLE PEOPLE!!!", "Date": "August 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Scranton, Pennsylvania", "Title": "“what a disappointment!”", "Author": "Maureen N", "ReviewID": "UR137092323", "Content": "Our reservations were booked online and the pictures and description of the motel were horribly deceiving. We had rooms on the third floor and with two small children, we were afraid that the railings were going to give way. The air conditioning in every room leaked on the inside and outside. The bathrooms smelled of years worth of mold and mildew. The rooms were dark and dingy, the light fixtures were not in working order and the fridges were filthy. There were no luggage carts or even coffee pots in this place. The overall appearance of the motel was very disappointing. IT LOOKS NOTHING LIKE THE PICTURES ONLINE. The photos must have been taken 20 years ago. We were so upset, we left and found another hotel.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Affordable!”", "Author": "Reneedzhair", "ReviewID": "UR136847998", "Content": "My experience at Seabonay was a great one! My family doesn't need all the extras in a motel, we asked for an oceanfront, affordable and most of all clean and that's exactly what we got. I would rather have extra money to do stuff at the beach then sink it all into an upscale hotel. The staff at front desk was very accommodating. Brook the manager even let my daughter and her friend come down to the office to heat up their food. The only drawback to the place and I saw that everywhere else too was the swimming pool closed at 8. Most families like to come back after dinner and swim. Don't know if that's insurance reasons or what but that is my only recommendation is let the pool open at least til 10. Overall great stay and my thanks to Brook and his girls for taking good care of us. Renee of pa", "Date": "August 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seward, Pennsylvania, United States", "Title": "“Great hotel, great location!”", "Author": "Tom H", "ReviewID": "UR136495884", "Content": "Took the family on vacation and it was a nice place to stay. Right on the beach. Couldn't ask for more. The management and staff were great to us too. Very friendly. The pool area was nice also the kids and adults really enjoyed it. Was also close to Buxy's Salty Dog Saloon for those of you who are BIG Pittsburgh Sports Fans! Go Steelers! Had a great time. Would definitely stay at the Seabonay again!", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gaithersburg, Maryland", "Title": "“Great inexpensive way to stay Oceanside”", "Author": "yinzer_girl", "ReviewID": "UR135962283", "Content": "Most OC hotels in the summer will try to charge you $350/night during the peak season. The Seabonay is more than $100 below that price. It is also one of the older buildings in OC so it has character. The hotel is literally at the end of the boardwalk and right on the beach. You really can't beat the location for the price. I will stay there every time I am in OC if they have availability. And the staff is very friendly!", "Date": "August 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Not as bad as other reviews”", "Author": "Tiffany K", "ReviewID": "UR134915858", "Content": "I read some other reviews about Seabonay before I went on my trip with a few friends last week. We booked the room because it was reasonably priced for an oceanfront property in Ocean City; however, we were a little bit nervous on what to expect when we got there. It is a great location and the rooms are clean. The bathrooms and decor are outdated, but for the low cost per a night, who really cares? Any hotel that you stay at in Ocean City is going to have a damp smell because you are close to the beach. We had a great time and the beds are actually updated and super comfortable. I am actually staying there again in a few weeks. I would recommend.", "Date": "July 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seaford, Delaware, United States", "Title": "“Weekend Away!”", "Author": "Casey F", "ReviewID": "UR134822303", "Content": "My family and I truly enjoyed our stay here at the Seabonay Motel. The staff was very helpful for everything that we needed. The room was great and so was the atmosphere in the entire hotel. The pool was wonerful and we were in perfect walking distance to everything that we wanted to do. I definitely recommend this Hotel to everyone!!!", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jonestown, Pennsylvania", "Title": "“Senior week!”", "Author": "Acacia M", "ReviewID": "UR133683499", "Content": "Being at the Seabonay was awesome! My friend and I were there for senior week and we had a blast! It's in a nice location at the end of the board walk and gives you a bit more privacy then having a hotel right on the board walk. The staff that was there attended to everything that we needed and they were very polite. My friend and I have agreed every time we go to Ocean City that we will be staying at the Seabonay. The golden rule applies there, you treat them with the upmost respect and they will surely give it back. They work very hard there and that should be appreciated. So please be nice and treat the place as if it were your own.", "Date": "July 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Another great stay!”", "Author": "Lawry29", "ReviewID": "UR133535930", "Content": "We chose to stay at the Seabonay because we were very pleased with the stay last summer. We arrived before the check in time, but were able to get our room early. The front desk staff were very nice and friendly. The motel is in a great location for the beach, restaurants, and the boardwalk. The room was clean and thankfully the AC worked extremely well because we had 90 degree weather. We'll keep coming back year after year because you can't beat the price, location, and service at the Seabonay!", "Date": "July 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Love this motel”", "Author": "muhmuh1005", "ReviewID": "UR132656063", "Content": "This was our 3rd year staying here during Firemen's week. We also make a 2nd trip in October every year to take advantage of Customer Appreciation. When you stay between Memorial Day and Labor Day you can come back between the end of September (after SunFest) and The 2nd weekend of October for $10 per person per night based on the # of nights you stayed in the peak period.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johnstown, Pennsylvania, United States", "Title": "“Weekend Getaway”", "Author": "Heather M", "ReviewID": "UR131770772", "Content": "We arrived at Seabonay earlier than our expected check in and our room was pleasantly already available. The staff was extremely friendlly. We had an oceanfront room with a beautiful view. The rooms are very clean with plenty of room for your clothes and necessities. The mini fridge was so helpful with leftovers and drinks throughout the weekend. The pool was always very blue and inviting. I would definitely recommend this hotel to my family and friends. Just a fantastic little getaway!", "Date": "June 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“First time ocmd visitor, will never stay here again and may not come back to ocmd again after this!”", "Author": "MissxChriss", "ReviewID": "UR129412286", "Content": "I will never stay here ever again. To begin with, there is no WiFi as advertised, the ice machine was broken, and the pictures on the site are extremely misleading. The lights outside the door are comforting, since the location seems extremely shady when you arrive, that is, comforting until you try to sleep and your room is lit up by said lights, even when the curtains are closed. The bathroom ceiling is falling apart, the shower has black mold throughout the grout. The room smells like mildew and musty. A good night of sleep is impossible because the walls are paper thin. While staying here we had a room right above us that seemed like they brought half the bar back with them. At 3:30-4am they all came back to their room, yelling, screaming, drunk, slamming doors, and being a general nuisance overall. When we called the front desk, nothing was done. We thought they were going to come through the ceiling with every step they took. I have stayed at my share of dives and dingy motels, and this is by far the worst I've ever been in. We will never stay here again. Sleeping on the street in a city would have been cleaner and quieter than here.", "Date": "May 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "York, Pennsylvania", "Title": "“Too good to be true!”", "Author": "smile54", "ReviewID": "UR123249509", "Content": "Was lured by pics & internet offer; stayed in early August 2011. Pics do not reflect what is..however, I would stay here again, if ....they would update. No elevators. Pool-small. No microwave in room. Noisy AC. Would never stay poolside again. View is of an alley where garbage is picked up. Parking is limited;however, there is an overflow lot across a busy street. Poolside room-4th floor-disgusting, carpets-filthy, old, room furniture-very old, room smelled-had to lysol daily. Bathroom-small but, there was plenty of hot water. Told manager I was deceived by ad and she invited me back in late Sept for an oceanfront room which I thought was very nice--at a reduced rate! My daughter did go and she had a beautiful oceanfront room on 2nd floor--no problems. Maybe they put the internet specials on poolside in worst rooms--thus-you get what you pay for. Best feature-- ocean was beautiful; can pick up tram for boardwalk, bike rentals. Within walking distance on street to most things.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Swiftwater, Pennsylvania", "Title": "“You Get What You Pay For”", "Author": "Kramona", "ReviewID": "UR119240312", "Content": "We chose to book a room there based on the reviews, the oceanfront room with balcony, and the proximity to the boardwalk (even though we didn't realize this is on the non-active side) - all of that was fine. We had a shared balcony; which was no big deal for late September, and the beach was just a few steps away. Our room did have mildew on a wall, which didn't bother us, and the maid cleaned it one of the mornings (the same maid threatened to put our shoes out on the balcony since there was sand on them!). A major disappointment was that the microwave and free coffee they claim to have is located in their lobby, not in your room. So we didn't even bother - just went out to eat. The biggest disappointment was the lack of internet service. They claim to have it when you book. I even followed up with an e-mail to verify they have it, to which they replied \"Yes we do.\" We got their with our laptop, and could not connect. Then the girl in the lobby told us they don't have it! The work had to get done the night of our return instead. Would I stay there again? No; once was enough.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“GREAT PLACE!”", "Author": "angie s", "ReviewID": "UR118698864", "Content": "We were able to check in early and check out later which was a god send since we had a sick child with us. The woman at the front desk was amazing and very helpful and accomodating. Room was nice and the ocean view was amazing. We are definitely staying there again!", "Date": "September 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Corriganville, Maryland, United States", "Title": "“DONT STAY THERE”", "Author": "Emma D", "ReviewID": "UR118655829", "Content": "The bathrooms are absolutely horrible (hair and dirt on the floor). Mildew smell throughout the room, we were afriad to sleep under the covers. $437.00 of my personal property was stolen from me. The manager had nothing to say besides \" I have to take the maids word for it.\" I am considering filing a police report. I will make sure the word gets out about this terrible Motel.", "Date": "September 27, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Bucks County, PA", "Title": "“Close to beach, friendly staff,”", "Author": "hypo_theories", "ReviewID": "UR118070096", "Content": "Positives: Clean, NO bed bugs, decent sized pool, located right at the beach, friendly staff, A/C works, plenty of hot water. Negatives: The room smelled like mildew, curtains were stained, mattress had broken springs, bathroom ceiling tiles needed to be replaced (painted over water stains and bowed), corners of bathroom floor grout was black. Advice/how to deal: Turn on A/C right away and bring some Febreze to spray the room. Sleep on whatever side of the mattress is good.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Homer City", "Title": "“Had a nice stay”", "Author": "Nancy R", "ReviewID": "UR117246549", "Content": "This was a Birthday weekend for me. Enjoyed my stay. I couldnt get a ocean front room so would like to stay there next time. Manager and staff was great. Rooms were clean and the pool was a delight. I'll be back. Thanks Brook Nancy", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great stay at the Seabonay!”", "Author": "Lawry29", "ReviewID": "UR117130850", "Content": "We traveled with a group of 8 and arrived early (around 9am). While the check in is at 3pm, we were able to get one of our three rooms at 10am when we returned from breakfast so that we could get ready to head to the beach. Our other two rooms were made available hours before the check in time which was a huge convenience for us. Rooms were clean and nice size. AC worked wonderfully. Management, front desk, and other staff were very friendly and helpful. Location was great as we had oceanfront and could walk to our favorite restaurant, Embers! I would recommend this place!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Won't be back until they do some updating”", "Author": "Tracy P", "ReviewID": "UR116910683", "Content": "Our room was okay, however, the bathroom was atrocious. The bathroom had a smell to it, the exhaust fan was faulty & so the bathroom was always damp, the shower rod had rust on it & snagged my bathing suit, the outlets didn't work so we had to use the outlets by the bed, the faucets in the shower were ready to fall off ..... The pool, however, was great and the maid service was great. TV was nice. These rooms need to be re-done.", "Date": "August 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“DON'T STAY HERE”", "Author": "BJ1998", "ReviewID": "UR116364747", "Content": "Will never stay there again...had $100 taken out of my wallet, which was in my purse in the drawer covered with clothes, and of course nothing was done about it by the manager. Who would of taken it? Nobody but the maid obviously! Police report filed, so we will see what happens. And they have the nerve to lay out an envelope for tips. The place is priced entirely too high...the rooms are small, have an odor, dirty, don't have functioning outlets/lights. DO NOT RECOMMEND!!!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Crofton, Maryland", "Title": "“Absolutely loved it!!”", "Author": "steffieeffie", "ReviewID": "UR115928886", "Content": "I had a blast staying at this motel! I was originally booked at another motel, and decided not to stay there. I was then transfered to this property & absolutely loved my stay here! My sister and I had a blast! The front desk staff, hospitality, and management were wonderful! Would definitely recommend this motel to anyone looking to stay in ocean city. The location could not be better either! I will be staying here again!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brewster, New York", "Title": "“Great place to stay!”", "Author": "nman134", "ReviewID": "UR115869887", "Content": "Th price was right and the service was great! Housekeeping kept the room clean and provided us with plenty of towels and pillows. Great location near the beach and the pool was very clean and kept up well. The General Manager was also extremely helpful. Thanks Brook!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Armagh,Pa", "Title": "“Loved it! And will be going back again soon!”", "Author": "pup1010", "ReviewID": "UR115354161", "Content": "Everything was great on my 5 day stay. The rooms where clean. If you needed anything, the staff was right on it! The pool area was nice. The front patio area is a great place to hang out and relax, and see some of the sites we normally don't see from home! All in all, a great place to stay. And I will be going back again soon. Greg- Pa.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pasadena, Maryland", "Title": "“\"Great hotel, great location\"”", "Author": "robfer", "ReviewID": "UR115245678", "Content": "I wanted to take a second trip to OC this summer with my family and had a budget to work with. This hotel exceeded all expectations. The staff were friendly and very helpful, the rooms were larger than most, very clean and comfortable. The location and view couldn't be better. This hotel offers more than most and is affordable. The kids loved the pool and we will definitely stay here again!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Salisbury, United Kingdom", "Title": "“Perfect little beach motel!”", "Author": "bizzymom44", "ReviewID": "UR114711323", "Content": "Came down with friends for the car show. Nice oceanfront room, very clean. If you dont need all the bells and whistles, it's a great place! Staff was friendly and courteous, rooms were dated but well maintained.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Nice Hotel, Awsome Staff”", "Author": "jennpier2011", "ReviewID": "UR112496086", "Content": "We actually got switched to the Seabonay because the first motel we actually booked with was absolutely horrid! We enjoyed the Seabonay it was reasonable prices, the rooms were a little outdated, but the awsome view and great staff make up for it. We especially liked the employee Holly she informed us of great places to eat in ocean city, what we could do, and where we could go that had reasonable prices. The employees actually cared about their guests, were did not pass one single employee whether it was housekeeping, maintence workers, etc that did not stop and say good morning..etc. I have never stayed at a hotel that had such friendly employees. I stayed about a week there and will go back.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Frederick, Maryland", "Title": "“the best place ever”", "Author": "delliott0416", "ReviewID": "UR111876997", "Content": "very clean and a great trip it was very clean and comfortable ..i read reviews before i went they sounded bad but it was not it made my family vacation all good ..the front desk person (holly) and manager (Brooke) made my daughters birthday ...thanks it meant the world", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ocean City, Maryland", "Title": "“Awesome staff, awesome stay”", "Author": "hhay22", "ReviewID": "UR111519086", "Content": "The staff was really nice and customer service oriented, The rooms were spacious and the pool was refreshing. The oceanfront room was amazing. We will definitely be back!!!", "Date": "June 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Beggers cant be choosers...”", "Author": "Iluvthebeach25", "ReviewID": "UR76536865", "Content": "Im not going to say its the Hilton but then again you arent paying Hilton prices...For being were of the more inexpensive hotels at the location it wasnt bad..You get what you pay for. So if you are looking for just a bed to sleep in at night , go with the Seabonnay!", "Date": "August 23, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Pospect Park", "Title": "“Couldn't get past the musty smell...you get what you pay for”", "Author": "curlygirl278", "ReviewID": "UR76195777", "Content": "Stayed at this motel Aug. 16th - Aug 18th and the only good thing about this place is the location. Booked it because of the \"low\" rates, but when we arrived I felt like the rates should have been even lower. The musty smell is so bad we had to buy room spray right away and leave the door open the whole time we were in the room, except for when we slept. The bathroom was outdated and the shower tiles were moldy. I dont feel that the air quality in this room is healthy. Pool was good. Wont be staying here again.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gaithersburg, Maryland", "Title": "“Don't believe all the bad reviews, this place is very nice”", "Author": "steve101010", "ReviewID": "UR75846079", "Content": "This is a motel, not the Four Seasons. Rooms were clean, staff were friendly, great location on the beach at the end of the boardwalk. What's not to like.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "College Park, Maryland", "Title": "“Don't stay at the Seabonay”", "Author": "Gina7169", "ReviewID": "UR75770466", "Content": "Granted Ocean City hotels for the most part are not aesthetically appealing. Over the many years that I've lived in Maryland and visited OC, I've stayed in numerous low end hotels/motels as the higher end (Hilton and others) were too pricey for their location and just a weekend stay. However, the Seabonay takes the cake in low end. First of all, we asked for early check in. They said that we could check in and they would call us when the room was ready. Normal check in is at 3. We arrived at 10, they called us at 2:30. So much for early check in. The place is outdated, the rooms smell musty, the bathroom was dark mustard yellow with mold in the shower. There was sand in my \"just cleaned\" bed and the mattress was half off the box springs when we arrived. They are also the most uncomfortable beds I've ever slept in. The balcony is not private so you can't keep your door open to listen to the ocean without sacrificing your privacy. In addition, they do not have WiFi. Now, there are a few perks to staying at the Seabonay. You are right on the beach and you are within walking distance (one block) of the end of the boardwalk where you can catch the train to the other end of the boardwalk. They also show movies on the beach (during the summer) across from the train station. However, for the price, I expected something a little better than what I got. The room we were in really should have been priced at $50 per night even during peak season. It has obviously not been upgraded since the place was first built. Only stay here if, like us, it is your last, least expensive option.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Seabonay good for the value”", "Author": "platinumlady2001", "ReviewID": "UR71520274", "Content": "I stayed at Seabonay Motel July 16th- 18 with family and we had a great weekend in Ocean City. The hotel is basic nothin fancy but the room was clean and no issues like what was listed in other reviews. We had a poolview room and the location was great. We were steps from the beach and even though we was what most considered the end of the boardwalk it was no problem to catch a tram to go down the beginning of the boardwalk. The pool was good. The hours was from 10am-8pm. (Wish it would have stayed open a little later). Overall, I had a good experience with the Seabonay and will be back in Ocean City next year.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Canton, Ohio", "Title": "“Buyer Beware”", "Author": "tric66", "ReviewID": "UR70308829", "Content": "I was looking for a quaint ocean front room for our few days at Ocean City. I booked months in advance, with a one night room fee deposit. The reviews at that time were decent and the pictures of the place make it look very special. I had to make this a working vacation and called ahead to confirm internet access and was told yes they were wireless. Arrived to find the place a bit more run down then expecting, but okay. Found our way to our room that was extremely small, with no place to move, outdated, dirty, bathroom with mold and no internet access. Went down to ask about the internet and voice my expectations of the accomadations and was told that I could not get a refund for canceling my stay. I said I was not canceling my stay, the room was misrepresented. The desk clerk was very polite and helpful and that is truly the only thing going for this place. She called another hotel in their 'group' and got us a room there for our stay. After talking to the locals, even they know to stay away from the Seabonay. If they spent as much money on their facitility as they did on their fancy \"makes you want to stay there\" brochure...then they could justifiable expect people to pay the rates they are asking.", "Date": "July 9, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Kent Island,MD", "Title": "“NASTY AND DISGUSTING!!!!!!!!!!!!”", "Author": "JodieKentIslandMD", "ReviewID": "UR70218354", "Content": "I have never wrote a review before and with this place I just had to. It was HORRIBLE! This is the first time I have ever seen cockroachs in my life. I didn't even want to shower. I always think that people who write reviews are way to picky but...... this place C'mon...just disgusting. Please don't stay here...GROSS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "July 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "White Oak, Pennsylvania", "Title": "“I've stayed in some dumps, but this one was by far the worst!”", "Author": "Tina846put", "ReviewID": "UR68749060", "Content": "First, let me start by saying that when I booked this place I was told by the booking agents of the Harrison Property Group that we could enjoy the ammenities of the Flagship Motel (sister to the Seabonay). Upon check in, I was told that's only the case if the Flagship is not at full occupancy, which it was. Therefore, my three year old did not have a kiddie pool to play in, nor did we have access to the gym. The off season agents of the Harrison Group were either not informed correctly or they misrepresented grossly. The day we were leaving, they were switching out old TVs for flat screen ones. What The Harrison Property Group should have been investing in are door knobs that work, ceiling tile that isn't ready to cave in, floor repair to the badly warped floor, door hinges that aren't rusty, windows that don't leak, some calking and paint, oh, and something to repair the hole that was in the corner of our room. They did give us a fly swatter to kill the abundance of flies that were drawn to our room. I also must say that the motel staff were very nice people to deal with. Would never go back though, nice can never outweigh the absolutley unacceptable conditions.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "North East", "Title": "“DUMP (Should be bulldozed)”", "Author": "BigPapaPump", "ReviewID": "UR43976139", "Content": "PLace was a dump. Left after the first night. Stay AwaY", "Date": "September 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Westminster, MD", "Title": "“Think Again!!!”", "Author": "dorchester314", "ReviewID": "UR35113235", "Content": "This hotel is very old and smells of damp mold. It is shut up over the winter months and re-opened for business in the summer. The first room we looked at smelled so badly you had to hold your nose. The mattresses were so soft that when you sat on the bed the mattresses came up beside you. The bathroom had been repaired so many times that the tiles no longer matched, the hinges on the door where rusted, and there was hardly any water pressure. This bathroom was antiquated and we were afraid to use it. There is no elevator so if you are on the third floor be ready to walk single file up the stair case schlepping your stuff. We weren't happy with the first room they gave us so we asked for something different in hopes that a miracle would occur as we were filing back down the stairs to the first floor. The second room was only slightly better in that the mattress did not slap me upside the head when we sat on it. This room also smelled and the refrigerator didn't work. The only decent thing about this hotel was the lady at the front desk. She offered to call around to their sister hotels to see if there was some other place we could stay that might better suit our needs. She was able to do that and she very kindly transferred our deposit from the Sebonay to the new hotel. This woman is the only saving grace of this hotel that would benefit from a bull dozer. As a side note, this hotel is not handicap accessible nor did they have internet connection.", "Date": "July 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Maryland", "Title": "“I would not stay here again- Go Somewhere Else”", "Author": "beachgrle1", "ReviewID": "UR34025886", "Content": "This hotel is located next to the dunes motel on the beach at the end of boardwalk. when I stayed at this hotel i can say is check in was easy, but my room was a little disgusting, the bathroom ceiling tiles were missing- at least half of the 2 tiles were missing and above the shower head in the ceiling there were holes. the bathroom was not very cleaned and shower looked really disgusting i had to bare and grine my teeth to just take a shower- i rather take bath in the pool. the beds were ok- the room nothing special at all just the bathroom disgusted me out", "Date": "July 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "grenfield,ny", "Title": "“Avoid this hotel”", "Author": "ruger290", "ReviewID": "UR33778425", "Content": "The Seabony has a great location right on the beach and about 20 steps from the boardwalk. We arrived about 2 hours early. Room not ready yet despite plenty of vacancies. When I asked at check out why we werent offered a different room since there where plenty of vacancies, I was told they only have 2 non smoking rooms per floor. We tooka quick peek before bringing up the luggage. No bed bugs or roaches. Dragged the luggage up 2 flights to the 3rd floor. Upon getting settled we turned to close the door to find the door doesnt actually close all the way.hence the 2 security chains. it also looked like it was jimmied oped before. the panel under the window lookes like it may have been kicked in one time . The wall and ceiling above the A/C was dusty and in need of cl;eaning. The bathroom ceiling was caving in and the tub and tub walls needed a good cleaning or scrubbing. I dont think they had ever seen a scouring pad. The bathroom floor was disgusting and the towels hurt. When checking for items we may have left I checked under the bed, apparantly they never had found cany wrappers there. we thought we heard something crawling in the ceiling the 2nd night. I stay at beach hotels quite a bit and an old motel does not have to be dirty. Routine maintenence might help. its a shame because it is a great location. Why did we stay? Good question. When you only have 2 days you hate to move everything and start looking again.", "Date": "July 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“love the seabonay,just one block from the boardwalk”", "Author": "fayert", "ReviewID": "UR20154365", "Content": "i enjoyed my stay,great location,all the shops in walking distance.staff was very friendly,housekeeping clean the room daily and let us know if we needed anything just asked.front desk manager was friendly and helpful,where to get a good meal,thank you connie.mr.james f. gunsenhouser i'm from baltimore maryland.if you like more info,you can email me at guns.seals@verizon.net", "Date": "September 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Great Motel! :)”", "Author": "beachgal22", "ReviewID": "UR19533544", "Content": "I read alot of reviews about this motel before our trip....more bad then good, so I was a little worried about what to expect. Lets just say that I was very happy when we got there. The location is perfect, you couldnt ask for better...it was right at the end of the boardwalk so you have your peace and quiet, yet the boardwalk was right at your fingertips....staff was more then pleasant.....maid service was prompt and tidy....it was cleaner then stated in reviews I read (its an older motel so your going to have chipped paint and little imperfections, what do you expect!) But I would stay there again in a heartbeat!!! A home away from home! The ONLY thing I would change about the motel is the pool closed way too early at 8pm. Other then that, it was wonderful :)", "Date": "August 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Dump Motel ran by rude people”", "Author": "lelabean", "ReviewID": "UR18274356", "Content": "We have been going to the Seabonay for several years now. We go for the location. This year was the last draw! I called when we got the brouchure and they said they have been doing renovations since the fall, so we decided to try it again. Oh my goodness!!! This place is still a dump. The pool was broken and we had to travel to another hotel to use their pool. When several guests and I complained they said it would be fixed in a couple of days. They did fix the pool, but the rest of the place was still the same. The only renovations we saw was a new TV, VCR and a new AC, the rest, well I just can't discribe it. Though they kept the mold and the screw that was still sticking out from the wall and I almost ripped by pants on it. When we confronted the management they didn't care. Finally they offered us 10% off of next year. Helloooo, I don't think so. I went there for the last time. You can do better. There are plenty of other places to stay. Maybe you will pay a little more, but it will be clean.", "Date": "July 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“good for the price”", "Author": "roxy822", "ReviewID": "UR17912129", "Content": "After reading some bad reviews I was expecting the worst...but the motel was nice, clean, and the maids replaced the towels, garbage bags, and sheets everyday. Excellent location..right on the beach and steps away from the boardwalk...splash mountain waterpark and speedworld right across the street. It's an older motel and we pretty much just used it for sleeping because we were out all day. For those people who wrote the bad reviews..what were you expecting for the price...the Ritz?? With the money my fiance and I saved from not booking an expensive hotel, we got to do so much and had an amazing vacation!!", "Date": "July 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington", "Title": "“We found It By Accident....But Loved The Location and View.”", "Author": "DR2DC", "ReviewID": "UR16975602", "Content": "This motel is not the BEST on the beach but it surely had the perfect access to the beach and boardwalk. It was particulaly a every beach goer dream location. We actually got referred to the motel by another hotel on the strip which was very nice of the guy. Its a chill hotel and the staff is very mellow and chill...no one really bother us and everyone staying at the motel were friendly. The pool was great and clean. I would definitly recommend this place to my friends to have a blast on the beach and party.... ;D!", "Date": "June 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Germantown, Maryland", "Title": "“great and friendly”", "Author": "strausstl", "ReviewID": "UR8693950", "Content": "This is an old style hotel with actual keys for the rooms. All rooms are non-smoking. the staff was very friendly and the location was great just 1 block north of the broadwalk. The room was average and the motel had a pool which was great. The beach at this location was very clean and not very crowded which is great. Will stay again.", "Date": "September 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Coatesville, PA", "Title": "“Great Deal”", "Author": "debjgfn", "ReviewID": "UR8067123", "Content": "This is an old motel but quite clean and well worth the money. I was scared after reading the reviews but I have stayed in the $300/night places and have seen worse. Yes the faucet drips, who cares? Clean floor and sheets and bathroom. Beach to the left and Jolly Roger Water Park to the right! The pool was beautiful and clean. Will stay again! Thanks for a great 4th of July vacation at a reasonable price, we spent our extra money on FUN!", "Date": "July 6, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Erin, NY", "Title": "“Steer very clear of this hotel!!!”", "Author": "SHbeck", "ReviewID": "UR6654748", "Content": "We have been going to OC for years, we usually stay in a condo or at the Sahara & have had no problems, but this was a last minute trip with another couple & rooms were limited due to the fishing competition going on at that time, so we decided to try the Seabonay since they had rooms available & the price was right. The brochure & website looked very inviting. All I can say is that the pictures were obviously taken when the hotel was built, many, many years ago & they have not done any renovations since!! The staff told us that the hotel is due to be torn down & a new one built. They could have let us know that before we got there! The rooms were horrible - not clean, bad smell, small, but I could have handled the size if everything else was ok. The balcony was very small, couldnt really enjoy sitting on it because you had to get up & move if anyone walked through because it was so small. Very noisy - kids were constantly running up & down the balcony - no privacy either. Our front door looked like it had been broken into several times - didn't feel very safe. When trying to use a hair dryer, the room blew a fuse & they kept having to fix it. We tried to find another hotel, but everywhere was booked. The \"coffee & fresh fruit\" in the lobby that they advertise....don't get excited about that. The lobby is not much bigger than a closet & there is a very small basket of fruit & a small coffee pot to use. The only positive thing this place had going for it was the location. Oh, the pool was decent also, but small. We will continue to visit OC, but will never stay at the Seabonay again.", "Date": "January 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cumberland, Maryland", "Title": "“Terrible!!”", "Author": "jrh179", "ReviewID": "UR5628115", "Content": "I checked into the Seabonay and a half an hour later checked back out. They refused to give me a full refund, so I lost around $200 but it was worth it just to get away from that place! The pictures are misleading and the place is a DUMP!! There are NO elevators, only one set of stairs and the rooms are very, very tiny. The woman at the desk (Connie) seemed friendly at first, but then became vicious and rude when I told her I wanted to leave. She said the place isn't dirty, just old. Well it's both DIRTY and OLD! Our phone was broken and kept constantly ringing, our tub was leaking, the dresser was missing drawers, and the TV was about ready to go. They do provide you with a fly swatter in the room. The bathroom was a dark yellow color and the toilet was broken. You don't get a private balcony either. We went to Crystal Beach Hotel on 25th Street. It was extremely nice, had a bigger room with a pull-out sofa, for almost the same price! ($189/night in the middle of August). DO NOT STAY AT SEABONAY!!!", "Date": "August 20, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "West Chester, PA", "Title": "“Pleasantly surprised”", "Author": "vld8783", "ReviewID": "UR5581261", "Content": "Like the last person, from the reviews I expected the worst. I was pleasantly surprised. I didn't find it to be nearly as bad as some of these people are saying. It was definitely adequate for 6 22-25 year olds. All you need at the beach is a bed and a shower really. It's awesome when there's a fridge and a tv though. I'd stay there again. Our room was fairly big. The beds were comfortable. The water pressure in the shower was lacking and the toilet wouldn't stop running unless ya jiggled the handle. All minor details. Also, the staff wasn't overly friendly. Only get one parking pass no matter what you try but there's always street parking. You just gotta drive around for awhile. If you need a fairly cheap place to stay around 28th and right off the beach, I'd definitely recommend it.", "Date": "August 9, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "eastern Ohio", "Title": "“older motel but very nice”", "Author": "dmcleod", "ReviewID": "UR5534123", "Content": "After reading some of the reviews I was prepared for the worst. This motel is older butfor the amount of time my family was in the room it was just fine. It is not a fancy hotel with a lobby and other frills and if that is what you are looking for, stay elsewhere. I was pleased and will stay there again and the location was great.", "Date": "July 31, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Unknown", "Title": "“Bad Choice”", "Author": "A TripAdvisor Member", "ReviewID": "UR5432527", "Content": "Let's just say that this place is in deperate need of a remodel. The rooms were not the cleanest. The bathrooms could really use a scrubbing. The rooms smelled of mold and there was a lot of water damage to the exterior walls of the rooms. The best part of this motel was the veiw of the ocean. Needless to say this will not be our choice in the furture if we decide to visit Ocean City again.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“fun vacation”", "Author": "A TripAdvisor Member", "ReviewID": "UR4319964", "Content": "My boyfriend and i came to seabonay in Aug. 05 When we first got to the motel.. i thought it was what the website showed exactly. The only things i thought we not the best were, the maid service did not do a full cleaning in the rooms everyday. Our mirror had finget prints on it up until the day we left. Also you are supposed to get continental breakfast.. but alls i saw in the lobby was coffee and an apple. Thats it. I would like to see the motel update their breakfast a little more. But other than that.. i loved the motel. When i stayed there it was $69 dollars a night. What do you expect for that cheap. The pool was awesome. Well mantained and kept clean. I wish the hours were longer tho. But the motel is just walking distances to about everything. I really enjoyed staying at Seabonay and i would recommend it to anyone.", "Date": "January 3, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Winchester, Virginia", "Title": "“Charming & Beachy!”", "Author": "JenniLaRue", "ReviewID": "UR3799746", "Content": "The price was right, and I was very happy with the service and staff. Pool was nice. The place is small enough that you get acquainted with your \"fellow beachgoers\" over the 3-night-minumum in peak season. It's RIGHT across from Jolly Roger Waterpark; the location was awesome for us! Beach in the AM, Jolly Roger for 4-7 cheap special! This place is right at the exact end of the boardwalk. It is wise to get the \"Punch pass\" for the tram, which picks up RIGHT there at Seabonet...otherwise it's a loooooong walk to the Purple Moose saloon! Tram quits running at 11pm. I was scared because I read a negative review about Seabonet AFTER it was too late to cancel reservations, but was pleasantly surprised. My 3 boys: 10, 13, 14 all loved it, and so did I! I will DEFINATELY stay here any chance I get, before this and all the cute little $130/night places are torn down and replaced with the huge $400/night places! It was a good move for us to stay here reasonably, so we could afford to parasail, go charter fishing, mini golf, shop, and eat well! I do wish that the pool would have stayed open until 10 pm, though! 8pm was too early. I hope this helps you!", "Date": "August 23, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“a nice little place for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3733094", "Content": "this hotel was nothing fancy and the rooms are small but they were clean and the pool was great. the only down side to this hotel is that you have quite a bit of walking ahead of you to get to the boardwalk. i would not recommend this place to anyone who cannot do a great deal of walking. this is an older hotel but if you would rather not spend the majority of you money on a room, then this might be the choice.", "Date": "August 3, 2005"}], "HotelInfo": {"Name": "Seabonay Motel", "HotelURL": "/ShowUserReviews-g41298-d571191-Reviews-Seabonay_Motel-Ocean_City_Maryland.html", "Price": "$53 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">28th Street Oceanfront</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "571191", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/69/44/6944a6126fd2d5020cadf2b50bf155a41large.jpg"}}