{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Stockport, United Kingdom", "Title": "“Noisy and unfriendly!”", "Author": "Nisa1702", "ReviewID": "UR126692755", "Content": "Unfriendly staff! Noisy residents! Poky room! Breakfast acceptable - just! Not recommended! Location though is central and convenient for Euston.", "Date": "March 26, 2012"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Budget accomodation in central location, walking distance to Euston Station.”", "Author": "Baz1987", "ReviewID": "UR124336889", "Content": "Me and my girlfriend stayed one night here in January as she had a job interview in Euston. We stayed in a double room, which was quite small and a bit dated. The room had an en-suite bathroom which again was very small, and the room was a bit cold as only one of the radiators worked. There was also a buzzing sound coming from somewhere in the room, only faint but was quite annoying after a while. There was breakfast in the morning which I cant comment on as I had to leave early for work so didnt get to try it. The bloke on reception was friendly enough and was working throughout the night. The reason I chose this hotel was for its location and price, it is in central London, walking distance from Euston Railway station and I only payed £49 for the night with en-suite bathroom and breakfast in the morning. For that reason I would recommend this hotel to anyone looking for a cheap overnight stay in central london.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Don't stay with these liars - Major construction work is taking place for weeks”", "Author": "Julie_AnneLondon", "ReviewID": "UR124289961", "Content": "I arrived at 10am after flying all night from Cuba. 'Alec from Brazil' greeted me with a lecture on Cuban politics, after I carried all of my own bags up the shabby stairs and told him I was jet lagged. The room was small but I said to him 'as long as it is quiet', then I was happy. The moment I lay down on the bed the construction work started. When I complained, dear darling Alec said that 'British law allowed this until 5pm'. It was 11am. No discount, no apology. It started again in the morning, I left even more exhausted than when I arrived. The construction work looks like it will last for weeks.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Telford UK", "Title": "“Friendly staff”", "Author": "TelfordUKCaz", "ReviewID": "UR122246778", "Content": "We stayed here for one night and found it adequate for a short stay. Clean and comfortable beds, clean bathroom. Breakfast was good . Staff were very friendly. The location was good - 5 mins to Russell Square underground. Decor needs updating but overall good value.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Good value, good location”", "Author": "peterschofield37", "ReviewID": "UR121186099", "Content": "I have been staying at the Avonmore Monday to Friday for nearly 12 months as I'm working at Euston. The hotel is in a good, quiet location (usually) and is good value for money, price incudes english breakfast. The rooms are not large, I'm usually in single rooms obviously, but they are comfortable. I'm surprised at the comments about the breakfast staff, as other reviewers have said all the staff have been friendly and helpful.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bournemouth", "Title": "“Great Reception staff, awful breakfast staff”", "Author": "JacquiBournemouth", "ReviewID": "UR120541754", "Content": "Good location. Reception staff excellent, however hotel let down by other staff. The woman serving breakfast was surly and rude to guests walking into the breakfast room. 3 girls walked in but were rudely told 'well you will have to split up and share table with somebody'. This could have been avoided if the tables were doubles and not for four, as each table of four had only two people at them. She also told another group ' you will have to come back' but breakfast was nearly finished so this would have caused further problems, There were four in my party. One asked for no beans, but was given beans and no sausage. another had stone cold beans. As vegetarian I asked for two eggs which came swimming in oil. We were given 2 slices of toast between 4 people, and had to ask twice more for more toast and each time it came, there was only 2 slices. That is 6 slices between 4 people when normally we would expect two each. Also only given a 2 cup pot of tea for 3 people. If the breakfast experience had been better we would have booked again for a trip in January however will now book elsewhere", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Insects and Noise”", "Author": "Sam S", "ReviewID": "UR120452890", "Content": "Good: Friendly staff, nice breakfast, great location for Euston or King's Cross, and you can leave your luggage (though not necessarily secure) Not great: I stayed in one of the very, very small single rooms. It was clean except for the squished bugs stuck to the walls, that obviously had been ignored by cleaners before my arrival. Very dated. Shower was fine, although temperature was not easy to control. Street noise wasn't unbearable, but the creaking stairs and floors meant waking when anyone went in or out of the rooms above. Internet wouldn't work, signal was too poor.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Derbyshire, UK", "Title": "“Great staff - not much sleep”", "Author": "bellysbride", "ReviewID": "UR119138132", "Content": "Cheap Hotel 10 mins walk from Euston and 10 mins walk from Russell Sq Tube station. I booked a single room but this was downstars and as another Trip Advisor contributor has said you can hear the trains. I was in Room 3 which is adequate for single occupancy although was very hot. Room very clean and the bed very comfortable but the door Yale lock was broken and not self locking. Leaving the key at 24 hour reception and having to buzz to get in was a bonus, the area seemed fine being as I was travelling alone despite a small park opposite. The staff were exceptionally helpful and friendly, the breakfast was good and served with exceptional speed. I would recommend this hotel to anyone travelling in a couple or with friends but the single room noise and heat was the only bad point but that wasn't the fault of the hotel really.", "Date": "October 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value and great location”", "Author": "pearlybee", "ReviewID": "UR115261719", "Content": "A centrally located, compact hotel offering good value to the budget-conscious traveller. Staff were friendly & helpful. Nice English breakfast in pleasant surroundings. My room, although small, was quite adequate with sufficient storage areas. I was a little concerned that there would be noise from the street below, but this was not a problem. Very close to two tube stations, handy to shops and the British Museum, I feel that the Avonmore is worthy of recommendation.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Cold Sausage”", "Author": "MillyandElly", "ReviewID": "UR104952708", "Content": "Stayed one night. Great location, walking distance to Covent Gardens and Soho. Small rooms, old-fashioned (squeaky floorboards!) but very clean and good value considering price. Receptionists extremely friendly and helpful. Breakfast 7.30-9.30 but don't risk arriving just before 9.30. We were presented with stone cold sausages, no apology when we pointed this out - blunt excuse from waitress \"we arrived at 9.30!!\" Problem sorted by microwaving to 1000C! You might need to check with reception latest time for a hot breakfast as rest on offer very paltry. However overall would stay again considering price, location and reception staff. Might swap breakfast for nice coffee and croissant nearby in one of the many cafes..", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wyoming", "Title": "“Great location, great service, decent rooms”", "Author": "wylib", "ReviewID": "UR98829594", "Content": "This is another one of those old London homes converted into a family-run B&B. The family was delightful, very friendly & helpful. The location, Cartwright Gardens, is fantastic, charming & fairly quiet, with a great Indian restaurant nearby that is open late. The front door was kept locked & you had to be let in & out, but I'm not sure why as the neighborhood seemed safe to me. I made the mistake of booking a basement-floor room -- all that was left so I was happy to get it -- but the closeness of Euston station means that you can hear trains/tube running underneath the ground (this would be the case for any of the hotels in this area I presume). I couldn't hear any outside noise so I'd guess other rooms in the hotel would be quieter. The decor, carpet, bathroom etc. was dated but scrupulously clean. Not luxury accomodations but for a nice quiet place to stay with easy transport nearby this is a good choice -- although I'd recommend a room on the upper floors if you can get it :)", "Date": "March 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hampshire", "Title": "“OK but too noisy”", "Author": "KingAlfred", "ReviewID": "UR91553968", "Content": "We stayed for one night. As others have said, it's fine for a (relatively) cheap London hotel, with a good location in Bloomsbury, friendly staff and a reasonable (not brilliant) breakfast included in the price. Our room was clean and neat, but far too hot - we had to switch the radiators off and leave the windows open for a couple of hours to get it down to a sensible temparature. But at least we had the option of doing that, unlike the many chain hotels where you can't control heating or ventilation. The main problem was that we were woken constantly through the night by the noise - both from the resident in the room above stumbling in (and tripping over the bedside table from the sound of it), and of the person in the next room who kept coming and going in the small hours, each time banging the fire door on the landing loudly. There is a big sign saying \"please don't bang this door\" but it obviously isn't doing the trick. I'd recommend they invest a few quid in some mechanical means to stop it slamming closed, because as it is I wouldn't want to risk staying there again. Ironically the noise from the street was minimal - the only real intrusion was the occaional siren on the Euston Road.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kent", "Title": "“Just Okay”", "Author": "Francesw21", "ReviewID": "UR77074042", "Content": "I read some of the reviews on this site and thought that we were getting a good hotel at a very good price..... But the truth is its just okay. The location is probably the best thing about the hotel. Our room was one of the basement rooms and it had a dark and dingy feeling about it. The decor was very dated, and the future was mismatched and old. It was however clean. The windows were very thin, and I couldnt get much sleep becuase the room was so cold, and the light keep coming through the gap in the door. The shower was a nightmare, couldnt get the water temperature right at all. I almost ended up with third degree burns because the water was so hot. I missed breakfast but my boyfriend had it, and said it was awful. All in all its a good base for exploring london, but thats all it is. I wouldnt book this hotel if your aiming to please or want a nice weekend away.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Small but comfortable”", "Author": "MrBiscuits", "ReviewID": "UR76396792", "Content": "Avonmore is in a central location and, for its price point, was clean and pleasant. We appreciated the good service at the front desk and good breakfast. After staying in much less nice accommodations nearby, we were pleased with the Avonmore and would recommend it to others.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "born60", "Title": "“Centrally located ,Friendly staff.”", "Author": "Deidreborn60", "ReviewID": "UR65755554", "Content": "This was value for money for a London hotel. The room was very small but reading reviews most of them are like that. Breakfast was good and the staff were very helpful and friendly and gave us valuable info as this was our first visit to London. This is a 2 star hotel and it was clean and warm, exactly what we expected.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Bolton", "Title": "“Aww...... Bless them.....”", "Author": "StickleBrick", "ReviewID": "UR34153312", "Content": "These people try so hard!!! Bless them! I went to the Avonmore with a my mate Dave, we needed somewhere to put our heads down in between getting drunk and watching Blur in Hyde Park - and that was it. For 50 quid a night in the centre of London i really didnt expect much so i thought the Avonmore was fine. The staff are flippin lovely, the slightly camp fella on reception always had a smile on his face and a genuinely interesting line of chat for us. The foreign lady who ran the breakfast room was smart, alert and fairly efficient. She could do with a pen and pad though as she kept forgetting our order - but then again we were speaking English and it's obviously not her strongest point. They all felt genuine that was the main thing, like they actually gave a damn about the place. Most chain/franchise style cheap hotel's staff look like they're paid to grin inanely and make crap small talk nowadays. The hotel itself? Hmmm.... well..... You cant polish a turd but you can keep it clean and tidy. The decor was tired and mismatched, the furniture even more so - apart form the beds actually which were very comfy! The ensuite was bloody awful (but clean!), the shower curtain was minging and it was hard to sit on the loo without banging your knees on the opposite wall. Plus the fan didnt work so a bog the size of an understairs cupboard gets very hot, very quickly! We thought all the furniture was crooked till we realised the floor was actually sloping in from the edges as all the joists are obviously bowing with the age of the place. I've got a bigger screen on my mobile than the telly in the room too, plus the wardrobe only had 3 (mismatched - natch) coat hangers in it. The room was in fact tiny - especially since it was supposed to be a triple! The view was bloody awful too - but then again it is central London. So in summary? It's a dump. But it's a CLEAN dump, with lovely staff, comfy beds, and a great cooked breakfast all for 50 quid a night. If you're after a romantic break or even a family friendly base - avoid. If you need somewhere to get a kip in between racing around the heady sights of London you really have got a diamond in the rough here.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Versailles France", "Title": "“OK, but no great shakes”", "Author": "Rodders78", "ReviewID": "UR21469242", "Content": "Friendly people, helpful with directions and travel information. Good location eg for Eurostar, Tube, British Museum and Oxford Street. Clean but very basic, eg no clothes hooks in the bathroom, no bedside lamps, blankets not duvets etc. A bit overheated. Breakfast standard B&B fare.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Friendly staff, fair service for a room in this location and price range.”", "Author": "miss_bunbury", "ReviewID": "UR14812956", "Content": "For this price in London you have to expect small rooms and having to carry your cases up the stairs. My boyfriend and I stayed here for only one night and I wouldn't want to stay here for a week, but for what we wanted it was fine. We stayed on the very top floor and there was a bit of a climb up a slim staircase to get there. The bathroom we were given was across the hall but we were given a key to maintain privacy so this was fine. It could do with some modernisation but was clean and comfortable. The breakfast provided was basic however we were offered refills of tea/coffee and fresh toast, other options were cereal and fresh fruit. The bloke that checked us in was polite and helpful and told us in peak season they offered a full English breakfast. A good place to stay for one or two nights if your needs are simple and you're on a tight budget.", "Date": "April 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brabant", "Title": "“probably not again”", "Author": "traveler1990", "ReviewID": "UR14760821", "Content": "The smallest hotel room I have ever stayed in during more than 15 years of business travel. Staff was very kind and helpful but the crammed room made for an uncomfortable stay. No space to put my (hand luggage size) suitcase without tripping over it. Ventilator in my bathroom was not working so everything steamed up rapidly after every shower. Location was great and price was low but will look for other options the next time I'm in the area.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Scotland, Fife", "Title": "“Beware you have the right one!”", "Author": "kmcconville", "ReviewID": "UR7960972", "Content": "There are 2 Avonmore hotels in London. One on Avonmore Rd (3 star) and one in Cartwright Gardens (terrible). Unfortunately for me I didn't appreciate this when reading the reviews and was booked into the Cartwright Gdns one. This was terrible. The staff may have been friendly but it didn't make up for tired and worn decor, old and shabby rooms. The room had not even as much as a telephone or bedside light. Make sure you choose the correct one as I suspect most reviews relate to the 3 star hotel. On the same street at the same prices are clean and modern hotels if this suits your budget. I'm not fussy but this is the worst I have ever been too; we spent the evening trawling around other hotels to book in. This was booked for a course. We cancelled for the second visit to the course and found somthing much better!", "Date": "June 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Wonderful friendly staff”", "Author": "Gl0balTraveller", "ReviewID": "UR6495314", "Content": "Great location. Worn rooms but very clean and friendly. Highly recommended!", "Date": "December 25, 2006"}], "HotelInfo": {"Name": "Avonmore", "HotelURL": "/ShowUserReviews-g186338-d574287-Reviews-Avonmore-London_England.html", "Price": "$125 - $267*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">57 Cartwright Gardens</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">WC1H 9EL</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "574287", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/32/59/32590aa7d4901bc94dfcf7d68d1b9c046large.jpg"}}