{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nola", "Title": "“Venice hotel.”", "Author": "chariNola", "ReviewID": "UR128144655", "Content": "It was absolutely perfect, quiet but very well located. The little terrace in our room was beautiful and breakfast was delicious!!!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent place to stay and great value for money”", "Author": "Csstarks", "ReviewID": "UR125515879", "Content": "My partner and I loved our stay in this hotel.the room was luxurious with a great view of the cannal. The staff were very helpful and even though it is the sister hotel that houses the reception you didn't feel forgotten in the separate building. It is in an ideal location just two minutes to saint marcs. the only downsides I can find with the hotel is that the building we were in also seemed to be private apartments aswell and it states it has satellite tv but only has two english channels. Tv would of been useful as there isnt a great deal to do at night in venice.These faults were not an issue for us and would happily stay here again.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“At home in Venice”", "Author": "LadBroke8", "ReviewID": "UR124290562", "Content": "Traveled with my partner in mid-autumn 2011. We arrived in the evening and easily got lost in the tiny streets of Venice. We called the hotel and asked if we could be picked up and they sent their porter who carried our luggage and led us to the hotel. Pros: 1) Great location... especially if you want to go for a gondola ride as some of them are parked right outside the hotel doorstep. 2) Buffet breakfast is typical Italian... cold cuts, breads and cheese. Set in the cozy sitting area overlooking the charming patio and canals. 3) Staff are very friendly. Rooms and bathroom were freshened up daily. Cons: 1) Although this could be a pro, IMHO the room decor was too heavy and dark. Perhaps this was the hotel's way of showing the typical Venetian decor of old. Our room furniture was dark wood, the wallpaper was in dark green and maroon.. it was just felt heavy everywhere you looked. 2) Bed cover looked like an old tapestry, and it made our skin itch.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Burke, Virginia", "Title": "“We enjoyed our stay”", "Author": "Paul N", "ReviewID": "UR123175108", "Content": "Stayed for three nights over New Years. Rooms were large and well furnished. Bed was very comfortable and staff at the hotel was friendly. Breakfast was good with croissants, yogurt, cereal and others. Our rooms did not have a view, but that is okay. Location was great.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Enjoyed our stay very much...”", "Author": "micheleishome", "ReviewID": "UR120964758", "Content": "We booked this hotel for one night prior to a cruise out of Venice. We were very surprised that for the price, it was a great deal. The hotel (which was a former palace) was very clean and quiet. The hotel staff was friendly and accommodating, especially Andrea Crosera. This hotel had free internet and a complimentary breakfast that was delicious. The room and bathroom were quite large and overlooked a canal. The hotel was a little hard to find, but it was worth it. We tried to book the same hotel after the cruise, but they were sold out. We were disappointed with the other hotel, which was part of the Best Western chain. We HIGHLY recommend Casa Nicolo Priuli.", "Date": "November 23, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ulverston, United Kingdom", "Title": "“We really enjoyed it”", "Author": "LizziePick", "ReviewID": "UR119325902", "Content": "We recently spent a week at the Casa Nicolo Priuli and our experience was very different from that of previous reviewers. We booked through Inghams, the week was an add-on to a week at Lake Garda. There were 3 hotels in Venice to choose from and we selected this one purely on the basis of the location. It was clear from the brochure that it was a 3-star hotel. We paid extra for a canal view room and were very happy with it. Having looked at the hotel's website I agree there are serious issues with it - it's not clear about the different gradings for the main hotel and the \"casas\" - but this didn't affect us. We checked in at the main Palazzo Priuli, and breakfasted there, but otherwise we really enjoyed the experience of having our own \"front door\". We were on the top floor with what seemed to be apartments below, but we never experienced any noise, and the reception staff at the Palazzo were perfectly charming and helpful. I think as long as people are aware that it's a 3-star property (and the hotel needs to do something about that website) they would be fine with the facilities.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“VERY disappointed.”", "Author": "regina t", "ReviewID": "UR119272157", "Content": "My husband and i were celebrating our 25th anniversary.I booked a superior double room soley on the photos provided.We have never been so disappointed.The hotel that is shown in the photos is the Palazzo Priuli. We were first checked into a room the size of a shoe box you could write your name on the glass with the dust and the room was suffocating. We went to reception and they moved us accross the hall to another room.It was clean and a little bigger.I was told i could move rooms the next day but when i requested this the next morning the receptionist was very rude and insulted that i thought this room was not good enough!! I explained about the photo and the misrepresentation of the hotel and she said they couldnt show all 45 rooms!!! we were in their sister hotel.As far as we could tell it must of been the ugly sister as at no stage does one photo you will see bare any resembalance to where we stayed. We didnt have a reception and there were private apartments in this block which were very noisy. Apart from the receptionist on Sunday afternoon who was helpful the other staff were rude and snooty. The location of CASA NICOLO PRIULI is great. We paid over 1000 euro for 4 nights and feel this hotel is very poor value. I will not reccomend this hotel and strongly suggest if you are booking this that you check which of the hotels you will be staying in. Our experience is not consistent with the great reviews and we have never felt compelled to write a review before.", "Date": "October 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "York, United Kingdom", "Title": "“coffin like experience”", "Author": "doobaski", "ReviewID": "UR117843737", "Content": "High expectations given the advertised room with a view. Not so. Room 305 was like a coffin-dark, with the window covered up with a non-removable blind to prevent you seeing the view of the washing. The bedroom was tiny with the bathroom bigger in size. The room was clean but very disappointing given the cost and description on the hotel website. Be aware that this is not the same as the 4 star hotel-when you look at the website you end up on at the 4 star hotel pictures-do not be fooled. Not sure which was more disappointing-the attitude of the receptionist or the quality of the breakfast. On complaining about the room and what we thought was commercial misrepresentation, we were told we had to spend more in Venice to get a better room! Our experience of the hotel is not consistent with the rave rviews we had seen. It didn't help that we had been staying in a fabulous hotel in Verona, where the rooms were lovely, spacious, bright and with very helpful staff. An experience not to be repeated. However, the loaction was very good.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "California", "Title": "“THE BEST”", "Author": "RoamnGnome", "ReviewID": "UR114940997", "Content": "I love this hotel - we stayed here with my 2 daughters & husband. it was in the best location, great staff.", "Date": "July 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“I have waited to try and be fair, but this is the worst experience ever ...”", "Author": "andrewsydney", "ReviewID": "UR110323660", "Content": "We are a family of 7 that travelled through Hong Kong and Europe in January 2011. Most places we stayed were fantastic, as per our reviews. However, this was a disaster. Firstly, when I booked three rooms through booking.com I left the message for the hotel \"Hi bongiorno ! We are a family traveling from Australia regards\". We then arrived at the address on the booking of Castello 4984/5, Castello, Venice. It's a small reception, but manned, and as we went to check in we were told that we would be in two different buildings. This, of course, was unnacceptable because we had four children in our group, so we could not split the group in that way. It got worse; the two buildings we were going to were BOTH different to the building we were at with the reception, and neither had overnight reception. Given the price we were paying, this was extraordinary ! When we were booked, the photos were of a premise were we checked in; but other than that we did not step foot in the hotel ! It was like checking into a 4 star Novotell to stay at the 2 star Mercure next door, and after you had booked the hotel rooms because you had searched for 3 star and better properties ! So, there are a few big issues here. One, the advertising should have made it clear that the rooms were detached from the premise that we searched and booked. Secondly, the premises are rated differently; they should not be marketed jointly without CLEARLY letting customers know this fact. There is NOTHING on my booking.com confirmation to this effect. Thirdly, especially for children and the elderly, it should be made clear that the premise they will stay in is not attended at reception for 24 hours; even today, when I searched the hotel through skyscanner hotels the first feature listed in amenities is 24 hour hotel ! Fourthly, we searched for 3 star and better establishments when clearly the rooms we were given were not of that standard. We arrived at 6pm on a Friday night, with 4 children and a 70+ year old, so it was impossible for us to relocate for the night we were in Venice. Frankly, visiting for one night it is disappointing we need to spend any time at all at reception being shocked by such unprofessional surprises. Make no mistake; this was commercial deceit the likes of which would be illegal in our home country. The attitude of the staff when we raised these issues was a shrug of the shoulders and ... tough luck ! Sorry, just not up to scratch, Casa Nicolo Priuli. Having said all of that, the rooms were ok, albeit the steps steep and corridors narrow for our elderly companion. The experience was soured by all of the above though; we could never book here again in good faith, and suggest travellers stay elsewhere in Venice. I have purposefully waited some months before posting this review to try and be more objective, but the end result can't be changed - this was disgraceful, unethical behaviour by Casa Nicolo Priuli. Caveat emptor !!!", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oswaldtwistle", "Title": "“Excellent value for money”", "Author": "JulieLancashire50", "ReviewID": "UR98103467", "Content": "This small hotel, near to the major tourist sights, is an ideal base for exploring the centre of Venice. The rooms are clean and comfortable and decorated in typical Venetian style. The breakfast is continental with a good choice served in a small summer room. There are plenty of good restaurants nearby.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Great little place”", "Author": "GrantNixon", "ReviewID": "UR84931785", "Content": "Very happy with the stay, room was very nice and modern, front desk were very helpful and the breakfast was pretty nice as well. Little hard to find but other than that no complaints.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fleet, United Kingdom", "Title": "“great place to stay”", "Author": "EyesD", "ReviewID": "UR79197336", "Content": "Casa Nicolo Priuli is a bit confusing as there is a 4 star and 3 star hotel. They are all in the same street next to a romantic looking canal, and opposite three shops with more carnival masks than you have ever seen. We stayed in the 3 star hotel, which seemed to be in several adjacent buildings; ours was actually accessed from the street to the rear, so we had to walk around the street corner to get to the breakfast room, which was actually good fun. There was a lot of antique style furniture, the room looked really nice with heavy curtains, and wooden beams. The staff were really polite and helpful. The only problem was that the people in the next room had their TV on most of the night which you could just hear a bit.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Don't ask the front desk for help!”", "Author": "AtlantaLovestotravel", "ReviewID": "UR72138188", "Content": "The concierge and manager consistently gave us incomplete or outright misinformation. DO NOT take them up on their offer for a free boat ride to Murano. They take you to one glass factory that will not let you leave until you purchase something (and everything is expensive) and then they take you straight back to the hotel. I have since been told this is common practice for all the hotels. Pay to take the ferry to the island instead. Purchase a good map of Venice and do your research on where you want to go and how to get there. Do not rely on hotel staff to help you. Otherwise, the hotel is average but in a good, quiet location.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "The Netherlands", "Title": "“Great location and value”", "Author": "Dutch_Traveller_0412", "ReviewID": "UR68720631", "Content": "We got a great deal on this hotel. The location was really perfect, a neighbourhood with shops and restaurants (but silent at night) within 4 minutes from the S Marco square. The hotel(room) itself was beautifully decorated in old Venice style and had free internet. Breakfast was inside and in the patio outside. We had breakfast in the patio twice next to the gondel which was in the small canal right in front of the hotel, very romantic! Also the vaporette stop S Marco - San Zaccaria was only a 4 minutes walk. From here you have quick access (line 82) to the railway/busstation. Luggage can be left in the hotel on the departureday, very convenient! Minor remarks: The hotel was hard to find when we arrived in the late dark evening on our first visit to Venice, Once we found it, the reception was closed. After a phonecall we were told to check in at the 'Palazzo' Nicolo Priuli, 20 meters further in the street. More people have 'complained' about this. Because of outside reconstrucion work (and the lack of thick curtains in room 305), it was not possible to have a darken the windows so we woke up very early each morning (but this also gave us more time to see Venice!).", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location and great price”", "Author": "speedlucas", "ReviewID": "UR63222645", "Content": "This hotel is really nice. It is what you expect from a hotel in Venice. We booked it through booking.com and found out later that the hotel had a better deal, after emailing the hotel they refunded the difference, which very kind of them. Staff was very nice and pleasant and to be honest, can't fault this hotel, I just wish we had spent more time there.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "newzealand", "Title": "“room for a princess!”", "Author": "gipcyan", "ReviewID": "UR58898939", "Content": "After looking at photos and reviews on internet and knew which room we wanted first, we'd heard some were better than others. We had tried to email to the hotel several times to request this particular room, but they were very slow to reply! Finally, at the last minute we managed to book the room we wanted number 301. The room was big and gorgeous with burgundy hung fabric wallpaper, velvet curtains.. lovely wooden furniture. Views from the 2 windows onto the canal below us. The bathroom had heated floors and a nice big bath tub. As part of the \"i love venice\" promotion, we recieved a bottle of prosecco on arival, free newspaper, and tickets to casino etc, and half price 2nd night stay. The breakfast was really good here, a lot of selection, they even had lovely rich dark chocolate torte!! Really enjoyed our stay here.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Italy", "Title": "“hope we have more time to enjoy the hotel”", "Author": "liberaljr", "ReviewID": "UR54177929", "Content": "We stayed only one night in Venice, nevertheless we enjoy it very much! The hotel give us a free upgrade to an better room and it was awesome! All decorated with old themes, great breakfast and good location (5 minutes walk from the Piazza San Marco). 100%.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Diego", "Title": "“Nice room and location, but hard bed and somewhat noisy”", "Author": "CyrusL", "ReviewID": "UR48057279", "Content": "Our room was spacious, especially by European standards in a popular tourist destination, and nicely appointed. It had enough room for a small table and two chairs in addition to the bed. The bed was rather hard and despite being a so-called matrimonial bed, it was just two singles pushed together leaving a crack in the middle. To be fair both bed issues seem common in Italy rather than just limited to this hotel, but still there must be comfortable queen size bed somewhere in Italy, especially in this price range. The elevator was claustrophobic; aside from moving the luggage we always took the stairs but this could be an issue for some guests. Breakfast was quite tasty both mornings and served in a very nice setting. Physically, the location is great, just a short distance from St. Mark's square. But it is also a fairly noisy. Boats run along the canal all night. And worse there is a touristy cross between an Italian bar and gelato store that no Italian would ever visit that is quite loud. Maybe jet lag made it worse. The internet is free but as in most Italian hotels it is a hassle. I don't understand why Italian hotels can't just hand out a WEP/WPA key and perhaps change it once a month or week. Instead many of them have subscribed to a tedious system where you receive a ticket with a username and password good for say 24 hours. Both the username and password are eight characters and contain a tedious mix of lowercase and numbers, more suitable to a bank or trading account than mere internet access. Moreover, the system automatically logs you out after some period of inactivity, perhaps an hour, and it often seems necessary to reenter the tedious username and password (I was using an iPod touch). One comment from another hotelier seemed to imply this hassle was a result of 9/11 and presumably a legal requirement. Maybe the hotels can start pushing back against the surveillance society in the name of business; terrorists who who want to go undetected will find a way whether it is encryption, digital stenography, or any number of other means. The rest of us just want to lead our lives.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kent", "Title": "“Perfect location and spotlessly clean!”", "Author": "Gurleygirl00", "ReviewID": "UR45743998", "Content": "My husband and I have recently returned from Venice and were pleasantly surprised at the level of service we received at this hotel. After a phone call to the hotel asking for directions from the vaporetto, the porter came to meet us and carried our bags to the hotel(which was only a few minutes away!). The room was spotlessly clean, granted it was rather dark but that was down to the typically Italian rich coloured walls and furnishings. The location was fabulous and only 5 minutes walk to St Marks Square and very central for exploring the rest of Venice. We had gondolas right outside our window and created a typically Venetian atmosphere. The free WiFi was very useful and enabled us to research a few sights and restaurants. The breakfast was extremely good for a Continental type, fresh hot rolls and croissants, an abundance of fresh fruit, cereals, cakes, pastries, cold meat and cheese and the coffee was hot and plentiful. When we return to Venice I would definitely stay at this hotel again.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Lytham St Anne's, United Kingdom", "Title": "“Great location”", "Author": "Sorellina", "ReviewID": "UR39207780", "Content": "This hotel buildings are pretty and traditionally styled - you certainly know you're in Venice, with old paintings, carved wooden furniture and Murano glass chandeliers. My room (405) was spotlessly clean, although the bathroom was a bit tired looking, and fairly large. I had however paid extra for a canal view room and whilst I wouldn't dispute that you could see the canal (just), it certainly wasn't worth any extra cash! I also had lots of mosquitos but presumably that isn't as bad at other times of the year! I arrived very late and was given no information about the hotel or it's facilities. Staff seemed friendly though and I'm sure if I'd asked any questions they would have been answered helpfully. The breakfast was good - better than average with lots of choice. Check out wasn't until 12 and I was able to leave my luggage for the rest of the day which was a big help. Hands down, the best thing about this hotel was its location. Less than five minutes from San Zacharia vaporetto and about the same to Piazza San Marco. Plenty of shops and restaurants in easy walking distance. The nearby San Zacharia church is also worth a visit.", "Date": "August 30, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "UK", "Title": "“Avoid this place”", "Author": "SimonBUk", "ReviewID": "UR36624641", "Content": "We booked through booking.com, after reviewing the hotel's website and under the impression this is a four star hotel. It is a mediocre 3 star., if not 2 star. The room they gave us was small and dark, looking like a cupboard, with no canal view (as booked). It was not worth the money and we immediately checked out, paying first night accomodation as penalty. The hotel staff were rude and suggested we book at there sister hotel. On the positive side, location is good.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "new york", "Title": "“avoid this place not worth the money”", "Author": "5townguy", "ReviewID": "UR32623244", "Content": "we booked a deluxe canal view and we got a street level room with bars on the windows we had to keep the drapes drawn to keep passer-byes from looking in the room was large and clean but had 2 chairs, both broken when we complained they suggested we book the more expensive pallazo next time", "Date": "June 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Boston", "Title": "“DO NOT take restaurant recommendations from the staff!”", "Author": "enno619", "ReviewID": "UR32455002", "Content": "The accommodations were fine but nothing special. It is very high priced, but I believe that is standard for Venice. Whatever you do, DO NOT take restaurant recommendations from the staff. They told us \"we know many restaurants that have good food and reasonable prices\". What we got was an expensive meal and the worst food I had in Italy. I was told that the hotel staff get kickbacks from these atrocious, tourist trap restaurants. Also, Internet access didn't work, and the hotel refused to consider making that up to me in the way of a discount or other amenity. They were rude and patronizing when I tried to discuss it.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Romsey, UK", "Title": "“A Lovely Place to Stay”", "Author": "mayo1946", "ReviewID": "UR24404720", "Content": "My sister and I have just returned from 5 days in Venice (4 nights in Palazzo Priuli). We enjoyed every moment of our stay. We had a corner room on the top floor of the annexe, at the junction of 2 canals; the views were wonderful. The service was friendly and helpful, and the breakfast was so good that we used it as our main meal of the day on a couple of occasions. There were gondolas moored outside our front door and we got a good deal on a quiet day. The hotel was pretty easy to find from the San Zaccaria or San Marco vaporetto stops and was well situated for sightseeing. We had a wonderful evening in a Palazzo on the Grand Canal watching a performance of 'The Barber of Seville'. We got lost many times in the little alleyways, despite maps, but that's par for the course. We took our raincoats & wellington boots and enjoyed paddling in St Mark's Square when it rained. Go and enjoy!", "Date": "February 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Riga, Latvia", "Title": "“Great hotel but does not meet the expectations”", "Author": "Vinetu", "ReviewID": "UR24197634", "Content": "Great venetian style hotel, excellent location, good breakfast! We stayed for couple of days at the end of January to celebrate our 19-th honeymoon. Venice is romantic and outstanding city even in winter and may be Brodski was write saying this is the right time when to visit it. The only dark side of it was the room hotel offered, as we realized after, it was not the Executive room at Casa Nicolo Priuli (Hotel consists of 3 parts) booked via Internet, but Classic room at Ca Priuli, small, dark (small window looking courtyard). Well, if you are in a romantic mood (as almost everyone in Venice:)) and have made a booking in advance choosing the room then it is a little bit unpleasant not to get the promised one in photos. But otherwise everything was great!", "Date": "February 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Croatia", "Title": "“Decent place, great location”", "Author": "amarkovi", "ReviewID": "UR21746601", "Content": "We stayed for two nights, and overall were happy with the place. It deserves a 3.5 rating, with a little work maybe even a 4. The hotel consists of 3 buildings; there are two buildings attached to each other (rooms, longe, breakfast...) and the main hotel building where the reception is, just across the alley. All the buildings overlook a small canal (but I don't think all the rooms do), across the which there are a few shops, a couple of bars and gondolas to rent. We slept in the first of the 3 buildings, had key-card access from the street. On the ground floor there is a kitchen with the breakfast area and the stairs to the above floors where the rooms are. Location: excellent! You get off the vaporetto at the Zaccaria station (S. Marco) and in 5 minutes you are there. The hotel is located close enough to everything and then again away from the crowd. There are a few restaurants next to the hotel. Rooms: the rooms are quiet large, the decoration is all right although it all looks better on the pictures than in person: maybe if the finishing had been done with little more care it would have looked much better - but this is going overboard, for a \"normal\" person it is just fine. We had a mini bar, tv set, small safe, wardrobe, a table and 2-3 chairs. Bathroom: the bathroom is nice and clean. There is a shower curtain, you get the small welcome set (soap, shampoo, shower cap, toothbrush and toothpaste); large and small towel and a floor rug. Breakfast: excellent! You get a little bit of everything: ham, cheese, eggs, salad, fruit salad, yogurts, fruit, croissants, cornflakes, muesli, juices, coffee ... really a lot to choose from, and the waiter keeps bringing fresh stuff if it gets low. There's even a toaster! Breakfast was really a positive surprise. Overall I would recommend this hotel for stay in Venice. We payed 150 euros/night for a double room w/breakfast ... not cheap but then again nothing is in Venice. With a few cosmetic touches they could really leave a much better impression, but I would say it is one of the better 3* solutions in Venice.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Suffolk", "Title": "“Good place to stay”", "Author": "JohnHols", "ReviewID": "UR18630406", "Content": "This place is OK to find, a few mins walk from St. Marcs, however some travel agents position it in completely the wrong location! Look at the hotel's own website to get the correct map location. Check-in is at the Palazza Nicolo Hotel next door, which is now merged into the same hotel. This is in a beautiful canal just off the main tourist routes. You can pick up a gondola from right outside the hotel (about 3 very laid back gondoliers run from here) who's standard route does not get caught up with the \"gondola jams\" near St. Marcs, a far more romantic experience (100 Euros at night). The hotel is 14th century, very clean and comfortable. Our delux canal view double room had a good view of two canals and a Basilica with its own leaning tower. The room was decorated in \"period style\" but with a luxury modern bathroom. However the air con was inadequate for August. The room was slightly removed from the main hotel in some converted apartments next door, on the top floor- this corner position is necessary for the canal views. If you get one of these rooms there is a small lift but remember to keep your finger pressed on the button all the time to make it move! Breakfast was a very nice buffet with good choice. A small bar across the canal serves great food at a reasonable price, but plays music till midnight, which then stops prompt, so don't go to bed too early.", "Date": "August 5, 2008"}], "HotelInfo": {"Name": "Casa Nicolo Priuli", "HotelURL": "/ShowUserReviews-g187870-d575690-Reviews-Casa_Nicolo_Priuli-Venice_Veneto.html", "Price": "$183 - $558*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Castello 4985/4</span>, <span class=\"locality\"><span property=\"v:postal-code\">30122</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "575690", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8e/62/8e6208c095f99e326246bd96616fe56d7large.jpg"}}