{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ghent, Belgium", "Title": "“Nice hotel at 20 min. with car from city center.”", "Author": "BARTVDB100", "ReviewID": "UR136961460", "Content": "Nice hotel, all rooms are suites so very big. Many people rate this hotel with high degree of kitch, breakfast is very poor. They have a swimming pool but it is indoor and too hot in summer. Tennis on the roof and fitness possible but you have to pay extra. Also possibility to play golf but at extra pay. Restaurant has limited dishes and opens only at 21.00 hrs. But you can eat a snack in the bar.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Probably the best place to stay in town”", "Author": "landonroussel", "ReviewID": "UR131188257", "Content": "This place is really clean (I mean, sparkline), has beautiful artwork (ranging from Egyptian statues to Quijote paintings), is beautifully designed (with sunlit dome in the center, all rooms [I think] have a porch with a view), enjoys a convenient location right next to the rail station, offers unbeatable prices and provides (at the price of 10€) access to spa (with Turkish bath, sauna, thermal pools and solarium). Moreover, the service is excellent: the cleaning was timely and, the staff were accomodating to special requests.There is little more one could ask for in a hotel, really. So if you're going to Tres Cantos, or if you're going to Madrid and don't mind the Cercanìas trip, stay here. The only drawbacks I would say are 1. the breakfast, while nice, is not as good as the VP Jardìn nearby--the meats are poorer quality, bread is factory made and cereals are from the box; 2. the details about requirements for the spa were not provided in the room, and one of these was that a swimcap is required--kind of annoying to have to keep buying swimcaps.", "Date": "June 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "ire", "Title": "“it was ok just for 4 nights”", "Author": "ivan b", "ReviewID": "UR129034230", "Content": "i stead here with a coupe of friends mid march, the hotel surrounding are very boring , you would have to get a bus or taxi to where you have to go . our room had ants in it and to the other guests that were staying there too i heard the same thing. the rooms were big and the bathroom was very nice. The dinner was not very pleasent , the only proper food we got in the day was lunch when we got it in the city . the breakfes was breadrolls and pastrys not very nice either . the hotel itself was very boring and no ive at the bar .", "Date": "April 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Nice rooms, awful noise”", "Author": "ruiamador", "ReviewID": "UR126898609", "Content": "Foxa 3 cantos is a niuce business hotel but lacks on the noise side. It is near a major highway but noise isolation from the windows is just inexistant. If you book a room make sure it is by the train station side and not by the road. Breakfast is just acceptable. Rooms are big and spacy, and the integration of oriental furniture is very interesting.", "Date": "March 29, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Thaxted, United Kingdom", "Title": "“Always first class”", "Author": "dave_c_piper", "ReviewID": "UR117838339", "Content": "I used the Foxa for business trips, and this was the first time fors leisure, on our way from France to southern Spain. Good price deal, room as always first class. Also, use of the spa was very relaxing. This is an ideal hotel for passing round Madrid, but also, if you want to take a trip into Madrid, literally 5 mins from station for a fast train link to the city centre. Also, nice restaurants close to hotel.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Excelent”", "Author": "Nelson P", "ReviewID": "UR115957709", "Content": "Very good offer for the money, big rooms well prepared, nice employes. Recomended.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Large rooms, great gym in the same building, but only if you are making business in Tres Cantos”", "Author": "BizLeisureFred", "ReviewID": "UR81062224", "Content": "Surprisingly large rooms in quite traditional style. Difficult key locks; why not replace them with just a standard swipe card? The hotel is quite nice & spacy, but feels somehow incorrectly located just nearby the motorway with not so nice surroundings. The best with the hotel is likely the gym in the same building. You have to pay 10 EUR for it, but then it is on the other hand a very fully fledged gym. Better than a stroll in the surroundings ;-) All in all: Can be recommended, but only if you have to stay in Tres Cantos for business.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Make sure you like kitsch before booking a room at this hotel”", "Author": "manolituca", "ReviewID": "UR80618826", "Content": "All in all this is a very decent hotel - the staff are friendly, the rooms are clean and comfortable and the breakfast buffet is good. The only thing that I found rally annoying was the decoration. If you want to see a combination of Luis V and Chinese emperors' interior design styles then this is the place to visit. Absolutely tasteless but very creative:)).", "Date": "September 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cambridgeshire", "Title": "“Nice stay - expensive swim!”", "Author": "Brian-n-Debs", "ReviewID": "UR38997637", "Content": "I was fortunate to stay at the Foxa Tres Cantos Hotel on business and found it extremely pleasant and relaxing. The room (207) was large and very spacious although the bed was only a 4’6” size. When returning to my room each night, after an evening out, I found my sheets turned back with a small box of two chocolates placed on the pillow. Breakfast was nothing special – the usual continental buffet (fruit, cheese, cold meat, boxes of cereal) and scrambled eggs and bacon. The coffee machine was daunting, with all the options in Spanish, but once you realized that it only dispensed black coffee and the options just determined the amount and strength that was dispensed (with a separate milk dispenser to the side), it wasn’t too bad. My only gripe is that although you are paying 90 euros a night to stay there, they want to charge you an extra 10 euros a day to use the swimming pool, and if you haven’t got a swimming cap (which is necessary in Spain when swimming in indoor pools), that’s another 6 euros!", "Date": "August 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "cork", "Title": "“FAB HOTEL BUT HAUNTED”", "Author": "maz18", "ReviewID": "UR16440190", "Content": "I have just returned from a stay at the hotel, my first impression was fab hotel, friendly staff, everything you could wish for! We stayed in room 121 and didnt actually end up staying the night as it was haunted! Firstly i lay down in the bed and felt this person pressing on my shoulder and then things stayed to happen, There was foot steps in the bathroom, a black cloak floated passed me,Tapping and knocking on the head board and then a person in the corner in an metal outfit, I thought i was imagining it but there was 2 of us in the room and we were both feeling such a strong aura! What freaked us out most was the safe buttons started to move, you could here this quite clearly and thats when we got really scared! We packed up in such a hurry and ran out of room 121 but just as i closed the door, someone pushed me from behind, 2 pushes and i got such a shock that i got so upset, It was like as if some one was throwing you out of a nite club! We ran down stairs and tries to explain what had happened, they were surprised to see us as they properly thought we were mad leaving during the nite! They said that there was no one in either side of us in bedrooms! Its like when you et a fierce force or shivers all over your body< The hotel was amazing but if we had stayed in the room any longer, something bad would have happened! This is a genuine report! ROOM 121 WILL ALWAYS STICK IN OUR MINDS! IT WAS A NIGHT TO REMEMBER!", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Midlothian, Scotland", "Title": "“Fantastic cupola”", "Author": "bobm2190", "ReviewID": "UR7270637", "Content": "We were invited to Tres Cantos for a wedding and the entire group who travelled from Edinburgh ( EasyJet now flying direct to Madrid) were booked into this hotel. The entrance/lobby is spectacular, staff friendly and helpful, rooms big and the place is spotless. Only downside was the heat in the room - air con was set at 19C and despite asking 3 times to turn it down as the control box in the room had no effect, it stayed at 19 - our room overlooked the dual carriageway and it was too noisy to leave the balcony door open. Local bars and restaurants are 5-10 minutes walk as is the station. €3.15 gets a day return into the middle of Madrid and we found it really handy. Weekend rates are really good for the standard of the place. Well worth considering if you are looking for a luxury weekend away.", "Date": "April 2, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Newbury", "Title": "“Excellent hotel - especially for the price”", "Author": "TheNorthernMonkey", "ReviewID": "UR5032607", "Content": "True - it's not the ideal hotel for the city centre. But it really is an excellent hotel - both the facilities and the staff. And also the train station is a 5 minute walk away. Am going back there next week!", "Date": "May 4, 2006"}], "HotelInfo": {"Name": "Foxa Tres Cantos", "HotelURL": "/ShowUserReviews-g187514-d576871-Reviews-Foxa_Tres_Cantos-Madrid.html", "Price": "$52 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Ronda De Europa 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">28770</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "576871", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c3/ac/c3ac08981b6fe071d2682e241ead12b21large.jpg"}}