{"Reviews": [{"Content": "Unhappy guest I stayed in the Bali Sorgawi in August with my partner, at the bottom of an alley used as a urinal and populated by a guy selling hashish the hotel is away from the road and quiet. Breakfast is poor, no choice and some strange rules, you cannot have a coffee refill because they provide free coffee in your room ? Duh ! whats the difference ? Only the cleaner was friendly, everyone else was either surly and foot dragging or just plain bored ! the place is somewhat run down but they still managed to buy a very large screen plasma tv for the dining/breakfast area and the tv in reception has many more channels than the ones in the rooms, should you feel the need to stay in at any time.My suggestion would be to start treating the guests like they are paying your wages and move all those mopeds and cars from the swimming pool/reception area, its supposed to be a hotel not a bike rental / car park. This is the first time I have stayed in a hotel and made extra breakfast in my room as anything but the scrambled (actually an omlette) egg was tasteless and I assure you, one fried egg and two pieces of toast do not go far !The rooms are adequate, cleanish, the pool is raised and there is only room for 4 sunbeds as long as two of you like the shade.If everything else is booked, choose the Bali Sorgawi but there are better and cheaper hotels nearby !", "Date": "Sep 4, 2008", "ReviewID": "UR315403805", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "2"}, "Author": "travellerinasia"}, {"Content": "Just what I was looking for The Bali Sorgawi Hotel is a cute, clean place with friendly staff and an excellent location in Kuta. It is about two blocks from the beach, there is shopping all around, and plenty of night life within easy walking distance. It is set about 100 yards off the main drag, down a narrow alley, but this way there is no noise from the street. The taxi from the airport took about 15 minutes. Personally, I don't require much from a hotel, except that it be clean and safe, and in a decent location. This was definitely all three. The pool was clear and inviting, the tiles in the common areas were so clean they were even slick, and the room was very tidy.Here are a few objective points which, positive or negative, mean little to me in my choice of hotel.What you may like:-Complimentary breakfast cooked to order, from a menu of about six items, mostly Indonesian-Beautiful grounds-You can charge a cold beer to your room for a reasonable price and drink it in the pool-Small workout area-Your own little verandaWhat you may not like:-Television stations are only in Indonesian (I don't know if there are English stations even available), and the cable connection was fuzzy-The room was small-ish-The beds were hard-ish-No elevatorMy friend and I thought it was an excellent value, and will stay there again if we stay in Kuta", "Date": "Mar 8, 2008", "ReviewID": "UR679810782", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "chickpilot"}, {"Content": "Enjoyed the stay We booked into Bali Sorgawi as it was the only hotel we could find in Kuta that still had rooms on the 1st, 2nd and 3rd of January (we only booked a week or so ahead). So we weren't expecting much. The hotel exceeded expectations though. A decent walk to the beach, and you have to dodge the touts offering massages and transport and drugs and sex... do NOT go with any of these, no matter how well they present themselves. I made the mistake of getting a massage near the hotel, and they tried to hit me up for $140!!! (paid $10 to each of the 3 ladies, too much but worth it to get out of there).Breakfast was basic but more than adequate, and they were flexible on the menu (would provide extra items like soft boiled eggs for our son). Anyway, if you want a more sumptuous breakfast you could easily step outside and there are many excellent (and cheap) restaurants within 5 minutes walk.We hired a car at the hotel (they have a selection of people-mover type cars). Car and driver was 350,000 rupiah (about $37) for the day, fuel included. Denpasar and return was 100,000 rupiah (2 hour round trip at this time of year), which is a little over $10, and they will take you to the airport for 30,000 ($3). Cars were clean and in good condition, and the drivers were polite and helpful and knew their way around, and drove carefully.Room was decent enough, especially with a DVD player available for $2 a day (came in handy as the weather was shocking at times). Swimming pool was appreciated by our 3 year old son. Not the greatest hotel I have ever stayed in, and it was a bit of a hike to the beach, but would not hesitate to recommend the place.", "Date": "Jan 6, 2008", "ReviewID": "UR511762513", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "3"}, "Author": "bkk_bill"}, {"Content": "shabby chic       Legomban Island", "Date": "Nov 3, 2007", "ReviewID": "UR776940150", "Ratings": {"Service": "2", "Business service": "4", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "3"}, "Author": "LondonAnn"}, {"Content": "cheap price but.....   showReview(19890424, 'full');", "Date": "Sep 8, 2008", "ReviewID": "UR893961044", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "lovina66"}, {"Content": "ottimo compromesso   showReview(19648977, 'full');", "Date": "Aug 21, 2008", "ReviewID": "UR997854100", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder   showReview(11667762, 'full');", "Date": "Oct 17, 2007", "ReviewID": "UR369049428", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Gutes Preis-Leistungsverh盲ltnis, sch枚nes Hotel   showReview(11667761, 'full');", "Date": "Oct 17, 2007", "ReviewID": "UR911365944", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Super Hotel   showReview(11434666, 'full');", "Date": "May 13, 2007", "ReviewID": "UR938563775", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Der Urlaub im Bali Sorgawi Hotel war trotz damaliger Bauma脽nahmen super...   showReview(6130996, 'full');", "Date": "Nov 14, 2006", "ReviewID": "UR694049212", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "2"}, "Author": "karsten073"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297697-d576982-r19730980-Bali_Sorgawi_Hotel-Kuta_Bali.html", "HotelID": "576982", "Price": "$39"}}