{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing! Great, friendly staff, very clean & new and perfect location quiet and close to central station”", "Author": "Patty L", "ReviewID": "UR127329314", "Content": "We loved the hotel. It was very central (15 minute walk from Central station) and in a much better part of town, in front of a very nice enchanting park, away from the very busy, dirty, and crowded red light district, But close enough to visit it. The rooms were very clean and new. Staff very helpful like my remote control not working properly and being replaced right away or having our luggage safely stored while waiting for check in. The shared bathrooms are very clean and well kept and never busy or engaged given there's 2 per 4 rooms floor. The only downfall is the coffee shop and 2 clubs downstairs which specially during the weekends can be very noisy but not if you are on the 4th floor like we did. Prices are extremely cheap for central Amsterdam and breakfast simple enough but very nice and more than enough.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good if you do not mind noise”", "Author": "Matias82", "ReviewID": "UR127147824", "Content": "Very clean and well located although a bit too pricey. Ideal if you do not mind the noise (party goes on until very late in Rembrandt Square)", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“beware the stairs”", "Author": "sj183", "ReviewID": "UR125901654", "Content": "Stayed here for three nights in january 2012. Nice clean place to stay in a great location with alot of attractions within walking distance. Breakfast is in smokeys bar which is to the left when you come out of the door and was pleasent but nothing out of the ordinary. Perfect to set you up for the day though, and no limitations to how much you could have. Didnt really have any plans we just spent the days walking around taking in the scenery and doing a bit of shopping. Came across the zoo which if you are a family travelling would have to be amsterdams best kept secret. Lots of things to do in the area and there is a tram stop just across the road so you can travel a little further out. Stayed on the fourth floor overlooking the square, was a lovely view but did have to close the window at night due to the noise of the clubs below, although after a long days walk fell asleep pretty easily. Bathrooms are shared with another three rooms however never had to wait for them and were always clean and fresh. I would say if your not there for the nightlife it probably isnt the best place to stay, especially if your a light sleeper. The stairs up to the rooms are fairly steep and seem to go on forever after a night out, (but then most places in amsterdam are due to the nature of the buildings). would recommend using the central station to get back and for to the airport as travel is easy and cheap. Got a taxi to the hotel for 45euro, which is a little scary with all the bikes and trams, but then braved it on the way back and walked the 10min walk over to the station and paid 8euros for both of us to the airport. You get out actually in the aiport and only takes about 15mins, was much easier and felt much safer. overall would recommend as the hotel is clean well kept and in a prime location but just be aware of its little downfalls.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great find”", "Author": "spursaway", "ReviewID": "UR125079460", "Content": "I stopped here when my football team played here and found the cheapest place I could find.a twin room for â‚¬50 a night an absolute bargain for me and my mate.i was fearing the worst due to the price but on arrival I was surprised how clean the place was.but best of all is the location.my room overlooked Rembrandt square that had an ice rink and Xmas market on it,and the hotel is in the middle of everything in Amsterdam.the steep stairs are a struggle after 15hours partying but it's the same in other hotels due to the nature of the buildings.the buffet breakfast is as good as any in Europe,there all pretty much the same.all in all a cracking little hotel.and smokeys below the hotel is worth travelling to Amsterdam alone a great place where I've never laughed so much since I watched my best mate fall in the river whilst fishing in the summer of 1988", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Galway, Ireland", "Title": "“Best EVER!! great value for money”", "Author": "grace o", "ReviewID": "UR122543838", "Content": "Best value for money. its only a one star so we were expecting it to be dirty, smelly, unhelpful staff but it was fresh, clean and the most helpful staff you could ask for. recently painted. we were on the top floor(not fun walking up them after a few j's or drinks!) bed sheets and towels cleaned single day. best location u could ask for. opposite Escape niteclub few more pubs, restruants and two coffeeshops side by side the hotel.. get bubblegum in the coffeeshop below the hotel. laughed my bum off for an hour. little sink and mirror in room. full length mirror also. it is 2 shared bathrooms with another room on each floor. water so warm and we never crossed path with other guests which was great. television little flatscreen load of channels. book early and you'll get it really cheap. two of us for 4 nights , twin room for 120euro each!!", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Cheap and Cheerful...Close to centre”", "Author": "danni_yelly", "ReviewID": "UR122284120", "Content": "I have been to this hotel numerous times as it is so cheap and very close to Dam Square (about a 10-15 minute walk). The price includes a breakfast (it's very basic with bread and hot drinks) which is enough to fill you up and there is also free wifi available. You just need to ask for the web key. The staff are very friendly and helpful and they have a great map available as well as offering a free drink at the bar below. The rooms are clean and basic with TV and has shared bathroom. It's great value you for money as it is in a great location. Rembrandt Square is well known for it's artists and performers. I found an Italian restaurant on just off the square which was very tasty and great prices.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "los angeles, ca", "Title": "“More of a hostel”", "Author": "blueskyzander", "ReviewID": "UR119546801", "Content": "Great location but this is really a hostel the bathrooms are clean but shared there is a small tv the beds are single mattresseson top of box springs On the floor. You can hear everyone in the building", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“cleanliness is godliness”", "Author": "marshall h", "ReviewID": "UR119288408", "Content": "very clean hotel and great location.coffeeshop underneath if that's your kind of thing,you don't have far to walk to get to your bed then.single night option was why i stayed there,wanted to move around the city on a daily basis.lot cheaper places to stay but if you want a clean room,sheets bathroom etc then this place is worth having a look at.friendly people in the c/shop underneath to give directions.", "Date": "October 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Really great for a budget option.”", "Author": "KellyGreenteam", "ReviewID": "UR117791051", "Content": "We stayed here because it seemed the best of a bunch of centrally located budget options and we were prepared for the worst as it was only for 2 nights and everywhere was booked solid. However, we were very pleasantly surprised. Staff were friendly and when our room key wouldn't work when we arrived we were moved to a bigger room (a triple instead of the twin we had booked) with no fuss. The room was small ( this is common for central budget Amsterdam rooms) but really clean, had a kettle with lots of tea & coffees, there were 2 bathrooms shared between 4 bedrooms and our room was cleaned daily. The location is perfect for walking to all the tourist attractions,has lots of bars & restaurants nearby and breakfast was excellent. I would not hesitate to stay here again.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Silver Spring", "Title": "“Nice Location. Average Hotel”", "Author": "BoogieChillen", "ReviewID": "UR117452171", "Content": "Rembrandt Square Hotel is in a great location near the center of Amsterdam. There are several restaurants on the square and if your interested Smokey's Coffee is in the same building. Also, if you're not in a hurry it's within in walking distance to several attractions. The hotel itself was just average. It appeared clean and we slept okay but I've definitely stayed at nicer hotels. We were on the 4th floor and the first night was pretty quite but the second night you could hear the music from the nightclub on the square. It wasn't bad on the 4th floor but if you were on the 1st or 2nd it probably would have been pretty loud. Also the steps in this hotel are no joke. We used backpacks for our trip so we managed just fine but I would not want to be carrying a large suitcase up those steps. So keep in mind if you are traveling with a large suitcase or have difficulty managing stairs you may want to consider somewhere else.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, clean, & super nice staff!”", "Author": "WhatsUpBuddy", "ReviewID": "UR117132991", "Content": "Let's start with location - it's in Rembrandt square, which is awesome. It's full of clubs, bars, restaurants, coffee shops, all the good stuff right outside! Me & my friend had a room in the back so there was no problem with noise, but also we came back late so none of that bothered us. There's no elevators so be prepared, but there's barely any elevators in the city so it's nothing new. The room is small but it's great for a cheap Amsterdam hotel. It was really clean, and there was a sink in the room. It's shared bathrooms but they're right outside your door & are also clean. I'm a germophobe & it was fine for me! Everyone at reception is sooo nice & will help you with anything you ask, like directions, room questions, etc. Bob was the best!! We came really early the first day & were probably annoying but he was so nice & recommended things to do while we waited. We always went to him with questions & he helped with everything. We loved Bob! haha So anyway, overall it's a clean hotel in a really good location with great staff! I would definitely stay here again!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“Excellent Location Great Hotel”", "Author": "adicollins456", "ReviewID": "UR116942070", "Content": "We have just got back from Amsterdam after staying in this hotel. The staff were extremely helpful and, after previous experience in cheap hotels in Amsterdam, it was a nice surprise that the hotel was very clean and well looked after. We were after a cheap hotel and opted for a shared bathroom, again after previous experiences we feared the worst, but with 2 clean and comfortable shower rooms with toilets on each floor literally just outside your room door it really wasn't an issue. As previous reviews have said the loud music from Rembrandt Square does go on until around 3am but this is due to the location and they do offer free ear plugs from reception! All in all a great base for an exploration of a colourful and interesting city, I'd be surprised if you could find a better hotel in the city which is this clean,cheap, friendly and accommodating.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Excellent for budget traveller!”", "Author": "Annika T", "ReviewID": "UR116626494", "Content": "We loved Rembrandt Square Hotel, very nicely furnished, very helpful lovely staff and clean modern rooms and excellent value! The breakfast was really good with good variety in the just a couple of doors down. The location is very central lose to train station and in a very lively square of Amsterdam with lots of bars clubs ect but the noise didn't bother us at all..it really isn't that bad and our faced onto the street! Definitely would recommend!", "Date": "August 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Netherlands", "Title": "“In the beating heart of the town.”", "Author": "johanvcr", "ReviewID": "UR116318417", "Content": "Location is absolutely top if you don't mind the noise of the city-life and the sweet smell of the coffeeshop next to the front entrance. Breakfast is late (starting 9 am) and you have to go to the neighbor. Didn't try that. Too late for me.... Rooms are basic but clean and some have shared bathroom. Only recommend this place to friends liking nightlife.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Good option for a single-night stay on a tight budget”", "Author": "evabxl", "ReviewID": "UR115916173", "Content": "Good option to help stretch a budget in super-expensive Ams hotel market. o Central location, but check warnings on noise (not that I personally suffered). o Spotlessly clean, basic room. o Only place I have ever been asked if I wanted towels. I asked why I was being asked, and was told some people bring their own. Really? o No bedside light, so bring a torch if that bothers you o Definitely not for people with mobility issues - steep stairs o Decent breakfast in coffee shop downstairs. o Recommended for a one-nighter if you plan to arrive say 23:30 and to leave 08:30.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London England", "Title": "“chic,cheap & cheerful stay, def wud go back!”", "Author": "Swanny86", "ReviewID": "UR115397781", "Content": "stayed @ rembrandt square for 2nights ,,, hotel is right in lively part of dam & only 15min walk from central station. plenty of shops, restaurants & casnios everywhere u walk. hotel is so worth the price for 1star accommodation, i was dreading shared facilities but these were cleaned everyday & had 2 showers on each floor. we stayed on the 5th floor long walk up as no lift but was better 2 b right at the top as u cud sleep better as music from the club next door was bangin but cud hardly hear it. hotel staff was so helpful, we got there too early so decided to leave our baggage & head out round town. breakfast was ok, basic food not full english breakfast but ok for price. def would recommend this hotel if u want somewhere located right in the city centre. take plenty of money as so expensive everywhere you go!", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“OK”", "Author": "Sic-transit", "ReviewID": "UR112859259", "Content": "Pros: well located, really nice staff, clean room, good security measures so felt safe, cheap. Cons: noisy (although this is to be expected due to location), drunks throwing up outside woke me middle of night, breakfast served in a downstairs bar so smells of alcohol", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Monterey, California", "Title": "“loud but worth the price”", "Author": "MissB23", "ReviewID": "UR111804679", "Content": "If you want to stay in the center of Amsterdam with easy access to metro for 60 euros a night , this is the place to be. It is in the entertainment district of amsterdam so it does get lour and louder as the night progresses but if it is too loud to sleep ,atleast the club is right downstairs if you feel like it. Its exactly what you need, a place to stow luggage and crash at night. Its not the biggest room but it is sufficient and for the price and location cant be beat. Dam ,musuem square and central station are all a tram ride away.The tram station is right at the door step of the hotel. What more can you ask for! The location is prime with a lot of food joints and european style out door cafes across the streets.Just dont try to get any food before 9 AM in the morning. Try it ,carry ear plugs and preferably have a few beers with dinner, no loud music will wake you up", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Exceptional 1star!!!”", "Author": "Lulubeer", "ReviewID": "UR109714906", "Content": "Have just returned home from a 2 night stay at the Rembrandt Square Hotel in Amsterdam with my boyfriend. Can not fault this hotel, infact, I can't praise it enough!!! Arrived at 12, our room wasn't yet ready which we weren't expecting as it is a 2pm check in. However they were more than happy to store our luggage for us and let us use the lounge area and had a cup of tea there also. We left the hotel and came back at 2, the room was ready, and our bags had been put in the room already. So the room was small, but wasn't expecting anything more. Was very clean, lovely simple decor, tea/coffee facilities, English tv channels, table and chairs, sink, mirrors, chest of drawers! Comfy beds! All staff were so helpful with anything we needed and very friendly. Shared facility bathroom very clean and rarely even noticed we were sharing it with another room. Room was hot which they were obviously aware of as they had provided a very good fan. Was quite loud at night due to clubs next door, but had booked it on the premise of it's excellent central location so didn't bother us! Would be hypocritical to want to stay so central and expect silence. BreakfAst was of a good standard. Helpful again on our check out day! Kept bags there til 6pm! Can't wait to visit Amsterdam nd most definitely will be staying again! Can't believe it's just 1 star...great job Rembrandt hotel :) x", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Seems Perfect...Until the Sun Goes Down”", "Author": "nicegirl512", "ReviewID": "UR109351929", "Content": "Hotels in Amsterdam are crazy expensive, so I was glad to find the Rembrandt Square Hotel at a great price and with good reviews. We paid about $120 for a double. Pros: -The hotel is cute and clean -Staff was friendly and helpful -Easy to reach from Centraal Station via the tram line (unless you get one of the old school #9 trams with the narrow door and steps into the tram) Neutral: I was under the impression the bathrooms were suite style, with two rooms connected to a bathroom. On the second floor, there were five rooms for two bathrooms. The toilet and shower are in the same room, so any use of the bathroom occupies all uses of it. We had no problems with this, but left at 7:30 am for a flight. Mornings could be touchy if all rooms are in double occupancy and 10 people are sharing 2 bathrooms. Con: -Steep stairs with no lift. This is typical of Amsterdam hotels and I was expecting it. I need a word stronger for con, so how about Nuclear Option Con: -The lovely square that your room overlooks turns into an all-night discotheque when the sun goes down. I am a city girl, live in the heart of Washington DC, and am well used to street noises. So I generally dismiss hotel complaints about street noise, assuming the reviewers are suburban wimps. You will dismiss complaints about noise at this hotel at your peril. When we checked in I was a little concerned about being too chilly at night as the windows are not sealed at all and air was blowing through the point where the two panes meet. The temperature turned out to be fine. What I didn't realize was that it would feel like my bed was dab smack in the middle of a club when I tried to go to sleep. Shouting, singing, glass breaking, and the pulsing beat of a European club might be fun memories if you intentionally put yourself in that situation. If it's in your bedroom, not so much. I am a heavy sleeper and was completely exhausted so I managed to fall asleep and stay asleep after about half an hour, but my travel companion didn't sleep at all. We stayed only one night and I don't think even I, the champion sleeper, could have handled another. I don't know if rooms that don't face the square are as loud, but certainly request one that does not look over Rembrandtplein.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Club Rembrandt Hotel”", "Author": "Panda_Fist", "ReviewID": "UR90958558", "Content": "First time in Amsterdam, not enough can be said about how beautiful this place is. Since it is 7:30 in the morning and I haven't slept a night in a couple of days I'll get right to the point. When we booked this place, we had read some reviews that there was a fair amount of noise. This is like saying there are a few canals here. This place is clean, feels secure, but I cannot believe they built this place on top of a techno dance party that goes on all night- every night. It is Tuesday evening/Wed morning and there are no signs of letting up (we are also on the third floor, the people on the second floor must be losing their $hit). There are things literally moving around the sink in the room from the vibrations. I wish it was possible to leave an audio recording on here- you seriously would not believe it. To preface all of this, I am 30 years old and am not afraid of a good time- but seriously I dropped a heavy dose of prescribed ambien after smoking some ridiculously good weed and still cannot make it to sleep. Either make your stay here a quick one or plan on spending the entire night at club insomnia. Also, don't bother buying weed at Smokey's that is connected with the hotel (by the way- this is where the hotel breakfast is) go down the street instead to Barney's. The hotel tries to herd people in there like crazy but it's terrible- just read the reviews. God help me they just put on some christmas techno.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“The Reception Staff truely make this a lovely place to stay!”", "Author": "LovetotravelJJ", "ReviewID": "UR88986801", "Content": "We arrived early in the morning and check-in is not until 2 but as our room was available so the receptionist (female) allowed us to go in immediately- Excellent! Stupidly we locked ourselves out of the room but nothing was too much trouble. We were always met with a smile and each reception staff memeber was more than willing to help us with ideas of what to do and where to go. The rooms are small but adequete and given its excellent central location we expected noise. The good thing is there are so many nice dutch beers that after a good amount we heard nothing!! Breakfast was lovely, with fruit and toasties though the manger was nice but maybe a little too attentive. The hotel are eager to please and they do! Even on our return one of the male receptionists helped us to loacte a taxxi back to the airport and was so nice. Wonderful people!", "Date": "December 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent place to stay”", "Author": "pooce666", "ReviewID": "UR82744482", "Content": "My fiance and I stayed here for 5 nights in sept 2010 and having read some of the reviews and looking at loads of other hotels, finally ended up booking this one. Most of the hotels in amsterdam have similar reviews, complaining of steep stairs and noise, and yes these are the only two things that are slightly detrimental to this one. The hotel itself has recently been redecorated, and our room was small but perfectly formed for all we needed. We were slightly concerned about the shared bathrooms, but there are 2 per floor servicing 5 rooms. Once again they were small, but there was a toilet, shower cubicle and sink, and they were regularly cleaned and everyone sharing them seems to be reasonabley considerate about leaving them tidy! The stairs are steep. You go up one flight and think, \"well these arent too bad\" but when your room is above the 2nd floor (we were on the 3rd) you start to curse after a day out and about. Rembrandt square is a great location, very busy, and lots to do, but this does mean it is quite noisey well on into the early morning(about4am it seemed to go quite) but if your there for the night life this is no problem, and if you while away your day in coffeeshops it shouldnt be an issue either! 10 minute walk from dam square/red light, and about 20 mins brisk walk to the train station. Oh and the breakfast was not bad either, tea, coffee orange juice toast, cheese, bread ham boiled eggs etc. So overall good hotel, good location, pretty good value for money and would have no qualms with staying there again.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Full marks for a cheap hotel....”", "Author": "Corinne075", "ReviewID": "UR81520192", "Content": "Booking a fairly cheap hotel on the internet is always a risk - especially when travelling with kids - I had hoped that I had NOT booked something in the heart of the Red Light District! Phew - lively square - but nothing too outre! Receptionist was lovely, and really welcoming, especially to the children. Ultra steep stairs (we were in a triple room on the 4th floor) tried not to think what would happen if there was a fire below! Yes beds narrow - but we pushed them altogether. Noisy - but not excessively - we were at the back of the hotel. Breakfast - intesting, being in the Bar of Smokys - one child asked if he could have Vodka and Redbull for breakfast! Very dark, perched on bar stools with Earth Wind and Fire playing away on a video screen. Agree with one of the reviewers - staff at breakfast not the friendliest. But for just over a 100 euro for three of us, and a great surreal experience of Amsterdam - superb!", "Date": "September 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Excellent location , narrow beds.”", "Author": "stiffsurgeon", "ReviewID": "UR60440894", "Content": "Rembrandt Square Hotel is at the heart of old town , near to many places in a walking distance. Rooms are small and beds are narrow. If you are fat , you would wake up a few times when you are turning your side to side. Hotel staff is friendly and rooms are clean. Bathroom and WC are out of rooms in each floor. If you are looking for more fresh city air in old town, Rembrandt Square Hotel is just for you. Breakfast is average. Price looks so good for the place and the quality.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not bad...not brilliant”", "Author": "bobdibest", "ReviewID": "UR56868260", "Content": "We booked this hotel last minute, and got a twin room for â‚¬70 per night, including breakfast. I was a little worried about shared bathrooms as I don't usually go for this, but the hotel wasn't fully booked and the bathrooms were incredibly clean and not used by anyone but us (that we saw). The room itself was small, but ok, with comfortable bed, working radiator, fan and LCD tv. Each room had a wash basin as well. In this respect the hotel is pretty good, however it is located in a square similar to Times Square NYC and Leicester Square London and the hotel is not double glazed. Therefore the noise at night is incredible. The nightclubs below the hotel and opposite are loud and go all night. Personally we were there to party, so I didn't mind, however be warned, these clubs don't close until 5 - 6 am and only then does the square become quiet. During the early hours it is alive with people screaming and shouting, music playing and general city centre noise. It is very difficult to block out. We were at the front of the hotel so it was pretty bad, I am not sure how the noise compares if you're at the back of the hotel, and therefore not directly facing the square. Difficult one to really review, however it was clean, breakfast was ok, the rooms were fine and service was friendly. Location could be ignored if you're in Dam to party, but its for teenagers, travellers and stag do's, less for families and couples etc. Oh and it was being renovated whilst were there, so may well be even nicer inside very soon.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good location at a great price!”", "Author": "whirldtour", "ReviewID": "UR45660502", "Content": "Good location, close to siteseeing activities, well connected to the transit system, close to top-rated clubs and restaurants.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Better than expected, but bring your earplugs !”", "Author": "Daveyboy03", "ReviewID": "UR35030929", "Content": "The rembrandt square hotel was better than expected but only just ! I was handed the 'short straw' & given a room two doors away & two floors up. The climb up the stairs was a steep climb & the carpet & walls were stained & grubby. However, my room was clean & freshly painted & the bathroom looked newly fitted & brand new ! The room was basic & the bed very comfortable. The rembrandt is a family run hotel with the rooms situated above & next to the noisy clubs below. I thankfully brought my earplugs & had a few drinks & slept through the music which continued till 4am. My major issue with this hotel was the manager & his staff at the breakfast room. The food was laid out on bar tables inside smokeys nightclub & was in no way plentiful. The manager noticed that i had gone up for 'seconds' & looked me in the eye before removing my first plate & unfinished drink ! This i found an insult !! On the 2nd morning the manager & his staff were watching & following my every move & this disgusted me. The manager obviously awakes in the morning with euro/pound/dollar signs in his eyes. I am glad mine was only a 2 day stay as i would have commented to the manager & spoke my mind in no uncertain terms !!! The location & price of the rembrandt square hotel were great but the managers style of business would irritate a saint ! And don't forget the earplugs !!!!", "Date": "July 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Terrible staff. Location is the only redeeming quality.”", "Author": "smkTraveler", "ReviewID": "UR28126281", "Content": "As with many others who have written reviews on this hotel, I chose it because it was a good price (60 Euro), and because I have stayed in Rembrandtplein before and know that it is a good location. After my experience, I think I paid too much. This is a no-frills hotel, which I do not mind, as I have stayed in many cheap hotels and hostels around Europe. No TV or Phone, only a sink in the room and a shared toilet and shower. Towels are a 5 Euro deposit, also not a big deal, but the man behind the desk was not friendly to deal with. The hotel staff was unorganized and impersonable. The man behind the desk was smoking in the adjacent room when we arrived, and the smoke filled not only the stairwell leading up from the street, but also the stairwells up to the rooms and even the hallways outside the rooms. It took him 15 minutes to find which two rooms to give us (changing the number several times on his scrap of paper where he was keeping track). When he finally picked two rooms, he talked to the cleaning person and one of them had still not yet been cleaned. So we had to wait and come back a couple hours later. The window in the room was nailed shut, so we could not open it for fresh air. To make matters worse, during the night the heater turned on and we could not turn it off. Either the dial was broken, or they control it down at the front desk. Thank goodness the sheets were at least clean or I would have checked out (from what I could see). Overall I would not recommend this hotel. I know from experience that there are other cheap hotels in Rembrandtplein, and I'd strongly suggest staying in any one of those instead.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "england", "Title": "“A Great Find”", "Author": "EnglandBarry", "ReviewID": "UR16267185", "Content": "When we decided to go to Amsterdam, we booked the flight and then found that the hotels where not that cheap and a lot of them where booked up. However, we found this one and where pleasantly surprised. The cost of around Â£80 per night might seem a lot, especially when you look at cities like Berlin but you'd pay around about the same price back home. This Hotel's Location is Excellent!! . Amsterdam is a dream to walk around and most areas are within 10 or 15 mines walk. The square has loads of bars/cafes and street entertainment. The directions where easy to follow, Trams 4 or 9 from Central Station. The hotel staffs where friendly and helpful, just remember to pack a towel or you could leave a deposit of 5euros for one. Basic, but clean and tidy. A great little find. As a footnote, if you want to get around and see Amsterdam, book a tour with Mikeâ€™s bike tours, excellent.", "Date": "May 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cornwall", "Title": "“Superb.....”", "Author": "trawlings", "ReviewID": "UR15953099", "Content": "Clean, Modern, simple, friendly and excellently located. The staff were great, we were a group of 25 and there was no problems whatsoever. It cost us about Â£37 for the nite including breakfast. Its a very simple hostel, the rooms are not massive but does that really matter??? its somewhere to sleep for very little money. Overall everything was perfect with the hotel for what we needed and i really was amazed with how clean it was.......even the sared showerrooms. Will be going back to Amsterdam in the next couple of months and will be staying here again.", "Date": "May 12, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Smelly and dingy”", "Author": "my_perspective", "ReviewID": "UR14944392", "Content": "Our room was incredibly smelly for the 3 nights we stayed at this hostel. It smelt like cabbage or vomit. The staff was very friendly, but they were not always available during breakfast hour as they were in the bar next door. The bar next door served continental breakfast in a sticky, dingy, dark bar but the food was satisfactory. My main concern for this place is the way they store the room keys!!! Each time you left the hostel, you would have to hand in your key. However, the keys are hung against a wall behind the counter, and since there isn't always someone at the counter, it would be very easy to steal a key (with the room number on it) and barge into other people's rooms.", "Date": "April 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "LIMASSOL", "Title": "“Did They Think We Are Animals?”", "Author": "SANGOI", "ReviewID": "UR10009615", "Content": "My experience with this hostel was terrible. We booked for 2 nights for 3 people. The rooms were too narrow and maximum 2 people could stay there. Even the bathrooms and toilets we too small.. You could't even move to change clothes At 3rd day we decided the 2 of us to stay 1 more night. We asked the \"friendly\" receptionist and the \"super manager\" for a room for 2. I told them we want a room for 2, with no other people stay with us. Ok they told us, 60 euro per night!!!!!!.....for that terrible room,.... I told him the turist office told us the double room is 77 per night for 2 people ( 38 euro per person ) \" no no this is not the turist office.. There, there are other prices \" We refused and were about to leave. The manager tell us then \" ok ok 50 euros for you.. Special price!!!!! \"... Since the availability of other hotels were limited in amsterdam due to conferences and other events we accepted the price as we wanted to stay 1 more day on amsterdam. The next morning we checked out from the room we stayed 3 people and the manager said.. By 12 the room will be ready for the 2 who want to stay .. \" ok we said\" We went to town and return at 16:00 .. We were suprised as the room wasn;t ready to check in.. We said doesn;t matter let's take our laggage to room and go another round to city.. We returned at 17:00 and room wasn;t ready as expected We were surprised as the room was not on the same building we stayed before. They took us to another \"hotel\" if can be named a hotel where\" 1. At the entrance there were pornographic magazines, 2.there were plates of food thrown down 3. Old bicycles in front of entrance First impression was terrible Once the door is opened what we see: Stairs that were almost 70 degrees,, i wasn;t carry my big bag just a small handbag and i could;t get up to the floor...i wonder if a person wanted to take the big luggage up to the first floor , how will manage this? Take it up with rope like in old ages? Then we entered the room.... The smell was terrible with cigaretes and food and was so disgusting... All this for 50 euro per night per person We went to reception and complain about this terrible services offered by that people... I wonder if they could stay in that dirty disgusting place Do they think we don;t have iq and we could stay in that disgusting place!!!! We take our money back and live same night We went to stuttgart and we found a room with 35 euro per night. Full breakfast. Reasonable and friendly people that know how to serve people from other countries Conclusion: never go to that hotel... So terrible service and management", "Date": "September 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "United States", "Title": "“Very friendly staff”", "Author": "BearsGoneFishing3", "ReviewID": "UR8076142", "Content": "The staff at the Rembrandt Square Hotel was very friendly and accommodating. The owner was even accommodating when we had to unexpectedly check out. The room was very small and simple...no telephone, but the bathrooms and rooms were very clean. The hotel is in an excellent location. It was close to all major attractions and lots of coffee shops.", "Date": "July 8, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "usa", "Title": "“nice place...”", "Author": "smiley21", "ReviewID": "UR7714219", "Content": "this hotel is a perfect place to stay, everything is a walking distance. the tram is jst across the hotel. if you need a bar or a place to smoke, you just go outside and you find everything in there. it's cheap & convenient.i'll definitely come back in this hotel.", "Date": "May 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“There is no place like home”", "Author": "LeoItaly", "ReviewID": "UR6776171", "Content": "The most important thnig in an hotel as a young man is to feel safe and welcome, Rembrandt square hotel is the place to be. The staff is very nice and make sure that you have a good time and telling you a bout the attractions. The owner is really nice and keep a good relationship with all the guests. It is locked at night and quite and knowing that not eveyone came to amsterdam just for the coffe shops, RSH has a \"no smoking\" rule.", "Date": "February 10, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Gosport, UK", "Title": "“Excellent”", "Author": "A TripAdvisor Member", "ReviewID": "UR4028188", "Content": "Very nice hotel located near to everything! Excellent bars, coffeeshops and restaurants nearby and its easily within walking distance of all the main areas of the city. Despite being above a bar the hotel was very quiet at night, although our room was at the back on the fifth floor. The room was basic but it was very, very clean as were the bathrooms. The reception staff were friendly and helpful and free breakfast was provided at club smokey below. All in all I would fully reccommend the hotel to anyone who wants cheap but nice accomodation in the centre of Amsterdam.", "Date": "October 17, 2005"}], "HotelInfo": {"Name": "Rembrandt Square Hotel", "HotelURL": "/ShowUserReviews-g188590-d577357-Reviews-Rembrandt_Square_Hotel-Amsterdam_Noord_Holland.html", "Price": "$100 - $174*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Rembrandtplein 24</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1017 cv</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "577357", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7d/d1/7dd1be7bc68d6a5f34eceba9d6c007846large.jpg"}}