{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Queensland, Australia", "Title": "“Would DEFINITELY RECOMMEND !!!!”", "Author": "Jordy90", "ReviewID": "UR120058864", "Content": "I found Pickwick Hall to be fantastic for the price and location. Not the best place for you to stay if your a light sleeper, but honestly where in London is ??? Location is perfect literally 300m away from a Holborn tube stop and about a kilometre away from Kings Cross Station. Perfect place for a first time London visitor as it is only a short walk to Leicester Square, Trafalgur Square and Covent Garden. FREE WIFI THROUGHOUT THE WHOLE BUILDING !!! We had a private room and other than sharing a bathroom it was like having a hotel room (and honestly was alot better than some we stayed in along the way). Nothing special to look at but it was a bed and had a fridge in the room, team this with the free wi - fi, perfect location and helpful owner this was a success (as this was my first time staying in a hostel).", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellently located with good service”", "Author": "Edward H", "ReviewID": "UR119641867", "Content": "We stayed at Pickwick Hall for eight days at the start of our trip and two at the end. The location is first rate. Right in the heart of London with the British Museum a few minutes walk away, together with Oxford Street. Additionally two tubes stations (Russell Square and Holborn Station are 7-10 minutes walk away, also the number 91 bus goes directly to and from Trafalgar Square to Russel in about 15 minutes. The owner Patrick was very accomodating, friendly and helpful and was at breakfast every morning preparing brewed coffee and setting up. Also free cereal and milk are available in the shared kitchen 24 hours a day. The rooms are in need of a bit of attention but are sufficient if your needs are not of a high standard. There is also a microwave and barfridge in the private rooms, which help keep the costs of meals down. We would stay here if we came to London again.", "Date": "October 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Victoria, Canada", "Title": "“Great Location near British Museum”", "Author": "Margot81", "ReviewID": "UR118233285", "Content": "We stay at Pickwick Hall everytime we visit London. It is the best value in town in a great location that allows you to see the best of London - either walking or using the handy tube stations nearby. The British Museum is only a 2 minute walk away! Having access to a kitchen and a fridge saved us lots of money on food...but be prepared for the low standards in this hostel - it is badly in need of renovation, better lighting and cleaning. We stayed in a family room with 4 beds looking out at the tangled garden in the back. Mattresses were good but it had broken furniture and an unspeakably dirty carpet. The shared bathrooms are moldy but basically clean. Pickwell Hall is the place for you if you are looking for cheap accomodations to lay your head if you're spending most of your time out and about. The Ritz it ain't!", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bergen, Norway", "Title": "“Alright London-hostel”", "Author": "theawesometraveller", "ReviewID": "UR116300297", "Content": "The hostel was alright for a London hostel. I did mind that I couldn´t close the window in the room. Luckily we were there during the summer. And the shower had mould. Still it was otherwise clean and quiet during our stay. The location was great. We could walk to both Piccadilly and Camden from our hostel. Just be aware that this is a hostel, so I wouldn´t expect a 4-star hotel.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane", "Title": "“Bargin basement convenience with excellent staff”", "Author": "RhysBNE", "ReviewID": "UR115069773", "Content": "I love coming back to Pickwick time and time again. It is the reviews of people who obviously expect champagne on a beer budget that really give this place a worse name than it deserves. Pickwick Hall is located close to everything! Theatre, the tube (Holborn, Russell Square, King's Cross), Covent Garden, even walking to the Big Ben doesnt take all that long from here! So why stay here? You want something as cheap as money can buy, in the most central spot..... thats it! Are there cracks in the walls? yes Is there some mold if you look hard enough? yes Is the place in need of a renovation? probably Does any of this matter? Hell no!! Seriously people, if the free food is left out, go spend 3 pounds on breakfast from Pret. If a bathroom appears dirty, there are 4 others you could try. I'm yet to find anywhere else in London, this close to everything, this cheap, with free breakfast, some of the most comfortable beds around, free wifi, free printing, cheap laundry with staff who really do treat you far better than expected. One the same dates my parents paid 7 times this much for a hotel that didnt even have a fridge or microwave in the room, Pickwick does! I even got a whole dorm room all to myself on the top level for 24 pounds!! I would certainly recommend staying at Pickwick unless you're the kind of person highly picky about accommodation. And at the end of the day, you dont come to London to sit in your room.......", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“the only thing good about this place is the location”", "Author": "elala5", "ReviewID": "UR114835374", "Content": "No doubt the location is excellent. It's right on the Piccadilly and Central lines on the Tube, and right next to the British Museum. However once you walk inside the place, you realize how run down it is. I wasn't under any impression that this would be a nice place. For how much it costs, I know I shouldn't expect much. BUT i did not it was going to be THAT BAD. I've stayed in old dorms and they are 25x nicer. The bathrooms are gross and moldy. This place needs some serious renovation. On another good note besides the location, the staff was helpful.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Major Disappointment”", "Author": "Lostis", "ReviewID": "UR102242824", "Content": "We were led to believe that the Pickwick was a clean hotel. What we encountered was a filthy hostel. There was mold in the walls. Mildew was growing everywhere. The sink in the communal kitchen was covered in mildew or mold--completely black. Mildew covered the walls around the sink and food preparation areas. Food, bread and jam were left open all day and was moldy. Dryed human hair was stuck to the carpet, which was torn. One of the bathrooms did not work at all. Cold showers. The \"high speed internet\" was slow and did not work all of the time. Stay away from this place!", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kaohsiung, Taiwan", "Title": "“Great location and helpful staff”", "Author": "KaoChingLin", "ReviewID": "UR93739640", "Content": "I had stayed in Pickwick Hall for three time when I had trips in London. The location is around 15 mins walking distance from Euston station, 10 mins walking distance to Russel Square station, and 3 mins walking distance to British museum. therefore it's easy and fast to reach major attractions in London. The Owner, Patrick, is friendly and helpful to answer my queries. I met some troubles on internet connecting in lobby with my laptop. His son is trying to solving the problem for one hour. the room size is adequate and equipped with washer, dryer, fridge and microwave oven. Breakfast is simple but sufficient and kitchen is free to prepare the meals.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "toronto", "Title": "“Our room was so unsanitary it gave me nightmares”", "Author": "isabox", "ReviewID": "UR67427232", "Content": "Unfortunately this hostel was the worst of our whole trip, but mostly because it was disgustingly dirty. The whole building itself is old, but the interiors were badly run-down. We had booked a double, but were given a room for four. Of the four beds, all of the bed covers had large blood stains and other stains. Even the walls had brown stains on them. The bathroom was just as terrible. It smelled horrible (from the damp and probably because our room was in the basement), and looked so unclean I couldn't bear to use the shower. Our disappointing breakfast was a choice of three types of bagged sliced bread (like Wonderbread) and jam/butter or cereal, coffee and tea, nothing else. The staff was eating fruit, but there was no sign that fruit was available for anyone else. The woman on staff was a bit curt, but the older gentleman was really very nice and very helpful. He told us where there were good spots to eat, how we could save money taking the tube to St. Pancras rather than the Gatwick Express to get to the airport, directions to the museum, and let us keep our bags at the hostel after we had checked out. The wifi is free, but was acting a bit wonky when we were using it.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“There are better options in London..”", "Author": "honeydoo08", "ReviewID": "UR65789492", "Content": "The hostel smelled of bad Indian food (or something). Moldy bathrooms and stained bedding, but I could tell it was cleaned. Free internet was nice and breakfast minimal. Location good, but there are far better places to stay in London for the same price.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Sleeping in a tent for my vacation might of been better.”", "Author": "paradigm6909", "ReviewID": "UR59979388", "Content": "Don't get me wrong, the place is in awesome location, but if you can find a hotel or hostel close by, go with that. There is a reason why this place is cheap people. The showers didn't get hot, and the toilets worked half the time. The place was dirty too, stains all over the carpet and you could tell bleach has not seen the bathrooms in years. I found Patrick, the owner, to be rude and not very accomidating. Continental breakfast consisted of making your own toast and a glass of milk, if there is even any left in the fridge. If you like camping, this place would be ideal...", "Date": "March 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "ontario", "Title": "“Nice hostel, well worth the money”", "Author": "magicandrea18", "ReviewID": "UR45620693", "Content": "Lovely hostel. Free breakfast was just what was needed to get a good start on the day. Rooms were just right. A mirror with sink, desk, chest of drawers, fridge and microwave were in the room as well as two towels per person and a bar of soap. The hostel had free internet access and a comfortable environment. The washrooms were just fine and the showers were clean and working properly. The walls are very thin though and I did not sleep the best as the street noise was quite loud. Overall, it was a nice hostel and a great place to stay if on budget!", "Date": "October 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Pietarsaari, Finland", "Title": "“Nice location though the hostel is a bit rundown”", "Author": "Jeppis", "ReviewID": "UR31655835", "Content": "We spent 7 nights with my husband and his children at the Pickwick. Arriving in the middle of the night wasn't a problem as there was a night porter to escort us to our rooms. We had booked two rooms, we were staying on the top floor with shared facilities which was ok for us. The rooms were not cleaned daily, we had to ask them to hoover our carpet, the towels weren't changed during our stay. The beds were comfy, we had one room facing the back and another facing the front of the building. The location of the hostel is the best, near to Oxford Street, Covent Garden or any of the city centre sights. The location is very quiet in the evenings, safe to walk in the streets at night, a lot of pubs and restaurants in the area, close to two tube stations, one bus stop just in front of the hostel. Breakfast is ok, just toasts, coffee, tea, jam, butter, cereals, milk. But there is a micro and a fridge in the room, and you can make your lunch or dinner in the breakfast rooms kitchen. Unfortunately there isn't a TV in the rooms, it would have been nice to watch the news in the mornings. The two computers in the lounge were always occupied by two American ladies in the mornings or in the evenings, so impossible to use them.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Alkmaar", "Title": "“perfect for doing London on a budget”", "Author": "bobbiebobs", "ReviewID": "UR24976865", "Content": "Wanted a hostel in the vicinity of the west-end, so I could walk back in the evenings after seeing a musical. Also wanted to be able to cook my own meals, so I wouldn't have to dine alone in a restaurant The Pickwick Hall accommodated me in both. Don't go there if you're really all for cleanliness. Because it's tidy and clean for the eye. But don't look up to close. The showers and toilets were clean though. In the central living room there are two computers which are online the whole day. As the permanent residents all have laptops, the visiting tourist can use these computer without having to queue. I liked my stay there. The living in students are a group within a group. And as it is with groups sometimes they open up and sometimes they don't. No big deal.", "Date": "February 22, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Union City", "Title": "“Great staff and great place to stay”", "Author": "crazybear7", "ReviewID": "UR23289045", "Content": "Location: The hotel is about 10min away from the Holborn tube station. Nice little park, good clean surroundings. Hotel: The staff was very helpful and friendly. Free wifi, and the beds were average. Shower was small but it's standard in european countries. Free breakfast of toast or cereal", "Date": "January 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Alicante", "Title": "“Great location but very noisy”", "Author": "Zuzzy", "ReviewID": "UR22670773", "Content": "The location was excellent, the best I've ever experienced for such a low price. Staff were very nice. However, my three nights at Pickwick Hall were somewhat nightmareish... It has to be said that I was in London to take a course and had to get up really early. Getting a good night's sleep was essential - and I certainly did not succeed at this hostel!!! Street noise was terrible, even with heavy-duty earplugs. The room was cold and the mattress uncomfortable. I wasn't mad about the showers and one of the toilets didn't flush properly... I would only return to Pickwick Hall if I knew I was spending most of the night out partying.", "Date": "December 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Great Place to get over jet lag”", "Author": "dantri", "ReviewID": "UR17234903", "Content": "Pickwick Hall was our first stop on our big Euro trip. We arrived after being awake for 30hours and found it a fantastic place to chill out and catch up on some much needed rest. Definitely not a party place, the plumbing is terrible , bathrooms need a bit more of a clean and place is very dated BUT the linen is clean, the bed is comfy, a short walk to the Tube and Sainsbury's and the common areas were a great place to meet and chat with other travellers. We'd recommend it for somewhere quiet to rest up for a few days.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“Loved it!”", "Author": "jackiebleu", "ReviewID": "UR15483225", "Content": "My boyfriend and I took our first European trip together and stayed in Pickwick Hall in London for a week. I had studied previously in the Bloomsbury area and wanted to book something in that vicinity since I knew where the Tube stops, grocery stores, etc. were. We had a very nice room with a double bed and our own bathroom, so that was fantastic! We also had a fridge and microwave in our room so we did some grocery shopping and made it our little home for the week. The staff, especially Patrick was charming, and he was downstairs every morning with the complimentary breakfast asking if we'd like some tea. I found the setting to be very nice, quiet, pleasant, and safe. We've already recommended it to some friends and would definitely stay there in the future.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“a great budget option for London”", "Author": "rojokaty", "ReviewID": "UR8875184", "Content": "I stayed at Pickwick Hall three times in as many months and became rather attached to this charming hostel. The Bloomsbury location is fantastic - safe and quiet, and a very short walk to the British Museum. Patrick was a somewhat reserved but delightful and helpful host. The rooms were very spacious and clean, if a little shabby, and one of the bathrooms had a vague smell of mould but this was a small quibble. The free internet (two terminals) was a bonus, and there is a washing machine in the basement. Breakfast was basic but good, and the kitchen very clean, with the welcome inclusion of a dishwasher. Excellent value for money by London standards. I would definitely return to Pickwick Hall.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "2", "Location": "2"}, "AuthorLocation": "england", "Title": "“Worst Hotel Ever...”", "Author": "ananasEngland", "ReviewID": "UR7712934", "Content": "no clean sheets, no clean pots, unpleasant staff AND customers, poor breakfast and suspicious things on the floor, hair and socks!!! in the shower but useless microwave and fridge in the room. Please, for your sake, avoid this horrible hostel. Anais and ingrid from france", "Date": "May 29, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Maritimer abroad", "Title": "“Awful hostel”", "Author": "disenchanted_bride", "ReviewID": "UR6100965", "Content": "My husband and I stayed here on the first night of our honeymoon and it was terrible. It was very dirty and they messed up our reservation. The girl running the place didn't speak English very well. I have stayed in other hostels in London over the years and this was, by far, the worst. Only good point was location.", "Date": "November 10, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, South Australia", "Title": "“Quiet and central”", "Author": "Statsman10A", "ReviewID": "UR5792224", "Content": "My partner and I stayed for 1 night and we were pleasantly surprised. The hostel is friendly, very central and extremely quiet considering it is in the middle of London. They supply an ample breakfast, and the room was clean and comfortable. I would not hesitate in returning.", "Date": "September 12, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Worth picking”", "Author": "CanadianPeter", "ReviewID": "UR5592875", "Content": "I stayed at Pickwick at the end of July in 2006. It was an excellent price for a London hostel. Overall I found it to be clean (including he towel and sheet provided) and the staff person to be nice. It wasn't fancy, but that's not what you get from hostels, is it? There was free internet to be had and the breakfast was basic (eg cerial, toast, coffee etc.) . The location was great. Literally a 5 minute walk from the British musem. Not far from SoHo if you're looking to go out for the evening, you're in a good spot. My room had a mini-fridge, and a microwave. The only drawback I could see is that there wasn't any air con (no surprise) so I could see the place getting hot. Hope this helps.", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Manitoba, Canada", "Title": "“More than a hostel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4084554", "Content": "Spent four nights at the Pickwick Hall in Bloomsbury in October. It was our first hostel experience (we're a middle aged Canadian couple) and it was delightful. So quiet and welcoming. Patrick and Staff could not have been more helpful with directions and suggestions. The room in the basement was large and airy..came complete with desk, large closet, microwave and fridge and hair dryer..very clean and comfortable beds. The free internet in the TV lounge was a great surprise and we used it daily. Lots of travel info available in the lobby...also access to laundry & telephones. The price was 49Â£ per night for a double ensuite and included a wee continental breakfast. Within walking distance to Sir John Sloane's & British Museums. Holborn tube Stn. is a five minute walk and is where at least two London Walks originate. The area is very safe with several lovely green spaces nearby. We would stay again.. Sharon & Carl Canada", "Date": "November 3, 2005"}], "HotelInfo": {"Name": "Pickwick Hall", "HotelURL": "/ShowUserReviews-g186338-d577550-Reviews-Pickwick_Hall-London_England.html", "Price": "0", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">7, Bedford Place</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">WC1B 5JE</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "577550", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/1d/76/pickwick-hall-thumbnail.jpg"}}