{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "istanbul", "Title": "“there are better choices in town...”", "Author": "Kemalk_52", "ReviewID": "UR128156536", "Content": "rooms are small...not enough space for two adults.. staff no interest to do or serve...just doing the essentials.. location is noisy,but close to Sultanahmet Square rooms could be better attended...", "Date": "April 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Monte-Carlo, Monaco", "Title": "“Not a four stars hotel”", "Author": "Ma E", "ReviewID": "UR128054942", "Content": "I have stayed in this hotel for 4 nights for easter weekend. We were two adults and when we checked in the room was really small and we had to wait the next day to change. On the top of that the service is really bad. The rooms are not clean. The breakfast is discusting. We had breakfast only one time and then had breakfast outside the hotel. I asked the front desk to cancel a booking table for a dinner and they refused to do it. I have been asked to contact them myself. The hotel do deserves a three stars and not four. The reason that the hotel is having 4 stars is only because they propose an outdoor swimming pool and and indoor swimming both very small. We are planning go go bck to Istanbul but this time in a al four stars hotel and not thid one.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Location, Amazing Views from Rooftop Pool”", "Author": "WestCoastGal55", "ReviewID": "UR126843382", "Content": "We stayed here and found it is a great location and has beautiful views form the roof top pool. Basic amenities available and clean. Breakfast was basic as was the bar menu. I had a lovely massage in the spa.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Less than moderate”", "Author": "Alymoniem", "ReviewID": "UR125972597", "Content": "Not a good value of money, staff are not that helpfull. the only advantage is its location (near to tram)", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Helpful staff”", "Author": "Marta T", "ReviewID": "UR120899815", "Content": "We chose the hotel for its location close to the historic monuments. The rooms were clean but rather small. We couldn't use the pool or bar on the roof since it was all closed in october, but the view was still excellent. Lots of restaurants and shops in the neighbourhood. I forgot my mobile phone in my room, but it was sent back to me by a helpful public relations manager.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Geelong, Australia", "Title": "“Would not stay again”", "Author": "reub23", "ReviewID": "UR120714138", "Content": "I stayed here two nights as part of a tour. It didn't help that the road out front was being ripped up and I had to manouvre my luggage down the street, as the taxi couldn't get any closer. The reception staff were cold and uninterested. Not very helpful at all. The room was like a cell, with one tiny window looking out over a roof. It was very claustrophobic. The location for the tourist sites is good, but there are many other better choices than this. I would not stay again.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“good location near Topkapi etc, average hotel”", "Author": "evz32", "ReviewID": "UR120658409", "Content": "I have chosen this hotel for it's location and wellness options. Around 5-10min walking to Topkapi, 10-15min to Aya Sophia and the blue mosque. Also close to tram. Small rooms with a wardrobe for your luggage. Small room to little hall, no outside view. Nicely decorated room, clean. Bath room however not clean, benath the window next to the shower multiple parts of glas. Shower couldnÂ´t close, one door was missing, another was to small, no curtain avaliable. When showering you got a free pool next to the shower. Room heating very enthousiastic, 25 degrees plus in the room, no adjustment possible,no possoibility to open room to outside. Wellness for extra fee. Pool for free, outside pool closed due to season, but inside pool was not heated, think it was 25 or less degrees. Sauna for 5 euro, turkish bath iout of service. Breakfast included, choice of al kinds of bread, eggs, jam, choc butter, yoghurt, muesli and fruit, well enough. Hotel service gives option to get transfer to 'asian' airport for 75 euro, if you book an airport service elsewhere you pay 10 euro pp.Be aware! Would come again when searching an not too expensive hotel for city tripping.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A Smelly Place”", "Author": "AMW13", "ReviewID": "UR120194860", "Content": "We had to move to this terrible hotel as part of our tour through Age Turizm, 2 days before and 1 day after. I had questioned the above company about this choice as I had already read bad reviews but to no avail. The four other people on the tour with us were not happy either. If you are on a tour wholesaled by this company refuse this hotel!!!", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Getxo, EUSKADI", "Title": "“Meters away from Old Istanbul”", "Author": "Eusko", "ReviewID": "UR119619512", "Content": "If you want a pleasant hotel near all the Istanbul atractions this is your best bet, meters away from Topkapi and very close to light metro and ferries the hotel is nice it has two small swiming pools good to refresh yourself and although they use to be crowded they are acceptable and the only oportunity of this kind arround, the hotel is well maintanined and if what you want is to be near alod Istanbul this hotel is great.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Stay at you own risk”", "Author": "Crocbit", "ReviewID": "UR119208819", "Content": "View from room is a construction site, wifi barely works in lobby, airconditioing was p,problem for us and others staying, complaints fell on deaf ears. Location close to sulfa Ahmet but that is all. Meals were buffet basic and erratic quality. Tour group stop only. 2 star only", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Gympie", "Title": "“Not Recommended”", "Author": "RayGympie", "ReviewID": "UR118431379", "Content": "The rooms displayed on the hotel's website are NOT truly representative of what you are likely be staying in. Because we'd booked through a tour agency, we stayed at this hotel twice. At the beginning and end of the tour. Both times the airconditioning was not working although we had a slightly better and bigger room on the second occasion. The first room we stayed in was ridiculously small. I'm sure there are better alternatives in Istanbul than this hotel. There are a number of smaller boutique hotels in the same area for much less money which would be well worth checking out. We would not stay at this hotel again.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Service": "2"}, "AuthorLocation": "puduhepat", "Title": "“l dont recemend this hotel.”", "Author": "puduhepat", "ReviewID": "UR117927758", "Content": "they give us room it is beutufil .restaurant. it was expensive.for one night it is nice place.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "CT", "Title": "“Good location and value”", "Author": "Tinus", "ReviewID": "UR117231544", "Content": "We stayed with our family including three kids during our five-day trip to Istanbul. The hotel is in a very convenient location, close to the tram and walking distance to the major sites in the Old City. Rooms very a bit small and air conditioning was not working well in one of the rooms. Rooms were very clean. Breakfast was good. Kids love the fact that they could jump in the rooftop pool after day of sightseeing. Pool was small but the view from the roof top over the Bosporus was amazing.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Coventry, UK", "Title": "“A cracking hotel!”", "Author": "taffma2", "ReviewID": "UR117179254", "Content": "An all round great hotel. Right in the center of a frantically busy city center, but still manages to be quiet, and peaceful. The rooms are spacious, the shower is very powerful and the tap water stinging hot all the time. The pool on the roof is small, but the view from the roof is spectacular in all directions, over the city and out across the sea. All the main attractions are easy to reach by foot.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Service": "2"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Water held prisoner”", "Author": "bakerswoodfox", "ReviewID": "UR116793469", "Content": "I stayed at this hotel with a group travel of ladies from the area I am currently living. The hotel was booked through Thomas Cook. We were dropped off down the street from the hotel and had to wander through the very torn up streets to eventually get to the hotel. There was a store across the street so several of us went and purchased bottled water to have in the rooms since it isn't safe to drink the water in Turkey. Upon entering the hotel the check in desk staff began telling us to get rid of the water or else surrender it to them behind the counter and pointed to a sign by the check in desk stating that outside water wasn't permitted in the hotel because it is sold in the mini bar. They would give us one of our bottles of water a day to take out with us when we stopped by the desk. The staff was rude and very unapologetic! The room itself was ok at best! At one point I went down to the front desk to ask for directions to a shop I wanted to visit and the guy rolled his eyes when I asked if he had a map that he could use to point out to me where it was. The only good point I can tell you about this hotel is that the breakfast staff was wonderful, but not wonderful enough for me to consider staying here again!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Avoid. Lots of alternatives around.”", "Author": "Mario_MZG", "ReviewID": "UR116183059", "Content": "We booked 5 nights in Orka Royal for the end of July 2011. It was our 3rd visit to Istanbul and we were celebrating our wedding anniversary. The reservation was made 6 weeks in advance and prepaid by our Agency (we carried a voucher). Upon arriving at the hotel, on 27th July, we were given the keycard and guided to room #128. In dismay, we saw that it was an *interior* room, the only available window was a 50x50 cm glass opening to the corridor (which, of course, had to be permanently shut with curtains). Besides, the floor space was so small that even our 60-cm luggage had to be opened on the bed and then closed and kept against the wall. The WC was so tiny that if one person was inside it was phisically impossible for the other to get in. Of course, we immediately went to the reception and asked for a change. The taciturn (but kind) receptionist told us that they were booked up for the day but he could arrange for a room change next day. Having been around the world for 40 years and experienced hundreds of hotels (good and bad) this was undoubtly the only time that this had happened to us. How is it possible that the hotel management receives a 5-night firm reservation with 6 weeks anticipation, and assigns the guest to one of their worst rooms ? Are they expecting the guest to endure the inferior conditions for the whole stay, while they keep the best rooms for the latest newcomers ? Unbelievable !!! With no other choice (it was prepaid), we had to agree. We stayed one night in the tiny, interior room #128, with noisy AC and an even noisier engine clanking all through the night (elevator engines ? main AC engines ?). The next morning we left all our things packed inside room #128 and went to discover the city. When we returned at 5pm our things were in the new room, #512. Needless to say, our clothes, pressed in our small luggage for 2 whole days, acquired permanent creases that lasted for the whole stay. Our new room was just OK. To our standards and experience, the room and the rest of the hotel are more to a 3- (or 2-) star classification than a 4-star. Nevertheless, we now had enough floor space, a WC with a tub (and even a working jacuzzi), and addequate conditions to stay. The pipe smell that many guests have referred here was also present (only late in the night, when nobody was flushing). This must come from deep down below the building and is possibly without remedy. Covering all the drains *and* the grille in the WC floor, somehow minimized the problem. Be advised: the room that is shown in the main photo of TripAdvisor is what they call the \"Royal Suite\", priced at 600 euro per day Now, about the breakfast quality. To say the least, it is erratic. Most probably, there is someone in the kitchen stuffing his/her pockets. The \"orange juice\" is artificial, as previously stated by others. But throughout our 5-day stay it went worse every day. Starting with a reasonable taste and concentration on the first day, it ended as an orangish water on our last day. Surely someone is using the same jug of concentrate for the whole week, adding water as needed. The publicized \"turkish specialties\" range from a full basin with boiled spinach to a \"soup\" of milk and scrambled eggs. Green olives (at breakfast !) and hard-boiled eggs are also present. The cakes are dry and uninspired. To make a long story short: the Orka Royal is an hotel in a very good place (near to lots of touristic places and to the main transportation lines, and with dozens of nice restaurants nearby) with nice art-deco fittings and reasonable amenities. But it is literally murdered by incompetent and dishonest management. With lots and lots of alternatives around (you get 10-12 hotels in the same street) you don't need to choose this one.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“Fairly basic, good location”", "Author": "Scintilla85", "ReviewID": "UR116063561", "Content": "We arrived in the hotel and the staff quickly led us off to our room. IMHO, they could've been warmer and more welcoming, considering there were not much people around then and there had seen to be an abundance of them behind the front desk. Anyway, the room was pretty basic and quite tight but it was clean and cozy enough. The beds were comfortable and the bathroom had everything I needed despite the size. It also helped that there was free WIFI in the hotel. In terms of the breakfast, it wasn't the grandest spread but it had a fairly good selection of fruits, breads etc. What I liked most about the hotel was the location. Easy access to the sights in Sultanahmet like the Ayasofya, Blue Mosque etc. and there are a lot of restaurants and shops around. I would probably look into staying at another hotel if I were to go back to Istanbul but I'd consider staying here again if need be.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Caterham, United Kingdom", "Title": "“Very comfortable hotel in a very central location”", "Author": "TravellerGillian", "ReviewID": "UR115568826", "Content": "Stayed at this hotel in 2010 and 2011. The hotel is ideally placed to explore the old town, close to Topkapi Palace and the Archeological Museum. Also very close to a tram stop, short walk to railway station and to Eminonou. Unfortunately the street was being dug up this year but this did not really inconvenience me too much. It is also within close proximity to lots of good restaurants. My only criticism would be the breakfast room, it is situated on the lower ground floor with no natural light - but hey, I was only there for breakfast and the selection of food was good.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Fremantle, Australia", "Title": "“Good location for exploring Istanbul”", "Author": "AussieSue_11", "ReviewID": "UR115377737", "Content": "The hotel was adequate without being special in any way other than the wonderful location. And as we were in Istanbul for the sights not the hotel this was quite acceptable! The room was small to average in size but clean and povided free wi-fi. The beds were hard and we discovered this was a common issue throughout all hotels we stayed at in Istanbul. The rooftop swimming pool is tiny but still popular with guests and the views from this spot are wonderful.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Very good!”", "Author": "ms_travel_ms", "ReviewID": "UR115202632", "Content": "This hotel was in a very good location, only minutes from the main train station and very close to all the famous monuments. For the most part the reception was helpful, except they seemed to have a tendency to always serve men first. The breakfast was extensive and full of turkish cuisine. Housekeeping was clean and the hotel had a fitness centre and pool. Overall it was a very good hotel! Only downside was the first night we ordered some drinks at the hotel bar and it took almost 30 minutes to get them! and they were very overpriced- but there are hundreds of other restaurants around to get drinks and food", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New Zealand", "Title": "“A mixed blessing”", "Author": "JessieK", "ReviewID": "UR114948393", "Content": "This hotel is situated near the main train station and close to local tramway transport. The rooms are a good size and were serviced daily. However the air conditioning was useless. It was impossible to lower the room temperature with it so we resorted to opening the window and door to create a draught. The roof top swimmimg pool is the smallest ever and not very attractive.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Armidale, Australia", "Title": "“Well positioned but ordinary accommodation”", "Author": "Wanderer2350", "ReviewID": "UR114722786", "Content": "The hotel is in a great spot for exploring all the sights, Grand Bazaar, Spice Bazaar, Eminonu and Sultanahmet. It's also very close to the tram line. The rooms are not large but very clean and comfortable. There are great views of the Bosphorus from the rooftop pool and bar. The wi-fi was free and worked really well in the room. Overall however the hotel lacks charm and some of the reception staff are quite disinterested. The buffet breakfast was uninspired and entirely lacking in variety. There are plenty of good cheap restaurants in the area for lunch and dinner.", "Date": "June 24, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Wakefield", "Title": "“Brilliant location for all the major sights”", "Author": "WakefieldJohn", "ReviewID": "UR113121690", "Content": "Good clean accommodation. We had a triple room with breakfast. Room and breakfast both fine. Wonderful views from the rooftop bar. Would definitely go again.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Cyberjaya, Malaysia", "Title": "“we really loved it”", "Author": "parsa80", "ReviewID": "UR111539447", "Content": "it was my second stay in orsep royal hotel and i really love to go there every year, not only because of hotel.. maybe because i have many sweet memories there, hotel is just nice and clean with friendly staff and the location is great by walking distance to many attraction in heart of istanbul", "Date": "June 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Happy to leave.”", "Author": "Drusual", "ReviewID": "UR110687556", "Content": "Broken air-conditioning, loud carpark as view from window, and only twin bed option! The whole place smelt of cigarette smoke. Staff were 'adequate' but not at all like that other hotels we stayed in.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "perth", "Title": "“A gem in the old city”", "Author": "dee4bakslash", "ReviewID": "UR109073916", "Content": "Only thing I can fault the Orka on is the twin room's design, slightly small (not enough room for two suitcases).Bathroom had a spa bath. The staff,food & service was exceptional. Hotel is in old city and walking distance to all tourist sites. Grand bazzar 20mins walk or take the tram (just near hotel). Resturaunts shops all nearby. Will be back end of June for a further 5 days.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York UK", "Title": "“perfect location!”", "Author": "pear17", "ReviewID": "UR108790286", "Content": "Stayed here for four nights. Room very comfortable. Warm and clean. Very nice jacuzzi bath with wonderfully hot, fast running water. Good supply of toiletries. Comfortable beds. Toilet smell a little off putting. The only thing I would say is that it would have been good to have a tea/coffee tray. Nevertheless, very good breakfasts with lots of choice. Friendly staff. Sauna and pool facilities looked good (shame I forgot to take my swimsuit). The hotel was located close to good restaurants and shops as well as tram platform.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Prestonpans, United Kingdom", "Title": "“A good hotel, centrally located”", "Author": "MachairOrchid", "ReviewID": "UR101335897", "Content": "I stayed in the Orka Royal Hotel for 5 nights in December. The service was good, friendly, and helpful. The room was fairly small, but clean. The bathroom was good, but there must have been a problem with the sewage system as there was a horrible smell in the room. It took us a while to determine where the smell came from - it was the drain in the bathroom floor. We immediately kept the bathroom door completely closed and the room began to smell normal again - the bathroom, of course, worse. We told the reception, were informed that they would investigate, but by the time we left (3 days after we informed them), nothing had happened yet. The breakfast buffet was lovely, different special foods every day and a nice selection of local produce - breads, meats, cheeses and salad vegetables. Good tasty coffee, too, which for me is always very important. The hotel location is fantastic, in a quiet side street very close to all the important tourist sights. All in all, I probably would stay there again, as I guess the sewage problem will by now have been resolved. I would have given a higher rating, but the smell in the bathroom did lower our enjoyment.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“loved istanbul”", "Author": "lyank", "ReviewID": "UR99191057", "Content": "we stayed here 4 days in Sept 10, we had 2 double rooms,with a window looking out over the goings on outside, if you are only finding some where to sleep and rest abit, its fine,nothing fancy had a safe, clean shower decent water pressure the staff were friendly efficient and pleasant, quick check in, a buffet breakfast is fine also,if you're looking for a feast go somewhere else...so close to shops, cafes all the eateries just out the door and up the street, tram bus, spice markets 5 min away and grand bazzar 10 the other, thoroughly enjoyed our stay", "Date": "March 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Haan, Germany", "Title": "“Good Hotel, good Location”", "Author": "DerHenni", "ReviewID": "UR94741243", "Content": "The Orca Royal Hotel Istanbul is a nice Hotel, I travelled there with a group, Check-in was done fast and properly, rooms had a good size, nice breakfast buffet, good location, near some of the important sights. But in my opinion all that was no 4 Star quality. Rooms were far too small for such a category, tiny shower/bathtub, breakfast buffet not the quality I expect in a 4* Hotel. Plus sometimes unfriendly personnel at the reception desk, it is not allowed to have visitors in the hotel. Might be a problem for business guests.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Good location for main sites in Istanbul and that's it.”", "Author": "Malecondunc", "ReviewID": "UR91092333", "Content": "Although the street that this hotel is located upon is very uninspiring, the fact that it is within an acceptable walking distance to the Topkapi Palace, Hagia Sophia, Blue Mosque and Basilica Cistern is an advantage. The Spice Bazaar is also not far, and the Grand Bazaar and Suleyman Mosque are also within 15-20 mins walk. However the hotel itself was not that good. It was clean, but the room we had (516) was very small with a big pillar in front of the window. This is typical of the seemingly bad use of interior space in the design of this building. The staff were unfriendly - after returning from a busy day site seeing you would hope for a hello or some acknowlegement as you passed reception but got nothing - nothing like the rest of the Turkish people we met who were really friendly. The breakfast was awful - a self service buffet with poor quality ingredients. You had to pay extra for fresh fruit juice rather than the disgusting cordial from a machine.", "Date": "December 30, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney Australia", "Title": "“It an OK hotel”", "Author": "grets20", "ReviewID": "UR90047954", "Content": "The view in our room is an old dirty building, But I didnâ€™t mind it since we were out and about most of the time. The breakfast buffet was average. There are a lot of little restaurants close to the hotel. The location is fantastic, itâ€™s very close to the spice market, blue mosque and Hagia Sophia (a bit of a walk to the Grand Bazaar). I was always at the spice market buying yummy Turkish delights. Istanbul is such a beautiful, colourful place and staying so close those places made our trip very enjoyable!", "Date": "December 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Disappointing, far from a 4 star hotel”", "Author": "Skathia", "ReviewID": "UR88132386", "Content": "I don't recommend you to choose this hotel, as all the information on the website of the hotel is misleading! 15 % discount is a cheating, entrance to wellness department not included in price, cold water in pools, jakuzzi broken, gloomy surroundings, poor breakfast, chaotic booking record system. There is a huge banner on the homepage of the hotel which says that there is 15 % discount for students, people over 65, teachers, etc. There is no notice that you get this discount if you book via email, however I wrote an email for the hotel if this discount exist and they confirmed it. They recommended me to book on their homepage as in that case I can get a free airport shuttle from AtatÃ¼rk airport and in this case I can also get the discount. So I booked our room on their homepage with the comment that I would like to use the discount. However, when we wanted to pay the receptionist told me that the discount is not valid and is not confirmed in their system. He claimed that I didnâ€™t do booking on their own homepage, but on another site (fastbooking.com), although I have never used fastbooking.com in my life. Although I proved him in several ways, that we got the information from his colleague that the discount exists, he told me that we cannot get the discount, he and he had us to pay the whole sum. He told me that I should be happy with this price as it is very good for a â€œ4 star hotelâ€�. In fact, Orka Royal is only in name a 4 star hotel, but it does not provide the services and level of it. It seems that there is a chaos around the hotelâ€™s own online booking system, as two days before the departure to Istanbul I wrote an email to the hotel for reconfirmation our airport pickup at AtatÃ¼rk airport (just for sure), and they gave the answer to me that we are not in their record system. If I hadn asked it, maybe we would still waiting at the airport without accommodation in Istanbul. Although its location is good, near to the main tramline, the neighbourhood of the hotel is very dirty and gloomy. I think the streets in the neighbourhood are not really safe at night. Although it is trough that from the pool on the terrace you can see the Bosporus, if you look down or out from the window in your room, you will see only dirty houses, a big construction work or the railway station. The breakfast was very poor, far from the pictures on the website. Cakes were dry and there was no Turkish specialities at all. The only thing that was eatable was bread, butter, cheese and cold cuts. Not really special, is it? Instead juices there was some artificial liquid, undrinkable. The hotel tries to make extra money from services that should be included in the price of a four star hotel. Usage of the wellness section is not in the price, you have to pay even for the entrance to the pools and sauna. Even if you decide to pay the entrance fee, be ready that there is cold water in the pools and jacuzzi has been broken for months. The staff told me that they have never told that there is warm water in the pools. Funny. I had to dispute with the man in the wellness department approx. 20 minutes when he finally gave back our money. Heating was not working in our room at all. The receptionist told me that the heating system is centralised in the hotel and as most of the people told that they have hot (it was end of November), they cannot switch it on. At night it was so called that I was almost frozen. This hotel was a big disappointment, I recommend you to avoid it!", "Date": "November 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Hot and smelly”", "Author": "ClaireMc76", "ReviewID": "UR85494391", "Content": "My friend and I stayed here for two nights as the start of a tour of Turkey. We are fairly relaxed with accommodation but I was disappointed with the room. It wasn't overly warm in Istanbul at the time (about 20 degrees) but the room was so hot, the air con didn't work properly and there was a extremely strong smell coming from the drain in the bathroom. We had a window that lead to another indoor dumpy area so no fresh air. If I was there in summer I would have demanded to be moved. Speaking to other people on the tour, they said their room was okay except for another couple who had the same smell as us. The hotel itself was okay, breakfast was okay the first day but the bread was stale the next. Staff were not overly friendly. I would skip the Turkish bath at the hotel and go to a bigger one if you can as you keep having to walk through the reception and commumal gym area half naked to go from one room to another.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice hotel”", "Author": "M_and_FT", "ReviewID": "UR85270344", "Content": "This is a good 4* hotel in Sirkeci, close to Sulthanamet. There is a small swimming pool at the terrace with fabolous view on Bosphorous, buffet breakfast included, the rooms are not too tiny, and are very clean. The tram stops at 100 meters, so we did not took a taxi from the airoport, but the metro and then the tram. The hotel is situated in a superb location and it was very easy to go to the bazar and see cultural sites in Istanbul (Topkapi palace, Aya Sophia and Blue Mosque are at walking distance!) Staff spoke English.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fabulous Istanbul”", "Author": "pb3141", "ReviewID": "UR81578616", "Content": "Recently went to Istanbul and found the Orka Royal Hotel in the very well located Serkeci area of Istanbul. As far as location goes this is close to the Bospehrous, the railway station, the port, Topkapi Palace and a short stroll to Aya Sofia and thw Blue Mosque. The highlight of the hotel is the rooftop pool and 360 degree views of Istanbul. Rooms are comfortable and clean but if you like darker rooms to sleep in, you will be disappointed by this hotel. I slept with eye shades every night. Breakfast is provided and adequate quality and choice. Airport transfer (one way) was included in the hotel rate and this was easy to find and very efficient and hassle free. The only real issue I had with this hotel was that you need to tell staff twice to make sure that requests etc have been done. Normally resolved but found that most requests took the initial request with a follow up. Would stay here again for sure if nothing else for the excellent location.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Disappointing”", "Author": "Judy06", "ReviewID": "UR79718437", "Content": "This was not our first choice of a hotel to stay in Istanbul but because of the world basketball championships our first choice was full. The staff at reception spoke English but were not particularly friendly. This is also the only hotel I have ever stayed at that wanted to charge for a map of the city. The lobby and restaurant area appeared dark and gloomy so we were not tempted to plan to have meals other than the breakfast which was included here. We stayed in 2 different rooms at this hotel as we did a short overnight tour in the middle. The first room was a reasonable size and clean but had a strong, musty smell. It was very warm so we turned on the air conditioning but it never seemed to work. It also overlooked a building site where they were still unloading steel at 9.30 at night. When we arrived back from our tour it was after midnight and we were tired but had to recheck into the hotel. We were given another room which was very small and with a bathroom which was set up for a disabled person - not that you could have gotten any wheelchair into either the room or the bathroom. The shower rail was falling down, the mirror was pulled away from the wall and the one small window in the room looked onto air conditioning ducts. Once again the air conditioning did not seem to work. If we had not been so tired and it been so late we would have asked for another room - even the smelly one! The breakfast was alright but as I said the restaurant was dark, gloomy and not particularly attractive.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bologna", "Title": "“Good location and value”", "Author": "Aquil8", "ReviewID": "UR78430512", "Content": "On the web you can find great offer for this excelent 4* hotel in Sirkeci, close to sulthanamet, but better as position. The hotel is perfect for all: swimming pool at the terrace with fabolous view on bosphorous, buffet breakfast, not tiny rooms, silent location but main tram stop at 100 meters.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Location, brekky & staff great, but air-con & pillows bad”", "Author": "portpad1", "ReviewID": "UR78333549", "Content": "Althought the air-con was set on about 5 degrees, it didn't get below about 23. It was the same in several rooms; (friends stayed there, and we had two different rooms as well). My wife slept without a pillow; it was that bad). The staff admitted it needed fixing. Decor was fine, although rooms were only just big enough.. Location was great; close to many things. Restaurants were a bit wanting though. The little places in the side streets were better. Staff was very helpful and friendly. Rooftop pool and bar were marvellous. Hamman was down stairs but didn't try it; although it looked good and clean.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellant stay”", "Author": "GeorgioHward", "ReviewID": "UR78193610", "Content": "A friend and I stayed at the Okra Royal Hotel in Istanbul after completing a massive cycling trip all the way from the UK. We very much enjoyed our stay. The swimming pool on the roof gave us a chance to relax in the sun during the hottest parts of the day. The Okra Royal Hotel is situated in a superb location and it was very easy to go the markets and see some cultural sites in Istanbul. However the top aspect of the hotel was the incredibly friendly and efficient staff they had working there which made our stay a lot more pleasurable. If I return I will definitely stay here again and will look forward to seeing the staff again.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“blissful base for exploring istanbul”", "Author": "riricroc", "ReviewID": "UR73221822", "Content": "Going with my 3 daughters (age 13 to 31) I wanted a good, comfortable hotel with outdoor pool to relax in after busy sight seeing. Found the Orka on Booking.com and it looked perfect. Although the entrance looks unprepossessing (with columns covered in posters advertising the holiday complex in another part of Turkey owned and run by the Orka's Dutch company owners), the hotel itself is perfect - ideal location, 20 metres from the tram to all the historic sites, 5 minutes walk from the waterfront by the Galata bridge, with its great fish sandwiches, fortune telling rabbits, sights, sounds and smells of Istanbul. Room was very comfortable, completely soundproof, air conditioned, clean, lovely bathroom with jacuzzi bath, plenty of soft fluffy towels. Pool terrace is lovely with a great view to Topkapi, Aya Sofia, the Blue Mosque, - magic. Lovely helpful staff. Could not have found a better place.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“everything is good, helpful staff”", "Author": "GulsenC", "ReviewID": "UR72697432", "Content": "we stayed there for four nights and it was very nice, great stay. The room was clean, breakfast was delicious and large variety of food. Only little problem we had was , we asked for double bed and it was twin bed, but as soon as we talked to reception they were very helpful; at the end we stayed in the same room and joined the beds because it was bigger than other rooms. We didn't have any problem during our stay and the staff was kind and helpful. Only thing the outdoor swimming pool is too small, but we didn't mind because there is so much to explore in Istanbul. Location is very good and there is a small restaurant just couple of doors away from the hotel; very friendly atmosphere and nice food with reasonable price.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "King's Lynn, United Kingdom", "Title": "“Helpful and thoughtful staff make such a difference.”", "Author": "Keith V", "ReviewID": "UR71664778", "Content": "Istanbul is a magical city. The people are friendly and everywhere you look is a photograph. So many beautiful and historic buildings. An historians dream come true.The food is great and there are lots of lovely little cafes with different dishes to try. Cruise up the Bosphoros or take a evening cruise with dinner and entertainment (Belly Dancer) included. Something for everyone. If you enjoy haggling, you'll be in your element in the Markets. The Orka Royal is exceptional in that the staff are so, well, lovely! Nothing is too much trouble. We would like to thank them all.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good comfortable hotel”", "Author": "Culture3xpl0rer", "ReviewID": "UR70170170", "Content": "Nice hotel, definitely not a 4 star just by name. Location is good and rooms are comfortable and clean. Istanbul truly is an amazing place so much to do so we did not spend a lot of time in the hotel but when we did had no complaints. Oh yeh and the buffet breakfast is also very decent.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“Hotel was great for our purpose...”", "Author": "Tiia-Maria", "ReviewID": "UR68832734", "Content": "Good location...nearby tram stop, railwaystation and seabus stops. Room was bit small, but not too small. Wiew from our room was not so nice, but we did not stay at our room so much, so it was ok. Hotel has got pool on top of the building which was nice but small. There were also gym at the hotel which was nice even though I had to pay few euros extra about it. Customer sevice was maybe one of the weakest points of this hotel. Service attitude was not in so hig level and language skills (english...spanish ok) were poor. I could recommend this hotel if you are looking for nice hotel to sleep..not luxury!", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Surrey", "Title": "“Friendly and helpful”", "Author": "KagsSurrey", "ReviewID": "UR68340123", "Content": "Just got back from Istanbul. Stayed at the Orka Royal Hotel. The staff were very friendly and attentive. Our first room was not suitable (to small) so rang down to Hotel Relations lady Aydan and she came up to our room almost immediately. Said she could not move us that day but to leave our cases in the room and they would move us the next day. The second room was much better. The hotel is clean and very well appointed for the main attractions in Istanbul. Just a 10 min. walk to the Blue Mosque etc. It has a pool on the roof which was a godsend as it was very hot and after a full morning of sightseeing all we needed was a swim and a beer!! The female receptionists were very friendly and helpful. The breakfast were lovely. Thank you lady's.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Reasonable!”", "Author": "Mariana_9", "ReviewID": "UR65960121", "Content": "The hotel has a fairly good location. Very central and very close to the river..plenty of places to go out and buy souvenirs. Stayed in the first night in a windowless room and almost died.. although the air condition was working perfectly.. I was offered to change to a better room and it was much better.. they got a bar on the top floor with beautiful views.. overall worth it", "Date": "May 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“An amazing location - you'll only use this hotel for sleeping!”", "Author": "rosebiscuit", "ReviewID": "UR64051150", "Content": "We stayed for four nights at the Orka Royal. Its postion in Istanbul is ideal for sightseeing within shouting distance (literally as the call to prayer is easily heard throughout the day from your room) from the Blue Mosque and Aya Sofya, as well as within walking distance of the Bazaars (15 minutes either way to the Spice or Grand Bazaars), and there is no shortage of amazing street cafes and restaurants to try. I have two issues with this hotel but neither will prevent me from returning. Number one: the room gets very warm and the air conditioning isn't very effective. Sleeping was a little warmer than comfortable but I have had worse nights sleep in hotels. Number two: we settled our minibar bill the night before we were due to depart to save time. We used the water and the juice on most days because there are no tea/coffee making facilities and the tap water isn't safe to drink if you are from Western Europe (something to do with enzymes... or so they tell me). On the morning we were to leave, we checked out at 4am and waited in the lobby for our pick-up. The night manager berated us for having settled our minibar bill the night before as we could have taken something from the minibar since then. I assured him (sleepily), that we had not taken anything else and if we had we would have declared it. He kept going on and on at us, basically calling us liars and acting very stroppy. I didn't lose my temper but I firmly told him that if he did not believe us then he was very welcome to go upstairs and prove us wrong. That shut him up. Horrible man. Anyway. The rooms are clean, compact and comfortable. No view to speak of but that doesn't bother us as we weren't in the hotel except to sleep, really. Nice double bed, good bedding, a small desk and television with BBC Worldwide. The minibar is quite good value compared to some but for water to take around during the day there are plenty of little shops en route ot the sites to buy a bottle of drinking water for less than 1TL. The bathrooms were nice. Very clean, average toiletries, nice towels and water jets in the bathtub. The shower was powerful too, which is always good. Like I said before, the air con was a bit rubbish and the room was quite warm but it wasn't enough of an issue to put me off this hotel. We didn't use any of the hotel's facilities (the two pools, gym or bar), but we did use the restaurant for the buffet breakfast. The breakfast was okay - certainly filling enough to keep you going until a nice plate of lamb kofte for lunch in a street cafe. It is quite Turkish in theme but there are all the usual European trappings. The hot buffet and the breads varied from day to day and the fruit juice alternated between cherry and orange. The tea is in fact Turkish tea which does not go well with milk, but you should remember that you are in Istanbul and should immerse yourself in the gastronomic experience as tea is a big deal here. The neighbourhood isn't very glamarous but it was far from unpleasant. It is undergoing some patchy construction at present (May 2010) but nothing that's going to interrupt your holiday. It's a bit dusty and off the main drag with the trams and bigger restaurants but fantastically close to all the major attractions including Topkapi Palace (so you can get up at a leisurely pace and still beat the crowds!). I would say eating your lunch or evening meal here would be a cop out because there are some great places nearby, we tried a few of them and everybody was really friendly and the food was good. All in all, a great hotel for sightseeing, nto so much if you want to feel luxuriant and pampered... but that's not really our style.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chippenham", "Title": "“We will go back without hesitation”", "Author": "spc1", "ReviewID": "UR63816152", "Content": "We ended up here by accident, our other hotel was fully booked and we were placed here by our booking agent instead. From the word go we had a great experience. Very firendly staff, our double bedroom was spacious and clean, our son's single was smaller but perfectly acceptable for the cost and our requirements. Breakfast was varied, although on day one we seemed to hit it just after a rush so we had to wait for items to be replenished, however on day 2 we were earlier and the breakfast was first rate. We loved the roof terrace with swimming pool. There was something so cool about having an ice-cold drink on the roof whilst looking at cruise ships and ferries on the water below. As others have said, convenient to the trams and the railway station, we walked to most places, no-where is very far if you don't mind walking. Other wise the tram only costs 1.50 YTL and you can go anywhere the fancy takes you.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hartford", "Title": "“Best Holiday Experience Ever”", "Author": "Hartfordgirly", "ReviewID": "UR63221909", "Content": "This was our second trip in Istanbul. My husband and I just loved our stay at Orka Royal. The staff where really nice and helpful. They hotel was in the middle of the cultural historical area. The food was delicious.. TO be short it was a magnificent trip to istanbul.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great Location and excellent service”", "Author": "iitravel", "ReviewID": "UR62953753", "Content": "I booked this hotel on the recommendation of Trip Advisor and because it was also listed in travel magazines as a good quality four star hotel. From the welcome drink provided on arrival, the service of the staff and the cleaniness of the rooms this is a good quality hotel. The substantial buffett breakfast caters for all tastes. The location of the hotel is about 200metres to the nearest tram stop (Gulhane) and the Grand Bazaar, Blue Mosque, spice markets and other attractions are all within a short walking distance with other attractions around the city only a short tram or bus ride. The rooftop deck (swimming pool- not in use during my visit) is a great place to sit and unwind at the end of a day of sightseeing. I also had the misfortune of a minor incident with a local taxi driver on arrival (overcharged by 30TL) and the guest relations manager at the Hotel - Aydan Dulgeroglu was extremely helpful not only in translating my report into Turkish but she also accompanied me to the local police station to speak with the police on my behalf. Service well beyond what was expected. I would recommend this hotel for its location, service and reasonable pricing of rooms booked in advance.", "Date": "May 1, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Argentina", "Title": "“nice hotel, nice people, nice location”", "Author": "Fabian-Argentina", "ReviewID": "UR60930363", "Content": "really nice location, very near every important atraction in istambul. Tranway is two blocks away", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarajevo", "Title": "“Very pleasant, cooperative and frendly staff :)”", "Author": "MsTomCat", "ReviewID": "UR55062925", "Content": "Very clean and nicely furnished and equipped hotel facility. Staff is very efficient. They were very helpful to us for the organisation of the training. Hotel' location is really fantastic :) Rooms are very clean and comfortable. Food is quite good, also. I would alwasy recommend this hotel to all my friends and business partners", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarajevo", "Title": "“efficient, cooperative and very pleasant staff”", "Author": "sanatSarajevo", "ReviewID": "UR55062804", "Content": "Hotel staff is very efficient, very helpful. They are ready to assist with any request you might have. The staff was extremely helpful and we are very much thankful for this. Also the restaurant and the rooms are very clean, and comfortable. We definitively recommend this hotel for conferences and business meetings, at the same time, this is the place we will choose for our holidays, as it is in a great location for sightseeing ans shopping. :)", "Date": "February 3, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Mountain View, CA", "Title": "“Faded orange decor, directly across from a VERY MAJOR construction site”", "Author": "Googleland", "ReviewID": "UR52581685", "Content": "I stayed one night at this hotel as my assigned tour hotel was overbooked the first night of my tour. This was a decent C+ hotel, room was clean and quiet. The restaurant/breakfast room has all the charm of a high school cafeteria. Not a problem for me, as I was whisked away right after breakfast, but unpleasant if staying longer. There were no towels in the bathroom when I checked in (about 6 pm) and the ones that were delivered had frayed edges. The electrical outlet by the desk popped out when I tried to plug in my laptop--it wasn't actually connected to the wiring in the wall. That was a surprise. What no one has yet commented on--the very VERY big \"elephant in the room\"--is that the hotel is located directly across a narrow street from a MASSIVE construction project, a major part of laying the subway tunnel under the Bosporus. You would certainly not want a \"view\" room at this hotel. As a result of the construction and the general neighborhood, there are no charming restaurants, etc.. It is just two or three blocks from the train station and a few blocks from the tram line.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Not the best!”", "Author": "livewire26", "ReviewID": "UR52157702", "Content": "Not a bad position is probably the only good thing going for this characterless hotel. Bare minimum facilities (which were closed) for a 4 star done on a budget. Food disappointing, nothing seems fresh, and service is a bit haphazzard. Rooms tiny, beds small, carpets stained, plumbing smells, rooms are stuffy. Photos are misleading, on close inspection everything is done on the cheap or not working and dated.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "den haag", "Title": "“fantastic”", "Author": "nadia-broom", "ReviewID": "UR51543561", "Content": "If only I could've stayed longer. Courteous employees, fabulous accommodations and sumptuous meals. I have so much nice things to say about this place. Nadia", "Date": "December 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "De Pinte", "Title": "“Splendid hotel”", "Author": "BurtonDePinte", "ReviewID": "UR50032695", "Content": "Very wel equipped rooms, comfortable beds to sleep in, tidy bathroom, fresh towels every day, mini bar, TV, safe. Breakfast was ok, but minor points were that there was no fruit juice nor fruit present unless you paid for it. The same is to be said about the sauna and Hammam who were not for free although the swimming pool was. We were also disappointed that the staff in the swimming pool area wa unable to express itself in an other language. But in general we were very pleased to have stayed in the hotel with its very gentil staff.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Wales", "Title": "“Good basic hotel with helpful,friendly staff and central location.”", "Author": "Hauldwyn", "ReviewID": "UR49232854", "Content": "Four of us spent four days in October exploring Istanbul based at this hotel. We were initially unhappy with the outlook of the rooms we had been given but when we contacted Aydan, the Guest Relations Manager she reallocated us to different rooms and could not have done more to help us. This was also true of all the other staff who were always friendly, courteous and helpful. The hotel was immaculately kept - the one disappointment was that the roof terrace was closed for refurbishment during our stay.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Good Hotel - Great Staff”", "Author": "johnwoods1981", "ReviewID": "UR48629491", "Content": "Nice hotel - excellent service from the staff. They really make you feel welcome and are very helpful with advice about touring the city. Istanbul is a fantastic destination. I recommend it to everyone.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "san francisco", "Title": "“Great Experience, wonderful staff, excellent service”", "Author": "joseSanFrancisco", "ReviewID": "UR48504574", "Content": "The staff here was amazingly helpful. They went out of their way to provide us with anything that we needed at the hotel and they were very informed about the sights in the area of the city that we stayed in. The location of the hotel is perfect. All the major sights are just a few blocks from the hotel, the Blue mosque, Hagia Sophia, the Palace. The rooms were nice and the price was very reasonable. I would reccomend this place to anyone who wants to be close to the center of Istanbuls historic neighborhood.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "istanbul", "Title": "“perfect hotel, perfect location, perfect people”", "Author": "infinityz", "ReviewID": "UR48406573", "Content": "i've never seen such a nice staff.. i really enjoyed my stay.. the one who is looking for a room in istanbul, this is the place!", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "denmark", "Title": "“Ä±t was good hotel...”", "Author": "esilaesila", "ReviewID": "UR48050427", "Content": "we stayed this hotel at four days..Ä±t was good holÅŸday.the hotel was really clean and all staff wre friendly.Ä± will go back again...", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Walse", "Title": "“Good value and very helpful staff”", "Author": "AlanT041", "ReviewID": "UR47650360", "Content": "We stayed in this hotel for four days in OCTOBER. The staff were very efficient, helpful. What else can we ak for?", "Date": "October 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Springfield, Massachusetts", "Title": "“Good hotel - good value for the money”", "Author": "Westernmasstraveler", "ReviewID": "UR36765110", "Content": "My wife, adult daughter and I stayed at Orsep Royal for two nights as part of a group tour. We had a room with 3 beds. Spacing was tight with very little closet space. The hotel is very conveniently located to all the major historic attractions in Istanbul. Almost everything is within walking distance or accessible by tram. We found the breakfast pretty nice with almost all the selections one would ask for. A good 3 star hotel with free wifi. Our only complaint was the air conditioning faded in the early morning for some reason. We would stay there again.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Decent enough, but not 4 stars.”", "Author": "honeymooncouple09", "ReviewID": "UR33378896", "Content": "We stayed at the Orsep in June. It was fine, in that the staff were friendly and rooms OK, but I don't know how it can claim 4 stars. At breakfast there was no fresh tea or coffee - everything from a Nescafe machine, there wasn't even fresh juice - it was some artificial cordial. I asked for a fresh Turkish coffee (not unreasonable in Turkey) and was charged Â£3!! The same with orange. It was not possible to order omelettes or anything not in the fairly uninteresting buffet (of watery scrambled eggs and frankurters). My wife asked the chef for more bread and was told \"finito\". He was good enough however to give us a slice of lemon when we asked for it (in his hand!). I've not eaten such a breakfast at any hotel before - even 2 star. The room was fair enough - we're not fussy, but I spent Â£900 on my holiday for a \"room with a view of the Bosphorus\". What we got was a view through the sky lit. Super! S", "Date": "June 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne, Vic. Australia", "Title": "“We liked it a lot”", "Author": "Blossom55", "ReviewID": "UR32184845", "Content": "Ok so this is not a brilliant hotel but everything works. The shower, hot water, tv reception and for Istanbul not overly expensive from the right provider. The staff, like all turkish people, are friendly & helpful. The place was clean and comfortable and well situated in Sirkeci for the tramline from Zeytinburnu to Beshiktash.. Orsep Royal is located very close to many monuments/sights and well situated for many interesting restaurants and bars, also the Sirkeci Gar (main line train station) and Eminonu ferry services. Breakfast was typically turkish and as with many other hotels, the so-called orange juice is horrible. We stayed at this hotel in May and upon our return in early June also.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Moscow", "Title": "“Bosforo from your window every morning.”", "Author": "grinlinn", "ReviewID": "UR30982880", "Content": "May holidays we decided to spend in Istanbul. Orsep Royal is not big, but here you can find everything what you want from good location for sightseeng, turkish bath with sauna and fitness-club to super-soap with herbs in rooms. We have stayed in superior suit with jakussi and Bosforo sight from the window. Not cheap, but perfect. Breakfast was good - good service, clearance, hot bread, juice, big variety of vagetables and jam. Plus milk and musli. 10 minutes walk and you are in Grand Bazaar, Blue Mosque and Top Copi Palace on the other side. We took map in the hotel and walked by foot a lot - from Aquadact to the sea wall, visited parks and little cafes. Near the hotel you was very nice shop with very tasty bahlava and turkish delight. Room was always clean, bathroom - modern. In room you can find free lock box and free wi-fi. Very nice. And of course personnel - always smile and friendly. Thank you)", "Date": "May 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "dorset", "Title": "“Solos Holidays - Overbooked Hotel”", "Author": "travelcatDorset", "ReviewID": "UR29392440", "Content": "I booked this holiday for Easter 2009, 8 months prior to departure with Solos Holidays,only to be contacted by Solos three days before departure who told me the Orsep Royal was overbooked and our party of 17 ladies & 3 gents would be moved to the Point Hotel Taksim, (Miles out from the city centre). I was also told by Solos that it was too late to cancel - even though I hadnt asked to do so. Dont know whether this was due to the mismanagement of Solos or the Orsep Royal, but it caused much stress and inconveniece. We saw the Orsep Royal on our way into central Istanbul and its location for sightseeing was excellent (Unlike the Point Hotel). I have based my review on this.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "UK", "Title": "“Reviews really should be read”", "Author": "TrueUK", "ReviewID": "UR29275398", "Content": "Hotel chosen after reference to Thomas Cook Signature city breaks ( mistake ) One photo actually not hotel !! Position nasty / building work s etc .Given pokey room with miniature bed - requested move . Rooms very small & stuffy 2 * - breakfast average - roof top pool / bar not open & charge to use fitness centre ! Customer service 0 - Only redeeming feature clean & not far from tram or sights", "Date": "May 4, 2009"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Moscow", "Title": "“outrageous accident”", "Author": "vvvlas", "ReviewID": "UR23420636", "Content": "I paid 2 rooms 4 months in advance, was informed by Expedia - OK, but called to hotel 3 days in advance to check that they paid attention that we have child... But when we arrived, they said that they have no rooms for us! After all our onvulsions they offered to see what is available for the two days - small smelling closets. And promise to offer a normal rooms after two days. Really, their fitness and sauna is OK and view from some rooms is OK, but just one such accident down their rate below the waterline. So, we were pressed to move to another hotel nearby. Again, it is in good place, but service was mediocre (Gulhane Park Hotel).", "Date": "January 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Excellent location”", "Author": "simoontheroad", "ReviewID": "UR23085863", "Content": "This hotel is in a good location - away from the super touristy part of Sultanahmet, but just a few minutes walk down the hill. Also just a few minutes walk tothe ferries and train. The pool is awesome - I spent a relaxing day beside it at the end of my trip. Buffet breakfast in the morning was one of the best I have seen in Turkey. Room was a little bit small and the window was very small, but it was really nicely decorated. The bathroom was really modern. I would stay here again.", "Date": "December 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bayside, NY", "Title": "“This Hotel Stinks--Literally”", "Author": "Annemar", "ReviewID": "UR20765238", "Content": "Tiny room with paper-thin walls and hollow-core door. But worst part was the sewage smell that wafted up from the bathroom drains on the lower floors. After complaints from many guests, maintenance claimed it was a housekeeping problem. Rooms were then sprayed with heavy perfume. I would have left, but room was booked/paid for 3 nights by tour group. Even our tour guide admitted it was \"not so nice.\" Tiny lobby and desk staff speak/understand minimal English. Asked for 7:30 wake-up call; received call at 5:30 A.M.; no apology. Great location, but outside very noisy from construction and carwash. No cable and terrible wireless connection. Awful food. All advertised amenities cost extra.", "Date": "October 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Cubby Hole Room Lottery - Beware”", "Author": "theimpi", "ReviewID": "UR20365762", "Content": "Read all the reviews about the small rooms. arrived and was put into a 5th floor spacious room with fantastic bathroom and aircon, didn't see what all the fuss was about. Came back two weeks later after tour, was put on 1st floor, no window, stench from bathroom was unbearable and aircon was leaking, woke up at 05:00am being sick from the fumes, complained to hotel maintance and was told there was nothing wrong, the stench from our friends room next door was so bad, whenever they opened their door, the hallway was unusable (how they slept in there i still don't know) On both occassions, the mini fridge did not work. Breakfast was alright, but just like all the other 6 hotels we stayed in in Turkey, everything runds out, they only replace if you ask and you cannot get Turkish Coffee with breakfast for all the tea in China, just terrible machine coffee....", "Date": "September 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Air-condition Probers Are Real”", "Author": "Urszulita", "ReviewID": "UR18686869", "Content": "So I read bunch of reviews about this hotel before I booked, I saw the Air-condition Probers and rooms with no windows, I figures A/C maybe they had problems but what is the chance I end up in the room with no window slim, right? So, I check in, get a room with no window, but there is a curtin to make it look like there is a window ( I think this problem is only on 2nd floor so be aware). I left bags and went out because I had plans for the evening. At the time of me being in Istanbul, city experience a huge heat waive, Hot over a 100F. I come back to the room around 4:00 am, I hear something is blowing but it is defiantly not A/C, its hot like hell, I go to the reception and tell them that A/C is not working, their simple reply is they will look into it. Of course no one did any thing. I prepaid the hotel in advance, so I did not want to move, well I moved once to get out of the closet with no windows, but the A/C problem is defiantly real, they save money by turning off the A/C at citrine hours, they are after 10:00 am in the morning for few hours, I guess they figure people will go out to do staff in the city and then at night after 11:00 pm, I guess they figure when people go to sleep, they do not need A/C. Staff not too friendly, I stayed in the hotel next door two weeks later, what a difference, I had staff bringing me hot apple tea to room every morning. Only reason to stay there is the pool with the view.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Cracking pool and lovely overall”", "Author": "Pound_Witch", "ReviewID": "UR18146857", "Content": "We found the Orsep Royal fantastic. Check staff very business like - but the pool bar staff very friendly. The pool is gorgeous (plunge style) - just the antidote to the hot streets of Istanbul. The view from the roof top pool is stunning. Breakfast was great, loads of fruit, yoghurt and baskets full of gorgeous bread as well as the usual continental breakfast favourites and some hot dishes. The only drawback is the air conditioning in the room - it is always on as a fan but the air is only cooled artificially at certain times like first thing in the morning and in the evening before you go out - so if you fancy an afternoon nap it will be quite warm. We didn't mind this so it was good for us - but if you suffer in the heat it may be a drawback. The location is brilliant a few steps from Sirkeci railway station and the Tram stop and a few hundred yards down to the beautiful waterfront from which you can get ferries down the Bosphorus (much cheaper than the private boats). It is a short walk to the Topkapi Palace, Blue Mosque, Aya Sophya and the Egyptian Bazaar (a wee bit longer walk to the Grand Bazaar). Basically everything you need to see is within walking distance - but the cheap and easy trams will take you further. There are also loads of restaurants nearby and although they don't look swanky the food is fresh and fantastic flavours. There are lovely post fish restaurants under the nearby Galata Bridge. Highly recommended!", "Date": "July 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "uk", "Title": "“Good Location ..cozy hotel”", "Author": "nabeeldar", "ReviewID": "UR14574149", "Content": "Stayed at the Orsep Royal for 3 nights..in mid mid March on the top floor......great views from the rooftop during sunset... Room was Medium size, plenty of space for luggage and other bits n pieces ( maybe we got lucky with the room !!)...nice and clean, and wirless internet connection worked fine. The wellness centre , is something you have to pay extra to use, but it is good to use. and has good faiclities..esp if you liek the gym. the only problem we found was the that the breakfast was louzy ! , not much of a choice or variety here watch out for the dodgy fruit seller outside the hotel....tried to sell me 3 oranges for 7 liras....nice try ;) Overall. nice cozy hotel in a location near to all the tourist sights.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterhead, United Kingdom", "Title": "“Great! Great! Great!”", "Author": "Craigewan", "ReviewID": "UR14242992", "Content": "After reading some of the mixed reviews from other travellers I was hesitant that perhaps this hotel would not come up to expectations . . . . . . I shouldn't have worried! There were six of us who travelled together to this hotel and being the organiser I was delighted with the choice. All of the sightseeing places were easily within walking distance. The reception staff at the hotel could not have been more helpful, contrary to some of the other reviews. The rooms were very clean and again the cleaning staff, as was the staff in general, very pleasant. All in all a very pleasurable experience and one visit which we will not forget in a hurry.", "Date": "March 12, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“I wouldn't go here again”", "Author": "HectorHughMunro", "ReviewID": "UR14158755", "Content": "The first room they gave us had no windows other than on to the corridor(?). The room had few of the advertized facilities; no safe, no cupboard to put clothes in, very little space, no hairdryer. We couldn't get the air conditioning to work and were told that it wasn't switched on at that time of the day. If you stay in this hotel, you definitely need the safe. We got moved to a slightly larger room but only after an argument. Everything here seems to take an argument. We tried to borrow a cup so that we had something to drink from in the room but were told that we would be charged for borrowing the empty cup. I wouldn't say that it was a western European standard hotel. It is one of the worst hotels that I have stayed at. I rarely give bad reviews to hotels but I feel absolutely compelled to in this instance.", "Date": "March 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Small but comfortable rooms”", "Author": "joolz1980", "ReviewID": "UR11981157", "Content": "I booked this hotel due to the location as we were going to be visiting the major tourist attractions. It was well located close to metro, shops etc. The room we had was small but there wasn't anything to complain about except from lack of pillows!!! The only bad thing i would say would be the prices at the bar, we had 1 drink each and it came to 49 ytl which is more than Â£20!! If i was going back to the same area, then i would stay here again.", "Date": "December 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "london", "Title": "“Good hotel”", "Author": "zink123", "ReviewID": "UR11203775", "Content": "This hotel has is maintained at a high standard. Location is good near the tram. Breakfast is average but nothing special. staff friendly. Gym is outstanding. If you like smoking you'll be very at home. On ther negative this. Outside the hotel the street are in a very poor state with tram lines coming out of the roads.I would not recommend any older person to stay in the areas it becomes unsafe and dangerous. ( At this time) Second, staff only seem able to recommend their own in-house services. Fair enough,but there are a thousand restaurants in Istanbul, surely you can tell us about one other than your own or a staff commision based. Conclusion . Good value for money.", "Date": "December 2, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "munich", "Title": "“it was more a one star hotel”", "Author": "istanbul8", "ReviewID": "UR8862120", "Content": "at first we became a room which was much more a cellar than room for two adult people. it hadn't a window or a fridge. we reclaimed and then it took us half a hour to became a new room in the second floor. the view was terrible: we saw a car parking and in the night you couldn't sleep because of the noise from outside. the staff was very unfriendly and when you had breakfast, they shouted from one table to the other... the one and only good thing was that the blue mosque and hagia sopia was very near and that you just needed 5 minutes to the haven...", "Date": "September 23, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "texas", "Title": "“Good location, not a great hotel... don't be fooled by star rating.”", "Author": "misguided1", "ReviewID": "UR8752059", "Content": "I wished I had read the reviews on Trip Advisor before I booked this hotel. This is maybe a 3 star hotel. We stayed at a 3 star hotel in Sulchak when we did an excursion to Epphesus which was bigger and nicer than this place, and much cheaper. I am going to list our dislikes first because they are far greater. First - Do not book this hotel UNLESS you book through them - not an agent or discount website. Otherwise, the only amenity you can use without charge is the upstairs pool and breakfast. They will not assist you at all with airport transfer except for at an outrageous price compared to what other companies offer and you can not use the fitness facilities, spa, etc. I have never stayed in a four star hotel that tries to charge you for facilites if you book through anyone other than them. It was so absurd, and when we tried to discuss it with the consierge they just said you should have booked through us (at 100 euros a night! - no thanks!). Second - The rooms are horribly small. Do not be fooled by the pictures. Our first night we got put into the smallest room in the hotel. The bed could only fit into the room at a diagonal. Our suitcases were stack up against one side of the bed. There was a small square space to walk from the bed to the small closet sized bathroom. They did move us the next day to a slightly bigger room because we complained about the size and lack of hot water in this room. Definitely not 4 star hotel rooms. Third - service is poor. We had problems with our air conditioning. One they turn it off during the day when it is hot, only allowing it to be on after 5 and that is after we had to request it be turned on each day. We did not know to do this the first two days and had no airconditioning. We tried sleeping with the window open but construction went on late and started early so there was lack of sleep. When we complained we got the explanation that it was too cold outside at night for it to work (not true it was in the mid 70's or that guests had requested air conditioning to be turned off). Once the staff found out we booked through a discount website they had no interest in our stay there what so ever. Fourth - Breakfast is not great. Dry bread. Have to pay for juice. And overall just not great food. The wait staff is however friendly and keep the dining area clean. They promptly take it away at 10 am. Five - Smokey - we requested a non-smoking room, but they are interspersed next to smoking rooms so your room always smelled of smoke if you had a neighbor smoking. pretty gross in the middle of the night. Six - a little shady of an area. Okay during the day, but at night the side street is a bit sketchy and wouldn't feel safe as a woman by myself. The plus for this hotel is the location. It is so close to all of the sites in the old city and to the docks if you do the bosphorus cruise, etc. Not a long walk to the new city either. So that is the great part about it. If you want to say you stayed in a four star hotel at this price - book it. If you want to stay at a real four star hotel we would not stay here again. We would either pay a little more for an actual four star hotel, or pay a little less for a three star hotel, which is what this should really be, and it will probably be of equal or maybe even better quality.", "Date": "September 18, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "North London Finchley", "Title": "“Great Position to sightsee”", "Author": "DavidLewis", "ReviewID": "UR8547756", "Content": "Just five minutes from the Topkapi and all the sights of the Old Town this not very expensive hotel provides an adequate breakfast and small rooms. Unfortunately we arrived at 11pm and the \"rooms were allocated in the morning\" This meant that my kids were on the sixth floor and we on the first in a room with no ( booked) bath, just a shower, a bed around 4 foot, a large single for my wife and I, and no window. Clearly the worst room in the hotel. Although I walked in and then walked straight out, and sat in reception for over an hour they did nothing and the rep from Metek Holidays had no intention of coming to sort it out. They are only there to get commission on your trips anyway! After late night calls to the manager, we were promised an upgrade to a \"corner suite!\" for our final three nights. This was a passable room with an alcove for a sofa, which we used to put our bags on. However, though in a side stret which none of the taxi drivers know, this is great spot. You can walk to the main sights of the od town, no need to pay for guides. Also you can even walk down to the Bospherous to get your own boat. Lots of local places to eat cheaply and a bar just down the street at great prices. If you book it just make sure that you don't get one of the really bad rooms.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Pretty Good hotel in a pretty good location”", "Author": "Leebee9", "ReviewID": "UR7545203", "Content": "We were booked into the Orsep Royal by a tour company and we were pleasantly surprised. The hotel is pretty new which meant that the decor was all in good condition and was modern, however it meant that the people operating our airport transfer had no idea where the hotel was so we were a bit slow in actually getting there! Overal the street it is in isnt as bad as I was expecting from reading the other reviews. It wasnt well lit and had lots of places with roller doors that were closed at night but there were enough people around and it wasnt that far off the main road so we never felt unsafe. Our room was pretty small but we were expecting it. The bed was the best one we had during our 8 days in Turkey and the bathroom was lovely with a shower with great pressure. There were two disappointments to our stay. The first was the state of the rooftop terrace/pool. Maybe it was because we were staying in April and it wasnt summer, but the pool was filled with about two meters of sludge and that was it. The terrace, while having a lovely view of the Bosphorus was actually being used as a storage area and you couldnt enjoy it at all. The second was the bar staff. They were not friendly, couldnt speak much English and had no idea how to pour a vodka and orange juice! On the plus side the restaruant and reception staff were lovely and all the main attractions are just a short walk away. Overall I would recommend staying at this hotel.", "Date": "May 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tehran", "Title": "“Good location, bad neighbors”", "Author": "Ahmad_R", "ReviewID": "UR7276025", "Content": "It's a new hotel with normal facilities, near to tourist sights and public transportations ; BUT................. In the first night, they gave us(2 persons) a very very small room without any window . We complained about it seriously and the day after they change our room, it was very strange in this new hotel that some rooms don't have any window to outside!!! Also Do not expect to see a good view from you room window and when walking around the hotel,in the street there are car spare part shops. Also won't be surperised when see unfriendly staffs there. We had a bad experience at the last day, for checking out, when we wanted to take our passport, we understood, reception has lost and after 1 hour we found them in the reception box !!!", "Date": "April 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paralia Katerinis, Greece", "Title": "“It's ok”", "Author": "edbica2000", "ReviewID": "UR6478933", "Content": "So...for 01.11-08.11 prices was good (50 euro/double room/night). My room was confortable, medium size with good facilities. Cleaning every day. The hotel facilities (sauna, turkisbath, steambath, fitness, etc) it is extracharge but no so expensive.With english it rights they doesn't know, only in the reception was a lady who speak little better.They are friendly but not what I expect.Breakfast are ok and standard. Pool and jacuzzi are without charge but nobody tell us and when we go there, water was very cold. Place are ok and we have conections with all buses, tram, etc. So, if we want to come back in Istanbul we come back here.", "Date": "December 21, 2006"}], "HotelInfo": {"Name": "Orka Royal Hotel", "HotelURL": "/ShowUserReviews-g293974-d578188-Reviews-Orka_Royal_Hotel-Istanbul.html", "Price": "$94 - $218*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Nobethane Cad No 10</span> | <span class=\"extended-address\">Sirkeci</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34113</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "578188", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/66/0c/7a/bophorus-suite.jpg"}}