{"Reviews": [{"Content": "Very Dodgy Apartment Hotel I booked 2 apartments in this 4 1/2 star apartment hotel 6 months in advance. The purpose of my stay was to spend 3 weeks with family travelling from overseas to spend Xmas with us in Australia. The hotel boasts fully equipped mini kitchen in the rooms, a restaurant and bar and coffee shop, and a pool with spa. On our arrival, we enquired why the restaurant appeared to be closed. The excuse we were given was that they had to close it due to an emergency the day before and were not able to fix it for a least 3 weeks. This also meant that the coffee shop and bar (completeley separate) were also closed. We should have been telephoned about this so we could make alternative arrangements. We were not told of an alternative hotel until 3 days later, after I had moved all our luggage in and bought food to cook in the rooms. Having a back condition and only an 8 year old and an 86 year old to help me, this was not an option, but would have been had we been told about it on our arrival . This was only the beginning of the problems at this place.  We soon found out that the Spa in the pool did not work, the lock on the door of our room was faulty and had to be fixed 4 times, the toilet blocked frequently, the smell of something rotting was always in the room, and cigarette smoke came through the exhaust of the airconditioningeven though it was a non-smoking hotel. The towels and toilet rolls were not very easy to come by, the beds were very hard, the shower in the very high bath was quite dangerous and the fully equipped mini kitchen had no microwave or convection suitable cookware . Over Xmas, despite the fact that the restaurant was not operating, the staff had Xmas Dinner in there. The little man behind the front desk was extremely rude when fixing the lock on my door, and was not in my opinion the type of person who should be employed in the hospitality industry.When asking for compensation were were offered $7 per room per night.", "Date": "Jan 4, 2009", "ReviewID": "UR329440149", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "markySydney"}, {"Content": "Worst experience ever getting a room!!!! I booked a room in this apartment hotel over the phone, as I required a late check in as I was staying in the hotel after wedding. Speaking with the the front desk they had told me they made note of this request and told me that I would be able to get my key to the room in a drop box. Well attended a great wedding a few nights later but was quite tired as I was the best man and had a few duties throughout the night. Anyway was looking forward to getting a good nights sleep. So got to the hotel and put the pin number as per the instructions into the drop box. No key came out. Put the pin again and still not key. So there was a number on at the front door which I rang. The person on the phone advised me that he would get the night attendant to see me. When the attendant got to the door he was quite unfriendly and rudely told me that someone had gotten the key in the afternoon. I was quite shocked as he never asked for my details such as my credit card, phone number I left when I booked the room etc. He didn't check the system to see if they had given the key to the correct person. All this time I was outside in the cold and he wouldn't even let me into the lobby and just went back and forth to the desk stating that someone already had taken the room. The whole time he was very inhospitable and still can't believe he wouldn't even let me into the lobby. Anyway just wanted this to be head as this was the most unprofessional and worst experience I have ever encountered getting a hotel room.", "Date": "Jun 22, 2008", "ReviewID": "UR376988144", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Dynamite3"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d578849-r23267800-Pennant_Hills_Waldorf_Apartment_Hotel-Sydney_New_South_Wales.html", "HotelID": "578849", "Price": "$113"}}