{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Good hotel at Sussex Gardens”", "Author": "Sergio B", "ReviewID": "UR126417258", "Content": "Although the bathroom is the smalllest I have ever seen, the hotel is a good option for its cleanless and friendly staff.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Rishon LeZiyyon, Israel", "Title": "“very bad experience”", "Author": "frequentraveller966", "ReviewID": "UR119743148", "Content": "Worst hotel we have ever seen ! Got there as a last minute sollution for a triple . Got a room in the cellar , steep stairs, worn and dirty bed-covers which were expected to be used as blankets ! the tiniest bathroom into which you have to, literally, squeeze in. You can`t sleep properly, you can`t bath properly, and you pay as if it were a good 3* hotel.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Great location;)”", "Author": "abreeden", "ReviewID": "UR115671294", "Content": "I stayed @ the white house the first leg of my Europe vacation.. After landing@ gatwick .. I walked around London .. Finally I was ready for a nap ..;( omg !! My rm was 3 flights of stairs up .. Steep !! 3 bags full( I way over packed!! And no one helped.. But I slept well;) My shower was way way to small.. And I'm little.. So if your big .. Well.. Good luck .. Breakfast was free and good.. But not in the same building as my rm.. Everything was clean .. And the staff was nice .. The best part of my hotel was price and location .. I was a 5 min walk to Hyde park .. I loved that .. Paddington and Lancaster stations so close :) and praed street had a hop on hop off red bus stop.. Great pubs and fish and chips.. So if you don't mind a very small rm and a very small shower and a climb to your rm .. It's not a bad stay", "Date": "July 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Switzerland", "Title": "“No luxury, but good enough!”", "Author": "cheonsa", "ReviewID": "UR18986637", "Content": "The hotel wasn't very new and there was no lift, but that was no real problem. It was located very centrally and Hyde Park/Paddington station were easy to reach on foot. We got diverted to the white house from the seymour hotel, which was very ok. The breakfast was ok, there was toast, tee, coffe, yogurts, cereals, etc. Our room was small, but clean. We had a twin room, but since the beds had wheels on them, it was easy to make one double bed out of them. The carpet under the bed was clean and so was the small bathroom. The tv and the window worked all right and we really had no problem staying there. The room was really ok for us, since we just needed a place to sleep. We came to London to see the city, not to stay at the hotel all day. The white house was relatively cheap, convenient and ok.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wright City, MO", "Title": "“Not quite the Working Girls Hotel that I thought it would be!”", "Author": "frauw", "ReviewID": "UR7482757", "Content": "My husband and I booked this hotel as part of an Orbitz package to London. We picked this hotel because of the price and it's proximity to the Paddington Station which we thought would be convenient. We booked the hotel months in advance. At the time, no one had written a review so it was unknown territory. After researching the hotel, I was terried when I found out the street it was on was known for prostitution. Due to the cost of hotels in London, I didn't think we would have enough money to book another hotel. I was scared enough about it that I contacted londontown.com asking them about the neighborhood. They assured me that they had received no complaints. Now about the hotel. First, one must check-in at another hotel around the corner. That is also where breakfast is served. We checked in early around 10:30 a.m. and our room was ready. We walked with 5 pieces of luggage for 2 people from the train station without any problem. It is about a ten minute walk and there is no need for a cab. We got a room on the ground floor which was great because I don't think they have an elevator. It is a very small hotel. The room was fine and even though we booked a double, it had a double bed and twin bed. The room was small (only the width of the three beds) but was suitable and clean. The breakfast consisted of toast and juice and I was only able to eat once due to time conflicts, oversleeping, etc. The neighborhood was okay. I did see police out one night when I came back late. My husband was waiting outside for me as they make you turn in the key every time you leave. The police told him to move along. I'm not sure what that was about. There did appear to be 2-3 prostitutes during our 5 night stay. However, we did not have any problems and I might be just overreacting. We never had any problem with anyone while walking or felt threatened in any way. I walked by myself early in the morning (5 a.m.) and late at night (11 p.m.) and didn't encounter any problems other than 1 begger. I was cautious and on guard but felt relatively safe. The hospital (St. Mary's Hospital) where Princes William and Harry were born is right near the hotel and station. There were several places to eat, fish and chips, American fast food (McDonalds, Burger King, KFC)and pubs. Paddington Station has several shops and even a Crispy Creme Doughnuts. Beware everything in London new is priced about the same in pounds as it is in dollars with the pound being about $2 during our stay. There was also an internet cafe near the station (1 pound = 30 minutes). We took one tour to Stonehenge and caught that at the Hilton by Paddington Station. The room did not have an alarm clock, but did have towels, a phone, television, soap and a coffee maker. The bathroom had a shower but no tub. A wake up call was available from the neighboring hotel. There were a soda machine in the lobby of the neighboring hotel and several brochures for attractions in London. Overall, for a budget hotel I found it acceptable and would not hestitate to stay again for the price. Our package deal from St. Louis for 5 nights and air was $608 each with taxes. For the money, I thought it was a good value. Would it be my first pick, no, but if you find a good package and this is your hotel choice, don't be afraid to try it. The Paddington Station is also very convenient with the Heathrow Express (google for 50% off coupons) and tube travel.", "Date": "April 29, 2007"}], "HotelInfo": {"Name": "White House Hotel", "HotelURL": "/ShowUserReviews-g186338-d581719-Reviews-White_House_Hotel-London_England.html", "Price": "$111 - $243*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">102 Sussex Gardens</span> | <span class=\"extended-address\">Paddington</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W21UH</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "581719", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/1d/e8/white-house-hotel-thumbnail.jpg"}}