{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Parsons, West Virginia", "Title": "“...pay no attention to the pampered-whiners...OV is cool!”", "Author": "Jim P", "ReviewID": "UR139636798", "Content": "..I've stayed here for years..n had a great time stayin here, 3rd week in August...its quite clean, quite basic...AC , TV, fridge, shower n bed are perfect..it is older, but well maintained...for gosh sake, its 100 ft from the beach n $100 a nite..!?..great poolside tiki bar, restaurants adjacent, even the coolest karaoke \"Sandbar\" across coastal hwy...lol....staff gets u anything u need...I really fail to see what people gripe about here, considering the age of the place & the awesome price..?? If you have any problems, talk to Sal or Sal,jr...they will take care of you...great folks!", "Date": "September 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Frostburg, Maryland", "Title": "“Mold, mildew, unexplained stains -- BYO Lysol”", "Author": "lily l", "ReviewID": "UR137210745", "Content": "This place was a horrible rip off! It wasn't bad enough that the rooms are so incredibly disgusting with the smell of mildew and carpet that always stays damp...but they nickle and dime you for e v e r y t h i n g -- $5 deposit for the key, $10 if you want to switch rooms to 'courtside' (ooo such a fancy view of the parking lot, what a luxary) -- they rent out the already limited parking spaces to people not even staying at the hotel for $10 so people paying over $180 for a crappy room now have to cross Coastal Highway to park their car. If you do luck out and get a parking space at the hotel the only ways to get in and out of the parking lot exits are raised up so be prepared to bottom out each time you come and go. We upgraded our room from a horrible mildew/cat urine smelling room to one that just smelled like mildew. There are signs stating NO REFUNDS so we didn't even try, but I bought two things of Lysol and sprayed the entire room down. There was also a sign in the bathroom that said they charge $10 if you do not keep your shower curtain on the inside of the shower. Our room had a bleached spot on the rug (but hey at least that spot was clean) beer bottle caps behind the nightstand but I guess we were lucky because another review on here said they found a used condom and unexplained brown stains on the 'clean' sheets. $180! And yeah, the irony that it is right across the street from the Hilton was not lost on us. UGH. Do not stay at this place if you value your respiratory health. DO NOT STAY HERE!!!", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“SCABIES!!!!”", "Author": "Disgustedinoc", "ReviewID": "UR136944484", "Content": "This place is absolutely disgusting. I stayed previously at the princess royale but we were on a tight budget this trip and decided to stay at ocean voyager- even though it was still around 180 per night, it was still less than princess royale. When you walk into the room you are blasted by the horrible stench of mildew, walk through the room and the curtains have blood stains on them, the bed spreads ripped, small dirty refrigerator, MOLDYYYYYY shower curtain and hair stuck in the towels. The air conditioner was full of dust and makes awful sounds when turned on. The street and other patrons were the least of our worries. Please understand that I have seen some pretty nasty motels before but I went two weeks ago and now, i have \"tunnel\" marks from scabies on my arm. I have not yet verified from my doctor that this is indeed scabies but i am almost 100% sure based on pictures ive seen of them. The cleanliness in this motel was farrrrrr below expectations and although it seems to be a party motel and high school seniors tend to stay there, it is disgusting for even the lowest of low lives i am sure! If you want diseases or bugs, go to ocean voyager. If you want a clean, nice place, opt for paying a little extra and staying somewhere like princess royale which is up a bit further or paying a lot more and staying somewhere between 2-20 sts. At ocean voyager, you get far less than what you paid for and they hassle you wheb you request anything in reference to changing room or even just to get some clean towels. Horrible place!", "Date": "August 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Do Not Stay Here!!”", "Author": "John D", "ReviewID": "UR135911050", "Content": "Horrible, disgusting, musty, rude manager, are just a few adjectives to describe this place. The beds felt like a slab of concrete. The cinder block walls give it a nice cozy prison cell feeling. I wouldn't board my dog in this hotel. We had to leave after the first night due to a family emergency. We were denied a refund for the additional two nights. When we requested a refund the manager was rude and aggorant to say the least . He denied us the contact information to his supervisor. He called the police on us after we said we are not leaving until we speak to his supervisor. Please do yourself a favor and do not book this hotel!! You're better off sleeping on the beach!", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bedford, Pennsylvania", "Title": "“Very Surprised!!”", "Author": "jbakerinc", "ReviewID": "UR134512872", "Content": "Well lets just say I have been here before..... I told my friend when looking for a hotel \"Anywhere BUT The Ocean Voyager\".. It must have been an confusing statement when he tells me I booked the OV. Well, needless to say i was slightly worried about our stay before it had even began. We showed up early and the front attendant was very nice and eager to help us. They let us check in early which was awesome to we could get right to the beach. Went to the room and was pleasantly surprised to find a clean room. I honestly couldn't believe this was the same motel. I was expecting the worst.. It was a general average room. No frills. Does the job. Overall staff was very nice and friendly. We also ate at the Pirates Den which is connected to the motel. Food was delicious. Talked to the new ownership and told him about my request about not staying there... and how I was wrong. If you are looking for a decent room at OC lowest price, look no further. Here it is. Good Job Ocean Voyager. You have impressed me.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Baltimore, Md.", "Title": "“Depends on what you use a hotel room for.”", "Author": "3624", "ReviewID": "UR133009317", "Content": "The room is plain-with just the basics-TV, etc. I have stayed here three times. What I like about it is it is cheap. When I go to the beach-I do just that-I spend all day at the beach and/or going out. I use the shower and I use the bed to sleep but I am hardly ever in the room! So for me-this hotel serves it function. If you are a hotel room dweller and like to hang out in the room-look elsewear. If you expected the four seasons paying as little as you did-then I am sorry you are naiive. You DO get what you pay for. If you want a luxurious room thats visually pleasing-you have got to pay more-so if thats the cae-dont complain here on this site. The awesome thing about this place, which probably keeps me coming back is that it has a cute little tiki bar with rum runners etc. Its open pretty late too. Its also right next to a beer store and across from a burger king. And the beach is really nice and within a short walking distance. It doesnt get much better than that for me when it comes to a motels location. No it is not impressive but it gets the job done. If you want to have a five star experience-maybe you should shell out some more cash and stop complaining.", "Date": "June 29, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Disgusting”", "Author": "Slp240", "ReviewID": "UR130489902", "Content": "This place was absolutely the worst I've seen. Our room was so gross- moldy, dirty, smelly, etc. We had to wear shoes in the room because out feet were turning black with dirt. The only good things was the Tiki Bar & the fact that it was a block away from the beach. Please dont waste your time & money here!", "Date": "May 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ocean City, Maryland", "Title": "“Great Stay”", "Author": "A W", "ReviewID": "UR130343330", "Content": "So after reading all the reviews of this motel I was nervous about walking into this room. I checked in 5/18-5/20 and honestly the room was no where near as bad as people have explained! I paid $100 a night during cruise week, which is an awesome rate! Mind you the motel is nothing like the Hilton across the street, but is also isn't as expenisive either! I had a clean room, and bathroom. No bugs, and I did check the bed sheets as well and they were just fine. Parking right outside the hotel is hard, but they have an additional parking lot that allows you to park. Overall I have no complaints and more than likely will stay here again in the future. Oh and if you have a problem with the traffic, don't stay on the main strip of the beach! Thats with any beach not just this one!", "Date": "May 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Maryland", "Title": "“Disgusting, Mildew, Nasty!”", "Author": "nbateman", "ReviewID": "UR122227339", "Content": "From the outside this place looks decent, nice pool and tiki bar. However, from the inside your room is a cement chamber of nasty! Two queen beds, stained comforter (wasn't planning on sleeping with it anyways, always bring my own bedding) Bathroom was absolutely disgusting with a mold covered shower curtain, water that came out of the faucet was orange at first, malfunctioning shower (knob to turn the water from the faucet to the shower shot off as I was turning it providing me with water shooting out of a hole in the wall!) No hand soap provided for the sink. Edges of the shower and the bathroom were disgusting and moldy. We were in a room facing coastal highway and the walls were paper thin, we could hear people yelling and cars/buses/motorcycles going by all night! Keep in mind that we are not picky, as long as a place is clean we're fine no matter how small or how cheap. But this was just not sanitary at all! I have never wished I went by the majority of the reviews so bad!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Cockroaches, Bugs, and dirt, oh my!”", "Author": "dotnbri1", "ReviewID": "UR117563074", "Content": "Our son and his girlfriend stayed here in August and returned with bites all over them. They woke up itching. There were roaches visible on the floor in the morning. I would recommend that you stay somewhere else.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bel Air, Maryland", "Title": "“NASTY! MOLD AND MILDEW!!”", "Author": "Amie L", "ReviewID": "UR117055724", "Content": "This motel needs to be demolished. As I walked into the \"Lobby\" I was hit with a rancid mold, musty, mildew smell. I then see a sign on the wall that says Positively No Refunds! and I knew right away what I was in for. However, I was trying to be optimistic since there was a sticker on the door that said \"Trip Advisor 2011.\" What a joke! Upon check in, the clerk behind the counter knew my name before I even told them who I was. Obviously that was because they had no other reservations for the night. At that point I became terrified. When we walked into our room, the smell was even worse. Mold and Mildew was an understatement. Needless to say, my daughter has Asthma and there was no way we could stay there. They offered another room, but that wasn't any better, so we left and went to another hotel. DISGUSTING!!!", "Date": "August 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What did you all expect for $130 a night? It's not the Ritz for Christ's sake!”", "Author": "JGAMMAMILL", "ReviewID": "UR116828399", "Content": "If you want a cheap place to stay, then the Voyager serves it's purpose. I've stayed there twice, and I've been pleased with everything. Look I know the place sucks, but I like places like that. They have character, and are likely to give you a few wild stories to tell. I find it funny, that so many people are dissatisfied with their stay. It's not all bad. Their pool is awesome, their resturaunt food is great, and their tiki bar drinks are cheap. I've never experienced bed bugs or mold. The place is just old. A time capsule from the early 80's. I love how this crappy little motel lies right in the shadow of the huge, luxurious Hilton Hotel right across the street. What perfect irony? Stay at the Voyager. It's so wonderfully bad.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Absolutely disgusting”", "Author": "Jlee0000", "ReviewID": "UR116773408", "Content": "Absolutely disgusting. I usually don't write reviews but this time it's a must. Only because I would like to save people from wasting their money. We reserved this room because it was the only place left. And I can see why. Everything about this place is wrong. Parking was ridiculous. Once we walked into the 'lobby' to check in, the front desk clerks were very despondent and you can tell they hated their jobs. We got to our room and I could not believe what we walked into. Carpet was thin and wearing. The beds looked dirty and pretty much looked like cardboard boxes. But the thing that made me want to leave at that moment in time was the stench. The smell of mildew and mold was indescribable. I can still smell it if i think about it. I had to wash my entire suitcase of clothes because it left a horrible smell embedded on everything present in that room. I had to wash my hair multiple times once I returned in order to finally get the stink off of me. I can usually handle staying almost anywhere but this was beyond my lowest of expectations.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Philadelphia", "Title": "“Think twice about staying here”", "Author": "guinn777", "ReviewID": "UR116112068", "Content": "All of the reviews are accurate. Bugs, Hair on the towells, rips and stains on the bedspreads, rooms smell horrible. Oh yeah, if you really want to be grossed out, open the filter on the airconditioner; ours had an inch of dust caked on. If you want to extend your vacation and need a place to crash - maybe I would recommend staying here to use the bathroom and get changed. How this motel hasn't been shut down is beyond me. The carpets on the decks and steps haven't been changed in years - they are dry rotted. The balconies and steps are rotted underneath the carpets. Surprisingly, the pool and outside bar were very clean and cute looking. This is not a hotel I would recommend to stay at for a luxurious vacation or a family vacation. If you can't afford anything better, than maybe check it out first. My experience was; all of these reviews were accurate.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“never again.”", "Author": "swaggtastic", "ReviewID": "UR115740337", "Content": "I don't know what was worse about the first 10 minutes of this motel experience. The musty smell so bad i got a headache in the lobby, or the vomit i had to step over to get to my room. Or maybe it was the smell of mold in the room that hit me in the face so hard i swear it left a mark. Then there was the questionable stain on the obviously unwashed comforter on the wooden box, i mean bed. I opened the curtains to enjoy the view...created a dust cloud and had to wash my hands. Wore my shoes in the shower because, well, it just looked unsanitary. But we made the best of it...that is, until the air conditioner broke in the 120 degree weather. They wouldn't so anything about, swtch our room, or refund any money. The maintenance man had every reason possible why it was broken. They said it was because 'there was a heat wave'. Went to talk to the guy at the desk who said our door was open the whole night before and there were men \"crying and carrying on\" outside our room. A) We weren't even in our room during the times he's referring to B) I'm not sure what that has to do with the air conditioner being broken the next day. Had to complain for 5 hours and threaten to call the cops before they would change the room. Got a new room, along with a new questionable stain. This room had air condtioning but no hot water. Naturally, the maintenance guy had a very logical explanation for this as well. Apparently, a lot of people were in the shower because they were getting ready to go out to dinner. So after 3 days of staring longingly at the Hilton, we checked out a night early and came home. With sore throats from the must and mold. I wouldn't stay at this motel again if the prophet Abraham told me to.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Never Again”", "Author": "Caroline_Fisher", "ReviewID": "UR114625512", "Content": "User Rating: 1 out of 5 stars by Scout 06/19/2011 This place is fine if you are looking for a place to party. I would not recommend anyone with a family, taste, or standards to stay here. We stayed here during Senior Week, but we're closer to senior citizens than high school seniors. I guess that is why I have so many complaints. There was constant noise from the bar below our room and the traffic right outside our door. I requested to have my room moved and the night jerk, I mean clerk, refused and said I had to \"understand his position,\" meaning he wasn't willing to do any work and did not understand the concept of customer service. The floors, decor, beds, AC, and TV were from the 80s and in pretty bad shape. Pack your own hair dryer, iron, and blankets because the room does not include these items. On the plus side, the room was sort of clean, and the maid left clean towels, although she didn't make up the beds. Also, the pool looked nice. We saw it through a locked gate. It was closed for repairs on our stay. The walk to the ocean is close and there are lots of restaurants close by, which is good because there isn't enough parking at the motel's lot so it's best to walk and leave your car in the space near the actual motel if you're lucky enough to get one. (There is, however, another lot across Coatal Highway that is part of their parking pass.) Also, it is extremely difficult to turn into their lot from the main road. It took us 3 tries before we figured out that you have to go through the Hilton's parking lot ( where we'll probably stay next time) to make a Y turn to the side street where Ocean Voyager is located. Like I said, this place is fine if you're looking for an all-night party place and have no expectations of customer service, soft beds, or solid floors.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new york", "Title": "“good deal for the money”", "Author": "MedicalMomNYC", "ReviewID": "UR84886720", "Content": "Second time here. We come to OC for the sun and fun. No frills kind of place. Our room was clean and the staff helpfull and friendly. Check In was easy. Beach across the street. Pool exceptionally clean and Tiki bar fun. If you want a place where you won't be spending alot of $$ or your whole stay in your room, this is just fine.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Branchburg", "Title": "“BEYOND DISCUSTING”", "Author": "namastebodily", "ReviewID": "UR73591436", "Content": "1. My boyfriend and I are from New Jersey. We booked our two night stay at the Ocean Voyager in hopes for a nice relaxing short get-a-way. 2. Excited about our vacation, we arrive early. Check in is not until 3:00pm, in order to give the staff ample time to \"clean\". (Please note, the work CLEAN is in quotes). We pay for our two night stay while there. 3. We come back at 3 to check in. We are given the key to our room. Now, we know that we have not spent $500 a night to stay at the Hilton, but for $120 a night, we've spent enough. 4. We walk in to our room. The smell of MOLD is so incredibly pungent, it immediately hits us, and we both look at each other with disgust. We walk back down to the office to request a room change. 5. After stating the simple fact of the room we were given was absolutely being overrun by toxic mold, we were given the key to another room. 6. We enter our second room.... faint smell of mold, but nothing like the first room. We agree to stay. My boyfriend and I go out to the beach, come back to the room. We decide to get ready and then go out for dinner. He showers first. While I am laying on the bed, I begin to get severely congested. I have allergies, but, did not realize that one can be super allergic to MOLD. 7. He exits the bathroom, and tells me that the shower is absolutely FILTHY, and the shower curtain is covered in 3 MONTHS WORTH OF MOLD. At this point, thinking that maybe the steam from the hot shower might help my congestion, I enter the shower. 8. I exit the shower, get my camera, and take pictures of this BEYOND DISCUSTING shower curtain. No wonder I'm totally congested, I've checked into the BATES MOTEL. 9. While I get dressed my boyfriend goes downstairs to complain about the cleanliness and requests to speak with the manager. 10. Go figure the manager \"doesn't have a set schedule, and wont be in tonight\". 11. The very unhelpful kid at the desk finally aggress to come to the room to look at the shower curtain. He too, disgusted at the fact that the establishment which he works could possibly charge anyone a penny to stay in a toxic mold filled room, takes the curtain with him, and says it will be changed. 12. At this point, we are turned off, I can't breathe, and need to leave the room. 13. We take all of our stuff out of the room, put it in the car, and start our search for a new hotel to stay during our vacation. 14. The Ocean Voyage agrees to refund our money for the next nights stay, even though there is a GIGANTIC sign on the wall that reads NO REFUNDS. (Yes, while even I am blonde, this should have been our first tip-off to the kind of quality this establishment is offering.... why the need for the GIGANTIC NO REFUNDS sign?) 15. Thankfully we did end up ealking down the street to the Executive Motel, and met the most wonderful woman in the world - - Miss Jeannie - - This woman is so wonderful, she makes Mother Teresa look slightly awkward... I mean put her in your pocket and carry you around everywhere adorable! Congested, and dejected, she looks at us and before we can even say a word she says, \"Ocean Voyager? We get them all the time.\" She proceeds to tell us horror stories which include the likes of mold, and mice poop in beds.... 16. We rent a room from Miss Jeannie. 17. The next day we go back to the Ocean Voyager to explain that we couldn't even bring ourselves to stay in the room one night and we'd like a refund for night #1 as well. We are told, by the same, unhelpful kid at the desk that the manager will be in somewhere between \"10 and 12\". Nice schedule huh? Wonder what this guys gets paid.... 18. We finally meet up with the manager. Judging by the gold chain around his neck, hes not just in the hotel business. 19. After explaining our case, very diplomatically, we are refused our money back. 20. We then tell him that we are going to contact our lawyer, present our case, including the pictures of mold, and wanted his name, and the name of his partner. 21. He takes a Ocean Voyager pamphlet off the table, turns it over, writes \"SAL .... JOE\" on the back, and slides it towards us, as if we were agreeing upon ransom. After looking at the pamphlet my boyfriend states, \"SAL AND JOE? THATS IT, NO LAST NAMES?\" Sal responds, \"NOPE, NO LAST NAMES.\" 22. CLASSY. 23. Please do yourself a favor and do not stay at this motel. Please spread the word that a filthy establishment such as this should not be allowed to swindle people out of their hard earned money, and operate the way it does.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Clean and Friendly!”", "Author": "cxreilly", "ReviewID": "UR68210925", "Content": "My friends and I booked a weekend getaway here without reading the reviews until the day we were leaving. After reading the reviews for this motel, I was dreading staying here for the weekend. Once we checked in, it wasn't as bad as the reviews made it out to be. Don't get me wrong, it's not the Taj Mahal, but definitely and ok place to stay. The room was clean, has a nice pool, a quant little cafe with friendly service and delicious food, VERY close to Jolly Roger Amusement Park and an awesome karaoke bar. It's within walking distance to many different bars, restaurants, shops, and of course the beach!", "Date": "June 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“For the price and location, I definitely would stay again!!!”", "Author": "ok28", "ReviewID": "UR68209254", "Content": "Let me start off by saying this was a last minute reservation for my three friends and I. So we decided to read the reviews of the motel the day before we were supposed to check in and needless to say we were HORRIFIED! We read about bed bugs, sunken in floors, horrible service and everything else, but it was to late we really couldn't back out, nor did we feel like trying to find another room. So when we arrived we were armed with sanitizer and a black light a mutual friend let us borrow. When we opened the door we were quite suprised, clean sheets, ok size fridge, the bathroom was spotless, and the floor was not sunken in!! The pool area was really nice, tiki bar and onsite restuarant where we had a tasteful and cheap breakfast poolside, not to mention a nice wait staff. The location was great, resturants, liquor stores, amusement park, and the best Karaoke Bar I ever went to were all within walking distance!! The one down side was there were flies in the room that were annoying but did not ruin our stay. To sum it up if you are looking to shower and sleep long enough to get sober again this is the place to go. I would definitely stay again!!!!!!!", "Date": "June 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Hagerstown, Maryland", "Title": "“disgusting, and trashy”", "Author": "cwetzel1979", "ReviewID": "UR67531648", "Content": "My family stayed this and it was awful, the rooms was disgusting the floors had holes under the carpet and when u stepped on it u sunk in spots, the floor u had to wear shoes the whole time it was filthy.. one sat night my husband walked to the end of the bottom floor and when he did these kids had the room door open and they was smoking marijuana, someone busted out a window on the street side when my sister was standing right there and didnt care we reported all this all all they could say was \"sorry\" they would let us get any of our money back so we could go somewhre else to stay with our children. about 2am someone came by the room and kicked our door . it was a awful place i will never return therer with my family..i normally dont complain like this but i feel that it should be known....", "Date": "June 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "downingtown, pa", "Title": "“They robbed us and would not offer refunds”", "Author": "dana8290", "ReviewID": "UR47331711", "Content": "Some friends and I reserved a room for labor day weekend, first night was ok, not the cleanest hotel, but it would do. The second night we return to our room to find our iPods were stollen as well as cash. When we went to the front desk to check out early because we feared for our safety, the manager assured us no one was in our room except the \"other manager\". When we questioned why anyone was in our room while we weren't there he had no answer. We were checking out 2 days early and we wanted a refund for the nights we wouldn't be staying. The manager told us the do not give refunds and that if we felt \"unsafe\" that was not his problem. Great way to run a business right?!", "Date": "October 20, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "central pa", "Title": "“Outside of the rooms stink!”", "Author": "Brianaerin", "ReviewID": "UR38502580", "Content": "We recently stayed across the street at the Hilton and would walk by the rooms and would just a very strong odor. We watched them get ready for the season by airing out all the rooms. The pool did not have any water but it did hold some trash!", "Date": "August 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Maryland", "Title": "“Disgusting Dump”", "Author": "eco1103a", "ReviewID": "UR33975633", "Content": "Do not book this hotel. My fiance and I decided to stay one more night in Ocean City but the hotel we were in was booked up for the following evening. We booked Ocean Voyager, BIG MISTAKE. The room was a filthy dump, disgusting, the carpet felt strange, like the carpet pad (underneath) had molded, the beds smell and had plastic coverings. There were nonstop parties all night, drunks yelling about how they were going to get weed to smoke. The OCPD should come down here to catch some criminals. I felt like I had walked into the ghetto when I saw the hotel room.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Virginia", "Title": "“Horrible bed bugs! Do not stay here!!”", "Author": "OCRegular", "ReviewID": "UR30909068", "Content": "Do not stay here!!! We contracted horrible bed bugs and were bitten all over! We had to call the police just to get the guy to give only a 50% refund after we only stayed there 3 hours! There was no reachable manager overnight so the kid had to risk his job just to give us a partial refund. Awful place!", "Date": "May 27, 2009"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cleveland, OH", "Title": "“End of the line”", "Author": "Nancyjm", "ReviewID": "UR20381445", "Content": "We were just there last weekend, last minute, and it was one of the only places with a room available during Sunfest. We paid $65 for our room. The bed had a thin sheet and plastic covered mattress that felt like we were sleeping in a baby crib. The spread was dirty and there were stains on the walls, paint chipping, and some tile missing in the bath. Our first night the bathroom was clean. We stayed a second night but in a different room. I don't think the bathroom had been cleaned as there was hair in the shower. Maybe because it was the end of the season they didn't care. But for $65 you probably can't beat it. We had a lot of fun anyway and didn't let it spoil our trip. I didn't see any bugs, so that was a plus! Front desk people were friendly and helpful.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Year 2 - Review Update”", "Author": "oldestbiker", "ReviewID": "UR8753221", "Content": "I visited this motel last year for Delmarva Bike Week and wrote an honest review. It was quite negative as far as the hotel itself went. We returned this year and got the same room (we asked for it and hoped there would be no new surprises). But, we were pleasantly surprised that the room was fresh and had no funky smell and all of the bedding was fresh and recently laundered. The bathroom was old, but very clean. The shower curtain was new. Towels were changed daily, trash emptied and bathroom supplies re-supplied each day. Extra towels or other items were available for the asking from polite, accommodating, tolerant and friendly staff that were on site way into the early hours every night monitoring the nightlife and taking care of customers. OK, the facility itself is old--it's about as old as I am, so it's not all sparkly new and fancy like the towering (big-time name brand hotel) across the street. But, it was funny that, for the 5 days that we were there, the fancy hotel's windows were filled with people watching the fun that was abundent across the street at our motel. Maybe they were laughing at us...who knows? Who cares? I'll take the Ocean Voyager again any day. If it's quiet and fancy comfort with lots of ammenities that you want, or a place where the kids can crawl all over the carpet, go rent a vacation house in the woods. Heck, go to the (big-time name brand hotel)! If it's a business conference that you are attending, get a fancy place where you can hook up your laptop and work. This place is a get away--a place to just have fun and relax. It's not a place where you hang in your room all day. The staff here are nice, hard-working friendly people that are trying to provide clean, budget oriented lodging for those people who are in OC to enjoy themselves and relax. I sure would rather spend money on fun and sightseeing and shopping than the place where I sleep. Come with an open mind, enjoy the Tiki bar, the beach and ocean, the incredible deli across the street at Anthony's, the wonderful Pirate's Den breakfast restaurant and the crystal clean pool. If you're a worry freak, and it makes you more comfortable, bring your own sheets and pillows. I even brought an air freshener in case it was needed (it was not). We do, but we do this whenever we travel. Oh, like one review said, the TV doesn't have a remote. Get over it! Who watches TV on vacation anyway? We'll be back. BTW, the hotel was sold out for bike weekend, so it's not all that bad. We book early in the winter for this week in September. See you next year!", "Date": "September 18, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Location": "2", "Value": "1"}, "AuthorLocation": "maryland", "Title": "“almost ruined our weekend”", "Author": "bufffy", "ReviewID": "UR8739321", "Content": "When we arrived we paid before looking at the room, big mistake. I have been going to Ocean city all my life and thought that this was a nice city to visit. This hotel needs to be shut down and restored. The room smelled of a funky oder that I cant even descibe. The floors and carpet were disgusting,bed covers looked okay on top but when you rolled the bed down they were all stained underneath. The floors and carpet were so bad I did not want to go barefoot. I took all my own cleaning products thinking that I would have a nice clean place to stay. I thought I would have maid service for 110.00 dollars a night to vacume and change beds, the maid never arrived. We left the room because we could not stand the smell and did not sleep all night because the room they put us in was facing ocean hyw.,the cars and motorcycles were extremly loud all night long. I would not recommend anyone stay here until they make improvements. I lost $220.00 because we had to leave early and they would not refund us our money. Again look at room before you pay!!!!!!!!", "Date": "September 17, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Elkridge, Md", "Title": "“Crappiest place in the world!!”", "Author": "lissa0726", "ReviewID": "UR7752906", "Content": "This place was terrible. The room had the grossest smell of mildew that never went away. The carpet was always moist. The beds were hard and had a permanent dip in the middle and the sheets were stained. No one came to clean the rooms while we were there all weekend. We came in the room and there were about 20 flies that lived in the room all weekend. It was disgusting. There was a patched up hole in the bathroom on the ceiling and once the steam from the shower hit it, it started falling. Don't forget your slippers because you won't want your bare feet to touch any of the floors here. And like someone said, the stairs are very slippery when wet. It says \"no noise after 10:00\" but people were partying LOUD until at least 5 am every night. The only thing I enjoyed here was the pool bar and the wonderful bartender named Dave!", "Date": "June 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Worton, MD", "Title": "“Not the best but not the Worst either”", "Author": "Shanins", "ReviewID": "UR5574104", "Content": "My boyfriend and I just recently stayed at the Ocean Voyager. It's not the best place to stay, but for the price you really couldnt beat it. There were a couple down falls to the place, one the room smelt like mold, luckly we had some downy dryer sheets with us and we stuck them in the air conditioner to air out the room. Secondly, we were told that it was a three night minimum, however as we were leaving we were looking at everyones parking passes in thier window and some were for only one or two nights. We had originally wanted to stay only two nights, but because of what were told we booked for three nights. I was not too happy when I saw these parking permits. And thirdly, if you get a parking spot in the motels parking lot, dont leave! Take the bus EVERYWHERE. When you get back you wont be able to find a parking spot. Defintely not enough parking. The staff was very friendly, and the rooms were spacious. We had a good time, but I dont think we would stay here again.", "Date": "August 7, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Baltimore", "Title": "“Really bad!!”", "Author": "RavynBob", "ReviewID": "UR5503825", "Content": "My husband and I go to O.C. all the time! This place was moldy, I woke up with terrible allergies, the pillows were covered with vinyl and so were the beds, and they all had such a wretched smell, we wanted to leave as soon as we arrived! But there was no manager on duty from 6:00 p.m. on friday night! to 11:00 a.m. on Saturday morning! In peek season! this was an aweful experience!", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Cheap & Clean”", "Author": "A TripAdvisor Member", "ReviewID": "UR5286872", "Content": "If your looking to go to OC to have a good time and not spend a lot of money on a room this is the place to be. It is by no means the Princess Royale but it's a great place to sleep and it didn't have roaches crawling around or anything. I wouldn't recommend it for families because it's just not that kind of place. It's the kind of place that when you get back from the bars and clubs at 3AM your neighbors are NOT calling down to the office to complain because they are doing the same thing. And the location is fine. You just hop on the bus ($2.00 to ride all day until 6AM) to get where you want to go. I would definitely stay there again.", "Date": "May 31, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“i love the OV :)”", "Author": "A TripAdvisor Member", "ReviewID": "UR5023666", "Content": "I love the ocean voyager. Props to them!!!", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“This place is a Dump!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4399102", "Content": "Worst place ever. The staff sucks, pool area sucks, loacation stinks, rooms are horrible.....Blahh blahhhh. I will never go back to this place again. This year we are going to stay at Park Place on 2nd and 3rd street on the boardwalk. I suggest staying between 2nd and 15th street. See ya!", "Date": "January 30, 2006"}], "HotelInfo": {"Name": "Ocean Voyager Motel", "HotelURL": "/ShowUserReviews-g41298-d581931-Reviews-Ocean_Voyager_Motel-Ocean_City_Maryland.html", "Price": "$70 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3201 Baltimore Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "581931", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3c/64/dc/cement-chamber-of-nasty.jpg"}}