{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Excellent value”", "Author": "Jenmaryb", "ReviewID": "UR128499181", "Content": "We booked this hotel along with flights organized by lowcostholidays.com and paid £420 for 2 people, flights, 3 nights b and b. We selected this hotel from reviews on TripAdvisor and were not disappointed. As advised, we asked for a street facing room (there aren't that many per floor) on a higher floor. I found I needed my ear plugs to sleep with the window open (there is aircon but I preferred not to use it); the room itself was quite large enough, and equipped with all necessities. Breakfast was perfectly adequate and a reasonable selection of food. The proximity of the hotel to Poble Sec and Placa Espanya meant that travelling around Barcelona, as well as to and from the airport via Aerobus, was easy and convenient. The staff on reception were really helpful, especially the young lady who checked us in. I would not hesitate to recommend this hotel to anyone.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brighton, England, United Kingdom", "Title": "“Great cheap hotel”", "Author": "lthomas87", "ReviewID": "UR127403429", "Content": "We chose this hotel as it seemed fairly middle ground to everywhere we wanted to visit in Barcelona, had good reviews on trip advisor and seemed fairly cheap. We were very happy with our room, relatively large, double bed, plenty of wardrobe space and a nice bathroom. The staff were very friendly and helpful. We weren’t fussed about a view, however if possible ask for a street facing room as our window looked out onto a courtyard where you couldn’t tell what the weather was doing for the day. However, apart from that a very enjoyable stay.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Great Location But Quite Average Hotel”", "Author": "Davew78", "ReviewID": "UR126969364", "Content": "I stayed at the Evenia Rocafort hotel at the end of March and chose it as it was close to the start line of the Barcelona Marathon and was quite reasonably priced. In general the hotel was quite average. Check-in took a while as this is only ever manned by one person. The rooms were very compact, kind of everything was there, but was very tightly packed in. Air conditioning was installed, but as it's not summer in Barcelona it was only set to pump out heat, there was no way for them to turn it on to cool, the hotel didn't seem to understand that because I'm from the UK, Barcelona in March is actually quite warm. The rooms in general were clean, but the top sheet on the bed looked quite old and grubby. The fresh towels everyday had a pretty bad smell and the bathroom could do with a little bit of updating. I only had breakfast in the hotel on one morning, but was without doubt the worst breakfast I've ever had, the breads were dry and stale (and the selection was extremely small - most items had run out), there was no orange juice in the machine. The selection of meats and cooked options were very poor. If you want a cheap hotel that's in a pretty good location, it's still a good option, just don't set expectations very high and you won't be disappointed.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chippenham, United Kingdom", "Title": "“Excellent Hotel”", "Author": "Brian H", "ReviewID": "UR126132945", "Content": "Just had a four night stay at the Evenia Rocafort. The room was very comfortable, although not large. The beds were very much to our liking as they were very firm. The bathroom was excellent. Staff were friendly and helpful and the breakfast buffet was very good. The hotel is well located, being very close to 2 metro stations and within a 10 minute walk to Placa D'Espanya (Big shopping centre and lots of places to eat). We found it quick and easy to get wherever we wanted to go.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Bucuresti, Romania", "Title": "“Great hotel!!”", "Author": "Ana C", "ReviewID": "UR123549579", "Content": "Great hotel!! The rooms weren't really big, but 3, 17 year old girls had enough space. Also, I really loved the bathroom. At the reception we had 2 computers,which we could use anytime for free. I appreciated this because other hotels make you pay to use the internet. The hotel is situated in a nice area, near 2 subway stations. We had supermarkets only 2-3 min away from the hotel and a cheap grocery store just around the corner. The breakfast was great! I totally recommend this hotel. Enjoy your stay!!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Excellent three star hotel”", "Author": "Dukaat", "ReviewID": "UR123172340", "Content": "I have just spent three nights at the Evenia Rocafort.All of the staff were friendly and helpful. I found the quality of the hotel to be very similar to that of many four star establishments in Barcelona, which I have previously stayed in. The room was comfortable and very clean. The room allocated was overlooking an internal light-well, and was very quiet. Breakfast was adequate, the usual continental selection of breads, pastries, fruit and yoghurt. There was also a small selection of hot food. The location was ideal for visiting the fairgrounds and the Olympic village. It was approximately 20 minuted walk to Plaza Catalunya and Las Ramblas. I would highly recommend this hotel", "Date": "January 16, 2012"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Bed bugs swarmed our room!”", "Author": "bethanyshondark", "ReviewID": "UR122409436", "Content": "The hotel was nice enough, in a good enough location, until our second night when we discovered bed bugs swarming the entire room. They had gotten into our suitcase and were all over the bed and pillows. We went down to complain when we discovered them at midnight and the front desk guy shrugged and told us they were just in our room. I asked him how they appeared on the third floor in a corner room and he just smiled. Disgusting, we moved hotels to the Plaza a few blocks down, only 70 Euro for the night, clean and comfortable.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brescia, Italy", "Title": "“A nice and confortable place to stay”", "Author": "Sergio F", "ReviewID": "UR121330701", "Content": "I came in Barcelona to do some touring and to visit a friend,and after reading the positive reviews about this Hotel i booked a room for three nights.The hotel location is very good,far from the night noise of the ramblas but still at a short travel time from most of the city attractions in a neighbourough with all the needed shops in vicinity.The poble sec metro station is just around the corner and the train will take you to Plaça Cataluña in less than 10 minutes,reaching Plaça d'España is a 10 minutes walk.The room and the bathroom were clean and so the linen and towels.The bed mattress are firm but as i have some back problems they were just right,i slept tight.The only glitch i found was the size of the bed,i am 1,85m tall and luckily i booked a double bed,the bed was short so i slept like the DaVinci vitruvian man and all was fine but if you have a partner you better be sure that you want to stay very close... Summing it up,the services at Evenia Rocafort were good in absolute terms and great for the price paid.I'll definitely check in again for my next trip in Barcelona.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Cozy little hotel”", "Author": "aquauomo", "ReviewID": "UR120688396", "Content": "I was there for 7 nights. Great location, steps to Placa d'Spanya and Catalunia. Lovely neighborhood, nice people smiling at you, everything you need is around. Close to The market and withing walking distance to historical center. Very good and friendly staff, they will accommodate you the best of their abilities. Nothing is too much to ask. They can get you tickets to Barcelona's game, maps and info, they didnt even charged for a late check out. Excellent maids and waitresses. Breakfast is great and the hotel very clean and quiet. I booked through Venere and was very pleased with the price and service. If I ever go back that is the place I will crash. Hasta luego!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Spring Hill, FL", "Title": "“Pleasant four-night stay at Evenia Rocafort”", "Author": "mimiccr", "ReviewID": "UR120590300", "Content": "Mature couple stayed 4 nights at Evenia Rocafort Hotel, Tuesday through Friday. We found it very convenient for the aerobus from BCN, letting us off at Plaza Espania, then crossing the large plaza and walking 3 blocks down Mistral Avenue, turning right on Rocafort, and hotel is in middle of block. We arrived rather early, around 10:30, but could not check in until 12:30, so we had breakfast at small cafe around the corner. Our room was on 6th floor and opened to large air shaft/courtyard in the middle of the hotel, which meant it was very quiet at night. The room was small but had a very nice large bathroom with wonderful shower. Our bed was 2 twins pushed together, making a king-size. The beds were very hard, but we slept pretty well. The Evenia Rocafort is very convenient for the metro and is closest to the Poble Sec station. I highly recommend this hotel if you are on a budget. I booked the room through fastbooking.com and got a rate of 276 Euro for all for nights, which I thought was a bargain. The hotel is also very close to the Magic Fountains and Las Arenas (the bull ring converted to 5-story shopping mall. If we return to Barcelona we would definitely stay in this hotel again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Matan, Israel", "Title": "“Great hotel!”", "Author": "Sigal A", "ReviewID": "UR120502379", "Content": "We stayed at the hotel for 4 nights. It was very comfortable and close to the center. Just 5 minutes from pl Espania.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "orlando", "Title": "“Not quite up to par”", "Author": "EmEs", "ReviewID": "UR120237598", "Content": "Although there are many good reviews of this hotel, I didn't find it that good. It was only fair in my book. The room is very small, the bathroom is all right, but the sink is metal and always looks dirty. Ugh. The walls were so thin that you could hear someone sneeze and take a shower. Ugh, again. There is no bar, or nice place to sit in the lobby. Look elsewhere, I would not recommend this place to anyone.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“Holiday trip”", "Author": "AdrianAbraham", "ReviewID": "UR119541318", "Content": "We went for a week-end trip to Barcelona and we were suppose to check in at Hotel Silken Concordia, but since they overbooked, we were transferred to Hotel Evenia Rocafort. A very good thing about the hotel was that is very accessible, just 5 min walk from Placa Espanya. The staff is polite and helpful, at breakfast you are served with good food, although not a lot of choices. I especially liked lights in the breakfast room, with spoons in front of every light bulb. The room was quite small, just enough room for the bed (very small for a couple) and a desk; the TV was rather small, TV signal pretty bad and a very poor choice of channels (OK we are in a trip so it's not that important).. What I liked most was I the bathroom - the shower floor was from some kind of natural stone, which looked very good and had nice adherence. This was the first time I ever saw this floor in a hotel bath. Another thing I didn't liked was the view from the window, which led into some courtyard, not a very pretty sight. Overall, I won't mind spending another time at this hotel, but in a better room.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Good quality, friendly, inexpensive hotel”", "Author": "DavidDundonald", "ReviewID": "UR119540922", "Content": "Stayed here in a three bedroom room with my two kids. The price was excellent, the staff friendly and informative.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Good experience.”", "Author": "Dollyfish", "ReviewID": "UR118949198", "Content": "We stayed one night after a cruise at this hotel because it was recommended to us. The location is not bad, a bit far from the city center, but in reasonable walking distance to a plaza where buses to everywhere in the city can be found. We took the hop-on-hop-off bus to see the sights, and enjoyed it very much. We felt very safe in the neighborhood and everywhere we went. We did not notice the pick pockets we were warned about, but I am sure they exist. The hotel rooms are very adequate, bathroom is modern and everything is spotlessly clean. The breakfast buffet was fine, but it got really busy at one point so we were glad we got there early. Complimentary internet access in the lobby and quite pleasant staff that spoke English well and were ready to help us. I would definitely consider staying there again if in Barcelona, but might look for another place to stay closer to La Ramblas just for variety.", "Date": "October 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Good location, great staff, clean and efficient”", "Author": "BASWIMMER", "ReviewID": "UR117825986", "Content": "The hotel is in a quiet residency neighborhood, but is only a few minutes on foot to Placa D'Espanya, where you can catch buses to just about everywhere in Barcelona (including the airport) and where a climb to the wonderful Montjuic starts. The Barcelona Sants train station is another 10 minutes on foot. The room is small but functional and has a modern bath with a nice strong shower. The AC with thermostat works very well. If you bring a laptop, bring Internet cable as well. You get free WiFi in the lobby which also has two free Internet terminals. The front desk is very helpful. If you don't understand Spanish, however, the TV is rather useless. The room has a small refrigerator and a safe. It is summer and fruits are plentiful and very cheap. There are many fruit stores in the city. The one I like is just around the corner (turn left after exiting hotel and turn left at the corner). In addition to great sightseeing, Barcelona also has good beaches with free open showers to rinse off after a day at the beach. Another great beach area is found in Sitges, which is 45 minutes by train at a cost of about 6 euros round trip.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great location, good prices, nice service”", "Author": "val_cloutier", "ReviewID": "UR117640149", "Content": "We were staying 2 nights at Evenia Rocafort and enjoyed it. The room is beautiful and the bathroom, amazing. It is elegant, modern and big. The service we had at the front desk was really good and helpful. The hotel is near a metro station so you can go anywhere you want in Barcelona for less. The most complicated thing we had was to get out the aeroport to reach the bus station then find one for Plaza Di Spagna. I recommend this place for everyone who want a safe and not so expensive stay in Barcelona.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oradea, Romania", "Title": "“Very good hotel. I recommend it.”", "Author": "TudorH86", "ReviewID": "UR117504887", "Content": "This is an excellent hotel. The location is good, near two metro lines and some supermarkets. Pastry shop right across the street. Very clean rooms and helpful staff. I recommed a street-facing room as it is brighter and not that noisy. Also the bed is ok, not as hard as other comments suggest. Minibar fridge in the room, small tv, the air conditioning only works when you are in the room but that is in line with the eco-friendly Barcelona. Advice: If you stay here and plan to go to the beach, use the bus - bus 57 or 157 with stations on Paral.lel (right next to Poble Sec metro station) will take you right up to the beach as compared to changing two metros and then having a long walk from Barceloneta station. Also, do not sped the extra money to use the Airport Bus, use the normal bus for one theird of the price. I has enough room for large baggage and is also very fast as well.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice and clean 3 star hotel”", "Author": "Anja_Stockholm", "ReviewID": "UR117438085", "Content": "We stayed at Evenia Rocafort for a week during our visit to Barcelona. It was a pleasant stay, as the hotel was nice and clean, and the staff was very friendly and helpful. The location is good, in a sense that the area is safe and quiet. There are 2 metro stations nearby (Poble Sec and Rocafort), so it is very easy to get to other parts of Barcelona. The hotel is close to Place Espanya, where you can see a few landmarks and also catch a bus to the airport or a train to Montserrat. The hotel is, however, quite far away from the beach, main tourist attractions (like Ramblas, Gaudi houses etc.), so I would not recommend this hotel for a short stay. If you are short on time and want to see more of Barcelona, take something more central.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "bucuresti", "Title": "“Very good location to visit Barcelona”", "Author": "oanap", "ReviewID": "UR117327957", "Content": "We spent 6 nights at Evenia Rocafort during our holiday in Barcelona. The hotel is perfect located in order to reach all major attractions, either by metro or even by foot, very central but in a quite area. From the airport we took the Renfe bus that replaced the train those days for 3.15e to Sants station and then the metro 3 stations to Poble Sec (Manson exit, I think, is the closest) with the same ticket (available for 1 hour 30 minutes). What we did not like was the smell of urine in some parts of Barcelona, including some of the streets around the hotel. We stayed in a room at 6th floor with a view towards the street, preferably to a view in the inner yard (very dark). The side effect was that it’s not possible to sleep with window open because of the noise of the cars that collected the garbage in the morning (we used the AC as much as possible, but not during the entire night). The room overall was comfortable, spacious enough for 2 persons and quite luminous. There was, though, a bad odor when we returned and especially in the first day. The bad is very hard, which for some people may be an issue, for us was ok. The pillows are very narrow but you can always use the extra ones available in the wardrobe. The cleanliness of the room was reasonable (there were some parts on the desk with some dust in the first day and the wall paper stained by previous tourists). We did not appreciated at all the fact that we were given only one small soap daily and in the last 2 days not even this (we had to use shower gel instead). The best thing we highly appreciated in every evening after a full day of walking and in every morning to wake up was the high-pressure shower – one of the best! Also, some other small inconvenients were that you may use the free internet in your room but you must have a cable (they don’t have wireless), otherwise you must pay 4e for it; also the magnetic cards for the doors did not work too smoothly (at least for us and our neighbors). Overall, considering that for us the most important aspects are the accessible location, good price and reasonable facilities, the hotel is a good option for Barcelona and we would recommend this hotel.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Singapore", "Title": "“Clean room to just sleep and shower”", "Author": "Aries D", "ReviewID": "UR116706357", "Content": "We chose this place simply for its OK price and location knowing that we would not spend much time in the room as exploring the city was the whole idea of the trip. Although the location was not particularly center, yet it was manageable to walk a short distance to the stations which connects to most of the attractions. Not much to say about the room as it was just a standard room, just enough space for two people, yet it was clean. The front desk staff could have been more helpful and friendly, however we accept it as it was probably not in their culture to be hospitable even though they are working in the service industry. The communication was limited to what was necessary to be said, however I must say that they were quite efficient in their work.", "Date": "August 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Safe, clean hotel situated outside the hustle of Barcelona”", "Author": "emmadays", "ReviewID": "UR115904851", "Content": "My boyfriend and I stayed at Evenia Rocafort upon our first visit to Barcelona. We were very happy with the location (not necessarily central but a very short walk to the metro), the cleanliness of the lobby and our room, and the overall feeling of security in the hotel. The desk clerk at our arrival was not necessarily pleasant and did not offer to help bring my bags up to our room, but the other staff we encountered were helpful and friendly. There are two computers available with internet for guests to use which was useful. Overall, this hotel was a great find for the money we spent. We would definitely stay again. Tip: we loved barhopping in the gothic quarter at night. Start at a pub and get lost wandering through the narrow walkways, stopping for cocktails in some of the quaint, colorful pubs along the way. Its slightly outside the touristy area so you are sure to meet locals and many foreigners living abroad.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great Hotel in a good central location”", "Author": "mintmoocher", "ReviewID": "UR115474259", "Content": "Stayed three nights here for a fmaily meeting. The hotel is well locatedwithin walking distance of the city centre and by two metro stations. We loved the sleep quality,the room cleanliness, the money off deals on the tours and the breakfast buffet. Hotel did seem overly busy with few staff at crucial times such as breakfast and did not try the restaurant in the evening.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Nice Staff and Good Location”", "Author": "berri87", "ReviewID": "UR115322804", "Content": "The hotel was walking distance from the metro station. Be sure to take the Manso exit at when leaving the metro station since this is closer to the hotel. The room was nice and clean. The bed was very hard and I was a bit disappointed since my room didn't have a view. There's only wired internet in the rooms so make sure and walk with a cable otherwise they sell theirs for 4 euros. I did not have breakfast at the hotel so I can't say anything about it. There is a bakery across they road and since the hotel is near the metro station, Barcelona is easily accessible. The staff was always friendly and helpful. There's also a luggage room where they keep your luggage for you if you want to go out a bit after check out.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Jersey", "Title": "“Hotel Evenia Rocafort, a great home base”", "Author": "aurorahigh303", "ReviewID": "UR107700411", "Content": "We booked this hotel for a total of 7 nights in Barcelona. We got into the city earlier than the check - in time, but that wasn't an issue at all. The manager was there, and he was able to hold our luggage for us until we could check in so that we could get to the sightseeing right away. We thought this was a great personal touch. Everyone that works there that we came in contact with was really great. They spoke both Spanish & English, and were more than willing to give ideas and tips for going out. Our room was overlooking Carrer Rocafort, and with the windows closed, it was very quiet. We did open the windows during the day while we were out, to let the sea breeze in, so the room was nice & cool upon our return. When we first checked in, I'm not sure the AC was working, but with the windows open it was no problem at all. The room was not palatial by any stretch, but who really cares when all you do is sleep & shower there. The bathroom was very nice, spacious & clean. Just watch out, as housekeeping likes to face the shower head to the wall. We flooded the bathroom a couple of times before we realized. The bed linens were soft and clean, and there were extra blankets & pillows available in the room. The towels were a bit ragged, but again, soft and clean. They have a safe in each room, but there is a €20 deposit (which is returned at check out) to get the lock & key for it. We didn't mind since we got the money back, and we had peace of mind that our stuff was secure. We really liked the location, in an out of the way spot close to city center, we could walk or take the Metro anywhere we wanted. The neighborhood is residential, so one can get a good feel for how Barcelonians really live. We had breakfast each morning at Bellepan, across the street from the hotel. It's nothing special, but we were able to each get something to eat, some coffee and water for about €8 to €10. On the other side of the street is a great little gin bar, named appropriately Xixbar (Catalan for gin). We had many nightcaps there after a long day walking around the city. All in all we had a very nice stay, our only complaint about the room would be the bed. We were expecting to have two twins pushed together, and they did a great job making sure the two actually stayed together, but boy was that bed hard! A little uncomfortable, but we sucked it up.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bergen, Norway", "Title": "“great location,friendly staff”", "Author": "Kurt K", "ReviewID": "UR107551360", "Content": "The hotel was in a quiet neighborhood,but we have to go outside to observe the weather.The room hade a window to a backyard,but it was impossible to see the sky.And the bed was hard as a rock. But owerall,the hotel was OK,Clean,friendly,quiet to the backyard,a bit more noisy to the street", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Europe", "Title": "“\"Very good hotel\"”", "Author": "Jamilija", "ReviewID": "UR94091369", "Content": "The hotel is well located. Nice area. Near two metro stations. The staff very friendly and helpful and kind. The room was very clean, big enough, the only con was that it was located in the 4th floor (room 405) near the elevator (caused a lot of noise) with no view at all since the window was turned on the \"inner side\". For staying in the hotel longer try to avoid this room. Still we had a very good time. And one more thing: on the opposite side of the hotel is a bakery, \"boulangerie\" which we do not recommend at all. Coffee was tasteless and don't try their kind of a croissant. We recommend the hotel.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Very nice hotel!”", "Author": "toni_jk", "ReviewID": "UR93986058", "Content": "We stayed this Christmas for 5 nights and the hotel felt very comfortable.We were at room 409 and the room was large and with street view.We did not opt in for the hotel breakfast, as just across the street there was a nice bakery and we had coffee&milk, sandwiches and croissants there.The hotel is near to main street Paralel and is in 5 min walks to subway.Very convenient! From the Airport you can take Renfe train (3 Euro/one way) and to Sants station and to take a subway to Poble-Sec and your are 3min away from the hotel. From the Airport to the hotel via train+subway it is about 50-55min. Hotel is near to the pl.Catalunia and not far from La Rambla. Very nice, quiet and safe residential district.Actually we were very happy that we did not book a hotel in La Rambla and Bari Gothic.There are many suspicious people. Although we prowled the La Rambla at night and had no problem, there are always sellers of trinkets and beer who are best to be avoided. Other thing that we really liked in Evenia Rocafort- there are 2 computers with internet in the lobby and you can use it free of charge no matter of time, and also there is a free of charge room luggage. Our return flight was late in the afternoon about 19.30 so we left the luggage in 12.00 PM and then returned in 4PM. We really like the hotel and will stay there again!", "Date": "January 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Definitely a good choice!”", "Author": "perjak", "ReviewID": "UR92660638", "Content": "Vi stayed at the Evenia Rocafort for Christmas-week 2010. We were welcomed nicely, and received useful information about BCN restaurants, sightseeing and.... pickpocketing. Our room was towards the street. You are in a safe and queit part of BCN - never the less - watch out for pickpockets as soon as you reach the subway-stations. From the airport I would highly recommend city bus 46 in stead of the 'aerobus'. It only costs € 1,40 (if you do not have a T10 card; then it is even cheaper). It takes approx 30 min's and is easy to find outside the terminal. It terminates in El Paral.lel one stop after Placa Espanya. From there it takes 5-6 minutes to walk to the hotel. We had breakfast at the ER the first morning. It was 'good enough', but the value for money is much better if you walk over to the 'bellapan' café just across the street. Freshly pressed juice, freshly baked bread - and: You will meet the locals. If you plan to use your laptop in the room, bring a patch-cabel. These are sold in the reception, but why pay for something you already have? There is free wifi in the lobby. All in all, a pleasant experience.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Friendly Hotel, Nice Stay”", "Author": "AnaMaria-Lisbon", "ReviewID": "UR87802181", "Content": "At the El Prat Airport you can take the aerobus towards to Plaza de Catalunya and exit at Plaza Espanya. The return ticket it's about € 8.45 and takes 15/20 min. From Pl. Espanya you take about 5/10 min. walking by Av. Mistral until you find the hotel. Near the hotel you have Rocafort metro station (red line), it's easy to find it and a single ticket it's € 1.40. I have to say that the hotel is not in the city center. Although you can go walking to the most important touristic city points, takes only about 20 min. to find Pl. Catalunya. About the hotel: the room was small but good enough for a couple of days, the bathroom was very spacious and both were very clean. You have a mini-fridge in the room. At breakfast you can find fruit, cereals, yoghurt, muffins, bread, bacon, eggs, etc. I can advise you to not be amazed, if you don't see much of these things one hour before the breakfast close. This is the reason why I can not give a better score for the service. Many of the things were not replaced. The hotel staff was nice, friendly and helpful. Near of the hotel you have many supermarkets and restaurants.The neighborhood is very quiet and safe.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ankara, Turkey", "Title": "“A decent place to stay”", "Author": "es_1903", "ReviewID": "UR86819859", "Content": "We stayed in Evenia Rocafort for 2 nights with my wife in July 2010 and we both enjoyed our stay there. The hotel is in a safe and decent location with a few minutes walk to 2 metro stations. We used the metro all the time and had no trouble reaching to attraction points in Barcelona. The room we stayed was clean and big enough. The bathroom was perfect. It was very clean and roomy. It was well decorated and there was a bathtub which was a real comfort after a tiring day. I must say, the hotel is better than it looks in the photos. The man on the front desk was good-humoured and very helpful. We liked the hotel very much and strongly recommend. One more thing to mention here, we had forgot some of our clothes in the closet, we contacted the hotel and they sent them back, which we appreciated it. A little tip about reaching the hotel from the airport: after taking the Aerobus from the airport just get off Placa Espanya and walk five minutes to the hotel.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great value, good location”", "Author": "aschlos", "ReviewID": "UR83821674", "Content": "I booked this hotel after reading reviews on the usual sites. I was happy with what I saw and got what I considered a really good deal through hotels.com. I was able to combine a promotion with an already discounted rate. It came to £111 total for a Wed and Thurs night mid-October stay for two. Finding the hotel was easy. I arrived via bus at Estacio Nord, walked a block West to the Arc De Triomf metro, took the red line to Rocafort and walked 3 blocks south. The hotel entrance is large and easy to find. The lobby was a bit warm, but check-in was fast and courteous. There are 2 computers with internet access which is very convenient. My room was small, with 2 singles pushed together and not much space to get around the bed(s). There was an lcd tv on the wall at the foot of the bed that I only managed to slam into once. My wife was not so lucky. The other con was that I think the beds were made from slabs of granite. If you like a \"firm\" mattress, you are in luck! The air conditioning worked well, but I preferred to open the large window as the October air was cool and refreshing. The bathroom was large with a shower with excellent water pressure. The finish looked very modern. Towels smelled clean, but looked a bit rough. The room comes with a safe, but you need to put down a €20 deposit that you get back at check out when you return the key. We were able to leave our bags after check out which was very convenient for our last day. The hotel is in a nice area of Barcelona with plenty of small grocery stores, restaurants, and bars. It is 1 block away from the Poble Sec metro on the green line that takes you to most of the tourist sites. You can walk to La Rambla in 25 minutes through some of Barcelona's more colorful neighborhoods if you don't mind that sort of thing. Altogether, I really enjoyed my stay for the price I paid and would recommend the hotel.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Nice cosy central hotel”", "Author": "Mancityfan82", "ReviewID": "UR76916587", "Content": "Just came back from staying at evania rocafort.From the airport we took the aerobus 8.75 Euro return,U stop at the next stop Placa Espanya which is 20 mins away.Then u find Avinguda del Paral·lel and u walk on ur left straight for about 10 mins ,turn left and u can find the hotel,its very central and very clean .Ask for a safe ,u give 20 euros deposit and u get it back when u leave.Also ask for two cards if ur a couple ,we left the air con on to cool the room .The rooms are very small but we only slept there .They are cafe s on the main road and prices are same as in the UK .We found the chinese owned cafe s very nice and clean and the prices were decent .Also we had a meal in a indian owned cafe on the main street and had to leave as the steak and lasagna were so so so bad ,Please dont go there as is a rip off and the food is so bad.Also i would recommend the barcelona city tour ,http://store.barcelonacitytour.com/shop/en we paid online 52 euros for 2 people for 2 days .It takes u to all the attractions and its not crowded like barcelona bus turistic.The magic fountain is open weekend only and its very nice.We didnt use the metro as the bus tour was good enought.Also went to barcelona stadium,its 19 euros to get in so if u love football and ur not short of money ,its nice to see it . Went to the barceloneta beach ,which is one of the stops, nice but the sea wasnt that clean,but i would reccoment the NOVA bella stop where the beach is better and the water is cleaner.Get a safe for 50 cent which u get it back for peace of mind . Overall Barcelona was very nice and very safe.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southampton", "Title": "“A mixture of good and bad...”", "Author": "lulabell_90", "ReviewID": "UR74734810", "Content": "The hotel was very nice itself but wasnt exactly in the nicest part of town but there were two metro links within a 10 min walk of the hotel. The room was very nice but in the building next door there was major building work going on which on a few days was extremely loud and we were not told about this before we arrived or offered another room when we complained. We thought that the breakfast buffet was very expensive. They did offer free use of computers with internet in the lobby though which we were impressed with. We did have a lot of trouble finding the hotel after getting off the aerobus on arrival and working out how to get the aerobus back to the airport on departure.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic staff and location, but a few drawbacks.”", "Author": "jlondon55", "ReviewID": "UR74504515", "Content": "We stayed in two rooms in August. On our way there we got the aerobus to the Placa de Catalunya, and caught the metro from Catalunya to Poble Sec. After being there a few days we noticed that one of the aerobus stops, the Placa d'Espana was much nearer and would have saved us getting the metro. I would recommend that as long as you don't have too much luggage, get off at the Placa d'Espana- it's a ten minute walk from there. The staff on reception were incredibly helpful and welcoming; and showed us the best sights to see in Barcelona upon arrival. The views from the rooms weren't exactly scenic; but the hotel is in a great, but quiet location. The two rooms we stayed in were both modern and comfortable. There are two computers on the ground floor that can be used for free. The one thing that put me off this hotel was that I found stray hairs in the clean linen and towels. The other people I were travelling with did not share this problem, and I was only able to work around this as I was one person in a room that would accommodate two. Whether this is a rare occurance or whether they were ones from the person who serviced my room, I do not know. Apart from that, I found the rooms were fairly well serviced. Apart from that drawback, I would consider staying in this hotel again, due to the friendly staff and great location; and hope that it was mere bad luck.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "burton on trent", "Title": "“This Hotel made our stay in Barcelona worthwhile”", "Author": "anglia72", "ReviewID": "UR73546187", "Content": "From the time we arrived at the hotel we had nothing but praise for staff, amenities, and situation. The hotel is literally a few minutes walk from Plac de Espanya, from where buses/metro/tour buses operate. The room was small, but clean and well painted and polished. Breakfast was fine, but around the hotel are many places to eat, especially if, like us, you like a full English breakfast when on holiday. Highly recommended. Excellent value. We shall stay there next visit. Thanks, two satisfied Brits from Burton On Trent, Staffordshire, UK.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent location, great reception staff”", "Author": "wesleywoo", "ReviewID": "UR73060384", "Content": "We stayed here for 5 nights in July 2010 and had two rooms. We arrived at 10AM off the overnight train from Paris and were in great need of a shower and a nap. Luckily, we were able to check-in right away. Of our month long European trip, this was one of the better hotels we stayed at. The rooms are nice, quiet and very clean. We had one with street view and one with the inside view and have no complaints about noise. The beds are comfortable and the washroom is large by Europe standards. You actually get a full size tub! (pictures are attached). The hotel staff was friendly, always said hello when we walked past, and were willing to answer any questions we had. The location of the hotel is perfect. It is steps from two metro stations which was great because you can get around anywhere you need to go. Even better, the hotel is surrounded by many produce markets, grocery stores and restaurants. Our favourite place for groceries by the hotel was Dia, a grocery store a block away. Here we were able to get food for breakfast, load up on water, and purchase any other toiletries we needed. The prices at this store are excellent as well. Once you walk out of the hotel, take a left, cross the street and you should be there. The hotel has two computers you can use in the lobby for internet. I believe they also have wifi in the lobby if you have your own computer. However, They have wired internet in the rooms. Just ask for a cable and they can lend you one free of charge. I would definitely stay here again. Great service and great location, there's nothing not to like.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire - England", "Title": "“Fantastic Hotel in perfect location”", "Author": "Biggwhit", "ReviewID": "UR69353193", "Content": "The Evenia Rocafort is a fantastic hotel. It is in a perfect location for all aspects of a holiday to Barcelona. 2 mins walk to Poble Sec metro Green line L3 (which I feel is the main line that gets you to most things, purchase the T-10 metro ticket if you are staying for a while, easy to hop on and off the metro when ever you want upto 10 times, walk to La Rambla or the port and metro it back late on at night). Staff very pleasant and very helpful, spoke good English too. Free internet in rooms (but you do have to have a wire connection but 2 computers in the lobby for personal use). Ask for the safe key when you arrive for a deposit of 20Euros. The rooms are very clean and he air con works very well, (tip, use another card out of your wallet/purse and put it in the slot for the room so that the room is nice and cool for when you return rather than having to cool it down when you get back in) For eating I would recommend a place called Le Bistrot Rias De Vigo on the main street 10mins walk away, turn right out of the hotel and right again onto the Main street, turn right and head upto Espanya (where the magic fountain is) the restaurant is on the right hand side of the street! In total a brilliant holiday and I would without doubt recommend this hotel, book it now!!", "Date": "July 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fredrikstad_82", "Title": "“Great hotel in a great area!”", "Author": "Fredrikstad_82 Posted by a Finn traveler", "ReviewID": "UR67684551", "Content": "We stayed at the hotel for one week the first week of June 2010. The location is great, 150 meters to the metro (2 stops to La Lambra, metro arrives every 3 minutes!!) We ate breakfast at the cosy cafe across the street every day (7-10 Euros each day for the both of us) and there is a number of small supermarkets and bar/restaurants nearby. Good size on the rooms, the cleaning could have been better some days and the beds are just as hard as rock :-) Free internet access next to reception desk. Great value (580 Euros for double room - 7 days) We will absolutely consider this hotell for our next visit to Barcelona.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Very Good 3 star hotel”", "Author": "petrojen", "ReviewID": "UR42614679", "Content": "Very good 3* hotel. One block away from a metro - the primary transportation mean in barcelona. trains come evrey 3-4 mins. The rooms are fine, not too large but had everything I've I needed. The safe is with mechanic key so you will have to carry it away with you. The only drownback I saw is that the food (I had only breakfasts) was the same every day.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“very nice hotel”", "Author": "kruven", "ReviewID": "UR34720174", "Content": "Actually, firstly we got \"inner room\". At the reception the guy said it's more quite, so we agreed. The room was quite scarry. Depressing view from windows (dark space between walls), bed fits almost all the room and a disturbing noise from some massive machine all the time. I didn't manage to sleep, also because baby was heard crying too close all night! So, don't take inner room, ok? My partner asked in the morning to move to another room and we got great room at 6 floor, with lovely view on a decorated roof top, lots of light, and much more quite than \"inner room\", although it was above traffic. All the way, staff was very helpful (although guided us wrongly to Camp Nou ..), and rooms as clean as can be. Location is quite far from city center if you plan walking. Metro or bus is a neccesity. We tried to walk from Catalunya Placa and after half an hour we weren't even in mid-way... So, if you hate Metro like we do...", "Date": "July 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "dorset", "Title": "“Does The Job”", "Author": "travelcatDorset", "ReviewID": "UR33813748", "Content": "Modern hotel, rooms a bit small but has everything for a city break, very close to Poble Sec station so easy toget around the city on Metro. ( If you miss one train there is another in 3 mins). Only dealt with reception staff but they were friendly & efficient. Booked through Expedia & good value for 3 nights at 140gbp. Air conditioning free, deposit for room safe 50e but refunded at checkout and no extra charge. Quiet location so no probs sleeping.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ploiesti", "Title": "“Excellent 3-star hotel”", "Author": "horhegxg", "ReviewID": "UR33427004", "Content": "Great value for money. Booked this hotel through booking.com. Spent here 8 nights. We pay for that 535 euro for a twin room. The room was great, clean and spacious. Also, the staff was very kindly and helpful. The location it's near Poble Sec metro station (green line - L3) , about 2 minutes in a walk and 7-8 minutes away from Placa Espanya, where you can find the spectacular Magic Fountain. We recommend with confidence this lovely place.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tel Aviv", "Title": "“Perfect three-star hotel”", "Author": "Boojies", "ReviewID": "UR32810035", "Content": "My friend and I just returned from a 4-night stay in Barcelona, at the Evenia Rocafort . We were extremely satisfied with this hotel. The place itself was clean, modern and comfortable. Wonderful A/C ! Staff was friendly and helpful. Free internet was provided in the lobby. Breakfast was generous and tasty. And the location was very convenient: a pleasant walk to Pl. Espana, and two-minutes from a metro station. The neighborhood's non-touristy flavor provided exposure to a 'normal' part of Barcelona. Lots of supermarkets, cafes, bars public transportation and shops.All in all, we heartily recommend the Evenia Rocafort to anyone looking for the perfect three-star hotel.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“Great 3 star hotel”", "Author": "motiraz", "ReviewID": "UR22992105", "Content": "Great 3 star hotel. Stayed for 3 nights and were very satisfied. Room we were given was clean and was great for a couple (view to the street). bathroom was new and clean. Bed was comfortable and also clean. The crew was very nice and helpfull. Breakfast was great, good products and a lot of options. location is great, 1 minute walk to poblo sec metro. close to mountjuic and espanya squere. has pharmacy and supermarket close by. most important - quiet at night.", "Date": "December 25, 2008"}], "HotelInfo": {"Name": "Evenia Rocafort", "HotelURL": "/ShowUserReviews-g187497-d582087-Reviews-Evenia_Rocafort-Barcelona_Catalonia.html", "Price": "$93 - $166*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Rocafort 23-25</span>, <span class=\"locality\"><span property=\"v:postal-code\">08015</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> (Formerly Cotursa Rocafort)</span></span></address>", "HotelID": "582087", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fd/dd/fddd34ade008f78f5cde3aa47cf2d0b73large.jpg"}}