{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Average hotel, no Five Star”", "Author": "Reis2012", "ReviewID": "UR122064088", "Content": "We are in the middle of a 9-night family trip and felt compelled to post our opinions on this site. The apartment is well sized, big living room, nice kitchen, and bedroom. For the most part, the staff is nice, but some don't seem to make the effort to accommodate your needs. The place is very clean and well kept. However... We are paying a moderate price for 2 adults and 1 child and yet the child has to sleep on the uncomfortable coach cushions, otherwise we would be charged AED 675.00 (~ USD 200) for an extra mattress. Nickel-n-diming is not something you'll usually see on a 5 star. I'm also disappointed that the dvd player barely functions, the image is missing the 'blue' color and the remote is precarious. If you're staying on a single bedroom unit, don't expect a good view, as all of these units face buildings in very close proximity. The pool is nice and the gym is basic. Therefore this is an average hotel, but far from a five star.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Beautiful large apartments in excellent location!”", "Author": "paulas1972", "ReviewID": "UR120947029", "Content": "These apartments were recommended to us by a friend who travels to Dubai frequently and we weren't disappointed! We had a 1 bedroom apartment but it was huge! we had a queensize bed, 2 bathrooms (one with 2 x showers and sinks!) and a large kitchen area. The staff were friendly and very accomodating and the Pool was lovely! great views over the Burj al Arab and I was always the only one up there! The apartments are located right next to the Mall of the Emirates and the Metro so perfect for exploring! We will definately visit again.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ATHENS GREECE", "Title": "“what a nice appartment !!!”", "Author": "R M", "ReviewID": "UR119324169", "Content": "i stayed with my partner for 8 nights to an excecutive suite 75sq meters. the appartment was superb!! very vey comfortable, big bedroom with big clothes storage area, working desk, flat screen tv, and nice decorative as you can see on the photo.Very big bed !!! One wc, and a bathroom , with bathtub and shower!! Big kitchen area, fully epuipment and big living room area with dining area and big screen flat tv. totaly was better than we imagine before. Vey clean, helpfull reception staff, we easily found a taxi. It's 5 min walking to the metro station, and 5 min to Mall of Emirates ( big shopping mall, with big Carefour super market). Because on the area there are more hotels-appatments, there are some restaurants and mini markets around where you can buy anything you need. Even there was a restaurant on the hotel 24 hours open for breakfast and dining , we didn't use it. There was a small swimming pool on the roof top, but it was ok to spend some hours there.The only complain i had, was the difficulty to find some one from the spa personel to give us towel for the sunbeds.So, i went down to our room and i tokk the bathroom towels for the pool. Free internet acces on our room. No noise from outside. My cousin when she came to our appartment was been jealous instead of her 4star hotel room next to Burj Khalifa. How foolish i am when on my past trips to Dubai i didn't know it and i stayed to a 4star more expensive hotel !!!! Of course i would prefer to stay again to Coral boutique Al Barsha !!!", "Date": "October 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Awful!”", "Author": "likesaholidayor2", "ReviewID": "UR118590755", "Content": "Booked into this \"Below Standard\" Hotel with my husbands work. Had I been the one paying we would have left after check in! The rooms are like something from the 60's or 70's with drab decor and yellow & orange sofa's. Dirty marks on the walls, handprints on the walls, Patio doors filthy! The dust on the skirting boards was thick. The balcony was unusable due to the build up of dirt! Never cleaned for the 3 weeks we were there. The Housekeeping! Well, they dont clean under tables, dont dust tables or skirting boards, dont leave toilet paper and if you ask for some you are given 1 roll - we had 3 bathrooms!! Did not replenish toiletries, No towel or soap in guest bathroom (hello!! Hygene!! The kitchen tap swivels loose,no chain on plug so 5 broken nails from prising it out! Kitchen equipment for 4 people consisted of 1 fork, 3 knives, 3 mugs, 3 glasses!! The Ironing board sits at a slant and falls over if not careful, the washing machine is in italian, no english instructions. Very little in the way of utensils, not even a big spoon!. The pool is nice but the loungers are dirty and same dirty marks been there 2 weeks. The staff all seem pleasant enough but not had much contact with them. Unfortunately some revarnishing of old furniture was going on during my stay so my car was boxed in with furniture in the basement and the room was toxic with the varnish fumes for about the first week. Breakfast is very limited and if you want a Latte then it costs extra! Would I recommend this? No way! Far nicer hotel apartments in Al Barsha area. Would not come back!", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Karachi, Pakistan", "Title": "“standard has gone down”", "Author": "Tariq79", "ReviewID": "UR116552452", "Content": "i stayed here for the second time in July 2011 because of my prior experience here in 2009 which was fabulous. bu this time it was disappointing. the hotel has been taken over by a new management few months back and according to the staff is focusing on cost cutting. having family with little kids, they use to have free shuttle service to mall of the emirates before which is no longer there now ( although the website still claims it), so it was misleading. the Porsche feel in the room is now longer there probably because of cost cutting again. they charge for the news papers and the lobby has to A/C. on the positive side the rooms were still spacious and comfortable enough. the staff was also good but seemed helpless due to what they are forced to do to cut down costs. Over all the standard has gone down which will make this place no longer one to consider for future. and by the way , don't think you can walk to the mall of the emirates, not in Dubai, not summer or winter, specially if you kids.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Athens", "Title": "“Fantastic hotel”", "Author": "Pekard", "ReviewID": "UR116092521", "Content": "The rooms in Coral Boutique are really fanastic, very spacious and clean. The staff is friendly and helpful at any time. Generally, you feel like home in this hotel and you are really comfortable.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Only A good location CLEAN FLAT.”", "Author": "M O", "ReviewID": "UR115877120", "Content": "We stayed here for 3 days . The \" Suite \" is a good flat with a nice kitchen . AC is very good which is a must in Dubai ! . Resturant needs improvement and food quality is less than average. Front desk is small , But the front desk personals are very good ( AHMAD is the best ). The hotel is within a 5 min walking distance to the Emirates Mall which is one of the best in Dubai. July is very HOT . We had a very good time shopping .", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great apartment-hotel; HUGE space! Loved it.”", "Author": "Nellan", "ReviewID": "UR108250405", "Content": "We reserved a 3-bedroom 3 bathroom, living room and kitchen suite. It was AMAZING and turned out much cheaper than a hotel. These suites are SPACIOUS ---- the bathrooms were amazing; great products too! Cleaning staff came late morning, which was very convenient; Hotel desk was very helpful. I had booked an Airport Pickup w them --- it is quite expensive, compared to a cab. Just get the address of the hotel and take a cab from the airport --- it is a safe country, you'll be OK! I took a cab back to the airport and it was less than half of what they had charged me to send a car to pick me up. Rooms were spacious and very clean; nice kitchen. We didn't cook there, but it was great to keep snacks in the big refrigerator. If you are thinking \"small kitchen\" --- no, it is a HUGE kitchen! You COULD cook a gourmet meal there. Spacious living & dining rooms too. Highly recommended if you want a 3bed/3bath and don't want to pay for hotel costs. Walking distance to the mall. EASY ENOUGH!", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“great value good location for beach metro and retail therapy”", "Author": "safarijkts", "ReviewID": "UR106856132", "Content": "We stayed in an executive one bedroom suite (appt 204), one of the largest rooms in dubai for the price. No balcony and no view from the room, as further building is ongoing on the next plot, this is Dubai remember, but i did not come here to stay in my hotel room and admire the view. Large lounge/dining area, well equipped kitchen, good size bed and a small bathroom with bath and separate shower. Free in room internet was a pleasant surprise. Large flat screen tv (plus dvd player) in lounge with good sat package. A decently equipped gym, spa and a roof top pool are standard for hotel apartments. Service was good, despite poor reviews elsewhere. Taxis were always available outside, but only 300metres to the Mall of the Emirates metro station. A range of restaurants and a few supermarkets exist close by for essentials. Contrary to other reviews I found the A/C adjustable and adequate to deal with for 35 centigrade temperates. try to get the room only option, breakfast seems overpriced. I have stayed in many hotel apartments in Dubai and this would represent the best value in this field. There is no arrangement to access another hotel's beach but hotel is close to numerous beach front hotels which offer day passes. We used le Meridien hotel beach about five to ten minutes away by taxi and found this beach to be quite adequate.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denmark", "Title": "“Great Service - Good location - Excellent value”", "Author": "DisneyDenmark", "ReviewID": "UR95667224", "Content": "Maybe not at 5 star hotel/apartment, but a fine 4 star. All the staff provided 5 star service especially Ahmed Ali & Andrew Dahanayke. Large apartment. Good location. 300 meters from Metrostation: Sharaf DG. 500 meters from Emirates Mall. (Use the entrance at Kempinski Hotel) 100 meters from small supermarket and few restaurants.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "china", "Title": "“Fantastic Location”", "Author": "chinagirl033", "ReviewID": "UR92484365", "Content": "We stayed here over the Christmas and New Year and it is in a great location. 5 Mins walk to the Mall of the Emirates, 5 mins to the nearest Metro station, which runs every 4 mins both ways. There is a great shop across the road called the \"Pinecone\" it is run by a really friendly couple selling fresh fruit & veg, bread and cheeses etc ideal for anyone staying in a self catering apartment. There is a subway sandwich shop across the road and at the corner of the street there is a Holiday Inn which has a sports bar etc and a few restaurants. The apartments are fully equiped, cooker, microwave, washing machine etc and very clean. Our only downside is if you get an apartment on the side of the hotel the rooms are very dark because there are building on either side of it. If you want to go up the Khalifa tower make sure you book a few days in advance.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dubai", "Title": "“The worst service I have ever encountered...EVER!!!”", "Author": "DubaiManofmystery", "ReviewID": "UR78812119", "Content": "We decided to stay for a few days over the Eid break and booked a room from a booking website which states the room accommodates 4people, which we thought would be fine for our family of 2 adults and 11and 12 year old. When we arrived, the room had 1 king bed, a lingering stench of cigarette smoke, and dirty, grubby old furniture. We argued with the duty manager for no less than 1 1/12 hours about the bed issue only. Despite repeated admissions that the website was misleading and that the information upon which we booked the room was wrong (which was provided by the hotel),and that that they had additional beds, they refused to provide any extra beds without additional cost. We were absolutely gobsmacked at the attitude of the duty and front manager which was that they would rather risk formal complaints to the upper management and legal action, rather than to provide a portable bed for our children free of charge (despite agreeing that it was reasonable for us to assume that the room should have 4beds). We are frequent international travelers and have never been so astonished at such a disregard for providing customer service or meeting a hotel's obligation. Aside from this issue, the room, as stated was small, very smelly with the stale cigarette smoke, and worn...meanwhile, my children slept on the floor. Avoid this hotel at all costs!", "Date": "September 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Japan", "Title": "“ok stay with pros and cons”", "Author": "Tokyite", "ReviewID": "UR14486652", "Content": "I have just returned from a week work-and-play trip in Dubai. Stayed at Coral Boutique apartment which I found comfortable, however, it is my first visit to Dubai and a good concierge would help. It would be a miracle to get a reception-cum-concierge at Coral Boutique apartment to do anything in one call. All the staff are friendly and mostly are efficient with their jobs but not the reception. Dubai, being operated very differently from other countries-- weekends on Friday-Saturday, praying time with minimal taxi or drivers not in good mood, traffic condition makes commuting time varies, it is not the easiest place to move around without help/suggestions. Good things about the hotel are that they have free internet, nice breakfast, friendly staff and ok gym and pool. The cons are that the hotel is furnished similar to some 2 star hotels in Europe I had to stay in when can't book anything else, although roomsize is good. The internet may not work and when you call the reception, they tend to say yes with no following-up actions (once waited for 2 hours, so I called house keeper outside of my door to help contacting someone). And it's close but not the closest place to Mall of the Emirates --sort of betwen walking or cabbing distance. Every morning, I was woken up by a construction noise. I went on a sandune safari tour through the booking of a hotel. The company, I think is called Universal. It's the first time so I don't have a reference point but pre-booking conditions say maximum guests would be 6 people, it turned out to be 7. I ended up sitting in the back row which I usually seat my dog or excess luggage. It is not a space for one person in a safari drive but in that evening, 3 people had to squeeze in. The last row of the car has higher seat and my head knocked the roof all the time during the sand dune drive. Not- a- fun thing to do after y ou have paid nearly AED 200 per person for a tour. Dubai as a city can be fun. Some restaurants I found towards the end of the trip (through Timeout magazine and called to book the place myself) are really nice. Wish we get some recommendations like this early on.", "Date": "March 24, 2008"}], "HotelInfo": {"Name": "Coral Boutique Hotel Apartments", "HotelURL": "/ShowUserReviews-g295424-d582461-Reviews-Coral_Boutique_Hotel_Apartments-Dubai.html", "Price": "$122 - $424*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Sheikh Zayed Road</span> | <span class=\"extended-address\">Al Barsha</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">24948</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "582461", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/79/bc/79bc34441ae888a1d70eae1989d948e15large.jpg"}}