{"Reviews": [{"Content": "Do Not Stay There A group of families off for a surfing trip to Puerto Rico was planned and we found a condo on the NW coast. We reviewed the website and it claimed, beautiful, clean, magestic landscapes, restaurant, convienence store, phone, tv, fully equipped kitchens. We'll my family arrived first, only to see a very run down facility, enclosed in barbed wire, a half dead female dog with eleven puppies chained to a pole by the pool. A can of brown paint spilled and dried on the pool deck, overgrown landscape, dirty beach. Then there is the condo.....plywood floors, no lightbulbs, filthy! I mean filthy! No bedspreads, electrical wires hanging all over. Nothing in the kitchen cabinets at all! Not a spoon, glass, nothing as claimed. TV with one channel, no phones, plenty of bugs, a/c units in each unit looked as if it had caught on fire at one time, sliding glass doors that took two people to open. Standing on the balcony we only saw barbed wire and over grown brush. The scariest place I've ever been. The office was so dark with one light bulb hanging from the ceiling in the center of the room. One of the families in our party booked their reservation in January and had to cancel it in february and the owner Pedro would return his calls or refund his deposit. On the website they state there is a 72 hour cancelation policy for refunds. This was well within those parmeters. We had to corner Pedro to get him to discuss the situation. He said he could talk because his grandmother was being rushed to the hospital and his mother had recently died. He tried to run me over in the van to get away from discussing this. Then he started crying and yelling and would only agree to refund half our money. We paid in full for the whole week. What a nightmare. FOR YOUR OWN SAFETY DO NOT STAY AT THIS DUMP THAT CLAIMS IT'S A RESORT?????", "Date": "Mar 13, 2007", "ReviewID": "UR129698681", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "surfchic38"}, {"Content": "Scam Six families of all ages had booked reservations at this hotel. We were told that the villas would accomodate us in every manner, even including all dishes and dinnerware plus microwave in the kitchen. Upon arrival we had found the villas surrounded by barb wire, the pool was not kept in proper condition, the rooms consisted of floors made of bare plywood, sheets only on the beds, and not very clean ones at that, the bathrooms were filthy and not one light blub was to be found in any of the lamps and to top it off there was no running water. Also the kitchen did not have the promised dishes, the kitchen was bare and dirty. When several members of our party requested that we all get our money back they were surrounded by the owners family members or friends in a threatening manner, the owner tried to run over one person in our party and at one point got on his knees and said he was putting a hex on our whole traveling party. Unhappy in Virginia Beach", "Date": "Mar 13, 2007", "ReviewID": "UR923101487", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "vabchsurfers"}, {"Content": "Nightmare Seaside beach resort Do not stay here. This place is horrible. I stayed here and had to leave early they charged my for the full stay. The villa door of the villa I stayed in was falling apart. It didn't lock. I had an ant problem. The villa was right next to the beach which was dirty and nasty. This place was horrible. I am trying to get the money that I did not authorized, but am having no luck. This is an alert. DO NOT STAY HERE. Yuck!", "Date": "Jul 20, 2006", "ReviewID": "UR514087773", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "-1", "Location": "-1"}, "Author": "leamsy"}, {"Content": "BEWARE OF BILLING!!!!! I booked this resort through HOTELS [-] for 4/13-4/17. I was unable to fly to PR and canceled 9 days prior. To my horror, my account was charged $360 even though the hotels cancellation policy was 1 day prior. Hotel[-] agreed with me that the resort is in violation of its deposit and cancellation policy, but have done nothing, other than offer excuses. At my banks suggestion, I canceled my bank card. Its been 3 days of trying to get my money back.", "Date": "Apr 6, 2006", "ReviewID": "UR669805073", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g147319-d585853-r7155039-Seaside_Beach_Resort-Puerto_Rico.html", "HotelID": "585853", "Price": "$109"}}