{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Is a good hotel”", "Author": "Elutza", "ReviewID": "UR90227888", "Content": "Im from Romania. I stay there in octomber with my boyfriend for 2 nights. The personal was kind and offer us a discount for a room...poor room but big and with great bed....good for us. If u want luxury is not the right place for u but if u want a clen bed to sleep is ok...Enjoy u're trip...London is great!!!", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Worcester", "Title": "“Cheap and cheerful!”", "Author": "CreationOfLove", "ReviewID": "UR50574859", "Content": "We went on a weekend theatre break to London and stayed at the Marne Hotel as it is so close to Victoria station where the theatre is. Our room was tidy with a comfortable bed and an en-suite shower and toilet. Breakfast in the morning was tasty and the gentleman serving it was very chatty and cheerful. We felt as if we really were guests and not just strangers staying at a hotel. Staying at the Marne Hotel just added to our experience of a great weekend in London!", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "intermezzo3", "Title": "“Great Service”", "Author": "intermezzo3", "ReviewID": "UR43142246", "Content": "The hotel is within walking distance of Victoria Train Station yet set in quiet surroundings. The rooms and private bathroom were sort of plain but clean and good-sized. English breakfast served. Pricewise quite reasonable. Family run hotel with very friendly staff providing a good service all around.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "west mids", "Title": "“disgusting”", "Author": "kipstu", "ReviewID": "UR30836671", "Content": "i was booked into this hotel by my company and from the moment i stepped in the door i was appalled. The state of the rooms was disgusting.to call the room en-suite is a joke, the room was literally 2 foot by 6 foot, a bed is bigger. The bathroom door was rotting away and down the side of the toilet were faeces. The telly was literally hanging off the old wooden cladded wall which wouldn't have been a problem if it wasn't above the single bed. On arrival to the hotel the owner/manager would only accept cash even though the room had been secured by the company credit card, so i informed him that because i had been at work i only had enough cash on me to pay for one night. He said this wasn't a problem just settle up when we collected our invoice and handed in our keys.After work on the second day (we only stayed two days) i went out for tea and not being able to put up with the room any more, only to return with the lady manager and another lady searching my belongings and my colleagues belongings in order to find some valuables which they said was to hold ransom until we paid, even though they had the company credit card. The grand finale is that on the day we left i discovered i have at least 15 big red bites all over my back, shoulders, face and hands. i hope that people read this review and other companies take note and do not simply put your employees in any old hotel", "Date": "May 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cambridge", "Title": "“Bed bugs nightmare”", "Author": "Gotbittenbybedbugs", "ReviewID": "UR10919122", "Content": "I wish I or my friend who booked the hotel have read the review by \" WearyTravellerAgain\", then we could have avoided the awful experience we have encountered. The review by \"WearyTravellerAgain\" has perfectly described the appearance of the Marne as we entered, non-functional flush in the toilet, one side of the taps is missing, filthy shower area that we even didn't want to stand our bared feet on. But all these are nothing compared with the extrodonary sences we later saw in the midnight. I was waken up feeling extremely itchy over my neck, face and even my hands. The moment when I switched on the light, it was an instant shock seeing more than 20 bed bugs running insides my bed!!! Some of them look extremely red as they have been well-fed by me. Similar situation in my friend's bed and we quickly packed our stuff and just wish we could run away from all the bugs. We went down to the reception and tried to ring the bell, it was 4am in the morning and no one answered. We tried to call the owner's mobile, again no success. However, we can clearly hear the woman working in the hotel talking with a man in their room (next to the reception), but they didn't come out despite we range the bell for half an hour. We drop the key in the keybox and left a message explaining the reason and requested a refund. The next day we tried several times to call the owner, but no feedback so far. Our weekend plan in London was ruined as we travelled back instantly that moring and had to wash all our clothes and cleaned all the belongings carefully ( as the bed bugs could transfer and spread anywhere). In the following few days, I had a cold and sore throat. Didn't relate it with the incident with the hotel but a week later since my stay in Marne, I had an outbreak of allergy. Lots of bite-like red spots appeared on my cheek, all over my neck and shoulder. I have got confirmed from my GP that it was very likely due to the bugs. I am very upset about my misfortune getting into this hotel, it was the most awful experience. I've stayed in many youth hostels (some are much cheaper than what we paid this time) before but I never got the luck to see the bed bugs, especially in such a quantity. I sincerely hope such misfortunate will not occur to any traveller. From my oponion, the status of this place is unbearable and they shouldn't be allowed to operate.", "Date": "November 19, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Edinburgh", "Title": "“A Peace camp would be luxurious compared to this dump.......”", "Author": "WearyTravellerAgain", "ReviewID": "UR8654364", "Content": "I had the misfortune of having to stay in this dump. My employer booked my accomadation and on that basis I expect basic but clean and tidy. A travel lodge standard isn't asking too much. Before I went I was suspicious that nowhere can you see a picture of the interior of this hotel and no wonder. However I have that treat in store once I download the pics I took on my mobile. I took these primarily to complain to my employer that this hotel appears in my employers approved hotel list. Decor Appaling, 1970's dark wood panelling on parts of the wall, flaking wallpaper over painted in hideous blue. Lovely rust coloured stains on the ceiling from previous flooding from the room above. No wonder I think its the party suite for boozed up youngsters. TV with 20 foot of ariel cable that is stretched up to the TV. God knows why they bother with the ariel the TV picture is grim. One plug socker in the entire room, not even an adapater. Dust in as many layers as you fancy. Don't look on top of the cheap chip board wardrobe thats where the rubbish gets stored. Carpets throughout threadbare, cheap, worn and stained. Furniture is cheap nasty and ancient. Don't try to move the bed slightly it comes apart in your hands. This establishment charges way over the odds for the dire standards therefore the owners can surely aford something resembling furniture. Jesus even IKEA's stuff is chippendale quality compared to this place. Ensuite Should be called Ens*ite. Shower tray surrounded in thick layers of white mastic (sorry should be white , more a grimmy gunge colour). The tiles in the shower cabinet havent seen a dose of cleaner in long and weary. This is the grimmest place I have stayed in over 30 years of travelling, my only saviour was I didnt pay for it and if I have anything to do with it my company will never pay for anyone else to stay there. Food I cannot comment on the food as the stomach churning room made me less than prepared to sample breakfast. I slept in a chair because I was not prepared to risk the bed on the basis of everything else I saw. Although I must say the linen and towles looked clean enough. Though the Iron doesnt seem to spread to the pillow cases so was hard to tell. The previous review has me baffled. Even on a stag weekend I would not go near this place with a bargepole. \"not somewhere to take your girlfriend or wife on a romantic weekend\" ???? I wouldn't board my dog there. I feel really sorry if any tourists from abroad ever have the misfortune to get this hotel. At least we brits are not surpised by the [--] in some places, the poor bloody foreigner has no chance.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol, UK", "Title": "“Cheap, Good Position - The Marne”", "Author": "IanMitchell", "ReviewID": "UR6339895", "Content": "I and my mates have stayed in the Marne tonnes of times, as it is cheap, lets groups of blokes in, its in a convinient place which is ouside the cogestion zone and just down the road from Victoria coach station. I am from bristol which makes this hotel very easy to commute to by road, also megabus go to Victoria too, there is always parking on the road outside(free after 6pm on Friday till 8am on Monday). However, the rooms are small but clean to be honest. Its not the sort of place you'd want to take your bird to but for a drinking weekend it is spot on. The breakfast in the morning is on the small size but is pretty good.", "Date": "December 6, 2006"}], "HotelInfo": {"Name": "Marne Hotel", "HotelURL": "/ShowUserReviews-g186338-d587105-Reviews-Marne_Hotel-London_England.html", "Price": "$71 - $103*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">34 Belgrave Road</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW1V 1RG</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "587105", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/1d/8a/marne-hotel-thumbnail.jpg"}}