{"Reviews": [{"Content": "A Good Property - Certainly Worth Considering       View from the 15th floor", "Date": "Oct 8, 2008", "ReviewID": "UR936831395", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "GlobalEyes"}, {"Content": "Good but has some weaknesses. This is not really a hotel but a serviced apartment. Some people stay for a short time but others live there for months or years. I staid here for one month. On the whole it was good but I am not sure if it is the best value that you can get.It is clean and its rooms are of course more typical of an apartment than a hotel. They are equipped with full kitchens and laundry machines. The bathrooms are large and elegant. The location is excellent. It is in Wangfujing, one of the major shopping areas of Beijing and close to shopping and the subway. I also liked their cafe in the basement which gives pretty good food for reasonable prices.The service while good, however, is not quite what it would be at a hotel with a smilar price. They clean your room twice a week instead of everyday if you sign a monthly lease. And it does not have some of the other minor perks that many hotels in China will give you (free bottled water, money changing etc).The apartment was generally in good condition but there were minor problems. My bathroom sink could never deliver hot water and did not drain properly. My washer/dryer machine needed to be replaced because its drying function did not work properly. Even the new machine could only handle small loads and took hours to finish them.If you are staying in Beijing for a while it is probably possible to get an equally nice apartment without twice weakly maid service for a much lower cost. If you are staying for a short time and don't need a larger apartment you might be better off staying at a similarly priced hotel like Holiday Inn Downtown Beijing.But still, I can't really complain too much about my stay here. It was convenient and satisfying if not spectacular.", "Date": "May 17, 2008", "ReviewID": "UR173725669", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "HP1972"}, {"Content": "Serviced Apartment close to Beijing sites       one bedroom living room", "Date": "Jun 14, 2007", "ReviewID": "UR131895339", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "garbo"}, {"Content": "Great value and location, very pleased ! Stayed here for 5 nights in November in the one bedroom apartment. The apartment was very spacious, clean (maid service every day) and had good facilities (including internet, gym, pool and a restaurant). I had been unsure whether to try this place or the Tianlun Dynasty hotel which is a few minutes away. I am glad I chose the apartment as it was excellent value being 拢20 per night cheaper than the hotel for an apartment as opposed to just a room, and is in my opinion in a slightly better location.All staff were courteous and helpful. They assisted us each day with directions and writing down in Chinese the names of places we wanted to go to, so we could give the info to taxi drivers. The location for me was excellent. The shops of Wanfujing are minutes away and so is the Donganmen night food market. The restaurant within the apartment was good but there are also plenty of other good options nearby (esp recommend the food hall in the Oriental Plaza mall). If I go to Beijing again I will definitely stay here and would not hesitate to recommend this place.", "Date": "Dec 3, 2006", "ReviewID": "UR474807785", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Fiona06"}, {"Content": "Great Location, Friendly Staff We stayed there for a week with another family. Because we have so many children among us, I find the idea of a service apartment an excellent alternative to a hotel, especially since we paid no more, if not less than another hotel inthe area.Location is excellent, it is 3 minutes away from a western-style shopping mall where you can get all kinds of food, some even delivered to the hotel 24/7. McDonalds is also located in the same mall so our children are just happy to have some familiar food for breakfast for the first day. As a result, we never tried breakfast in the hotel.The rooms are very big, even by North American standard. Our one-bedroom apartment is more than 1000 sq ft. My friend's 3-bedroom looks like a maze, with full size mud-room, walk-in closets and everything.Air conditioning is at the right temp. We were in Beijing in the last week of June and it was very hot outside and most malls and taxis do not have good air-conditioning. So it is always nice to walk into the hotel lobby and feel the cool air on you. Not cold, just refreshingly cool.Staff are very friendly and extremely helpful. There is always some one who can speak good English on the front desk. Cleaning and housekeeping staff are also friendly and they do a good job too, but they don't usually speak English. I had to talk to Front Desk to get things done and delivered.The kitchen does not contain anything, other than a coffee maker and some cups. But if you ask the Front Desk, they can bring you anything you need to make a meal.", "Date": "Jul 28, 2006", "ReviewID": "UR303500730", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "LoveShopping"}, {"Content": "nice apartment at excellent location We, a family of four with to children aged 9 and 10, stayed for a week at Lee Garden. Staff was friendly, especially the bell boy. They were practising there english and I attended an english lesson for the front deks staff. The lessons are a necessity because there english isn麓t too good (on the other hand, neither is my chinese). The apartments are spacious and well equipped although there are no kitchen utensils. The gym was allright and there was a large swimming pool. The indeed asked us (as another travller wrote) to use swimming caps. We bought the cheap ones: 10 yuan. My girls liked the pool and it was something they looked forward to over the day when visting a temple or two.Breakfast is expensive and nothing special so you better make your own or go elsewhere. There麓s enough in the neighbourhood. It麓s on walking distance (15 minutes) of the forbidden city and literaly around the corner of the wangfuijing shopping street and nightmarket.An excellent place for families.", "Date": "Jul 28, 2006", "ReviewID": "UR911771054", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Hoite"}, {"Content": "good location but dirty First the good news: the location is great: center of the city, close to most tourist things. Very safe with things to do at all hours. Also the bathroom is very nice - clean, modern with a separate shower and bath. Better than I had expected.However, two negatives. 1) it's not clean. It looks clean, however, my two young children discovered tons of soot and dust on the carpet near the windows. It was disgusting. After just a few minutes of playing on the carpet, their hands and knees were covered with black dust. 2) the staff is stereotypically bad. When notified of the dirt, they just shrugged their shoulders and ignored my request to clean it.One more thing, the pool is very nice there, but they require everyone (including the men and children) to wear swim caps. If you buy them there they are 30 Yuan.", "Date": "Jul 5, 2006", "ReviewID": "UR536714482", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "induway"}, {"Content": "Perfect place to stay After a crazy ride from the airport, where our driver could not find this place, we finally arrived to friendly night staff who got us settled in. In the morning we discovered how wonderfully located this place was. It is within walking distance of The Forbidden City and Tiananmen Square, interesting shopping and a night food stall market. The rooms were quite large with an adequately equiped kitchen. There is a great health club you can use, as well as yoga and other classes you can take. Look no further for accomodation unless you feel the need to spend lots of money for an overpriced fancy hotel.", "Date": "Mar 18, 2006", "ReviewID": "UR203587636", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Jerry55"}, {"Content": "loved the hotel. and the location is the best! very nice service apartment hotel. the rooms are big with kitchenette. very nice pool. the best location!", "Date": "Feb 2, 2006", "ReviewID": "UR128257241", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294212-d589551-r20734249-Lee_Garden_Service_Apartment_Beijing-Beijing.html", "HotelID": "589551", "Price": "$181"}}