{"Reviews": [{"Content": "cute little hotel We stayed in the Puri Padi for a couple of nights and loved it. Its a peaceful little oasis. The room was pretty with a carved wood door out to the large shaded balcony.The Dirty Duck restaurant just up the street has some great tables where you can lie on big cushions while enjoying your dinner.Its a few minutes walk from the Monkey Forest. If you buy a bag of bananas the monkeys will climb all over you to get at them, which is great fun, sit down on the wall and they will sit on your knee - but beware, refuse to hand over a banana and they can bite you! We know that from personal experience.", "Date": "Apr 20, 2008", "ReviewID": "UR368816450", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Angie-Bruce"}, {"Content": "value for money Everytime we come to Ubud, we've always stayed at this petite hotel. The room is spacious with a balcony facing to the lush green garden and it has also spacious pool. Only the bed sheet and blanket are need to be changed, no extra pilllow in the room. With great services from the friendly staff, we felt that its a really good choice for the get away kind of vacation.", "Date": "Mar 28, 2008", "ReviewID": "UR516264430", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "zazadeo"}, {"Content": "Charming place but shabby room I booked a room at Puri Padi because my first choice (Tegal Sari) was completely booked. Puri Padi is ideally situated. There are tons of good restauratns right across the street from the hotel and the monkey forest and markets were within 10 minute walking distance. The hotel was peaceful, the grounds were nice and the staff were friendly. The room was basic, air conditioned and nicely decorated. However, it was shabby and dirty. The bathroom lights were not working when we arrived. They couldn't fix it until the next day. The bathroom was in poor condition: the door was warped, the floor was dirty, and the towels were stained. Our room had a door that connected to the next room. The door was shut but the walls were so thin that I could hear the guy in the next room snoring VERY LOUDLY and heard their TV clearly (they were watching soccer and were very rowdy even past midnight). Our terrace was littered with what looked like dried fruits or seeds or feces and was not cleaned in the 3 days that we stayed there. The free breakfast that was included was a measly 6 small pieces of fruits and some egg  toast. It was not filling at all. We found some rooms for rent that were far more pleasant and 1/3 of the price that we paid to stay in this hotel. Next time I come back to Ubud, I intend to stay in one of those rooms instead of in this hotel. Regardless of my dissatisfaction with Puri Padi, I have to say that Ubud is a wonderful and beautiful place to visit. I'm looking forward to staying in Ubud again, although probably in a different hotel.", "Date": "Jul 28, 2007", "ReviewID": "UR422488958", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "4"}, "Author": "cwmmh"}, {"Content": "Loved it! I loved this hotel. The setting was really nice and the hotel itself was gorgeous, the rooms and reception were beautiful with really nice details like the painted shutters in the rooms and many statues around the place. The pool was nice and secluded and the whole place was very quiet (I visited in June 2006) It was very good value (US$30 for a double room). I would definitely recommend this hotel!", "Date": "Jun 1, 2007", "ReviewID": "UR558670439", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "Noelle_Ireland"}, {"Content": "Clean and cheap This hotel is located on Jalan Hanoman and is less than 15 mins walk to Monkey Forest Rd (football field). Jalan Hanoman has a lot less traffic than Monkey Forest Rd.; thus a quieter place to stay. The down side is that the hotel is about 25 mins walk to Jalan Raya Ubud where the market, better moneychangers etc are. The hotel is a good budget option. We paid Rp350,000 p/nite for a room with 3 single beds plus b'fast (toasts, eggs, tea/coffee) for 2 adults and 2 kids. The room and bathroom (shower) were clean. I find the room to be lacking in natural light. There was only 1 window which we had to close the shutter for privacy (we were on the grd flloor) but the lighting in the room was sufficient. The hotel staff were friendly and obliging. We had a leaking air-cond one nite and they gave us the adjacent room to sleep in whilst our things remained in our room. The grounds were clean and tidy but not picturesque (perhaps better view from the rooms upstairs) and the pool clean (not so the kids' pools). I recommend the Kakiang Bakery nearby for sandwiches, cakes and tuna steak; and the Indian restaurant across the road - good food, mid range price and lovely paddy views from upstairs.", "Date": "Apr 14, 2007", "ReviewID": "UR654067142", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Nabuni"}, {"Content": "Comfortable and in a great location with fabulous people! I've stayed at the Puri Padi at least 9 times. The staff is so friendly that they began treating me like I was their little sister -their words, not mine! They really made me feel at home every time. The breakfasts are great. Don't wait til your last day to try the jaffle - great with tomato! The atmosphere is comfortable and exotic. The lobby and paths to rooms are are traditionally decorated with statues, carvings, foliage - lovely! The pool is tucked away in a great location allowing you to bask quietly and view some local wildlife. You may even get to swim with some lizards like I did. A great way to relax in the morning as you get over the jetlag.The rooms are just a lovely with beautiful balconies that get lots of use. The bathrooms are marble and most have showers, but some have tubs -ask for what you want in advance. Comfortable beds and plenty of storage for your clothes and stuff. Oh- and the best laundry service ever! Super fast and I think they press everything - even underwear! haha!I'd never stay anywhere else - for the twice the money it's a steal! I love the Puri Padi!Oh one more thing: the serviced is so great that the staff will find you transportation to wherever you've got to go - even if they have to take you themselves! Truly awesome service. If I could gush any more- I would!", "Date": "Jan 2, 2006", "ReviewID": "UR318627082", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "caseybrook"}, {"Content": "Excellent!       reception", "Date": "Nov 20, 2006", "ReviewID": "UR748058866", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "blues007"}, {"Content": "銈忋倞銇ㄣ儶銉笺偤銉娿儢銉仹...   showReview(20348137, 'full');", "Date": "Jan 4, 2004", "ReviewID": "UR858249104", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d590449-r15156962-Puri_Padi_Resort-Ubud_Bali.html", "HotelID": "590449", "Price": "$46"}}