{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "greece", "Title": "“Great location”", "Author": "Evi_st_Greece", "ReviewID": "UR128502235", "Content": "Great location, near to metro station (Urgell). The room was clean and nice...great value for money.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dont Know, Im a traveler", "Title": "“Clean & nice for the price”", "Author": "SilverFang13", "ReviewID": "UR128314418", "Content": "Hotel del Comte ++ +Nice and clean room. +Friendly staff with good english. +Close to Metro station Urgell. +Hairdryer and TV. +Computer with internet in the lobby for free. -No watch/clock in the room. -No mirror, only in the bathroom. -Expensive breakfast, 11 euro. -Thin walls/doors, could hear people talk and flush their toilet from other rooms. +/- About 20min walking distance to La Rambla.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Lovely!”", "Author": "lavajonation", "ReviewID": "UR128182097", "Content": "The location of this hotel is absolutely brilliant, especially for the Airport Bus and any sightseeing you might do. Extremely central and lots of cafes and restaurants in the environs. The room was lovely and clean and the staff were so incredibly helpful. The free wifi was the icing on the cake! I would definitely stay here again.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Location”", "Author": "Neeraj M Posted by an Easytobook.com traveler", "ReviewID": "UR127630173", "Content": "Location of the Hotel is Excellent and the service provided was very nice indeed. Though the room seemed to be slightly small, but its still great value for money. Its very close to the metro and that makes it easy to access. Cheers", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portland, Oregon, United States", "Title": "“Clean and nice for the price”", "Author": "Craiger S", "ReviewID": "UR125939592", "Content": "Rooms were very clean and the staff was friendly. We spent 3 nights here and had no complaints. Rooms were a little small but for the price we really couldn't ask for much more. The hotel is within a short walking distance to all of the major areas; but yet far enough away to avoid most of the street noise. If you are looking for a clean place to stay at a fair price, you can't go wrong with Hotel del Comte.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "new york", "Title": "“VERY RUDE & PICTURES ARE SOOOOO DIFFERENT THAN THE REALITY”", "Author": "jasmin e Posted by an Easytobook.com traveler", "ReviewID": "UR125899945", "Content": "we stayed there for 3 nights of nightmares. didn't have a good sleep at all, because the walls were too thin and you can hear the other guests in their rooms. the staff were very impolite. they put us on a \"non smoking\" floor and the room reeked smoke, people were smoking in the hallways. the bathroom made too much noise during the night. there were so much noise, fights and screams in the hotel. we asked to change the room the next day and they refused. when we complained to the reception, the \"boss\" came out of his small office and screamed at us, \"if you don't like the place then leave\" . we had already payed them upfront, when we asked for our money back, they refused and yet he was telling us we can leave in a very rude manner.we didn't have any privacy during our stay. the cleaning staff made so much noise in the morning and even when we had the 'do not disturb' sign on the door, they still knocked to clean. IT WAS A TERRIBLE EXPERIENCE AND I WOULD NEVER RETURN THERE AGAIN.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Versailles, France", "Title": "“Faultless really and good value”", "Author": "merila t", "ReviewID": "UR124877286", "Content": "Spent just one night here, but would happily have stayed longer and will certainly go back. The hotel is located within easy walking distance of the likes of the Rambla - but far enough away to avoid the not so good elements of the main tourist strip. Spotlessly clean, nice style (feels way better than its official 2 star ranking.) We had a room around the back which didn’t have a view - but was blissfully quiet.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location for the price”", "Author": "G K", "ReviewID": "UR123843807", "Content": "Paid a reasonable price to stay here midweek. Hotel is in a good location, in the heart of Barcelona's gay district. Lots of friendly local bars and restaurants scattered around the hotel and Urgell metro station is a 5 minute walk. Rooms were a little small, but not uncomfortable so. Bed was comfortable and the bathroom was fine. Everything was clean and reasonably well maintained. The breakfast was also decent.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "piemonte", "Title": "“Del Comte Hotel”", "Author": "daniloeale", "ReviewID": "UR122392408", "Content": "Me, my wife and our friends spent four days at Del Comte Hotel in November 2011 while we visited Barcelona. Perfect location, the hotel is situated five minutes walk from metro, bus and aerobus station (if you like twenty minutes walk to Plaza de Catalugna and Rambla). The accommodation was perfect. The room was spotlessly clean and very comfortable. Delicious breakfast. I’ll stay for sure at Del Comte Hotel if I come back to Barcelona.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Great value”", "Author": "ckblah", "ReviewID": "UR122372628", "Content": "Great hotel that's very convenient located in a quiet area. It is located near Urgell metro station. The room was clean, big and airy. WiFi was available free-of-charge though the signal was relatively weak. Staff was extremely helpful and friendly. There are cafes and a supermarket nearby. Breakfast offered a good selection, though the pastries were lack-lustre. From the airport, the Aerobus takes passengers to Urgell metro station where you can alight and walk over, very convenient. If leaving in the middle of the night, one may take bus N17 near Urgell station to reach the airport. It's really cheap and you can even use T10 on the bus.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pleasant stay, very good for 2 star”", "Author": "Eagle10_6", "ReviewID": "UR121730297", "Content": "15 minutes walk into the city centre, the location is fairly good. Transport links are very close. The standard bus from the airport stops about 15 minutes walk away but there is a connecting tube service which stops just round the corner. Good advice at the front desk for the main area with good restaurants. Fairly good facilities for 2 star with one free computer and internet connection which was available to use most of the time. Breakfast was expensive so went to nearby venues.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“A quick view”", "Author": "Matthew-Melas", "ReviewID": "UR120110977", "Content": "We had a 3 nights in Barcelona and our stay in Comte Hotel was very pleasant! Its very centered, with very good breakfast and also is a very clean hotel! The rooms maybe is small and the soundproof was poor. But it does not matters a lot, when you have to do so many things during the day...", "Date": "November 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice hotel near the city center, recommended.”", "Author": "AndersN2", "ReviewID": "UR116796636", "Content": "We booked late and got this 2 star hotel located in the city center. 4 persons in 2 double rooms for 3 nights ended up at appr. 350 EUR. Breakfast was not included but was an extra 10 EUR per person. We had ours in different local restaurants instead. The hotel was clean and the personal was very nice and helpful. Free Wi-Fi and access to a PC in the lobby. The rooms were of normal standard but there were no minibar. Might be what causes 2 stars instead if 3....? I would gladly give them 3 as I very seldom use the mini bar anyway. I can really recommend it. Close, friendly and well worth the money. The following is cited from bocking.com: \"Hotel Del Comte is located in Barcelona’s Eixample district, just 100 metres from Urgell Metro Station. It offers modern rooms with free Wi-Fi and a flat-screen TV with satellite channels. The air-conditioned rooms at Del Comte feature parquet floors and smart design. Each one comes with a work desk and a private bathroom with a hairdryer. Staff at the Del Comte Hotel’s 24-hour reception can provide information about what to see and do in Barcelona. The hotel also offers private parking. (35 EUR/day) There is a bus stop just 3 minutes’ walk from the Del Comte which provides transport connections to Barcelona El Prat Airport. It is only 2 stops on the Metro to Plaza Catalunya, Barcelona’s main square. Hotel Rooms: 42, Hotel Chain: Eurostars Hotels.\"", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "2"}, "AuthorLocation": "Oslo, Norway", "Title": "“Just what you need in Barcelona”", "Author": "BetttyFoxx", "ReviewID": "UR116242993", "Content": "We went to Barcelona to visit friends/get tattooed and stayed at hotel del comte because it was as cheap as getting a hostel for the two of us. We were really surprised by the size of the room (so big!) and the standard of the bathroom (amazing). Quiet running AC made it a really good place to be with a fresh and painfull tattoo. We also enjoyed the location, although we sometimes struggled to find good places to eat nearby. This being said, the staff was not very customer service oriented, the internet didn't work and the walls were very thin. We'd definitely go back. Good value for money and comfortable in the summer heat. Also, the airport bus stops right around the corner - very handy!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Location only”", "Author": "orfanio", "ReviewID": "UR115765920", "Content": "I stayed there for a long weekend on my own having to attend a conference. I booked a double room and I was surprised to see that my room was nothing more than a cage! After long discussions I got upgrated eventually the next day. The other room was average but still below my expectations. The reason I am writing a negative review was the attitude of the manager. I asked for an iron as I had to sort out my outfit for the conference. I was very surprised to hear that the hotel provides no iron and I should go to a dry cleaner!! I was so frustrated! I insisted but the manager ignored me and continued talking in spanish with other members of staff. At the end I managed to get an iron from the cleaners after 2 hours of research but I was late for the meeting. I am usually very easy to please but I really felt very upset from this behavior. The location is perfect but this place is definetely to be avoided.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5"}, "AuthorLocation": "hertzlia israel", "Title": "“great location near evrything!!”", "Author": "liranmalka", "ReviewID": "UR113402488", "Content": "the wall in the rooms are very thin- you can hear evrything and evryone can hear you", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Location": "4", "Value": "5"}, "AuthorLocation": "Tangier, Morocco", "Title": "“Great Hotel”", "Author": "MedLarbi_Trips", "ReviewID": "UR99878740", "Content": "This Hotel was perfect for both of us me and my friend, its very well organized, so close to La Rambla wich is the center of Barcelona.. so clean, with a good price :) when am coming back to Barcelona am staying there!! :)", "Date": "March 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Perfect location”", "Author": "navigator_th", "ReviewID": "UR99781416", "Content": "We are so happy to stay in this hotel because of many great things. The location is perfect. It is only one block from Metro station and Aero Bus stop FROM airport (2 blocks for Aero Bus stop TO airport). There is a supermarket right next door so you can have your own breakfast or lunch cheaply and easily. Many nice restaurants are around the area so you have many choices to choose as well. The room is nice, modern and clean. The heater and free WiFi work well. The best thing is bathroom. It is really beautiful and clean. I love that. The window can lock well so we didn't hear any noise from the road and sleep well. However, the wall was quite thin. We heard some teenagers hung out from other rooms clearly. We also heard when the people walked in the hall way because of the floor. The staffs are helpful. They explained me everything we wanted to know and helped us print our boarding pass. It is very good value for that cheap price. We will definitely stay in this hotel if we have to go to Barcelona again. I strongly recommend this hotel to everyone.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Good and cheap”", "Author": "traxstar", "ReviewID": "UR98008224", "Content": "Positive: The hotel is placed about 15-20min of walking to La Rambla. Close to metro, only around the corner, Urgell. The staff was nice and helpful, talked very good english. It was Clean and had a tv so we could watch other soccer matches. Had a computer with internet that was free. Had hairdryer. Negative: The room didnt have any fridgerator. No clock. No mirror on the wall, had to use bathroom. Could here people from other room talking and when they flush the toilet. Breakfast for 11euro is expensive and didnt had alot to offer.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oliva, Spain", "Title": "“Clean, comfy, good location, some internal noise”", "Author": "chrissie2689", "ReviewID": "UR86508851", "Content": "We had a double room looking onto a flat roof, comfortable, reasonable size, with a large bathroom, lovely walk-in shower. Every day it was cleaned immaculately. Not much traffic noise, great location for the Metro and buses. Large wardrobe but otherwise minimalist, no clock, mini bar, kettle, only small tubes of shower gel provided. Breakfast is expensive, don't eat in the hotel, go to a cafe round the corner (Quin is good) where you can get anything cooked to order for much less. For us the room was stiflingly hot all the time, not sure if it was just in our room, we could not adjust it lower. The wooden floors also amplified any corridoor noise and the walls are thin too, so we did not sleep well. No early morning interruption from cleaners though. Staff friendly, although we did not need them for anything.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Valletta", "Title": "“Central, comfortable, good price”", "Author": "cbhomework", "ReviewID": "UR60626481", "Content": "The upside of the hotel was the location. It was just corner away to Urgell metro station (Line 1). Exit the metro station at Comte d'Urgell and it is a few metres walk. Alternatively walking to the central Placa Catalunya is not that far either. There are two supermarkets nearby. We didn't have breakfast in the hotel priced at 8euro plus tax per person since there are quite a good number of coffee shops in the area. There are also a couple of good restaurants in the same street and the ones parallel to it. The room was clean and had a shower/bath. Using the safe in the room and internet were free of charge. Receptionist available 24hr. The negative comment is that if a room neighbour decides to have a bath/shower at any time, you can easily hear the water gushing out from the shower head. The sound actually woke me up twice in the middle of the night!", "Date": "April 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Buenos Aires", "Title": "“Nice price / services”", "Author": "MerYChris", "ReviewID": "UR59598732", "Content": "Very good breakfast, just one block away from the subway. Very nice and clean hotel. Low prices.", "Date": "March 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“nice hotel but noisy laminate flooring”", "Author": "neilgScotland", "ReviewID": "UR59365301", "Content": "Stayed here recently for 4 nights. The good news. Reception staff wonderful, great price for room - £40 a night, free internet at reception, rooms clean & modern looking, free safe in room, slim tv (only 1 english channel sky news that constantly loops but less adverts), good location (handy tube station) though prefer to be a little nearer the action (closer to playa de catalunya). We didnt try the breakfast so can't comment- just go to a local cafe or Boqueria market. The bad news. No tea/coffee making facilities in room. The hallways are made of laminate flooring. You walk in thinking this looks really nice and modern but then you have a nights sleep and you get constantly woken up by the noise of suitcase wheels rolling along the floor as people get up early and check out. We stayed 4 nights and I tried ear plugs (to no avail) but shouldn't have had to really. A shame would have given this 5+ stars and recommended but the most important thing about staying anywhere is you get a good nights sleep and this we did not. Oh for a bit of beige carpet! Sorry if this sounds harsh, just my thoughts.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Etobicoke, Canada", "Title": "“Good hotel - great location”", "Author": "Seraphimo", "ReviewID": "UR57930656", "Content": "I just stayed at the Hotel Del Comte from March 2 - March 5, 2010. I was visiting Spain for the first time with my spouse and decided to choose Hotel Del Comte due to its great location. The best part is that you can connect from the airport by taking Aerobus A1 from the airport than stops at Urgell metro and then the hotel is a block walk up on Del Comte. On the way back to the airport too, the stop is 2 blocks south on Sepulveda - it is Euro 5 per person per trip. The buses are very frequent running every 6-12mins depending on the time of day. It is truly situated in a very central part of Barcelona, central to everything - metro (Urgell - red line). For my LGBT friends, this is 2-3 blocks to the gay area of Eixample - so you can party all night and then walk back to the hotel. As for the hotel, the room we got was a back room #215, the street facing part of the hotel - so it can get a bit noisy from the traffic. The rooms need better windows to keep the noise out. The room was comfortable and clean when we got there with enough closet space for the 2 of us. The bathroom has a walk in shower with good hot water. There are no bedside clocks here, as is the norm in any European hotel, so if you are used to it bring along a travel watch. They only provide a shampoo/body gel combo tube, so if you like your own brand, bring one along. The bed mattress was great in my opinion, I like a firm mattress. The room is also safe as far as valuables storage is concerned - there is a safe in the room, I just put a lock on my bag when I was out. The rooms are a bit thin-walled, so if you have a noisy neighbor, you may hear it - I had a tour group staying on the floor and it was noisy some nights. The hotel has a breakfast buffet for Euro 9 but your can skip it and grab breakfast otuside at the tapas joints around or at the supermarket below the hotel called Dia market - things are very cheap hear. You can buy bottled water for 19c/bottle - we never spent more than Euro 5 for 2 people for breakfast there. Overall I may stay at this hotel again, Barcelona is a fabulous place for a visit.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Tampere", "Title": "“Great hotel, good location and not expensive”", "Author": "Lars_Garfield", "ReviewID": "UR52755337", "Content": "A Great, clean and stylish hotel. Air conditioner worked very well and staff were very friendly. Location was good, 50 m from Airbus stop and just 5 minutes walk from center.", "Date": "January 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "europe", "Title": "“great staff, very nice hotel”", "Author": "rxndra", "ReviewID": "UR52364678", "Content": "we arrived later than expected but the receptionist was very nice, understood our problem and kept us a free room. every time we needed any sort of information there was someone there to help us very kindly. the rooms are big enough, and everything is very clean. the area is quiet and close to the tube station. you get downtown in 5 minutes. the breakfast is varied and delicious! whenever i'll be back in barcelona i'll definitely pick this hotel again!", "Date": "January 2, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Good Budget Hotel, nice location”", "Author": "sasilverman", "ReviewID": "UR50264330", "Content": "For a 2 star hotel at just under £50 a night you can't really ask for more! Rooms were decent size and clean. The hotel is a few minutes walk from the arebus stop from the airport, and the stop going back to the airport only across the road. Right by the hotel is a supermarket and a number of cafes. Free wifi was a big plus, although you did have to sign up to a service called wifly to use. Remember though, you get what you pay for and this is a budget hotel, so if you are looking for luxury beds, towels and a tv with many channels this is not the place for you! Could also do with carpetted hallways and thicker walls as noise really travels. Apart from that, good location only 10-15 minute walk from Placa de Catalunya, which is the central hub for La Rambla, Passeig de Gracia and Barri Gotic. Also right by a metro stop which links you with the rest of town, and is only 2 stops down from Espanya station should you want to go to Montserrat. Would I recommend? Yes. Would I stay again.... next time I would probably look for somewhere a little closer to the centre.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Moscow", "Title": "“Good choice”", "Author": "jjyMoscow", "ReviewID": "UR48539744", "Content": "Basic hotel with very good location (close to la Rambla, metro Urgell in 3 min walk) Supermarket is just a few steps away from the hotel's door. Staff is helpful, room was small but very clean. Can't rate the breakfast 'cause we didnt' have it (a lot of places to eat are around, incl. 'buffet libre'). If you are gonna not stay in the hotel all day around, it's a good choise. Pro : location, location, location! Contra : no fridge, no balcony.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "bratislava/vienna", "Title": "“again ... and very satisfied”", "Author": "anduska", "ReviewID": "UR48317969", "Content": "This was my second stay at this hotel and I can only recommend it to you. Its location is central, price is fine, staff is helpful, internet is free, rooms are clean and nice. The view is nothing special, but If you travel to Bracelona you dont usually look out of the window, but you go out and explore the city, so It didn't bother me.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "oxford", "Title": "“Unbeatable for the price”", "Author": "chappers2341", "ReviewID": "UR46099718", "Content": "Have stayed in many places in Barcelona form basic to top end and HDC is perfect right in the middle. Found the hotel to be clean, the staff helpful and the facilities adequate.Don't stay here if you want plenty of frills. There is a buffet breakfast, (not that you really need it in Barcelona you are far better off going straight out), free internet in reception and wi-fi throughout.But thats about it. The rooms are a bit basic but once again that doesn't realy matter as most of your time will be spent out and about. Once again I would thouroughly recommend it and would have no hestitation staying there again.I have stayed in flea pits for the same price The hotel is far enough out to be quiet at night, but only 1 minute(if that) from the nearest metro and a 15 minute stroll to the top of La Rambla and only a 30 minute stroll to the born/port", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Galway", "Title": "“very nice hotel”", "Author": "kasia_pestka", "ReviewID": "UR42699780", "Content": "very nice hotel, good location, close to city centre and metro", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denmark", "Title": "“I'd stay there again”", "Author": "kopfli", "ReviewID": "UR21544267", "Content": "This hotel is very good for the price: - location: not in the middle of sights, but waking distance (30 min.) to almost everything. - very helpfull staff - good, clean rooms - aerobus stops just outside", "Date": "November 4, 2008"}, {"Ratings": {"Service": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Newcastle, England", "Title": "“There must be better places than this.....”", "Author": "S_Jane040", "ReviewID": "UR20780036", "Content": "I booked the Del Comte after seeing the reviews on Trip Advisor. The location is fine, but I found the hotel depressing and the staff unhelpful. The 2 rooms we booked both had windows facing onto a drab internal courtyard. The rooms are dark, basic and despite switching rooms twice, the 'Non Smoking' rooms all stank of both stale and recent smoke. Very unpleasant. When we complained about the smell the concierge shrugged and said 'they are Non Smoking rooms. If someone chooses to smoke in them, what can I do? I have no other rooms.' No apology - nothing. Incidentally, the Non Smoking rooms have ashtrays in them so I guess clean ashtrays = Non Smoking, whilst dirty ashtrays = smoking. The same employee was also supremely unhelful to another guest who asked for the number of the Spanish operator while I was waiting to change rooms. Same shrug, same lack of care. Avoid the Del Comte.", "Date": "October 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Highly Recommended”", "Author": "PracticedTraveler", "ReviewID": "UR20545484", "Content": "We stayed at Hotel del Comte last month for 2 nights. They spoke English, were helpful with questions and had free wi-fi in the room. The room was new, immaculate and quiet. Location couldn't have been better. It was a 10-15 minute walk to Las Ramblas. The area is quiet and safe at all hours. There is a grocery store around the corner. It's 2 blocks from the metro and two blocks from the Aerobus to/from the airport. We arrived close to midnight, check-in was painless and went out for a stroll over to Las Ramblas which was still awake at that hour and felt safe on the main streets. I would stay here again in a minute. Don't expect the Hilton, this is a business travelers hotel with minimal frills, but for us, was perfect!", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great Stay!!”", "Author": "zhaleh", "ReviewID": "UR20393434", "Content": "Just finished a 3 night break at the Hotel Del Comte and i do not have a bad word to say about the hotel. Metro is a 2 minute walk where you can get to anywhere in the city within 20minutes. Rooms are very modern and clean. Area is quiet at night and only 5 minute walk to centre for shopping and nightlife.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vienna", "Title": "“Nice stay”", "Author": "Manekineko_AT", "ReviewID": "UR16915791", "Content": "Very well situated, metro station 5 min. on foot, Ramblas/Av. Diagonal/Montjuic in 15 minutes on foot. Nice and safe area. Our room was new, small, essential, with telephone and TV. No panoramic view from the window, actually only a wall with other room windows. Everything was clean. We can confirm what has been said about the thin walls, bring your ear plugs with you if you do not have a heavy sleep. Did not try the breakfast buffet as we found it overpriced. You can have a decent breakfast in any of the numerous bar-cafes in the surroundings.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sheffield", "Title": "“Amazing for a 2 star hotel!!”", "Author": "russky72", "ReviewID": "UR15186707", "Content": "Was slightly concerned when this was a two star but read reviews which were good so booked it - at a good price compared to everywhere else in Barcelona! Was extremely pleased with the hotel. Reception were welcoming and helpful in immediately giving us a map and explaining best places to go. The rooms were very clean, modern and spacious. It is only 20 minutes pleasant walk from the centre (top of las ramblas), or there is the metro round the corner - or a taxi is about 10 euros. There was free internet access. Only grumble is the noise from the street - you could hear noise from the street most of the night as it was double glazing not triple glazing but this seems to be pretty much the norm in Barcelona from reading other reviews in other hotels.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Hotel Comte average, but good location for the price”", "Author": "lurking", "ReviewID": "UR14564567", "Content": "Book via their own website. US based hotels.com or others do not seem to work with this hotel. The hotel is about a 12 minute walk to Placa Catalunia, the center of Barcelona. The price and quality is a good deal. I recommend it. Rooms were good, and the noise is lower than average for most downtown Barcelona hotels. Overall, a very good deal, especially during the week. I recommend booking it if under 100 euros per night.", "Date": "March 26, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“We saw Ronaldinho!”", "Author": "bt83", "ReviewID": "UR13209176", "Content": "I was impressed with the Hotel. It is in a great location, just around the corner from Urgell Metro stop. At night when the metro closes after mid night it only cost us €5 in a taxi from La Ramblas. Even though the Hotel is Fairly central, it is very quiet and not once during our 3 nights was I disturbed by traffic or noise. The bathrooms are great and also have a bath which is perfect for relaxing in after walking all day. Comparing it other places I have stayed for the same price or even more expensice, this place wins hands down. The highlight of our stay however was when we were checking in, the football star Ronaldinho was sitting in the lounge waiting for his ride!!", "Date": "February 2, 2008"}], "HotelInfo": {"Name": "Hotel del Comte", "HotelURL": "/ShowUserReviews-g187497-d590411-Reviews-Hotel_del_Comte-Barcelona_Catalonia.html", "Price": "$106 - $301*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Diputacion, 142-148</span>, <span class=\"locality\"><span property=\"v:postal-code\">08015</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "590411", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/54/dc/08/hotel.jpg"}}