{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Frist Class”", "Author": "perthchrissie", "ReviewID": "UR128391703", "Content": "Stayed here for 2 nights after our cruise. Was upgraded into Premier Room which included the crystal club facilities. Can not fault this hotel, the location is right on Orchard Road, but not noisy, the room was very warm & clean (you don't want to leave the room) the crystal club was the best, we had personalised service, the staff remembered your name & also what you drink (they made your drinks) The staff were very friendly, we normally stay at the Holiday Inn, I would highly recommend this hotel over any, next time I come to Singapore I will definitely stay here", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“GREAT service”", "Author": "gregii_la", "ReviewID": "UR128375512", "Content": "Ever so friendly and accommodating. Staff here are very friendly, helpful and approachable. Location is 'pretty much on Orchard Road' (67 steps from the entrance), opposite of Paragon (shopping complex). I treated this room as 'sleep and internet' because my trip was Singapore, not Grand Park Orchard. Access to transportation is good. If you want to stay in a hotel that knows your name and looks after you, look no further. It's no MBS or Hilton, but they will look after you BETTER than these hotels. ONLY criticisms I can give is the room I stayed in, it doesn't seem professionally assembled (crooked bars, taps)... only to do with aesthetics.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Feldkirchen, Deutschland", "Title": "“Excellent service”", "Author": "Felix_Wuff", "ReviewID": "UR128307578", "Content": "I stayed there for a full week due to a business trip. Very friendly staff all around, excellent service. Clean and trendy rooms; internet comes both wired and wireless, especially the wired connection is speedful and stable. A little minus for the location of the pool and the gym, you have to cross the lobby for both - which is a bit weird, wearing a bath robe. Very nice and delicious breakfast.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Pros & Cons”", "Author": "kina28", "ReviewID": "UR128258985", "Content": "Stayed here during easter promotion. Paid almost SGD$800 for 3 nights stayed. Located in d middle of orchard road right next to Paragon. Check-in is on 4th floor. Requested quiet & higher floor but was given room on 6th floor. Wasn't impress with d room as it looks smaller than d pics in website. There was no view, only view of construction & it's noisy. Quite a number of TV channels but boring selections. Available dvd player & Ipod/Iphone dock. Very comfortable bed but d lights not bright enough. Useless table clock as it did not show d proper time. Tried to adjust it but couldn't find any button for settings. WiFi was not all that. Had to go to d bathroom to get a stronger connection. Room service was good but not house-keeping. Left in d morning & got back around 3pm, found house-keeping in d room. The lady was not friendly and was frowning. Couldn't understand her English. Did not expect this in 5 stars hotel. Did not find her clean well, doubt she vacuum d floor, & toiletries were not replaced. Had to ask her for d missing items. Upon check-out, told d receptionist regarding d house-keeping. All she could say was will inform but did not see her write/file down. 1 more thing, found ants in d room esp on d table. In a nut shell, hotel is excellent for its location but not other aspects. Was disappointed somehow.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ballarat", "Title": "“Great experience”", "Author": "Guy V", "ReviewID": "UR128257979", "Content": "We had a short stay at this hotel and experienced a very professional and friendly staff. We had a problem just before we had to leave. This was resolved immediately at no extra cost. This hotel looks after their guests!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scarsdale, NY", "Title": "“Modern and Location. Say no more”", "Author": "Jaynyc2", "ReviewID": "UR128253971", "Content": "Beautiful, modern, relatively new hotel located in the heart of Orchard Road. While the address says Orchard Road, it is really on a side street just off of Orchard Road. One taxi driver knew exactly where the hotel was. Another had no clue and I had to give him some landmarks (next to Paragon. Across from Ngee Ann City). When you enter the hotel, you have to take the lift to the floor, walk across the lobby to take a lift to the guest rooms. I was upgraded to the Crystal Club floor, which entitled access to the Crystal Club (with free breakfast). WiFi was free, though sluggish at times having me log back in from time to time.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“FANTASTIC HOTEL”", "Author": "Robin L", "ReviewID": "UR128237051", "Content": "A very grand and fabulous hotel in Singapore. They have the best service staff and efficient service. Facilities are limited but sufficient. I stayed in the Crystal Club Floor, the room was rather cozy and relaxing. The location is good as it is in the heart of Singapore's shopping district, Orchard Road. When I arrived, I felt that this hotel is very modern and classy. The bellmen were very helpful, although the reception was slightly slow but their good service made up for it. And when I requested for Extra blankets and for the housekeeping to make-up my room, the staff on the phone was determined to make sure that I was satisfied. Overall my stay at the hotel was enjoyable and a pleasant one. If I have a chance to come to Singapore again, this hotel will definitely be my first choice.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Makati, Philippines", "Title": "“It's all about LOCATION! LOCATION! LOCATION!”", "Author": "Keslergo", "ReviewID": "UR128151621", "Content": "Date of Stay: February 10-13,2012 Reservations: Agoda.com Room Type: Deluxe Room Upgrade: Deluxe Club Room Loyalty Card: Location: Just across from Paragon and Ngee Ann City, I’ve already stayed at this hotel twice when the rates at Grand Hyatt are too high. Everything on Orchard is within walking distance from the hotel. Check-in: I was informed I was being upgraded upon check in however I actually asked if its possible to request fro a room facing the other side because the rooms facing Paragon has a metal shade which blocks the light from coming in. Unfortunately there are no rooms available so I had to settle with it. Room: Room is small but adequate…it's okay for a solo traveller but I think if you had a companion it would be a tight squeeze. Specially after spending days of shopping and all the loot is scattered on the hotel room floor. The only thing bothering me is the photo on top of the headboard. I don't know who she is, and don't know why the designers have selected to put a photo of her in guestrooms, it would have been better if it’s a photo of Singapore or Nature…something less…hmmm freaky. Bathroom: I like the bathroom layout although it’s not big, the shower stall with a separate tub is very spacious. Check-out: Check-out was simple, since everything was prepaid, I didn't have to deal with anything upon check out and was out of the hotel in less than 10 minutes. Overall: It’s all about Location! Location! Location! Meritus Mandarin is just across but the rooms there are really crappy, so for about the same price you get good location and a better room.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denpasar, Bali, Indonesia", "Title": "“Weekend Orchard Shopping trip”", "Author": "Christopher S", "ReviewID": "UR128115891", "Content": "Great location on Orchard in the middle of the Golden mile on Singapore's premier shopping strip. This hotel offers excellent service and amenities you would expect in any 5 star Orchard Rd hotel but without the 5 star price. The staff were helpful, courteous and friendly. Only draw back was cleaning of our room during our stay left a little to be desired.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Best value great serivce”", "Author": "2012travelguide", "ReviewID": "UR127954543", "Content": "A great hotel, Crystal Club Floor, wonderful service attention to detail. Very welcoming great service, great position, Suitable to both couples and families rooms not overly large but comfortable Transfer arranged and prompt and efficient A great experience.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“beware of noise, lots of noise”", "Author": "ccaappccoo", "ReviewID": "UR127601134", "Content": "Stayed at the hotel April 5 - 8. Location is excellent, directly opposite Paragon arcade, and close to Mardarin hotel, Takashimaya and Nee On City. Entrance is at Bideford Road, and from the entrance at ground level one has to take a lift to 4th Floor and walk across the entire length of the hall to the passenger lifts at the end of the hall. Hotel was booked in HK via travel agent. Prepaid room price was slightly over US$300 per night all in. Breakfast was included. Here comes the tricky part: the hotel has a gigantic electronic billboard on its front facing Orchard Rd. The electronic billboard was hellishly noisy, emitting bright lights throughout the entire day non-stop from 9:30 a.m. until 11:30 p.m. each and every day. To add insult to injury, in addition to the monstrously large and noisy electronic billboard, the hotel's bar located on 4th Floor is visible from certain rooms. The rooms most affected are located near the passenger lifts. The bar is a noisy place and the noise is IN ADDITION to the noise from the electronic billboard. We didn't know this at check-in, and they tried to slip us a noisy room on the 7th floor next to the lift. But as soon as we opened the room door we knew we were screwed as the noise was deafening, and while we were looking down to the bar 3 floors down, people sitting in the bar were looking up at us ! there was absolutely no privacy. We asked for a room change pointing out the noise issues and to the hotel's credit, they obliged without any struggle and we were given a smaller room on 10th floor looking at the back. The view wasn't great at the back but at least it was quiet. The room size was small but passable, all the equipment worked properly. Minibar prices were exorbitant but that is to be expected in this class of hotel. The bed was OK, the room was clean. The aircon is slightly colder than it should but one quickly gots used to it. Straits Times newspaper was delivered daily in the morning and placed in a slot outside the room for pickup by guests. Breakfast was included and it was quite OK, the best part is the fresh fruits, lots of it. The management should seriously think about getting rid of the electronic billboard, lose the rental for that monstrous piece of equipment, but gain lots of appreciative customers who will stay there again. Those rooms with window which looks down at the bar and vice versa should be turned into function rooms, as they are not suitable to sleep in. That, or they cut the size of the bar. But perhaps the hotel has a design flaw which can't be rectified easily.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland, USA", "Title": "“Great Service!”", "Author": "iag2011", "ReviewID": "UR127454675", "Content": "Grand Park Orchard is located directly across the street from Takashimaya Dept. store and Paragon Mall. The service staff and amenities in the Crystal Club level were outstanding, catering to our every needs. The staff could speak several languages, including Bahasa Indonesia and English. One evening I was sick and didn't go out with our group for dinner. The staff on-duty that evening had prepared a off-menu dish for me. The next time he saw me, he made it a point to ask if I was better. Our 1 bedroom suite was very nice, and had full-size computer monitor and keyboard(free wifi) and many other amenities. Although the living room area was not the biggest space, there was enough room for our group of 6 to gather before heading out. I would highly recommend this hotel.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Very good value”", "Author": "Clovis G", "ReviewID": "UR127294229", "Content": "Have been there for a week on business. The Crystal Club services are fantastic - good welcome, quiet at the room and very good support from the staff at the Club. Had utilized the meeting room for 3 times and always with good suport - they provided cofee, tea, etc like an office of my own. And no extra price for the meeting room use, all included in the Club. For business people without local office a very good option. The refreshments and cocktails in the afternoon were very well serviced, with nice food and beverages, the breakfast was well served. No remarks. The staff was very nice and happy to help you all the time. I will stay there on any mext visit.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Excellent Service”", "Author": "ctashana", "ReviewID": "UR127224337", "Content": "We stayed at the club deluxe room for 3 nights in March. The service is excellent, they usher us to the club lounge for check in and the reception can speak bahasa indonesia, as we are Indonesian this is a plus. The room is quite small but it has everything that we needed even dvd player, ipod dock, free wifi and we get the option to choose the breakfast place in the louge or the coffee shop. The price is quite reasonable as well, as it is already include free wifi and breakfast for 2. Hotel rooms in singapore mostly charge extra for this. The location is also great as it is in the middle of Orchard room. We will definitely consider to stay at this hotel again when we visit singapore.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Sensational!”", "Author": "Mathew C", "ReviewID": "UR126825038", "Content": "This is by far the nicest hotel I have stayed in recently. Everything from the service (almost too good), location and the standard of rooms. I highly recommend upgrading to the Crystal Club. Makes you feel even more exclusive and no one can argue with the drinks and nibbles every evening. Also a great bar down stairs. Would definately advise family and friends to choose this hotel.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“It's best feature is its location”", "Author": "waitwhatsnext", "ReviewID": "UR126613660", "Content": "Stayed here in late Feb and was upgraded to a Club room. Even this room was quite small but clean and with a modern feel. The breakfast buffet was OK as hotel breakfast buffets go. We only ate there on the first day and after that found places like Wild Honey nearby that are much better and cheaper as well. The staff are fantastically helpful and friendly. This hotels best feature is it's location tho.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Convenience hotel”", "Author": "ELRITA07", "ReviewID": "UR126607141", "Content": "Please adjust to lower price and add Food & Beverage for breakfast", "Date": "March 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "IRELAND", "Title": "“Fab barman”", "Author": "SAMSCROSS", "ReviewID": "UR126588217", "Content": "Stayed here early Mar and got upgraded to Club room which was quiet nice.The breakfast and bar food was good and staff very friendly.The barman was most helpful and recommended we go to Clarks Quay for something to eat which turned out to be great and would never have found out about it only for him.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Very loud noise from water flow next door”", "Author": "puriindah", "ReviewID": "UR126541150", "Content": "We stayed 6nights in march 2012. Location is excellent close to paragon and takashimaya Clean room. Beds are a little bit small especially if you are European standards but in Singapore beds are small Only drawback was we could hear \"loud\" water flowing and tap turning when someone next room uses the bathroom 1 oclock in the morning Housekeeping kept cutting down our small and medium towels and we had to remind them that we needed those Room cleaning was also very late at 4pm every day so when we came back , room was not clean all the time Other than that it was a fair stay", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent location, service, everything!”", "Author": "Lzl25", "ReviewID": "UR125276187", "Content": "I am absolutely in love with this hotel. I would definitely stay here again. It is in the perfect location on Orchard road, the staff are friendly and the decor is chic and modern. The room was lovely and fitted with modern amenities. I wouldn't recommended it is a family hotel though however.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“A PERFECTLY located hotel to be for a (shopping & food fest) short weekend!”", "Author": "Ashton168", "ReviewID": "UR124807700", "Content": "If you are looking for an awesomely located hotel, well, this is it!! It is conveniently located on Orchard Road, where all the shopping, food & people actions are!! My sister & I stayed for 2 nights for a shopping weekend & thought it was a perfect hotel to be in terms of location. The hotel itself is modern & quite new approx. 2 years old) as it was totally renovated from its days of the old Crown Prince Hotel. Rooms are rather small (compared to other hotel, such as Mandarin Orchard which is located across the road), but I purely chose this hotel because I've stayed at Mandarin Orchard & wanted to try a newer hotel. In saying that, it is still OK for a short weekend as we were hardly in the room, & it was only there for us to freshen up & sleep, all other times were spent in Orchard eating & shopping! Rooms are kept adequately clean...in addition, for a hotel which is located in the hustle & bustle heart of Singapore the rooms are comfortably quiet. Staff are polite, friendly & quite efficient. One morning I forgot to put my diamond rings & watch but they were left untouched in the room, so cleaning staff are to be highly regarded for their honesty & integrity. If I must make a weak point of the place, is that the check in lobby is located on the 4th floor & we always have to take 2 lifts in order to get to our room everytime. Not so sure as to the reason for this as both guests & non-guests can always take the lifts to the room floors without swipe/room keys, so security was a tad disappointing. We know Singapore hotels can be quite expensive, I think the room rate was quite reasonable for its premier & convenient location, I would definitely recommend this establishment, but perhaps only for couples or girls trips as I think it would be too crammed for a family for sure!!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great hotel, great staff, great location!”", "Author": "CPRatna", "ReviewID": "UR124471201", "Content": "Stayed in a very beautiful premier twin room on 10th floor. It was a great room with very nice view. Staff were all very helpful and friendly. Will definitely stay again.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“One week stay”", "Author": "Rtravel-the-world", "ReviewID": "UR124458377", "Content": "Excellent hotel crew, polite and caring and willing to make the best out of your stay. Rooms are very nice, clean, comfortable. Good restaurant for lunch & dinner, big breakfast. Take the christal club room when available. perfect service!", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Very nice hotel,highly recommended!”", "Author": "CindyZX", "ReviewID": "UR124294686", "Content": "Very nice hotel, great location - within walking distance to everywhere (MRT stations, restaurants, shopping centres etc etc) The lobby was fabulous. The room was also very well designed! Internet was free there and the speed was fast! Staff members were friendly and helpful!", "Date": "February 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, affordable too”", "Author": "Meysha10", "ReviewID": "UR124184428", "Content": "The drawback was housekeeping staff had forgotten to resupply toilet amenities and clean towels two consecutive days. Otherwise economically sensible for strategic location", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Beautiful, romantic and convenient place to stay”", "Author": "Elizabeth L", "ReviewID": "UR124059664", "Content": "I stayed at Grand Park Orchard on 29 January on the way back to Perth from Malaysia. I have stayed at the old Park Hotel numerous times before its major renovation. This was the first time I stayed at Grand Park Orchard after the renovation. As I stepped into the lobby on the 4th floor, the modern and sleek decor caught my eyes immediately. Checking in was very quick and within 2 minutes after I walked into my room, the concierge had delivered my luggage to my room. The room was not very big but comfortable enough for two people. Decoration of the room was romantic and modern. Room was very clean and modern. Hotel was surrounded by shopping centres. It is located at the most convenient location on Orchard Road. Free internet access in the room was a big bonus. Breakfast had a good variety of food. Bed was very comfortable and gosh... sound proof in the room was exceptionally good. I love this hotel and will not hesitate to recommend it to my family and friends.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location with good disabled facilities”", "Author": "FloraWood", "ReviewID": "UR123822729", "Content": "Stayed in this hotel in July 2011 with my cousin and 90 year old grandmother. We requested a triple share room with wheelchair accessible bathroom. Whilst my grandmother is not confined to a wheelchair we wanted to eliminate any risk of having a shower over a bathtub. While there was some confusion over our requirements during the booking stage we were relieved to receive a twin room with roll away bed and wheelchair accessible bathroom. Unfortunately the drainage in the bathroom left something to be desired and entire bathroom was left flooded whenever anyone had a shower. This posed a hazard for anyone using the bathroom after someone had showered but staff were responsive when we called reception and requested someone to mop it up each morning. Staff were very good and accommodating and paid special attention to my elderly grandmother. We were even able to borrow a wheelchair from the hotel for part of our stay and the hotel has a wheelchair ramp at the front to make access easy. Location is very central on Orchard Rd. Only drawback is the swimming pool. It has a glass side which reminds me of a seal exhibit at a zoo as people by the pool, bar and reception can see you underwater in the pool.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice Boutique Hotel Close to everything”", "Author": "David H", "ReviewID": "UR123576818", "Content": "Had a excellent stay for 7 nights for a family event. This hotel is right in the middle of Orchard Rd shops, very convenient for shopping, yet quiet and relaxing. Interior is modern, stylish and clean. Booking a club room was well worthwhile, with many enjoyable hours spent relaxing over breakfast, afternoon tea and cocktails, chatting with the friendly and professional staff.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Perfect location”", "Author": "Jan B", "ReviewID": "UR123059265", "Content": "Close to train station, bus and shopping centers. Great location, nice large rooms with all amenities.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Outstanding Service and Fantastic Location”", "Author": "Toni F", "ReviewID": "UR122855669", "Content": "My husband and I stayed in this hotel for 5 nights only very recently. This is the second time we have stayed in this hotel and can not speak highly enough of the staff. The location of the hotel is ideal due to it being right on Orchard Road and so close to Somerset MRT station. It is also very close to the underground supermarket at Paragon if you require anything. We stayed in the Club Rooms and the service we received in the Crystal Club was absolutely outstanding. Hashim, Allam and Susan from the Crystal Club all provided outstanding service and nothing was ever too much trouble. They always had time to have a chat and a laugh and also provided information to ensure you got the best out of your stay in Singapore, they really are a credit to the hotel. The Crystal Club does provide guests with private check in/out facilities along with a limited breakfast, afternoon tea and evening drinks and canapés which is perfect after a long day shopping. It is great to have time to relax before heading out for the evening. The only negative we have in regard to the hotel was the air-conditioning. We tried to adjust the temperature but it was still like an ice box so at times we had to turn it off to remain comfortable. We will definitely be back to stay at Grand Park Orchard Singapore.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location”", "Author": "David L", "ReviewID": "UR122807821", "Content": "This is the 2nd time we have stayed here. We usually choose Mandarin (opposite) or this hotel. This time around we chose it as we got the club room and internet included. The service is always excellent, its always great that theres always somebody at the lift to have the lift opened before you get to the door! Only issue we had was there were no towels when we checked in, but thats a little issue, there was a house keeper in the hall so it was quickly sorted out. I accidently left $200 in the open, and was surprised it wasnt touched. Breakfast is ok, nothing fantastic, but it covers all bases. Clean modern rooms, only that the rooms are slightly small. I took a club room this time as i thought it would be a touch bigger, but it looked the same size. Overall its a great hotel and yes we would stay again!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colombo", "Title": "“central location”", "Author": "Kasun P", "ReviewID": "UR122559974", "Content": "It was a last minute online booking and we arrived to the place bit too early but early check-in was arranged in a very friendly manner.The hotel's location is great and almost every place around is in walking distance . the newly refurbished rooms are in top quality. I would definitely recommend this place to anyone.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne,Australia", "Title": "“Pick this hotel for Location for tired feet”", "Author": "Tsa_RyszardMom", "ReviewID": "UR122494705", "Content": "Compare to its competitor in term of room spacious,yes it is cramp.my room 827 had problem with aircon,call to fix it no prob,but my other room 831 also got aircon problem.The bathtub is narrow,for me 172cm i can only soak 1/4 of my body. Yes the housekeeping standar is an issue,they didnt give hand/face towel whereas theres a hangging but no towel.Nevertheles they always knock my door around 9-ish and clean all my 4 room. Room service is Ok but menu not that complete,the in room breakfast package american breakfast is so so compare to royal plaza.Hainan chicken good,nasi goreng really greasy taste not Ok,seafood horfun very delicious. The reception is Ok fast,they give 2 room as I arrived arround 11,and the rest they give it around 5. Quick step to 7/11 for snack etc,little step arrived to Paragon,so very convinient for Location. About noise yes i can hear some noise,my room very near elevator but my family didnt bother with any noise. However the pillow very not comfy,sleep quality not great. Also the bathroom no toilet shower,yes they have problem with bathroom smell and the drain,but maybe its understandable its an old renovated hotel. But i hardly ever spend much time only sleep and shower,so for me still acceptable.BUt if you want leisure maybe go to Intercontinental/Goodwordpark for really fine hotel room.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Family holiday”", "Author": "JLotsos", "ReviewID": "UR122404834", "Content": "The location is fabulous if you want to be right near the shops. We had a club room and the rooms are pretty small but we did manage to put a cot in the room. I think most hotel rooms in Singapore are small but i Singapore is not the sort of place that you want to just sit around in a hotel room as there is too much action outside. There is a afternoon tea in the club lounge every afternoon but don't expect much. Some very small dry sandwiches, a few small cakes and dry biscuits. We asked for a pot of tea and was told by the butler the machine does it for you and when we asked for milk the butler told the lady off for getting us some and made us have the hot frothy milk from the espresso machine which is not very nice in tea. Very poor service when you are paying for a club room. It was not a relaxed atmosphere. We couldn't check into our room until 5pm which is quite late and they knew that there was three adults in the room but gave us a room with two single beds. However without a fuss they did move us to a room with more beds. We had the buffet breakfast in the main restaurant which was very nice. Forget the club room breakfast. The pool is small and as long as you don't mind walking through an outside bar area to get to the pool you will be fine. Not a place to have a swim at nignt when everyone is dressed up and looking at you from the bar. Overall it was a fairly nice hotel but The Royal Plaza on Scotts which is similar in price has a far better club room. Stay here if you want to be right near the shops!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Close to the action and nice hotel”", "Author": "Ton363", "ReviewID": "UR122046303", "Content": "This hotel is right next to bustling Orchard Road, the heartbeat of Singapore's shopping district. It is also within a close vicinity of the other attractions of Singapore - airport, Sentosa island, zoo and botanical gardens, restaurants around the city. The hotel is very clean, modern and cosy. The club level breakfast feels small but you can order what you wish. All the amenities are available on the club level are worth the extra (internet with webcam, specific hotel staff and laundry items). The only pity was the check-in that should have been directed to the club level for speedier check-in instead of general reception. The pool and bar area are very inviting and the gym is quite good and well located, given its size. All in all, a good stay that we would consider again on a trip to Singapore. Loved the city - clean, hospitable and ease of communication!", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Nice Hotel and Great for Shoppers”", "Author": "kenthien", "ReviewID": "UR121734894", "Content": "The hotel is located in Orchard opposite of Ngee Ann City and beside Paragon. This will be the ideal hotel for shoppers. The hotel staffs are great, friendly and helpful. The only downside is the room is a bit small though. I would recommend this hotel to anyone who wants to stay in Orchard.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Excellant Location”", "Author": "Ruby_Roo_08", "ReviewID": "UR121719769", "Content": "Excellant location, close to everything. We stayed on the 10th floor, which didnt have much of a view (a construction site). We requested a nice view as it was our honeymoon. The rooms are nice however bathrooms are very small but clean. We had access to the crystal lounge, which was excellant. Staff in here were helpful and food and drinks after a long day was great. Howie, from Conceige was fantastic and always willing to help", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Nice new hotel”", "Author": "nicholasdamian", "ReviewID": "UR121715999", "Content": "Well, as expected, the rooms are very small but it is expected from Singapore. What I like is the coziness of the rooms and the it is located in the heart of Orchard. The price can be too steep for the small room but I guess I went for convenience, and also free internet which is a must in this day and age (Mandarin Orchard is quite nice too but the franchise hotels are too outdated with customers having to pay for internet). I will definitely come back here every time I travel to Singapore.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Really Nice Hotel”", "Author": "NomadLooloo", "ReviewID": "UR121547652", "Content": "Like all Asian hotels, they also have thick slippers! I know some people don't care about that but we do and it's cool that they have it. Customer service is also really good and nothing beats their location - if you like shopping and walking around. Their room is also nice - we just had a minor problem with the hair dryer (it started spitting out small black plastic pieces and sounded like it was about to explode) but other than that, everything was fine. (Didn't pay much attention to the fact that we had a picture of a blonde model above our bed haha) But we will definitely come back!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great customer service”", "Author": "hotelgetaways", "ReviewID": "UR121228540", "Content": "Crystal club 11 floor is really the place to relax and pamper yourselves with great service and food after a busy stressful week. Residents can habe the bird-eye view of bustling Orchard road while enjoying the peaceful and quiet ambience when relaxing at the Crystal club. Furthermore, the hotel and the staff were very responsive to resident's enquires, and generous with their high quality food and cocktail even though its complimentary benefits of the Crystal club residents. Needless to say, the cleanliness and housekeeping are excellent. Overall, its really a good bargain, and I will definitely visit grand park orchard again.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Beautiful Sensation”", "Author": "World_Traveller87_11", "ReviewID": "UR121200433", "Content": "Graded as a 5 star hotel, located in town of Singapore, it is a perfect place for accommodation. With perfect service at the reception counter, plus a quality house-keeping standard, Grand Park Orchard is as good as a home. Crystal Club serve residents of the hotel with respect and smile, with good butler to pamper us.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“One of the nicest club lounges - great business trip!”", "Author": "fluffychick17", "ReviewID": "UR121200409", "Content": "Travelling to Singapore and Malaysia regulary for business we have stayed in several of the many many hotels in Singapore. This was a first time in the Grand Park Orchard, and we hope not the last. The staff were all very good. Susan (and her team) in the Crystal lounge were excellent, Hashim, Yvette, Sammi and Alun were particulary friendly and made an effort to look after us (10 day stay). As a husband and wife team, but business guests, the rooms were nice, but not spacious to work in and a bit cramped for for a longish stay (although we had booked a crystal club premier king), however, we were always welcomed to work in the lounge or to use the meeting room (which we did alot). The instant connection to wireless was great ( some hotels use codes so it made a nice change to just click open and go). If we have any less positive comments, the pool and the gym are located off the reception and bar area and without changing rooms and so you feel very exposed walking down past lots of other guests in bathers and a robe and returning via the bar wet, or for the gym, having to return to your room all hot and sweaty! It would be perfect if the fitness amenaties were a little better planned. But too late now as all built. :) all in all a good trip however, and we would plan to return next time.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great service”", "Author": "faura", "ReviewID": "UR121075445", "Content": "Stayed here for 4 nights in November 2011 in a deluxe room. Seems to be popular with medical tourists, especially from Indonesia. Probably because of the hospitals nearby. Great location in the middle of Orchard rd. Pros: Excellent service from the staff. Apart from a long delay at check-in, the staff were friendly, prompt, and very courteous. And the elevator button was always pressed, so the elevator would be waiting for you. The deluxe room was comfortable and well insulated from noise. So I can only imagine all the other rooms are even better. Good amenities in the bathroom, including a rainfall shower that was a nice touch. Breakfast and lunch were quite decent. Maybe after several days one would tire of the offerings, but that would be your fault for not pacing yourself :). Generally high quality everywhere - architecture, linens, etc. No cons really, but some minor things that made us go \"huh?\" They advertise great views of Orchard Rd from the swimming pool. Unless you count the tops of buildings and trees as a view, you don't really see anything. The pool is in a strange location, with the reception area next to it, separated by a glass wall. Every room has a painting of a blonde woman in various dresses, it takes up a whole wall at the head of the bed. (see traveler photos by other guests.) Strange, bemusing, and since it's about the only decoration in the room, I'd love to know the story behind the choice of this curious interior decoration. To get to your room, you climb up stairs outside, take an elevator upstairs to the lobby area, walk across the length of the hotel to another elevator bank take that up to your floor. Kind of a trudge.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "la niche", "Title": "“fantastic location”", "Author": "cachoux", "ReviewID": "UR120854268", "Content": "this brand new hotel is the really spot to go in singapor : deluxe rooms are not big but very very well concieved, nothing missing.and quiet Nice lobby, nice outside bar,good restaurant tiny swimming pool but enough as we spend a lot of time sightseeing and shopping", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "aussie", "Title": "“Good location”", "Author": "AussieRedwine", "ReviewID": "UR120807300", "Content": "We stayed for 4nights in October. We had booked two rooms for 4adults 3children, which was accepted as we booked direct with hotel. On arrival we were informed we had to use existing bedding, which was 2king beds. On booking we were given the impression a rollout would be supplied at no charge for a child. This was incorrect for an additional charge of $80per night we could have rollout. After a discussion with the manager he agreed to allow us one rollout at no extra charge. Although not ideal this was all that was offered. The rooms are very small so really not ideal for families. We had booked crystal club, this club the staff (females) where very accommodating and friendly. We have stayed in executive clubs in other hotels which are much better. The nibbles were not replenished regularly, so if you were a little late into the club you had very little selection, so the idea is to get in very early. Hopefully they will rectify this .", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bern, Switzerland", "Title": "“Location, Location, Location”", "Author": "seda79", "ReviewID": "UR120482486", "Content": "Stayed at the Grand Park in late October on a family vacation for 3 nights. We had two rooms on the Crystal Club Floor. Location: Fantastic if you want to explore Singapore by MRT (great underground transportation system) You have the choice of getting on the MRT at 313@Sommerset which is also a really nice shopping mall with great places to have a drink (especially \"Brotzeit\" an alfresco Pub serving German beers and providing free WIFI internet) or catch MRT at Orchard station which is located at the new \"ION\" shopping mall. The excellent location will make up for the slightly high price tag of the Grand Park. Rooms/ Amenities: The rooms are modern, the beds very comfortable (my folks slept as long as never before) and the bathroom comes with a great rain shower. All in all; very functional and comfortable rooms but nothing to write a postcard home. Service: As we were staying at the Crystal Club floor (which I can recommend) we had access to the Crystal Club Lounge managed by the ever smiling and ever present Susan. Susan and her team of concierges were great, always up for a chat and full of helpful information for your daily activities. They will recommend the best way for you to go China Town, Little India etc as well as good restaurants and shops. The complimentary afternoon teas and 5 o'clock cocktail hours were very pleasant. All staff we dealt with was polite, well groomed and courteous. Food and Beverage: Breakfast at the main restaurant was good with a large choice of Western and Asian dishes. You may want to ask for fresh machine coffee (they happily provide) which is excellent. Breakfast at the Crystal Club Lounge was a bit smaller but OK and the coffee and tea selection is great. There is a large outdoor lounge/ bar area by the pool which is OK for a late night drink. Verdict: The location has convinced me I have done the right choice. If you can, go for Crystal Club Floor so you can have the little extras that just make your day that much more enjoyable.", "Date": "November 11, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Perth, Australia", "Title": "“No Refund Policy Stings”", "Author": "Jim K", "ReviewID": "UR120361857", "Content": "This month booked this hotel via Agoda.com.au and on the same day cancelled the booking. Site was misleading and although I got a confirmation of the cancellation but because of the hotel's no refund policy, I lost over A$1,400 for nothing. Not knowing that there is no refund I then booked a differenct hotel for A$1,200. Please in the future do not book hotels that have a no refund policy.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Eindhoven, The Netherlands", "Title": "“Just not too sure about it”", "Author": "14NABster", "ReviewID": "UR120194393", "Content": "I stayed here for two weeks due to business. I am just not too sure about it. For the rate paid I would expect more of everything. The room was small and it din't feel like new and luxuries. I would've expected more from a hotel in Singapore on Orchard road. I had the deluxe room which had the view on a construction site. I am afraid it will become a high rise so the view from the small window won't improve. the bathroom was ok although it felt it needed some repair. The outside bar and swimming pool look nice but the drinks are too expensive the music too loud when visited in the evening. more a club than a place to unwind. If i haven't had a conference near the hotel, I would've probably booked a different hotel. Still it is far from a bad hotel. It is just not what I woul have expected.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide , Sth Aust", "Title": "“Location and service excellence”", "Author": "Athelstonian", "ReviewID": "UR120139056", "Content": "I took my two daughters and a 13yr old Grand Daughter for 5 days shopping in Singapore, we had 2 twin bedded adjoining rooms andour booking included the Crystal Lounge privileges - well worth it. The hotel is not too huge and able to give good service, taking the time to explain things and very fast to get back to you with answers. We appreciated the free WiFi throughout the hotel and the ability to print boarding passes in the lounge for free. The Staff - particularly all the staff in the Club lounge ( incl Nora) were exceptionally helpful. The concierge was a fountain of knowledge and made all bookings effortless. No complaints what so ever. This hotel has the best location, in house spa and pool, great food and free French Champagne in the club lounge. Emily gives a fantastic \"deep Tissue\" massage too!", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bandung, Indonesia", "Title": "“Best value for Orchard 2011”", "Author": "bminata", "ReviewID": "UR120065190", "Content": "Much nicer than the last one I stayed in for only slightly higher price, so I guess it's a good value. Much better location too - smack in the middle of Orchard Road, across Meritus Mandarin. To get better hotel at this location you need to go to a much higher price. Minor negative point: you need to go thru two elevators to get to your room.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Exceptional Service, Brilliant Crystal Club Lounge, Supurb”", "Author": "George H", "ReviewID": "UR120061384", "Content": "Above Expectations in all areas. Great Style, Nicely appointed rooms, with many inclusions, such a free internet, laundry, afternoon tea, evening cocktails, super late checkout, dvd player, Sony TV, huge shower, good breakfast. Best of all though was the service and the Club Lounge. ALL the staff (especially Nora Lynn and her colleagues whose names I wrote down but can not find now) were wonderful and very warm, friendly people. They were genuine and made you feel at home everytime you walked in the lounge. They also served Verve Cliquot Champagne each night, along with a full bar and nibbles which was excellent. We started our stay on the right foot, with a 5PM! late checkout, as we had a night flight and ended it with Nora Lynn walking us to our taxi personally when we left - and then in a true show of how dedicated the staff are, would not accept my tip. I really must stress how much my wife and I enjoyed this hotel, but especially the Club Lounge staff. They really made our stay special. Will definitely return to this hotel. Location is perfect too.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Puchong", "Title": "“Great Hotel in Orchard”", "Author": "chongoc", "ReviewID": "UR119705918", "Content": "I stayed 2 nights at this hotel on my recent business trip. I thought the price was a bit on the bit on the high side but it's smack in the middle of Orchard Road. The complimentary Champagne on arrival was a nice touch and refreshing. They also gave S$100 shopping voucher from Knightsbridge from 2 designer labels. I was also upgraded to the Club Room as the deluxe was full. A bit disappointed by the size but was just using it sleep so it didn't matter too much. Other plus points are It was very clean, it has a gym with limited state of the art cardio threadmills. (Bring your ear phones as the threadmill had personal TV monitors). Lastly they have a nice spread of breakfast buffet. Not as many choices as other 4/5stars hotels but sufficient to give you a great start for the day.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Excellent location!!!”", "Author": "secretbee", "ReviewID": "UR119571095", "Content": "We just got back home after staying in this hotel for 4 nights. We had previously stayed here 5 years ago when it was still the Crowne Hotel and found its location on Orchard Road unbeatable since we spent most of the time in the shopping malls. We planned to do the same thing this year so we did our booking online. We were three adults so the hotel's location in the middle of the Orchard strip allowed us to go to different malls individually, depending on our own personal interests, and just meet up for meals or take a rest whenever we needed it. The best new malls are right beside or right across this hotel. Our room was small (deluxe) but it had very comfy beds and pillows. It did overlook a construction site but there was little noise that got in through the large window. The only thing that seemed amiss was that there was no cream provided for the free coffee and tea. And everytime we asked room service for some, it never came (happened twice). Very puzzling indeed. I once asked room service for some ice and a whole bucket was delivered promptly. So what's the problem with the cream??? The service people were courteous and attentive overall. My adult son had a great time relaxing in the pool and working out at the well-equipped gym. The bathroom was small but had everything we needed, with good quality toiletries included. I found the room too dark and the lighting too weak for reading in bed though. If only the lamp covers were transparent and white, instead of black, the room would look much less gloomy. I also didn't like the huge wallpaper of a model in a gown located on top of the headboard. Found it weird and spooky. We would stay in this hotel again mainly because of its great location.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Perfect location for shopping”", "Author": "rooleyes", "ReviewID": "UR119532582", "Content": "We stayed for just 2 nights at this hotel in a Crystal Club room. We picked the hotel for it's location being on Orchard Road, so very handy for shopping - it was a great choice for this purpose. The room was not large but well appointed and very clean. Again the bathroom was not large but help spotlessly clean. The Crystal Club lounge was very good - it was not large, but we only ever found a handful of people there when we visited. The staff in the lounge were excellent and couldn't do enough to help. We had breakfast in the lounge, and whilst the variety was limited, it was more than enough for what we required. One evening we had dinner in the main restaurant, and it was very good. Again the staff were very helpful and attentive. Overall we enjoyed our stay at the hotel, it suited our purpose for being able to get to the shops and back quickly. We had no issues getting a taxi from the hotel, so didn't experience the issues others have mentioned. No hesitation in returning to the hotel again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Loved our stay”", "Author": "Blancs2008", "ReviewID": "UR119511406", "Content": "We stayed in this hotel in October 2011 for 3 nights. It was expensive however so were all the other hotels in this location. We were not disappointed. We were greeted with Verve Clicquot champagne on arrival and shown to our 'upgraded' room. It had all the creature comforts including ipod dock, amazing marble bathroom with both a rain shower and hose. The decor of the hotel was original and classy. Great location if you are wanting to hit the Orchard strip of shopping. The Paragon shopping centre across the road had a fabulous food court with loads of frech food which was made right in front of you. The Japanese place that has a guy making soba noodles in the window is to die for. So are the steamed dumplings from the Chinese place in the back corner which may chefs in the window dressed in white. And for dessert try the bread shop in particular the steam buns they were AMAZING!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“One of the best stays I have ever experienced!!”", "Author": "Eamon07", "ReviewID": "UR119388859", "Content": "An absolutely incredible stay! The Crystal Club Lounge is a must experience for this hotel. I arrived for a short 2 night stopover on the way to Perth, Australia from Dublin, Ireland. Lets just say this hotel had everything!! Location is incredible, a stone's throw away from all shopping centres. Service was one of the best I have ever experience thanks to everyone at the Crystal Club Lounge who were fantastic... A special mention to Fahim and Alam who were incredible. Accommodating in every single way! They were a pleasant to have around and made my stay very enjoyable :-) The Grand Park Orchard will definitely be my first choice stay when I come back to Singapore!", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Istanbul,Turkey", "Title": "“''good location for shoppers''”", "Author": "ERTUG777", "ReviewID": "UR119376612", "Content": "Have stayed in many hotels on the Orchard Road and I can say this one deserves the money you pay. Make the booking online , it is safe and easy , ask for upgrade to a premier room so now you have a nice room for 2 people + free wi-fi ( which is working very good ) and free breakfast (very nice open buffet ) all included . Of course the location ,very close to shopping malls like Paragon , Takashimaya , ion and others. Even if you are not visiting Singapore for shopping you can use the MRT lines which are very close to go where ever you want. The room service is very good , the staff is helpful , the bar .the pool ,the gym center all ok. The main idea here is you have to pay min.100 usd extra per day to other 4-5 star hotels on the Orchard Road for all of the above. Taxi fare is around 10-12 sgd to the Marina Bay , Sentosa island or Clarke Quay . Go to Cova in Paragon shopping mall first floor for a very good cappuccino and fresh deserts when you need to take a break from shopping.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great location but...”", "Author": "Singapore_trav", "ReviewID": "UR119219190", "Content": "Ok, it's in the heart of Singapore's iconic shopping belt but the rooms are small, the aircon not effective and the flat screen tv faulty. We took the club room which meant access to the club floor. But we discovered the buffet breakfast is far better at the main restaurant on the 4th floor. Overall, an ok stay though we felt other hotels nearby might have been a better bet.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Makati, Philippines", "Title": "“Location Location Location!”", "Author": "Chrin", "ReviewID": "UR119144271", "Content": "Like the title implies--LOCATION of this hotel is great. It's central to the Orchard shopping area, which was perfect for our needs. Just step out of the hotel and you're in the center of all the big malls--Paragon immediately across, Takashimaya/Ngee Ann City diagonally across, Wisma Atria and Ion Malls within just 5 minutes (and ergo the MRT). Location was important for us this trip since I'm pregnant, and when I'd get tired I could easily head to the hotel while the hubby continues exploring. Hotel itself was quite nice. Rooms were newly renovated--very modern, clean, and comfortable. Standard hotel room amenities were all there--toiletries, terry robe, hairdryer, in-room iron. Bottled water was complementary and replenished daily. Wi-fi was free and fast enough (for emailing and browsing). All the staff we encountered (from front desk, to resto, to doormen), were friendly and helpful. There was an inviting pool and gym, which we didn't get to use. The breakfast buffet included in our rate had ample choices for us (egg station, cold and hot food options, dimsum, cereals and breads). There's a little thing that proved a big plus for me--I was able to print out our boarding passes for free! I know it's a small thing, but it really irritates me when hotels charge for little things like printing on a piece of paper. So kudos, Grand Park Orchard!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“great location - crystal club floor not worth it”", "Author": "smurdy24", "ReviewID": "UR119068033", "Content": "If your heading to Singapore for shopping then this hotel is perfect for you, just steps away from some of the best shopping Orchard Road has to offer. Charles & Keith anyone?! There's about 3 of them located within a 1km radius :) plus tones of other great shops, restaurants and cafes. We upgraded to a crystal club floor room because there were 3 of us staying in the room. Unfortunately I have to say we were a little disappointed in the size of the room. It was quite small, defiantly not big enough for 3 people. (Lucky we were all close friends) Also when we arrived only a double bed was in the room, so we had to wait for someone to bring in a roll away bed, something which we would have expected been done prior to us arriving in the room. The breakfast on the Crystal Club floor is nothing to rave about, not much of a selection to choose from. We excpected a bit more on offer. The breakfast area on the 4th floor (where all the other hotel guests go who aren't on the Club floor go) looked like it had a better range. I coudln't really see what was so good about being on the Club Crystal floor compared to a standard floor. I would say save your money and spend it in some of the shops along Orchard ;) Also there are no power points in the bathrooms so if you want to blow-dry or straighten your hair you have to do it out where the mini-bar and mirror is located. (hard for 3 girls to share) The iron in our rooms was broken and we requested a new one, which we never received. The air-conditioning stopped working half way through one of the nights we were there, and with 3 bodies in a confined space - it got pretty hot and stuffy. Luckily the workman was able to fix it. All 3 of us found the beds very hard and uncomfortable. On the last night there I woke up with a sore neck and back. I know I sound like I'm whining a lot but my friends who stayed in the room had the same opinions so it's only fair we share them with others. I really wanted to love this hotel, and prior to arriving I was quite excited. But after staying there I'm a little disappointed. Maybe I set my expectations too high.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Stylish, good standard, great attitude of staff.”", "Author": "bethnyman", "ReviewID": "UR119066095", "Content": "Very pleasant stay. All amenities are a good standard and the room was lovely. The food and service are excellent and the staff could not do enough. The location is great - just near all the Orchard Rd action. I will definitely be coming back.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very Centrally Located Boutique Hotel on Orchard”", "Author": "civetta11", "ReviewID": "UR118727811", "Content": "A lovely new boutique hotel directly across form Paragon Mall and surrounded by endless high end shops of Orchard Road. Check-in was very good, the Front Office staff were friendly and offered a genuinely warm welcome. I was allocated a room on the 9th floor, my window looks out to the lit up 'Gucci' logo from the store across the hotel. Rooms are very dark, so probably not so suitable if you are going there on business and need to work from your hotel room. Having said that, they have a very good Business Centre on the lobby floor which is free to use. Right opposite that there is a very happening lounge/ bar next to the hotel pool. The hotel restaurant is of quite a good standard, breakfast there provides a good start to the day with efficient, courteous service.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Good Hotel spoilt by all the noise”", "Author": "ShaunScotland", "ReviewID": "UR118714735", "Content": "While checking in we were offered an up grade to a better room for an extra $50 Singa. We accepted and soon regreted it. We were given a room right on the corner of the hotel which was next to the huge TV advertising which faces orchard road. The room was huge and well equipped with a bath and rainforest shower and top quality fixtures and fittings. We have no problem with the fixtures and fittings it was the noise outside that caused all the problems. The shopping centre next door blasts out advertisment jingles from early until 2330hrs, it was so loud that we could not hear certain channels on our TV, which has a restricter fitted to the volume. The hotel does have double glazing but it is not up to the job. Once the next door noise finished, I realised that the large advertisement on the Grand Park also had speakers which \"dronned on\" even longer. In the end I had to sleep with my spare ear plugs which I had left over from the formula one. To make matters worse the other end of the hotel has a huge construction site next door. Due to being un able to get a good nights sleep I would not stay in this hotel again.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bangkok", "Title": "“Excellent location”", "Author": "Profiterole", "ReviewID": "UR118396630", "Content": "This hotel is all about location. We chose it because of its location on Orchard and it didn't disappoint. It's next to paragon shopping and takashimaya, and a short walking distances to all the shopping complexes on Orchard. The price was also slightly cheaper than the other hotels in the same area. We previously stayed at the mandarin meritus which is opposite the grand park orchard, but i prefer the grand park orchard. Also there is always a taxi in front of the hotel to take you to other places. This hotel was also less than 10 mins drive from universal studios and the taxi ride only cost about 15 sing dollars. We didn't try the food at the hotel because it was quite expensive. But not to worry. There is plenty to eat in Paragon next door and in Takashimaya (big shopping mall). Din Tai fung is an excellent dumpling restaurant right next door in Paragon shopping mall, along with other good restaurants. There is also a place called crystal jade in Takashimaya which offers excellent chinese food. For breakfast, there was a gloria jean's opposite hotel which had nice coffee and bakery stuff. There is also a convenience store adjacent to the hotel to buy snacks and drinks. We didn't get to test drive all aspects of the services. But the check in was fast and efficient, and the porter was reasonably quick to deliver the luggages to our room. The interior design of the hotel is modern and clean looking. The only negative thing i would say about this hotel is that the room is a bit small and the bathroom was even smaller! If you are in Singapore, we would recommend eating chilli crab or pepper crab at this place called Jumbo. It was absolutely yummy.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great hotel, great position”", "Author": "Monika152", "ReviewID": "UR118304674", "Content": "We very impressed with hotel. Not cheap but couldn't fault anything. On arrival the gentleman at reception was very friendly, gave us an upgrade (without asking). The room wasn't small (as stated by other reviewers). The bathroom was a good size and very clean. It was very handy to lots of shopping. We had a very pleasant 2 nights stopover on way to London.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“NOT a hotel for Family”", "Author": "shane l", "ReviewID": "UR117874290", "Content": "Firstly the staff were fantastic except 1. I have stayed in many hotels, this is not a hotel for a family of 3. Booked a triple room, it had 2 single beds and another single bed was wheeled in later! Very,very tiny room. Extremely disappointed, smallest room ever stayed in, even £25 Premier Inn rooms are bigger Complained about it and the duty manager allowed my family and in-laws in the next room to have a late check-out. Double checked it in the morning and only one room had been booked for late check out, so had to go back up to level 6 to move all bags into 1 room. Not worth the money and would not stay there again.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Tokyo", "Title": "“Club Room too small, overall good service”", "Author": "Mariko_Yogi", "ReviewID": "UR117855559", "Content": "I booked a Club Room through the internet to celebrate my husband's birthday and our anniversary. The price at SGD400 was not too bad, until we checked into the rooms. We were very surprised to find indeed the rooms are very very small for a Club Room. The attached bathroom was worse. Too small for 2 people to be inside. It made me don't feel like using the bathroom at all. It's more like a boutique hotel i would say. The only good thing is that you can access to Club floor evening cocktails and tea time. The tea time is nothing, but the cocktail is good if you drink. If not, i don't think its really worth it to pay 400 for the Club Room. For breakfast, we chose to have it at the lobby instead of the club floor. Breakfast was ok, the spread nothing much to rave about, anyway its a 4 star hotel, what can you expect. But to a little disappointment, my husband had a food poisoning shortly after that. Lasted for 2 days. Hopefully not due to the breakfast... as i did not have it. The pro is that the service is really good and prompt. Friendly and helpful staffs. The con will be the room size and the construction noise that is going on opposite the building, which continued until bout 9pm? When we made the booking, we stated that we are celebrating birthday and anniversary, and requested for a room away from the elevator. But i guess these requests were not looked into. Nothing special was done (expected something due to paying Club room price) and was given a room right next to elevator. I would like other hotels if i am back again.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Sad but true”", "Author": "Volatile75", "ReviewID": "UR117701438", "Content": "Many things went wrong for this stay: the porters didn't smile because they were busy hauling bags up the 4-5 flight of stairs at the entrance. They seemed overworked. Check in was flawless though. The design of the shower area was weird because after using the overhead shower, the floor near the sink always got really wet. I ordered room service and asked for a itemized copy which the staff didn't want to give but finally did unhappily. During breakfast, I asked for hard boiled eggs but the staff gave me 3/4 boiled ones. Overall, this hotel could have done better.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel, location & staff.”", "Author": "Razzi-B", "ReviewID": "UR117662750", "Content": "The rooms are very nice & functional. The hotels location is perfect for exploring, shopping & working in Singapore. The staff are exceptionally friendly, professional & helpful.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Top Service , top location”", "Author": "target008", "ReviewID": "UR117425009", "Content": "Stayed for two nights. Paid the extra $50 per night (on special) for the Crystal Club upgrade. Worth every penny. The room was better, free breakfast , afternoon tea and evening drinks, 2 bits of free laundry and a late check out. A couple of tips though. If you use the upgrade the breakfast laid out can be supplemented with eggs of your choice ( did not realise this until after) , and you can order a specific coffee type at no extra cost. Anad and Hussain ( sorry if I haven't spelt these right), the two Suite butlers also manage the crystal club - great guys , very welcoming and friendly. The pool area is outstanding. The front desk was the most cheerful I have encountered in a long time.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "gohl", "Title": "“You pay for the location”", "Author": "gohl", "ReviewID": "UR117257356", "Content": "Plus - location is very central, on Orchard Road, between Orchard MRT and Somerset MRT. - Very friendly reception and overall service is excellent. - Power sockets are have international adaptor built-in. A BIG convenience for travellers who forget their adaptors! - Free wi-fi!! A bit confusing to identify which of the multitudes of wifi's to connect to though. If it is written somewhere would make life a lot easier. - Daily newspaper delivered to your door. They have a special holder for the paper outside the door so don't expect it underneath your door! Minus - No fresh air. Windows are sealed. And if you manage to open them it is consctruction site if you look down. It is car park if you look across. Because of the angel of the room to window, it is a building's black glass window if you look from your bed. - Lighting is dim. The room I had had windows facing another building. Also there is no light above the luggage rack. Looking for items in the bag becomes a challenge. - Bathroom is damp and smells mouldy. This is probably due to design as I could see a damp patch in the corner of the floor and bath tub, which serves as the shower place as well. - Breakfast (buffet) is not something so appetising to look forward to. Coffee is terrible.", "Date": "August 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good & nice hotel”", "Author": "dnadinna11", "ReviewID": "UR117216034", "Content": "I stayed at Grand Park Orchard from 19th until Aug 21st. I stayed on level nine and found the hotel staff to be polite, accommodating and just excellent to deal with. Simply the best service when it comes to customer service by the bellboys in this hotel. Azmi is a service oriented individual, fast and ready to help out. Remember your name and treats everyone with respect and courtesy. The facilities here are what you would expect, excellent. The rooms are great, great gym, and nice outdoor bar. I can say nothing bad about the food at the Open House. Overall service is satisfaction.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Stop searching....just book the Grand Park Orchard!”", "Author": "Lisa B", "ReviewID": "UR117159351", "Content": "Where do I start? I spend hours poring over every little detail on these reviews and hotel sites...don't waste any more time...just book Grand Park Orchard! The Grand Park Orchard is THE place to stay when in Singapore. We travel very often and were so delighted with the hotel, facilities, location, and most importantly, the staff. Nothing was too much trouble. We definitely recommend you splurge a little on the Crystal Club rooms - we also upgraded our daughter on arrival for just $50 per night extra (promotion)...and then they upgraded her again to a Premium room...so worth it! Breakfast, afternoon tea, evening cocktails & canapes with Veuve Cliquot free flowing! The Crystal Club Lounge staff were incredible...Susan (who knew EVERY club, bar and attraction worth seeing in Singapore), Hashim (??) hope I spelt it correctly, Tina, Nora Lynn, Sammi, Alam....all were just great and made our stay so memorable. Room service prompt and excellent. Room was immaculate, as was everywhere in the hotel. Slick decor...loved the Bar Canary! We will DEFINITELY stay here next time we visit Singapore and recommend to all our friends and colleagues. Thanks again guys!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denpasar, Indonesia", "Title": "“My personal favorite”", "Author": "GastroAficionado", "ReviewID": "UR117158822", "Content": "This is my personal favorite, it's new and hip. It's slap bang in the middle of Orchard madness--perfect for short stays (and SHOPPING). It looks and feels super high-end but affordable! The actual rooms are smaller than the photos online (as ALWAYS), don't count on the views, you're in the middle of Orchard shopping centers and the room is pretty enough to eliminate the need to look outside ;) I stayed in the premier room, pretty interior--modern/minimalist with up-to-date facilities. The room has an iPod dock which is pretty awesome since most hotels don't. Room size is OK. Everything is nice BUT there is one thing that makes the room seem a little AWKWARD; on top of the bed, there's a 'mural' of pretty models in wavy dresses--seems like something out of magazines. It's the only downside of the rooms and the 'mural' is pretty big. So just beware of the [almost life-size] pretty models on the wall above your bed--doesn't cater to everyone's liking. So, AWESOME & hip hotel with the perfect location for shoppers and Orchard road hoppers (like me) ;) affordable--great value! Cool bars, lounges, pool, facilities, the whole place just looks trendy expensive and high end. The only downside is the huge murals in the rooms. It might just be me to find it awkward but be sure to check photos out online!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Bangkok", "Title": "“Perfect for Shoppers”", "Author": "major_grubert", "ReviewID": "UR116466785", "Content": "Conveniently located in the thick of things on a particularly busy stretch of Orchard Road (Ngee Ann City and Paragon are only a minute's walk away - those looking for a bit less hassle might instead consider the area around the Hilton and Orchard Parade) it's well-nigh impossible to fault this hotel: think gleaming hallways, a courteous and attentive staff and rooms that come fully equipped with every sort of amenity imaginable, from blowdryers to built-in plug adapters and ipod/iphone docks. So why the 4-star rating? Simply because the hotel did not in any way exceed my expectations. What else would you expect from a place that looks like something directly out of the pages of Wallpaper magazine, a place that at the end of the day isn't all that different from all the other hundreds of places frequented by corporate suits? Then, of course, there are the rates. Make no mistake, it's a damn pricey option. But then again, Singapore is a damn pricey place.", "Date": "August 9, 2011"}, {"Ratings": {"Overall": "5.0", "Value": "4"}, "AuthorLocation": "Geelong", "Title": "“Location, location, location and the Crystal Floor!”", "Author": "birdseyeGeelong", "ReviewID": "UR116288479", "Content": "We stayed at this fantastic hotel for 3 nights on our way to Thailand in late July 2011. The room met our expectation but really set this hotel apart for us was the outstanding service. We booked a Superior Room which wasn't cheap but on arrival decided to update to a room on the Crystal Club Floor. This turned out to be a very, very good decision. Room size is about the same as the Superior one but the upgrade (they had a special on) gave us the following advantages: Meeting and lounge facilities Buffet breakfast of very good quality Afternoon tea option from 3 - 5pm Cocktail session 5.30 - 7.30 pm (beer, wine and spirits and excellent appetizers Two items of laundry washed and pressed Drinks are very pricey at hotels in Singapore with meals eg a standard beer is $15-$18 (AUS) so the upgrade more than paid for itself! Compliments in particular to Susan - front of house in the Crystal Club Room - what an asset that lady is to the hotel. My wife and I were delighted to chat to her as she went about serving us in impeccable style. Truly an outstanding personality and for us a standout amongst a very professional team - who personalise to meet individual needs. I wonder why the mixed reviews for the Grand Park Orchard but we did note two very difficult customers in our 4 days at the hotel that no manner of excellence would please! Good work also to Beverage Manager Rory, obviously a very experienced operator who explained the pricing structure of drinks in a manner much appreciated by me. This hotel is going in all the right directions - well done Grand Park Orchard - we'll be back soon!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Melbourne", "Title": "“Nice and central location, overall pleasant experience”", "Author": "lil_ruski", "ReviewID": "UR116249543", "Content": "My husband and I have stayed two nights in this hotel, here some things I liked and disliked about the place. Plus: Hotel is located very conveniently for shopping and staff were very helpful in helping us with what to see in a short period of time. Free internet was great too. Rooms are very modern and clean. Minus: Rooms are quite small, we have booked a deluxe king room but I think we were given a queen, did not make an issue out of it but was expecting more that I got. Another small annoying part was having to take two lifts to get to your room (one from the street to level 4 - reception, and than cross to the other side to get to the lifts going up to rooms). Overall, if you are in looking for a nice place to stay close to the shops, this is definitely worth considering.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great value, pleasant staff and overall good hotel”", "Author": "kaotic363", "ReviewID": "UR116195191", "Content": "The main attraction for trying out this particular hotel was the price considering the hotel's location. We stayed in a executive level room and the room was pretty good although a bit of a weird smell (perhaps smoked in previously). All in all the hotel suited us just fine and close to all the major shopping areas. The staff on the executive floor were quite nice although a bit to eager to please which annoyed us a bit. Not easy to enjoy your breakfast when the staff wants to chat it up with you the whole time.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Highly Recomended”", "Author": "PPMSSM", "ReviewID": "UR116139233", "Content": "We stayed here after a 2 nights stay in Marina Bay Sands. We love every detail. The free Wifi , the bath , the SERVICE, the location! Right in the heart of orchard, what more could one ask for!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New Delhi", "Title": "“Super - for a three night stay !”", "Author": "AquaAngel", "ReviewID": "UR116108817", "Content": "This is not the St. Regis, Shangri-La or the Fullerton, so don't expect that to begin with ! However, this is a superbly located business hotel if a short stay for work or shopping is what you have planned for Singapore. Alam and Hashim were outstanding at the Club Lounge ! Susan gave us an upgrade after a hiccup at check-in which was highly appreciated by us. The room was compact, but a side-view of the Paragon with a mammoth Gucci signage lit against the orange glow of the setting sun and interjected with diagonal sections of the hotel facade was quite a composition ! The breakfast had a reasonably good selection to choose from and I have to mention that they serve a good quality Chardonnay during the cocktail hour ! Overall, this is great hotel with very friendly and genuinely helpful service. Singapore is a tad bit expensive, so a hotel like the Grand Park Orchard does not come cheap, though I personally think that it is great value for money. I like to stay either in boutique hotels or high-end properties, but sometimes the hustle and bustle of a busy hotel in the middle of a busy city can also be a good change... The Mandarin Gallery shopping center is lovely and is on your left when you step out. Atomi was a stand-out store ! Lei Garden is just a few steps ahead where you can savor some delectable Cantonese fine-dining. The Ku De Ta at the Marina Bay Sands is worth a visit, but one visit only — unless the food, cocktails and service receive a major overhaul.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Service was fast and efficient”", "Author": "jamesryan99", "ReviewID": "UR116055493", "Content": "Based on reviews from this and other websites, I booked a few night with Grand park Orchard to experience stay. So glad I did, as the location is perfect; shopping mall are walking distance, easy for me to get things and stuff. Staff of Grand Park Orchard were friendly, professional and accommodating with a great can-do attitude. They try to anticipate your every needs. Especially a great THANK YOU dedicate to staff Azmi who really help me during the departure. Keep up the good work! Looking forward in the near future staying in Grand Park Orchard..", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Excellent , but....”", "Author": "lub0", "ReviewID": "UR115896926", "Content": "It is not my first trip, hopefully not last to Singapore.First time in this hotel, and reason ( Singapore on sale ) , probably the best place to stay on Orchard road if your wife is shopoholic. But ? be carefull there is lot of building activity particularly at the rear of the hotel . Ask for higher floors...", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "australia", "Title": "“Five star”", "Author": "billy003", "ReviewID": "UR115885507", "Content": "I was really looking forward to my stay here with my mum and baby, and the hotel definitely didn't disappoint. The staff truly are amazing. From the friendly doormen to the staff who press the lift buttons for you so you don't have to wait even a second for the lifts to arrive. But particularly it's the people in the Crystal Club Lounge - Alam, Susan and Hashim. Their warmth, professionalism and willingness to help is amazing. I had read numerous reviews about the hotel on trip advisor, and was a little concerned about some of the things people had mentioned before I arrived. Rest assured that my experience was 100% positive (okay, maybe housekeeping didn't have amazing attention to detail, but they still made our rooms tidy and clean each day). I understand that the hotel takes their feedback very seriously, so they have possibly made some tweaks since opening last year. Don't bother looking anywhere else to stay in Singapore. Grand Park Orchard is simply divine. Oh & if you book the Crystal Club rooms you get Verve champagne every day (included in the rate).", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Great hotel with great location”", "Author": "pepperchip", "ReviewID": "UR115638645", "Content": "I loved the location which was i the middle of Orchard Rd. The lobby on the 4th floor smelled great. Rooms clean and spacious. I particularly loved the gradual incline of the floors which made walking in and out easier and faster and less tiring.", "Date": "July 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best butler ever!”", "Author": "Noren17", "ReviewID": "UR115604312", "Content": "Much has been written about the hotel, so I need not add to the compliments on its excellent location n value. However I'd like make special mention of mr alam albahar whose name card states his position at the club floor lounge as 'butler'. However, he seems to be much more than that. He exudes charm, confidence, experience and is a friend to his guests, as suggested by the response of the guests when they walk into the lounge. The few times I was there it was clear that he was very professional in his role and is an excellent example of what service is about. The younger staff should take a leaf from his book. The likes of mr albahar are rare these days.", "Date": "July 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A Pleasant Stay”", "Author": "5Star-er", "ReviewID": "UR115601778", "Content": "Plus: Very nice & helpful staffs (doorman, bell boy, receptionist, room service, housekeeper, restaurant waiter/ss & concierge) and great location (near Ngee Ann City, Takashimaya, Wisma Atria, Tang Plaza & Paragon).. Minus: Weak WiFi network.. Overall: Looking forward to stay in this hotel again..", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore", "Title": "“Friendly Hotel - It's a mix of boutique and mass. I like homely feel.”", "Author": "Luxique", "ReviewID": "UR115599765", "Content": "I stayed here for 1 night. The furnishings of the hotel are not as good as I expected from the way they portray the image to be. But nonetheless, the layout and space of the room is good. Food can be further improved - one can see they put in a lot of effort in differentiating themselves from the big boys - especially the Mandarin Hotel which is just opposite them. I especially like their Poolside Bar - it's equally good on a day or night, except that when it rains, the entire bar is wasted as there is no good shelter for it. The management should seriously consider a good stylish shelter so that guests like us can continue to enjoy the outdoor bar.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Fabulous Place!!”", "Author": "d3gadc", "ReviewID": "UR115372618", "Content": "I stayed on the Club Floor and enjoyed exclusive check in, breakfast and evening cocktails in the club lounge area. Susan and Alan (the Maitre d'hotel?) were fantastic to chat to and really looked after me. I had a complex schedule checking in very early one morning flying out the next and returning a couple of days later and nothing was too much trouble. The location is perfect for the shopping area., Ngee Ann City is 2 minutes walk away, the outdoor pool made a great start to each day and the accommodation was very comfortable. There were also families there enjoying the facilities and I'll be returning with my wife and children at the next opportunity! I'd strongly recommend the Grand Park Orchard, book online for the best rates!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "London", "Title": "“All style, no substance”", "Author": "FrequentTraveller_xy", "ReviewID": "UR115299922", "Content": "I found this hotel to be particularly bad given that it's brand new. Staff seem very poorly trained; hotel doors dont latch themselves closed; a ridiculous lift system where you have to take one lift to the lobby and then change to another on the other side of the lobby to get to your room; amenities (and lightbulbs) that werent checked/maintained properly etc etc. Location is great, but there are much better hotels in Singapore for the same price", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nice Location but Housekeeping staff needs Service training”", "Author": "BKP_SINGY", "ReviewID": "UR115215959", "Content": "Great location, right on Orchard road. For some reasons, lighting in rooms is quite dim, not well ventilated. Housekeeping is in bad shape, extremely slow and often forget to get the stock the guest rooms well.", "Date": "July 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Location, location, location”", "Author": "AbbsG", "ReviewID": "UR115152956", "Content": "I booked this hotel through booking.com mostly due to the location and didn't expect too much due to mixed reviews. I couldnt believe the luxury of Grand Park Orchard when we arrived there. Extremely modern both internally and externally. Location was unbelievable, perfect for a few days of shopping (or just the one night of shopping as it was for us) and the shopping was great - about 25% cheaper than at AU, or even cheaper when you get the GST back. I'd definitely return to Singapore and stay at Grand Park Orchard.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Upper Coomera", "Title": "“Totally 5 star and well worth the Money”", "Author": "makita_1011", "ReviewID": "UR115002590", "Content": "Great location on Orchard road, plenty of shops restaurants nearby all easy walking. Staff in the Club Lounge could not be more pleasant - always wanting to help and assist with anything. Very friendly staff throughout the entire hotel. Rooms are very clean and spacious. recommend this hotel to families, couples and business travellers.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Modern and Great location on Orchard Road”", "Author": "aruboy", "ReviewID": "UR114999900", "Content": "We wanted a hotel for one night on route to Europe, happy I selected this hotel. We arrived late in the afternoon, John at reception did the best job in making us feel welcome. Upgraded to a better room on higher level. Everything was clean and Modern. Room not huge but comfortable with the very best bed with blackout curtains. Cocktails at the Canary bar a treat in the Singapore heat. We were given free breakfasts, late check out and everything we could ask for nothing was a problem for the staff at this hotel. We arrived the first day of Singapore on Sale and my wife took to this at pace as everything was less that 100 meters away. Remember Singapore can be hot so have a look for the below ground shopping malls. We did not eat dinner at the hotel but went to a Hawkers market for Chili crab. A 10 minute walk from the hotel.", "Date": "July 3, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Delhi, India", "Title": "“BEST LOCATED HOTEL IN SINGAPORE”", "Author": "GauravVGoyal", "ReviewID": "UR114778760", "Content": "Simply the best located hotel in singapore, no arguments! Very expensive breakfast and tiny rooms is the problem though, Takashimaya on one side and paragon on the other, wow..Would recommend tired husbands shopping for their wives as they can simply hop back across in a jiffy", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Will recommend to friends”", "Author": "tptuason", "ReviewID": "UR114775969", "Content": "We stayed at the 11th floor called the Crystal Club. The rooms are rather small but all the amenities are there. Check in and check out , breakfast, afternoon tea, and early evening cocktails all at the same floor, all included in the room rates. Special mention to the Butler Mr. Alam Albahar who makes you feel very welcome. He even went out of his way to take us and our bags to the 1st floor and hail us a cab going to the airport. The rates are a bit pricey but worth it.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wakefield", "Title": "“Friendly & Convenient”", "Author": "geebes2", "ReviewID": "UR114216084", "Content": "Just had a quick business trip to Singapore for 2 nights. Grand Park Orchard was ideally located, right in the middle of Orchard road. Checking in/out was no problem, plenty of friendly staff around to help. The room is modern, bathroom elegant, wifi, tv etc all good. Restaurant had superb food, really enjoyed my stay and good value compared to other Orchard hotels. My only grumble was that there was no electric shaver point in the bathroom, so I had to shave either over the tea service, or in a corner with no mirror. Overall, I would go back again, wished I'd had time to lay by the pool and order cocktail, as it looked a nice relaxing area !", "Date": "June 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Great Grand Park Orchard Hotel”", "Author": "K0ner", "ReviewID": "UR113969503", "Content": "We are really enjoyed with our stay in Grand Orchard.The hotel is very modern and nearly furbished with modern decoration.It is very central and it is right in the hearth of main tourist attractions and shopping malls. The hotel staff is very friendly,The rooms are very clean.The only negative point is its price as it is in little bit highside comparing to same hotel nearby. but it is worth paying it.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Lovely stay at Crystal Club Room”", "Author": "fenghuo", "ReviewID": "UR113772352", "Content": "For a short staycation, decided to check in into Grand Park Orchard as we knew that it was recently refurbished from the goerm Crown Hotel at Orchard. We decided to give the club room a try, as it seemed quite affordable. We were not disappointed. There was personalised check in on Level 11, where the service staff extruded warm service with a smile, offering us a late check-out immediately the next day for 3pm. This was subsequently extended to 4pm on the day of departure, even though we did not request for it. Staff was very forthcoming in their service, including the butler Mr Alam Albahar who was proactive to ask whether we would be interested in looking at the suites available. Breakfast at the club floor was unhurried, even though the spread is fairly limited. You do get the option to have it at Open House, the restaurant at Level 4, though we opted the club lounge for the quietness. Evening cocktails etc at the lounge was similarly quieter, which is a much more enjoyable affair compared to some other lounges of bigger hotels. Rooms were on a small size, with a more peculiar painting of a lady dressed in purple on the wall. However the furnishings were all very tasteful, and we have a relaxing time. Location wise, definitely a plus as it is right smacked in the heart of Orchard Rd.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Petaling Jaya, Malaysia", "Title": "“A REAL PLEASANT STAY!”", "Author": "tiongengming", "ReviewID": "UR113570617", "Content": "My husband was on business, me and my two girls were on vacation. We stayed 5 nites on the crystal club floor, the butlers Hashim, Alam N staff N also front desk Susan really made us feel so warm, comfortable and welcome. We just met but talked like old friends.They are real gems in hospitalities industry.Thank you very much guys. we adults and also the two girls really enjoyed the quiet drinks and snacks in the evening before dinner. Generally, the staff in the hotel are very friendly, it is also very centrally located, very convenient, value for money. Will definitely stay again on our next visit. By Mrs Leong", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Modern ID, fantastic location, good size rooms & value”", "Author": "shockl", "ReviewID": "UR112767087", "Content": "- Smooth check-in and bell service/assistance was prompt and accurate - Good size, very modern rooms and bathrooms - Small issue with shower (hand-shower doesn't allow for tilt and rainshower continues dripping for a while after turning off) - Small leak around WC area (not sure if it's from WC though) but wasn't enough of a problem to raise a complaint - All expected amenities are there (e.g. slippers, robes, toiletries etc) and the pool/ bar area is attractive enough Overall, at the rate we paid (about S$300), it's quite good value for a Singaporean 4-star deluxe hotel in very best location . Will return again.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Ashmore, Australia", "Title": "“Never Again”", "Author": "MadiJorja", "ReviewID": "UR112324549", "Content": "I have never complained about a hotel before, but the service at the Grand Park Orchard was appalling. Upon arrival the receptionist was confused about the rooms we were getting, we were told it was two rooms with the lounge in the middle. When we got to our rooms I had a disabled room and my friend a normal one. I asked if I could swap rooms and was told the hotel was full. I attempted to have a shower in the disabled bathroom, the bathroom turned into a swimming pool and i couldn't shower probably because of the disabled seat. The handle also fell off in the shower, but I managed to repair it. I asked for new towels twice to try and mop up the mess the shower made. When I went to bed there were red spots on my sheets, I pulled it back and there was blood marks over the mattress protector (it was simply gross). I rung up and got the manger, who then moved me to a new room. This room was above the bar which had a function on, it was so noisy and there were people talking with microphones. I rung again and asked if there was a quieter room. I was informed they would call me back. I never heard back from them at all. The next day my wardrobe doors got stuck and I couldn't get into my safe or clothes. This was fixed though. I was then locked out of my room and had to get a new card. To top it all off when we checked out we had to pay for our breakfast again. We had originally paid cash for it to get rid off some of our singapore money. They had no record of it and so we paid again. I would never stay at this hotel again, however it was in a really nice hotel, fantastic location and clean. The service was just dreadful.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "sabah", "Title": "“will think about it . ..”", "Author": "ernest80", "ReviewID": "UR111682467", "Content": "got to the hotel at 4.30 pm. And couldn't believe that upon check it, the front desk told me that our 2 rooms are not ready until 5.30-6.00 pm due to their full-house occupancy the previous night before. Frankly , who cares about their stupid reason and its absolutely stupid to tell me they can't give me my rooms because they were full-house last night (which is not my problem)..!!!!! so i am not as important as the customers who stayed over the previous night so i deserved to wait and to be put onhold??,how silly! !! what i wanted was , what i had booked and had planned for. It was fortunately that i have no other meetings or dinner on the particular night, or else it might have just ruined my plans.And to my unbelievable as i next walked out to the onyx bar hoping for a drink while waiting for my room to be ready , there were absolute NO ONE at the bar . So i have to walked out get down to the streets to find my own place to chill. On my way out, i saw a reception and asked if their bar is open and to my surprised she say \"yes\" but i told her there is no one there and i have waitied for 5 minutes !!! then she told me , she can get someone there now..!!! WTH ! =_= Beside that, during my stay in the hotel, the cleaner tried to open my door twice !!! once was when i was still sleeping.. ! and the other was while i was in the loo. I might not have put on my \"do not disturb\" sign. But i clearly yield \"yes i am in the room\" while they rang my bell !! and yet the stupid lady still enter my ROOM WITH HER own key card !!! Other than that, the rooms are new and clean . BUt their services sucks BIG time , their management are just SO incompetent compared other International Standard hotels like ritz,starwood, hyatt... just don't expect too much from this hotel apart from a DECENT ROOM to spent the night. And for that money i am paying.. i'll live else where!", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Al Ain, United Arab Emirates", "Title": "“LOVE THIS HOTEL”", "Author": "bfkillow", "ReviewID": "UR110930835", "Content": "Nora was excellent in attending to all our needs when we stayed in Siingapore on a business trip, the stafff generally were very helpful and friendly", "Date": "June 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Good bed, and easy.”", "Author": "bongkeh", "ReviewID": "UR106916879", "Content": "I was facing trouble when I just reach at 11pm. none in the ground floor. means no bellboy, no concierge, none. I dont even have any idea, how am I going to carry all my luggage alone. and where is the check in place? so its happen a cleaner who's cleaning the cigarettes butts points up her finger and shows 4 finger. means its at the 4th floor. okai. so I was dragging my heavy luggage alone, and there's only two staffs on the 4th floor. I do tell one of the guy, and he simple says \" apologize\". and finally they offered me to help me with my luggage. why now, why not from just now? the reception ladies, knows Im requesting for late check out, which is attentive. hotel room is smaller than mandarin. but hey, if you ever stay in the orchard tower of the mandarin hotel, dont you think its troublesome and complicated for you just to reach the main orchard road? you need to walk here and there then finally you reach orchard road. this park hotel is closer and simpler for anyone to reach the orchard road. bed was very comfortable, more comfortable than orchard mandarin. check in and out was fast as well. room amenities was complete enough. not bad for the rate given, they should give a lil bit cheaper more than mandarin. buffet in this hotel is cheap as well. its a new hotel, so yeah, I'd understand, but im sure they could do better.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philippines", "Title": "“Best Location in a New Hotel”", "Author": "PhilippineTraveler", "ReviewID": "UR106060080", "Content": "My whole family stayed in this newly refurbished hotel for 5 nights and we got 4 Crystal Club Rooms. Upon arrival, I presented my reservation confirmation in the reception and we were guided to the 11th floor, The Crystal Club Lounge, for our check-in process. Surprisingly, all my reservations were upgraded and we were given welcome drinks and food. The hotel is very clean and all the furnishings are new. Rooms: The rooms are a bit small than in other hotels in Singapore but is roomy enough and you wont feel that its a bit small. The bathroom is different - it is big and almost as big as the room. Club Lounge: The Lounge is not that big and has all the essential things you need. A business room, computer area, food and drinks. The service in the Club Lounge was EXCELLENT!!! In fact, if I could name what is the best with this hotel that the service that they give are great. Salute to all the staff in the Club Lounge and special mention to RHEA to her special attention to all our needs. Room Service: The room service was also good and fast even if you are just asking for a bucket of ice. Bar and Restaurant: The Bar and the Restaurants also offers a wide selection of drinks and as well as food. Housekeeping: This is the only downside in this hotel. I think this is were the hotel should improve. Although they make the rooms always clean, their service is not that good. Overall: This hotel is one of the great hotel I tried in Singapore. I will definitely stay here again!!!", "Date": "April 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Melbourne, Australia", "Title": "“Best location midway in Orchard, new refurb hotel but standard isn't there yet”", "Author": "soetantoa", "ReviewID": "UR105510500", "Content": "Value is great for us as we paid half price during promo, location is the best as its smack bang in the middle of Orchard Great outdoor bar & their massage service is top notch, one of the best. Breakfast is lacking of variety as every single day is the same. They can learn from Royal Scott. Hotel staff is great & friendly but room service isn't consistent. We booked 3 rooms for 4 nights and all have different level of service each consecutive day, my bar fridge wasn't refilled and other rooms didn't get water bottle refilled, bathrooms amenities didn't get refilled. Whenever we turn off a/c our room will have cigarette odour & 1 of our 3 rooms can't get wi-fi signal. Bathroom fittings isn't up to 5 stars, loose toilet roll holder, broken bath overflow, botched-up fixing & fixtures. Their standard isn't up to 5 stars yet but they'll be there soon.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Expensive for what you get!”", "Author": "Bolly64", "ReviewID": "UR105322024", "Content": "Even though hotel is in the heart of Orchard rd not many taxi drivers knew this place... Small rooms, poorly decorated, made us spend lot less time in the hotel and enjoyed More of Singapore. So why spend this sort of money if all you want is a good hotel with a clean bed.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“excellent hotel in perfect location”", "Author": "t8adm", "ReviewID": "UR104592586", "Content": "On a recent business trip to Singapore I stayed at this hotel, from the moment arrived to the time I left the staff could never do enough to help. rooms are excellent although I stayed at the club floor. rooms not big but perfect for what was required. the 2 butlers from the club floor lounge were extremely friendly , chatty and helpful Hashim Mohamed & Alam Albahar would make a point and coming back to this hotel on ym next visit.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“personal attention akin to a small boutique hotel”", "Author": "CorinR", "ReviewID": "UR103266710", "Content": "Staying on the Crystal Club level adds a level of service & comfort that is welcomed as a solo traveler - from my check in (& out) with the very charming Noralynn who extended a much welcomed late check out to the attentive butlers Alam & Hashim who are both quick with their wit & charm as well as impeccable service. The included breakfast, afternoon tea & cocktail hour on the 11th floor almost covers every meal requirement but then it is Singapore & it'd be a sin not to explore further. The club floor provides a quiet & relaxed environment that is a welcome break.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Wonderful”", "Author": "lh111981", "ReviewID": "UR101757291", "Content": "very attentive, can't do enough to make you feel welcome and individual staff in crystal club, very pleasant stay, clean and quiet rooms, free laundry which is amazing and wonderful breakfasts. really made being away from home easy!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“excellent”", "Author": "nn1234", "ReviewID": "UR101196705", "Content": "i stayed a week at this hotel located along orchard rd. the service is excellent, specially at the crystal club. i admire the special attention by : ms nora lynn, miss sammi and mr alam. they are of big help to my stay. constantly adhering to my never ending needs. i will surely stay in this hotel again in the future. the only drawback is that the room could use a sofa set so that i can lay down some of my personal belongings. its a wonderful saty as a whole...", "Date": "March 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "delhi", "Title": "“Good hotel but room was small and too basic”", "Author": "vidursingal", "ReviewID": "UR100233628", "Content": "The best point about this hotel is its location. The hotel is opposite Takashimaya and Paragon shopping malls. All the big brand names are within walking distance. So, if shopping is high on priority, then this hotel is perhaps the best place to stay. However, for the price the rooms were a disappointment. The was very small and equipped with basic amenities. You can not be blamed for expecting more from a five star hotel and for the price you are paying. Besides that dampener, the hotel was good and the staff is friendly and efficient. The breakfast was well served and good variety of foods.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“New Modern Hotel But Lacking 5Star Service”", "Author": "DeborahMelbourne", "ReviewID": "UR99998967", "Content": "We stayed at The Grand Park Orchard for 3 nights in a Premium Club Floor Room. The size of the rooms are very small as is the bathroom. Really only enough room for one person in the bathroom at a time. Service at the Club Floor Lounge could be a lot better. We only went once for afternoon tea and evening cocktails and had to ask to be served each time even though we were the only people in the lounge each time. Really lacking atmosphere. We regret paying for a Premium Club Floor Room and for that matter a Club Floor room as it was a complete waste. Really the only good thing about this hotel is its location.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Superb Standards and Staff!”", "Author": "chub_11", "ReviewID": "UR98885339", "Content": "I stayed 2 weeks at this hotel and every single day was truly \"Grand\". The staff is so friendly and courteous and make you feel at home. The quality of the room and amenities - including the food and bar - were outstanding.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cavite City, Philippines", "Title": "“nice, good location but quiet expensive.”", "Author": "MIGGY17", "ReviewID": "UR97663209", "Content": "I am Janine Aranza and I checked in three times in your hotel with my lover.. I did enjoy everything apart the room charged.. But nice to stay and romantic..", "Date": "February 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location! Great place to stay!”", "Author": "A TripAdvisor Member", "ReviewID": "UR96436154", "Content": "The location is fabulous and right in the centre of shopping paradise, Orchard Road! All kind of food for ur stomach can be brought easily. The service at the Crystal Lounge is wonderful! Special mention are service staff, Mr Alam, Mr Hashim, Ms Noralyn and Ms Dua! We are so well taken care by them. They are warm people and delighted u once u stepped into the Crystal Lounge! The room is trendy and chic. But still feel strange why a large photo of a model put up on the wall.... Great place to stay to shop till u drop!", "Date": "February 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Good Hotel, Great Location”", "Author": "debsndave00", "ReviewID": "UR96220736", "Content": "Good modern hotel.Super location bang in the centre of orchard road. Pleasant staff. Food i would rate as fair. Do ask for a room at the front of the hotel as the rear rooms have no view whatsoever. Overall a good experiance. Unfortunately, slightly pricey.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not Bad but Not Great”", "Author": "jingga18 Posted by an Accorhotels.com traveler", "ReviewID": "UR95103638", "Content": "Brand new hotel, very modern decor. A bit dark for me though. If location is your main concern, this is definitely the place for you. Great location for shopping. All the big brand names are within walking distance. Reception staff is a bit slow. I've been to other hotels in Singapore and they're generally very efficient. 2-3 people are always in front of 1 computer screen, serving 1 customer. Be aware of the tax surcharge applicable. We were aware of this when we made the reservation (it's in the fine print of the T&C). But we were still quite shocked at how much extra we had to pay. It made Grand Park not really worth the money we had to spend. From main entrance, you have to take an elevator to level 4 (the lobby), and then take a different elevator to your rooms. It can be a little bit annoying when you're in a hurry to leave the hotel or to go back to your rooms. Concierge staff is always on the alert to get you a cab. We never had a problem with getting a taxi despite the fact that this hotel does not have a taxi stand. All in all, not bad but not great.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“New, good location but a bit pricey”", "Author": "ozmadmax", "ReviewID": "UR94796202", "Content": "Good location for shopping / tourist, not so good for the business traveller as lots of competition for taxis and traffic during peak hours. Only opened in Oct/Nov so probably a few rough edges still need to be smoothed out. Friendly but not very efficient service. Business centre breakfast had limited choices but was adequate. Room decoration was a little too funky (wall mural would offend some people) and constuction site outlook didn't help. For a new hotel it was expensive and there is no incentive to stay there again as the price did not match any of the benefits that I would not get elsewhere at a higher standard or lower price for similar.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Nice Hotel”", "Author": "TravelBug1081", "ReviewID": "UR92617686", "Content": "Room was spacious with flatscreen LCD TV, electric kettle, iron and a mini fridge. Bed was queen sized and is comfortable. Cant say the same for the pillows. Pillows were flat and lumpy. Had difficulty sleeping throughout the night. Woke up in the morning with a crick in my neck. However, room was quiet with no street noise. Location of the hotel is great, just a few metres walk out of the hotel and you are on Orchard Road, Singapore's famous shopping district. Walk along Orchard Road and you will be spoilt for choice on things you wish to shop. Food is aplenty in the shopping malls and even on the side streets. It is easy to hail a cab (either at the concierge or taxi stand along Orchard Rd) and take the MRT train. ION Orchard has a MRT train station inside the mall. Would have enjoyed the hotel stay more had I stayed longer for leisure.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangkok", "Title": "“Must be one of the Best in Singapore”", "Author": "FarangBangkok", "ReviewID": "UR92135892", "Content": "We have been travelling to Singapore at least twice a year for short breaks for over the last 5 years and fInally I have found a hotel in Singapore that treats me like a guest and not just another paying customer. From the time time of arrival to departure it is difficult to say anything negative about the hotel. The porters, reception staff, restaurant staff all treated us with respect and were ALL very helpful and polite. Free business centre, WiFi throughout the hotel added to the high standard. The rooms not spacious but more than adequate, clean, tidy, and serviced well. The view from the room was not good, but we did not go to Singapore to look out of the hotel window! Breakfast was included and was of a good standard, the restaurant was always busy but the staff maintained the service well. The location is perfect on Orchard Road, easy access to the MRT and plenty of shops for my wife to visit! The cost of hotel was reasonable given the time of year and its location, great value for money. We will definitely be using this hotel for our next trip.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“service could be friendlier”", "Author": "jvu5", "ReviewID": "UR92057613", "Content": "hotel is placed in a great location, right in the middle of orchard rd where you can shop to your hearts content. the service was below average, especially for a 5-star hotel. I am never one to be critical of the service provided in a hotel, however the service of this hotel definitely did not reach 5 -star standards. Rooms were not always cleaned daily, and on some days only the bed was made, and none of the towels were replaced. I have also once requested for toilet paper, and it took multiple requests and over 30 minutes of waiting for it to arrive. For it's price, it is however quite reasonable considering its location, it is also a new hotel so it might take some time for the service to get up to scratch.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangalore, India", "Title": "“The Place to stay in Singapore..Great Location..Great Service”", "Author": "vivinkurien", "ReviewID": "UR90989829", "Content": "The best place to stay in Singapore..Awesome location.When the Orchard Road was lit up during the christmas week, we were able to enjoy it the most since the walk to the the Hotel from the Metro was simply fantastic(something we wouldnt have experienced otherwise). The nearness of the hotel to two Metro stations helped us to use them a lot and experience the Singaporean way of travellling and save a lot of money in the process too. Had breakfast during our stay at the Open House Restaurant, the food and the service was great.. Would for sure stay there again on my next trip to Singapore", "Date": "December 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Brand spanking new modern hotel with comfort.”", "Author": "1whereintheworldami1", "ReviewID": "UR88877169", "Content": "Nicely appointed comfortably sized rooms. A nice oasis from the busy orchard street below. Well suited for a business traveller wuth good work place in the room. There are nice views of orchard street from my room although because of the building design I did not feel like I was staying in a goldfish bowl. The bar balcony on the 4th floor was very relaxing. The bar also has a glass walled swimming pool that looked great.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great Location, but the Musky Smell!”", "Author": "TennisQuicky", "ReviewID": "UR88861059", "Content": "Stayed for 3 nights in mid Nov, total of 4 guests for 2 rooms. The hotel is very modern, but maybe trying a little too hard to be trendy. The staff was attentive and professional enough. The location is just off of Orchard Rd and right across the street from Paragon Mall, so it's great if you are planning on shopping. There's an especially large concentration of high-end / luxury brands in this area. A bit difficult to cross the street to get to the mall though, since there is no designated pedestrian path directly in front of the hotel. Good breakfast selection with wide range of Asian and Western items. Internet service is room was included and pretty fast. The pool was nice and relatively large for a hotel right in the middle of town (Orchard Rd neighborhood at least). Now to the bad bits - the entrance lobby and the reception lobby reeked of a musky scent, similar to a bad cologne for men. It gave my girlfriend and me a headache every time we had to pass through them! Also, this hotel has one of my pet peeves, wherein you have to take an elevator to get to the reception desk. I like my reception desk on the ground level, but that's my personal preference. Also, the hallways were rather dark and not necessarily the cleanest. The rooms were dark as well with dark colored walls and furniture. Also there was picture of a female model on the wall directly above the bed (some, not me, might call it \"art\"), which my girlfriend didn't appreciate. I wouldn't mind having a word or two with the interior designer for this building. Also, the view (or lack thereof) from the rooms were pitiful, with very little sunlight coming through, which didn't help the darkness situation at all. Overall, I can't recommend the place until they fix the smell in the lobbies and the dark rooms.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Doha", "Title": "“Good Hotel - Great Location”", "Author": "ashishvb", "ReviewID": "UR85389785", "Content": "Centrally located on the Orchard Road, the Grand Park Orchard is a fantastic hotel to book a room in. I was on a business trip and had very little time in the evenings to roam around. The location of the hotel made it very easy for me to see the place and also do some shopping. The planning of the hotel interior though is a bit confusing till you get used it. This though is not really a problem as the rooms a very good. The restaurant is excellent and probably the best breakfast I have ever had in any hotel anywhere. The hash-browns are exceptionally good. I'd certainly recommend this hotel to anyone traveling to Singapore on business.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "wollongong", "Title": "“Fantastic location, nice rooms, friendly staff.”", "Author": "lynWollongong", "ReviewID": "UR84998061", "Content": "I stayed at Grand Park Orchard for 4 nights while in Singapore on a business trip from 19-23 October 2010. The location would have to one of the best in Singapore, right in the centre of Orchard Road with endless shopping malls and eateries. The hotel had it's official opening only 9 days earlier and for a brand new property the staff were very organised and helpful. I stayed in a deluxe room which wasn't large but was very well appointed and tastefully decorated. Free wifi in the room was a bonus. The foyer, pool area and restaurant are very modern and classy. Check in and check out was seamless and I couldn't fault anything. The shopping mall underneath the hotel is not open yet but I expect completion isn't too far away. This isn't the best 5 star hotel I've stayed in but I certainly don't have any complaints, it is competitively priced. I would definitely stay here again.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Great location, nice hotel”", "Author": "TimRattray", "ReviewID": "UR84512321", "Content": "Normally stay at the Intercont but wanted to try something different This is a new hotel with great location Stayed with a special intro deal SGD 288++ which was very good value Room was small but comfortable, modern and well-apppointed I found the staff to be extremely helpful and service was great Complimentary wireless internet but unfortunately no coverage in my room Not sure what the normal rates are, but if on a par with other central hotels I would be happy to stay again", "Date": "October 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Montrose, California", "Title": "“Nice location but terrible staff and service.”", "Author": "TravelLeisure_10", "ReviewID": "UR84264339", "Content": "I am actually writing this review while staying at the hotel. Although the location of the hotel is excellent, the service has been terrible. The staff is extremely new and inattentive. As a new hotel, I would go to any means to satisfy your guests. I called the hotel several times before my arrival to arrange for a car service from the hotel and not one person was able to help me out. They hung up on me several times. The room is extremely small and although it is a new hotel the room is worn out (broken furniture pieces, pen marks on the wall, etc.) I have called the hotel staff regarding these issues and I have been ignored. I travel around the world for business and I must say this has been one of the worst hotels I have stayed in. For the price, I would stay at the Four Seasons or St. Regis in Singapore. I thought I would give this new hotel a try but it was a big mistake.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Excellent location with excellent service”", "Author": "aditi26", "ReviewID": "UR82593034", "Content": "My family & I visited Singapore in October 2010 & stayed at the Grand Park Orchard. We were with 2 young children & the hotel management posed no problem with all of us staying in one room where almost every hotel in Singapore had refused. The location of the hotel is fantastic with literally a GUCCI sign reflecting against your windows....its ideal for every shopper to leave their bags and rest & go back & hit the shops... The service at the hotel was exceptional with every small need being catered to... all in all i would definitely recommend this hotel to everybody", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kuala lumpur", "Title": "“excellent hotel for business and pleasure”", "Author": "omsy", "ReviewID": "UR82297824", "Content": "Located in the heart of Orchard Road. Best location possible. From the moment we stepped in the hotel we were showered with top class service consistently. Food was great and aesthetics was pleasing throughout. Everything I required to facilitate my business trip from internet, to club floor facilities, to business center were catered for very efficiently. My accompanying wife loved the room and the fact that she could walk to anywhere to anywhere in Orchard Road within minutes. We were particularly swept off our feet by the Club floor service. Ms Rhea and Mr Alam Albahar had sincerely gone out of their ways to ensure our stay was unforgettable. Having stayed in numerous hotels in Singapore, this new hotel takes the top spot in my favourite list. The price is also more reasonable then others in its class.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Don't stay here unless you get attractive rates!”", "Author": "GoldPassport", "ReviewID": "UR81228656", "Content": "Just check in today as I write this review. Located in middle of orchard rd. Lobby and check in process was excellent but that was it ! It's new hotel so room is still fresh, looking good. Size is pretty small, bed not comfy, no wall socket for your shaver in small bathroom. Phone did not work properly, complained about this without response. Aircon flows directly to my head that cause me headache after my sleep, regardless which side of bed I sleep at. There's useless multiple adaptor on working desk but can't fit any of my gadget charger, so I had to crawl underneath the tv to find wall socket. I saw guests lining up to get taxi. while the hotel staff waving his hands to stop taxis, no taxi entering the hotel ( they prefer fetching passangers waiting at paragon mall located across the hotel). Make sure to pre-book your transport to the airport or you'll be disgruntled waiting for cab. To conclude, if you ever stayed in mandarin orchard, hyatt, Marriott, royal plaza during your visit in singapore you will be dissapointed choosing this hotel.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "jakarta", "Title": "“it was an excellent hotel with very friendly behaviour of the staff that makes me feel so comfortable.”", "Author": "veenujakarta", "ReviewID": "UR76608030", "Content": "hotel has just been renovated. decor is very good. food at the restaurant is fabolous.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Medan", "Title": "“standar service hotel”", "Author": "lumbangorat", "ReviewID": "UR54979987", "Content": "the room and service is standard, but the location of the hotel is in the heart of singapore shopping center in famous orchard road. breakfast is quite good, but i cannot say best.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dubai", "Title": "“Excellent Location - Pathetic Service.”", "Author": "shatru", "ReviewID": "UR50800387", "Content": "Excellent location, great walk about and good choice of breakfast. Unfortunately nothing much to be said about the staff. It seemed like they were doing us a favor by checking us into the hotel.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Philippines", "Title": "“Great Staff, great rooms at great Prices!”", "Author": "OrangeinTraveller", "ReviewID": "UR40246253", "Content": "It was my first time in Singapore and I traveled with two families and a couple. Needless to say, we were large group looking for great accommodations at a decent price in Singapore---and Park Hotel Orchard Road gave us just that. Not only is the hotel located at Orchard Road, the trendiest part of Singapore, but it boasts of great service and free breakfast buffets. The rooms were clean, comfortable, fully furnished and air conditioned. Park Hotel was across one of Singapore's best malls, Takashimaya which provided lots of food/ grocery choices. The location saved us a lot of money since practically everything is a walking distance. I even remember the ice cream vendor across the street which pacified a lot of my younger cousins. I would also like to thank the manager of Park Hotel who has been very very hospitable to weary travelers like us. Though I forgot his name, I can never forget the kindness he showed our family. If we needed taxis, guides, information, cellphones, even last minute airplane bookings and directions, he and his staff were always there, personally and attentively taking care of my needs. It was also comforting to know that most of the staff are fluent in a lot of foreign languages so chatting with them on whats and what-nots of Singapore was a breeze. On top of that, when there was a mix up on airline reservations, Park hotel staff helped us re-book and allowed us to stay in the lobby for an extra hour or two. It was a wonderful gesture that definitely made our stay in Singapore all the more fantastic.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Delhi", "Title": "“Great experience”", "Author": "ambience4u", "ReviewID": "UR31756052", "Content": "This was one good stay, just because the location of the hotel is great. Otherwise, the staff behaviour was pathetic and service was poor.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Fantastic with a Indians nearby”", "Author": "VRJ", "ReviewID": "UR28910709", "Content": "Overall a fantastic hotel to stay. It has all the facilities which one expect from swimming to gym. Good peop-le to welcome and serve you. Very near to Indian city in Singapore. So people of indian culture will like to country and get easy access to food, goods which they would like to see/eat", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kolkata", "Title": "“Convenient hotel”", "Author": "getsetg0", "ReviewID": "UR28537971", "Content": "I was travelling with my wife when she was expecting ... this hotel has a great location as this is in the heart of the city and has also all facilities that one would look for !", "Date": "April 22, 2009"}], "HotelInfo": {"Name": "Grand Park Orchard", "HotelURL": "/ShowUserReviews-g294265-d593658-Reviews-Grand_Park_Orchard-Singapore.html", "Price": "$233 - $420*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">270 Orchard Road</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">238857</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> (Formerly Crown Hotel at Orchard)</span></span></address>", "HotelID": "593658", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/39/18/51/facade.jpg"}}