{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Fantastic Value”", "Author": "nicmonson", "ReviewID": "UR128626662", "Content": "- Very very nice rooms for the price - Great free breakfasts - Free Wifi that actually works well (not perfect but very well) - Right next to Sol Station - Right in the middle of the city - Lots of noise at night given location of being right next to everything so bring ear plugs if this would bother you! (I personally slept just fine but some other reviews seemed to complain)", "Date": "April 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Great central location”", "Author": "gibby1701", "ReviewID": "UR124014715", "Content": "I stayed here for two nights in October and really enjoyed my stay. The room was clean and I enjoyed a comfortable nights sleep here. The breakfast had a good choice. Continental style, lots of cheeses, cold meats, breads, cereals and fruit. However the best feature of the hotel is it's location on one of the side streets off Puerta Del Sol. Also there are numerous bars and restaurants around about the hotel so you are never short of choice!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“Very nice”", "Author": "marinadobrota", "ReviewID": "UR118963000", "Content": "If we compare money and quality it is definitely on the top! It was clean, I had one large cozy bed, pretty relaxing. Bathroom was good and everything was in order. It is noisy at night but I didn't mind a bit! Breakfast is good. Curly brunette at the reception desk wasn't very bright, but no big deal :)", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Location,location, location”", "Author": "yoyocu", "ReviewID": "UR102779149", "Content": "We spent a great time there. very well located, steps from everything. Nice staff, good breakfast, a liitle bit noisy but you are in Madrid. Who wants to sleep?!", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Great small Hotel, in great location”", "Author": "hellsbells57", "ReviewID": "UR101257710", "Content": "Great Location, very central, very close to some great bars and restuarants. Close and within walking distance to lots of sights. Good Breakfast", "Date": "March 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“If you don't want to sleep at all, make a reservation in this hotel”", "Author": "KarenandEric", "ReviewID": "UR100956792", "Content": "We stayed in this hotel for 3 nights. The rooms are small and tidy. The beds are good and the bathroom is clean. The biggest problem is the noise in the street at night. This hotel is well located for visiting, but unfortunately it is located in a street with a lot of nightlife. The first night it was quiet as from 3.00 am, the second and third night it was noisy all night long (till 6 am). At least 200 people are standing in the street just outside the discotheque (there are two just beside and in front of the hotel) and making a lot of noisy, screaming, shouting. It is a small street. If you keep your window closed or open, it doesn't make any difference. On top of this all, an ambulance came in the middle of the night to pick up some drunk party-animal, with the sirenes on for 5 minutes. Breakfast is poor.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "washington dc", "Title": "“Great value and location”", "Author": "alohaelyce", "ReviewID": "UR94391979", "Content": "Location Location Location, close to metro, Puerto del sol and lots of local restaurants nearby. My favorite restaurant, Le Mario around the corner, steak, pollo and patatas fritas, empanada(excellent food) and spanish vino..five stars..OLE ;-)", "Date": "January 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“nice location with fair price”", "Author": "faricas", "ReviewID": "UR53871647", "Content": "I've been in this hotel several times. The last one was in April 2009. It's very easy to get here from the airport. Sol metro station is a 5 minutes walk. The most important cultural and historic sites in town are in walking distance. Rooms are nice and clean but sometimes on weekends are to noisy. Breakfast should be improved. I know other places to stay in Madrid but keep coming to this one...", "Date": "January 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "miami beach, fl", "Title": "“Hotel Madridsol excellent location and value”", "Author": "loumcast", "ReviewID": "UR14225140", "Content": "Last september we stayed in a triple room for a couple of nights at the Hotel Madridsol and it was an excellent choice. Our room had a nice size, air conditioning, new furniture, a new bathroom and was very clean, also it came with a continental breakfast that was very good and plentyful (cereals, pastries, bread, juices and fruits) We didnot encounter any noise, our room was on the third floor facing the street., but adjacent to the hotel there are bars, restaurant and a lot of nightlife. The hotel is in a great location very close to the Puerta del Sol (the center of the city) and the metro.", "Date": "March 11, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“great if u like the noise of a rock concert, or air raid, or traffic jam all”", "Author": "barbnov11", "ReviewID": "UR4328576", "Content": "the most noisy hotel i have every stayed at, craziness, just OUTside my window all nite long. if u dont need sleep this is great!", "Date": "January 6, 2006"}], "HotelInfo": {"Name": "Hotel Madrisol", "HotelURL": "/ShowUserReviews-g187514-d594939-Reviews-Hotel_Madrisol-Madrid.html", "Price": "$68 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Nunez de Arce, 1</span> | <span class=\"extended-address\">Junto a la Puerta del Sol</span>, <span class=\"locality\"><span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "594939", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/13/e0/13e0ac2387dd0caf63258feb1eecf13e4large.jpg"}}