{"Reviews": [{"Content": "Hotel Six - at $140 per night! Absolutely terrible. No internet, 1 gap under door that let in warm air, no ice box in refrigerator, kitchette without any dishs or silverware, airconditioning that barely works. Get this....you only get one packet of coffee per stay! At $140 per night, this is rediculous!!! Very noicy. Children are constantly playing in the courtyard and walkway in front of the rooms. Window curtains need to be kept closed (even on nice days) because people are constantly walking in front of the large window. Utilities are very old. I've stayed at Hotel Six' which were in better shape. had better rooms, and cost substantially less. Don't stay here!", "Date": "Jun 5, 2008", "ReviewID": "UR772619305", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "oicurmt2"}, {"Content": "Location is the best part Inn located across parking lot from 25th Division HQs and commissary is two minute walk. BX is not much further. No Internet in rooms so you have to go to snack bar/lobby to connect. Very limited food service available anywhere on base. Best to buy food at commissary and eat in room. Rooms have microwave and frig. Rooms open directly to outdoors, no interior rooms. If visiting friends or working on base long hours OK to stay there. Otherwise stay in Pearl City and commute. My co-workers drove daily from Honolulu and it wasn't too bad for them in traffic.", "Date": "Mar 14, 2008", "ReviewID": "UR974092595", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "5"}, "Author": "TexasTraveler3800"}, {"Content": "Not a vacation destination, but okay for short stay to visit loved ones. Okay, let's define the purpose for civilians using this property: It really is only suitable if you don't plan to stay long, 3-5 days, and don't want to be far from a loved one stationed or residing at Schofield Barracks. Otherwise, if you are planning on vacationing on Oahu and want to do all the touristy things, you DON'T want to stay here. I have stayed here twice, both were December visits to see my son who is stationed at Schofield. Once was a quick visit during Christmas time (4 days), and once during the days prior to his unit's deployment to Iraq (5 days). He was living in the barracks across the street from the hotel, had lots of stuff for me to pack and ship, so it suited our purposes to a tee. As with most properties, this one has its issues, the main one being that it is really a working hotel. What I mean by this is that the soldiers who are repositioning between posts, or transitioning out of the military, are housed here when they no longer have an assigned residence in Army housing. There are bored little kids who do what bored little kids do, ie. running up and down the corridors, yelling and screaming, to keep themselves occupied while their parents are either waiting for housing to give them a place to live or to ship out. There are soldiers who are deploying who are whooping it up while they can before going to the war zone. Like I said, it is a working hotel. About the property...the plusses: it is close to post housing and barracks, so loved ones who don't have cars can still get to the hotel on foot within a reasonable amount of time. It is close to the PX, Commisary, UPS Store, Food Court, Clothing Sales, Bowling complex, etc. The rooms are spacious, clean, and bug-free. There is a small refrigerator and microwave in each room, but no kitchen utensils of any kind. The bathrooms are large, with ample towels and toiletries, the beds are comfortable with decent sheeting and clean blankets. High-speed internet is free via ethernet cable (available at the front dest, or better yet, bring your own.) There is full daily maid service Monday through Friday, and trash collection only on Saturday and Sunday. Since working people reside at the hotel, they reduce maid services on the weekends to allow the families more privacy.The minuses: The check-in process is sloooowww. Don't be in a hurry, don't expect them to be organized, and don't expect any services out of the ordinary. They can't do it. Period. If your room isn't what you expect...tough. If you request a single room and are given a double...bonus for you (my first trip). If you require a double and are given a single...too bad (my second trip). They may, or may not, bring you a roll away bed. As a civilian, they will not move you. You get what you get. The lobby, where they offer wirelenss internet, reeks of grease from the deli's fryers. In the rooms, the couch does convert into a sofa bed, but it is, at best, a thousand years old and sags so badly that I wouldn't let my dog sleep on it, much less a guest. There are huge gaps between the door and the floor, so if there is a storm, like the Kona Storm that hit 12/4/07, the rain actually comes in under the door through the gap and soaks the floor in the room. They do provide rolls to block the door and keep the water out, but don't let you know that until after the storm passes, everything you own is soaked, and the maid is upset that you used bath towels to clean up the mess. Our mistake, I guess. Being from the Mainland, and not knowing that the Kona Storms pack 85 mph winds, we weren't prepared for days with no power and flooding everywhere. Again, our mistake.As a whole, this is an adequate property, and fulfills a need when required. If I have to go for another quick visit, I will stay here again. It is not, however, my first choice in properties on Oahu (that would be the Waikiki Shore), only when needing to stay on Post. When my son comes home from Iraq, I will not stay here, as he will be given a pass to leave post for a few days. Under the circumstances of deployment, though, I couldn't have been happier with the location, spaciousness, and cleanliness of the Inn at Schofield Barracks.", "Date": "Jan 14, 2008", "ReviewID": "UR938244443", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "KarolyL"}, {"Content": "Good accomodations, but pricey for military base       Flora and Fauna", "Date": "Aug 1, 2006", "ReviewID": "UR956396175", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "VirginiaNole"}, {"Content": "Staying at Schofield If you have a family member in the service stationed on Oahu I believe the Inn at Schofield Barracks is an excellent choice of accommodations. Centrally located, quiet, green, uncrowded and reasonably priced. A light menu was available at the next door PX ( Good food, made to order).", "Date": "Jan 16, 2006", "ReviewID": "UR292617377", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60982-d595533-r16698367-Inn_at_Schofield_Barracks-Honolulu_Oahu_Hawaii.html", "HotelID": "595533", "Price": "Unkonwn"}}