{"Reviews": [{"Content": "Quiet, isolated, peaceful Our first experience with a Tuscan villa. We were pleased with our accommodation, a large two-bedroom apartment at the top of the castle with amazing views of the surrounding countryside. The rooms were very clean, simple and the beds were comfortable. The kitchen was basic, with a gas-bottled stove, no electrics, no dishwashing machine, and no toaster. One thing that did surprise and disappoint was the single washing machine for the entire complex. The machine didn't work properly (it took 4 hours for a single wash leaving the clothes sopping wet - the staff had previously been notified of the problem but the machine continued to malfunction) and there was no dryer (something we learnt quickly about Italy is that they beileve in air drying even if it takes several days, a luxury we didn't have travelling). The castle has a great taverna downstairs that we used twice for dinner. It has a different set menu each night with two choices for entree, main and dessert. There is a great pool onsite (unheated) but unfortunately the weather was too cool to use, even for the kids. The castle also has wi-fi however it does not work in the rooms and you have to be downstairs in the main hall where there is a massive dining table and chairs to sit at. There is a bus service that runs past the end of the driveway that goes to Florence, however we had a car and did not make use of the public transportation. This is an excellent location to access some great places inland like San Giminagnano and Sienna, as well as the western coastline and places like Pisa and La Spezia.", "Date": "Oct 18, 2008", "ReviewID": "UR416826482", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "DreamingOfTravelling"}, {"Content": "hard to be fair An old castle, transformed over the centuries with authentic features set in the nicest landscape, surrounded by a well kept, enchanting big italian garden - what more to be expected?We can see an old house needs constant care because we have a big old house -not as big and as old as Montegufoni, but still old and big, and so we can appreciate the constant work that has to be done.Our rooms , called giardino,consisted of a smaller frescoed room with kitchen and two french windows facing a beautiful parterre, a big livingroom with high (6 m) vaulted ceiling painted in dreary brown and many nails in the walls where paintings hung giving the room an even drearier look and mostly shabby illmatching secondhand furniture; there are no windows and the electric lighting so poor it was not possible to read. We never stayed there. The bedroom was vaulted high and dreary too but had a window high up that allowed a little light and air. Furniture was the same as before and didn麓t seem too tidy. We removed the dirty carpet and shoved it under the bed. Bathroom was a former walk-in closet transformed with outdated fittings, dripping tips and smelling when we arrived, reached through the entrance-cum-kitchen. There is no hairdryer because the electric fittings wouldn麓t allow we were told. When taking a shower the whole bathroom is wet. My wife wanted to leave immediately, but we stayed five nights.In general all needs a general overhaul. The place needs it and earns it.Let the owner speak for himself, cited from a book sold at the reception: The former owners, the famous Sitwell family restored the castle in the 1920s ... when it was transformed to a bb little in the 1970s had to be added, just a few bathrooms. From the homepage you can detect that the owner rents a lot of flats all over tuscany and Montegufoni is his flagship (and cashcow). Don麓t forget a cow is to be fed...In general the great gardens and the building are nice when you are looking at it as a museum and a background; to stay there are better places like the well maintained and nearby villa il Poggiale in San Casciano (hotel) and villa Vistarenni (bb) near Radda. They offer better overall quality for the same price.", "Date": "Jun 22, 2008", "ReviewID": "UR177541100", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "5"}, "Author": "serendipityBayreuth"}, {"Content": "Fabulous place We stayed 7 nights at this Castle in April and loved every minute of it. Wonderfully restored and kept it had a great atmosphere. We heard that some of the apartments can be dark so if you want a brighter one ours, number 23 was one of those with morning and afternoon sun. The pool was immaculate and the whole place felt like a picture postcard. The rooms are not luxurious but the fittings are comforatble and above average with good cooking facilities and supermarkets close by. The bus to Florence (only about 17km away) stops right outside the main gate which was really handy and only a couple of euro each. We taxied home one night from Florence for 40euro. The bar on site offers coffee, alcoholic and non alcoholic drinks, (3 euro for 2 beers) and snacks including pizza from 1200 t0 7pm each day and the restaurant opens at 8 and offers limited but nice tuscan set price evening meals, very cheap, every night except Wednesday . There are local restaurants within easy reach as well.Couldn't think of a better place to stay.", "Date": "May 15, 2008", "ReviewID": "UR137440038", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Dreamer1NewZealand"}, {"Content": "Castello di Montegufoni is the Best My husband and I and another couple just returned from a great Italian vacation. We spent 6 nights at Castello di Montegufoni. It was wonderful. We stayed in La Grotta, a two bedroom, two bath villa. The apartment is huge, the rooms very nice with beautiful frescos. La Grotta is perfect for two couples. The castle itself is amazing, Letizia and Elena, who work in reservations were very helpful. Two of us took a cooking class at Montegufoni. I believe this was one of the first classes that they offered. It was a bit pricey - 90 euro for a 3-4 hour class, but it was well worth it. Rosara, who works at the restaurant, translated while Giuseppe, a Tuscan chef, cooked and taught us how to make a half dozen dishes. It was excellent! We dined at the restaurant two nights, both times the food was wonderful. We also ate at a local restaurant (Il Focalore), it was also very good. We visited Volterra, Siena, Florence, San Gimignano, and a couple of small Chianti towns during our stay. If you are looking for a centrally located place to stay while seeing Tuscany, Castello di Montegufoni is the place for you!", "Date": "Apr 22, 2008", "ReviewID": "UR765948941", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "VATravellers"}, {"Content": "Step back into time-an excellent base to explore. We stayed in an apartment on the first floor overlooking beautiful gardens and stunnining Tuscan views. The rooms were huge for European standards. NO television or technology for five days with teenage kids(both16), what a thought! It proved to be the best part of a four week tour of Europe. The castle was an excellent place to explore all of the wonderful places in central Italy: including Florence, Siena, Pisa and countless other little townships.The staff were also very friendly and helpful. We will certainly return.", "Date": "Apr 18, 2008", "ReviewID": "UR273552688", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "gazzadav"}, {"Content": "A mystical paradise!!!!! Castello di Montegufoni is a splendid piece of paradise in mystical, breath-taking Tuscany!! We stayed here for one week with a large group of friends, each one of us loved it! We visited Italy for 2 weeks and truthfully, one week at this castle is not enough. We unfortunately were there when the weather was a bit cool, but the warm atmosphere emitting from the view made up the difference. The Posarelli family went out of their way to accomodate 28 Americans from dining suggestions to assisting us with directions to the grocery store and train station. I can not say enough about how wonderful they are.We rented a beautiful apartment that had windows on two levels that greeted us each morning that I did not want to leave. This would be a great place for a wedding or just a relaxing get away. We had several children in our group who also loved it. I think most of it was just time to get away from the craziness of Florence and Venice! The towns that are near the castle are such quaint and have great charm if you want to go for a stroll through nature's beauty. If you want the busy, fast paced kind of life you are not far from Florence.If you are considering staying somewhere you are considered family, then Castello di Montegufoni is the place for you. As a matter of fact, my husband and I are planning to go back to celebrate his retirement in a few years. You will love everything about it and will have no regrets!Happy travels!", "Date": "Feb 10, 2008", "ReviewID": "UR930419048", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "ginrn1111"}, {"Content": "Stunning venue, breath-taking views! I stayed at the castle for a friends wedding at the end of last summer and had the most wonderful time. The scenery is amasing, the castle is beautiful and the people are incredibly friendly and accomodating.Lots of wonderful local cuisine in true tuscan style, a pool for a morning dip and hammocks for that afternoon nap in the shade of the wonderful olive groves - if you're looking for a relaxing break I couldnt' think of anywhere nicer!", "Date": "Jan 2, 2008", "ReviewID": "UR218865241", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "emsicle"}, {"Content": "A Wedding to Remember Our daughter and her fiance booked the Castello for the weekend of their wedding on Sept 1 and we shared this wonderful place with 80 or so friends and family.The Castello, the Posarelli family and all the staff were just fantastic, nothing was too much trouble for them. The experience began with a delicious meal on the Friday night eaten on the terrace under a warm Tuscan night sky. In the daytime there were views which took your breath away. On Saturday after the wedding in a local church, we returned to a warm welcome at the Castello with apperitifs and canapes in the grandure of the Dukes' courtyard, followed by an authentic Tuscan feast in the restaurant. The wedding cake and champagne were served that evening in a candlelit main courtyard from where we moved into a disco held in the Limonia beneath the Castello. The whole place was bathed in candlelight.If anybody wants an Italian wedding which can be described as 'magical' or 'fairytale' then we recommend you book Montefgufoni it would be hard to beat. Oh, and as an extra bonus the rooms / apartments were amazing and it was all excellent value for money!", "Date": "Nov 7, 2007", "ReviewID": "UR562085923", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Victorianrj"}, {"Content": "Perfectly Tuscan! I stayed at Castello di Montegufoni for 3 days during August, and it wasn't long enough. This is such a beautiful place with amazing views over the Tuscan countryside. The castle really is fabulous. My room (actually huge apartment) was incredibly comfortable with big four poster beds. If the weather had been bad, I have been quite happy curling up with a book inside for 3 days. But the weather was hot and sunny which meant we could take full advantage of the gardens, and eating outside on a picturesque terrace overlooking vineyards where we enjoyed very good tasty Italian food with wine from the castle vineyards. What more could you want! The staff were friendly and helpful. I would love to go back to Castello di Montegufoni and hope I get the opportunity. It is a great place to stay for visiting Florence and Sienna, and is the perfect venue for a wedding. Rebecca", "Date": "Oct 22, 2007", "ReviewID": "UR375598412", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "RebeccaBLondon"}, {"Content": "Stunning, Amazing, Wonderful!!! This is a fantastic place to stay in tuscany. A great localtion - close to Florence, Sienna, PIsa etc. The castle also offers unique and charactor filled accomodations that are simply not done justice on the castle's website. Rooms are filled with antique furniture, wall murals etc adn all contain some form of living area and/or kitchen - which allows you to stock up on the great local produce available in near by Cerbia. That said eating at the castle is fantastic value for money and the food if of an extremly high quality (鈧?3 for 3 courses). Wine and olive oil is the castle's own.There is a pool in the grounds, as well as hammocks and a ping pong table if needed. This place really has to be seen to be believed! So much better than the standard hotels, villas adn agrturismos that are so prevelant nowadays in tuscany. Its super romantic and drenched in history. BOOK NOW!!", "Date": "Sep 13, 2007", "ReviewID": "UR647756199", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "NGarrood"}, {"Content": "Dream Come True I first found the Castello in a book of villas for rent in Italy in 2003. My son wanted to be married in Tuscany, and their accommodations seemed to suit our needs for a small wedding. I was in email communication with Stefania throughout the process - which they'd never done before. By booking apartments for our guests, we were allowed to use the Duke's Courtyard for the ceremony at no charge. Over the months of planning, Stefania  the staff secured a violinist  pianist, hairdresser, and florist. The restaurant chef made the cake,  a 4 course reception dinner was served in the Severini Lounge following the ceremony. When I was not able to find someone to perform the ceremony, Stefania suggested contacting the American Consulate in Florence, which put me in touch with an American Episcopalian Church there. Through them, I also found a photographer. The entire experience was like a fairy tale - the castello being like something out of a dream. The musicians were better than most professionals you'd hire here, the photographer (Stefano Nannucci - [--]) took photos of exceptional artistic quality at the castle as well as in Florence, and the food was fabulous. During the ceremony, other guests hung out the upper windows to watch  applauded when the bride  groom were presented. It was so wonderful that we talked about returning for a reunion one day.And that's what we did this year, but this time we returned with 23 people - occupying 8 apartments. We booked Il Cardinale again, as we did in 2003, for sentimental reasons, but love the spaciousness of the 3 bedrooms, 2 baths, living/kitchen area, and sunroom that overlooks the Italian Garden. The terrace, with a spectacular view of the Tuscan hills, was where we congregated each afternoon  evening. The restaurant offers lunch  a great value for dinner. The first night we arrived was 20 Euros per person for antipasti, pasta ragout,  dessert; a glass of house wine was included. A few of our companions thought that was high  wanted to try their luck at a local restaurant down the road - they ended up spending more in the end. So, most nights, we ate there, enjoying whatever Fabiano  Claudia were serving up, accompanied by their outstanding service  congeniality. The pool (I believe there are two) was great  the grounds lovely; I believe the castello was in even better condition since 2003, when they were undergoing some renovation. On their website, I see that they now have wedding services, and I know they've done quite a few since ours. Ask about Ninci's Ceramiche shop in Certaldo (Stefania's brother), where you can buy hand-painted Italian ceramics direct from the artist. Only negative is the laundering facilities, which haven't improved since our first visit.If you want to truly experience Tuscany, this is the place to do it - a great central location from which we visited Florence, Pisa, San Gimignano, Siena, Volterra  even a day trip to Rome on the 2003 trip. I've seen countless photos  paintings of the Tuscan hills, but nothing will prepare you for being overwhelmed by its beauty. The adjoining towns offer your best chance for seeing the real Italy  experiencing the warmth  hospitality of the Italian people - perhaps the most genuine  open of all Europeans.", "Date": "Jun 28, 2007", "ReviewID": "UR912525385", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "luvnormandy"}, {"Content": "Paradise!       Me and the kids on the Ponte", "Date": "Apr 29, 2007", "ReviewID": "UR872564160", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "ajympton"}, {"Content": "A little piece of Heaven!       Castello courtyard", "Date": "Mar 7, 2006", "ReviewID": "UR399722577", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Dreamin23"}, {"Content": "Beautiful Montegufoni Castle -- Central Tuscan Location near Florence       The beautiful flower gardens of the castle", "Date": "Jan 23, 2006", "ReviewID": "UR612112987", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kimndallas"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d596642-r20977927-Castello_di_Montegufoni-Florence_Tuscany.html", "HotelID": "596642", "Price": "Unkonwn"}}