{"Reviews": [{"Content": "Below average :( Location ; not so good. It is not located right infront of the beach. Its right behind a hotel. The main entrance of Harris Kuta is facing the backyard of a hotel which i think its weird. About 5 to 10 mins walk from the hotel entrance to the kuta road/beach. Hotel looks clean but the room looks old. The tv is smaller than any hotel i've seen. The shower head looks old and rusty, tub were not well maintain. Very limited toiletries provided. Only 1 small bottle of shampoo and shower cream each which is not enough for 2 ppl. 1 soap bar. And 1 shower cap. When i call and ask for a comb, they said is chargeable and cost around 20,000 Rps. Don't make sense at all, 20,000 Rps just for a comb?!!! Its ridiculous. Staff were friendly upon check in. But had a long face when checking out. She don't even smile or look at us when she talk. How rude. Breakfast were ok. But almost the same dishes every morning. Planning for a trip to Bali? Harris Kuta, not recommended. Mercure Hotel is far better with good location to all local attraction and restaurants there.", "Date": "Nov 22, 2008", "ReviewID": "UR367604730", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "1"}, "Author": "dumpling4"}, {"Content": "Great Hospitality       pool view 2", "Date": "Jul 9, 2008", "ReviewID": "UR801108675", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "kltraveler08"}, {"Content": "Harris Kuta was OK but could be better. From all the hype about the friendliness of the native people we found the first couple of days to be frustrating. The desk staff was only cordial. The guys who stand out front to greet and help you were more friendly. We didn't get our wake up call so we could be on time for our first day of touring. We notified the desk and then the tour guide who also talked to the desk. They claimed we just didn't answer our phone. It didn't get fixed and we had to get pretty pushy to get it fixed. There was also a funny water running sound when the a/c ran but they also fixed that by the second day.The breakfast buffet was disappointing at first but we found that out on the patio they will fix eggs to your order and had fresh pancakes or french toast. Stayed 5 days and found it to be decent for the location and the price. Loved Bali.", "Date": "Jun 10, 2008", "ReviewID": "UR840926886", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "3"}, "Author": "LBR1016"}, {"Content": "Slacked The first impression i had when reaching was - Shady.The walk out to the hotel gate would eventually give you a suntan even before hitting the beach. watch out for the rundown condition of the bathrooms. Slimy wall , hissing pipes and squeezy space even if you're not claustrophobic. The food sucked  limited breakfast selection. The price isn't as per backpacker's choice either. Soggy  sorry to say that for those who insists on staying here, do ask for theground floor pool view or at least 2nd floor the pool view. Only the roving shotel staff was very helpful  courteous.", "Date": "May 24, 2008", "ReviewID": "UR388641642", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "chitchomeyle"}, {"Content": "Impressive! This hotel is perfect for tourists who are in budget but still want to have an awesome hotel in Kuta area. The location is not as great as other hotels in Kuta, but its just about 5 minutes drive away from the crowded, famous Kuta Beach. So, location shouldn't be a problem, as along the street of Kuta, many cafes, restaurants, shops are located. Nearby this hotel, a 24/7 McDonalds located. The decoration is fantastic! Its so refreshing and modern. The welcome drink is also a nice touch. Service is excellent, the staff is helpful and very friendly. The room was nice, my room has a back door to the swimming pool are, as the hotel isnt so big, it feels like having the hotel! I went there during the euphoria time of FIFA World Cup, and at night, at the swimming pool cafe, they set huge screen for showing the games, so we could share our euphoria and having a great time socializing with other guests. The swimming pool is not bad, children loved it. They also have children playhouse, a nice one. The only terrible thing about this hotel when I stayed was (maybe I was just not lucky) I found a CENTIPEDE on the bathtub!!! That was super eerie! Luckily, the centipede was dead I guess, so I called the staff to clean it, that was just a super terrible experience, and that time I really had to use the bathroom, so I seek the public bathroom in the lobby and found the public bathroom was quite awful. Not smelly, but the door was quite disgusting to me. Huh.. But I think you really shouldnt worry about this. The hotel was super clean, besides this incident. Then, at night, when other guests return to their room, when they make a lot of noise, it can disturb your privacy. One night, I got back to my room with a lot number of people, and we were talking, and joking, and laughing like crazy, so the guest next door got out to tell us that he was disturbed. Haha. But from my personal experience, the room was great, I never got disturbed from noises out of my room.", "Date": "Feb 19, 2008", "ReviewID": "UR325017790", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "fredric_fd"}, {"Content": "excellent decor and service i had stayed before in Harris Batam, so when the time came to book my stay in Bali, and the Hard Rock was out of my budget, i booked Harris Kuta instead for 4 nights. from when we arrived at the airport at night, the hotel transfer van was already waiting for us, and there were no problems with check-in. in fact, though most hotels will normally allow guests to have only 1 key, Harris allowed us to have as many keys as we wanted. However, as we found out the next morning, one of the keys did not work properly, and the front desk staff were happy to fix the problem.overall colour scheme of the hotel (green and orange) was very vibrant and cheerful. we had no problems with the room or the bathroom, and had no complaints about lack of amenities as we only used the electric kettle to boil drinking water. at the beginning of our stay, we had a small ant problem, which was rectified by housekeeping the next afternoon, when we were out of the hotel. the beds were a bit soft for our preferences though, making it a little difficult to get to sleep. buffet breakfast was standard, nothing impressive, but still satisfactory. the small pancakes and omelettes were better than the slightly bland rice/noodle dishes served at breakfast (however, the nasi goreng ala carte was delicious and they served my daughter as many of the prawn crackers as she wished). i would say that the design/decor of the restaurant had a larger impression on me than the food.pool was alright, clean and large. my toddler enjoyed the stone slide in the kids' pool. however my teenage daughter fell and scraped her knee quite badly on the stone wall bordering one side of the pool- if you have kids make sure they do not have any similar accidents as the cut was quite deep and resulted in a scar. the staff were very prompt about the first aid kit that we requested though.one thing about the hotel is that they had shower rooms inside the waiting room (which smelled faintly of cigarette smoke), which we used after our surfing lessons to rinse off all the sand. other guests might have complained about the walkway leading from the beach to the main lobby, which, true, is not well lit at night, but the security post at the gate is very efficient (the guards will check all cars that go in and out). also there is a shuttle going from the hotel to the main shopping area, but if you miss the shuttle, it is not too far to walk, about 10 to 15 mins.overall, Harris Kuta is a good deal if you are not going to be staying in the room for most of the day, and if you are used to hard beds you might have some difficulties sleeping. location of the hotel is good and close enough to anything you might need (there is a mcdonald's nearby). the service makes up for anything the hotel might lack, though. i am planning a trip in march 2008 and will definitely consider Harris again.", "Date": "Dec 12, 2007", "ReviewID": "UR894512262", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "ilovetheopera"}, {"Content": "Simple, Unique,Friendly.. but dont accept a room with connecting door!       Harris Kuta, Swimming Pool", "Date": "Nov 28, 2007", "ReviewID": "UR890011973", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Squirrel.Nutty"}, {"Content": "Excellent place right in front of the beach! Maybe its odd, but I choose this hotel cos I love the theme color; orange! But anyway Its not a mistake at all. The location is perfect for beaching, clubbing, shopping and fine dining. You walk around 15 minutes to the shopping centre or take taxi which always pass the hotel. The crew are really friendly, the breakfast is superb and the room itself is nuthing to complain. Good for family since they have play centre and pool for kids.", "Date": "Sep 17, 2007", "ReviewID": "UR622753782", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "teutea"}, {"Content": "Not so very nice hotel. We have stayed in Harris Hotel in Jan last year for 8 nitesRoom : very basic, the bed is not very nice, soft and soggy.Front Desk / Reception : average, I mean they are polite but not very friendlyPool : not so big, but on the sunny areaRestaurant : they serve pretty bland food, just go outside hotel for nice and not so expensive meal.Ambiance : The hotel can be very noisy during the night time, one day I have to complain to the front desk officer, regarding the noise from check in hotel guest who came in the middle of the night or very early in the morning ( 3 AM ) , he apologized but there is nothing he can do about it, since the hotel also accepts the transit guest ( guest who doesn't stay overnight , but only for transit  catch their flight later ) , imagine they dragged their baggage at 3 AM in the morning, talking and laughing out loud..The hotel floor is tiled, so we can hear their voice and steps very clearly * read loud *Staff : Friendly and cheerful with exception ; the Front desk.", "Date": "Jul 29, 2007", "ReviewID": "UR841014939", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "2"}, "Author": "Kruyfie"}, {"Content": "Young On Budget I would say Harris Hotel is okay. For someone young and on budget, this is definitely the place. Located in the middle of Kuta, it's situated right in front of the beach. (Though you have to walk from gate entrance towards the hotel). Furthermore, for us it's convinient to get around by walking. The hotel itself is vibrant orange, but once you enter the room, it'snot that bad. (Since i don't favour vibranty colours). It's clean and simple. The staffs are helpful too. For the price we are paying, it's good enough. No fancy treatment, but just nice!", "Date": "Jul 3, 2007", "ReviewID": "UR505452523", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "4"}, "Author": "syaad"}, {"Content": "Young look but run down The hotel is near the beach but far from kuta city center, we have to walk very far to reach the shopping area and restaurants.The hotel exterior is colourful and look young. We were quite impressed with the lobby and coffee house. We were disappointed when entering the room. It is a simple room, very basic amenities. The most upset us was the bed. The bed was sagging and very very soft! The floor without carpet, feel very sticky. The spa service was good with reasaonable price; we enjoyed it.I think is time for them to do some touch up especially room and bathroom.", "Date": "May 19, 2007", "ReviewID": "UR446394355", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "M.Y.Wong"}, {"Content": "My honeymoon in Bali       The bedroom", "Date": "Apr 24, 2007", "ReviewID": "UR225059119", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "PetalingJayaRose"}, {"Content": "Vibrant Orange We have just returned from a week in Bali and spent 3 days with Harris. It has been my third stay with Harris. What attracted me most must be the vibrant colours that Harris don. Love the orange and green. The staff are very courteous and friendly. room is clean, good range of tv channels, fast housekeeping. complimentary welcome drink and free 15 min massage was good.The pool is okay, i still don't know why is the pool water so warm. usuall we wanna go for a dip from the blazing sun in the pool. but then, the warm pool water made our room shower far better. The breakfast was good. I loved the Fish Bakso (fishball soup like in Chinese Restaurants) It went great with the porridge. and the menu changes everyday which is good. One thing they could improve on is the queue during breakfast at the omelette counter; it was way too long for jus an omelette.It was best the first time i stayed at Harris 2 yrs ago. there were not much people. good patrons, more private. but i guess the word have spread and now more ppl coming in. Harris is a good place for 2 days max. then venture out to other hotels.", "Date": "Dec 20, 2006", "ReviewID": "UR633438822", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "3"}, "Author": "Junzie"}, {"Content": "Fun day at Harris Kuta I spend a week end with my family at Harris Resort Kuta . It was the first time, the welcome was very friendly, as their motto  Simple Unique FriendlyThe Kid's Club ans the pool for children very convinient and safe.Room bright and comfortable", "Date": "Mar 1, 2006", "ReviewID": "UR719458289", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "eternel_voyageur"}, {"Content": "銇撱伄鍊ゆ銇倝銆併亰寰椼仹銇欙紒   showReview(19914345, 'full');", "Date": "Jul 28, 2008", "ReviewID": "UR237569534", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鏂欓噾銇ぇ婧€瓒?#x201d;   showReview(19914229, 'full');", "Date": "Jul 2, 2008", "ReviewID": "UR446040669", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇婃墜銇斻倣渚℃牸銇с儶銈俱兗銉堟皸鍒?#x201d;   showReview(19911868, 'full');", "Date": "Aug 9, 2007", "ReviewID": "UR390162573", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "12 jours super sympa       Le Harris", "Date": "Feb 8, 2007", "ReviewID": "UR596640319", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Maaxx"}, {"Content": "銉愩偣銈裤儢銇屻兓銉汇兓   showReview(19910405, 'full');", "Date": "Dec 20, 2005", "ReviewID": "UR886763234", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "绲跺銇婂嫥銈併仹銇欙紒銉曘儸銉炽儔銉兗銇偣銈裤儍銉曘伀鐧掋仌銈屻伨銇椼仧锛?#x201d;   showReview(19910360, 'full');", "Date": "Nov 4, 2005", "ReviewID": "UR224357317", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "缍洪簵銇ч潤銇嬨€併偦銉笺儠銉嗐偅銇儧銉嗐儷銇с仚   showReview(19910227, 'full');", "Date": "Aug 8, 2005", "ReviewID": "UR259743563", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "缍洪簵銇儧銉嗐儷銇с仚   showReview(19930477, 'full');", "Date": "Jul 25, 2005", "ReviewID": "UR711546972", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297697-d597723-r22092906-Harris_Resort_Kuta_Bali-Kuta_Bali.html", "HotelID": "597723", "Price": "Unkonwn"}}