{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Great budget stay”", "Author": "saraallison", "ReviewID": "UR137787735", "Content": "I stayed here with my husband and young child several times in the fall of 2011 on trips to Branson. Our purpose was shopping and going to Silver Dollar City. We just needed a cheap, decent place to sleep and this place fits the bill. The staff was nice, the room was clean, the pool was clean and nice. The breakfast was minimal but we enjoyed walking across the street to have breakfast at Panera. There are decent restaurants right around here, and it's close to the outlet malls. I almost booked a much more expensive hotel that was right down the street, and was so glad I didn't. This is a good, safe, quiet area. The only downside was there was no exercise room but since we were only there for a quick trip it was okay. Plus, if you're going to be trooping around SDC all day, that in itself is a workout! I recommend this hotel if you're looking for a cheap, decent, pleasant stay in a nice area!", "Date": "August 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Waco, Texas", "Title": "“Clean and comfortable”", "Author": "jana k", "ReviewID": "UR134941589", "Content": "We visited in June for our anniversary, the owners were very nice and even put our names on the marque outside congratulating us on our special day. The beds were comfortable (we only used one), they helped us with all our questions, and we were comfortable. Would stay again, the regular key was alright. My only thing I would change would be more variety with the breakfast, mostly all carbs.", "Date": "July 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lees Summit, Missouri, United States", "Title": "“A Home Away from Home”", "Author": "Dawn V", "ReviewID": "UR133824865", "Content": "The room was clean with two queen beds that were comfortable. The office staff was very personable and helpful. For the money, this hotel was a great value. Its location is central to most activities in Branson and discounted tickets are available in the lobby. As a regular repeat guest, Green Gables is the place to stay...especially if you like simple breakfasts. The only thing that was a drawback was that the Internet connection can only be obtained from the hotel lobby. Yet the plus side is, you get to meet different folks and hear about shows - especially since many of the performers drop in to say hello to guests.", "Date": "July 9, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wood River, Illinois", "Title": "“Wonderful Stay”", "Author": "Richard B", "ReviewID": "UR132396342", "Content": "The room was clean with two queen beds that were comfortable. The office staff where very friendly and helpful. For the money we paid it was a great value. We will visit the Green Gables Inn again when we vacation in Branson.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "kansas", "Title": "“Used to be my fav place to stay”", "Author": "KansasDaysInnhater", "ReviewID": "UR126897929", "Content": "Stayed here a couple weeks ago in March. That stay was great! Was returning in 2 weeks for a overnight stay. Went to the office upon checking out and requested the same handicaped room with shower that is easy to use when using a wheelchair.Called back within the week to reserve another room close to the room we had reserved earlier that week and was assured that it all taken care of. We pulled in last Friday to find out the room was occupied by someone else.We ended up in a room we didn't want and hard for a handicaped person to get out of the shower.We used to stay at the Green Gables Inn 2 to 3 times a year, but I think from now on I'll be looking for a new favorite place to stay!", "Date": "March 29, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Warrensburg, Missouri, United States", "Title": "“Good for family”", "Author": "Amy K", "ReviewID": "UR126736124", "Content": "The owners are very friendly, the hotel is clean, the continental breakfast has a good variety and the coffee is good, and we received a discount postcard in the mail after our first stay there--that's why we came back! The location is good and provides easy access to alternate routes to 76. I also like that it's across the road from Panera Bread Company.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Yeah!”", "Author": "Marti W", "ReviewID": "UR121661165", "Content": "We have stayed at Green Gables since their opening weekend. We love it. Everyone treats us like family.", "Date": "December 12, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Arkansas", "Title": "“My favorite Branson Inn”", "Author": "Oldguru", "ReviewID": "UR120769116", "Content": "Our recent stay was my fourth year to visit Branson. The Green Gables Inn is clean, provides breakfast and located behind Andy Williams Moon River Theater. Managers Randy & Diana make sure your stay meets expectations.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great place to stay”", "Author": "hjk111518", "ReviewID": "UR119916377", "Content": "Have stayed at this hotel for years and have always had a great stay.Jose has worked there for years and doses a superb job of keeping the rooms clean.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "CARROLLTON, IL", "Title": "“\"Always meets our expectations\"”", "Author": "RON H", "ReviewID": "UR119596799", "Content": "We have stayed at Green Gables for the last 5 to 6 years in October. We don't even consider staying anywhere else as we have never been unsatisfied with our stay there. Owners are always very friendly an eager to help make our stay enjoyable. We especially like the new furniture and new beds amd flat screen tvs that have just been added. It shows that the owners do care in keeping the facilities updated and clean. We also have always found the rates to be reasonable year after year. Maid service was very good also. The location is close to all attractions and is quiet at night. Would recommend to anyone. Thanks from the Hetelles.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trenton, New Jersey", "Title": "“Nice Facility; Great People !!”", "Author": "RedSox1938", "ReviewID": "UR119078810", "Content": "Our first visit to Branson, MO. The room was spacious and clean and kept that way through our entire stay. Diane and Randy went out of their way to accomodate us. Never too busy to answer questions. One particular day, we wanted to explore the countryside. Randy provided us with a cooler for our sandwiches and drinks. The facility is off the beaten path but close enough to get anywhere we needed to go. Being off of \"76\" has it's benefits. Thank \" You All \" for Everything !!", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Friendliest and cleanest in Branson!”", "Author": "deerhunters", "ReviewID": "UR117728869", "Content": "Labor day weekend 2011 was very busy in Branson. We were real unsure about the Green Gables, but it proved to be very clean and the friendliest managers ever! Randy and Dianna were great host. They went out of their way to see that we were comfortable and satisfied. The rates were great also! Thanks from the Franks.. Hope to go back soon!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Crown Point, Indiana", "Title": "“\"Great place to stay\"”", "Author": "zola1245", "ReviewID": "UR115919047", "Content": "This was a very clean, comfortable, and convenient motel to stay at on vacation. It was also quiet. Everyone we encountered working there, were friendly and helpful.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "cave city, arkansas", "Title": "“treated us great!”", "Author": "happycustomoer", "ReviewID": "UR115774288", "Content": "we very much enjoyed our stay here. we brought a youth group from our church and the rooms were clean. the staff was very welcoming and helpful with every request and special need we had. thank you, green gables inn! we'll be back!!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lake Ozark, Missouri", "Title": "“What an awesome stay”", "Author": "robert_morice", "ReviewID": "UR115651888", "Content": "I wanted to give a GREAT REVIEW to your Inn. As a couple that like to travel and stay in hotels / motels & Inns yours was indeed a treat. It was very clean and the staff were the most friendly people we have ever met. Any questions we had about the Branson area Randy and Diane were there with answers. We felt like we were staying with family! The rooms were very clean, parking lot and pool area constantly being looked after. We plan to have a family reunion and if all goes as expected we will reserve rooms for that next year. Please pass on our thanks for a wonderful place to stay. Bob& Linda Morice", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Decatur, Texas", "Title": "“Wonderful stay with wonderful people at this inn!”", "Author": "l_parish", "ReviewID": "UR115555032", "Content": "We were in Branson over the July 4th weekend for a family member's wedding, and had the most wonderful stay at the Green Gables Inn. Everyone, from the Managers on down, were so helpful, friendly, and courteous. We will definitely stay at this inn again when we book our next trip to Branson.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Really nice and clean, We will be back”", "Author": "pzcop", "ReviewID": "UR115466064", "Content": "This is our second visit to the Green Gables Inn. We received excellent service at the front desk, also with planning our shows and entertainment. The room was very clean and the maid did a great job every day. The location is central to all shows and we moved about without any problems. The ,manager left the pool open one night because our show got out late and it was a very hoit day. WE liked the comfort and location the best. We will return there next year with our entire family which means we will get three rooms instead of one.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Won't Stay Anywhere Else But Green Gables”", "Author": "als66", "ReviewID": "UR115213288", "Content": "My family and I have been to Branson several times and have stayed at different hotels. This year we decided to try Green Gables Inn because of the great reviews and the price we were quoted when we called to book reservation. So earlier this year we stayed there and this is our second time back to Green Gables. Green Gables Inn definitely lives up to the reviews, from the room quality all the way to the hospitality. The managers Randy and Diane are very welcoming, helpful and friendly. Also, Katie was very friendly, helpful and knowledgable on the shows and places to eat. They all went out of their way to answer questions that I had about shows, restaurants, directions and sight-seeing. Me and my family will absolutely be staying at Green Gables every vacation to Branson for as long as Green Gables is there to stay at!!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "West Columbia", "Title": "“Clean and Friendly”", "Author": "simstx4", "ReviewID": "UR115199528", "Content": "We have stayed at the Green Gables Inn several times when vacationing in Branson. The rooms are always clean and the employees and management are very friendly and helpful. The only reason I did not rate my review 5 star is because the rooms do not have microwaves and refrigerators. With all of the great restaurants in Branson, it would be nice to be able to bring leftovers back to the room.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "King City, MO", "Title": "“We will go back”", "Author": "turner03", "ReviewID": "UR114825058", "Content": "The hotel is a smaller hotel on one of the back roads off of the strip so it is easy to access but still close enough to all the attractions. The rooms were clean and the employees were helpful and friendly. There was a small pool that was well kept as well. The breakfast consisted of donuts, toast and bagles with coffee or juice - not elaborate but for the hotel rate it was just fine. Nice place to stay and we will go back!!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Enid, OK", "Title": "“Excellent Branson hotel!!”", "Author": "MamaBearCRTE", "ReviewID": "UR112330095", "Content": "We stayed at Green Gables Inn for three nights. The rooms were comfortable, clean, and well-maintained. The staff was extremely friendly and helpful. My kids loved the pool. It was clean and the water temperature was perfect. The breakfast was ok with donuts, bagels and toast. There was also coffee and juice. The breakfast area was comfortable and relaxing. I would highly recommend this hotel to anyone staying in Branson!!", "Date": "June 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Quaint, clean, & friendly”", "Author": "LuckyMonkeyfish", "ReviewID": "UR107585950", "Content": "My family stayed here last fall for a weekend. The people at the front desk were very nice, excellent customer service. They were in the process of updating the rooms, and I think they were all nice. They had a very nice breakfast area where people would linger over coffee, everyone was extremely friendly. The hotel itself is a little off the beaten path which is nice. It's on a side street off the main road, but is very easy to get into and out of. Highly recommend this place if you're staying in Branson.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Joseph, MO", "Title": "“Clean rooms, quiet atmosphere and amazing staff!”", "Author": "knsbunny", "ReviewID": "UR104621700", "Content": "We've stayed at the Green Gables Inn for several years and continue to go back due to the value, cleanliness, comfort and great staff. The rooms are always extremely clean, location is great and the staff can't do enough to make you feel welcome and at home. When in Branson, this is our home away from home!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Morris ManitobaCanada", "Title": "“We truly enjoyed our stay of 5 days at this super clean & quiet Inn..”", "Author": "anneLO32", "ReviewID": "UR88023024", "Content": "This was our third time staying at this hotel. We love staying here as the rooms are very clean and spacious.As we come to Branson for the music shows and the other local amenities, we do not spend the day at the hotel. It's like a warm and friendly bed & breakfast type hotel, where you get a good nights rest and then go for the day to enjoy all the multitude of things to do in Branson. The breakfast is not a hot ,extended meal--but there are plenty of buffet restaurants very close by if you want those.The staff treats you like family, willing to give directions or advice on places you would like to see. A good value for the amount charged for the stay. My parents and some silings have stayed here in the past and we had friends that we recommended this place to.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lebanon", "Title": "“Outstanding Management @ Green Gables Inn”", "Author": "jtatencoa", "ReviewID": "UR86165161", "Content": "I really want to thank Randy and Dianna on a wonderful stay. It was my first visit to Branson since arriving at Ft Leonard Wood, Mo. I met Randy and he gave me a tour of the facilities and advice on places to go and visit. My wife is always concerned about the rooms we stay in and I must say she was impressed. Thank you so much for the tour and making our stay an outstanding one. This will be the only place we stay as we continue our military duty in this beautiful state. Hooah", "Date": "November 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Catoosa, Oklahoma", "Title": "“Great place to stay”", "Author": "dfitzgerald", "ReviewID": "UR84346220", "Content": "We always stay at Green Gables every time we come to Branson which is about 2-4 times a year. We have never had any problems with the rooms, staff, or anything. They are always very courteous and last summer when we went, our air conditioner didn't seem to be getting cold (it was probably 100 degrees outside) so they moved us to another room quickly. We recommend this hotel to everyone and will continue to stay with them. The price is great!", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City MO", "Title": "“Great for the budget minded”", "Author": "mitchy74", "ReviewID": "UR83883625", "Content": "We were looking for a budget friendly hotel for a surprise weekend away in Branson. Green Gabes definatley delivered. This is an older hotel (real keys!).... But it is clean and the staff is very friendly. Breakfast is very carby, bagels, doughnuts etc.... Right on the Yellow route, very convienent location. Panera is directly across the street. If you are looking for fancy - this is not the place. But if you are looking for a place to put your head after a great day in Branson.. This is your spot! I got information for WiFi, but could never find the signal...", "Date": "October 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Red Deer, Canada", "Title": "“More for older people”", "Author": "Coach2010_10", "ReviewID": "UR81382730", "Content": "Although pleasant enough and clean the lack of a decent choice of breakfast (No cereal at all provided!) and only bagles and doughnuts, plus a lack of in-room coffee-making facilities and even no fridges or microwaves in the rooms let the Green Gables down for us on our travelling vacation through Tennessee, Arkansas, Missouri and Kentucky, as it was the only place we stayed without those things -plus it was the only one we had to pay upfront for for when we arrived too!.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Collinsville, Illinois", "Title": "“wonderful”", "Author": "bjadair", "ReviewID": "UR79252440", "Content": "i was very pleasde with this motel. first time to branson,mo. will return .the managers of motel are fantastic. you are treated like family not just a visitor. very friendly very clean rooms. couldn't of ask for a nicer place to stay... plan to return next year ..", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manhattan, Kansas", "Title": "“Great Independent Property with Involved Owners”", "Author": "KSUBaker", "ReviewID": "UR78383683", "Content": "My wife and I stayed here with other family members as part of a family reunion. My parents had looked at quite a few properties in advance and chose this one based on location, condition, cleanliness, and the cooperation shown by Diana and Randy, the owners. Everything went pretty smoothly during our one-night stay. There were a few hiccups at check-in, but only because our group mostly showed up all at once, and there were evidently a lot of late check-outs. Certainly not the hotel's fault. So some of our party went to Panera, conveniently across the street, for some refreshments. Once into our room, everything looked good. Nice furnishings, nice bathroom recently tiled, with good water pressure in the shower. Comfortable bed, sufficient pillows, adequate lighting. Everything in the room was clean, as were the pool and deck area. The breakfast offerings, while a bit sparse, were appreciated. Pretty decent coffee, too. Check-out was fast and friendly. All in all, a hassle-free experience, which is frankly getting tougher to come by at the big chain properties. Thanks Randy and Diana!", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mid-Atlantic", "Title": "“Perfect exterior corridor hotel, great value, clean, nice pool!”", "Author": "WayfaringStranger", "ReviewID": "UR77122389", "Content": "We were just passing through Branson for one night and I found this hotel through this site and was pleased! We prefer ext. corridor lodging, and they made sure we had the ground level. Parking right in front of the door, easy to unload luggage. Everything was clean and updated. The staff were very friendly and professional. Hotel is situated off the main strip so it wasn't as noisy from the traffic. The pool was great, especially since it was 105 degrees the day we arrived!", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“The positive reviews are on the money!”", "Author": "TEKC", "ReviewID": "UR75224790", "Content": "I was going to be in Branson with friends who have small children (our primary activity would be visiting Silver Dollar City), and we selected Green Gables Inn largely on the basis of positive reviews here and on other sites. Believe it or not, the reviews were accurate: The place is not fancy, but it is clean, has all the basics including a no-frills breakfast, has an outdoor pool, and the staff is friendly and helpful (it's literally a mom-and-pop business). I was a little put off by the open Bible in each room, but otherwise, no complaints. And how's this for old-school: you actually get a key to your room, not a key card. Green Gables is in a row of motels and hotels just off the strip (the turn-off is at McDonald's on 76), so it's centrally located but a bit removed from all the hustle and bustle. It's across the street from a Panera (we ate there twice), and down the road from an Italian restaurant that was Olive Garden-esque (we ate there, too). Note there's not even shampoo in the rooms, so don't even wonder if there are in-room fridges or microwaves or a place to do laundry (no, no and no). But we had ice chests, which worked fine for anything we wanted to refrigerate, and there's a microwave in the breakfast room. (Breakfast is toast, bagels, doughnuts, juice and coffee.) I'd definitely stay at this motel again. It reminds me of the places I stayed at in Branson as a kid.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Location": "4"}, "AuthorLocation": "Marshfield, Missouri", "Title": "“Best Motel in Branson!”", "Author": "bobolink24", "ReviewID": "UR70751696", "Content": "This is a great motel, operated by some of the nicest people you'll ever meet. Managers Diana and Randy were so helpful and bent over backwards to make sure our stay was perfect. And it was. You can't beat it for a nice clean, quiet motel where everything including the A/C worked as it's supposed to. We will certainly stay there next time we are in Branson.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Eau Claire, Wisconsin", "Title": "“Great Hotel Stay.”", "Author": "ddwess", "ReviewID": "UR69921309", "Content": "From the start of making reservations earlier in the year, to the completed stay - we had a great connection. We were traveling on GoldWing motorcycles from Wisconsin, and from the beginning, we had be treated with respect and excitement for our staying plans. We traveled with 4 bikes and a van, and when calling the managers, Randy and Dianne, the day of our arrival, they put out 'cones' for our parking arrangements for our bikes and trailers - near our rooms. The rooms were clean and the pool was refreshing, and the location was great! Over all experience - - GREAT!! We hope to stay another time in the future soon!", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crossett AR", "Title": "“Stay here every year at least once sweet clean place to stay!!!”", "Author": "Tootsie1969", "ReviewID": "UR69217662", "Content": "Hotel always clean, front desk always nice great price! Best value in Branson I suggest to anyone I know that is going to Branson!!! :) Great location easy to get around on the colored routes without driving down busy 76!!!", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cahokia", "Title": "“Great service, even better location, very clean!”", "Author": "L0vinit10", "ReviewID": "UR68177211", "Content": "Our family included 7 kids in ages ranging from 9 - 15, plus 5 adults. We love the Green Gables Inn! The staff was friendly, helpful and accommodating! The rooms were a great size with plenty of room and very clean. The inn is located just off the strip, so battling traffic was not an issue! Another plus of the Green Gables Inn was the pool. The kids absolutely enjoyed swimming! With the reasonable rates, cleanliness of the large rooms, location, the friendliness of the staff and continental breakfast you shouldn't pass this place up!", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nokesville VA", "Title": "“Don't miss this opportunity!”", "Author": "Chuck056", "ReviewID": "UR66337122", "Content": "We had reservations for 4 days at the Green Gables, we enjoyed our stay so much we stayed an additional day. The rooms are immaculate and the staff wonderful. Randy and Diana, the managers of the Green Gables made us feel like we were a part of their family. The rates were very reasonable and the location was perfect. We will definitely go back.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“Excellent place to stay”", "Author": "Cjsingleton", "ReviewID": "UR66051632", "Content": "My husband and I have just returned home from our stay at Green Gables Inn, Branson, MO. We had a wonderful experience with Grace, her family and the cleaning staff there. Grace and her husband went out of their way to make us feel at home, they were so helpful and friendly, it made us feel like we had known them for years. The lense fell out of my husband's glasses and we thought our day was ruined, but Graces' husband was very gracious about me calling him so early in the morning and helped us find a place where we could have his glasses checked and repaired and we were back on track with our day without missing a beat. Our room was exceptionally clean and the beds so comfortable that we both slept wonderfully, something we don't usually do in a motel room. Our room was clean and fresh every afternoon when we returned from our day. Norma did a wonderful job ! I would highly recommend this motel to anyone who wants a great place to stay for a day or a week, right in the middle all all the attractions!", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grove, Oklahoma", "Title": "“Motorcycle trip to Branson”", "Author": "jsdillinger", "ReviewID": "UR65864328", "Content": "We love the Green Gables, the staff was extra friendly and helpful. We had reservations and were told check in was at 3:00 p.m., we arrived at 11:00 and they went ahead and let us get a room. They coned off parking for our motorcycles. The room was very clean and the beds were great. We will most certainly stay there again when we are in Branson. It has been a long time since we stayed any where that has been so nice and accomadating.... Sherri from Oklahoma", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Normal,IL", "Title": "“The friendliness and service are great.”", "Author": "1normal", "ReviewID": "UR40400520", "Content": "I have been staying at Green Gables for years. Their return visitor rates are great and they remember you with great service.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Percy , Ark", "Title": "“Cleanest motel I have ever stayed at!”", "Author": "Percygirl", "ReviewID": "UR34379218", "Content": "This motel is located right off the strip, and from the moment you step into the lobby you are greeted with a smile. Linda was the desk clerk when we were there, and she was so helpful. We really appreciated that. We went to our room, and it really was so clean! Smelled nice, and the rooms were large and comfortable. We loved the beds. You can bet that on our next stay we will be going back to this motel.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tulsa, OK", "Title": "“Clean, great service, great location!”", "Author": "LG1256", "ReviewID": "UR32804492", "Content": "Loved our stay - Very clean, quick and tasty breakfast, and a great location close to many attractions.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Clean, comfortable and peaceful stay”", "Author": "OklahomaVacationer", "ReviewID": "UR32682282", "Content": "This is one of our favorite places to stay. The staff are always welcoming and quick to attend to our needs. The rooms are very clean and well kept. The continental breakfast is a big plus! We love the fact that Green Gables is centrally located to whatever attraction, dining or shopping we like. This is also a very family-friendly and peaceful place to stay. We love Green Gables Inn!", "Date": "June 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tulsa", "Title": "“Love the beds!”", "Author": "BooLynn", "ReviewID": "UR32668945", "Content": "My family and I travel to Branson quite often and we love to stay at Green Gables! The rooms are always clean and I wish I could take the bed home with me! The location is perfect! Close enough to good restaurants without having to battle the traffic on the strip and easy to get to! We will always feel like Green Gables is our little \"Home Away From Home\"!", "Date": "June 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Repeat Customer, Great Price,Awesome Location”", "Author": "SladeMissouri", "ReviewID": "UR22391168", "Content": "We have stayed at several locations in Branson, some that are with TimeShare Tours and their wonderful \"properties\" they actually put you up in. This hotel always makes me happy. It is right off the strip on one of the outer roads which is accessible to everything. Less than a block is Wal-Mart and a Grocery store. There is a great coffee shop across the street and eating places and minature golf within walking distance. It is an inexpensive way to see Branson on a Budget and still have money to have fun. The rooms are larger than most motels, due to the fact that this is an older property, there is a pool, that is outdoor, but we have used it. The staff is right there on property and the owners know us by name. They have several repeat clients. We are one of them. My kids love the bigger room and the quick breakfast in the morning. If we need to check out late, we just ask. They are wonderful and I would recommend it to any family looking to be saving money and having fun.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ormond Beach, FL", "Title": "“Highly recommend”", "Author": "billculler", "ReviewID": "UR14409994", "Content": "The rooms were clean, the beds very comfortable and I loved the long vanity. The only suggestion I would offer is to stop with the deordorant spray. My husband could not stand the perfume smell and complained. Management did offer an odormizer while we were out but the room still had a sickening sweet scent. Otherwise, it is an expectional property for the price. We'd definitely go back.", "Date": "March 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mustang, Ok", "Title": "“Great place”", "Author": "slick0721", "ReviewID": "UR8486161", "Content": "My family travels to Branson several times a year and we usually try different places for lodging. This is one place that we will come back too. It is off the strip, which makes it a little quieter, but it is still really easy access to everything. The staff was extremely friendly and helpful.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kansas city", "Title": "“Clean and spacious”", "Author": "club612", "ReviewID": "UR8126425", "Content": "We visit Branson several times througout the year. We have stayed several places in Branson but always seem to return to The Green Gables. It is a family run motel that takes pride in its cleanliness. The rooms are spacious. We usually travel with children and the two queen beds are big enough for the entire family. The continental breakfast consists mostly of doughnuts, coffee, and cereal. Great value with reasonable prices!!", "Date": "July 16, 2007"}], "HotelInfo": {"Name": "Green Gables Inn", "HotelURL": "/ShowUserReviews-g44160-d598439-Reviews-Green_Gables_Inn-Branson_Missouri.html", "Price": "$70 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2400 Green Mountain Drive</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "598439", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/2c/7e/14/green-gables-inn.jpg"}}