{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“From Prabha Rao India”", "Author": "prabharao", "ReviewID": "UR138508458", "Content": "We were really very glad we chose this hotel. The reception staff were friendly and helpful. The location was convenient with all the tourist spots within walking distance, and good restaurants nearby. The room was spacious & the shower was very good. Air-conditioning was very effective (when temperatures were 42 C outside). It is economical & clean. Fresh towels everyday. For vegetarians there is \"El Picolino De La Farfalla\" nearby which gives good veg pasta.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“Highly recommended”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR134598914", "Content": "This hotel is in the perfect location. It is a 5 minute work from Puerta del Sol - which is on one of the main metro lines. The hotel is right on the corner of Plaza de Santa Ana, which is busy every night . We were on the second floor, right on the plaza, which we thought was going to be too loud. However, the windows are double glazed, so the noise is quite minimal, and if you do as the Spanish do, it won't matter anyway - because you will be out late. They pack the tables and chairs in the plaza up around 1-2am - so its not busy all night. The rooms were big enough and very clean. The bathroom was modern and fresh towels were provided daily. The staff were very helpful and informative. I would definitely stay here again.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Russia", "Title": "“Great location! On the whole, hotel is ok”", "Author": "JuliettaR", "ReviewID": "UR131605654", "Content": "Stayed here for 4 nights. Our room was tiny, but the great view at Plaza Santa Ana with its magic life opens from the small balcony. Hotel location is really fantastic. It’s walking distance to everything in the city. The Prado and Thyssen-Bornemisza museums are about 10 mins walk, literature lovers will enjoy Cervantes monument (there are 2 in the city :) and Lope De Vega museum located in few steps from the hotel. Hotel staff are extremely helpful and friendly. Thank you very much to Ammar at the Reception, who provided us with good maps and knowledgeable recommendations for sights, flamenco and other interesting facts about Madrid. Free Wi-Fi at our room was very fast. The air conditioning worked well. Good soundproofed windows perfectly block the huge street noise, but at the same time bathroom walls are thin, and you can hear water runs and other noise from neighboring rooms. Also it can be much noisy on weekend night, when a lot of guests back to the hotel at the early morning. Room safe-box is chargeable, you need drop down a cont in 1 euro every time when you want to close the safe. The main negative impression we had from our stay were carpet moths in our room :( Continental breakfast included in the room rate is 100% continental, but it was ok (a glass of fresh orange juice, coffee with hot milk and one pastry of your choice). And it’s not a problem to eat in the city, there is plenty of bars and restaurants around. For a short stay, the hotel is ok. As for me, if I back in Madrid, I will prefer to discover another hotel in the same location.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“City break.”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR130661742", "Content": "The main advantage of this hotel is undoubtedly it's location. Easy walk to all the main sights and lots of restaurants and bars in the area. The room we had was small so may be worth asking when booking as I think there are some larger rooms available. Staff are very helpful and friendly.The inclusive breakfast is adequate but no rieal options available, just a very basic continental. At the Maui you get reasonable value for money in a lovely city.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Gatos, California", "Title": "“Nice central location in old Madrid”", "Author": "Junbug4", "ReviewID": "UR124938128", "Content": "We stayed at Hotel Miau for one night, the 1st of January, while we waited for our VRBO rental to become available. The location was perfect, at the corner of Santa Anna Square. The room was good size with nice view of plaza. Staff was nice and helpful. We had breakfast across from the hotel. Hotel miau worked out perfectuly for us and we would stay again.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Top place to stay”", "Author": "Paul_D_Dublin", "ReviewID": "UR123180150", "Content": "Stayed in a double room here on the first floor. Room was reasonably sized. Cleanliness was acceptable, if not totally spotless. The area behind the bed could have done with a hoovering. I imagine however that this place is like a train station most of the year with people passing through it, so the cleaning staff must have their work cut out for them. Decent enough restaurant downstairs. Very helpful, friendly and personable staff, they let me leave my bags at reception for a few hours after I checked out. Fantastic location as well on Plaza de Santa Ana, right in the heart of Madrid. Didn't experience any issues with noise from outside, slept like a log, although it is a very busy area. Would definitely stay there again.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Best location, best price!!!”", "Author": "JuneHoLee", "ReviewID": "UR119429313", "Content": "In my first time in Madrid, me and my daughter stayed in this hotel for only 1 night. The room is little but clean and the bathroom is very good. The breakfast was included with coffe, croissants, juices and churros. The only imperfection was the smell!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“SUPERB place to stay.”", "Author": "EgyptophileEngland", "ReviewID": "UR118511459", "Content": "We have visited Madrid a number of times and stayed in hotels and hostals in the vicinity but had never stayed at the Hotel Miau before. We saw the reviews on Trip Advisor and decided to give it a try. Wow! Serendipity! There were prompt responses and friendly emails to and fro when we were making our initial enquiries. The greeting from 'Mercedes' on the reception was both charming and informative and we were delighted to learn that we had been allocated a room directly overlooking the Placa Santa Ana. When the shutters and double glazed windows were open we were able to enjoy and soak in the atmosphere of this lively square but once they were closed there was no disturbance at all either during our afternoon siesta or at night. We opted for the accommodation without breakfast because we know there are many options in the area but did wander in to the adjoining Miau cafe on the first morning to see what they had to offer. With no pre-amble the waitress told us to \"Sit!\", so we did - and waited for her to take our modest order of a croissant and coffee each. Two large glasses of orange juice arrived. Even though we declined them she left them on the table. We told her we were staying at the hotel but we weren't on the breakfast option and asked if we could have \"Dos croissantes y dos caffe con leche, por favor -\" adding \" two coffees and two croissants please\". She didn't acknowledge our order at all. A cup of TEA and ONE croissant arrived. We got up and left - as I thought the next plateful to arrive might be bacon and eggs for my strictly vegetarian friend!. We were surprised to see some positive reviews of the breakfast/cafe on Trip Advisor when we returned because it seemed to us that the woman had neither a good command of Spanish NOR of English and was programmed to dish up whatever the 'breakfast' was supposed to be for any likely looking hotel guests. Apart from the Cafe, our stay at the Miau was delightful. ALL the receptionists were friendly, helpful and professional in every way. The room and bathroom were perfectly adequate in every way and the maid was unobtrusive but attentive. For example, we arrived in the early evening and hadn't wanted to go hunting for extra pillows. When the room was \"done\" the next day, the blanket in the wardrobe which we had used to raise our pillows had been replaced by two additional pillows. The Hotel Miau is ideally situated for the metro, art galleries, flamenco and some excellent shops. It is not a luxury hotel but it was spotlessly clean, quite well appointed and excellent value. We will certainly be back to the Hotel Miau and my only reluctance to writing a Trip Advisor review is that too many other people will discover it and we won't be able to get a room when we want to return.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "La Paz, Mexico", "Title": "“Six weeks in Europe and this was by far the Best for the Price!”", "Author": "nblapaz", "ReviewID": "UR118432649", "Content": "Traveling with my 82 year old mother and 65 year old friend. We were on a budget so our selection of hotels was kept to $50/each or $150/night tops. It was necessary to have an in the room bathroom so our choices were limited. To our surprise we came across the Hotel Miau for a 5 night stay in Madrid. We were given a corner room that overlooked the Santa Ana Square with the lively atmosphere that comes alive at night and makes you just love Madrid. There are three large window with small balcony. The sound reduction is perfect as the windows have double pane with shutters and then an inner enclosed cutting off all sound. The beds were not the most comfortable but what could be expected for the price range. The room was huge and gave us a lot of room to spread out. The bathroom too was large. We did not come to Europe to stay in our room but this one made us enjoy our location. The hotel is clean and service is excellent. English is spoken and everyone is willing to help you get to know and love Madrid, which we did. There is a lift to all rooms but only two can go up at a time which was a little problem for three of us. Maid service was great and kept the room clean and tidy. We did experience a problem with the toilet not wanting to fill and told the front desk. It was late so they brought up a bucket to put water in it. I would of thought they would have a look to see if they could get it to work. Well, my ex was a plumber so I looked at it and was able to get it working but they still had someone the next morning come. There is a restaurant next door that gives discounts to the hotel clients. We were not so impressed with it after one tried as there are much better places close by. If you want to be right in the middle of Madrid and in a great area for Flamenco shows, restaurants, shopping and metro this is the place for you.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Southport, United Kingdom", "Title": "“Perfect position very comfortable good value hotel”", "Author": "johnjclarke", "ReviewID": "UR99494001", "Content": "This was an exxcellent choice for a short visit to Madrid. Its position, right in the centre of Old Madrid makes it easy to walk to the big attractions like the three great art galleries and Plaza Mayor. It is on the corner of Plaza Santa Ana which is lined with excellent restaurants and Tapas bars- great after a day's sight-seeing. The staff were friendly and very helpful. The room was comfortable and well equipped with good en suite facilities and the buffet breakfast was good. Best of all was the ability to simply set off walking in any direction and be able to enjoy the old city. Very good value.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent hotel at a great location with affordable price”", "Author": "KreyzTravelr", "ReviewID": "UR85634236", "Content": "My husband and I escaped to Madrid for four days to have a good time. I had read the previous reviews and decided this is where I wanted to stay. This hotel is for the adventurous traveler who doesn't mind the outside noise and likes to be part of Madrid's lively nightlife. Service is very good. Mercedes, one of the employees is very knowledgeable and eager to help. Hotel is centrally located and you can walk everywhere, especially in the Barrio de las Letras where everything happens at night. The bedroom walls are thin, and you can hear what happens in the room next door. It wasn't a problem for us, but it was for our not so friendly neighbors who rudely asked us to lower our voice. I would definitely come hear again.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Great location”", "Author": "cristina023", "ReviewID": "UR80798966", "Content": "Madried is an expensive city and I found it quite difficult to find someone both affordable and decent. Hotel Miau was a good size, not too big. The rooms were a good size and the staff extremely helpful. In fact my husband got sick with the flu while we were there and the staff couldn't have been more accommodating. The only blemish was that breakfast was served in the very nice cafe next door and the staff were a little over-officious about what we could and couldn't have for breakfast. On the plus side, we could walk nearly everywhere we wanted to go to, the Prado, Retiro Park, El Rastro, the Royal Palace were all very handy and it was a safe neighbourhood.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hermosa Beach, California", "Title": "“Great location and value (for Madrid)”", "Author": "CathyDM", "ReviewID": "UR78970022", "Content": "Spent our final night in Madrid in room # 27. It was a double (2 beds) and quite a nice size. Bathroom was also a good size. Our room had a juliette balcony overlooking the square. We didn't have any issue with noise - but we did not arrive until 11:30 pm and went out until 1 a.m. or so. Breakfast was included in the rate (95 euros) and was very basic - just coffee and a roll. The worst issue we had was not with the hotel but trying to arrive by taxi on a Saturday night at 10:30 pm. Instead of dropping us off near the hotel and having us walk a block or 2 to the hotel (which most drivers insist upon doing in these types of pedestrian areas) this taxi driver was trying to get us directy to the front of the hotel through the mess of traffic in the square. We finally told him just to let us off a half block from the hotel (when we saw it). Although I'd recommend this hotel I prefer the Hotel El Prado nearby for the quality of room and the value.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bogota, Colombia", "Title": "“Small hotel but great location”", "Author": "JimmyHH", "ReviewID": "UR44176511", "Content": "This hotel is situated in a very nice plaza and in general well centered. The people are very friendly. I dont advise the breakfast though. The rooms are small but it dsnt matter since ur not gonna spend ur time in the room.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Noisy!”", "Author": "traveling_geek_14", "ReviewID": "UR17068561", "Content": "As the hotel was booked for me by my hosts in Madrid, I read through other reviews before leaving home. Afraid of the often mentioned noise issue, I asked for a room not facing the street. Unfortunately, they did not have one available (only few do not face the street) but assured me that the nights of my stay (Monday and Tuesday) meant noise would be minimum. Perhaps it's true not many party Monday night, but many due cue up to enter the paring garage under the square just below the hotel windows in the morning, and a large percentage of them enjoy honking the cars' horns. Noisy! Very noisy! The room was small, recently refurbished (marble in bathroom, new fixtures), but the carpets were stained, the windows feeble wooden frame rooting away (which undoubtedly made the noise issue worse). Smell is also a problem in the rooms - it seems that ventilation shafts are shared to an extent that I could smell the moment my business colleague put on his after-shave in the morning. I could also hear him come in at night, plus anyone in the hallway, as the walls are paper thin. Breakfast is taken in the adjoining restaurant (entrance around the corner): a choice between three kinds of pastry with a hot drink and a glass of orange juice. Fine for me, but some complain. The same restaurant offers the \"day menu\" for 10 Euro (June 2008) and it is good value. The only problem may be getting the waiters to take notice of you, but this seems to be a general rule in Madrid. Hotel Miau has WI-FI, although the staff at he reception were not familiar with the current password and we had to wait for one of their colleagues to settle the issue.", "Date": "June 20, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Kristiansand, Norway", "Title": "“Almost ruined our holiday”", "Author": "Gunnar2000", "ReviewID": "UR16777531", "Content": "Miau was a total disaster for my girlfriend and I. We arrived late, tired but looking forward to a nice few days in Madrid. We'd seen the pictures on their webpage, and read the information. So we were in for a nasty surprise. The room was small, the carpet dirty and stained, the coverlet over the bed was dirty. And the noise was absolutely horrible. DO NOT believe the hotels' claim on it's webpage that the rooms are soundproofed. Ours was not. There was standard, single plate glass in the french windows and thin wooden panels to shut out intense traffic, drunks singing and arguing, police cars with their sirens on. The location is faboulous, but you will do a lot better in living in any hotel 100 or more meters away from Plaza St. Ana. That way you can enjoy whatever goes on as long as you like, and you can leave the party and people honking their carhorns when you wish. And there were no clotheshangers. Everything was wrong with this hotel - but the location and quite fresh-smelling soaps in the bahroom. How they got their 3 stars, I would like to know. We moved as fast as possible. The hotel offered another room, it was probably more quiet as the window faced a grey concrete wall. But that too felt dirty and smelled funky. We had no problem finding a better room for a better price in the area. When we left, the hotel did not offer to refund us for the night we stayed, or for the next night. But the 95 euros a night for an empty room at the Miau was money well spent in saving our well earned holiday. Borge, Norway", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Great for a short busy stay”", "Author": "celeste652", "ReviewID": "UR6505247", "Content": "I went to the hotel website directly and phoned during the day and asked for a reservation... They were great and spoke enough English.. Loud, well ..Yes! but only if you try to sleep past 930AM... Request an interior room it cuts down on the noise... We found the noise a perfect alarm clock.. We walked everywhere and found the morning treat of a quick small breakfast a delight.. By day three I learned I am allowed a second cup of coffee, which I generally take three stateside so I was glad to know this... We were in walking distance of everything great in Madrid and then some... We were also out of distance of the tourist bustle... There is a pizza place with cheap eats around the corner... A butterfly sign and a nice lady runs it... There is a Chinese owned market in the next tiny plaza over that has items you may have forgotten very cheap. socks, hat, ect..... and Vino Tecca is a great last bite for the night, on the way into the room.. The brie in phyllo dough was a great Tapas.. This hotel is a find for 85 Euro per night with breakfast... We are a couple in our 30's and 40's with no children... We travel frequently and love to walk and see every bit of a city... You will not be too disappointed if you choose this place... and take a taxi from the airport it was only 22 Euro from the airport..get them to drop you at Vino Tecca on the Plaza de Santa Ana...enjoy..oh and an elevator too...", "Date": "December 27, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Portland, Australia", "Title": "“Very noisy and not good value”", "Author": "Germander", "ReviewID": "UR5425982", "Content": "I stayed in this hotel in June for one night, and would not recommend it. For the price, 80euros + tax, there are much better hotels in Madrid. My room was on the 1st floor overlooking the Plaza Santa Ana which naturally was quite noisy during the evening and early hours. The hotel's website mentions rooms are sound-proofed, but this one definately was not. No doubt internal rooms are much quieter. While a large room, the furnishings were shoddy and the carpet was very dirty. The bathroom was clean, but did not have a hairdryer. Breakfast is included in the price, but consists of just a cup of coffee, one croissant, and OJ at the downstairs bar. I've never complained about a hotel before as there is usually some redeeming feature, but afraid I couldn't find anything to like about this hotel apart from its central location.", "Date": "July 5, 2006"}], "HotelInfo": {"Name": "Hotel Miau", "HotelURL": "/ShowUserReviews-g187514-d599697-Reviews-Hotel_Miau-Madrid.html", "Price": "$81 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Principe 26</span> | <span class=\"extended-address\">Esquina Pza. Santa Ana</span>, <span class=\"locality\"><span property=\"v:postal-code\">28012</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "599697", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f3/2b/f32b59441975a2614b7641ddbb97249b6large.jpg"}}