{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sacramento, California, United States", "Title": "“A Perfect Birthday Weekend”", "Author": "Cyndi R", "ReviewID": "UR128131535", "Content": "My girlfriends and I recently decided to go to Napa for my 29th birthday celebration. We were so excited to find RiverPointe. The rooms are spacious and like little cottages. There is a large and comfortable bed in the bedroom and the couch pulls out into a bed as well. The blankets are soft, warm and cuddly. I loved the little towel animals they made, it made me feel like I was on a cruise. We took full advantage of the kitchen space. We cooked breakfast every morning and even grilled an amazing dinner. We went to the wineries the Manager James suggested and had a blast! I was surprised at how informed the staff was about the Napa area. When we weren't out sightseeing we were lounging at the pool and hot tub. It was a definite plus that the pool was heated. We can not wait to come again! Thanks RiverPointe!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Great time in Napa and at RiverPointe”", "Author": "phylmokap424", "ReviewID": "UR127994723", "Content": "Just returned from a week in Napa and at RiverPointe. We exchanged into this resort through Interval International and were not disappointed! While the cottages are, in fact mobile trailers, once you learn about the area being a flood zone, it makes perfect sense to have the units transportable. The resort is very conveniently located to both Highway 29 and the Silverado Trail making visiting literally hundreds of wineries very easy to do. The staff at the resort was exceptional and Marilynn, the activities director is FABULOUS. Her energy and enthusiasm is contagious, not to mention the wonderful orientation breakfast she organized on Monday or the three FREE wine tasting evenings she arranged during the week. In addition, she had contracted with Hector Gomez of American VIP Limo for a 6 hour tour in a stretch limo which included visits to 5 different wineries, plus a stop for lunch, all for $65/pp. What a fantastic day!! All in all, we would certainly recommend RiverPointe to anyone interested in visiting Napa and Sonoma and we will definitely return in the near future!", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crockett, Texas", "Title": "“Nice Clean Resort, Friendly Staff”", "Author": "rose h", "ReviewID": "UR127769221", "Content": "Came to Napa for the Kingston Trio concert with my honey and was very please with the resort. It was very clean and had a very friendly staff. Look forward to staying again during the summer months to enjoy the pool and spa. Would recommend this resort to anyone looking for a nice peaceful stay in the Napa Valley.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Low budget unreliable Excurstions”", "Author": "floydfunster", "ReviewID": "UR127643460", "Content": "All promises no follow up. Talk a big show about being respected by Wineries and have special deals. No!!. The worst time ever. Food is less than Mc E Dees. All about SALES and pressure to sign on doted line. No REAL concern for guest, repeat over and over how good they are about patting themselves on the backs. Soooo no sincere. Rooms cold and drafty, surprise Napa allows them to operate in the city limits. Property like a Oklahoma end of the road flop house. YMCA would be better. All about getting into your pockets, excursions are a joke...wine tour(undrinkable) city tours(no points of interest). Don't waste your time or money.....Floyd", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bisbee, AZ", "Title": "“Wine Country at it's best!”", "Author": "catwoman03", "ReviewID": "UR127494726", "Content": "I came to River Pointe with my sister, who is my very best friend, and her husband. While her husband spent a few days with his son in San Francisco, Vicki and I took the Napa Wine Train tour (some of the best food and jovial company, and great wine I've experienced) and loved it. What made the entire week one of our best time share experiences yet was the very friendly and accomodating staff (Marilyn, the concierge, went out of her way to treat us with a wonderful, FULL, cooked breakfast on our first full day, two free wine tastings and lectures from the vintners on two days of the week, AND a wonderful dinner for \"whoever\" of us wanted to join in at Cuvee Restaurant....some of the most fun and frolic we've had in a while. All the staff at River Pointe went out of their way to help us totally enjoy the trip. The cottages themselves (we had one full and one studio) were delightful and felt more like home...helping us to truly relax every moment we were in them...which wasn't that often because we were in SF two days, up and down the valley several days, and just enjoying every moment. The cottages were well stocked with all we needed for the week (dishes, linens, VERY comfortable beds) and we bought enough groceries we weren't eating out all that often. We will definitely come back, in fact can't wait, and enjoy the wine country beauty and hospitality all over again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Reasonable, Friendly, and Clen”", "Author": "Lattebud", "ReviewID": "UR127412411", "Content": "My partner and I, as well as another couple, had an event on the Napa Valley Wine train and opted to stay at RiverPointe. Upon arrival, we were a bit taken aback by the fact the the \"cottages\" were actually mobile homes. Even though we were several hours early, the front desk checked us in quickly and had us in our unit. The unit itself was what one would expect from a single wide mobile home. For the 4 of us for one evening, it was not an issue. The unit was very well maintained and cleaned. In fact, I dropped my keys on the floor, got down on the floor to get them out from under the table, and found the corners were spotless. Linens, kitchen utentils, and other items provided were in good shape. The primary bedroom bed was very comfortable. But the sofabed wasn't so comfortable. A great deal of care was taken to ensure guests had all the information they needed, down to the light switches being marked, extensive directions how to connect to the free WiFI, and instructions how to use the TV remote, that included premium channels. The front desk did everything they could to make the experience more pleaseant. There is a WalMart within about a 7-10 minute walk and the Wine Train and Oxbow Market was a 20 minute stroll. Knowing we were walking home from our event and not having to have a designated driver made for a much more relaxed evening. If someone asked about it, I would say it was clean, quiet, comfortable, good service, convenient location, and, if offered, a great deal.", "Date": "April 7, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gardnerville, NV", "Title": "“Quiet accomodation, convenient location.”", "Author": "Wyndwhystle", "ReviewID": "UR127388858", "Content": "Units are small cottage trailers, suitable for couples but any more than two would be pushing it. We are cyclists and appreciate the river front bike path next to the property that leads to the Silverado Trail and gives a rider access to all of the Napa Valley. Our unit was clean on arrival, towels and trash were taken care of regularly (we were on a time share exchange). It would be nice if the Wifi actually worked, and the $8 Resort fee seemed unnecessary for guests who did not use any facilities or attend any of the activities. Why not charge those who actually attend your wine tastings and breakfasts? We already pay an $800 annual fee at our home resort.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern California", "Title": "“No Regrets!! :)”", "Author": "Inlander_WillTravel", "ReviewID": "UR127149073", "Content": "I visited this resort Sunday, 3/25/12, through Saturday, 3/31/12, and I have to say that RiverPointe exceeded my expectations! Arriving in the early afternoon, the friendly front desk checked us in upon arrival, which started the vacation off on a good note, since we had been on the road for 8 hours! And, the front desk personnel continued to be friendly and helpful throughout our visit. We were given Unit #49, which is towards the front of the property near the clubhouse. The unit was clean and tidy. Apparently, this unit is essentially a 'single-wide' mobile home, which consisted of a living room (sleeper sofa), kitchen area, bathroom, and bedroom (queen-size bed). Wonderful!! ALL APPLIANCES AND UTILITIES WERE IN EXCELLENT WORKING CONDITION - hot water got hot, and quickly, heater heated the unit, both flatscreens worked, as well as their respective remote controls. We did not have to make one phone call to maintenance during our stay. RiverPointe has a FANTASTIC resort activities program, which included THREE free evening wine tasting events, a free welcome breakfast, and several day trips available for purchase. We purchased the San Francisco limo tour (major SF sights in a day), which was fantastic! A shout out to 'Hector' of American VIP Limo - GREAT TOUR and GREAT SERVICE!!! There was only one negative: the fitness room needs serious upgrading! It consists of a treadmill, an elliptical machine, a stationary bike, a flatscreen TV, and a scale.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bay Area, CA", "Title": "“Not my idea of a resort....”", "Author": "wishIwerent_here", "ReviewID": "UR125950827", "Content": "The \"condos\" here are trailers that have been driven in and parked. An area of the grounds is either under construction or deconstruction, I'm not sure which. We had a one bedroom condo which is marketed for four people, but was a little tight for two teenagers and their parents. The bedroom had so little space between the end of the bed and the built in unit that the drawers wouldn't fully open and it was difficult to pass through to the far side of the bed. The spa next to the pool was closed with a sign (on March 10) that it was due to reopen February 17. Another nice spa was located elsewhere on the property, but one couldn't easily go back and forth between it and the pool. This property is a timeshare and so has free laundry facilities, badminton, croquet and volleyball available. The unit had a kitchen as well. I thought the $99 I paid for a living social deal was an okay deal, but my husband really disliked the place. We won't be returning.", "Date": "March 11, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California, United States", "Title": "“Love it!”", "Author": "Jill Z", "ReviewID": "UR125625376", "Content": "RiverPointe is by far, the place resort/hotel iv ever been to! I love the personal houses, and they really do have the \"homey\" feeling. I would go here whenever i could. :) Love it, Love it, Love it!!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Beyond Imagination”", "Author": "Sworbie", "ReviewID": "UR125099033", "Content": "River pointe has been, by far, one of my favorite places to stay when I'm in Napa. It's a great location to everything- shopping centers, vineyards, river, etc. The staff is great and super friendly. Upon arrival, keys are given and directions on how to get to your room. If you've been here, it looks like a neighborhood of sweet cottages, when to be frank, it's a trailer park, but it does NOT feel or look that way at all. The room is pretty spacious. You have a living room, a couch that turns into a bed (if you have more than 2 people in your party) your own kitchen, a comfy bedroom, and a porch out in front. They also have 2 hot jacuzzi, a swimming pool, a club house and a lounge at the resort. In the morning, the housekeepers comes and changes out anything you need. If you feel something is missing, or the housekeepers couldn't provide, you can call front desk and they will help you. This place is reasonably priced, and by all means, affordable. My stay here has been pleasant, and whatever problems I had (once had a very noisy neighbor that blasted their music) I called front desk, and it was handled immediately. I would recommend everyone to stay here, or at least, let them judge it for themselves.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South San Francisco, California", "Title": "“Quiet Location and Great Staff!”", "Author": "Tennille T", "ReviewID": "UR124992573", "Content": "Riverpointe is a great location if you want a relaxing, peaceful environment. Everything about this resort was calm, clean and cool. The 1bedrm was a nice size for two people. It was clean and peaceful. The area was serene with fresh air and beautiful scenary. More importantly the staff also made this a wonderful and relaxing experience with their great attitudes. Jerome and Mary work in housekeeping and did an excellent job with making our experience comfortable and rewarding. Good housekeeping staff always makes a difference! We will be back! Thank your Riverpointe for this great experience :) Thanks, Tennille and Rodney", "Date": "February 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scotch Plains, New Jersey", "Title": "“Too small for 4 people”", "Author": "GetMeOuttaHere07076", "ReviewID": "UR121804209", "Content": "We stayed here for a few days with our friends on the pull out couch before booking a room nearby. Pull out was comfy. Trailer was clean as a whistle upon arrival but, maid service is only offered once during the week which is not enough for 4 people. When service is done they only pick up dirty towels, empty trash can, and drop off clean towels. It would be nice if they'd give the floors The one bedroom is great for a couple but, too small for 4. The only other issue is that the entire trailer rocks whenever anyone takes a step. Didn't check out pool or hot tubs because it's December.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, quiant little community, amazing value.”", "Author": "minx1290", "ReviewID": "UR121159006", "Content": "My husband and I were planning our October trip to Napa valley and wanted one of our best friends to come along. Unfortuantely, she was a little lacking in funds at the time and so we thought we would get a room with a pull out couch so she wouldn't have to spend on a hotel. To our horror, it seemed like everything in Napa that weekend was $400+ a night. And staying for 5 nights meant quite a bit of money on some mediocre hotels. So I began looking for temporary rentals and the sort and happened upon this place. It is a time share and if a person with a week cannot make that week, they are allowed to rent it out. We were lucky enough to get this place for 5 days for what it would have cost for 1 night at the lowest price hotel in town that weekend. We were not sure what to expect when the owner told us that they were \"portable\" units, but once we arrived we were very pleasantly surprized. This is a trailer community, but the community is a absolutely charming. All the units are either yellow, red, or blue and look more like little houses than trailers. All have the same little land scaped path of lawn in the front and parking spot driveway. All units also have a little patio with table and chairs before you walk into the unit itself. The units are very nicely outfitted. We were shocked to see the inside of a trailer could look so nice! high ceilings with windows around, a living room area with TV, radio, pull out couch, a dining table, and a full kitchen. the bathroom was also very nice and the bedroom was very comfortable. Of all the rooms, the bedroom was probably the smallest and the only room that felt a little cramped, but we had 2 dressers. 2 night stands, a tv and a queen bed in there and we tried to put all our luggage in as well. Right behind the trailer, and visible through the living room window is a trail that snakes right along side the Napa River. All in all, we were VERY pleasantly surprized by how nicely they could transform a trailer. In fact, we enjoyed our stay (and the price!) so much that we even asked the front desk if there were any time shares available . Unfortuantely there aren't, but we may go back here to try it again!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas City, Texas", "Title": "“the best place”", "Author": "anthony h", "ReviewID": "UR120712701", "Content": "it was a great expirience staying at riverpointe its a really nice place to relax and to be with the family..also EFRAIN L was really nice an patient all the times he had to came and help us we appriciate his help!!!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spruce Pine, North Carolina", "Title": "“Great resort, good location”", "Author": "mbeachjr", "ReviewID": "UR120495597", "Content": "Stayed here in early Oct. in a 1 bedroom. Lovely resort, very clean, yes mobile homes, perfect for 2 people. Nice patio area. We were given usefull information at the breakfast orientation on how to avoid the main highway and use the Silvarado Trail which was right around the corner. Very close to Oxbow market which was a great foodie place.The River Walk Trail was right behind the resort. Would stay here again.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“From start (reservations) to finish (check-out,) EVERYTHING about RiverPointe Napa Valley Resort was AWESOME.”", "Author": "bleedinorange78", "ReviewID": "UR120317745", "Content": "We made our reservations for our stay at RiverPointe Napa Valley Resort with Dana. Dana was extremely pleasant and helpful. The check-in process was speedy and effecient, even though there was much commotion due to Halloween party attendees gathering in and around the front entrance and front reception areas. The property was well-manicured and clean. The room was great. Very clean, quiet, and private. Comfortable little living room/kitchen/dining area. Private patio, covered by a large tree was a nice place to sit when we returned from dinner with a nice glass of wine and an excellent place to enjoy our Sunday paper and coffee. The bed was very comfortable, with high-quality linens. Having travelled extensively, a comfortable bed with high-quality linens are a nice luxury when away from home. We were sad to leave as we were so enjoying our anniversary get-away so much. We will DEFINATELY stay here again and again and will recommend it to our family and friends. Thank you to Dana and everyone at Riverpointe Napa Valley Resort.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice quiet cozy location and best and friendliest staff ever”", "Author": "Castle0", "ReviewID": "UR120275349", "Content": "Awesome place and excellent customer service top notch staff", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "usa", "Title": "“Ok, but not great. You get what you pay for!”", "Author": "number5alive", "ReviewID": "UR120212675", "Content": "RiverPointe Napa is a trailer park. Not that I have anything against trailer parks, but that is exactly what it is. If you are looking for a hotel or a real resort, this is not it. Pros: Clean, good location for wine touring, quiet, cheap. Cons: Maintenance issues (we had no hot water for the first 2 days), trailer-park feel If you want to come to Napa and spend your money on wine rather than on accommodations, then RiverPointe is the place to be. It is very inexpensive ($109/night through TripAdvisor) and it is clean. However, it is a trailer park and it does not have the things a regular hotel would have. It is in Napa, but you can't really walk to the main drag of Napa. It's more of a 5-minute drive. Worth it if you are trying to save money. We also had more than one maintenance issue during our stay. The most annoying one was that the gas tank went out on our trailer, leaving us with no hot water and no fire on the gas stove. The maintenance people were very fast, but it would have been nice if we didn't have to call them at all. Personally, I wouldn't stay here again, but I would recommend it for someone who really wants to save money and is looking for an adequate but not fancy place to stay.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Good place for Napa Valley”", "Author": "rakada", "ReviewID": "UR119897440", "Content": "We stayed for two nights. The cottage was clean and comfortable. In the kitchenette you can prepare or warm up small snacks. The resort is quietly located outside of Napa city centre. If you want to use the breakfast vouchers (we booked breakfast vouchers in advance, and I don't understand why they charged us 12 Dollars for a 10 Dollar voucher) you have to go the three kilometers into downtown, they do not offer breakfast at the resort. You share the patio, using it makes fun when you travel with friends having the cottage next to you, or when the other cottage is not occupied.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Truckee, California", "Title": "“Wonderful little cottages”", "Author": "Kim C", "ReviewID": "UR119569346", "Content": "We had a wonderful time at this resort and will be back again. The decks off the cottages were terrific for relaxing after a long day of travel. There was a BBQ grill and seating area very close to our cottage which we took advantage of one night and grilled up a terrific steak from the Oxbo (a great recommendation from the staff). The staff also recommended a fabulous little \"hole in the wall\" restaurant called the Red Rock (it was just a few miles from the resort). Their hospitality and the food was outstanding. If you go, you must try the Sweet Potato Fries with the maple syrup. YUM! Both my husband and I really loved the bedding at the resort and slept wonderfully. The sheets were soft and the bed was cozy, yet still cool and not over-heavy with blankets and comforters. We took advantage of the kitchen and all that came with it and cooked \"at home\" or grilled and we found that the kitchen was well stocked. One thing they could improve was the lighting (my hubby might disagree - I like to have lots of lights on at night and he prefers it dim). Overall I thought the place was very clean and comfortable and the location was fantastic. The staff had a lot of great recommedations and were very friendly.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Burnsville, Minnesota", "Title": "“AWESOME”", "Author": "SpeedyK", "ReviewID": "UR119535049", "Content": "James and staff were wonderful and very accommadating. The cottages were clean and cozy. This is a great place to stay and relax on your own deck with a cup of coffee in the morning or a nice glass of wine in the evening. The walkway along the river was beautiful. by far best place in Napa Valley to stay!!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reno, Nevada", "Title": "“FABULOUS”", "Author": "Kyla B", "ReviewID": "UR119522265", "Content": "I LOVE this resort! My girlfriends and I have come back three years in a row and plan on continuing our ladies trip annually! We have amazing customer service with all the staff, our room is always the perfect place to cook and have MORE wine after a fun day of tasting, and the pool/hot tub are always a hit! The furniture has recently been updated, and I love the comfortable, soft bed! Overall, the place is clean, cozy and perfect!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Clearwater, FL", "Title": "“A Motel 6 room in a trailer”", "Author": "FlCracker", "ReviewID": "UR119450002", "Content": "So glad we only stayed one night. This was a big TA letdown. Where to start? The unit was not clean. Floors had dust/debris in various places, and the bathroom had hairs that were found in every corner from previous guests. I am fairly confident the indoor/outdoor carpet in the tiny bedroom was not swept, and I also wonder if the sheets had truly been changed - one stained pillowcase seemed especially suspect. I am guessing the unit had been more or less spot cleaned and most of the focus was on doing gimmicky things w/ towels and paper goods throughout the unit (as noted in previous reviews). Most electrical units seemed to not be functioning, so we ended up making coffee in the TINY bathroom. The overall feel of the 1br trailer was cheap and worn and cramped. Finally, the trailer was not level, so the entire unit tilted to the right. As we used it as a basic crash pad for a night, we slept in our clothes and kept our shoes on. While we didn't have the time/energy to raise a fuss about the conditions as they were discovered, the staff didn't seem interested in helping guests in general. I knew it was going to be a different type of accomodation, but never expected the cleanliness issues.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“For the casual, low maintance traveler”", "Author": "mars2182", "ReviewID": "UR119239579", "Content": "Stayed for 2 nights in October 2011. We had 3 friends staying in a one bedroom room (double/ queen bed) and a pull out couch in the living room area. It was nice to have a door to the bedroom and a kitchen (full fridge, microwave, etc.) and a living room type space with a full couch, chair and coffee table. If you had 3 people that are uncomfortable sharing close quarters or changing clothes in front of others, this is not the place for you...or you need a two bed room. We spent most of our days at wine tastings so we didn't need a fancy place to sleep. I would recommend this place for the casual, low maintance traveler who doesn't require high end things to have a good time!", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent”", "Author": "Chedderella", "ReviewID": "UR118679372", "Content": "It was a blast to stay here at riverpoint. Frank was excellent in help and advice on where to go. Anything I needed he was able to help me with. Can't wait to come back", "Date": "September 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Whittier, California", "Title": "“Week at Napa”", "Author": "temkay", "ReviewID": "UR118678610", "Content": "We stayed at this resort Sept. 18-25th. We spent a nice week touring wineries, San Fran, Calastoga, Sonoma and Armstrong Redwood park. the Modular we were in was Small and not one on the nicest places we have stayed.CONS: the TV and wall outlets in the bedroom did not work. Small bed in bedroom and was not comfortable, Sofa in general room was old and VERY uncomfortable. The easy chair was on wheels and moved when you sat in it - plus your feet did not touch the floor. This was a useless piece of furniture. PROS: Other than our room, the resort was nice, clean with friendly staff. Our cleaner Maria was a Pro- she was nice, friendly and professional. The maintenance people Jerome and Alex were also nice, freindly and professional - since our modular had problems, we saw alot of them. Napa is a very nice place to visit, RiverPointe in will not be a place we would stay again", "Date": "September 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Good location in Napa, Tiny quarters”", "Author": "cygnetgirl", "ReviewID": "UR118534728", "Content": "Not a bad place per se, but very small quarters. Its good for two people that know each other really well or a family with one small child. Basically these are very cute mobile homes (single wide). Well appointed, well decorated, good beds (even the pull out was comfortable) and you have the necessities - bath, shower, stove, fridge, table, etc. Not much else, but great location. A little bit of a walk to downtown but totally do-able if you like walking. Not bad for the price during high-season in Napa (Fall crush).", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Naples, FL", "Title": "“fab”", "Author": "Zoie4", "ReviewID": "UR118294152", "Content": "love this place!!!!!! been here several times...the staff is so nice especially Frank in maintence...he helped us several times with our tv remote, air, and lights...he was prompt and so friendly.... what an asset he is to River Pointe.....the cottages are kept cleaned and love the wood floors.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great experience, good value!”", "Author": "60795HappyCamper16", "ReviewID": "UR118283658", "Content": "We stayed in RiverPointe while we were in Napa for a family wedding. It was great fun to have a number of units occupied by our friends and family. The units were clean and comfortable and very quaint. We shared a deck with another couple in our party so making plans at our common outdoor table while still in our pajamas felt comfortable. Everyone on the RiverPointe staff was friendly and helpful. The beds were very comfortable. The kitchen was well stocked with common conveniences. There are sliding doors in the unit making it easy to have a little privacy while others are in the living area. Go for an early morning walk around the property on the trail or take a relaxing soak in the hot tub after a day of wine tasting. You do need a vehicle to get around but the staff will be happy to give you directions. We visited nearby Calistoga and Yountville during our stay as well as downtown Napa. We also spent a few hours at the Premium Outlets when we needed to fill a few hours (some of our group just relaxed at the pool). RiverPointe is just the cutest place and I'd go back there anytime!", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "fresno, california", "Title": "“Can't beat the value at Riverpoint!”", "Author": "basquefam", "ReviewID": "UR118094369", "Content": "This was our second stay at Riverpoint. The first time was for a week thru a trade with Interval International, and most recently we stayed for the weekend - arrangements made thru Resortime. The location is perfect for all the wine tasting we enjoyed and for our very long list of restaurants we wanted to hit during our stay(s). The units are quaint, and in good shape. There is a nice pool and hot tub area, and a really nice 2 mile round trip walking path. Our favorite places to go when in the area is wine tasting at Vintner's Collective (superb small production wines offered here). We always have to go to Chateau St. Jean in Sonoma. The wines are always top-notch here too, and with a gorgeous view as a bonus! Our favorite restaurants are Mustards Grill, Bistro Jeanty, and Cook. Hard to choose - so many fantastic restaurants!! Napa/Sonoma are such fantastic destinations, but can be a very expensive getaway. Riverpoint is a terrific value - nice accommodations, great location, and gives you more money to spend on wine and food!!", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Bay area, California", "Title": "“Great home base for a wine-tasting adventure!”", "Author": "Worldytravler", "ReviewID": "UR118046477", "Content": "We reserved this resort through a timeshare exchange, and were very pleased with the results. Once you get past the fact that these are \"mobile units\" you quickly get used to the comforts of home in thse mini full suites. The place was one of the cleanest I've seen, and came fully outfitted with a kitchen including dishwasher, and cold, cold A/C. Plus a private deck (if you request) and view of the Napa river. Best of all, it was literally at the beginning of the Silverado Trail, and very close to downtown Napa. Finally, it had fluffy towels (moreso than some 5-star hotels I've stayed at) and a comfy bed. Great place to stay while in Napa!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Romantic Getaway”", "Author": "TravelPrincess143", "ReviewID": "UR117764404", "Content": "Definitely 5 stars!!! Riverpointe Resort is definitely at the top of our list. My husband surprised me with a trip to Napa for my birthday. The staff is wonderful, the grounds are beautiful, the room was so clean and tidy (well decorated too), I felt so at home. It was so peaceful and quiet at night. I had the best birthday ever, and went home well rested.The maintenance team is awesome! While working hard Jerome and Efrain stopped to say hello, and ask if everything was going well with our stay. I can't wait until our next trip to the Riverpointe Resort.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Danvers, Massachusetts", "Title": "“Customer Service At Its Best”", "Author": "BevYacovitch", "ReviewID": "UR117728269", "Content": "Owning a timeshare for 30 years, I have made many trades in Mexico, all over the U.S. and Spain but never had a resort offer so much to its patrons and owners. Majority of all timeshares offer a wine and cheese or breakfast to introduce the week ahead for its visitors but many have strings attached like a Timeshare presentation. Not at Riverpointe, only a friendly introduction by General Manager Jim and then orientation activities director, Marilyn. Marilyn is well known across Napa Valley by restaurants, tour companies and wineries, they all love her! She will bend backwards for you to make reservations, give honest recommendations and get you discount rates. The one bedroom at the Riverpointe are 400 square feet mobile home on wheels...why you ask? Riverpointe is situated on the Napa River which floods and the mobile cottages can be rolled away. I have read so many negative comments over the rooms do them I say, \"Get over yourself!\" This is not a four star resorts because of the cottage but about the superior customer services, activity and beautiful landscaped property. If you want a five star resort that only offers beautiful rooms and high price restaurants don't book here but you will be doing yourself a favor. If you are visiting Napa Valley for the wineries and not your room, DO YOURSELF A FAVOR...trade or book nowhere else but Riverpointe.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nevada City, Montana", "Title": "“we'll be back”", "Author": "michel t", "ReviewID": "UR117475715", "Content": "i really liked being at river pointe for vacationit made me feel like i was in my own house i recomend this resourt to other people because the maintance guy were really on track specially efrain lopez he was really helpfull and help with the water hiter...its a nice place to be with all the family and its also relaxing...being back is on my plans again!!", "Date": "August 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“By the Napa River -- so beautiful and great staff.”", "Author": "AdSpotsWi-Fi", "ReviewID": "UR117411592", "Content": "Frank rocks--he's the maintenance guy and Marilyn is the queen of wine tasting. The rooms are so nice and modern for a little cottage. Better than staying in a hotel room.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Lovely place - would go back!”", "Author": "Smilea", "ReviewID": "UR117179799", "Content": "We stayed here as part of our honeymoon in July 2011, my Mum and Dad own a timeshare and kindly let us use it. We stayed here for 5 nights. My first impression of River Pointe was that it looks lovely - the 'rooms' are actually little cabins that look a bit like static caravans, but they are all different colours and look very cute! The cabin was spacious with a lounge area that included TV and coffee table, there is a separate area for a dining table, and a kitchenette with all the things you need to cook for yourself if you so wish. Our bedroom was small but had a nice big comfy bed with another TV and a wardrobe for your clothes. When we arrived, the Maid had made 2 little elephants with the towels which were sat on our bed, it was a nice touch which would delight children! The bathroom was very clean, well stocked with towels and little toiletries and the shower was nice and hot! The pool was great - we spent a nice afternoon there, it was plaesant, clean and spacious. There is alos a gym, and a few Barbeque facilities around the property if you fancy cooking! The only thing that could maybe be classed as a downside was that when we opened our Welcome Pack, there was a section in it that explained that River Pointe was obligated to advise us that there is a 'chemical' present in the Napa Valley region that is 'known by the government to cause birth defects and cancer' !! As you can imagine, this was a little off-putting, but of course it isn't the hotel's fault! Another downside is that you have to pay an $8 per day charge for the amenities on site such as washing etc, this is mandatory even if you don't use the amenities. On the plus side, Wi-Fi is free which is good, as many other hotels do charge for this. Overall, I would highly recommend this place to anyone wanting a rejuvenating, relaxing stay. The sleepy downtown area of Napa is only a short drive away and has a host of nice little family-run restaurants and cute shops. If you want hustle and bustle, San Francisco is only about an hour's drive away!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "", "Title": "“Trailers that work!”", "Author": "czbozo", "ReviewID": "UR117084677", "Content": "If you want fancy, this is not it. The trailers are clean and refurbished . We didn't get an adjoining patio deck as requested but we got a deck. Our view was the meadow. The property is on the Napa River Trail which is a one-mile trail connecting Lincoln and Trancas. We had a kitchnette complete with a 2-burner stove, microvwave, dishes, utensils and dishwasher. The complex has a pool and jacuzzi. My stay would have been perfect had there been hot water. I tried running the hot water in the shower but it never even reached warm. Our friends said they had hot water so maybe just our tank. Another thing, don't even ask for a late check out (11am) - it will cost you. For a one night stay, it was fine.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bremerton, WA", "Title": "“I recommend this place to all my friends!”", "Author": "dizzylizmom", "ReviewID": "UR116731690", "Content": "We had read good and bad reviews of RiverPointe and after staying, can't find anything to complain about or be disappointed in. The units were adorable and quite comfy, though I do agree with lots of reviews mentioning that it would have been quite a tight fit for more than two people. We used the pool, hot-tub, grill areas and did a couple of the trips they arrange. Had a great time!! The staff was awesome from the word go. We'd definitely stay there again.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Lorenzo, California", "Title": "“Angels to the Rescue”", "Author": "hummingbird1213", "ReviewID": "UR116279145", "Content": "I am a co-owner of a week per year at RiverPointe. This is only the second time we have used our week for other then exchange. Of course it was a wonderful week for me and one of my girlfriends. The weather was great. I was especially excited to find that the lovely concierge, Marilyn, has been able to charm some of the wonderful wineries in to doing three complimentary wine tasting over the course of the week. Nice touch Marilyn. All of the staff was really wonderful when we needed help, with directions or just things right before our eyes that we could not see. There were two wonderful gentlemen on the staff who, smiled and greeted us upon our arrival that we had no idea initially how helpful they would be. Our first middle aged women in distress moment was when we could not figure out how to turn on the cable tv. We called the front desk and with in minutes Frank Guevara came to our rescue. He found simply, what we could not after a half an hour of trying, that the cleaning person had pushed the cable box behind the television. Oops. But the big rescue mission that both Frank Guevara and his Manager, Jerome Thomas, participated in was when we had driven 60 miles back from Lake County, to find our oil cap had been mistakenly left off. The car had started having a little trouble a couple of miles before we returned to RiverPointe. As we drove through the grounds, Jerome and Frank notice not only the strange noise coming from our car, but that it seemed to be leaking oil. If not for Frank and Jerome pointing this out to us and Frank going to the hardware store to purchase a new oir cap and oil for us, who knows what might have happened to us. He put the oil in, the cap on and advised us to let the car sit for awhile before departing. Thank you so much to the Riverpointe staff for making our trip so wonderful. And a special thanks to Frank and Jerome for coming to our rescue. Sincerely, Natalie Wesley", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Victorville, California", "Title": "“Cozy peace and quiet...but VERY hard bed~!”", "Author": "Xingdelancey1234", "ReviewID": "UR115979663", "Content": "We took off to Napa with a tempered expectation of Riverpointe; however, we were VERY surprised and pleased with the quality of the resort and with the cottage we stayed in. This little gem made accessing the wine region completely simple. Clean, affordable and with full amenities and a great staff, we enjoyed our stay in quiet and peaceful calm. Friendly service and a beautiful setting for these cottages made it feel like a world away from the hustle of the city that's just beyond its borders. No charge for laundry service--it was not inside our cottage--included free soap and dryer sheets. Maid service was exceptionally detailed --she arranged my strewn luggage and tidied the entire place--and staff was more than helpful and friendly. We loved the high ceilings inside the cottage because they gave a feeling of much more room than we had anticipated. The additional picture windows in the room (above standard wall level) gave a feeling of airiness to the inside of the room. This little place was absolutely charming~! We used our small propane bbq on the deck and relaxed outside under the shade of the trees while watching hummingbirds float around the yard. The pool area is peaceful, very clean and offered umbrella covered tables. Meticulous landscaping around every cottage sets off the white lattice and highlights the design and color hues of the different cottages. Downsides: the double doors to the room are a little difficult to lock and the resort asks for a release of responsibility for personal items upon checking in. (Our maid failed to lock ours appropriately after servicing the room; however, nothing was missing and we were relieved.) We reported it for repairs, but found out that it's apparently an issue for all units. We locked our electronics in our vehicle when we left for day trips. (It probably would have been a non-issue for our us had we taken our laptop locking cables.) Another downside: the bed was way too firm for me; I compensated by sleeping on top of the down comforter. One more: internet service was terrible--no speed and couldn't access websites reliably; however, not a main issue for us since we didn't visit Napa to be on the net. An upside was soft water that tasted great~! We'll stay again because we enjoyed making it our cozy private space away from the hub of San Francisco and because all the wineries are a few moments away. Great bargain and very sufficient for our enjoyment. This little place is a great value and jumping point for so many wonderful places to see in the region~! I recommend at least a full one bedroom cottage for two, as I understood from another couple staying during our week that they didn't have room to store luggage in their room due to the fact that it was a 'half cottage'.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Clemente, CA", "Title": "“Worth the trip...”", "Author": "roadcall", "ReviewID": "UR115906389", "Content": "My wife and I visited the California wine country and couldn't have found a more convenient place to nest. The accommodations are separate bungalows (converted large mobile homes) that provide privacy, all needed comforts and the feeling that you're in a home and not in a room. The hotel area is beautiful, and very accessible to all the wineries and attractions that Napa has to offer. There are plenty of fine restaurants, including one (Compadres) across the street and right on the river. The hotel staff was very helpful in pointing out places to go and helping with directions. We loved it.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Denver,CO", "Title": "“Great spot and perfect for us”", "Author": "nanarn", "ReviewID": "UR115541382", "Content": "Stayed here prior to a trip to SF, 3 adult ladies,Friday thro Monday. We booked this online with a great price. The \"cabins\" were super cute, but for more than 3 adults it would have been tight. Nice to have a kitchen, and refrig, for saving a little money on some meals. Convienent to main highways, Oxbow market, Wally world and downtown. Were never hassled about the time share aspect of this place. Pool clean and well maintained, tho the hot tub we used was almost too warm. Bed comfy, but the pull out for more than one person would have been uncomfortable. Bathroom almost bigger than the bedroom. Enjoyed the walking path along the river. Seemed to be quite full when we were there, but not alot of noise factor, even with the shared patio. Laundry that was free was a bonus for packing purposes. Saw alot of families using the Barbq grills at nite. There seemed to be alot of them spread thro-out the property. We were surprized that there were no housekeeping services on the weekend. Not an issue really for us, but just unusual. Would we stay here again, Absolutely!!!", "Date": "July 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lake Ozark, Missouri", "Title": "“Not bad at all!”", "Author": "pblancha", "ReviewID": "UR115431930", "Content": "We approached this with a little trepidation. Cabins were imacculate, neighbors were great - newlyweds. Very convenient location to both Napa Sonoma and San Francisco Service was great. Marilyn is a pistol We traded a 2 berm in Kauai for this, and you know what, we would do it again", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Rooms are comfortable and well kept”", "Author": "tucker86_11", "ReviewID": "UR114950812", "Content": "I am currently from Napa but joined the Army. I came to visit and got a great rate at the RiverPointe Resort. The service was out standing and the rooms were very well kept. The grounds were nice and updated and I couldn't of been happier. Can not wait to stay again", "Date": "July 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great environment, green and beatiful.”", "Author": "Hhlive2ski", "ReviewID": "UR114890147", "Content": "This was a great deal. The little cabins that you have are super cute and you have your own patio with chairs and a table. Every day they have events planned that you can join in on or not. The wine tasting in the evenings are like wine classes-you will learn a lot. Bring a bike a ride into town or up the river trail which runs next to the resort.", "Date": "June 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“AWESOME!”", "Author": "MsHoney0718", "ReviewID": "UR114653659", "Content": "My husband and I have stayed at RiverPoint many times. We like the layout, the staff,the location. James, Marilyn, Jerome, & Dana are all so sweet and helpful. This is my first choice of places to stay when planning a weekend getaway. We love it!", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Cute and Convenient....”", "Author": "goneagain2009", "ReviewID": "UR113178496", "Content": "I spent 7 days at Riverpointe. I traded my timeshare through Interval International to stay here. First I would like to say that the location is excellent and extraordinarily easy access to the Silverado Trail and the main highway through all of the towns (I can't recall the highway #). The unit was very clean and well stocked with towels, sheets etc. I spent part of the time solo and then had a couple of days with family and a couple of days with a friend. All seemed to like it. Housekeeping was friendly and for the most part, on top of things. The front desk did keep calling to try and meet with me to \"plan my week\". My week was planned before I ever got there and I told them that but it did take a few days for them to stop calling. Unfortunately, I did need to do some work while I was there and their wi-fi was no existent. Hopefully this is fixed by now, Comcast was supposed to be installing the week that I was there. I spent a great deal of time at Starbucks so that was really annoying because I did call to verify that they had wi-fi and was assured that they did. The decks on the units are not private which I really didn't like. So if I wanted to sit on the deck and my neighbors wanted to be there too, you would have to share. Overall, a cute place and I would stay there again.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Indescribable feeling”", "Author": "TianaBlackDean", "ReviewID": "UR109252987", "Content": "me and my husband actually visited River Pointe twice already, and we are so ready to come back!!! those were my first times ever feeling so relaxed and so fresh. the environment was lovely. There is also a delicious restaurant across the street name Compadres, and the food....GREAT! The customer service was awesome!. Jerome and Jennifer made me and my husband feel so at home and i would rate they service skills...2 thumbs up!!! They made sure that our room was comfortable and they made us come back. overall we had an amazing stay at river pointe and i would definitely recommend this resort not just to couples but to families as well.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Cute and cosy in good location”", "Author": "beansfc", "ReviewID": "UR106596027", "Content": "I travelled with my partner and another couple to Napa Valley and thoroughly enjoyed our brief stay (1 night) at the River Point Resort. For the price we knew it was not going to be a huge room with every luxury but it was one of the only accommodations who would allow a 1 night stay which we required. The cabin was clean and tidy and perfect for our requirements, which was basically just a place to rest our heads after a day of wine tasting. It was pretty small but again this was fine for us. I think if a family were to stay it might be a little small to be in one of the cottages/cabins as the fold out sofa does take up alot of space. All in all we were very pleased with the accommodation and the location was great.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fair Oaks", "Title": "“Everything I could have asked for”", "Author": "fairoaksgidget", "ReviewID": "UR106591491", "Content": "Our stay was just great. The staff was very helpful and the accomendations were very clean. The little individual rooms made you feel like your were in your own home with everything you would need surrounded with a pretty garden area and access to a great river walk way to go on and explore. Everything was clean!", "Date": "May 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Marcos", "Title": "“Quaint, quiet, and wonderful!”", "Author": "expelliarmus22", "ReviewID": "UR106161612", "Content": "My boyfriend and I were visiting Napa for the first time. We really wanted to stay somewhere close enough to the restaurants and wineries, while still escaping city noises. We found this place to be quite the fit! The location was close to everything we were planning to visit. Even though it was so close to the city, it seemed like were were secluded due to the lush trees and greenary surrounding the place. I loved having the privacy of our own cottage with a cute porch we can relax on while enjoying the beautiful peacefulness of being outside. The service was great. We were especially impressed by Jennifer, we believe she is the Assistant General Manager. She was so friendly and welcoming at the Monday morning breakfast. We were only disappointed that we could not stay longer but we definitely plan to stay here next time we are in Napa. If you are looking for a cute, welcoming, and quiet place I would definitely recommend Riverpointe.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canton, Michigan", "Title": "“Great location, trailers a bit small/cheesy”", "Author": "casaredman", "ReviewID": "UR99573587", "Content": "Can't beat the location. We traded our timeshare (Interval) and this was the only location available. The staff, activities were great. Marilyn's, our hostess, is a hoot - you'll love her. She gave us great advice. I was happy that she had strong opinions on where to go, how to get there, where not to go, etc.... Beware they charge you a $8/day surcharge. I've never been to a resort that did this. The trailers were small but clean. Everything worked fine. It was just my wife and I in the large one-bedroom unit and we found it small. I can't imagine more people (i.e. pull-out sofa sleeper). Washer/dryer's are not in the units, but located in back of the property (free of charge). On the down side, our trailer was located on a street with no street lamps. One night it was pitch black and my wife fell navigating to the porch. That was our first night - - thereafter, we left our porch light on. We notified the manager and he indicated people complained when that had area lighting - - seems odd. Wi-Fi was a bit sporatic, but free.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great place to rest!”", "Author": "marciopin", "ReviewID": "UR95720649", "Content": "Best place to rest and enjoy. We love the place and the calm enviroment. Will return.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vail CO", "Title": "“Loved our Little \"Single-Wide.\"”", "Author": "Chateauneuf", "ReviewID": "UR94435387", "Content": "We knew we were going to be staying in a \"mobile home,\" but were delighted to find out how charming and comfortable the units were and how lovely the riverside location was . Even more impressive was the delightful concierge, Marilyn, and the many activities she had planned and the great food she prepared for complimentary breakfasts and wine-food pairings. We would return again just to experience her hospitality, her right-on advice about wineries and dining options, and her great personality. The location was convenient to all venues in the valley, and the riverfront walking trail was an unexpected delight that helped us counter the effect of great wine and food. Certainly, this is no \"Auberge de Soleil,\" but in terms of pleasure, convenience and comfort, it certainly can give it a run for the money!", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San marcos", "Title": "“Opening the bottle starts here”", "Author": "Golf777", "ReviewID": "UR93787578", "Content": "Visited Napa for a couple of nights with my wife for some wine tasting. Riverpoint resort was highly recommended. The staff was fanastic and very helpful with finding the perfect restaurant and winery. The rooms are so cozy, it makes a long day of wine tasting that much better when you have a beautiful resort to stay at.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Fantastic Honeymoon in Napa!”", "Author": "burningrivergirl", "ReviewID": "UR85992336", "Content": "My husband and I stayed at Riverpoint in September for a week for our honeymoon. We knew ahead of time that the apartments were moveable units and it ended up being a non-issue. Our unit was clean and well equipped. We enjoyed using the patio, cooking in the unit, using the grills on the grounds and walking along the river path. All of the staff was very nice and housekeeping was fine. The location of the condo was also great. We were a short drive to downtown Napa, restaurants, Trader Joes, Target, Rinny Regos, Whole Foods and Walmart. The condo was also right off the silverado trail and the main highway which allowed easy drives to all of the wineries. Overall, we had an awesome honeymoon and relaxing stay at Riverpointe!", "Date": "November 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Delightful stay alongside the Napa River”", "Author": "signora2", "ReviewID": "UR84688134", "Content": "We recently spent a week at Riverpointe using a timeshare exchange. We were aware that the facilities were movable trailers but we were so pleasantly surprised to find them quite comfortable and the entire atmosphere of the resort very delightful. We had a one bedroom trailer (#50) that had it own small deck. Many units share the deck area. We were close to the clubhouse so we had good wifi for our netbook, but the server was slow at times of peak use. The unit had a queen size bed in the bedroom and the living area was spacious. We enjoyed the pool, the hot tub and walking along the 1.2 mile trail alongside the river. The resort offered a number of activities each day...some free and some at a fee. We enjoyed three free wine tastings at the resort...two even had munchies to go along with the wine. We attended the free full breakfast orientation on the Monday morning. There were various tour options that many participated in that were organized by the concierge, Marilyn, at a reasonable fee. There is a minimal fitness center with no weights so rather than use it, we walked the river trail. We definitely would recommend the resort to others.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Foster City", "Title": "“Definitely different but surprisingly good”", "Author": "a1000monkeys", "ReviewID": "UR78666106", "Content": "My wife and I booked a great rate for labor day weekend on hotels.com. I was a bit weary due to the fact that the resort is technically a trailer park right down the street from WalMart but once we arrived we were pleasantly surprised. We had a one bedroom unit. It's very cozy with a small kitchen/living room, bath and separate bedroom. It was very clean and well stocked. The bed was probably one of the most comfortable I have stayed in at any resort. However, the room was so small that the king size bed took up most of the space. I believe these units can accomodate four since there is a pull out sofa in the living room but it would really be too small for four adults. If it were raining I probably would have feld claustrophobic inside. Fortunately the weather was perfect so I sat outside on the patio which we shared with the neighboring unit. Fortunately we had great neighbors and it was fun to swap winery recommendations. The grounds were very well maintained and the pools and spas perfect. It's located right on the bike trail and I wished we had brought our bikes. The resort is very family friendly and almost had the feel of an upscale camp ground. In any event, it was way better than a motel and was comparably priced. We would definitely return to Riverpointe during the summer again.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, mn", "Title": "“Great place centrally located.”", "Author": "TheNewPlaid", "ReviewID": "UR77112396", "Content": "The pool and hot tub were beautiful, the rooms are trailers that are very nicely appointed and the staff was helpful and not overly pushy with the timeshare presentations. The hide-a-bed was the most comfortable we've slept on and the bed was as comfortable as they get. Across the street is a restaurant with an excellent $20 ribeye. We stayed in a one bedroom with another couple and it was cozy but wasn't too small for the four of us. That said, a two bedroom would have been a little more comfortable.", "Date": "August 27, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "5", "Service": "2"}, "AuthorLocation": "Calgary", "Title": "“Don't be surprised....”", "Author": "MaggieMH", "ReviewID": "UR74303969", "Content": "Just a head's up for potential guests; Upon arrival you will be informed of a $5 per night service charge in over and above t your agreed upon rate. If you are there for the weekend, please be advised that you will not receive maid service either!! If you you can overlook this unethical behavior, it's an excellent place to stay...", "Date": "August 8, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Service": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Napa NIGHTMARE!!!!”", "Author": "RichBit", "ReviewID": "UR66565164", "Content": "Stayed here for a weekend and can't wait to leave!! Hot tub outta order so tried to take a hot bath, well even then bath won't hold water. Had the maintance enter our room even though I posted the DO NOT Disturb sign on the door!! The pool at the club house, well let's just say it would have been more sanitary to just go for a dip in the river!! Although the location in nice and the setting was pretty, loved bbqing, I would never stay here again nor recomend this place to any soul.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carlsbad, Ca", "Title": "“Great Stay!!”", "Author": "rfretz", "ReviewID": "UR66071657", "Content": "We stayed at Riverpointe for Memorial Weekend as a kind of joint birthday for my boyfriend and I and it was perfect... the resort is close to downtown Napa, so there was lots to do and it wasn't much of a drive to St. Helena and Yountsville. The resort was quiet and welcoming, the units are very clean and the grounds are very well maintained. (and the beds are super comfortable, hated to get up in the mornings!!!) A great choice!", "Date": "June 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“Very Cute Trailers Suite”", "Author": "ningen", "ReviewID": "UR54376181", "Content": "We arrived really late at night and make it in time before the reception is closed. We quickly check out our room / suite and it was very welcoming with the nice kitchen and living room and a bedroom. Everything is spotlessly clean and it was so new it has that newly constructed scent. One thing we have to know here is that its not a 5 star Mandarin Hotel or W or Ritz Carlton. But it definately has good service and the employees make sure that the guests of the hotel have a comfortable stay. We were lucky to have the BBQ stove behind our unit and theres 2 pool we can use. We went around for wine tasting the whole day, walk along the river at the back of the hotel and have a great BBQ dinner. It was really romantic because of the way the rooms are layout, they are somewhat private. Internet is free in the clubhouse and everything else is within 5 minutes driving distance. We will definately check back to the hotel if we visit napa the next time.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Boston", "Title": "“Good place - skip the California Vacation Club”", "Author": "CWoodford", "ReviewID": "UR47025837", "Content": "Nice place and layout suits well to share with another couple. Very clean - showing its age a little - but comfortable bed and layout. Easy to have breakfast on patio. Nice staff. They do a nice job of welcoming groups and some wine introduction. This is a timeshare but they don't pressure for that. The California Vacation Club is another story. While promising \"no pressure\" the first level sales guy was very pleasant. However, once you say NO, the pressure and very rude manager steps in. Skip it as the the gifts not really worth it Castello D'Amorosino is a misplaced attempt to recreate an Italian Castle. The only thing they forgot was good wines and the Italian \"way\". Otherwise, River Pointe experience was great. Also close enough to make a day trip into SF (free wireless but it was quite slow)", "Date": "October 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“GREAT place to stay...despite it being in a trailer.”", "Author": "basketlady88", "ReviewID": "UR46851467", "Content": "We're returning in a week for our 3rd trip to RiverPointe. We've traded a week of timeshare to do this and while I wish there were other places to stay....we've been pleased so far. We visit with friends and it's nice that the 2nd bedroom is in another trailer (across the deck). It's a VERY convient location and we enjoy the pool and hottub after a long day in the vineyards. My sole wish....free internet in the trailers.", "Date": "October 14, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Crozet, Virginia", "Title": "“Best location, situation and vacation in Napa”", "Author": "CapnCohen", "ReviewID": "UR41567366", "Content": "First, a little background: we are a family of four (kids are 13 and 10) from a quite suburban/rural area. We have all vacationed in everything from a fancy downtown Chicago suite to a rainy Virginia campsite. We like the finer things life has to offer, and we get picky when stuff doesn't work right. Our stay at the Riverpointe could not have worked out much better than we had hoped. First, it's true that the units are, essentially, mobile homes. Ours had a small living room (double size sleeper sofa), a full kitchen, bathroom and bedroom with a king bed. Central air and ceiling fans. Everything worked well (the Wi-fi had to be rebooted twice, though the staff did that quickly). Attached to the unit was a 10 x 8 patio with table, umbrella and chairs. For a family with up to two young children, this was a clean, well-maintained and comfortable place to sleep and decompress after touring the wine country and northern bay area. Second, the staff went above and beyond the call of duty. They researched and printed out San Francisco ferry schedules, held free wine tastings, organized a free breakfast with raffle (we won a river cruise at 50% off) and no timeshare talk, coordinated wine tours (though we went off on our own), removed a drainpipe to look for a lost baby tooth, and helped fix a broken roll-away case. Third, Riverpointe's location is optimal. It's just about at the southern junction of Route 29 and Silverado trail, the two main arteries through Napa Valley. Need supplies for the kitchen or travel? Wal-Mart is 1/10 mile away. Want fresh and environmentally sound fish, meat, produce, cheese and gourmet items? Ox Bow Market is five minutes away. Restaurants? Fast food, sit-down chains, upscale and delicious holes-in-the-wall are throughout Napa (hint: ask about Rancho Grande, a three-minute drive). It took us about 45 minutes to get to Santa Rosa (Charles Schultz Museum), 50 minutes to drive to Sausalito, 70 to Fisherman's Wharf, and approximately 90 to reach Bodega Bay. We didn't taste Sonoma on this trip, but it's closer than Santa Rosa. Fourth, the common-area amenities include two hot tubs, heated pool, laundry facilities (no coins necessary) gas grills, computer with free Web access, Wii games and a pool table. In conclusion, this is not your place if you: have a large family, and your family don't travel well together, like to hang out for long periods in your room, require pampering and luxurious amenities. If we visit the wine country again, we would make Riverpointe our first choice for accommodations.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Walpole", "Title": "“Very well kept trailer park with great staff in a great location.”", "Author": "obeez", "ReviewID": "UR40204047", "Content": "If I had just showed up and not researched this resort I probably would've been surprised and somewhat disappointed. I had done my homework and knew what to expect. They are mobile units and it is somewhat like a very well kept trailer park. Went with wife and another couple and found the lodging to be adequate and service of the resort personell to be exceptional. Nice pool and two hot tubs on site. Had two adjoining units, one full size and one was 1/2 of another trailer joined with a shared deck in between the two units. Used the deck to sit around and relax at night and get together in the mornings to plan our day. Ideal location in regards to proximity to Napa and Sonoma as well as San Fran, Oakland and other tourist destinations. One caveat to resort, they advertise the units to accomodate 6 if you get the two units. I think 1 couple per unit is the max. Young kids on the sleeper sofa, maybe, but not two full grown adults. Recommend Red Rock Cafe for ribs and barbeque and ButterCream bakery for breakfast. Both right down the street from resort. Be sure to check in by 11PM or may be no one on duty at resort. Many of Sonoma's wineries offer free tastings and the ones that do charge are still less expensive than Napa. Both offer some great wine.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Jacksonville", "Title": "“Great Value for the Active Vistor to Napa”", "Author": "Ephman85", "ReviewID": "UR38382875", "Content": "I wouldn't want to spent 24/7 in the unit, but we didn't travel across the country to Napa to hang out in a hotel. Yes, they're mobile units, \"trailers\" if you must, but if you can get over that (and obviously, some can't), you can base a great vacation out of RiverPointe. The grounds are immaculate and the unit had everything we needed (kitchen, full-size fridge, etc.), certainly more than the average hotel room. Location is very handy to the Silverado Trail, but is crosstown from Hwy 29. Overall, pretty easy to navigate. Top scores on Value because we traded in our timeshare week through Interval International. Essentially, one week here cost us the same as two nights would have elsewhere in the Valley.", "Date": "August 21, 2009"}, {"Ratings": {"Overall": "1.0", "Rooms": "1", "Value": "1"}, "AuthorLocation": "Southern California", "Title": "“It is a trailer park”", "Author": "UserID", "ReviewID": "UR37716866", "Content": "This is a trailer park. We traveled here believing we would be staying in a quaint timeshare resort in Napa, and we ended up in a trailer park. This \"resort,\" if one can refer to it as such, is not at all as it is marketed. We truly stayed in a trailer with a hitch in the front, metal steps leading up to the door, and a camper-like shower.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Buffalo NY", "Title": "“Not your typical timeshare, but really nice!”", "Author": "car_and_scott", "ReviewID": "UR37030777", "Content": "We stayed at River Pointe from July 31-August 7. I had read trip advisor before booking and was aware of the fact that it is a trailer park, the units make noise when you walk through them, and the amenities were not as nice when comparing them to other timeshares. However, we were really pleased with the resort and had a great stay! We were impressed with how nice everyone was that worked there. We even did the sales pitch, which was interesting and I guess worth the free things they offer. We really used the resort as a base camp for activities throughout the region, traveling into San Francisco (about an hour) and of course all through wine country. Some days we left at 8am and didn't return until well after midnight! The cottage was absolutely spotless and had everything we wanted. For two people, the one bedroom is slightly cramped when getting ready in the bathroom/bedroom. I can't imagine if you had 4 people in there - way too small. A feature we loved was that they will ship your wine for you. All we had to do was fill out some paperwork and left our wine with them, and they took care of the rest using a local shipping company. So easy! We also had wireless access in the cottage free of charge. Not sure if this is throughout the entire resort, but we used the internet all week on our own laptop! I got the impression there was a charge for wireless...maybe that has changed. Overall, we had a great stay. I think if people are aware of exactly what type of place it is, you are much better prepared once you arrive. I think if I was unaware of some of the quirks, I would have not been as pleased.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Dublin, OH", "Title": "“Not my cup of tea!”", "Author": "mmb1776", "ReviewID": "UR36577478", "Content": "I traded into this \"resort\" from a Marriott timeshare banked through Interval International. I was told it was a \"5 star\" resort. I accepted it before I did any research on the resort. I did check Trip Advisor before I left so I was prepared for the fact it is basically a trailer park but I didn't tell my husband until we were just turning in. He was floored! The resort is fine if all you do there is sleep. Comfort-wise it was just okay. I couldn't shake the feeling of being in a Winnebago all week! We camped with a trailer years ago and it felt essentially the same except there was a bathtub and not just a shower in this one! To be fair, the unit was clean, there is a lot of storage space but I'm a bit of a princess, I guess. I like more upscale accommodations! I didn't see any playground equipment for children so other than the pool, there's not much for young children or teens. I had to wait in line to do laundry. For 106 trailers, er, excuse me, \"cottages\", there are only 3 washers and 3 dryers and it took forever to dry a load of clothes! I didn't think the neighborhood was exceptionally nice. When you think of a resort in Napa, you think of something other than what you'll find here! Upon checking in we were invited to an \"informational\" meeting on the Monday morning of our visit...translation: time share meeting, although we were told that this resort was \"sold out!\" Good thing, but we didn't want to waste our time hearing about anything this company had to offer. I know this is going to come off \"snooty\" and I don't mean it to...it's just that it's not my cup of tea! I'm used to Marriott timeshares and they are nothing like this little trailer park on a not particularly pretty part of the Napa River!", "Date": "August 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Not what I expected but served it's purpose.”", "Author": "scuttlebuttin", "ReviewID": "UR35870655", "Content": "After spending time in time shares in Hawaii and Central California I expected much more than is provided at River Pointe. Although the units are ok, they are on par with a Super 8. Our unit had ants all over the bathroom and staff was notified. When we returned from the wineries that day there were more than before, used a \"natural\" bug spray - did nothing to kill or drive them away. We were told we could move to a different unit - if we did so in the next 15 minutes!! We did it. And we ended up in a trailer fitted for handicapped persons. The unit had about half the storage of our first unit and the shower was not suitable to stand in. I was livid at this point and my wife intervened. We were then given our third unit in two days/2 hours! The rest of our stay was standard. The towels are changed twice a week (every day at Super 8) and our last unit was very clean. Harkening back to Hawaii and Central Cali, there is no privacy on any deck. For a time share swap this was a sub-standard move. The pool was ok but the hot tubs need cleaned daily, like the grounds. There is a laptop computer for guest use where the other places I have stayed have 2 or more computers for guests. Activities were cancelled without notification. River Pointe is very well situated for winery visits and it is quiet at night. A lot would need to be done before I would stay there again and I will not recommend this place to others.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "chatham, ma", "Title": "“Pleasantly Surprised”", "Author": "winnifred020", "ReviewID": "UR32459956", "Content": "The location is perfect for touring the wine country. The grounds were very well kept and the units were clean. True, it's a mobile unit, but we found ours to be spotless with a good-sized and functional kitchen, one bedroom and a decent sized living room area. Lots of storage. There is a walking/running trail on the grounds that was perfect (and keeps you off the streets). Gas grills are available scattered around the grounds and are available on a first-come, first-serve basis. All the grills were Weber, were clean and were functional. All-in-all a great place, especially in terms of location, value and cleanliness.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New England", "Title": "“Napa Retreat with eldest daughter”", "Author": "skijumper", "ReviewID": "UR31723214", "Content": "We booked the stay through a friend who was familiar with the property. We checked it out on line. We were expecting cottages but instead found mobile units on a fixed pad. It was well landscaped and very tidy. The units were very clean and comfortable, a bit small but adequate and the staff was great. There was a trail just outside our unit we enjoyed each morning that followed the Napa River. It was great for walking and exercising. Pool was clean and enjoyable and the laundry facility was free. The location was very convenient to local restaurants (wonderful food) and a good home base for the wine country tours. The neighbors had loud music Saturday afternoon but it stopped at sundown. Overall our experience was great.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nipomo", "Title": "“Not bad for what they are”", "Author": "GHB2", "ReviewID": "UR29946956", "Content": "We just stayed a week and enjoyed the trip. The units are on wheels like everyone has mentioned. Inside they are very clean and nice with everything you need except a regular oven, but the units are also very small. What is considered to hold four people I wouldnâ€™t put more than two people in. We had a 2 bedroom unit which like others have mentioned are connected by the patio which was nice. But you need a two bedroom for 4 people. The pool was good, not great. The Jacuzzi by the pool could have been cleaner. But there was another by our unit which was much bigger and cleaner. The gym if you want to call it that was a very small room with a few pieces of equipment. Put 3 people in the room and itâ€™s crowded. So we walked everyday instead. The grounds are kept up very well. There is a decent Mexican food restaurant across the street and Wal Mart about a block away within walking distance. The river walk which goes for about 2.4 mile round trip was great. You are less than a mile away from the first winery for tasting and that is the start of the Silverado trail. Overall this was a very good stay and we would do it again. The location was perfect. We traded a lock-off unit (studio) for a 2 bedroom unit so I was pleased with the trade. If we had to trade a 2 for a 2 we wouldnâ€™t have been so pleased. It wouldnâ€™t have been a fair trade to me. So thatâ€™s something to keep in mind. But we would do it again.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wake Forest, North Carolina", "Title": "“Great time to go- quite and no lines so you get the most for your money”", "Author": "ncbldr", "ReviewID": "UR24050427", "Content": "We had a great time in Napa. This resort is very small but in a great location. We had the opportunity to visit about six winery s per day because there were no lines like in the summer months. We picked our 12 favorite wines we cannot get at home and brought them back with us. The resort itself was great in that they came 3 times to change towels and clean etc. The staff was fantastic and always willing to help us.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Millbury, MA", "Title": "“Great experience!”", "Author": "sweetta557", "ReviewID": "UR23918854", "Content": "My husband and I were staying in a timeshare that my aunt was nice to give us as a wedding present in what on a map seemed just north of Sonoma Valley when it was actually a 2 hour ride. We decided to cut our looses and head down to Napa to see what we could find for accomidations last minute durring crush season. The chamber of commerce worker ( who by the way went above and beyond to help us save our honeymoon) suggested we check them out. We did and for about 100 a night it was perfect. It was right in down town Napa. The hotel included coupons for some local establishments and had trips through the hotel. We did a wine tour for about 80 dollars a head but it was great! and the price is average for Napa tours. We also did a free wine tasting at the hotel. The winemaker that gave the tasting invited anyone to his vinyard the next day for a free back stage tour! It was great and you can't beat free!!! Great place I hope to stay there again next time I am in Napa!", "Date": "January 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Beach Area", "Title": "“A great camping experience”", "Author": "SCalGal", "ReviewID": "UR22275925", "Content": "I read every review on this property before booking through our timeshare. It was a \"free\" week so we decided to book the week of Thanksgiving. What has not been mentioned is that it is not a mobile home, it truly is a trailer, a fifth wheel (with wheels). The first time I sat on the couch inside the small living area, my daughter sat on the bed in the bedroom. I said, \"earthquake\". Being a Southern Californian, we are used to the feeling. \"no, mom, it's just me...look\" - each movement moves the unit. Probably the unique thing to this unit \"43\" was that it was directly across from the clubhouse. The lights blared through the bedroom windows all night. It felt like we had a 30 watt bulb on in the room. I requested a room change, but it was sold out as half of the units were moved off the properties for the winter. There were only 30 units left to rent. The other thing never written was the indoor/outdoor carpet in the bedroom was pretty gross. Probably cleaned several 100 times. It made your socks black and felt like rubber. The bathroom smelled of mold. There is no heater only a portable radiating heat unit. This was interesting when the kids were in the living area on the pull-out couch and we were in the bedroom. The doors had to stay open to have any heat. One of these things would have been okay, but overall not worthy of even 3 stars, maybe 2 1/2.", "Date": "November 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“A little misleading....”", "Author": "jpug2002", "ReviewID": "UR22012247", "Content": "We were under the impression we were going to be staying in a little cottage in Napa, but instead we discovered that the so-called cottage was actually a trailer! We checked out the website and the pictures are indeed very creatively shot so as to give one the impression a little bungalow was awaiting them...alas, that is not the case. Now, I'm not going to be completely negative in this review. For a trailer, the accomodations were satisfactory. It was clean and fairly new, and although the kitchenette was functional, there wasn't an actual oven, so a convection oven had to suffice. The location is ideal, and once the mobile home shock goes away, you find you assimilate fairly well. We made the best of it, and rest assured, many a joke was made at the poor trailer's expense. Overall, though, it made for quite the memory in an already memory-filled vacation. Oh, and lastly, the staff is pretty good there--two women by the names of Marilyn (the activity director) and Dana (front desk) were particularly helpful to us. Be sure to attend the 9AM Monday activities breakfast if you can, as it'll help you plan out your time in Napa which is great destination for sure!", "Date": "November 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleethorpes", "Title": "“River Pointe”", "Author": "Barry&Pat", "ReviewID": "UR20705079", "Content": "Although this is a trailor park this all aded to the charm. This site is in a flood area so the trailors have tp be moved when the river overfows. This is why it is a trailor park. The accommodation was of a good size. You didnt feel like you were in a trailor except for slight movement when someone walked inside. Ther e was ample storage and the kitchen was very well equipped but there was only a microwave. The only criticisms we had was that the sofabed was not very comfortable and the upper windows did not have blinds on them. My daughter slept on the sofabed so was woken early by all the light flooding through the high windows. Also the river walk could be a litte noisy with the early morning walkers if your trailor backed onto the walkway.. The staff were very helpful with booking restaurants and excursions. There were several evening wine tastings which were very pleasant held in the dining room. There was a laundry which came in very handy. This was free to use. Wash powder and dryer sheets were free from receprion. There is an excess of $5 a day for a service charge. The pool area and hot tubs were of a good size and towels were available. There was also plenty of BBQs around the site for anyone to use. These were cleaned after use by the maintainance service.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“It's a trailer park!”", "Author": "MichelleChicago_IL", "ReviewID": "UR20418774", "Content": "Needless to say, we were disappointed that we were staying at a trailer park. It is not advertised as such with Interval International. Our understanding was that we would be staying in a 2 bedroom condo. It was not that at all. We were in a small one bedroom trailer and our guests were in a smaller one bedroom studio trailer. How embarrassing. The only place to accommodate all four in the party was to sit on the metal deck which connected the two trailers. We often smelled propane gas outside the unit. We had to take turns making and eating breakfast as there was not enough room in the kitchen or chairs at the table. As you walked through the trailer you could feel the movement of the floor. Getting around the bed was another challenge - you had to take turns. Parking provided another problem - if you didn't angle your car you would run into the trailer hitch. At the end of the week, I think we agreed that River Pointe's location was all it had going for it.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Aldie, Virginia", "Title": "“I loved Riverpointe”", "Author": "maribethb", "ReviewID": "UR18998445", "Content": "We just returned from a wonderful week in Napa Valley at Riverpoint. While they were trailers, they were very comfortable and had great amentites. We enjoyed sitting on the deck at night with a bottle of wine overlooking the river, watching people walk by with their dogs on the trail. My Dad ran on the trail every morning and loved it. The only oven was a convection oven, but when we inquired at the front desk about how to cook a Papa Murphy's pizza, they said we could use the oven in the club house which we did. Great solution. That is a good example of how friendly the staff is. They also helped us ship our wine home for a reasonable fee (we checked around town for shipping prices). Definitely go to the Monday morning breakfast. Besides being a free breakfast with treats from the Buttercream Bakery (yum), they gave out lots of coupons and maps and lists of wineries. We listened to the 90 minute presentation and got a free bottle of wine, cash , a discount wine tasting card, and a gift cerfiticate to Christopher's Deli. We got a great picnic lunch at Christopher's and ate it at V. Sattui Winery. We enjoyed a visit to Copia. Also went to San Francisco and Point Reyes. They were far, but Riverpointe was a great central spot to see other sites in California. Compadres across from the resort is about the only restaurant you can walk to, but they had good food and some great drink specials. One thing that was strange....We had a two bedroom unit and the second bedroom was across the deck in another trailer. Close, yes, but we weren't comfortable putting our two year old over there even with the baby monitor we brought with us. However, the second bedroom was a studio unit and would have been great if we had brought a second couple instead of our two year old (Next time....) Overall, a wonderful vacation spot.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "herndon, va", "Title": "“Fun Time, Great Location”", "Author": "bob ashdown", "ReviewID": "UR18346392", "Content": "We enjoyed our stay at River Pointe, arranged through a time share exchange with Interval International. It is an excellent location to explore the wine country or to take day trips into San Francisco, Sacramento, or along the coast. Our unit was small, but comfortable and charming. Staff members are friendly and helpful, as were the other guests we met. If staying in a mobile home in close proximity to other guests is not your thing, then I suggest you look elsewhere for accommodations. Our one-bedroom unit, spacious enough for the two of us, would have been crowded for four. Opening our windows for fresh air also let in the voices of other guests and we could hear others when we sat on our deck. It was not a problem for us, but it could be for someone who desires privacy and quiet. Our positive experience with the staff began when I called in advance for information about wine tours. During that conversation as well as subsequent ones at the resort, the staff provided information and suggestions that enhanced our stay. Maintenance handled the one issue we had, a light bulb change, within minutes. Our unit was cleaned midweek and new towels were provided and trash removed two additional times. Our unit had a comfortable bed and living area, a table large enough for the two of us to dine, a microwave with a convection oven, two burners, a large refrigerator, and a deck with an unusually large table with four chairs. We didnâ€™t use the pool, but did enjoy a conveniently located hot tub. The workout room had only three pieces of equipment, but we exercised by walking on a beautiful 1.2 mile path along the Napa River. The staff includes a two-page list of activities in the registration packet. We recommend attending the resort-hosted orientation, a complete hot breakfast, as well as one or both of the complementary onsite wine tastings. We took the wine tour which includes tasting at four wineries, tours at three of them, and a delicious picnic lunch for $70 per person. Tours of San Francisco and the Napa River also are offered but we passed on them. The marketing person who gave us our parking pass also provided a map of the area wineries, a brochure that includes tasting coupons, and suggestions for interesting wineries to visit. She also suggested that we consider sharing a tasting, rather than pay for two tastings, at each winery. Sharing allowed us to taste safely at more wineries. You will find a Wal Mart near River Pointe as well as a Safeway, Trader Joeâ€™s, and a Whole Food Market within short driving distances. A Farmerâ€™s Market in town offers fresh produce as well as local bakery products.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "NYC", "Title": "“Really nice little place....”", "Author": "hcapelle", "ReviewID": "UR18119267", "Content": "My husband and I spent a week at the Riverpointe Napa Valley resort. We traded our timeshare week through Interval International. I had read some unpleasant reviews, but we really wanted to go to Napa, so we took our chance. We loved it. I mean it's not the Villagio Spa in Yountville--but it was clean and nice and more than fine for what we needed. You could walk to Copia or the Wine Train in about 20 minutes. The staff was always very accommodating. They even gave us the Founders Room so we could have internet in our unit. It was quiet and cozy. I would definitely stay there again!", "Date": "July 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Give it a try!! especially with other hotel $$”", "Author": "suwood", "ReviewID": "UR16746134", "Content": "Great time! yes, yes, we too thought wow! it's a trailor? (we frequent luxury hotels often- but pay much more$$) Once you get past the outside features... it is super clean, homey,comfortable, VERY close to everything!! Everyone was VERY friendly- employees and guests. We felt like they totally took care of us and wrote out special itineraries to meet our needs! We felt like we were part of a special \"club\" and participated in all thier activities- complimentary wine tastings, shuttled wine tour, etc.. We say, give it a try!! can't beat the price and location!! spend $$ on food, wine and attractions! We will definately be back and I might just go back for a \"girlfriends trip\"!!", "Date": "June 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Greeley Colorado", "Title": "“ok stay”", "Author": "rockesfans", "ReviewID": "UR16408319", "Content": "We atayed at River point for a week in May on a timeshare trade. We knew they were trailors but went for the locations. Unfortunately if you are there during a hear wave, which we were, the air conditioning units are very loud. The washers and dryers are in an outdoor shed, and very hot. The staff was very helpful. When we checked in we were surprised with added charges due to rising costs. Never had thta happen before. We really had no choice but to pay up. Only $40.00 or so plus maid tips.,I guess it was the point of surprise charges that we didnt like. Because it was so hot we really couldnt use the patio. The trailor becaome quite small by the end of the week. All in all, relatively inexpensive stay in Napa.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Not worth the money!”", "Author": "AvengerCalifornia", "ReviewID": "UR16393755", "Content": "My husband, daughter and I visited River Pointe for the weekend. Upon arrival we discovered that the plush accommodations, were 'trailers\" \"mobile homes\" The staff was rude not accommodating at all. Questions we asked we were never given the correct information and the staff, seemed bothered by our questions. i.e. where is a good place to eat, shop etc....The first night one of the guests had a party, LOUD and to boot, the resort was hosting a party, not sure if it was a wedding reception or what, but it was LOUD and the party goer's were loud and obnoxious! Eventually, we phoned the front desk to complain. This went on to about 1:30 AM eventually the local police department were called to break up the crowd. Needless to say, it was a sleepless night! It is a complete waste of money and the value you are getting is zilch! I'd rate this resort \"one star\" Also, the pool didn't seem very clean. Left an odd residue on your skin. We haven't returned to River Pointe and will never return. I guess, all I can say is, if you are interested in renting for the weekend or what not, \"take your chances\" There are some reviews on here about being so pleased etc...Quite surprising to me!!! We were NOT pleased!!!", "Date": "May 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fremont", "Title": "“Charming Place by the River”", "Author": "mini", "ReviewID": "UR13690271", "Content": "I liked the location of the Riverpointe in Napa Valley. It is right by the river and quite enjoyable stay. I had read the Trip Advisor reviews in advance of others who had stayed there and it immediately helped us to have a great time. We loved the \"very very upscale travel trailer home\" experience. The decor was lovely; the beds were comfy; the outdoor decks fabulous. We enjoyed being able to take a quick walk to the wonderful river walk by the river. The swimming pool, sauna, and club house are TOP NOTCH. Simply wonderful. We also enjoyed doing our own barbecue one night - they have top of the line barbecues. We will be back sometime. The location to drive to the wineries is ideal. If you are a time share exchange person (we were), its a great exchange for a week stay. If bookinng for a few nights, just realize you are getting a nice homey experience. The 5 stars were from Interval International, which is the time share exchange. Definitely this property is worth 5 stars for a time share; it is not 5 stars if you are looking for a luxury hotel. All in all, however, its great.", "Date": "February 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“It grew on us and makes us want to return”", "Author": "joyceg", "ReviewID": "UR11911396", "Content": "Wanting to stay in Napa for a week, we traded our timeshare for the RiverPointe Napa Valley (which also is a hotel). Like most places in wine country, the location was fine as long as you have a car. But it is just a short distance to the Silverarado Trail as well as close to the town of Napa. Upon checkin, we initial wondered what we got ourselves in to. These are \"trailers\" that can be moved in case of a flood (this is the only way the property could build on the location which is prone to floading). The last flood was 2005 so we didn't see this as a big problem (and the property makes this point very clear that you may have to vacate within 2 hours). The checkin area looked OK and the front desk staff person was informative. Still, we had a little queazy feeling in our stomachs as we drove to our small \"trailer\". Upon walking in, we quickly surveyed the small space. The \"kitchen\" has a full size refrigerator, 2 burners, a sink, dishwasher and microwave. The trash can didn't quite fit in the cabinet due to the fire extinguisher. Since they had regular trash pickup, they could have used a smaller trash can. But, as long as you look upon the kitchen as a place for breakfast and snacks, you are fine. I wouldn't want to cook dinner here however, with all of the wonderful restaurants--particularly in Yountville and St. Helena--why cook? The kitchen was in one corner of the living room area, which also included a small breakfast table (which has leaves that you can pull up to make it larger, a 3 person sleeper couch and a chair. The couch is firm but very comfortable. The TV area has the normal DVD, CD etc components and worked well. Bathroom was somewhat normal with a tub/shower (not huge, but adequate). The place had some nice closet space. We asked for a king bed and had to take turns walking around the bed. The bedroom also has a desk in it with chairs. However, we had to move the chairs so that we could walk around the bed. For the first day, we kept saying to ourselves that we would be OK in the small space, and if not, we could always go home to San Francisco. However, we grew to like the place and actually looked at dates to return. Why? Everything was very clean and maintained. The towels were nice and fluffy--way above what I would have expected in a place like this. The bed was very comfortable once we asked for (and quickly got) less firm pillows. The concierge had put together some good programs to acquaint people with the area and the resort. There was an orientation breakfast where she spoke to all the different types of travellers in the audience, plus 2 wine tastings...all free). She had printed out coupons for wine tastings and schedules of what was happening in the valley while we were there. The staff was well trained and very responsive. Even the person who came in daily to pick up trash and give us fresh towels was very pleasant. My only negatives are very minor. The resort tacked on a $5/day resort fee which allows you free laundry and some other stuff that few people use but that the properties use to justify extra cost. I personally think these kinds of fees are rarely justified and believe they should be included. in the nightly pricing. Yes, it did include wireless access in the lobby...duhhhhhh..wireless is SOP in many places now. Maybe it was to pay for the nice working area they had set aside in the lobby building..whatever. The wireless was only in the lobby building. Since we were paying $5/day for it, I would have liked it in our trailers too. I suspect this is a logistical problem as the trailers are spread out and...well, they are movable trailers. If you had a dial up (does anyone have those anymore?) connection, you could use it in your trailer. They also rented DVDs for $3 each or $10 for your stay. Why couldn't this be part of the $5/day fee? Can you tell that I bristle at extra fees? The only other negative was that the blanket didn't quite fit the bed. This was a very minor issue however. Once we turned it 45 degrees, we were fine. Bottom line, it turned out to be a pleasant stay in spite of our initial apprehension. While we tend to like something a little more upscale, in pricy Napa, is it a very good compromise and we are likely to return. Just be away that you may be required to vacate during the rainy season.", "Date": "December 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Campbell, California", "Title": "“We Enjoyed Our Stay & Will Go Back Someday”", "Author": "thdzsm", "ReviewID": "UR11234726", "Content": "We just returned from River Point. Yes, it is not a 5 Star Resort. However, it is a small and friendly 3 Star Resort. The cottages are actually relatively small trailers and you will feel some movement as you walk across the floor. However, my wife and I really enjoyed our stay. The other guests were exceptionally friendly and the staff was helpful and informative. The Resort arranged winery tours and other group excursions. The location is great. We rode our bikes to old downtown Napa and along the Silverado Trail. Dining was GREAT! World class restaurants are located just minuets from the resort. The 5 Star Rating sets high expectations which this resort simply canâ€™t achieve. We usually stay at 5 Star Resorts and enjoy all of the amenities. Nevertheless, we really enjoyed our trip to River Point in Napa and plan to return someday.", "Date": "December 3, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Francisco", "Title": "“Charming River Resort”", "Author": "WanderingSu2", "ReviewID": "UR11130616", "Content": "I don't usually write reviews but I was in the process of recommending this timeshare resort to a friend back east and saw the terrible review written before this one. I have stayed there twice - once for a week in May 2007 on a timeshare trade and once for two nights in August 2007 just for fun! The \"cottages\" are charming - they are little cottage trailers with decks - when the river reaches flood stage, they can pull them off the property - seems smart to me! The cottages have a living room, eating area, kitchen with dishwasher, range top, garbage disposal and full sized refrigerator. There is a big bathroom and either a king or queen bed. The queen bed fits better as the room is small around the king - which we did have for our week stay. It's convenient and clean and nice. I didn't love the desk crew on the second visit and we found that using Resortime.com was more expensive than calling directly for the two night stay, but I would stay there again - and I would call directly.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oregon", "Title": "“We're Already Planning Another Trip!”", "Author": "Retiredbarnqueen", "ReviewID": "UR10087675", "Content": "It's a great place to stay. Comfortable, convenient, and very friendly. We've been to so many places where you don't meet anyone, but the people who come to River Pointe have common ground: wine. You talk in the pool, hot tub, in the club house, or on the street. You exchange tips where to go, and where not to go (not too many of those). You get lots of help from the front desk, as well as the concierge. (She has coupons for free tastings.) They even arrange for your wine shipments! River Pointe was quiet, comfortable, conveniently located, and very, very friendly. Don't be dismayed by the 'trailer' talk. You'd hardly know you were in one!", "Date": "October 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“I'ts a glorified trailer park ”", "Author": "luv2travel015", "ReviewID": "UR8498455", "Content": "We just spent 1 week at this \"resort.\" This place is not at all what it appears to be. It is not a 5* resort as we were told. It is a glorified trailer park - really! Beneath the white lattice surrounding each unit are a trailer hitch, and wheels. The units are tiny. We booked a 2-bedroom unit, and one of the bedrooms and baths was in a different trailer. They expect you to do their inventory of kitchen items at the end of your stay. They could not provide a separate cot, even though the unit is supposed to sleep 6 - there was actually no room for one. The units are not very clean - just passable. Don't look in the corners. Also, the housekeeping leaves much to be desired. They only do a \"mini-clean\" midweek - not much cleaning really. They change the beds and towels. You have to beg for bath tissue - they only give you 1 roll at a time. The pool was not heated, and dirty. Yes, you do need a heated pool in Napa - nights and mornings are quite cold. If you're going to Napa, stay at another hotel, or better yet, in Sonoma. This place is not cheap, and we expected more than a trailer park when we booked.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Great Resort, BUT”", "Author": "Jane80", "ReviewID": "UR8097096", "Content": "River Pointe is a charming, well kept resort. The cottages are trailers, with wheels still attached, so you get a little \"movement\" when someone is walking. Overall, we had a great time. The staff was helpful and informative. The location is great, close to old downtown Napa and the Silverado Trail to the wineries. The resort had a wine tasting and gave good tips. This would have been a near perfect vacation except: during our week's stay they had booked two events, weddings I think, that took place around the Clubhouse. Both had blaring, really loud music playing on loudspeakers. One event happened all 4th of July so I overlooked it. The other was a Saturday night and the music and DJ could be heard until midnight! It was impossible to get to sleep before that so I left very tired! If you want a quiet relaxing time be sure to ask when you book if they have any \"parties\" planned. That is the only thing that would prevent me from returning.", "Date": "July 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Highland, Maryland", "Title": "“Great \"base camp\" for your visit to Wine Country”", "Author": "Namgrunt", "ReviewID": "UR8035994", "Content": "We booked our week via Interval International using a trade from our \"home resort\" of Swallowtail (Hilton Head Island.) Riverpoint is a classic timeshare. It is a small, cozy resort -- not the glitzy mega-resorts that are now the trend. As were some others, I was a bit apprehensive about Riverpointe; however, I was pleasantly surprised. Accomodations are mobile homes -- somewhat small, but clean and very effective as a \"base\" for exploring Napa, all of Wine Country, and the coastal areas like Point Reyes. Location is great -- turn right and you are in downtown Napa -- turn left and you are on the Silverado Trail.", "Date": "July 1, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Summerville, SC", "Title": "“Really cool place to stay in Napa Valley”", "Author": "bmesservy", "ReviewID": "UR7479385", "Content": "My husband's clients gave us a week of their timeshare here, and we loved every minute of it. If you've read the reviews of River Pointe, you know that the \"units\" are in fact trailers. Don't be alarmed! True, the units are mobile homes, but they are amazing!! We had a one bedroom, one bath (pics uploaded), and it was the perfect size for the 2 of us for a whole week. We want one just like it to stay in when we visit his parents' lake place. There is a bedroom, full bath (larger than any hotel bath i've seen), a kitchen area, a family room with pullout couch, and a porch with a 4-seater table. The kitchen does not have a regular oven, which we found out after we bought a frozen pizza to cook. It only has a convection oven/microwave. But everything else that you need is there! Laundry room in the back of the complex. Only 4 washers and 4 dryers, so do your laundry when you don't expect anyone else to. We went at the end of April, during the first phase of the growing season in the wineries, so it was pretty quiet. The resort does have a \"quiet policy\" from 9pm-9am, so neighbors disturbing you are never a problem. DON'T BRING YOUR PETS ON THE PROPERTY. They clearly tell you this, but our neighbors apparently couldn't read. They brought their little dog, and the people at the resort told them they had to leave. The only time that I was not happy was when one of the guest services people (Marilyn) never called me back after I left 3 messages for her. I was trying to book my husband and I on a special expedition through the wineries through the resort, and due to the fact that she never called back, we were not signed up for the Saturday tour. She had to create a Sunday tour to get us in, but when the other couples who were scheduled for Sunday cancelled, she never even called us to let us know. My husband had gone up to the front desk to ask about something else, and Marilyn said, \"Oh yeah, we can't drive you around today.\" Everything worked out, though....we just drove ourselves and covered two times the wineries the resort would have covered. Anyway, I do recommend River Pointe Napa Valley. It is very convenient to everything in the Napa Valley region, as well as to Sonoma.", "Date": "April 28, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Austin, TX", "Title": "“Winter Time in Napa”", "Author": "thechief71", "ReviewID": "UR6725749", "Content": "We received our stay here from my parents who gave us their use of a timeshare. I have to admit that the website for the place makes it appear much \"grander\" than it really is. That being said, it's a nice place and I'm sure it's even prettier in the spring and summer. We stayed 4 nights. The clubhouse area and attendants are very pleaseant and quite helpful. We got lots of good tips for where to go and what to do. The accommodations though were just average. They are trailers with very nice inside decor. We definitely liked the \"condo\" type setting for a base of operation in the Napa Valley. Had I paid for a 4 stary type setting, I'd have been dissappointed. Nice place though.", "Date": "February 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Huntsville, AL", "Title": "“Scared by the \"free standing trailers\"...now going back again!”", "Author": "lamccammon", "ReviewID": "UR6636189", "Content": "I booked this through Interval International in 2004, with 3 of my girlfiriends, and was nervous when I got my paperwork that read: Please note: these units are free standing trailers. I couldn't believe I had booked myself and my friends at a trailer park! Once we got there, we were delighted by the bright, cheery and comfortable decor, our personal deck, the river that meanders through the property, the walking trail, and the convenience of location and being able to prepare some meals (namely breakfast) in our unit. I personally prefer the condo style to a stuffy hotel room, anyway. The staff was very informed and helpful with directions and recommendations. This year, my sister and I will be returning to River Pointe Napa Valley, and I am very much looking forward to it. That said, my total cost for 1 week was ~$500, so for a time share exchange, I was very pleased. If I were paying $150+/night, I might choose to stay somewhere else.", "Date": "January 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Abq, NM", "Title": "“More like a 3*”", "Author": "721belmont", "ReviewID": "UR6034354", "Content": "This stay was an Interval exchange. Interval rate this resort as a 5*. I wouldn't. That being said, it was still an enjoyable stay. We had a two bedroom unit for 2 couples. This consisted of the main unit (which is basically a single wide small trailer) which had a living area, kitchen, bathroom (with tub) and bedroom. This unit was connected via an outside deck to the studio unit, which consisted of studio unit with bathroom (stand up shower). We all flinched when we first drove up because all the \"cottages\" were really packed in there, but after being there for a week, we hardly ever encountered other guests. They have the cottages arranged so you park and proceed to your deck. My biggest complaint is about the beds and pillows. They were terrible. The towels were plush, the furnishings were good, but the beds were awful! As I said, it is more like a 3*.", "Date": "October 31, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Real Nice”", "Author": "johnfasc", "ReviewID": "UR5943611", "Content": "We stayed four nites with two other couples. Our rooms were located next to each other divided by a deck which was nice. The rooms were clean and comfortable. It was a nice centrally located motel. We did not partake of the time share sales event so that may be why we liked it. (We did listen to the group spiel). I would go back if not only that it is clean and in a nice location.", "Date": "October 11, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northern Virginia", "Title": "“Great Location for Napa Visit”", "Author": "valibrn", "ReviewID": "UR5924922", "Content": "Yes, the units are trailers! However, this is a great location for visiting Napa and Sonoma. The unit was clean, well-stocked, quiet, and comfortable, if a bit small. The resort itself is pleasant, with responsive and courteous staff. Our unit was bright and airy, with plenty of good quality towels and other linens. A cracked plate was replaced almost immediately. We've been in more luxurious resorts that weren't as clean and well-tended. Like in real estate, location is everything; the River Pointe makes visiting Napa Valley, Sonoma, Santa Rosa, San Francisco, Marin County, and other Bay area attractions easy.", "Date": "October 7, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Oakland, CA", "Title": "“Glorified trailer park”", "Author": "keepntabs", "ReviewID": "UR5607651", "Content": "I toured the River Pointe \"resort\" on 8/11/06, and all I can say is what a waste of time. The salesperson started off with the typical chit-chat about what kind of work I do, yaddah-yaddah-yaddah. They offered some generic cookies, coffee, and cups of water. I truly went there with an open mind to buy, because I wanted a holiday spot that was somewhat close to home, but this certainly wasn't it. The cabins are very small trailers (the one-bedroom has to be about 300 s.f.) with wood paneling to disguise them, and the whole place is located in a flood plan. Last winter guests had to be evacuated, because the heavy rains flooded the area (and they had to repair their cot-trailers). If you are familiar with No. Cal. you know that just about any winter can have a heavy rain season. The kitchens do not have ovens, just a stovetop and microwave. Although the couch does pull out, if you scoot to the bottom of the sofabed you will be able to open the front door without having to stand up. There is about 18\" walking perimeter around the bed. The studio units are just bedrooms with a bathroom, and mini-fridge. The site does not provide views of any wineries, because it is in downtown Napa (which is not quaint like downtown Sonoma) off of a major street. The only amenities that are on site are a small gym, lap pool, and two jacuzzis. There is no tennis court, spa, restaurant, bar, golf, volleyball, walking trail...not even a pingpong table. When I asked about the lack of amenities, I was told that they would increase the maintenance fee (which is about $570 per year). This was really an unsatifactory answer, because I own another timeshare, and have seen others that charge less and are capable of having these types of amenities onsite for their members. The salesperson kept emphasizing the \"benefit\" of being able to trade your timeshare via Interval and other trading companies, or visiting one of their sister resorts. He didn't go into great detail about having to pay another membership to these companies ($80-90 per year), or how much more you it costs to trade ($50-150). So I got the impression that they know that most locals won't want to stay their, but wish to use the timeshare as a means to have access to other more desirable timeshares. So forget about having a nice getaway place that is only an hour's drive, because you will still have to drive to anything that's worth doing (gas costs $3.25 per gallon for regular unleaded). Another benefit is that a member can use the facilities anytime during the day, and I can tell there was a great demand for this added bonus by the four women I saw by the pool/jacuzzis. Lastly, I was told what an \"asset\" buying a timeshare there would be instead of spending money on hotels. Well, when I buy an asset I expect it to appreciate in value. I asked him to tell me what is the historical re-sale value of the timeshares during the 8 years they've existed. He got his manager to try to answer that question, and he could only tell me that a 2bd/2ba annual visit cost $22,500 in 1998, and the same unit was going for $28,675 today (FYI, an every other year 1 bedroom costs $9500+ now). This is about a 22% increase during a period where real estate values in the area have appreciated between 400-500%. . So the long and short of it is, buy a timeshare at River Pointe if: you don't want to stay there yourself; you want to rent a car (or have to drive) and spend a small fortune in gas, because nothing is close by (except Walmart); you don't mind staying in extremely cramped space that may flood in the winter or catch fire during the summer, and you prefer to spend your money on something that you will probably won't use, and have to spend more to get to a real resort (where you wish you had actually bought). The salesperson wasn't too pushy, but you can't get your gifts without one last pitch from the Trading Places (the other timeshare trading company) salesperson. I received a $25 gift certificate to Macy's, a travel certificate for 3 days/2 nights travel to either Las Vegas, New Orleans, Orlando, Cancun or Jamaica (these last two incur an additional charge of $169), and an invitation for a wine tour (which is dumb, because many wineries give free wine tours daily). By the rules of the travel certificate, the earliest that I can actually travel will January 2007, and the certificate is only good for a year from the date of issue. Spend your money and time at a nice B&B in the Napa Valley. You'll feel much better, and be getting more bang for your buck.", "Date": "August 13, 2006"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "San Francisco, CA", "Title": "“Horrible Timeshare Value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5438639", "Content": "My husband and I visited the River Pointe Napa Valley Resort to participate in a timeshare presentation. Having visited a couple of other international timeshare presentations and coming very close to actually buying one, we were very excited about the prospect of owning locally while still having access to exotic locations worldwide. Well this \"resort\" was a far cry from the real vacation getaways we've toured before (imagine having a Walmart and the train tracks across the street from your 5-star timeshare). Not only were we subjected to over 1.5 hours of verbal abuse from an obviously disgruntled â€œfriendly and professionalâ€� sales consultant, but we never actually got to see the rooms or the grounds since they apparently werenâ€™t important to the value-building portion of the timeshare presentation. We did, however, get a glimpse of the bedroom sized fitness center located behind the bathrooms in the main lobby. In closing, if your idea of a 5-star resort is one that treats their prospective owners on a 90+ degree day to a Â½ cup of tepid water and a stale cookie while being seated on your standard elementary school style chairs, then this might just be the place for you. Needless to say, we were not impressed and chose not to waste our money on a company that could exercise such poor judgment in choosing their representatives.", "Date": "July 8, 2006"}], "HotelInfo": {"Name": "RiverPointe Napa Valley Resort", "HotelURL": "/ShowUserReviews-g32766-d601313-Reviews-RiverPointe_Napa_Valley_Resort-Napa_Napa_Valley_California.html", "Price": "$166 - $316*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">500 Lincoln Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Napa</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94559 </span></span> </span></span></address>", "HotelID": "601313", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/df/66/df6643c83e1a73d32f4243f274bf5f4b8large.jpg"}}