{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oak Hill, Virginia, United States", "Title": "“Not Rome”", "Author": "Waynomo", "ReviewID": "UR128195703", "Content": "We stayed here the night before our flight back to the states. It is very convenient to the airport. The rates where reasonable. The rooms were clean and comfortable. It is a new hotel so all is in great condition. Took me a bit to figure out how to turn off the lights. Needed a specific switch positions. Staff was nice. Parking was free on the street. I was a bit concerned that planes landing at Fiumicino would be a bother, but once in the room all was quiet. We had a sea view and we could hear the sea, but the sounds were soothing. Not much to do in the area during our visit. This could be different during the high season. Probably best driving a bit to find a good restaurant.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“Not worth it at all”", "Author": "Leah H", "ReviewID": "UR128003654", "Content": "My boyfriend and I picked this as a cheaper option to staying in Rome. Our plan was to get into rome and go back to the hotel. Our two night stay ended up being only one night as we regretted it as a choice. The neighborhood at night was one that we didn't want to be around, it seemed very sketchy and the hotel is literally in the middle of nowhere. From the airport, we had to ask about 5 different people how to get there. We ended up finding one bus that went within the area and we then had to transfer. Even with that we ended up walking for a while to reach the hotel. The hotel, being newly remodeled is one that is nice and clean. It seems that once the restaurant is up it would be nicer. However for us there was really nothing in the area, and everything else closed early so we did not want to venture out. We ended up leaving and getting another hotel in Rome that we very much enjoyed. If you want to simply see the sea, then this is a good option. However, despite it being close to the airport it is something that is NOT easy to get to. It seemed as though it was way easier and cheaper to simply get into Rome from the airport. I would not go back here.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "aberdeen", "Title": "“Great hotel in quiet location-need a car tho'”", "Author": "sc0ts_away", "ReviewID": "UR127255855", "Content": "Clean, great comfort, friendly and very helpful staff. Next to 'port' for the rich (and perhaps famous judging by boats!). Need a car tho or be prepared to bus/walk to station. A convenient 30 mins to rome. 16 euros buys a week's travel ticket for transport system incl train and metro. Again, staff v helpful. Free parking in basement.did i say v v comfy!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Saint Petersburg, Saint Petersburg City, Russia", "Title": "“The hotel wasnt 4 star”", "Author": "Mariam409", "ReviewID": "UR121832187", "Content": "The staff was very warm ; the breakfast wasnt bad. The room for 3 person was small. We had a front room with a seavew big balkony( i like it ) but it was very noisy. the beach is puplic (the hotel hasnt privat place). The location isnt good very far from restorants and supermarkets...", "Date": "December 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Gulf Shores, Alabama", "Title": "“Way off what we were told”", "Author": "shooflyfarm", "ReviewID": "UR121063117", "Content": "Well, what can I say? We stayed one night there because it was close to the airport in Rome. We wanted something on the mediterranean. I was told it was a 4 star. We did not feel safe when we pulled up to the front. It was isolated feeling. There was parking but it was very tight getting our small car down the ramp and into the basement lot. The attendant was a very nice girl and the check in was nice. The room was the biggest disappointment. My daughter was locked into the bathroom while we went to park the car. It took 15 minutes to get her door unlocked. The room had this look as if it was decorated but a very long time ago. The fake modern cheap furniture with scuff marks everywhere. (A party room) The TV was so small on the wall that we could barely see it. The door would not dead bolt and when I went down to the lobby to see what could be done, the man walked up and said that the one lock was enough and the 2nd was broken and it was OK. We thought about leaving but it was late in the evening and kids were tired. We all wanted to leave but had to just suck it up and stay. When I sat on the bed, I thought \"OH MY GOODNES\" How was I going to make it through the night. It was a rock!!! I told the kids everything was going to be fine. I was not sure of that. I was scared and uncomfortable. They were very unhappy. We went to sleep and then woke up fine. We packed up got out of there and said our goodbye to the nice hotel clerk and made it through. I can see this place being OK if your expectations are not high as far as the room. The view was beautiful in the morning and right on the water. A nice balcony made the morning. We were where the boat yard was. It was a different feeling in the morning but the room was still not good. Sorry but I am giving this hotel a 2 1/2. Get nicer beds, fix the doors, get new updated furniture and some nice low lighting and then they will have their 4 stars. They have the nice staff.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Stony Plain, Canada", "Title": "“Adequate hotel - probably wouldn't return”", "Author": "Bev P", "ReviewID": "UR120481378", "Content": "We spent two nights at the Aran Blu at the end of our Italian vacation. We had stayed at many stellar properties and this hotel was somewhat of a disappointment. The location is good for traveling to the airport and has a nice view of the sea. The room was somewhat small. It was clean although the carpet was worn and a not particularly clean. We were given a room on the back of the hotel where we heard a constant barking of a dog from the nearby apartments. When we asked to be moved to the front of the hotel, we were told that wasn't possible as it was a different price range. We indicated our displeasure as the hotel was far from full and then went out to dinner. When we returned, the desk clerk hurried over to tell us that she had listened to the dog and would definitely move us to the front of the hotel at no charge - not sure why she had this change of heart but it was appreciated. There are a few restaurants on the nearby boardwalk, although in October a number of them were closed. We did however, find a nice bar & restaurant, with free wifi where we ate both nights. The hotel only provides 30 minutes of free wifi and it is just available in lobby area. Although the hotel was adequate, I would probably not return.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good choice for over-night stay!”", "Author": "Marla777", "ReviewID": "UR120462721", "Content": "Good hotel with modern design. Breakfast is rather poor, there's no good expresso :) If you travel in cold time of the year, be aware that to go downstairs (ex. for breakfast) you'll have to pass the out-side zone on your floor, because the lift is situated separately from main buildings (between them). That's very uncomfortable, if it's raining & cold...", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Genova", "Title": "“Good alternative to the expensive Rome hotels”", "Author": "FabioDaGenova", "ReviewID": "UR119211447", "Content": "If you are in Rome by car, a good alternative could be to stay in Ostia, a nice sea-small town, just few km away from Rome. In such respect the Aran Hotel is a very good choice: directly in front of the beach, this is a nice and modern hotel with nice decorated rooms and with an excellent quality/price ratio. Only negative point is that the shower is in the middle on the baathroon and has not protection (no glass, nor even plastic). But the 90 euros they will charge you are extremely well spent. Again: you absolutely need a car.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dorset", "Title": "“A pleasant, peaceful stay”", "Author": "jojoDorset", "ReviewID": "UR118629873", "Content": "We spent a night at the Aran Blu in order to drive to the ruins in Ostia Antica before driving to Fiumicino airport. It was an excellent choice - we had chosen a room with a sea view and in fact this had a charming, spacious balcony overlooking the beach and the marina. Our room was comfortable and modern with an excellent bathroom. The staff at the desk were friendly and efficient and the parking - under the hotel - is extremely secure. Not a hotel with great character, but for a short stay it did us fine and provided just what we needed. Wandering out to eat at the marina in the evening was very pleasant - a good tip from the desk-staff. The Aran Blu is very conveniently situated - the fabulous ruins at Ostia Antica are only about 10 minutes drive away, and the airport is maybe 15 minutes.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "So Cal", "Title": "“Pleasantly surprised”", "Author": "Luvcdays", "ReviewID": "UR48593115", "Content": "After reading all of the reviews, we were very skeptical about this hotel. We stayed at the Aran Blu for one night after a 12 day cruise, just to relax. We had a 6:45 am flight the next morning. I booked through Expedia one year earlier. We arrived at 10:00 am and were told that our room would be ready shortly. We were then invited to sit in the dining area and enjoy the breakfast buffet for free. Another girl asked us if we would like a coffee. We said \"yes, Cafe Americano\" and she dissappeared for a few minutes and returned with 2 coffees at no charge. They even changed the TV to an American channel for us without us even asking. The 3 girls working there spoke very little English and I don't think they see many Americans. The rooms was ready in about 30 minutes. The room was nice especially because of the ocean view from the balcony. The bathroom was also very nice and modern. The bed could have been softer, but again, this is Italy! The area was all residential apartment buildings along the coast line. It was very quiet and there are several shops and restaurants at the marina. They close for a long siesta and then again at 7:30 pm. There is a McDonald's there open later though. We don't normally ever eat there, but it was the only thing open. We got fried Brie Cheese and a Hot Fudge Sundae. Where else can you get that but in Europe? If you are looking for a place to stay with alot to do, I wouldn't recommend this hotel. But if you are looking for a quiet place to relax. This is it!", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Atlanta, GA", "Title": "“Great for overnight stay before flight out of FCO.”", "Author": "trvlbuff", "ReviewID": "UR45908346", "Content": "* We booked another hotel for our last night in Italy. They didn't have internet availability in the rooms. I drove to Aran Blu and inquired as to availability, internet access and price. All was OK except internet was available in room by cable, no wi-fi. My netbook is wi-fi only. The front desk recommended a room over the public area where wi-fi is available. It worked great, problem solved. * The rooms are spartan/modern. Small TV, large bathroom. Shower worked fine, good water pressure. * Regarding finding the hotel. It's clearly marked on google earth, and having a GPS will help immensely. Actually, I thought the location was excellent. Close to restaurants and an easy quick way to get to FCO. * I recommend the hotel as an airport hotel, not as a base to visit Rome. There are a number of restaurants within a 10 minute walk. The area is fine for an evening stroll. * It takes about 20-25 minutes to drive from the hotel to FCO. Car rental return is in parking deck B. If you are flying out of Italy on Delta, American, United, Continental, or El Al. You have to get from the car return to terminal 5. Plan on 45 minutes from the parking deck. You have to get to the C concourse and take the free bus to terminal 5. Allow plenty of time.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Who gave this hotel 4 stars?”", "Author": "Calgary68", "ReviewID": "UR45518699", "Content": "Another supposed 4-star hotel. (Who decides these things?) Damn hard to find – of course that we approached it from Fiumincino (FCO) didn't help, but the public bus (CATREL) from FCO - or rather buying tickets for it - proved a challenge. Hint: You buy them in the terminal at the tobacconists – there's no sign - and they cost 1.20E one way. That gets you into Ostia (to where we should have taken the train in the first place). Go to the end of the line – to the Ostia train station – and then take the #01 bus – wait – buy a ticket first, at the booth – and when you see the beach and a sign that has in it “Abruzzi” get the hell off! Because otherwise, you'll just keep going round in circles – really! Look to your right as you're facing the ocean and you'll see the hotel. Now for the hotel: Clean, smartly - if sparsely - furnished with lots of marble. The room was small, but had a view of the ocean, The bath – complete with bidet, of course, was probably the best we encountered on our trip. The staff was helpful when we had problems with the electronic key and then the lights. No wifi(!) wired-in only, and 2E for 60 minutes. It's seemingly little things like that that take the shine off an otherwise nice spot. That – and the breakfast which, of the 7 hotels we stayed in in 3 weeks, ranked 6th. Their 10E shuttle to FCO takes 20 minutes.", "Date": "September 30, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "", "Title": "“\"Bad end\" of our wedding in this hotel”", "Author": "CUBEHotels", "ReviewID": "UR37948572", "Content": "we got married on the 7th of June in ostia on the beach and our family decided to book a suite/room in this hotel (the only four star hotel in the surroundings) for our wedding night. they booked a room with the agreement for \"early check-out\" - as it was the night of the wedding we already knew that we would arrive late after the party respectively early in the morning in the hotel. In fact we arrived in the hotel at 07:00 in the morning - we had this day the best day in our life - but all our happiness ended up soon as we entried in the hotel. still dressed in the wedding dress / suit we arrived there and we had a \"friendly\" welcome of the night audit / receptionist ....Not only that he didn´t say \"Congratulations\" no he even didn´t say \"good evening / morning\" - nothing. he looked at us without saying anything with an angry face (like we disturb him while sleeping or relaxing behind the reception). then he rugly asked us for our passports (that I din´t had with me in the underwear of my wedding dress) and we had to discuss 10 minutes to get the key for our room (only with the driving licence of my husband)....minutes that destroyed our whole wedding day and happiness...then we just wanted to be sure for the late check-out but he said (without double checking in the reservation system / computer) that it is not possible and we will have to leave the room early in the morning. In fact we were that angry that we decided to to leave and to sleep in our wedding night in the house of my husbands parents (nice wedding night - really and great THANKS to the friendly staff in the hotel).... @ hotelmanagement: Please change your staff (night audit, \"older\" man with glasses) in the hotel immediately so that you don´t destroy more wedding nights!!!! I also work in the hotel business and I am travelling a lot in the whole world but an unfriendly hotel staff like this I really never saw in my life!", "Date": "August 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Grumpy service!”", "Author": "lymphad", "ReviewID": "UR28476532", "Content": "Everything about this hotel seems to put it in a boutique catergory, except for one thing. Grumpy old men! The front desk service upon checking in is just rude, and off hand. Surely a retirement home for unhappy old men is better for these individuals than working behind the front desk of a potentially great hotel. The only other conclusion is that they were acting in a rascist manner to non-italians, and were expressing thier obvious dislike at our presence. The kind of behavior we experienced is unacceptable. Fortunately, I have also experienced great service in Italy, but not here.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Austin, Texas", "Title": "“Close to airport but high cab fare both to there and to airport”", "Author": "weddingintuscany", "ReviewID": "UR26357773", "Content": "Hi, The hotel itself is nice, can't really complain about it. The one thing I would say is that if you are staying here to be close to the airport in my opinion it would be better to stay at the airport. It was a $60 euro cab fare from the train station from Rome to the hotel and then the hotel charges $40 euro for the 10 minute drive to the airport.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Cose to Airport - a Quick Getaway to the North”", "Author": "pross2007", "ReviewID": "UR23716010", "Content": "We were leaving for the north and on to France and Spain and chose this hotel due to its proximity to Rome airport - we were not disappointed. We picked up our hire car fron the airport after a few days in Rome and were in our hotel room within an hour. The hotel has been extensively refurbished, the best rooms are on the upper floors overlooking the beach. The rooms themselves are very stylish and a cut above the average for Europe. The hotel has a lift and is air conditioned. The surrounding suburb is not the most aesthetically pleasing but the hotel itself is better than three star, there is guest parking and the staff are first class. Breakfast is the ueual European mix, the breakfast room is very light, open and friendly. We happened to be there on a holiday and the beach was packed - it made for a great spectacle. There is a marina within 5 minutes walk with plenty of restaurants and shops. The nearby shops and supermarkets are convenient and the town centre, near the railway station and church is quaint. Overall a very satisfying and restful stay.", "Date": "January 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Your choice: At the Beach or Airport”", "Author": "Lupaka", "ReviewID": "UR20241689", "Content": "We stayed one night after departing a 12 day cruise and were flying out the next day. After reading reviews of hotels by the airport we chose the Aran Blu. We were looking to just relax as it was beach front with dining choices. That is all we were looking for and were not disappointed. They have units with sea views in the front and rear view facing low rise residential apartment buildings. We reserved the sea view paying $20-30 more and it was worth it. We used Travelocity and payed $231with all taxes/fees included for \"Standard Marine double with Sea View and Direkt am Wasser. Buffet Breakfast (2 Adults)\" They were the only ocean front hotel in this residential area. The next ocean front hotel appeared 3 km/1.5 mi south. Directly across from the hotel is Roma Porto Marina to the right and a 3-4km/2-3 mile concrete beach front promenade to the left. The dark brown sandy narrow beach in front of the hotel is crescent shaped and is approximately 50 feet deep. There rocks spread out in the water and there is a shallow rock shoal 100 feet out extending up the length of the beach. As you walk up the promenade the beach widens to accomodate numerous beach/cabana clubs. Each culb has umbrellas and chairs in their repective club colors. A 150 foot concrete pier is approximately 3 km/1 mi. walk up the promenade. Walking out to the end of the pier reveals the water looks waist high out to the rocky shoal with sandy bottom. Looking both north and south of the pier one can see the numerous beach clubs and their colorful umbrellas. The avenue opposite the pier has stores, resturaunts, pizzerias. We purchased some cheese and crackers which we had on our oceanfront terrace with a bottle of Ruffino. The marina to the right of the hotel has several seafood resturaunts spread on the water side of the marina's promenade. Opposite them is a string of stores, shops, pizzerias that have a roofed`corridor to walk under. The pizzerias have chairs and tables to sit at on the promenade. The hotel has a free continental breakfast and served seafood dinner during our stay. We chose to eat dinner out as there was a small seminar in the hotels first floor meeting room and did not want to eat in a fairly full resturaunt after getting off of a cruise ship. The rooms are as described in the previous reviews. They include a safe, tv and small desk where you can enjoy hard wired internet access for 2 Euros for 1 hour, 5 Euros for 24 hours. They have wifi access as part of this purchase plan on the first floor. They serve breakfast starting at 7a.m. We checked out of the hotel at 7:10a.m. and were at our departure gate at 7:50a.m. The cab ride was 10 minutes. Throughout our trip we made all of our transfer reservations thru Rome Cabs (romecabs@yahoo.com - Stefano Costantini) which we discovered in these reviews. We were extremely satisfied with their service. They provided cars or vans and all drivers were early and held signs to easily identify them. We used them from the airport to Rome, Rome to Citivitavecchia, Citivitavecchia to the Aran Blu in Lido di Ostiga, and finally from the hotel to the airport. From Civitivecchia to the hotel in Lido di Ostiga was 130 euro. The cruise line wanted $150 for a bus shuttle to the airport upon which you would have to transfer your luggage to a taxi, at least 40 euro, to the hotel. Why bother, plus you get to the hotel earlier. They said check in is usually 4p.m. but they made a room available for us by 10:45 a.m. They will hold your luggage if you have to wait and you can walk around and explore the area while you are waiting. Fellow cruisers staying one extra day were at the airport hotels without these beach front options. Your choice: Beach or airport?", "Date": "September 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Austin, TX", "Title": "“Nice hotel on the beach”", "Author": "tah4349", "ReviewID": "UR15220686", "Content": "We stayed at the Aran Blu on a very chilly, windy, stormy night in March 2008. It's a very modern, clean hotel right on the beach in Ostia. The room was spotlessly clean and offered all the ammenities you'd expect in a hotel. The bed was comfortable, the television got English channels, the bathroom was crazy modern. I liked it a lot. Ostia isn't close to Rome, we had to take a train followed by a bus to get to the hotel. I would not recommend this if you were trying to enjoy the sites of Rome. We stayed here because it was our last night and we wanted to be close to the airport. The airport was only a 10 minute ride away, but as other writers warn, the taxi ride cost 35 Euros. The hotel is directly on the beach. If you're expecting a slick, blue water, white sand Mediterranean beach like you see in the movies, you won't find it. Instead, there's a sweet, very long beach front of sort of rocky, black sand beach. Great for walking up and down, not so good for sunbathing. There is a very long boardwalk filled with shops and a few restaurants. We spent quite a bit of time wandering and window shopping. The staff of the Aran Blu was very nice and professional. They called us a taxi in advance for the next day, and gave us our wake up call right on time at 4:30 in the morning. They all spoke very good English. I'd recommend this if you're looking for a quiet way to top off your holiday in Rome - a little sand, a little surf, a little seafood before heading off to the airport.", "Date": "April 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Washington DC", "Title": "“Great, but know before you go....”", "Author": "brianmclean", "ReviewID": "UR10090675", "Content": "I choose this hotel for our last night in Rome before flying back the next AM. It is close to the airport and it is on the ocean so I thought it would be a perfect choice. First a note: To get to the Airport you have to take a Taxi which costs between $28 and $40 euro...so you have to take this into consideration when looking at the cost of the room. To get to this hotel we took a metro from rome to Lido North stop and then took a taxi to the hotel. As the below reviewer mentioned it is not a beautiful area of town, but I would not call it a dump and I did not feel unsafe. The area right to the north of the hotel has a nice lounge/bar and a few nice restaurants, a couple of wine bars and some stores...I thought it was a very nice area (we ate a steak house there that was very good). The hotel was very nice, excellent bathrooms, nice rooms, our room (like most I think) had a balcony overlooking the ocean and the marina and we had a very nice bottle of wine on our balcony with a nice sunset over the ocean. The common areas were also clean and modern. The AM breakfast was adequate and the staff we very helpful. All in all If you realize that the ride to the airport is expensive I think this is a good choice for a last night outside of rome on the ocean.", "Date": "October 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "New Jersey", "Title": "“Beware!”", "Author": "rimma1924", "ReviewID": "UR10015973", "Content": "We staid at Aran Blu Hotel our last night in Italy before taking a morning flight to US. We thought it would be nice to spend last night on the beach and close to the airport. We were wrong. This town is a DUMP! While we were driving around searching for our hotel we were horrified! It is an extremely run down town all in ruins (not the Roman ruins of course). However, the hotel itself is nice. Beautiful modern décor. Nice rooms, beautiful bathrooms. Really beautiful. But again, the surroundings are a dump. There is no restaurant at the hotel. So you have to go out to eat. The only place to go is to the right from the hotel to marina, where they have a couple of restaurants. Don’t go to the left! That neighborhood is awful! The restaurants are more than a mile away and not good either. The beach is awful! They say they have their own beach - this is not true! They have a tiny little spot on a public beach where they will put a chair for you. This public beach is small, very small, and very dirty. You can’t go into the water, since huge rocks are everywhere. I saw an airline crew coming to the beach and jumping into the water recklessly. Some of them came out covered with blood all scratched by those rocks in the shallow waters. There is no way to get to deeper waters because of huge rocks surrounding the entire beach 50 yards into the sea. I would have stayed in Rome for the last night if I knew. But again, the hotel is wonderful. If only it was located in a better place!", "Date": "September 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SF Bay Area", "Title": "“Highly recommended”", "Author": "glburn", "ReviewID": "UR10004829", "Content": "Modern hotel, located right on the beach front and only 20 minutes from the airport. Nice sized rooms are tastfully furnished, with very comfortable bed, room safe and great bathroom. Excellent breakfast and very nice staff. No extra charge for parking. Only negative is the lack of a restaurant in the hotel. However, there are a number of good restaurants within easy walking distance. Good value and highly recommended.", "Date": "September 25, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Warton, United Kingdom", "Title": "“Average”", "Author": "Pelikan", "ReviewID": "UR7390571", "Content": "This is not a 4 star hotel despite its claims. In itself the hotel is fine, clean and contemporary. Rooms are comfortable, and the seaview is worth paying for should you stay here. Leaving the patio door open allowed the noise of the lapping sea into the room, very soothing. Breakfast - how dare they charge 180 eur/night and serve tinned fruit salad? In a land blessed with such fresh and plentiful produce? Location: As stated elsewhere, this is not a 'happening' place, certainly not in mid April when I stayed. The beach is a disagrace - over-flowing bins left umeptied for days, the sand is full of cigarette butts. The surrounding neighbourhood is delapidated and not inviting. Graffitti, trash, weeds, empty flower beds, drab appartment buildings sum up the area. Summary - not worth it, and miles (and 100 euro taxi ride) from Rome.", "Date": "April 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "chicago, il", "Title": "“Be careful”", "Author": "petloverinchicago", "ReviewID": "UR5807333", "Content": "We were promised a seaview room when I booked it, but was told by hotel staff that if I wanted a view it would be an additional 100 Euro's. After having been ripped off by a taxi driver on the way there- I declined and kept the room with the view of the apartments in touching distance. Also, there is no free shuttle to the airport--as I was also led to believe- they were happy to arrange transport for 40 Euro's. Nice place, but after ten days of \"watching my back\" and trying not to get robbed in Italy (with a couple of near misses), I was happy to leave.", "Date": "September 16, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fairfield, Ohio", "Title": "“Close to airport but far away from Rome Central”", "Author": "Belasaria", "ReviewID": "UR5777965", "Content": "I stayed at the Aran Blu for two nights, since I was only in Rome for 2 days (site visit for upcoming conference). I usually stay in the conference hotel but since it was my first trip outside the US in 15 years and I had a 7 a.m. flight out the next morning, I opted to stay at the hotel close to the airport. The hotel is modern, with nice marble touches for the headboard and the frosted glass panes for the minibar, closet, bathroom and door to the spacious patio. The king-sized bed was actually two twins and was without a fitted sheet. The bed was low but had two nice bendable reading lamps. The room itself was very small since the bed took up a lot of the space. There was no room to open up the suitcase and the closet was not floor to ceiling, rather up on the wall and included a safe inside. The room had central air, which was a welcome relief after a hot, humid day. The bathroom had nice slate tile, a toilet, bidet, deep tub with \"rainfall\" showerhead and also a handheld wand. There wasn't a curtain, rather thick glass that came only a third from the wall to the tub. The sink was nice and the hairdryer was powerful for being so small. The front desk was helpful, even with the computer down and being unable to locate my reservation. Their English was good (thankfully!) and they were patient with me since my Italian is very pedestrian. COMPLAINTS: It took me a while to figure out how to turn everything on. There was a fusebox in the room and the set for the lights and the TV (but not the AC or phone) was in the off position. You need to use your keycard to activate the \"do not disturb\" light on the door, which I didn't figure out until after the maid knocked on my door at 10 a.m. (I was recovering from jet lag). Even after I activated the 'dnd' sign, it only lasted for about 2 hours. Internet access? Well, it would have been nice if there had been a sign on how to access it. It wasn't until I pulled away the nightstand that I found a LAN plug, but I didn't have my cable with me. I asked the front desk for one and was told that the hotel doesn't provide it. Taxis. Well, once you're there, you're there. It costs about 40 EURO to the Fuimicino airport without a tip and my taxi to central Rome was almost 70 EUROS. This is not the place to stay if you plan on doing any sightseeing. Taxis are nonexistant, so you have to have the hotel call one for you. If you have an early flight (as in 7 a.m.), you MUST book your taxi the day before. I was fortunate in that they were able to get a cab to pick me up so early on less than 8 hours notice. \"Free Shuttle\". My travel agent talked about this as being a bonus, and after reading the reviews here, I was expecting some difficulty. What surprised me was that the shuttle was NOT to the airport, but to the train station! I didn't eat at the restaurant or have breakfast there. However, there are several small shops in the turisto porto (including McDonalds) that is to the right of the hotel. For more formal dining, there are two restaurants on the oceanfront that are about a 10-15 minute walk from the hotel. I don't recommend this for the solo traveller or someone with more than 1 day in Rome. This is a \"last stop\" for someone needs to get to the airport early and doesn't want too many traffic problems. Sure, the beach is nice and the hotel faces the Mediterranean, but the area is a little rough in places.", "Date": "September 7, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sussex", "Title": "“A good hotel with lots of potential”", "Author": "Keep_it_simple_simon", "ReviewID": "UR5626643", "Content": "We stayed at the hotel from 13/8/6 to 18/8/6 This is a new crisp and stylish hotel with loads of potential. It is adjacent to the newly built marina and about a mile away from the central area of lido de Ostia. Once the beach area is complete (the promenade planting and lighting isn't quite finished) this will benefit from its position between the two. The rooms are basically as good as the photos on the internet. They are clean and stylish and everything that we needed worked (can't vouch for the internet as we didn't need it). The hotel is situated in a residential area and in our opinion this is a benefit as you actually see how the local residents live their lives. The promenade is always busy throughout the evening with families walking and enjoying the seafront. I always find this a reassuring friendly feel about a holiday (lido de jesilo had a similar feel). Being closer to the sea was more refreshing with sea breezes to keep things a little cooler. Rome is only 30 mins away by metro - a 75 minute metro/bus ticket costs just 1 euro and is fantastic value. You can pick the number 1 bus up from the back of the hotel which takes you to the metro station Lido Central or walk the 1.5 miles to the metro station if you're feeling a little more energetic. The Central lido area has a few restaurants and bars. Our favorite was called \"Eat and Go\". The Marina has a few too but as it is still up and coming the choice there is a little limited. The continental breakfast was fine and made a welcome change from the full english. We were there before 9.30 most days so previous comments from other reviews about no clear tables weren't really a problem to us although we did see a bit of a rush from other guests towards the end of the session for the last few clear tables. The solarium and Gym were open throughout our stay but the roof terrace bar was not open too often however I'm not sure that the hotel was fully booked all of the time were there. There was also a variety of guests of all nationalities which indicates a broad appeal. The staff on reception were polite and courteous. Some of course had better local knowledge of the area then others and helped us find the best ways to get about. The plus points of this hotel are; New clean, stylish rooms Good rate Good location for the Marina Good potential (if rates stay good) perhaps some partnership opportunities with local authority! Large beds comfortable beds Good location for Rome (if you dont want to stay in Rome) and still want some beach. Good chance to see the real side of Italy Area's for development; Could expand restaurant facilities which at present are limited especially as nearby facilities are up and coming and a \"niche\" could be found, Provide more written information to promote the area e.g places to visit, things to see etc and in variety of languages More staff in the restaurant to cater for the late breakfast rush. Our overall rating 4 Star for style comfort 3 star for facilities/staff Would I recommend this hotel to other travellers? - DEFINATELY YES. Would I stay there again? - with the whole world to explore.......", "Date": "August 19, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Paris", "Title": "“Amazing Hotel in Rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR5374834", "Content": "I searched many 4 stars hotel along Roma and I must say that this four-star hotel is worth spending some more money because it gives you a marvellous overlook on the beach and the sea, the staff at the reception and the maids are very polite and it is also very well connected to Leonardo Da Vinci international airport. The rooms are very comfortable and clean with a very nice flat tv inside. The breakfast is very good and very beautiful is the bar where you can get it. If you do not get up too late, you can enjoy a very good Italian breakfast with capucino and corneti. There is also a shuttle service that takes you to Ostia Metro railway station, very well connected with the historical centre of Rome and a gym room up to the 5th floor where you can make exercise with a fantastic overlook. I think that, unless you are a VIP, this is a very well-equipped hotel !!!!! Julie", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Tampa Fl", "Title": "“Be Aware”", "Author": "A TripAdvisor Member", "ReviewID": "UR5351418", "Content": "Positives: - Nicely furnished - Modern looking room - Not a bad price - Easy check in and check out - Port area has some shopping Negatives - Noisy residential neighborhood - Far from Rome about 50 Euros to get into Rome - Incrediably dirty room - stains on floors, mildew smell, bed cover had cigarette burns and bodily fluid stains , hair on sheets, uncleaned toliet with urine in it (all this was noticed upon my arrival into the room) Housekeeping did correct it within 20 minutes, but by that time I was already disgusted. - Breakfast - minimal selction, bowls and cups were filthy Overall, I could not honestly recomend this hotel.", "Date": "June 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Not worthy of a 4 star rating”", "Author": "A TripAdvisor Member", "ReviewID": "UR5317451", "Content": "This hotel was nice but if it's 4 star quality you are after this is not the place, its more like 2-3 star, nice comfortable clean room but service not up to scratch...they ran out of breakfast items, we couldn't get room service, never clean tables or plates/bowls/cups etc at breakfast time...keep your expectations low and you won't be disappointed", "Date": "June 7, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "sverige", "Title": "“tiny and relaxing hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5292031", "Content": "Tiny and relaxing hotel near the beach !!! We are a couple of young parents coming from Northern Europe and we recently chose this little but well-equipped four star hotel. This hotel was very clean inside with large rooms and very good breakfast in the morning. We enjoyed a good number of facilities like the gym . the shuttle service has never been available during the whole week it is available only for Ostia Lido central metro station. Anyway you can get a taxi for the airport as it is only 20 minutes away. This hotel really is a good choice,", "Date": "June 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Tølløse (Danmark)", "Title": "“beautiful hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5226717", "Content": "We chose this four-star hotel because it’s clean, nice and very near to two important places: the airport and the sea. Not every hotel has this peculiarities. Since we arrived, the welcoming staff at the reception was very friendly and professional. As we were tired from the flight we had a nap. The room was clean with towels, a hair–dryer and a flat screen –TV. Then we went downstairs and had quick drink at the bar before going out and enjoy a wonderful view on the sea. The following morning we could enjoy American breakfast with orange-juice, scrambled eggs and some toasts. There is a shuttle service that leads you to Ostia Lido central station from where you can take the metro and you are in Rome in less than 30 minutes. On our way back home, due to a taxi strike we asked the shuttle service driver to take us to Fiumicino airport and he gently drove us to catch our flight in time. We really recommend this hotel to everyone if you wish to enjoy some relax, the sea, a close airport. Maria Johnsen", "Date": "May 24, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "US", "Title": "“Don't stay here”", "Author": "tjcdjc", "ReviewID": "UR5204423", "Content": "Rooms dirty, Beach dirty, no ammenites, train shuttle not reliable, told us they had complimentary shuttle to airport but morning of flight said was too early and we would have to pay 40 Euros for a 10 minute ride! DO NOT STAY HERE! Huge ripoff.", "Date": "May 23, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Richmond, VA", "Title": "“Never again, thankfully”", "Author": "Patricialayne", "ReviewID": "UR5078853", "Content": "We stayed at the Aran Blu Hotel April 26 through May 5, 2006, and after the second day, I was wishing I was back home in Richmond, VA! We arrived early, exhausted after flying, and was told we’d have to wait ‘til check-in time. We left our luggage, walked around the little harbor, grabbed lunch, sat and watched the boats, and walked back to the hotel hoping they’d let us in early...nope. Finally got in the room and unpacked and went back downstairs to the restaurant for dinner and everything I requested the waiter shock his head “no.” I finally just ordered a mixed drink. The waiter arrived with our drinks and said he had tuna fish. At that point, I would’ve taken dry toast. I’m not sure if it was because I was starving, but the tuna fish turned out to be pretty good. I found it odd that every morning we had to clear our own table before we could eat breakfast; although the waiter was quick to ask if we would like a cappuccino. I’m thinking if they had more than “the” waiter, service would’ve been a lot better. Several days our room was clean when we returned, but we didn’t receive clean towels. I learned quick to re-hang my towel just in case. The “ocean front” was very disappointing to me, but then again, I’m used to Virginia Beach’s beautiful tons of white sand and ocean water. Their beach was being renovated; bulldozers, trash on the beach, etc. (Oh, yea, I THOUGHT I was getting an ocean front room and ended up looking at the neighbor that lived behind the hotel that lived at the same height as I; very friendly, she’d wave.) The shuttle to the bus station was nice, but we quickly realized it was easier to just walk to the back of the hotel and catch the bus. We purchased the five-day Metro pass which entitled us to ride the trains and buses and not once in all our travels to and around Rome got carded. There’s a restaurant down at the harbor, Porto Roma, I believe, VERY good steak for $22 euros. DO NOT take the horse buggy ride in Rome at the Colosseum unless you’re willing to shell out $200 euros (at the time I was exhausted and just wanted some good old American food at Hard Rock Café.)", "Date": "May 16, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Dover, Delaware", "Title": "“Horrible hotel”", "Author": "beachbumm09391", "ReviewID": "UR5049300", "Content": "This hotel does not do customer service at all. The things they boasted about online is not what they have, internet service, in house restraunt, bar. We were there for 9 days and EVERYDAY something else went wrong, from no towels in the rooms, to no toilet paper, card key did not work, no corkscrew to open a bottle of wine. The terrace and gym they boast about on line is locked and you cannot access it. The closest thing to a meal that you can get from the restraunt was ham and cheese sandwich. The shuttle only operates during the day, so if you return from Rome after 4:30pm you are on your own to find your own way back. Which is ok if I was not lead to believe otherwise. Contintial breakfast is a disaster too. They do not clear the tables off so someone else can sit down. We ordered a bottle of wine from their bar, they looked for 45 min for a cork screw and could not find one, and did not even bother to call our room to tell us. This was just a horrible place to stay. We tried to talk to the manager for 3 days in a row, and we were treated like they did not need our business in the first place.", "Date": "May 11, 2006"}], "HotelInfo": {"Name": "Barcelo Aran Blu", "HotelURL": "/ShowUserReviews-g187791-d601703-Reviews-Barcelo_Aran_Blu-Rome_Lazio.html", "Price": "$80 - $170*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Lungomare Duca Abruzzi 72</span>, <span class=\"locality\"><span property=\"v:postal-code\">00121</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "601703", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fa/36/fa366ade84ae16a715365d7042efac9a5large.jpg"}}