{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“Really fab!”", "Author": "Maxes6365", "ReviewID": "UR127465421", "Content": "Ignore any negative reviews, this really is an excellent place to stay in Berlin. My husband and I and our 13 year old son were allocated apartment 301, which suited us perfectly. There was a decent sized sofa bed which was fine for our son, and a really comfortable double bed for my husband and I. The apartment was split into two halves separated by double doors, which was really handy and better than we expected having booked a senor 'studio'. The kitchen was well equipped, including a decent sized oven (great for a quick meal of pizzas purchased from nearby supermarket Rewe). There was a full-sized bath in the bathroom which was lovely for a soak after a long days' sightseeing. The apartment was absolutely spotless on arrival. The reception staff were friendly and helpful, and when we mentioned that the kettle in our apartment had an intermittent fault it was replaced immediately. U bahn is so close you can literally see the station from the reception building. Only a 10 minute walk from Alexanderplatz. Great value for money and would definitely return if we ever go back to Berlin. Highly recommended.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bonn", "Title": "“Felt like I lived there”", "Author": "Holdenute", "ReviewID": "UR125952590", "Content": "Well positioned suburb a short walk from Alexander Platz. One bed apartment with well equipped kitchen and local shops close by. Felt like we were local! Deli downstairs did super breakfast, great quality, simple food and reasonably priced. Would stay again next time.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Clean, very good located apartment with all you need to have a good citytrip.”", "Author": "Metaxos", "ReviewID": "UR125937515", "Content": "We staied there for two nights with our 1.5 year old son and it was great. We know Berlin very well and the location is very good. Alexanderplatz is in footwalk distance, the nice quarters of east Berlin are very near, nice restaurants, shops etc. The rooms are big, clean and very well equipped. People are helpful and you can get a good breakfast inhouse.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Wir war Berliner :)”", "Author": "Marieke B", "ReviewID": "UR125903857", "Content": "The apartment's close to really nice area Prenzlauer Berg and most of the hotspots. Close to the apartment are nice bars and an Italian who makes excellent pizza's (forgot the name). We used bicycles of Schoenhouse, which is a fantastic way to explore Berlin. We went to areas we'd never been to. The staff wasn't really used to people who wanted to cycle with their kids I think, but with a little help of us everything worked out fine. It was great staying at an apartment instead of a hotel. It felt a bit like home. We were here with an almost 1 & almost 4 year old. They felt like home too, which made this (of course together with 1 of our favourite cities) a really relaxed city trip. Definitely well worth the money, lots of space in the apartment, clean, great equipment.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“perfect place for people who are convinced about the advantages of apartments (instead of hotel)”", "Author": "ceciledt", "ReviewID": "UR124562480", "Content": "We stayed in Schoenhouse for 2 nights with 2 teenagers. Despite the cold, the appartment was very well heated. As said in other reviews, the location is great, walking distance to Alexandersplatz and also all sorts of eclectic shops around. Food shopping could not be easier - there is a Bio Market in front of the building which sells everything you need including a delicious bread. Breakfast at the hotel is good value for money. The transport from the airport worked very well and our driver gave us a lot of very useful information about transport pass, locations to visit...There is plenty of space and the kitchen is well equipped for 4. We asked for a DVD player and had it in our room when we came back. I would definitely recommend this place to friends. Areas for improvement : sofa bed in living room too small for 2 adults - would add a bean bag or an armchair in the living room", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good but not excellent”", "Author": "boris_sto", "ReviewID": "UR124333926", "Content": "Hotel is situated in 2 minutes from Rosa Luxemborg Platz u-banh station and 10 minutes from Alexanderplatz. Staff is friendly. Rooms are spacy and clean (but cleaning aren't made everyday). It was cold in the room (but outside temperature was -10C). Breakfast is small and it is to have breakfast in one of the caffees situated nearby. Supermarket Rewe is in 5 minutes away from hotel. We used groupon coupons and the price was good, but without 50% discount it seems the price for the apartment is too high.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Manhattan, NYC", "Title": "“Stay somewhere else ... maybe Amano, Lux 11 or Weinmeister....”", "Author": "boaviagemnyc", "ReviewID": "UR123313286", "Content": "We stayed recently at Schoenhouse (week of January 1st) and were on the whole very disappointed. We had high expectations given the very favorable Tripadvisor ranking, other reviews online and direct feedback from friends we trust. The hotel was \"fine,\" but by no means recommended for a first time stay in Berlin (or even a second or third.... ) There are far more interesting and pretty design-type hotels. Once I saw Amano on the second day .... closeby also in Mitte .... I knew we should have stayed there... and it's pretty much the same price! Horrible feeling. Also, Lux 11 and Weinmeister were at the top of our list .. and unfortunately, the higher Trip Advisor ranking made Schoenhouse win out. The lesson here? Go with your gut feeling and not just the numbers. Yes, this is true apartment-style living but there's probably better apartments via VRBO.com or Air BnB if that's the route you want to go. Berlin is REALLY spread out so know before you go .... and why not stay in a hotel if it's pretty much the same price? The room.... While large, it smelled like a one big ashtray ... we were invited to move one day later into another room .. .which was a nice offer but a pain. This is not an uptight American complaining about a smoking smell but rather .... the smell hit you over the head as soon as you walked into the room. We did move rooms for the subsequent nights, but we heard A LOT of noise in the rooms above (hardwood floors so the noise really carries) We are not early people - we are talking noise at 12am, 1am, 2am..... Normally, in a hotel ... you could complain to the front desk .. but after hours - there's no one to call..... and it's not really feasible to have to deal with the issue directly with the other guests... Hey, it's their holiday too. The room was clean when we arrived (*there's no maid service throughout and I never did figure out how I would have called someone after hours*) and the bed and sheets were also fine but not great..... The towels were really small and thin but that's more of a minor comment..... The whole room's vibe was drab and tattered ... it was probably nice about 5 years ago ... but definitely a little worn now. Having traveled extensively in South America in the mid 90s when I was in college, it reminded me of one of those cost-effective utilitarian pensiones/guesthouses. The staff was friendly and efficient ... but always seemingly in a rush. I'd look into another hotel.... read up as there seems to be a lot of new hotels in the city..... it will be a much more enjoyable, unique and comfortable stay. I even checked out Amano (just to torture myself maybe?) and the staff seemed friendly and the vibe very cool. I probably should have tried to move hotels but we had been traveling for the week prior in Paris so weren't up for another move... We also had to pay in full (is this normal?) so sort of expected that there wouldn't have been a very friendly return policy. Do yourself a favor... enjoy all Berlin has to offer and stay in another place.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Rotterdam", "Title": "“Great apartments for a reasonible price.”", "Author": "elsterno", "ReviewID": "UR122610687", "Content": "These apartments are located on the border of Prenzlauerberg and Mitte near the great alte Schonhausser Allee. The apartments are big (we had a junior), clean and have nice interiors. In the entrance of apartments there is a nice little shop with cheap and good breakfast.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Great location and welcoming atmosphere”", "Author": "juneflyAmsterdam", "ReviewID": "UR121957879", "Content": "These apartments are perfectly located between Mitte and Prenzlauer Berg, and the building sports apartments of different sizes. We stayedin the senior apartment, whcih comes with a kitchen and a dinnertabel, and has a nicebalcony overlooking the inner courtyard. Wooden floors and cabinets createawelcoming atmosphere. The only downside to all this wood was that the underside of the table and the plank in the wardrobehas quiteafew invisible splinters that ruined my sweater. During our stay we felt very safe and enjoyed a quiet sleep. Staff is friendly and efficient, from the swift check in to the call for a taxi at the end of our stay. They very kindly let us check out a bit later than usual. Downstairs is a small deli for take away sandwiches, and a selection of winesand snacks. This is a place we would happily return to for a longer stay.Our onlypoint of criticism is their towel change policy. The room was spotlessly clean, and a small towel and one large towel per person was provided. But after two days when our towels had not been changed we asked for fresh ones. The reply was puzzling: a fournight stay did not merit a towel change! Also the room wasnot cleaned at all during our stay. New towels were sentup to our room anyway, but we were surprised to find that they had left the used ones. A minor flaw in an otherwise perfect stay.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Orange, Australia", "Title": "“Great one night stay with family”", "Author": "Steve H", "ReviewID": "UR121815103", "Content": "Only stayed one night in the family room 9 but it was good.the location was convenient for u Bahn and all the sites. Breakfast of a roll, cheese and meat, and coffee was good value too at 4 euros. Would stay again, but longer..", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“Clean, comfortable and convenient city living”", "Author": "KeithVA", "ReviewID": "UR121028458", "Content": "We stayed 4 nights in the Schoenhouse Apartments in Prenzlauer Berg (see http://www.schoenhouse.de/). We had the 2-bedroom/1 bath Deluxe apartment. It was on the 3rd floor with no elevator. They helped us get the bags up to the apartment upon arrival, but even without the luggage, the 4 flights were a good, steep walk. The apartment was very comfortable. My wife and I slept in a nice, roomy bedroom. The second bedroom was a bit smaller, but it worked just find for my mother-in-law. We had good water pressure and plenty of hot water in the bathroom. The living room was on the small side but we hardly spent any time there. The kitchen was big and reasonably well-equipped. It had a balcony. I liked the area. Prenzlauer Berg was a working class neighborhood in East Berlin that is now more upscale. Sort of like Greenwich Village. The building was very close to a U-bahn station and easy walking distance to the Alexanderplatz. There is a bakery 2 doors down, a couple of grocery stores nearby, and a few restaurants. There was a lot of bicycle traffic on Schönhauser Allee at all hours, but I didn’t find it noisy. We were there in August and it was warm enough that we needed to have the windows open, but it didn’t really affect my sleep. I did wake one night and went to the bathroom around 4am and there were people sitting at the tables outside the open restaurant across the street drinking beer. Much like New York, the city never sleeps.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Great Stay”", "Author": "Alex C", "ReviewID": "UR120869850", "Content": "Overal really happy with this appartment. Lots of room, clean comfortable beds, helpful staff and free Wi-Fi. The Deli in the lobby is also Brilliant! Anyone visiting must try it!!! We also used the shuttle bus to the airport supplyed by the hotel and the driver was brilliant, cases were packed for us and was very freindly and attentive. Would definatly stay here again.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Perfect location for a city break”", "Author": "Nealy68", "ReviewID": "UR119788585", "Content": "I stayed in a senior apartment with my grown up son for one night and we were very impressed. The apartment was clean and spacious, with a modern airy design. The location was perfect, just on the edge of Mitte and within walking distance of the ubahn at Rosa Luxenburg Platz. We found we could walk to the centre easily and the area was very non-threatening. Although the apartments are on a fairly busy road, ours was very quiet because it faced a central courtyard. You can get breakfast at the apartments or from one of the many cafes in the area. The staff were friendly and helpful.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect apartment massive could live in it if wanted”", "Author": "Akidd007", "ReviewID": "UR119752929", "Content": "Next to the u easy access from airport just get the s9 line then the U2 line. Staff really helpful and apartment got kitchen fully equipped even with sugar, salt and pepper, kitchen roll filter papers for the coffee maker, we asked for an iron and board no problem left it with us for whole stay. Location is great 1 min to the metro you can see the tv tower and not far walk either lots of restaurants and bars near by we found one 2 min walk happy hour 7-9 only 3 euros knockout. When we come to Berlin again not if but when as magic city we staying here. Even though we did not use deli food smelled amazing but bio supermarket over road so can fill fridge up as well highly recommend if you like your own space instead of a cramped hotel room.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Strategically located!”", "Author": "sfy8", "ReviewID": "UR118700206", "Content": "We stayed in a 2 room duplex apartment. Fully equipped with kitchenette so can cook. + very well located - really near to subway/metro + very worth every penny - has been the cheapest place that we stayed during our europe tour compared to milan, venice, rome and madrid. + very clean. Absolutely will stay herevagain in future!!", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Great location, charming flats”", "Author": "GlennieA", "ReviewID": "UR118373877", "Content": "We stayed here for a family trip, six adults and three kids. My husband and I and our 15 months old son stayed in the Deluxe Apartment, which was fantastic - very good value for money!. Very nice deli in the hotel lobby, great for breakfast and light lunch/dinner plus a decent selection of wine/beer etc. The staff are very helpful. The location is great, very nice shopping area and cool restaurants - we recommend Monsieur Wong down the street for lovely Vietnamese food (also as takeout which was a good option with three kids).", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“We always stay here- we love it!”", "Author": "citycrush", "ReviewID": "UR118099726", "Content": "My husband and I have stayed at these apartments for the last 3 times we have visited Berlin. We have stayed in the dead of winter and also the height of summer and have been very impressed each time. The apartments are clean, well appointed and warm/ sufficiently cool depending on the season. The balcony with the apartments we have had has been lovely. The apartments have microwave, TV, fridge, coffee maker and cooking implements so you can cook for yourselves to help spread the budget! The apartments are in a great location, very close to the metro so can get anywhere in the city. The nearby restaurants, shops and supermarkets are all really nice. Staff are really friendly and helpful and the deli in the apartment block is also great to have on hand for breakfast/ snacks.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“good neighborhood and clean”", "Author": "aaangha", "ReviewID": "UR118048589", "Content": "It’s a very clean apartment in a good neighborhood. Walking distance to the metro station and nice restaurants, bars, and art galleries. Very helpful staff. It’s good value for the price. We enjoyed our stay , the unit had a small kitchen that we didn’t use. With all the good food around, you didn’t need that.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Incredibly central location. Great well equipped flats. Comfy beds.”", "Author": "Camilama", "ReviewID": "UR117661043", "Content": "Schönhauser Apt. is perfectly situated in the old East part of Berlin. In a lively street wiht lots of interesting shops, a good and cheap supermarket (REWE), organic produce, bakery, and lots of nice (Flescherei) and crappy (White Trash Fast Food) just acrosse the street. U-Bahn and tram within 1 minutes walking distance. 10 minutes from Alexander platz. The apartments are very well equipped, somebody's really thought about what you might need in the kitchen. A real treat! And if you shoul need anyting the staff is quick and helpful to provide it for you. The cafée offers delicious food at a very fair price - and the staff is sweet and smiling. I can warmly recommend this place. I've stayed there twice, and will definately come back. So warm and friendly and makes you feel very welcome. Only complaint: the stair to the junior studio apartments are a killer!", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Very nice accomodation”", "Author": "HBFFtraveler", "ReviewID": "UR117587037", "Content": "Price was great, apartment was beautiful and clean. Had a nice little kitchenette with all essential items. However it was confusing to find the entrance after hours. It was fairly convenient. Internet did not work even though we followed the instructions.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great Stay”", "Author": "Timbo9", "ReviewID": "UR116043283", "Content": "For a teenage family trip to Berlin, Schoenhouse Apartments was perfect. We had plenty of space and a courtyard garden that made it really relaxing. Despite it being a busy area, the apartments were really quiet. The fittings and furnishings were all modern and stylish. The location is very accessible to the U Barn and while a little outside the main city, the whole precinct is very lively and interesting with plenty of choices for eating and entertainment.", "Date": "July 31, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cape Coral", "Title": "“Perfect for stay in Berlin”", "Author": "123stitch", "ReviewID": "UR115889224", "Content": "After quite a bit of research, we decided on the Schoenhouse apartments instead of booking a hotel and were very pleased. Very spacious, modern, comfortable, and exceptionally clean, with a 5 minute walk to the nearest subway station. A supermarket is located just up the street, and the Alexanderplatz is only 10 min away by foot. It was a perfect spot to start our exploration of Berlin, where I had not been since 1989. We stayed three nights and thoroughly enjoyed the apartment and this amazing city.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great space for family of 4 and perfect location”", "Author": "AnjiG", "ReviewID": "UR115286962", "Content": "My family stayed here 3 nights in June. Kitchen and spare bed in one room, with another double bedroom helped give everyone plenty of space. The staff was great - everything from the airport shuttle, travel guidance, laundry service and breakfast. Location: 3 minute walk to the metro, restaurants and shopping abundant, couldn't be better. Definitely recommend and would stay here again.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "LONDON", "Title": "“WE LOVE BERLIN! WE LOVE SCHOENHOUSE!”", "Author": "SOLIDSTATE", "ReviewID": "UR115185735", "Content": "Pure and simple you cannot go wrong. Clean, new and well located, these apartments are a no-brainer. There is also a good breakfast area with really good food and a small fridge with beer and so on. Very well run and it's booked quickly so get reserving.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Just perfect for Berlin base”", "Author": "rustycat83", "ReviewID": "UR114210871", "Content": "My family and I stayed for three nights in July 2010. We absolutely loved the apartment. Wonderful layout for two adults and two teens. The furniture and beds were comfortable with loft styling. Kitchen was clean and had all the basic amenities. We particularly enjoyed the balconies overlooking the small, but beautiful and tranquill courtyard. The small restaurant in the lobby was very convenient and also a real treat. The breakfast and coffee were great along with the fresh takeout sandwiches, muesli, etc. The staff was friendly and helpful. The location in former east berlin is in a hip and trendy neighborhood with many fantastic restaurants, but is also close to the center of the town. I highly recommend renting bikes for transportation to experience Berlin up close. We rented four bikes from the hotel at very low cost for the duration of our stay and utilized them to travel all over the city. The bikes come with locks, helmets, and nice baskets for carrying your purses, cameras, drinks, purchases, etc. The hotel also has a limited number of parking spots in a garage across the street. Be sure to book these early with your reservation. We did not and the spots were sold out. That said, the hotel staff told us several local streets where we were able to find free parking after a few minutes of search. I highly recommend the Schoenhaus Apartments and look forward to staying there again on our next trip to Berlin. This is a real bargain for families.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Norway", "Title": "“Loved it! Location, standard.”", "Author": "TPost", "ReviewID": "UR113592050", "Content": "Spacious apartment, plenty of room for me, missus and our 2-year-old. We spent a week in Berlin, and this proved a great place to stay. Close to Prenzlauer Berg, close to the Mitte, close to the subway, close to huge playground for our kid.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect!”", "Author": "avs1029", "ReviewID": "UR110001283", "Content": "We just left the Schoenhouse Apartments in Berlin and it was a wonderful stay. The shuttle picked us up as scheduled and was very easy to find. The driver was friendly and really knew his way around. We were excited to have him drive us back to the airport at the end of our stay. We stayed in a Senior II apartment and it was perfect. The size was just fine for 4 adults. The building was beautiful with hard wood floors and huge windows facing out into the street. We walked just up the street a bit and bought groceries for breakfast each day but we also enjoyed the cafe in the lobby as well. The beds were comfortable and the furniture new and modern. Not a speck of dirt anywhere. The location couldn't be better. There are great local shops and restaurants just down the street and also near hackescher market which is in walking distance. We took the tram and subway mostly but you really can walk to most things. We can't wait to go back and stay there again!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Half Moon Bay, California", "Title": "“Recommended - Good price for stay”", "Author": "trishthetreehugger", "ReviewID": "UR104626675", "Content": "Thank you trip advisor travelers who recommended this hotel. I stayed three nights in April 2011 for a vacation in Germany. East Berlin is the new place to be while staying there. Rick Steve's recommended east Berlin, and trip advisor travelers recommend this hotel. I have to completely agree. The room was a large loft style room with a small kitchen that would allow you to have coffee, eggs, toast. Not equipped for large meals, but we bought a few groceries and had breakfast in the room. The bathroom was large and comfortable. Nice strong, hot shower. Towel warmer too. Centrally located, excellent front counter service. The employees were very, very nice. The front counter closes at 8p.m. and one night I accidentally locked myself out of the hotel room. There is an emergency phone number on the front door of the hotel, We called and in about 10 minutes somebody let us in. They have bikes you can rent, which we did. Only 10 euro's for the day, which is less expensive than other places. Metro is 5 minute walk... As you leave the hotel, turn left and there is a grocery store a block up the street on the right hand side. Also, there is a pizza place two blocks up that is very, very popular. It is called Forni (sp?)...ask the front desk. I forget the exact spelling of the name. There was a line out the door for this very live, festive pizza place. Overall, It was an excellent stay at a good value price. I recommend Schoenhouse Apartments.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice staff, stiff rooms”", "Author": "Peligrande", "ReviewID": "UR98396436", "Content": "I'm from Sweden, a country known for our slick, white and minimalistic style in interior and architechture. We started IKEA, remember? Schoenhouse Apartments is white and minimalistic in style, but the slickness? I guess you'd have to pay more than 95€ a night for that. The staff was great. Friendly and helpful, with a sense of humor. The cheap pickup at Tegel in time. Late checkout was no problem - although they forgot to mention the extra fee. The location is really really great - just opposite are on of Berlins best rock and indie clubs. One block down hipster restaurants and stores. Three blocks up the little bit ruffer Kastanieen Allée with great vintage shopping and nice small shops and restaurants. One block to the west some of the best bar in this area. The pricing was really modest, we hooked up with some of the nicer rooms since it was so cheap anyway! Bathrooms okay, a big balcony, plenty of space and all that... You can get four guys in a room for less than 25€ per head! It is an apartment hotel, so there was no minibar - but on the other side you didn't have to sneak past the reception with your beer, ashamed that you won't put up with the hotel prices... And since the reception closes fairly early, there is no one complaining if you bring friends in the middle of the night either! Sounds like a great place for spending a weekend with your hipster friends? Well, it would've been great. If it had soul. If you're going for that scandinavian style with the whitened birch furnitures, the all white painted walls, metal/plywood chairs and concrete balconies, then you'd better do it with a sense of design that is 100%. And you'd better tend to the details. Or even better - have some details! Personally I'm not into that kind of design anyway - I'm more the cosy chestefield sofas and green plants kinda man. But I guess a minimalistic and fresh hotelroom is fine. At least it's fresh. But Schoenhouse Apartments. It was empty, cold and depressing. I'd rather go for filthy, gray and chaotic (you are in Berlin, aren't you?) - at least you'd feel alive, rather than in a morgue. Oh, wait. I guess in a morgue you'd get some kind of pillow you could actually sleep on? What I got here was a square meter big cushion, unfortunatly without a 2,5 meter long bed. I had to fold one of bathtowels into a pillow to be able to get some sleep. I gave this a 4 average. I mean, although I'm coming onto it really hard it was still a great staff and location and I can't complain about the price or the cleanliness.. I think I'm just disapointed because they where doing everything so well, but they had to go bad and boring nordic design on it. It's not romantic, or cosy, or charming in any way. It's cold and boring. I would definitely recommend this hotel to all my friends who are cold and boring.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "No Fixed Abode", "Title": "“A Haven from the snow...”", "Author": "nathan_black", "ReviewID": "UR93331061", "Content": "We stayed in our apartment for two nights just after Christmas, arriving just in time for the coldest winter in years! However we found the Schoenhouse Apartments to be a wonderful retreat from the weather. It's location is not that great if you want to do stuff locally, but the U-Bahn is so close that it almost doesn't make a difference. Our apartment was very spacious and warm, with a kitchenette that seemed to have everything you would need. However we never used it, as the deli downstairs was so amazing we ate there when we could. Reasonable prices and excellent service - some of the best pasta I've had in a while!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sheffield, UK", "Title": "“Smart, modern apartment in the former GDR (East Berlin)”", "Author": "evissa", "ReviewID": "UR92808271", "Content": "I stayed in the Shoenhouse Apartments with my 19yr old daughter just before Christmas 2010. The apartments were beautifully warm and well insulated which was a must, given that the weather outside was bitterly cold, snowing with the occasional blizzard! Having said that, the apartments are only about 5 mins walk from the U-bahn (underground) station so you weren't outside in the elements for long. Nearby is a good sized organic supermarket and next to it is another very large supermarket so it's very convenient for shopping as the bigger one was open till midnight. It's also on the same U-bahn line as Potzdammer Platz where the multi-screen cinema shows a huge range of English language movies, all-day, every day so if the weather is terrible, it's really easy to go and watch a movie. You can be there in about 15 mins - it's just so easy with Berlin's terrific public transport system. Although the apartments are in an area which was formerly in the GDR, you'd never really know this as the area has all been smartened up and is very stylish and feels very safe. We loved our stay at the apartment, the beds were comfy, the kitchen is really well equipped and the bedding is snowy white and soft. Lovely bathroom too. Can't fault it at all. Downstairs is a small informal cafe where they do lovely cakes, snacks and breakfasts. You can also have a meal there and it's very reasonable, and the food looked lovely. Having said all this, I don't think I'd visit Berlin again in the winter as it really is very cold indeed and you can't really appreciate the city fully when you're battling through a snow-storm. I'm already planning my next step (for May this time!)", "Date": "January 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“Very good apartments, excellent location”", "Author": "Henk61", "ReviewID": "UR92278068", "Content": "Schoenhouse apartments is the place to go if you want something different than the average three or four star hotel. It is situates in a modernised typical Berliner Hof in Prenzlauer Berg. Excellent location, many restaurants, cafés, small shops in the area. Just a few minites walk to the nearest U-Bahn station. Or if you prefer to walk, 15 minutes to Alexanderplatz. The apartments are spacious and clean, the furniture is Ikea-style but comfortable. Kitchen with all the normal equipment. Free Wifi. The reception is in a small deli restaurant, where you also can have breakfast and lunch. Staff is young, very friendly and of course fluent in English. We will certainly go there again on our next trip to Berlin.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Lovely apartments in great location”", "Author": "fibaroobi3", "ReviewID": "UR88472360", "Content": "On arriving, our taxi driver told us that this location 'doesn't get any better' in Berlin. The apartments are really lovely- light, modern and spacious. We stayed in a family apartments with two bedrooms, which had high vaulted ceilings. The staff were young, friendly and very eager to help with any question or query. They didn't seem to mind at all that our German is totally non-existant. Has a fabulous deli on the ground floor. You can take meals back to your room or eat there. It was difficult to go anywhere else for tea as the pasta they made was really beautiful and very reasonably priced. Apartments are a few metres away from a U-bahn station (1 stop to Alexanderplatz) and also very close to a tram stop. We booked the hotel service to be taken to the airport, which we thought was very reasonable at 25 euros. The only negative I have is that our apartment was on the 4th floor. If you have vertigo like me, the see-through floor of the metal walk-way to get into the apartments from the lift is rather terrifying- however stairs are an option. There is an organic supermarket just across the road and a standard, cheaper supermaket a little bit further up. Lots of small delis and bakeries nearby too. Would definitley stay there again.", "Date": "November 28, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Paris", "Title": "“Fantastic!”", "Author": "peggygravel", "ReviewID": "UR88232228", "Content": "Situated at the limit of Mitte and prenzlauer berg , it's an ideal place to stay while in Berlin. Totally clean , large rooms, QUIET, 5 minutes to rosa luxembourg metro ..no problems at all. I've stayed there twice now and I know I'll stay there again.", "Date": "November 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Recommended - great location and comfortable stay!”", "Author": "myra_gilligan", "ReviewID": "UR86280993", "Content": "Stayed in Berlin for 5 days in the Schoenhouse Apartments (studio for two people). It's a fantastic location, situated 5 mins walk from Rosa Luxemberg Platz Metro station and about 15 -20 mins walk into the Museum Island and the centre of town. Situated in Prenzlauer Berg district, is arty, funky and well worth a wander in it's own right. The apartment itself was very clean, functional and comfortable. It had all the facilities for self catering and there was a cafe downstairs which was always packed with locals, if you wanted sustenance fast! Thoroughly recommend!", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great home away from home”", "Author": "hg_14", "ReviewID": "UR85950103", "Content": "4 of us got one Deluxe room (2 rooms with kitchen) and it was just like a city flat we used to rent in London when we were young - simply/cheaply decorated and furnished in the up coming area with convenience of public transport. Advantages of this place are: Value for money, Spacious room, Deli located at the entrance, Cheap but great places to eat near by Disadvantages of this place are: Less touristic area, No lift - U Bahn station and Apartment, A little uncomfortable sofabed We do not recommend this apartment if you need to use pushchair or require comfort of standard hotel service. Otherwise, it can be recommended to all. As there are many places to eat, it is better not to include Breakfast option at the booking.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Functional and relatively quiet”", "Author": "LuckyPhil13", "ReviewID": "UR81460289", "Content": "We stayed in an apartment in Choriner Str. It was clean and comfortable, with a great balcony that looked into a typical large Berlin courtyard. It did not have a sofa, but had a tables and chairs in the kitchen. It was quiet except for one night (5am) when rowdy guests in another apartment were very noisy. No clean towels or cleaning for the week we stayed. On the upside free internet use at the related Hostel which was close by. Overall, pretty good value for money and an excellent location in Prenzlauer Berg.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Cod, MA", "Title": "“Excellent stay in a fabulous city!”", "Author": "nancelita", "ReviewID": "UR79949530", "Content": "My husband and I stayed at Schoenhouse Apartments for 4 nights in mid-September. We stayed in Apt 404, which is a junior suite. It was very spacious and clean. The kitchen was equipped with pots, pans, dishes, as well as basic things like coffee filters, salt, sugar, and pepper. The apartments are centrally located. It is only a few minutes walk from the Rosa Luxemburg Platz stop on the U2. (I recommend taking advantage of Berlin’s public transportation system. You can buy a day pass, which is good for the S-bahn, U-bahn, trams, and buses.) The neighborhood is quite nice. There are a number of restaurants, grocery stores, and shops within walking distance. In addition, Schoenhouse offers a number of convenient services – complimentary WIFI, a lovely café that serves pasta and yummy sandwiches, full-service laundry, shuttles to the airport, and bicycles that may be rented for 10 euros a day. The staff was wonderful. Everyone we encountered (at both reception and the café) was very friendly, spoke perfect English, and was more than willing to assist us with our questions/requests. On top of this, the price of 75 euros/night is quite reasonable. We intend to make Schoenhouse Apartments our home every time we visit Berlin and we recommend that you do the same!", "Date": "September 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Spacious and well priced”", "Author": "meno69", "ReviewID": "UR79750820", "Content": "Good sized rooms with balcony and kitchenette. Room was spacious and filed with new but cheap Ikea furniture that did the job. Would highly recommend to anybody wanting a well priced apartment close to a train stop in Berlin.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“almost perfect”", "Author": "SOTA_3", "ReviewID": "UR78990411", "Content": "great reception very friendly great location oposite from Rosa Luxemburg metro station ,full of bar-club-restaurants and very safe secure very modern spacius apartment with small cuisine very quiet mini market next door open till late. free fast wifi", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zaragoza, España", "Title": "“Perfect place to stay in Berlin”", "Author": "Javier1954", "ReviewID": "UR77848862", "Content": "We stayed for a week in July (with my wife and son). Very nice and ample apartment, close (1 metro stop) to Alexanderplatz, in a nice part of the city (many coffee shops and restaurants). Very clean and quiet, new (Ikea) furniture. Excellent deli in the same building for breakfast. Very competent and friendly staff in reception, deli and transport to the airport. A perfect place to stay in Berlin.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Excellent”", "Author": "versils", "ReviewID": "UR70277731", "Content": "The environment is nice, location is good. There is a balcony, kitchen is fully ultilized, and it is really big! Everything is clean and tidy, the sofa bed is comfortable, and is really user-friendly, u find everything u need. And it has free internet access! It is the best apartment i have lived during my trip through europe, strongly recommended for the price.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“Great place, friendly staff and superb location”", "Author": "SaskiaNLNetherlands", "ReviewID": "UR70267846", "Content": "My husband and I stayed for 5 nights at Schoenhouse apartments. The room is great, nice and modern decorated, plenty of storing space. Since it was very warm in Berlin, it was great to have a balcony to sit and read after a day of sightseeing, enjoying a cool drink (our room had a kitchenarea with a fridge) of having a coffee in the pretty yard. When we booked this apartment we also booked the transfer from the trainstation, which made it a really comfortable way of arriving. The staff is very friendly and the breakfast in the coffeeshop (not included, but cheap) is also fine. Next time I'm visiting Berlin, I will book here again", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean Spacious Apartment, Great Value”", "Author": "doconner", "ReviewID": "UR66656209", "Content": "Decided to stay here with 2 other friends, after having some difficulty finding cheap accommodations for a group of 3. After reading the reviews here I was optimistic that this would be a good choice, and I wasn't disappointed. The apartment was larger than I was anticipating, clean, and even included a washing machine which was a nice surprise. We had a \"Deluxe Apartment\" which came with a large bedroom, a living room (with a sofa that folded out into a bed), and a kitchen.. The bathroom/shower was off of the bedroom, The only slightly inconvenient thing about the floorplan for our apartment was that the apartment door, and bathroom were both off of the bedroom. Whomever was sleeping in the living room had to walk through the bedroom to get to the bathroom/shower. (could be a problem for some depending on the dynamics of your group). However the beds were comfortable, and it was nice having the kitchen with washing machine. The only other real downside with the apartment was the provided free wifi. In our room, #301, the wifi signal was weak and spotty and varied from no coverage in part of the flat to full coverage in other parts. We had to move around a bit to find spots where we could get coverage. I'd definitely stay here again, as it is just a 2 minute walk to an U-Bahn station, with quick and easy access to many great places to visit.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Perfect!”", "Author": "Cootje68", "ReviewID": "UR64968154", "Content": "A friend of me advised me this apartment and it really is perfect! Location is very good, it is a little bit out of Berlin City Centre but the U-bahn is so close that's no problem at all. Neighbourhood is very friendly and you should really try the cheap curry-wurst breads on Alexander Platz. I had a senior-2 apartment and it was big! Bed was comfortable, good and large bathroom, kitchen with all you need (even salt, pepper and sugar!). Good and free internet-connection. The only little downside point is that during my stay (3 nights) the towels were not changed, I knew this so brought my own. All in one: this is the place to stay in Berling!", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Excellent location, a hidden Gem!”", "Author": "StephanLisa", "ReviewID": "UR58827904", "Content": "I stayed here with a stagparty of 5 others for a couple of nights. The 1st thing that struck me was the excellent location. A few minutes walk of U bahn stations and a 15 minute walk from Harkischer Markt. Once the taxi dropped us off, should have taken the S bahn instead, it was a quick check in, and the receptionist was extremly helpful and well spoken in the English language. A few seconds walk through the backyard to the door of the building where the departments are, and we easily located the apartment the three of us stayed in. It was roomy, modern, clean, and even the kitchen had a washing machine. The beds were comfy and bedclothes fresh. Both nights I slept really well. The rooms are in a nice location, away from the noise of the main street, if not then maybe you can make sure. Plenty of excellent bars, restaurants and nightclubs in the area, but not seedy and you never feel unsafe. I will return with my fiancee in due course", "Date": "March 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chitenay", "Title": "“Great flat, great location !”", "Author": "dmirouze", "ReviewID": "UR58704508", "Content": "A very good choice if you want to stay few days in Berlin. It's very well located, close to every interest Berlin has to offer. We had a 2 bedrooms flat with a large living room and a large kitchen. Very comfortable. Lots of restaurant around and an organic supermarket on the other side of the street.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Loved this place!!!!”", "Author": "Jen31373", "ReviewID": "UR57303107", "Content": "My friend and I stayed in a deluxe 1-bedroom apartment. It was suitable for up to 4 people. The place was HUGE! The place was clean and service is spectacular! It's a great location for catching trains and navigating throughout Berlin. Since we are Americans living in Italy, we were thrilled having White Trash Fast Food Restaurant across the street with it's great restaurant with a fun bar in the basement as well as a bar upstairs and entertainment as well. There are several restaurants and bars in the area. Would I stay here again?? IN A HEARTBEAT!!!", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "the hague, netherlands", "Title": "“good place to stay”", "Author": "acanadiangirl", "ReviewID": "UR48462534", "Content": "We arrived after office hours and there was no problem obtaining our key, we were very impressed with that. We had the deluxe room and there was enough space for all of us, we were 4, including a teenager. Our friends had the standard room and it was spacious enough too.The bed was very comfortable, but the hide-a-bed was sloping, not too comfortable. The staff seemed very nice and helpful.It was great as we came with another family and would eat the evening meals together, we were 8 altogether but had no problem with room. There was a grocery store was not far so we could stock up for dinner.The apartments were on the east side which was neat for me as I was always curious about the secretive east Berlin.Except for the hide-a-bed was not comfortable.Our stay was nice.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic hotel”", "Author": "Jazzamor", "ReviewID": "UR46925492", "Content": "Everything was at mint condition. Service is great, well organised. Rooms are clean, spacious. High ceilings, quiet. The area is very nice. Underground station is just a few meters from the place, supermarket with organic food in front of the building. Very, very convenient place to stay in Berlin.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“GREAT LOCATION – GOOD VALUE!”", "Author": "XPanAmFA", "ReviewID": "UR37146449", "Content": "A recent stay at Shoenhouse Apartments with friends merely enhanced our visit to this remarkable city. Its proximity to delightfully diverse restaurants and engaging sights augmented the wonderful memories we have of Berlin. Our immaculately clean and airy room, its placid courtyard garden, and the unexpectedly high quality of the fare offered by the in-house cafe made the time spent there extremely enjoyable. The friendly and accommodative staff members genuinely added to our auspicious experience at Schoenhouse Apartments.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Berlin at Easter”", "Author": "SD55", "ReviewID": "UR29094332", "Content": "We spent nine days over Easter in Berlin staying at the Schoenhouse apartments. We enjoyed the hot, sunny weather, the great sights, museums, art galleries, and the clean, comfortable studio at the Schoenhouse. We had everything we needed to cook simple meals or breakfasts and there is a well stocked supermarket less than 100 yards away. There are plenty of cafes, restaurants, and take- aways nearby but the German versions of Italian food don't always live up to expectations. The staff at reception were polite and helpful and although the room was only cleaned once per week it was nicely furnished and very roomy (we had the larger studio for 4). The apartments are a two minute walk from the underground station and the U bahn system is cheap and easily navigated. A ten minute walk to Alexander Platz gave access to lots of attractions and a trip up the TV tower including a coffee or meal in the revolving restaurant is worthwhile. We would go back to Berlin and the Schoenhouse apartments if the opportunity arose", "Date": "April 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Idaho", "Title": "“Didn't want to come home!”", "Author": "johnl1960", "ReviewID": "UR26865579", "Content": "Wow! This place is very cool. It's in North Mitte, which is trendy but not threatening. Right near a U-Bahn stop. Cool cafe and lobby, super-nice staff, spoke perfect English...and...the apartment was absolutely gorgeous! Huge, high ceilings, beautiful wood floors, trendy lamps and furniture. I wanted to bring the bed home. Seriously, this place is really nice. We found it quiet at night. A time or two we could hear neighbors music but it ended at a decent hour. My only complaint is that the internet wifi was occasionally spotty, but overall, we loved the Schoenhouse.", "Date": "March 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Recommended!”", "Author": "LemonBug", "ReviewID": "UR26433100", "Content": "We very much enjoyed our three night stay with the Schoenhouse Apartments. We stayed in an apartment with a balancy which overlooks their lovely courtyard. The apartment was not fancy but it was new, spacious, clean, bright and cheerful. Their staff was also very helpful - they were very responsive on the email and gave us detailed instruction on how best to get there. We arrived before 10am and they were able to give us the apartment right away. As fellow tripadvisors have mentioned, the location is excellent - the metro is 3 minute walk away. We would not hesitate to recommend to Schoenhouse Apartments anyone given the location, the price and the quality of the apartment.", "Date": "March 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Lovely apartments, friendly staff!”", "Author": "Catherine1981London", "ReviewID": "UR22848129", "Content": "I booked the Schoenhouse Apartments after reading good reviews and they didn't disappoint. The staff were friendly and spoke good English. The apartments were clean, spacious and modern. Situated round a courtyard so a quiet location but only a short walk from the main attractions and the U bahn station. The Shoenhaus deli is good for breakfast and White Trash bar opposite is a quirky, atmospheric bar that serves great food. The apartments have cooking facilities so would be excellent for a longer stay... no complementary tea/coffee is provided so if you're going on a short break remember to pack your own! Overall, really nice apartments.", "Date": "December 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london central", "Title": "“just fab”", "Author": "twoplusonetravel", "ReviewID": "UR22614134", "Content": "Chose the Schoenhaus after a lot of deliberation, between this and the Ackselhaus and Adina apartments (have stayed in the Adina in Copenhagen which we loved). I am sure we made the right choice. This is a really workable and cosy place. We had a one bed apartment in the new building - on the top floor. The bedroom was huge, the living room/kitchen fine size (though a bit smaller than the lower floors as the balcony cut into the room space not added on). Bathroom small and not luxy (no bath but it seems its hard to find a bath in aparthotels in Berlin) but perfectly ok. Lots of hall space for buggy, good TV and DVD set up before we arrived (just ask when you book). In all it felt like home from home quickly. The location is great if you have kids - Kollwitzplatz is only 5/10 mins walk away and has a playground (more English speaking kids than Germans it seemed!) and many child friendly pavement cafes around the square. The main sites of the Eastern side of town (the museums) are walkable in less than half an hour - longer to the Brandenburg Gate and Tiergarten. What was perhaps most useful for a family stay was the deli/cafe. You can pop down in the morning and get a breakfast to take up, and they do very nice pasta until 8pm or so, again you can take it to your flat to eat in. Made it really easy not to have to plan every meal and know that there was always a last minute option. supermarkets are v close. would reccomend daytrips to potsdam and wansee via train. and dont miss the interlocking courtyards", "Date": "December 10, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Adelaide, Australia", "Title": "“OK”", "Author": "BonnieMax", "ReviewID": "UR21468478", "Content": "My family and I stayed at the Schoenhouse Apartments in October 2008. We stayed in room 209. The reception was friendly, but just pointed the way to our room. If you plan on arriving late, reception closes at 20.00hrs, so you might have to make arrangements. The hotel is located in the old East Berlin area, so the surrounds are a little bland. It is located between two U Bahn stations, only minutes to the Rosa Luxemburg station. There are two supermarkets just down the road. The hotel can do your laundry for you, but can be a little expensive. For a small load 4.50 Euros to wash and 4.50 Euros to dry. The rooms are a good size with a large bathroom and a reasonably equipped kitchen. The room was clean, but the 4 days we were there not once was our room cleaned. We were only given one small bar of soap between three of us for 4 days. It would have been good if they supplied a small amount of coffee, tea, sugar and milk for the first day. There was fast wifi available in the room. I think I would try somewhere a little more central next time.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "montreal QC", "Title": "“Amazing!”", "Author": "OrenmontrealQC", "ReviewID": "UR20998377", "Content": "An unbelievably stay! The concept is great we were able to wake up every morning and enjoy coffee and breakfast in our room. Which we got from one of the two organic grocerie stores just 2 mins away. The location is unbeatably, right in the heart of the city you are a stone's through away from a Ubaun (metro) station and about a ten min walk (in any direction) from amazing sites, fantastic shopping and interesting historic area's. The staff is beyond friendly and helpful, the room itself is CLEAN bright, spacious and airy. Complete with anything you may need for cooking and or drinking (wine opener coffee maker ect.). The deli located in the reception area was one of the best meals we had all trip and very inexpensive. They have bikes on site that they rent out for 10$ a day, it's a great way to get around, not to mention the city is incredibly bike friendly, with a bike lane on just about every street. I really can't say enough good things about our stay here and the price was extremely reasonable especially given the location and surroundings.", "Date": "October 19, 2008"}, {"Ratings": {"Check in / front desk": "4", "Overall": "5.0", "Location": "4", "Value": "5"}, "AuthorLocation": "stourbridge", "Title": "“Fantastic apartment”", "Author": "fairfieldrisers", "ReviewID": "UR18575017", "Content": "We had spent nearly two weeks travelling around Germany and were so lucky to find these apartments, a perfect end to our holiday. Spotlessly clean and well equipped with two TV's and decor that just makes you wish you could live there. The staff were all friendly and nothing was too much trouble.", "Date": "August 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“To be back”", "Author": "ASPH", "ReviewID": "UR18412669", "Content": "We were lucky to stay there for the first time in Berlin and we loved this place at once. Excellent location (2 minutes from Rosa Luxemburg metro station), where you can feel a real, true Berlin, very friendly Schoenhouse people (can't name it just \"staff\"), which helped us a lot with all needed documents for our trip (thanks all!), beautiful rooms where you can find everything for living months and a nice old house where ghosts seem to appear from time to time. We are sure to stay at Schoenhouse next time.", "Date": "July 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "buenos aires", "Title": "“spaciuos, modern, well located!”", "Author": "MusiBuenosAires", "ReviewID": "UR17508492", "Content": "The room is very spacious and moder, internet wi-fi was perfect. Mitte neighbourhood at 1 block. The only thing I didnt like is that the floor wasn´t as clean as I expected. Some hair in the toilet floor, and in an adicional blanket... The rest was perfect.", "Date": "July 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Enniskillen, N.Ireland", "Title": "“Fantastic Place to Stay!”", "Author": "gailcarty", "ReviewID": "UR17372581", "Content": "We arrived only to be upgraded from the most basic 'Junior' apartment to the deluxe apartment. Absolutely gorgeous apartment under the eaves of a wonderful old building. We had two huge double bedrooms, an open-plan kitchen/living/dining room, as well as a juliette balcony and a sit-out balcony! It was located at the very top of the building (balconies opened onto a charming inner courtyard, bedrooms had windows/velux windows which overlooked the street) and was reached via a glass elevator! All this for €75! The staff were extremely friendly and helpful. You can eat in their little deli or hire a bike. Downside - but only small things: - Reception shuts at around 8pm, so you have to gain access from side-street, which was fine. - We opened the velux windows only to be showered in thick dust! The wind blew it off the huge beams above the bed so we had to sleep in the other room. - Only one bathroom to be shared by all - this was fine for us as there were only two of us. Located just 50m from subway (rosen somehing platz!) I would definitely recommend the Shoenhouse Apartments.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex UK", "Title": "“Made our break extra special”", "Author": "zoe1m", "ReviewID": "UR17262526", "Content": "We chose to stay in the Schoenhouse apartmetns because we liked the modern style of the interior, the extra facilities with a kitchen and the price was good too - we got much more than we hoped for! We booked as group and all our apartments were conveniently close to each other, the customer service received from all the staff was excellent and they didn't seem offended that our German skills weren't up to much! Located just inside the East - very close to the centre and opposite White Trash Fast Food, which is a great querky bar/ indie club/ restaurant - very close to all the sites and easy to get around - only a few minutes walk from Alexanderplatz. The apartments were very spacious, very modern, very clean and the beds were super comfy. We had balconies on our apartments which was an enjoyable space for a drink in the evening. We only stayed for a few nights but the apartments really did feel like home when we came back after a day's sightseeing - the defining factor was definitely the staff. Always ready to help with information about the city and give advice. The deli downstairs is not only convenient but good vaule with great quality food. We hired bikes from the apartments and had a fab day cycling around the city, along the river and in the Tiergarten - only 10€ for a whole day, we would really recommened this. I would go back to Berlin, it is a really interesting city - but only if The Schoenhaus were available!", "Date": "June 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“home away from home”", "Author": "BibsSydney", "ReviewID": "UR16982244", "Content": "Believe what everyone else here has said. Amazing place. We felt like we lived there rather than staying in a hotel. We stayed for 4 nights, and we got married on the third day. On our wedding day the staff lent us some glasses and a wine cooler for the day. The next morning when checking out, the staff gave us a bottle of champagne to share with our breakfast! We will stay here again, sooner rather than later.", "Date": "June 17, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Washington, DC", "Title": "“Great place to stay”", "Author": "JLM42", "ReviewID": "UR16199879", "Content": "The Schoenhouse Apartments were perfect for us. The location is in a great neighborhood and convenient -- you can see a U-Bahn station and grocery store from the front door of reception. Our unit was large, even as a \"junior\" apartment, with enough room to unpack, spread out, and be in \"separate\" rooms when necessary. Wifi is free. There were kitchen facilities that included a frig, microwave, toaster, kettle, coffee maker, and hot plate units. There is a small Italian restaurant in the lobby area, but we never got around to trying it out (smelled good, though). While the apartments are part of converted older buildings, they are quite quiet. Our unit looked out on an interior courtyard. No elevator, though, so practice your stair stepping with luggage! Dishwashing liquid is supplied and liquid hand soap is in the bathroom, but there are no other toiletries. There was not daily maid service or room service, but we don't need that.", "Date": "May 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Loved it!”", "Author": "citizenMhotels", "ReviewID": "UR14252938", "Content": "Amazing hideaway, very close to the lively area of Berlin (Hackeschermarkt). Amazing rooms, very big and equipped with everything you need. Wifi was free, which is a big plus for me. Kind reception, and next to the reception is a deli, where you can pick up drinks and nice sandwiches. I recommend this experience to anyone who is sick of these standard monster hotels you see in every city in the world.", "Date": "March 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "essex", "Title": "“Brilliant apartments”", "Author": "k9luka", "ReviewID": "UR14060765", "Content": "Stayed in the apartment for 4 days. Brilliant location, very close to the centre of Berlin. Tucked behind a main road, it was very quiet and peaceful in the apartment. The place was absolutely spotlessly clean, very comfortable bed and well equipped. The staff spoke excellent english and were very helpful and friendly. Myself and my husband loved Berlin and the Schoenhouse apartment. We intend going back this December.", "Date": "March 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin Ireland", "Title": "“Great apts, great location, great price”", "Author": "dublinminx", "ReviewID": "UR13526813", "Content": "I was more than impressed with our stay at Sch apts. The location is fantastic, on the border between Mitte and Prenzlauer Berg. For those who only know Mitte, I would whole heartedly recommend heading into prenz-berg. Kastinallee, Kollowitzplatz etc. The apartments themselves are clean, very spacious, have every ameniety. The staff are very helpful, speak perfect english, and the cafe downstairs has great food. There is a great choice of bars/restaurants/nightlife close by. Unfortunately Im not a huge fan of german food, so our choices were more international. Some of what we liked: Scotch & sofa is a great local chilled bar, a little up into prenz-berg. We made this our local. A short cab ride into prenz-berg, 'The bird' is a U.S style steak restaurant, with some of the best we've tasted. White trash fast food, directly across the road. This has decent westernised food, with live music every night. Staff are a little unfriendly, but we found it worth the perserverence For a bit of Berlin glamour and a fancy meal 'Spindler & Klatz' is deffo worth a look. Good morning Vietnam, is just down the road and is tasty, very cheap vietnamese food. The list goes on.... Apartments were great all round, and I would definately return.", "Date": "February 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Pleasantly Surprised!”", "Author": "down_to_earth_2", "ReviewID": "UR11295056", "Content": "I only booked this break with my friend because there were cheap flights, i had no idea how much Berlin could offer. I was only there for 2 nights but i had a fantastic time, loads to see and do! As for the apartments, they were clean, well equiped and the staff were the most helpful i have ever come across. The man who greeted us when we came in to reception spent about 20mins going through which places were the best to go and see in Berlin and told us the places to avoid as well. We thought he was just one of a kind but the next day there was another genteman on reception who was just as helpful. Everyone we came across in Berlin spoke at least a little English so we got on fine and the whole holiday ran smoothly! Great location, just one stop from main station and if you are brave enough, the main part is close enough to walk to.", "Date": "December 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ventura County, CA", "Title": "“Will Stay Again & Again & Again”", "Author": "lorimyers", "ReviewID": "UR10079112", "Content": "I cannot say enough good things about Schoenhouse Apartments. We stayed in 401 and it was beyond clean. The staff are incredible helpful. The location is ideal. It's a perfect place to staff for couples, families and business travelers.", "Date": "October 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Falkirk", "Title": "“Fantastic”", "Author": "Sharanne F", "ReviewID": "UR10062065", "Content": "We stayed here when we went to Berlin to run the marathon. There were 9 of us staying in 3 apartments. Each one was better than the next. The staff were very friendly and helpful, even carrying our very heavy bags up 5 flights of stairs for us! No lift. We stayed in the 2 bedroom apartment on the 5th floor. The apartment was large, bright and clean. It had most facilities you require for a short stay in this great city. The deli below was really nice and good prices too. Loads of great bars and restaurants nearby and the station is a stone throw away. Only downside was climbing 80 steps after running 26 mile. It took a while! I plan on going back to this great city and will definately stay here again", "Date": "October 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney Australia", "Title": "“Great accommodation”", "Author": "ReneeSydneyAustralia", "ReviewID": "UR7586114", "Content": "We stayed in the 2 bedroom apartment with terrace on the top floor - would definitely recommend this accommodation. The apartment was very modern and hip, bathroom was huge (there were 4 of us), and the terrace is a bonus. The apartment has a fully equipped kitchen which we made good use of (cooked dinner and ate at the table on the terrace) and importantly a washing machine for those on a long trip. The location is excellent on the edge of the city, the surrounding neighbourhood of Prenzlauer Berg is very pretty with lots of dining and shopping options, and the train station is close by for the 5 minute trip into the city centre. If you are staying a few days and want to experience how the locals live, then this is the place. A nice home away from home to return to at the end of long site seeing days. The reception area with deli/cafe is very elegant and of the moment. The staff were fantastic. Two things to consider: We were there in spring bit i think the apartment would be very hot in summer. The other downer - no lift!", "Date": "May 10, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Belfast", "Title": "“Great Location”", "Author": "AlsBelfast", "ReviewID": "UR6715757", "Content": "My boyfriend and I stayed here a few weekends ago and loved it! The location was excellent, near loads of cool speciality shops, restaurants, bars and cafes. The apartments are a couple of minutes from the U-bahn (though seems like everywhere in Berlin is only a couple of minutes from the U-bahn!). We were really happy with the price and got a free upgrade to a bigger apartment when we arrived. The staff were very friendly and helpful and the apartment was great - quite minimalist/ikea-like with good shower and kitchen-dining area, TV and DVD player etc. No restaurant facilities ,which suited us to chill out and make our own breakfast but perhaps not ideal for those who want pampering! We loved Berlin and plan to go back in the summer - will definitely stay in Schoenhouse again.", "Date": "January 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Great place, great location”", "Author": "loupylu", "ReviewID": "UR5963311", "Content": "Stayed here for the wknd last week and had a fantastic time. Best part of town we could have chosen in the former East near great restaurants, bars and cool shops. Quite hippyish area which I loved. The apartments are immaculate and extremely clean. The staff were really great and we hired bikes from them for the day which is a fantastic way to see the city. A great tip we got is to book a table at the Reichstag rooftop restaurant which is reasonable value, great food and the most amazing views over the city.", "Date": "October 17, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leiden, The Netherlands", "Title": "“Great City, Great Location!”", "Author": "3Bergen", "ReviewID": "UR5799683", "Content": "Schoenhouse Apartments is great! We stayed in Berlin for the second time this year so we knew where we wanted to go and what to see. We also knew that going around town all day wears you out so we wanted a nice comfortable place to crash at the end of the day. Schoenhouse is just that. It's really just like you live in Berlin. Pretty spacious appartment (we had the Deluxe) with kitchen (dishwasher, microwave, oven, washmachine) livingroom, bedroom, bathroom (shower, no bath). We got a DVD player at the reception (no charge). The Apartments are in between other buildings so the location is pretty quiet for a huge city, it's kind of hidden from the street. The location is great, between Mitte (central) and Prenzlauer Berg (great developing hip heighbourhood), steps away from the subway, and close to the Hackischer hof, which has nice shops and restaurants. We rented bycicles on the last 3 days, which is superb! Berlin is perfect to ride around and discover! Anyways, we liked it all ver much and are sure you will too.", "Date": "September 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great location, good value”", "Author": "A TripAdvisor Member", "ReviewID": "UR5331073", "Content": "My boyfriend and i stayed here for 3 nights. We were happy with the price -195 euros. The apartment is a short walk from the subway at rosa-luxembourg, in the former east berlin. It is on a main road but situated in a courtyard behind another building so is very quiet. Our bed was very comfortable, our shower room modern and clean and the cooking/dining facilities were very acceptable. Nearby there is a cracking supermarket to stock up on goodies and booze. Compared to the uk, the prices were super-cheap. There is a nice italian restuarant a couple of doors down and a couple more doors down is a fantastic thai place. We would definately go back to berlin and definately try and book these apartments.", "Date": "June 11, 2006"}], "HotelInfo": {"Name": "Schoenhouse Apartments", "HotelURL": "/ShowUserReviews-g187323-d602155-Reviews-Schoenhouse_Apartments-Berlin.html", "Price": "$100 - $249*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Schoenhauser Allee 185</span>, <span class=\"locality\"><span property=\"v:postal-code\">10119</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "602155", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3f/eb/3febcd9f5f67b430fd696f96d0bb6cd41large.jpg"}}