{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Waterloo, Canada", "Title": "“Good Great Wonderful!!!”", "Author": "jessica w", "ReviewID": "UR119845285", "Content": "The staffs are nice and helpful. The room is big. It is a great place to stay if you want to stay in Montreal. The price is reasonable and everything is great!!!! Free breakfast, Free internet and Free parking. There are some restaurants and zellers nearby. Also, there is a bus stop just right in front of the hotel. You can go to the Metro station by that bus. The bus schedule runs until midnight.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good for the price!”", "Author": "Nascimentos", "ReviewID": "UR119205960", "Content": "Pros - Price, accomodation, Bilingual staff (English/French), Friendly Staff. Cons - Location, Old building.", "Date": "October 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Pleasantly surprised!!”", "Author": "nicky682", "ReviewID": "UR117774841", "Content": "I will admit that I was very worried about staying at this hotel after reading the previous postings, but this was the hotel that my son's baseball team had chosen to stay at for the championships being held over labour day weekend and I felt it was important to stay where the team was going to be. Check in went extremely well, they had our reservation and we went up to the 3rd floor to find a spacious room with two large beds with what looked to be new mattresses and a renovated bathroom. The room also had everything one could want for convenience, alarm clock, small fridge to hold your bevereages, iron and board, hair dryer. The most important part for me was that the room was VERY clean. Everytime I dealt with the front desk they were extremely efficient and friendly. The lobby was clean and quite nice. I agree that the large glass pane seperating you to the front desk does seem a little over the top and makes you feel like the hotel is not safe but I gather that having the desk so close to the front entrance could be a security issue and the pane is there for the security of the employess who work overnight. There are no restaurants right in the hotel itself but there is every kind available all around the hotel, breakfast restaurants right accross the street, fastfood walking distance and family dinner restarants right next door. I really didnt feel like not having one in the hotel was a problem at all. We managed to spend one afternoon at the outdoor pool and the weather was very hot so the kids really enjoyed having the oppurtunity to cool off between ball games. If I were to complain about one thing it would be that the pool area and a few of the hallways/stairwells of the hotel could use a little more maintenance. If someone spent 30 minutes sweeping and cleaning off the dirt from the pool area tables and weeding the patio some it would make a whole of difference but again this did not in any way affect the quality of our stay. I really cannot understand based on what we experienced how anyone could be dissapointed in this property based on the room rates, it is not a 5* by all means but it is a safe, clean and comfortable hotel that I would not hesitate to recommend or stay at again. Do not let the previous posts scare you away from this property, one of the parents of our team did get influence by the bad reviewns and came to regret it after he came by the Prestige and saw for themselves what it had to offer. They even let us use their dryer after our team's uniforms were soaked by a torrential rain storm and allowed us to have nice dry uniforms for our next game!!! Congratulations to the management and staff at the Hotel Prestige, I can only assume that they are doing a great deal to upgrade the quality and make this a very good choice in Montreal and Pointe aux Trembles.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Toronto, Canada", "Title": "“To be avoided”", "Author": "TorontoTraveller84", "ReviewID": "UR114778421", "Content": "Forget the nightly rate tripling for the Montreal F1 weekend - all hotels did that. Some imposed three night minimum stays. No, that wasnt the issue with Le Prestige. The room was not cleaned before we checked in at around 7pm. The TV set was left on, the bed unmade, and garbage strewn everywhere. The hotel staff was completely unapologetic and refused to simply move us to another room, and insisted that we return to the lobby and wait until the room was cleaned. The room was cleaned fairly quickly - which made me question the thoroughness. Thereafter the electronic key did not work, and I had to return to the front desk to have it reprogrammed. Again, the front desk staff was completely unapologetic. The front desk staff are fully enclosed behind thick, ceiling-high glass, similar to the old-style bank teller areas. This does not present a warm, safe feeling at all. I certainly won't make the mistake of staying there again!!", "Date": "June 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Tampa, Florida", "Title": "“Don't be fooled by the name or website pictures or discription,terrible location.”", "Author": "0001957", "ReviewID": "UR67570437", "Content": "This hotel is not near anything in Montreal.it is a 1 hour commute to downtown Motreal.20 minute bus ride to the Metro station,if it ever arrives,then 40 minutes into the city.They quoted us $110.00 per night then charged us $150.00.We went there for the Grand Prix of Canada.Totally inconvenient to the Track and downtown Montreal.The rooms reeked of smoke even though they were supposed to be non-smoking rooms.The continental breakfast consisted of mushy apples and warm juices.They advertise that they are 15 minutes from the track and downtown.That is a toatal lie.It cost us 72.00 to get there from the Airport.That's how far east it is.It's a $12.00 taxi ride to the metro.Staying at this hotel ruined our trip.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Ontario", "Title": "“This place is not \"prestigious\" at all”", "Author": "519traveler", "ReviewID": "UR36707317", "Content": "We stayed at the hotel for one night on the August long weekend for a music festival Montreal was holding. It should have been our first indication that the 4 pan glass window at the reception meant that their were security issues in the building but who would have thought that anyone would have to truly worry about their safety! We left our luggage in the room while we were on Montreal island for the festival. To our surprise the next morning while attempting to pay for breakfast our money would be missing. Our bags were tampered with and our wallets were emptied. Once reporting what had happened to the Manager at \"Hotel Le Prestige\"- he was completely unhelpful and rude. I HIGHLY recommend that NO ONE stays at this hotel. The staff will violate you and your belongings and they cannot be trusted. When someone pays $120 for a room, which is locked, they do not expect to return to a staff member stealing their belongings. Please take my advice, do not stay here.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Kenosha, WIsconsin", "Title": "“Great for Some, Not for Others!”", "Author": "Cheezosha", "ReviewID": "UR5728758", "Content": "This hotel is probably different than most you have ever been to. It has some unique suites at a reasonable price. We booked a double room for our 3 kids, and then treated ourselves to one of the themed suites. The double rooms are clean and furnished with the std 2-3 star amenities. The themed suite was large, clean, and outrageously decorated. (Check out their website, they have a picture of each suite. As far as I can tell, they are exactly as pictured- at least ours was). It had a great sound system with speakers all over the room. They had unique mood lighting, king size beds, nice stereo, refrigerator, etc. You could not find a comparable room in downtown Montreal for less than $300 per night. It had a double jacuzzi in the middle of the room, with a separate glass shower. It was very romantic as you can imagine! You do not want to have kids in the room with you- there is no privacy! They are meant for couples. The double room did have a separate shower, however. My wife loved the room, and did not want to leave. The kids will like it, if they have a separate room. There is a nice outdoor pool also. Bottom line- Check out the photos on their website. What you see is what you get. A few words of warning- 1. They advertise a continental breakfast. This consists of a muffin and warm orange juice. Coffee is from the machine for $1.25. Anyway, we found the best breakfast in the world right accross the street at Chez Cora (a local Quebec chain). We want to go back to Montreal just for the breakfast there! You will love it there! There is no restaurant at all in the hotel, but there are numerous within walking distance. We tried 3, and they were all excellent. 2. This location is about 10 miles north of downtown Montreal, which is where you want to go if you are a tourist. You should choose this hotel only if you have a car. 3. The hotel also has an adult (porno) channel that runs continuously. We asked the manager to shut it off for the duration of our stay, which she gladly did for us. We could not block the channel on the TV in our kids room. 4. The hotel appears to be a \"swingers\" hotel. They offer wine and champagne bottles for sales in the lobby. I don't think that it is, but it is definitely different. If this was in the Intercontinental, it would be a Master Suite at $400 per night. 5. The pillows were a little hard. You may want to bring your own. Overall, this was a friendly, well-managed hotel. We enjoyed our stay, and would love to go back for a second honeymoon. Montreal is a very romantic and interesting city. We toured all of Eastern Canada, and liked Montreal the best. This hotel may not be for everyone, but great for honeymooners, adventurers, romantics, etc. Not for small kids!", "Date": "August 30, 2006"}], "HotelInfo": {"Name": "Hotel Le Prestige", "HotelURL": "/ShowUserReviews-g155032-d602406-Reviews-Hotel_Le_Prestige-Montreal_Quebec.html", "Price": "$86 - $160*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">12555 Sherbrooke East</span>, <span class=\"locality\"><span property=\"v:locality\">Montreal</span>, <span property=\"v:region\">Quebec</span> <span property=\"v:postal-code\">H1B 1C8</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "602406", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6e/3a/6e3a3e384352bb064afd65645abd7a411large.jpg"}}