{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel,Would recommend.”", "Author": "VickieChristie", "ReviewID": "UR127825217", "Content": "Had a lovely stay at the Milton. Staff were friendly and the room were cleaned on a daily basis. Can't really find much fault with our stay. Look forward to our next visit.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Only adequate”", "Author": "Charmainee", "ReviewID": "UR127461810", "Content": "Room is simple and feel and look like 3 stars. Train stop is just outside the hotel. So good as a base to travel out to the sightseeing places. Not much nice resturants near the hotel. The location is quite deserted and quiet at night. We didnt spent much time in the room so guess this hotel meets our minimum needs.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great start to Italian adventure”", "Author": "Louise Cate C", "ReviewID": "UR127401810", "Content": "A great hotel close to Colloseum, Forum etc. Had shuttle booked from airport, so conveniently dropped off and straight into room. We were able to walk, but a bus stop was outside front door also taxis available. Walked straight into Colloseum, Constantines Arch then onto Forum and war Memorial. As it was boxing day main streets were closed so got to stroll through Rome with no cars. Breakfast is a higher standard than most hotels, chocolate and custard croissants, Bella! Free wifi in lobby. Rooms quiet. Staff friendly but phrase book always handy. It was a great central location, if you like walking you can go through gardens as well with great views of Rome. Highly recommend for families.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Perfect for a weekend break and near to the Colosseum”", "Author": "Run_Lola", "ReviewID": "UR127377230", "Content": "I stayed here with my husband for a three day and night weekend in March. Don't be put off by the outside as it looks a little cheap - not so much like the picture they give above! But once you step inside, you will be greeted warmly by reception staff who speak a number of different languages and are happy to help. We had a standard double bed room. There was a comfy bed, desk, chair, mini bar, wardrobe and a decent flatscreen TV attached to the wall. The bathroom was small but there was a bath in there. It was a little annoying that the toilet was located behind the door but a small problem. There was a slight toilet smell in there from time to time but only mild. I would advise taking a pair of earplugs as if you are located facing out onto one of the two busy streets, you will hear a lot during the night with trams and other traffic. It was rather warm in the room but this may have been because it was in between seasons so the heating may have been on when not needed some days. The wi-fi connection was really flaky in the rooms so using the lobby might be wise. The room was kept spotlessly clean which was great. Breakfast was very pleasant. Hot food could have been hotter at times but the selection was brilliant - cereals, toast, croissants, bacon and scrambled eggs, meats, cheese, rolls, bread, cakes, fruit and yoghurt. The coffee machine was excellent and there was a good selection of fruit juices. We walked from Termini (the main train station) and it took about 25 minutes to get to the hotel which was reasonable. For location to the Colosseum and Roman Forum, its pretty unbeatable. 8 minute walk at most. Go and see this at night when it is all lit up. And in the day walk to the top of the Palantine gardens to get a photo of the whole of the Colosseum (a worthwhile tip I read in my city secrets book!) The metro station Manzini is literally opposite the hotel which made things very easy to get the Trevi fountain and The Pantheon. Would recommend taking the metro to the Vatican or you will be in for a long walk! Buy a day ticket for the metro which is cheap as chips but beware that you need a 5 euro note or change for the machines. Can recommend restaurants Li Rione on Via dei SS. Quattro Coronati and Hostaria Isidoro on Via di San Giovanni. They are both located five minutes from the Colosseum. Would highly recommend the chicken in gorgonzola sauce at Hostaria!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Mosty good but with a few reservations”", "Author": "Rose of England R", "ReviewID": "UR126218169", "Content": "We stayed 5 nights. First disappointment was no kettle in spite of this having been checked out with our Travel Agent beforehand. When I queried why it was still on the website the receptionist told me that they had decided against kettles that very day! This was obviously not true as I have now read other reviews. It's a pity to have someone lie - it destroys confidence. We know Rome quite well so knew where to go to buy a kettle. There are two supermarkets in the Termini station, just two Metro stops away. Location was ideal for us - as we like to walk and the Forum and Coliseum and several important churches were within a short stroll. The Metro is simple to use as there are only 2 lines and most of the tourist sites are situated on Line A - outside the front door. Our bed was extremely comfortable and we were not disturbed by the traffic noise. If you want a peaceful retreat don't go to a major city. This is about our tenth visit to Rome and we have had much much noisier rooms in other hotels. Our double room was Ok in size, but our son's single room made me recall that this was once a convent as it was similar to a monastic cell. However, the lighting in our room was among the best I have found anywhere in the world. This is very important for ageing eyes wanting to read small print in travel guides. Well done on that, Hotel Milton. The breakfast was extensive with pretty well everything you could imagine including scrambled egg and bacon. However on the last 3 mornings this was so cold as to be inedible. The linen was very clean, and the room was serviced regularly. The staff were generally helpful and requests eg for a chair in the room, were dealt with fairly quickly. There are several restaurants and cafes in the roads around and we were able to dine well in different places each night. The bar opposite makes a good cup of tea. We would stay there again as we wanted a clean and convenient base from which to explore. It suited us well.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“LOVELY”", "Author": "Sindiibad", "ReviewID": "UR126108233", "Content": "We had a great few days at The Milton close to center & freindly team thank you :)", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Perfect base for a flying visit”", "Author": "Jimbo_Goater", "ReviewID": "UR125548394", "Content": "Stayed for 3 nights in February - Greeted warmly on arrival by very friendly and helpful staff, the room was spacious (for a Roman hotel!) clean and modern looking. We didn't have any problems with noise, and having been to Rome a number of times before, I can appreciate that this can be an issue, but no problems for us on this occasion. It is about a 10 minute walk from the Colosseum, so not bad for a day spent around there and the Forum, but it is quite a way from Piazza Navona, Campo De Fiori etc... however the Manzoni Metro station is outside the front door. There are many horror stories about the metro, particularly around Termini, but Manzoni is not a busy station, the ticket machines are in English, and everything tourist-y is along the same line, so all you need to do is get on and get off, no transferring trains required! We used this to reach the Vatican museums & Spanish Steps on different days, and then meandered back towards the hotel, which was ideal. The only slight let down was the breakfast, which was fairly basic, plus coffee out of a vending machine, so we abandoned this for a lovely little coffee bar - head down Via Emanuele Filiberto, towards San Giovanni, and it is about 4/5 doors down. Other than that, great room, great service, and a great base to enjoy the city!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Jerusalem, null, Israel", "Title": "“Great Hotel, Firendly Staff, In the Center of Rome..”", "Author": "Mohamad A", "ReviewID": "UR125291042", "Content": "Great Hotel, Friendly Staff, In the Center of Rome..close to all sites, Just beside a Metro Station..10 Seconds from hotel doorstep... Near a bus stop as well as a Tram. Clean Rooms/Restaurant... Helpful staff, reasonable room rates. recommended..", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Very nice!”", "Author": "Bettand34", "ReviewID": "UR125036415", "Content": "Hotel Milton is close to the central station but closer to the Colosseum, with plenty of shops and places to eat nearby. We never paid more than 7 euros by taxi to get anywhere in the central area of Rome. The rooms were spotless and the service first class, thankyou for accommodating us!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Half term in rome”", "Author": "luke38257", "ReviewID": "UR124999156", "Content": "The hotel is in a good location, close to all amenities, making it ideal for site seeing. The staff were all very pleasant, and the room was ok.. It was clean and comfortable but Unfortunately there were no Tea/Coffee facilities in the room and the the advertised satellite TV consisted of 3 Italian channels 1 German and CNN, not ideal when traveling with a child. Not quite sure how it qualified for 4 stars, as I have stayed in 2 and 3 star properties that have had more facilities. I wouldn't recommend it if taking children or you are used to true 4 star properties.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford", "Title": "“Four Days in Rome”", "Author": "OxfordCrew", "ReviewID": "UR124565360", "Content": "The hotel is very close to Manzoni Metro station and Bus and Tram lines so is well positioned to access other parts of the city. Although we had a room overlooking the main crossroads it was not noisy and we slept well. It might be different in the summer if one needed open windows. Staff were all pleasant and helpful apart from the breakfast room on Sunday morning which seemed a bit under staffed and as it was busy was not serviced as were the other days. Breakfast food and choices was very good. The Bar was not opened unless we asked for it to be and when we returned to the hotel about 9:45 on Sunday evening we found the bar was closed 'as the Barman did not work on Sundays'. Fortunately a small bar across the road was able to accomodate us and several other Milton Roma guests. We would stay again as it was clean, comfortable and we enjoyed our stay despite the Snow.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“My stay at Milton 02.2012”", "Author": "Anna_LuciaMoscow", "ReviewID": "UR124472777", "Content": "It’s a second time I have stayed at this hotel! Very good location: close to metro Manzoni, near bus stop, 15min walk to Colosseo, 20min walk to Termini station. There is a mini market with local food in front of the hotel. The hotel is very nice and clean, my room was very quiet. Very good and various breakfast. The price of the hotel was fantastic for a 4 stars hotel! The staff is very friendly. I was assisted in everything. My stay was wonderful! I’m sure to return to this hotel.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Really Good Experience......”", "Author": "Sophie W", "ReviewID": "UR123791460", "Content": "Hotel is in a very convenient location, metro which is easy and cheap to use is across the road. Rooms clean, breakfast excellent and the staff are very friendly with great English. Only draw back was the street noise. You will struggle if you are a light sleeper. Ear plugs were enough for me to block the background noise. If you are just looking for a base for your trip then the Milton is excellent value for money.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great for the money!”", "Author": "Kalephrrr", "ReviewID": "UR123619989", "Content": "Nice hotel, very conveniently located across the street from Manzoni metro station! Breakfast is excellent! Staff is helpful and courteous, great English. Only cons are that it is slightly on the outskirts of major attractions; there are few restaurants nearby; the street noise and trolley noise on Via Emanuele Filberto are horrible! If you want to sleep past 6:00 am, then this is not your place. Overall had a great stay there, and for the money, you can't go wrong!", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A good base for a trip to Rome.”", "Author": "Liniredbaron", "ReviewID": "UR123226820", "Content": "This hotel will serve as an excellent base for a trip to Rome. The hotel is clean and the rooms are spacious and private. The hotel is located next to a tube station and around 10 minutes walk from the coliseum. Great if you need a place to stay for a weekend city break.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bristol", "Title": "“Disappointing - staff unhelpful”", "Author": "sespencer30", "ReviewID": "UR123100338", "Content": "Four star hotel with no kettle or tea making facilities in room, despite this part of the room description and in photos on their website.. when I asked the staff we rude and said they dont have kettles. So I asked for a coffee to be sent up bit no refreshments available until 7pm at night! I did find the staff generally unhelpful and uninterested, they spent the day on the front desk browsing on the internet! Our room was VERY NOISY as many others have pointed out. Also I would say the location isnt very good - although close to a metro station they metro network isnt great in Rome. Also 10 minute walk to the colosseum and forum but I would say not within walking distance to pretty much everything else in Rome, including a good selection of restaurants. Saying all this the room was clean, breakfast good, just perhaps not a 4-star hotel worth the price they charge..", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Convenient and great service”", "Author": "iczi", "ReviewID": "UR121741793", "Content": "I really enjoyed my stay at Milton Roma. In fact, we only booked it for the first lag of our trip and was gonna look for another hotel in Rome on the second half of the trip but we ended up just booking with them because we really enjoyed it! 1. Hotel is extremely convenient and located in a relatively safe neighbourhood. It was important for 2 girls traveling in Europe. It is located two stops away from Termini train station which is pretty shady, but the station it is located right above is Manzoni, situated in a quiet Italian neighbourhood with everything you need within 5 minutes - Cafe across the street, drug store, cheese and deli store, local pub, bus stop to Colosseum (or a 10 mins walk) 2. Both rooms we stayed at were at a comfortable size, especially in a large city. The bathrooms were clean but there was no door so showering was kind of interesting to try to keep the water in the tub. The first time we flooded the bathroom because we werent aware, however everything else in the room we had no complaints for. 3. Wifi is only available in the lobby for a cost, it wasn't a big issue for us because there were a lot of internet cafes located in Rome. No real amenities except the small hotel bar. Very neat and clean. Both our rooms faced the \"busy street\" however it gets very quiet at night and we did hear a few trucks going by in the morning. 4. Service was absolutely great. I think with any country the key is to try and learn/adapt to their customs. We had an Italian app on our iphone and tried to check in speaking Italian even all concierges we encountered speaks fluent English. They were all extremely helpful in teaching/helping us with our Italian and any general info on Rome. While we were there, a lady checked in speaking only in English rudely and not bothering with adapting to any Italian mannerism and the concierge was cold and impolite. I think you give and you take. 5. The breakfast buffet was also absolutely amazing! Best one in Europe by far. It has a relatively large selection of juice, a coffee machine (however can be more amazing seeing we were in Italy), danishes, desserts, deli meats, cheese, veggies, cereal, yogurt and other breakfast foods. Some reviews said that food was almost always gone, which didn't happen to us the 3 nights we were there. The staffs are very attentive and replenishes quickly. Overall, I am sure there were a million other hotels in Rome that can be more amazing, but for the price we got (about $130USD maybe?) it was a great stay and well worth the price. I would recommend it to all travelers on a budget!", "Date": "December 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Linwood, New Jersey", "Title": "“Not impressed...”", "Author": "davidojs", "ReviewID": "UR121350718", "Content": "I stayed here for one night, and can thoroughly say I did NOT enjoy my stay; and this is by no means a four star hotel. I was traveling alone, and had booked a double room (for some reason this was less expensive), rather then a single. I was shocked to find that this so called \"double\" room, felt cramped and claustrophobic, this was only enhanced by the scratch marks and scuffs adorning the walls. The room also lacked certain amenities you would expect from a four star hotel like table lamps and chairs. That evening, when I had wanted to go take the metro, I asked the staff if the could break a 10 euro bill into two 5 euro bills for me to use the ticket machine. Thinking this was a FOUR star hotel, I figured this would be no problem. However, I was shocked to find that they claimed the could not help me at all, that they had \"no\" cash (hard to believe especially because this hotel has a bar) and my only option was to buy from the drug store across the street. My lovely stay ended by finding that my the adjustable shower head in my room would not stay up, so I had to crouch to the floor of the shower to get my head wet. One positive aspect about my stay however, was the breakfast, which had a fairly large selection.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "perugia", "Title": "“basic”", "Author": "mickpg", "ReviewID": "UR120985187", "Content": "Is not properly a four star hotel. Located in central position, very closet to colosseum and S. Giovanni square, above metro station called “Manzoni”. I stayed in a queen sized bed room faced on the main street, very noisy during the day. I had some accident with the shower and with the bathroom in general, because there wasn’t a mechanical air exchange. The breakfast included fresh fruit, eggs and bacon, many cakes, but the temperature in the dining room was too low, quite similar to the outside.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Typical hotel in Rome?”", "Author": "KATZ210511", "ReviewID": "UR120792830", "Content": "We stayed here for 2 nights in mid November 2011. The first thing we noticed as soon as we walked into our room was the offensive smell of sewerage coming from the bathroom, but we were told by friends that this is common in hotels of Rome so we kept our room window open as much as we could. The room we were allocated was snug, having a double bed, desk and chair and closet. No wi-fi internet available in room, only in the lobby. However, Wi-Fi is complimentary. Another downside is the noise pollution! I had to wear ear plugs to geta good nights sleep. Traffic and sirens can keep you up all night otherwise. Reception staff were very friendly and were able to communicate in English. Location wise, it is not so obviously well positioned but it is within walking distance to monuments such as the Colloseum and the Basilica of San Marjorie, as well as restaurants and supermarkets. Furthermore, there is a metro station right at its doorstep.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Amersfoort, Netherlands", "Title": "“Ok, adequate, but too noisy and not very romantic”", "Author": "culturaDJ", "ReviewID": "UR119635298", "Content": "This a good hotel if you're not looking for anything romantic or special. It basically fullfills all your needs, at a very decent price. So it that is ok for you, look no further and stop reading. Go and enjoy. The breakfast is simple but adequate and it will release you from having to breakfast outside somewhere. Don't expect freshly made croissants though. The room was spotless (except for the rather worn carpets). They must have revamped it recently, all the walls and the bath looked really freshly painted and clean. We had a room overlooking the main street, and wow, that is noisy. Sure, after a day wandering through Rome, you'll sleep anyway, as did we. But if noise keeps you awake easily, ask for a room on the side of the hotel away from the street. Trams thunder by till pas midnight and since the claxon was probably invented in Rome, you'll hear a lot of it in the early morning. The staff is great. They are very helpfull and courteous. Well done! The Manzoni Metro is right in front, but since the metro is not running after 9pm (till april 2012, due too work in progress) or does not reach the old city, it is not much use. But hey, this hotel is 750 meter from The Collosseum. The location is far from idyllic on a main roundabout with huge amounts of Roman (!) traffic, next time I will opt for something in the old town for romantic reasons. But overall, this hotel is what you expect of a standard, well run hotel.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Wonderful staff, location and breakfast.”", "Author": "Jennifer D", "ReviewID": "UR119545045", "Content": "As I fractured my hip in Rome my husband and I stayed at Hotel Milton for 6 weeks. The Staff were superb and went out of their way to make us comfortable. They were friendly, knowledgeable and extremely helpful. Housekeeping was exemplary and nothing was too much trouble..We enjoyed the large selection of breakfast dishes and the fresh fruit platters and home made cakes were wonderful. A truly professional team, we highly recommend this Hotel.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Not a four star hotel - no wifi in rooms, 1 towel in bathroom, no business centre, carpets filthy, bed linen worn.”", "Author": "Claudia_za", "ReviewID": "UR119022449", "Content": "I needed to stay in Central Rome near public transport for a one week work trip. I prepaid for this hotel because it was independent and because of the predominantly positive reviews on TripAdvisor. I checked the hotel website to make sure it would have the ammenities I need to work (wifi in the rooms and the ability to print documents if necesssary) and was reassured. On arrival I was told that there was no wifi and my reference to the website text was met with disinterest. The room contained a single bed with tired bedding, and was 2m by 3m large. As I was due to spend much time in the room working during my week long stay, I asked to upgrade to a larger double room but was told this was not possible. This is a 2.5 star hotel centrally located with a generous adequate breakfast. I am angry to have been missold.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location but basic”", "Author": "oliverlohan", "ReviewID": "UR118981311", "Content": "A decent hotel for location with fantastic staff all of which are kind and helpful. However for the price I would expect more as a pretty frequent hotel user. Great for colosseum and for historical parts of Rome but I think you could find more bang for your buck elsewhere", "Date": "October 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Average at best”", "Author": "PhilParker12", "ReviewID": "UR118894926", "Content": "Bad location. Bad service - our AC didn't work. They told us they fixed it but hadn't. Eventually they just gave us a new room. This room was better but it felt dirty. Tiny bar area that was deserted. Not a great experience. I don't recommend staying here, we won't stay here again.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "England", "Title": "“Unacceptably noisy at night if you're in a room facing the street”", "Author": "WorldWandererUK", "ReviewID": "UR118523027", "Content": "The hotel is ok but ONLY if you get a room at the back. My first night at the front was so noisy that I hardly slept (Room 317 above Via Emanuele Filiberto). I was so annoyed that I even tried to move rooms at 2am but was told there wasn’t a quiet one available – so that guaranteed a sleepless night at a 4 star rate! I did, however, move to the rear for the second night which was SO much quieter. The Milton’s windows at the front are double glazed, but the noise insulation is absolutely abysmal due to sound coming through the frames. The road outside had extremely noisy squeaky trams, mopeds and police sirens until at least 02:30. The Milton needs to invest in high quality sound-proofed windows at the front – after all there’s no point in forking out for a 4 star hotel if you can’t get any sleep. Even though I was clearly unhappy at not havng slept, not once did any of the reception staff apologise – it appeared to be more of an inconvenience to them rather than me! I moved across the road to the The Hotel President for the rest of my stay they were able to accommodate all of my colleagues and me at the quiet side of that hotel. One other negative was the showers. The shower head is bizarrely fitted to the side opposite the small shower screen on the bath meaning the water sprays across to the oppostite side around the screen and onto the floor. If you shower with the head attached, you’re likely to have a flood of water on the floor – I feel sorry for the cleaners who must be constanly finding puddles in the rooms! The breakfast was fine and the rooms were clean so in conclusion, if you’re not facing the road side you’ll be ok. But be prepared for a sleepless miserable night if you are facing the trams – unless you’re deaf of course.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Good location and breakfast, nice stuff but expected better rooms.”", "Author": "ElenaSal", "ReviewID": "UR118446327", "Content": "Well it depends what are you searching for in your vacation. 1. Location - very very good. Milton hotel is in great location, near the colloseum (on feet 10 minutes), near bus station that can get you easily in the most hot spots of the town. 2. Breakfast - great Great breakfast also and fresh, with variety of cakes. I enjoyed it. 3. stuff - good Sufficient Knowledge of english that allows you to understand the information the stuff gives you, which is a good thing in Rome Polite and willing to help you. I would like a better knowledge of sightseeing and directions 4. Rooms, definately not for a four star hotel. There is a lot of dust in the carpender, it could and should be much cleaner from dust. Windows dont open. Quite small room, considering that it is a four star hotel, but its not annoying. in conclusion, I would recommended it if its not problem of the dust mentioned above...", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“A wonderful hotel with a great location!”", "Author": "Joobert", "ReviewID": "UR118341764", "Content": "My friend and I stayed at the Hotel Milton Roma for 3 nights during the first two weeks of September 2011. Upon arriving at the hotel, we were happily greeted and promptly checked in. The gentleman helping us provided us maps and explained, in detail, how to get to the main attractions easily and even provided areas to avoid at night, all without us even asking! The hotel is a bit older, but is nonetheless clean and maintained. When we entered our room we were pleasantly surprised! The room was quite spacious, despite what we've heard about European hotel size. Overall, the room was clean. However, the carpet near the bathroom was water damaged/stained. Speaking of the bathroom, the shower was a bit difficult to shower in. There was a glass partition that only shielded half of the tub and could be swung in/out from the tub. This being said, you had to shower at the one end of the tub that was shielded, while directing the spray of the water towards the shower wall to avoid getting water on the floor. Aside from this minor inconvenience, the bathroom was clean, had plenty of hot water and good water pressure. Man oh man! What an amazing location this hotel has! A 10 minute walk from the Colosseum, right beside a subway station and a bus stop nearby! In addition to this, there is a little cafe across the street to grab a nibble and drink. Just a few doors down is a cheese and deli shop where you can pick up some olives, cheese, prosciutto, a loaf of bread and some wine for a rustic meal. In terms of service, we were always happily greeted whenever we came in or left by the staff. They patiently listened while we awkwardly tried out the Italian phrases we knew and they even taught us some phrases too! The breakfast buffet that was provided in our booking package was hot, plentiful and large in variety! I highly recommend this hotel! Fantastic location and amazing value for their kind services!", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Good location”", "Author": "cp_0010", "ReviewID": "UR117742482", "Content": "We were there last year in Sept.The hotel is in a good location. There is a metro station just across the road. Colosseum is at about 5-7 minutes walking distance. Other places can be reached by metro or hop on hop off bus. We had booked a double room for two nights. The reception staff gave us a very small room on the ground floor not suitable for two people, this was despite booking the room more than 2 months before. When enquired with hotel staff,the staff at the reception was rude and said they can not provide any other room however can refund the amount if we ask. This was a strange experience for us and didn't know where to go. So we had no choice but to take that room, on our request they changed the room next day to a better room. Breakfast was served on the ground floor and was very good with plenty of choices. There was hardly any help available from the hotel for any sightseeing tour however they can guide you to Colosseum. The hotel and room were in good condition.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "london", "Title": "“great Location”", "Author": "moANDakila", "ReviewID": "UR117734902", "Content": "Very nice hotel with a lovely breakfast, agree the carpets do need changing.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“My favorite hotel in Rome”", "Author": "TravelbugEddie", "ReviewID": "UR116946232", "Content": "I've been to Rome many times but on my last two visits I stayed at Hotel Milton, which has now become a favorite. I love that it's about a ten minute walk from the Colosseum and right across the street from the Manzoni metro station. Rooms and bathrooms are a decent size and the breakfast is outstanding with scrambled eggs, cold cuts, mini croissants, cereal and fresh fruit. The employees working at the front desk are always very helpful and even recognized me from the last time when I stayed there. I will definitely stay here again on my next visit to Rome.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Well located”", "Author": "supertopfit", "ReviewID": "UR116912118", "Content": "The hotel is well located , close to the metro and bus station. However it s quite noisy due to the main street in front of the hotel. The Coliseum is at 10 min. The room was ok but the bathroom was small. The breakfast is good and the staff was helpful.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good hotel (if you are lucky)”", "Author": "michsyw", "ReviewID": "UR116446750", "Content": "So this was our first trip to Rome and we booked this hotel based on the positive reviews here. We stayed for 2 nights and the experience was great. Very good breakfast, excellent location, and friendly staffs. So we decided to stay here again after we get back from our cruise trip. All things just went downhill. At first they gave us a corner unit away from the main building, and directly across from the staff room, you can hear people going in and out every 2 minutes and speaking quite loudly. We demanded to change room after a while, they are nice enough to gave us another room in the main building. And this one is a little better, except everything in the shower seems broken. The towel hanger seemed it could fall off any second, the showerhead holder was loose so you have to either hold it or lean it against the wall. If you take shower longer than 3 min, the spilled water will sneak around the toilet and drench the carpet outside the bathroom. And also the room we had seemed to be quite close to the main road outside, and everytime when a train or a bus went by, the floor started trembling. I would give this hotel a 5 star based on my first stay, and 2 star on my second. So a split calls for 3. It's a decent hotel, if you are lucky enough. Additional info: There's a 24 hour vending station just across the street from the hotel, they sell cheaper stuff than most of the stores here. Grocery store is about 200-300 meters from the hotel and of course their drinks are the cheapest. It's about 10min walk to the colosseum. The hotel's internet connection is pretty fast, haven't tried the wireless though.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "UK", "Title": "“Milton Roma Hotel Below Average For Four Stars”", "Author": "Ipsen", "ReviewID": "UR116440460", "Content": "Stayed at the Milton Roma Hotel in Rome first week in August 2011,i read most of the reviews some good and some not so good but decided to take a chance.The reviews were correct it had good points and bad. Firstly its within easy walking distance from the Termini Train Station which has a good link to FCO Airport so this made the transfere cheap and easy,the Colosseum is only 10 mins walk and the Roman Fort 5 mins from there. On arrival the staff were friendly and helpfull as we found througout our stay.Our room was adequate but a little tired looking,the air con worked a treat which is a must and the running water was hot and had a good pressure,the bed was large and comftable and had enough storage space a key coded safe was located in the wardrobe. We questioned the clenliness of the carpet and this was confirmed when our little boy spilled some juice, we tried to clean the spillage and was disscusted with the condition of the towel afterwards the only way to describe the carpet is filthy !!!!! The room was serviced every day but not cleaned,towels and toiletries replaced. In the morning the breakfast was good a great cup of coffee and lots of choice but be aware if you like bacon in the morning forget it its not the best ive tasted. No other food was served during the day but this wasnt a problem as there are lots of Resteraunts close by and an excellent snack bar on the opposite corner. In general the hotel was reasonable but not 4 star standard,it was ok for a few days but not for a long stay and basically you get what you pay for,i would recomend it for its good points but have a look around first before you book", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“OK hotel...It should be 3 star though”", "Author": "VasilisLeo", "ReviewID": "UR116259727", "Content": "+ : Good breakfast excellent location quiet neighborhood helpful staff - : Few facilities for a 4 star hotel trash bucket without lid at the toilet value for money", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Derry, United Kingdom", "Title": "“Good hotel ... but noisy”", "Author": "James_DCFC", "ReviewID": "UR116116670", "Content": "We stayed in the Roma Milton in July. The hotel is across the street from the Manzoni Metro station - which closes at 9pm. There is a bus stop close by. Hotel staff are really helpful. Breakfast is good and there is a big choice. We stayed in room 109. It was very noisy - non stop traffic outside all nite.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Somerset, New Jersey", "Title": "“Nice Location”", "Author": "Chubster_22", "ReviewID": "UR115526292", "Content": "Hotel was in a nice location 3/4 of a mile from the Colosseum. Friendly staff, small showers, right next to the metro station for easy travel. Tours that they helped set up were fine, not great, not bad.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Good for a tourist visit to Rome.”", "Author": "ThomasGBG", "ReviewID": "UR115496504", "Content": "The hotel is situated 15 min walk from Coloseum. Good connections with Metro and buses. Clean and nice rooms. Friendly staff. Internet in the room only by cable, not WiFi. The breakafast is OK but could have been better. An ok place to stay for a Rome visit", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Athlone, Ireland", "Title": "“Very disappointed”", "Author": "louisefoley4", "ReviewID": "UR115321426", "Content": "On check in the hotel staff were very friendly and helpful, our room was one of the larger ones as we were booked in as a honeymoon couple. The bathroom was miniscule and the door would hit the toilet as you opened it. The shower head wouldn't stay up properly so showering was awkward and caused the bathroom to flood. Our bedroom window faced the street and the noise from traffic was unbelievable! When I asked to have these problems fixed we had our rooms changed, to one half the size! The room was a shoebox and not what we payed for. Wifi is not available in the rooms, only in the lobby and costs €5 per day. The breakfast was ok but on several occasions during the week I spotted rotting fruit (oranges, kiwis, apricots and at the end of the week the watermelon). This is completely unacceptable for any establishment calling themselves a four star hotel. The only good thing about the hotel was the location. Close to the coloseum and a metro station.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bamberg, Germany", "Title": "“great value for the price”", "Author": "cbw230", "ReviewID": "UR114962520", "Content": "I stayed here with my daughter for 3 nights. We checked in at 10 pm and were greated friendly. The staff was very helpful. The room was clean and had everything we needed. We especially valued the air condition. The bathroom was small but modern, the shower roomy. Our room was toward via emanuele filiberto but since it was hot we didn't open the windows anyway. The bed was very comfortable and we slept soundly. It was fairly quiet at night. We were surprised by the variety of breakfast options. There was something for everyone and no complaints whatsoever. The hotel is conveniently located across the metro stop and truly only a 15-20 minute walk from the collosseum. A great ice cream place (G. Fassi) is located a 5-10 minute walk away. The day of our check-out we were able to leave our luggage at the front desk until we had to leave for the airport. Again, the staff was very friendly and helpful!!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "South East, UK", "Title": "“A fair price for a fair hotel”", "Author": "2Drifters2011", "ReviewID": "UR113223649", "Content": "We read reviews on here before we booked and found it helpful. The following was true for our stay (we are a couple who were on a 3 night stay and wanted to see all the sights for an affordable price): Friendly and helpful check-in desk staff - gave great suggestion for local restaurant. Air-conditioning switches didn't work in room, however could be controlled from front desk when requested (bit of a pain but easily worked around). Small room but comfortable bed and clean bedding/towels, changed daily, lots of storage and a safe. Large, clean and modern bathroom however, as other travellers on here found, the 'wetroom' shower set-up meant that water seeps out onto carpet of main room - not a problem when it's not your own home to worry about though! Great location - opposite 'Manzoni' metro so convenient (although metro closing at 9pm at present due to new line being built so a bit of a walk to main areas in evening when feet are hot from lots of walking all day). Some reviews said noisy, but no worse than any other city hotel, didn't affect our sleep. Breakfast fabulous - everything you could want, freshly made, self-service. 10/15 minute walk down to Colleseum or 20 mins walk up to main train station. All in all we found that it was ideal for a reasonable priced stay in a busy city with good metro links.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Destin, Florida", "Title": "“Decent”", "Author": "OneAverageJoe", "ReviewID": "UR113096571", "Content": "The hotel exterior and interior lobby and restaurant area were well kept and comfortable. The staff was helpful and friendly. Overall this was a nice hotel without any glaring issues. At the same time, it wasn't extraordinary in any way. The high point of this hotel is its daily breakfast, which was excellent. The low point would have to be the room decor, which was very plain and uninviting. The locaion of the Hotel was good, especially since it sits right next to a metro station. My rating would be 3.5 stars. If the rooms were updated (more welcoming decor, larger televisions, etc) then I would give it a solid 4 stars.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Chatham, Massachusetts", "Title": "“Look for a better option”", "Author": "Chathamjack", "ReviewID": "UR110672875", "Content": "We spent the last two nights at the Hotel Milton following our cruise. We were disappointed. Small rooms, minimal furnishings, sketchy neighborhood. Staff was really nice and great breakfast. Bottomline, find a better option.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“excellent breakfast, next to metro stop, excelletn hotel”", "Author": "julesr101", "ReviewID": "UR109995678", "Content": "<10 min walk to colloseum but on edge of the central city area. Right next to the metro though so not a problem for getting about as the metro is cheap (1 euro per journey) and regular. If you are one of those people who like to explore the city on foot only then staying somewhere more central may be better. However I suspect you won't get such a nice hotel for the price. <10 mins from Termini station for easy access to the airport - be aware though that if you get the airport bus to Ciampino then it only goes at certains times, not every 10mins (as we thought!) so if you miss the bus its a 30 euro cab ride to the airport. Good sized rooms, clean and comfy beds. Staff friendly and helpful. Brealfast was included which was a buffet but excellent quality and choice. Was great to start the day without having to go looking for somewhere to eat first and get straight to sightseeing.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gambrills, Maryland", "Title": "“Very convenient to Metro and Exceptionally competent and nice Staff”", "Author": "BillRaimond", "ReviewID": "UR107184514", "Content": "Location is excellent for Metro stop Manzoni which is only two stops from Termini. The hotel was clean and well run. The reception staff was excellent, especially Rosaria and Fabio, who were always a pleasure to deal with. The Breakfast was always good and well stocked with many items. The Breakfast personnel were all very capable and nice, especially Maria, Crezia, and Erica. They were all great and made our stay a real pleasure. This hotel is very lucky to have such good personnel working there. Although the room size was not large, the bed was comfortable. Although the internet was not free, it was not overpriced and the wired internet in the room worked well. Our overall experience at the hotel was very good.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Practically perfect”", "Author": "B0bfr0mbrum", "ReviewID": "UR106709116", "Content": "A great location first of all - just half a mile from the famous colosseum and right next to a metro station. The hotel was clean and tidy with attentive staff who went out of their way to speak to all the guests in their own language! Very impressive. There is a fantastic buffet laid on for breakfast every morning - quite sweetly while we were there it was Easter and there was a giant chocolate egg smashed up and ready to nibble on with your coffee over breakfast! The hotel is lcoated close to lots of restaurants literally within minutes of walking left or right. You really can't go wrong. The one slight downside is you are located on an extremely busy traffic crossroads, but you soon get used to it.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Corral de Tierra", "Title": "“Great location; an adequate facility, but very nice for the purpose of our travel.”", "Author": "drnordin", "ReviewID": "UR106584394", "Content": "We traveled on a Best of Italy tour, and stayed here for our first two nights in Rome. It is within walking distance to the Colosseum, great coffee shops, stores, and restaurants. Rosaria at the front desk was especially friendly and helpful. She steered us to two local restaurants which were two of the best three we found in Italy. If you are looking for Marriott or Courtyard quality, you won't find it here, but as a walking base for sampling what Rome has to offer, it is hard to beat,", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York, USA", "Title": "“It was ok”", "Author": "thov4", "ReviewID": "UR106528323", "Content": "The hotel is across the street from a metro station (2 stops from the main train station), so if you're going to get around Rome via metro this location would work for you. I preferred to walk around the city, and this was just a bit too far from the center of town. That being said, we did it several times, but we left in the morning and came back at night. I would have liked to have the ability to go back to my room to take breather or drop off bags. The hotel is very clean and looks like any business type hotel. Kind of reminds of a Marriott. The staff was helpful, except for some reason they don't allow irons in your room. The bathroom has one of those half doors on the tub. Maybe Europeans know how to use this, but whatever I do, I get the whole bathroom soaking wet after a shower. The breakfast ok. As other reviewers have stated the eggs and bacon were not appetizing, but you did have choice of fruit, cakes, cereal and yogurt.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Limerick, Ireland", "Title": "“Milton Hotel, Adequate”", "Author": "disey05", "ReviewID": "UR105802417", "Content": "We stayed for two nights in Rome. The hotel would not be considered a 4 star hotel in Ireland. We had 2 triple bedrooms on different floors. The were a okay for our needs but the street noise made it difficult to go to sleep. Bed linen and towels were changed. Breakfast was poor by any standards. Buffet style Bacon and egg was not inviting. I still can't get over sweet cakes for Breakfast! My main complaint was having to pay a tax on checking out. This was introduce in Rome in Jan 2011. Two nights cost us an extra €33 for a party of 5. This tax is supposedly to improve tourism in Rome!", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fairfield, Connecticut", "Title": "“A clean GREAT Value”", "Author": "Ima711", "ReviewID": "UR105417498", "Content": "We stayed for 8 nights in this converted monastery located about1Km, an easy walking distance from the heart of Ancient Rome and the Colloseum. It includes a generous breakfast buffet which is great especially considering the high price of meals on Rome and the breakfast buffet is from 7 to 10:30. The subway / tram/ and bus stops are right across the street making everything totally accessible. The rooms are modest in size as are most hotels in European cities and the bathroom is small, but that is hardly a deal breaker for anyone. The only drawback is that the rooms facing the front of this corner building are incredibly noisy from the outside street noises so sleeping with an open window is pretty much impossible. Rosaria and Fabio at the desk are excellent !", "Date": "April 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Average hotel with rude staff”", "Author": "Chrisch79", "ReviewID": "UR105118628", "Content": "The hotel itself is in quite a good location, but there are a few things that could be addressed. The wiif is *extremely* expensive, and it took 10 minutes just to load Google - as it seems the router it connects to isn't even in the same building. When we asked the staff for a map (or even to show us where we were on one that we had found), they pretended that they couldn't speak English. I then surprised them by speaking to them in Italian, and they just ignored me. The next day when the remainder of the tour group arrived (including the tour director), the staff could then magically speak English and were happy to help... Like another reviewer on here, we too were unable to prevent water from flowing onto the carpet - as the glass screen was fitted to the wrong end of the bath/shower, and as it didn't extend the whole way along, it was useless. There was some quite beautiful music that we could here in the rooms, coming from down the street, at 5pm every day... Not sure what it was, but it was quite lovely - if you stay here, open your window at 5pm and have a listen! :)", "Date": "April 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lynton, United Kingdom", "Title": "“Would stay again but some issues need addressing...”", "Author": "walker43", "ReviewID": "UR105062720", "Content": "Location is fairly good - right opposite a tube station that will take to the vatican, spanish steps, main train station (termini) etc (watch out for pick pockets - my wallet went missing). Only 15 mins walk to collesseum and the forum etc. It is quite possible to walk all over from this hotel if you are fairly fit. Breakfast is fine if you like cakes and fruit - the bacon and scrambled egg were poorly cooked and only luke warm - rather unpleaseant. Coffee is a serve yourself affair from a vey poor machine - I cant remember having had a worse coffee for years, strange in a country where they take pride in their coffee. Boiled eggs and cold meats were ok. Don't come here if breakfast is the most important part of your stay in a hotel. Rooms were very good - at least ours was, clean, fresh towels, fairly large with a safe and all mod cons. Only drawback was the noise from the roads outside (very busy), but this could have been aleviated if the windows had shut firmly. Staff were friendly enough when you came into contact with them but I wouldn't say that service was this hotels strongest point. To sum up - we would stay here again since it was such good value through expedia (£600 for 4 nights incl flights from bristol uk) and if we could get a quieter room. We spent the vast majority of our time out of the hotel which you will probably do too. The vast majority of the places we went to were free - vatican, spanish steps, pantheon, trevi fountain etc, and the churches were all full of fantastic works of art, so sightseeing will not break the bank. Restaurants and cafes in the centre of Rome will charge 6 or 8 euros for a very small beer or coffee, so be warned. Slightly out of the centre the prices fall rather and are much better value.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Definitely not 4 star!”", "Author": "ForeverYoung50", "ReviewID": "UR103596226", "Content": "Our small room had worn carpets, grubby walls, was sparsely furnished and not very nice. The bathroom was terrible. It was small and the shower head was broken and kept falling down so we had to tie it up as best we could. When having a shower, we were unable to stop water flooding the floor which in turn, soaked the carpet outside in the room. The room was hot but opening a window wasn't an option as the street noise from the busy corner (trams and cars) was too loud. The location was alright as far as getting to the Colosseum and Forum and even Roma Termini was within 15 minutes walk. There's also a subway station across the street. However, there weren't any decent eateries close-by only a small coffee shop on the opposite corner with so-so food. The service at this hotel was fine and the front desk helpful, but the biggest complaint we had was the breakfast. The only way to describe it was awful! Their coffee machine served the worst coffee we had in all of Italy, it was dreadful! This and the very limited menu choice meant we looked for breakfast elsewhere the next morning .. even though breakfast was included in our rate. On checkout, we discovered we had to pay a tax of 3 euros per person per night for staying in 4 and 5 star hotels in Rome. As we didn't consider the Milton Roma to be 4 star, this was adding insult to injury!", "Date": "April 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Good location. Across the street from the subway”", "Author": "Smurfette081", "ReviewID": "UR102303414", "Content": "Room was not so bright and not very clean. Free wifi. Nothing special. Size? It's great compared to most hotels in Rome. Great breakfast. Love the yoghurt. Hotel is located right across the street from the subway which line takes you to most of the city's attractions.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ithaca, New York", "Title": "“Friendly staff, clean and comfortable rooms, great location, free breakfast is amazing”", "Author": "KER14886", "ReviewID": "UR101033586", "Content": "I stayed in the Hotel Milton in Rome for 10 days last week. The hotel was exceptional and made the trip for me. It was a great location with many places within walking distance and, for those that weren't the metro was right outside the front door. The room, though tiny, was comfortable and clean. The staff was always friendly and helpful. They really went out of their way to make me feel like I was at home. And the breakfast buffet was phenomenal. That alone was worth the price of the room. Amazing selections and it all tasted great too. And the breakfast room lent itself to getting to know your fellow travelers. From reviews I read before the trip, I went up the street about half a block to use a more economical internet cafe, rather than the hotel's service. Also discovered a great little restaurant up that same street.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great staff, great location!!!!”", "Author": "Reddickie", "ReviewID": "UR98703989", "Content": "Just got back from a great long weekend in Rome, the location of the hotel ideal with the metro just across the street,and many sights within ten minutes walk. The staff were all very helpful and friendly and always willing to offer advise. The rooms were good value for the money. The buffet breakfast was very good with lots of choice. I will be returning to this hotel in the future!!!!!", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Great hotel, excellent location”", "Author": "looking4adventure20", "ReviewID": "UR96374633", "Content": "I stayed in this hotel in Sept. 2009. Excellent location, across the street from the metro. The metro is very easy to nagivate. Excellent buffet breakfast. There is a computer available in the lobby for guest to use. It is expensive, I highly recommend using the cheap internet cafe located down the road from the hotel. Walk in the direction of the metro stop......and keep walking. Eventually you will come to it. There is also a nice gelato shop on that street. Room was clean and small however I only used the room to sleep therefore it is an adequate size. Clean bathrooms, not too small. I had no issues with noise, I slept soundly. There was a safe in the room. Front reception service was great.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Antrim, United Kingdom", "Title": "“Still almost faultless”", "Author": "TallSeaBird", "ReviewID": "UR95875308", "Content": "This was my second stay at the Milton Roma, pretty much as before, possibly not as many staff about so things were a bit slower at check-in/out and in the breakfast room but not of any major concern. This time we had a slightly smaller room and the bathroom had a shower cubicle (no bath). There was a rail above the cubicle where the shower curtain had been so I guess this was one of the rooms that had been fitted with a cubicle last Autumn - on a scale of 1 to 10 I would give it about a 3. The cubicle opened at a corner with 2 half doors sliding back from the corner but when fully opened I could hardly get through the gap and it was very easy to unhinge the doors. Also the shower head wouldn't stay up, you either had to hold it in your hand or somehow try and wedge it into a position - I had thought of buying a tube of superglue but I didn't think the owners would have appreciated that. All in all I would definitely stay here again, I would just like to see a bit more design/attention paid to the showers.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Luton, United Kingdom", "Title": "“Not luxurious but functional - useful as a cheap base for exploring the city”", "Author": "The_Ross_UK", "ReviewID": "UR95708314", "Content": "I'd booked a single room, and upon arrival was allocated the smallest room I have ever stayed in - approx 2m x 3m. The room was directly under some machinery on the roof, with noise audible throughout the night. I endured two nights before asking to be moved, and was then given another single room 3 or 4 times larger and much quieter, just down the hall. The rooms could do with a bit of TLC - carpets are faded and marked, furniture and walls are scuffed, and housekeeping could be improved - the room was not vacuumed for the duration of my stay. AC was not functioning correctly, but the temperature was reasonable enough. TV in the room consisted of French and Italian language channels, CNN being the only English language option. Overall, the room was comfortable enough, and just about justified the £40/night paid. Staff are friendly and speak English well, and the breakfast buffet offered a variety of reasonable quality food, served until 10:30 (get in early for the full selection, as some items are not replenished). The hotel is situated on the edge of the Latereno area of Rome, and is a reasonable walk from St Giovanni's Basilica/Lateran Palace (5 minutes) and the Colosseum (15 minutes). The walk from Termini station (20+ minutes) is through one of the rougher areas of town, and I wouldn't recommend making this trip at night unless in a group. The hotel has a bar/restaurant, and there are a couple of grocery stores in the immediate area, along with a snack bar, pizza shop, chinese takeaway, ice cream shop and cinema. Although the hotel is directly opposite the Manzoni metro stop (line A, 2 stops south of Termini), due to engineering work there is no service on the line after 9pm, 6 days a week (Saturday until 1:30am) until April 2012. There is a replacement bus service, but it is much slower, somewhat sporadic, and generally crowded. Something to bear in mind if you're intending on spending evenings in the city centre, as there is not much evening entertainment on offer in the immediate vicinity.", "Date": "February 6, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glendora, California", "Title": "“Good quality room, good breakfasts”", "Author": "terry919", "ReviewID": "UR93996245", "Content": "We stayed here for 5 nights. Three nights on our own and 2 more with a tour group prior to a extensive tour of Italy. It is conveniently located across the street from the metro. A short walk to the Colloseum & Forum. The staff was friendly, breakfast was great with many choices. The room was clean but small, as the be expected. They do shut off the A/C in the fall and it was very warm in the room. You can open the window but no screens and street noise below. The only other problem is the shower/tub combination. There is only a partial glass enclosure you must be careful not to flood the bathroom. We learned this first hand. Ask for a room facing the inside instead of the street, which we did. There is a Internet shop just down the block and a great gelato shop on the same street. It is a good hotel for travelers who are active and tired at night!! Good value.", "Date": "January 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Great location, good place to rest at the end of the day”", "Author": "travellingband_936", "ReviewID": "UR91241787", "Content": "The metro is right across the street which makes the city accessable. Pretty much every stop on the red line has some thing to see. I used the blue line only to get to the Coloseum, which is can be reached walking fairly easily too. The hotel has a great breakfast and a safe in the room. I had to change from the first floor to the third because of street noise issues. The carpets are a bit worn, the bathroom had a shower only with a short curtain making it easy to flood the place. The staff was friendly for the most part, espesially Fredrico and Rosario. I used the bus to get to the Pantheon. The Bernini metro to get to the Trevi. The hotel rooms are small, like Europe if you're not used to that., There is and internet cafe two doors down, so you shouldn't have to pay the 4 euros at the hotel. There is also a decent restaurant across the street. All in all, I enjoyed my stay.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Venice, Italy", "Title": "“fabulous staff esp. Fabio and Lonette.”", "Author": "michele7303", "ReviewID": "UR89346811", "Content": "The hotel is across the street from the Metro and only 10-15 minute walk to the Colosseum. The Metro is VERY easy to navigate. We recommend you use \"hop on, hop off\" bus one day, then use the metro to get around. Fabio (reception) and Lonette (restaurant) were wonderful, giving us kisses as we departed. We felt like we were leaving our family. Would certainly come back to the hotel. The rooms are small but comfortable. Breakfast each morning was delicious and plentiful.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Hotel with a great personal”", "Author": "CEwarrior", "ReviewID": "UR89070689", "Content": "This hotel is located on the heart of old Rome Easy access to everywhere by metro or bus Great place to stay", "Date": "December 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "essex", "Title": "“Great Breakfast for the Money”", "Author": "marion3034", "ReviewID": "UR88770146", "Content": "We stayed here for a two night visit. The hotel is ideally located right next to the metro, and therefore only a few minutes from all of the key tourist places. The metro is really cheap- 1 euro for a 75 minute ticket or 4 euro's for an all day ticket. Breakfast offered lots of variety and was good value for money. Staff were polite and helpful. Rooms were clean- but the TV only offered poor reception and Italian programmes- luckily I wasn't there to watch T.V! I would recommend this hotel to anyone wanting a cheap break, with breakfast included, close to the attractions. The Colluseum was only about 10 minutes walk away. Our room did experience a lot of noise from trams and traffic- but I didn't mind- I wanted to get upm early and experience Rome.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "redcar", "Title": "“spoilt by one item”", "Author": "redscarfox", "ReviewID": "UR85955472", "Content": "Myself, wife ,daughter and friend stayed at this hotel for one night We were generally happy with and impressed by the hotel The staff were efficient and friendly the bedrooms ok and the buffet breakfast better than OK so what spoilt the stay? the fact that one of the obviously freshly laundered bath towels had a big lump of dried human excrement dried into it . would this stop us using this hotel again? probably not", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great value and convenient location”", "Author": "lenusik", "ReviewID": "UR85593762", "Content": "I recommend this place as you can walk anywhere important in the old city from here. Best breakfast anywhere with free cappuchino/espresso drinks provided. 10 minutes walk to Termini and 10 minutes walk to Forum. We arrived on Sunday night and the restaurant was closed, however, the front desk guy recommended restaurant nearby that was terrific, not the average turist menu place. We were welcomed there as the Milton hotel guests. The hotel bar is tiny but the bartender was accomodating. The best way to get here is Leonardo express from FCO and 2 stops on LineA from Termini to Manzoni, don't get taken by the cab drivers who try to charge you more than fixed amount or put you into a shuttle at the cab fare. hotels.com had a special 15% savings for more than 2 nights stay so check this out.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Wonderful stay in Rome”", "Author": "EFA90", "ReviewID": "UR84317365", "Content": "I went to Rome in April with my best friend for a girl’s getaway. After considering maaany hotels, we decided to go with Hotel Milton. Finding the hotel was no problem at all, it’s right there when walking up from the Metro station. The staff was very nice and helpful. We had prepaid, and checking in was very quick and problem free. Our room was at the fourth floor, but luckily for girls with huge suitcases there is an elevator. The room was a pleasant surprise, nice space for two people, clean and lovely. The bathroom isn’t exactly enormous, but it’s really no problem at all. The location is perfect; Colosseum is within walking distance, and all the other cites is easy to reach by metro. But Rome isn’t actually that big, so you can get to a lot by just walking too. The breakfast is very nice; bread, ham, cheese, eggs, bacon, fruits and pastries. The only bad things were the coffee (which tasted like water) and that the juice wasn’t real fruit juice, but more like a non-carbonated soft drink or something. Luckily there is also tea, which is hard to mess up! The beds where very comfy! It’s a little noisy with the street right outside, but we had no problem sleeping at all. Checking out was even quicker than checking in, we just told them goodbye and left. I recommend prepaying. We got a very good deal when booking, but being student, we probably couldn’t have afforded it if we had to book directly from the hotel and pay full price. But if you can afford it, it’s definitely worth it! And it’s really not that expensive.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Perfect Hotel for a sightseeing short stay trip”", "Author": "GillyB64_10", "ReviewID": "UR84110221", "Content": "Room & bathroom both clean and nicely decorated. Although not huge in size it was more than adequate for our 3 night stay when we spent most of the day out and about. Reception staff were friendly and very helpful offering great advice and assistance when required. Breakfast was perfect for setting you up for a day's sightseeing with a large choice in the regularly replenished Buffet in pleasant surroundings. Manzoni Metro station (on the A line) was literally \"across the road\" which made transfer from Ciampino Airport very simple.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Incirlik, Turkey", "Title": "“Elegant - amazing breakfast - only a good value in the off-season”", "Author": "JLGabroad", "ReviewID": "UR83770643", "Content": "This was a nice hotel, but would have been outside of our budget had we gone in the height of the tourist season. The rooms were well-appointed and the service was fine, but not the best. Wi-Fi was paying, but the breakfast was overwhelmingly wonderful. A very shot walk from the Colosseum in a decent neighborhood.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“More advantages than disadvantages”", "Author": "ClairyK", "ReviewID": "UR83095983", "Content": "The location of the hotel is really good. It's opposite a metro station. All receptionists were very helpful, friendly and their English were good. The room had a normal hotel size. Ask for a back room, in order to be quieter. The breakfast was very nice, although the hotel employees at the breakfast area weren't very polite. Also, the breakfast area should be more clean and tidy.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Lovely, clean rooms, great location and super nice front desk”", "Author": "IvanaSydney2010", "ReviewID": "UR81458571", "Content": "I stayed here as a solo traveler very recently and was very pleased with this hotel. The location is very very good and their are excellent restaurants within 5-10 walking distance (you must go to Fassi - the first gelato shop to open in rome, a HUGE gelato shop near by). Don't believe reviews that say there is nothing nearby - did they even bother to ask anyone? The Colosseum is literally down the road. The rooms were clean and comfortable and there is a little courtyard. Staff were lovely and helpful. The breakfast was great, really more than expected. Everything from eggs, fruit, toast and choc croissants. Internet use is well, unusable, at $3 euro for 15 min. But it hardly matters since there are two internet cafes within stones throw - one literally next door. I have nothing bad to say about this hotel, although as a solo traveller the price I paid was a little over budget after factoring in the taxes. Overall, thanks!", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TEL-AVIV", "Title": "“Excellent value”", "Author": "BALDWIN2", "ReviewID": "UR81430983", "Content": "Visited with friends. Location was great next to metro. Recommend back rooms for long night sleepers as there is some noise in the morning. Breakfast great, friendly staff, rates - group- excellent will certainly revisit", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Very friendly and helpful front desk”", "Author": "LMBoston", "ReviewID": "UR79691505", "Content": "The daytime front desk attendent was lovely. She was very helpful and answered all our questions with a warm and friendly attitude. The hotel itself is fine. Near the metro which made getting to the Vatican and train station very easy. Clean but nothing fancy. Very small shower even for Italian standards.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Hotel Milton Roma planned my wedding”", "Author": "chico5067", "ReviewID": "UR78898819", "Content": "If you are looking for a good hotel to stay at In Rome , Italy stay at the Hotel Milton Roma.This is a nice hotel ( which used to be a convent in earlier days), in walking distance from the coloseum.They have a lovely continental breakfast bar and great service in the bar in the evening. I was looking for help planning a small roman wedding.I contacted the hotel to help me with the details.Anthony the hotel manager set up all the details for us including a car and photographer to take us around Rome to do wedding pictures.I later discovered it takes a year to book a church in Rome for a wedding.Anthony set all of my details up in less than three weeks! At this hotel we were absolutely treated like celebrities.This hotel has the best guest service I have ever seen anywhere!", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Great Find”", "Author": "ice101a", "ReviewID": "UR78519929", "Content": "According to reviews on TripAdvisor, this hotel seemed like quite the find. I was not disappointed. Hotel was very clean, staff was helpful and the price was excellent. Throw in the excellent location and this is quite a gem. I stayed 4 nights and did not regret it one bit. The hotel is located in a quiet part of Rome (removed just enough from the noise and tourist traps). There is a metro station across the street that makes exploring the city very practical. It will get you anywhere in the city in a matter of minutes. The hotel is also a short walk away from the Colosseum The only downside - I stayed in a single room and i was quite small. But, despite its size, the room was spotless and had everything a solo traveler would need. Highly recommended.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sundbyberg, Sweden", "Title": "“A great place to stay close to the colosseum”", "Author": "viber", "ReviewID": "UR76416475", "Content": "Room was pretty compact with everything you need for a few nights stay. A big+ for the free digitally locked safe in the closet. Breakfast was also very nice, and staff was very professional and friendly. Location was very good, since its close to the colosseum and right beside an entrance to the subway. Minus for the poorly designed shower, with no drainage hole outside the shower the whole bathroom was easily flooded. Also I'm not very fond of keycards, since I tend to forget them in the room when I leave. Overall the hotell was very good, good comfort and nice staff. Recomended!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Coronado, California", "Title": "“A wonderful place to stay at the end of our trip.”", "Author": "LB12345", "ReviewID": "UR73264723", "Content": "We had a wonderful experience while in Rome. The hotel was clean, comfortable, and the staff was very helpful and friendly, especially the staff in the bar. The metro stop was right across the street from the hotel and was within walking distance of many of the sites that we visited.", "Date": "August 1, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cary, North Carolina", "Title": "“Decent room but the bathroom was pretty dirty”", "Author": "KermitDFrog_72", "ReviewID": "UR73047854", "Content": "From reading the reviews, it seems like the hotel has a wide range of rooms. We had a streetside room and between the ambulance sirens and car horns, it was noisy until about 2am. We were immune to it by the second day. The good: Great breakfast. Hair dryer had a 110v outlet. Staff was very polite. Close to the Metro (which is very safe and efficient). The bad: The surrounding area is not that great. The ugly: The bathroom. The shower curtain was dirty/moldy. Water from the shower got all over the floor which causes the rooms to have a musty smell. I would stay there again but, I would certainly preview the room before accepting.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“This hotel lives up to our expectations.”", "Author": "Anna026", "ReviewID": "UR71850387", "Content": "I can honestly say that this hotel is very good. The staff go out of their way to help you,the rooms are clean and comfortable and the breakfast is more than adequate. The hotel is right next to the metro,however the surrounding area is not so pleasant. I would recommend this hotel to other people looking for a reasonable priced place to stay while in Rome.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great Hotel in a Great Location”", "Author": "Taxideftis21", "ReviewID": "UR71607103", "Content": "Great hotel, excellent service, very good breakfast. Big advantage its location next to the underground station (and close to Colosseum) from where you can visit most sightseeings easily. . Front rooms are noisy due to the traffic.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kristiansand, Norway", "Title": "“Impressed...!”", "Author": "Helge59", "ReviewID": "UR69129216", "Content": "Having my wallet stolen in the Metro, the manager of the hotel went out of his way to help. With no cash, nor credit-cards, he instructed his staff to take care of me in all possible ways. He provided a free evening meal, as well as helped me to get to the airport in a taxi. This is beyond good service - it has to do with genuine care for customers. I have stayed in a lot of hotels and some of those would score higher on luxery, but this is my best hotel experience ever when it comes to care/human relations! Coming back for sure...!Besides that, excellent location, clean rooms, wonderful breakfast... What more can you ask for?", "Date": "June 29, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Mumbai", "Title": "“Great BReakfast - No tea coffee in room”", "Author": "AbhishekG_Mumbai", "ReviewID": "UR68823863", "Content": "the breakfast buffet was nothing short of excellent! The staff were very helpful and the location was great. The only thing we missed was tea'/coffee making facilities in our room. 1 km from the Colosseum (650m posted in the elevator, but even in a straight line is more) makes the center of Rome can be reached on foot in practice. Added convenience of the subway stop at the same hotel, as opposed to some guests, not even heard a noise meter that our room was from the entrance to it. Street on which it stands the hotel is quite busy, but if someone lives on everyday in the big city it will not be felt for this reason the inconvenience. Weak outflow from the tray causes the overflowing of the water which is a consequence of the unpleasant smell rotting carpet in the room at the bathroom door. Normal price very high, but looking at other hotels at once can say that Rome is a very expensive city when it comes to accommodation.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Delhi", "Title": "“Very Comfortable”", "Author": "VKGDelhi", "ReviewID": "UR68310756", "Content": "Our check in was little upsetting as the person on the reception could not trace our booking, which was pre paid and booked thriugh Hotel.com. However it quickly got resolved when he spoke to some one on tele. Very pleasent room decor and the bathrooms very neat and clean. However, the only hotel where we were charged in Europe for internet ,12 Euros for 48 hours. Breakfast was complimentary, elegantly laid. We were also provide services of ironing our clothes in the lounge. Location is on the Metro station (Orangeline-just across the road)", "Date": "June 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Amidst the city centre”", "Author": "Trotter2017", "ReviewID": "UR67285539", "Content": "Opposite to the metro station Manzoni and 10-15 minutes walk from the Collosseum is Hotel Milton Roma. Comfortable rooms and an exceptionally good breakfast with a lot of choice. We had read quite a lot of reviews about their breakfast and it lived upto our expectations. Very friendly staff. Our room had a window facing a busy road but its quiet at night.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Winnipeg, Manitoba, Canada", "Title": "“Wouldn't recommend”", "Author": "Kenny1980", "ReviewID": "UR65597560", "Content": "We booked this hotel after reading many reviews on trip advisor - it fit our budget and we liked that there was easy access to transportation. Positives - our room was very spacious and it was a clean and the hotel is right across the street from the subway - good as a base for exploring Rome, however, the area did not really feel safe to us. It is hard to say though whether this was just the area we were in or our overall impression of Rome in general. Everything is tagged and there are few restuarants to speak of in the area. As soon as you walk out of the hotel in the morning there are \"vendors\" in your face trying to sell you anything from umbrellas to water guns. The hotel staff definitely didn't go out of their way to make you feel welcome and our room was by far the nosiest room we have ever stayed in - sirens, buses and cable cars going by all night. My husband actually got up the first night to check if the window was still open.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "El Paso, Texas", "Title": "“Do not stay here--dirty, unsafe”", "Author": "sweetz_21_83", "ReviewID": "UR65089876", "Content": "We stayed here two nights with a group of 34 people and this was the worst hotel I have ever stayed at. The rooms were dirty, our bathroom smelled like urine. We were going to ask to change rooms, but another couple we were travelling with had killed some spiders and flying insects in there room and were told the hotel was fully booked and there were no rooms available to switch to. The hotel staff did go up to the room and say they didn't see any bugs---the guests had already killed them! The street noise was incredibly loud. We were on the third and highest floor and you could hear loud honking, yelling, and traffic past midnight and it started before 5 am. I am not a light sleeper and it woke me up several times. The breakfast was ok, until some of our group had bags stolen in the dining room while serving breakfast less than 10 feet away. The only people around were our group and the staff. I'm almost positive it was an inside job, but we could not prove it. When the staff was told of the missing bags, they acted like it was not their problem and refused to call police. Some members of our group looked around and noticed an open door to the alley. The hotel said someone probably came in through the alley and took the bags. This made no sense! To get from the alley to the dining area, they would have had to pass the kitchen staff! After speaking to management, we were told this never happened before but nothing was done, the door was still open the next day. It was just too suspicious. Bottom line--do not stay here", "Date": "May 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“close to metro”", "Author": "misfitintexas", "ReviewID": "UR62900558", "Content": "I picked this hotel based on how close it was to the metro. It was perfect! There are not too many restaurants that we found close by. When we checked in, the lady was very friendly, but when we came back down and asked something, she seemed bothered. This continued thru our entire stay of 3 days. The rooms were spacious, small bathroom. A little noisy with traffic, but slept comfortably. The only English speaking channels on the tv were the BBC and CNN world which we are finding to be true at all of our stays in Italy. No free internet but there is an internet cafe around the corner which is resonable.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "JRWilcox", "Title": "“ok for short stay”", "Author": "JRWilcox", "ReviewID": "UR60949987", "Content": "As I read previously on TripAdvisor, the new annex building at Hotel Milton Roma is a little unsettling. It really isn't bad but the security on the building in lacking. I didn't mind the walk through the parking lot to get to breakfast, which by the way is pretty great for a hotel breakfast, I also didn't mind the smoke smelling hallway. I did mind the always open door to the building our room was in. Also, on Saturday evening there appeared to be some kind of night club next door. It wasn't open on Sunday or Monday but was quite loud on Saturday. If you are tired enough, you'll sleep through it, or I suppose you could join the party-ers. The room was just ok. The bed was small and the bathroom filled with water whenever we took a shower. For the price we payed and the convenience to the Metro this hotel worked for us for a few nights. The staff is friendly and helpful and you can easily get around town from here, though there is not much immediately near the hotel most everything is a short walk or metro ride away.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "South Staffordshire", "Title": "“Good Value”", "Author": "Walkers-Wombourne", "ReviewID": "UR59429800", "Content": "Good comfortable hotel conveniently located for all sights & transportation (opposite a metro stop & close to the main touritst bus stops & station). A little out of the main city ie 10 mins walk to the Trevi fountain, but this is reflected in the price (we would have paid at least half again to stay anywhere near one of the main sights in a lower rated hotel) . You do get a fair bit of noise form the road outside the hotel, as other reviews suggest, but this is a city centre & what you would expect. Good value for money & would recommend.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hertford", "Title": "“Fine but avoid the annex rooms”", "Author": "Bourbondunker", "ReviewID": "UR59269139", "Content": "This hotel is fine - well located, clean etc however I suggest you avoid rooms 100, 200 and 300 which are in a new annex. Adjacent to these rooms are two staff rooms and we were awoken by loud talking and a strong smell of cigarette smoke on our first morning (there is a little sign in the room proclaiming the hotel to be non smoking!). We mentioned the smell of smoke and also our wonky shower to reception and on our return that evening the shower was fixed and next morning there was no smell of smoke, although the talking was louder than ever. If you are an early riser or heavy sleeper you should be fine though. Other than this the hotel was fine", "Date": "March 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Perfect Location for a city Trip”", "Author": "Lars1975", "ReviewID": "UR55932630", "Content": "We´ve been in Roma for 5 days for seeing all that tourist-things and the hotel was overall a good choice. Perfect Location because Bus und Metro are just steps away. And sights like Colosseum are within walking distance. The room was small but clean, with a good bed and a clean bathroom. Breakfast was standard and the staff were friendly. The only thing to complain about is the noise of the street - so you have to sleep with closed window, which wasn´t a huge problem because we had an AC, what was absolutely necessary, because Roma in August is hot!", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belo Horizonte, Brasil", "Title": "“Very good hotel, great location”", "Author": "nacul", "ReviewID": "UR55583156", "Content": "This is a great hotel for a trip to Rome. Location is excellent: across the street from the metro, Line A. Although the metro coverage in Rome is not all that great, it's still easy to reach, and very easy to come back to the hotel after a long day of walk. Many things are walking distance from the hotel. A couple of wonderful churches very close, including Saint John Lateran, one of the Papal's basilica. Also walking distance from the Coliseum, and not far for the main downtown attractions. Rooms are very clean, bed is comfortable. There is no kitchen in the room, but I wasn't expecting it. Room is quite spacious. First floor is a little noisy, due to traffic noise, but not to disturb sleeping. Breakfast has lots of choices, enough to fill you through the morning. It looks like the hotel was refurbished recently, as furniture, carpets and rooms seem to be fairly new. Overall, excellent stay, very well recommended. Would definitely stay again.", "Date": "February 9, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfy beds, but hotter than heck!”", "Author": "SheaLuna", "ReviewID": "UR53937026", "Content": "I guess I expected something a little more from a 4 star hotel. The beds were amazingly comfortable, the rooms clean, the night staff friendly and helpful, and the bathrooms quite nice (not to mention cleaned thoroughly every day). The breakfast was mostly quite nice. It was also in an excellent location, just across the street from a Metro station, and quiet (as long as the windows were shut). The PROBLEM was that since it was November, the hotel had shut off it's air conditioning despite the fact that it was about 75F outside (and very humid) and the rooms felt like you were in an oven (it was nearly 85F inside). We had to sleep the first night with the window open which was VERY noisy. At breakfast the bacon was undercooked and the scrambled eggs were watery. Very unappetizing when looking forward to the promised \"cooked breakfast\". Day staff was exceedingly unhelpful (my wallet was stolen and they refused to help me in any way). Also be forewarned, the shower heads are located in an odd position so if you're not careful, you will turn your bedroom floor into a swimming pool! All in all, the beds, overall cleanliness, the cold part of the breakfast and the night staff were definitely 4 star. The day staff, air con, and cooked breakfast were decidedly 2 star. It's possible this would be different at the height of season. At least the air con would be on. Be warned.", "Date": "January 20, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sussex - England", "Title": "“Hotel Milton Roma”", "Author": "Econet78", "ReviewID": "UR53212556", "Content": "We stayed in the Milton Roma in January 2010 when a lot of the UK airports were snowed in - we were lucky to get to Rome but it did make the city less busy. The hotel is about 15m away from the nearest Metro station (Manzoni) and the nearest bus and Tram stops were even closer. Transport to the rest of the city was very convenient. The hotel provided a buffet breakfast which was substantial with many types of pastries, fruit and some cold meats. Plenty to keep you going for the day to come. The room was clean and equipped with a flat screen TV and safe (which is always handy). As has been commented by other Trip advisor users the shower curtain wasn't long enough and you had to be careful indeed not to get water everywhere when it was used! The staff that we saw were very helpful but to be honest we were out most of the time! We'd use this hotel if we went back to Rome", "Date": "January 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Ewing, NJ", "Title": "“Great hotel experience--would recommend”", "Author": "NikiCCEwing_NJ", "ReviewID": "UR52087711", "Content": "Upon our arrival at the Hotel Milton we were greeted warmly by Rosaria AND hit with a blast of cool A/C--both were greatly appreciated! Rosaria got us a room within 20 minutes even though we were checking in hours early. Our room was clean and the bedding and pillows were comfy. We stayed 3 nights and the room proved to be very quiet. My husband and I found everything we could have wanted at their breakfast buffet--pastries, lots of fresh fruit, cereals, yogurt, breads, meats and cheeses. We didn't try the American fare, which was scrambled eggs and bacon. Although Rosaria stands out as being super friendly, all of the reception staff were pleasant and helpful when we had tourist questions. The hotel is withing walking distance to the Colosseum and Forum and immediately next to a Metro stop--which saved us so much money in cab fare. I enjoyed my stay at the Milton and hope to be back again one day soon.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Excellent hotel”", "Author": "JFMStuttgart_Germany", "ReviewID": "UR52070717", "Content": "I just returned from Rome, where I stayed with my wife at the Hotel Milton Roma for one week. It was a wonderful experience. The hotel is very well located, to get into the Manzoni subway station, you just have to cross the road. It is a very clean and comfortable hotel, very well furnished. Rooms are very clean, breakfast very good, the staff very friendly. We definitely would love to come back to this excellent hotel.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "United States", "Title": "“Great hotel.”", "Author": "flyboyUnitedStates", "ReviewID": "UR50993868", "Content": "Just returned from Rome and stayed at the Hotel Milton Roma. I was traveling with a friend and we stayed in two single rooms. The rooms were spacious enough for a single. Very clean and nicely furnished. There is a fee for internet access but the connection was good. The front desk staff was very helpful and friendly. The breakfast was a great start to the day. Only two negatives, the rooms were extremely noisy at night. Our rooms were on the street side and the trolley wakes you up approximately every hour. A lot of beeping horns and police cars buzzing by. Definately ask for a room not on the street side. Also watch the shower, it is very easy to flood the bathroom! For some reason the shower is way too small and the curtain does not keep the water in. Otherwise I highly reccomend this hotel. Great location near Manzoni Station.", "Date": "December 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Fab location and staff . Room in not good condition”", "Author": "LucianaLondon", "ReviewID": "UR50891073", "Content": "This hotel is well located, 10 minutes down the road from the Coliseum. Rosaria from reception is a real asset to the hotel, always willing to help. All the other members of staff were friendly too. They offer a decent buffet for breakfast, however, there is no option for room service. Condition of rooms could be improved, non smoking room had a decent size cigarette burn on desk. Very cousy bathroom with few loose fittings. I would recomend this hotel only for its location, breakfast and staff friendness.", "Date": "December 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Bed & Breakfast boarding house”", "Author": "mistertrips", "ReviewID": "UR50318779", "Content": "I booked the Hotel Milton Rome based on the good reviews on TripAdvsior, on the surface it is safe and clean; albeit tired, ulitarian and poorly designed. No room service, bar or restaurant so other than inclusive breakfast there are no snacks or hot drinks available. The location is excellent, staff helpful, friendly and English is fluent, however this is not what you would expect of a hotel but of a 1950's boarding house.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Amityville, NY", "Title": "“Unexpected Delite...”", "Author": "Rhea58", "ReviewID": "UR49556115", "Content": "Bought a package tour that included 3 nights here. Wasn't originally pleased with location and I was SO WRONG. Checking in early a.m. for my single, I asked for room w/bathtub which was quickly arranged. Room itself sparse but clean w/ample toilet amenities. Bar closed for remodeling. Breakfast was a vast offering w/many pastries, fruits, juices, 3 cereals, 2 yogurts, breads, rolls, tomatos, hard-boiled eggs. The runny scrambled eggs & undercooked bacon only turn-off for a 7:30-10:30 hearty breakfast. Directly across street is the Metro A Line; next door is Tobacco store to buy metro tix. Across street is cafe; up one street on left is Fusco Risorante at Via Statilia 14 for inexpensive tasty dinner. Coliseum is a short walk away. And finally Rosario at front desk is a peach w/a welcoming warm attitude that many hotels should copy. Definitely a plus for this female solo'er.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "lemont Illinois", "Title": "“Hotel Milton - Close to Subway and Coloseum”", "Author": "liketlab", "ReviewID": "UR48601468", "Content": "This was a great little hotel that I found very conveinant to all the Rome has to offer. The subway is right outside the door which was like heaven after each long day of walking and touring. The staff was nice, the breakfast was good, but the best was being able to walk outside the door pay a dollar and go anywhere you wanted.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Iran", "Title": "“Not a 4 star hotel”", "Author": "HappyMoonChild", "ReviewID": "UR47985883", "Content": "This hotel needs renovation. The main advantage of this hotel is that it is if front of the subway station. Room was quiet small. Bathroom was small. The partition for the shower was leaking. Shower was not comfortable. They chargesd us 5 Euros for half an hour slow internet at the lobby. There was nothing special about the breakfast. It was located close to the Colssuem. In Rome city Subway line A is better than the line B.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Connecticut", "Title": "“Comfortable, Convenient, Excellent Staff”", "Author": "SJayinCT", "ReviewID": "UR47900984", "Content": "The Milton Roma provides a comfortable and convenient base when visiting Rome. Located in the eastern portion of the usual tourist area, it is across the street from a metro stop and only two stops from the termini where buses to all points can be boarded. An added plus is, when boarding a bus at the termini, you are at the initial stop and are very likely to get a seat. The basic room is clean, comfortable and well insulted from noise from adjacent rooms. As for street noise, you are in a large city. The hotel has an excellent full buffet breakfast which makes anything more than a light snack for lunch unnecessary. The hotel staff is excellent and can suggest restaurants, tours, etc. and make the required reservations.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Very good hotel in overpriced Rome”", "Author": "BobLind", "ReviewID": "UR47378145", "Content": "Very good hotel at a convenient location (2 metro stations from Termini station, Manzoni metro station in front of the hotel, and 15-minute walk to the Coliseum). Rome hotels are overpriced, so even when this hotel was not cheap, it was very good in comparison to others. Friendly and helpful staff. Excellent breakfast.", "Date": "October 20, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Good clean hotel, on the metro and good brekky”", "Author": "LucieP1", "ReviewID": "UR46132969", "Content": "This hotel was good and clean. Reception staff were really helpful and brekky was good. It is right on the metro (manzoni) stop and takes 10 mins on metro to get into city centre. 15 min bus to Trastervere. I would recommend unless you want to be in the heart of it although we never found it a problem being out of the city and you get more for your money!", "Date": "October 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Good value.”", "Author": "Capt_Haddock_99", "ReviewID": "UR45769751", "Content": "This was a decent value for Rome, especially because we were able to get one night free through an Expedia promotion. Overall we were happy, but had a few quibbles. Pros: -Location. Right across the street from the Metro. -Accommodations. Nice, but not luxurious. Cons: -Service was uneven. One staff member was super nice and helpful; the night staff member not so much. When we asked the price to make a phone call to Indonesia (our cell phone wouldn't let us call there), the clerk shrugged and told us the hotel had no list of prices by country. -Housekeeping was lackadaisical. First night we realized we had no soap, toiletries, or glasses whatsoever. Figuring this was just an oversight, we didn't say anything to the reception the next morning. Second night, again no soap or anything.. We did go down to the reception and complain - -they gave us soap. The third night we finally had our soap and glasses. It's a bit odd that the maid didn't notice on her own, though. -Breakfast. Included in our rate and good variety, but the quality is pretty low. -A bit loud. Right next to a streetcar line.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "massachusetts", "Title": "“The Hotel Milton Roma Our home away from home in Rome!”", "Author": "wiltc", "ReviewID": "UR45359485", "Content": "My wife and I stayed at the Hotel Milton Roma for 4 nights in early September and loved this hotel. The hotel was perfectly located to get to all the tourist attractions by Metro....the Metro stop was directly across the street from the hotel! Our room was ample sized and clean....the ac worked just fine....one small complaint.....the half glass shower door....who ever designed that thing must have wanted to have you clean the bathroom floor while you shower because thats exactly what happens...water all over the floor every shower! needless to say we used a lot of towels in 4 days! The very tall, very beautiful Italian woman that worked the front desk was so helpful with directions and anything else we needed during our stay...wish I could remember her name...she was great! We will definately stay again at the Hotel Milton Roma when we return to Rome.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Greenwood Village", "Title": "“Definitely not a four star hotel”", "Author": "jetsetter76", "ReviewID": "UR44019804", "Content": "I stayed at the Hotel Milton Roma for 3 nights in mid September. Pros: Close to the Metro stop. The ride takes two minutes. It is a 10-15 minute walk to Termini. Breakfast was great. It had a huge variety of the same things daily. AC works. The room I stayed in faces the courtyard and it was very quiet. The hotel faces two big streets and the tram is across the street. Single room bigger than other hotel rooms I have stayed in Rome. Cons: They made my bed but not once did they change the sheets. There was a piece of hair from the previous occupant on the sink. Yuck! The carpet needs to be updated. Internet is 8 euros per hour and it faces the reception area. Location is not in the most desirable area. I would not walk in the dark at night. Customer service is okay...not great!", "Date": "September 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Great Location, Very Clean and Helpful Staff”", "Author": "europeansummer", "ReviewID": "UR41512137", "Content": "I stayed here with my friend about a month ago and we were both very impressed! The hotel is very conveniently located - the Metro is literally across the road. The station is called Manzoni (two stops from the main station Termini). It surprised us that you can travel anywhere on the Metro in Rome for just 1 euro. Simply purchase your tickets at the station from the machine - it's very simple! The Metro in Rome isn't too extensive but is still useful to get to all the major tourist attractions. We had booked a double room for pure convenience but when we arrived at the hotel the staff informed us they would have to put us in two separate rooms as no doubles were available. They were extremely apologetic. This didn't bother us as it meant we each had our own bathroom! The rooms are basic but very clean, comfortable and very quiet. The air conditioning was a blessing as it was extremely hot in Rome. The staff at this hotel were extremely helpful. There is one particular lady that went out of her way to point out all the attractions that we should see. They always greeted us as we came and went from the hotel and were always willing to help. In brief, Hotel Milton Roma is good value for money. If I were to go to Rome again I would definitely stay here.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Adequate / Convenient”", "Author": "mclassic", "ReviewID": "UR40125492", "Content": "I stayed here for 3 nights. The hotel is adequate. Because I was a solo traveler, my hotel room was small. It suited my needs. The bathroom was very nice and the bed was comfortable. The hotel was having an issue with the Internet for people who want to use their own laptops. They have a PC in the lobby area that you have to pay to use. There is a very cheap Internet Cafe about two blocks past the Lazio Cafe directly across the street from the hotel. Use that if Internet is a necessity. The hotel is located just across the street from the Manzoni subway station (Red Line). It's very convenient for getting to all of Rome's major attractions. The hotel is also within moderate walking distance to the Colosseum. The area the hotel is located in is somewhat of a question. Be careful when walking around at night. And, absolutely do not walk to the hotel from the Termini station. It is much better and safer to take the train to Manzoni. The hotel's breakfast is outstanding. I wish I didn't have to leave early on the day of my checkout so that I could have had the breakfast once more. If you need a clean, comfortable and convenient place to stay, definitely consider this. Check your other options before reserving here, however.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good value for money but not a 4 star hotel”", "Author": "baoyaxigua", "ReviewID": "UR39889228", "Content": "Hotel staffs are very helpful and provided us the tips about the city. The room is really small and the bathroom is just basic. It does not have a shower curtain so the water went eveywhere and the carpet in front of the door got wet every night.Hotel locates ou30 seconds outside of the metro station which is convinient but i could hear the train going down under the ground as i live on the ground floor, Air conditioning was noisy as well. Breakfast was really impressive. Good range of hot and cold food to choose Will recommend it as it is cheap but when make the booking in future, pls do avoid rooms on ground floor", "Date": "September 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Barnet, North London, UK", "Title": "“Nice and comfortable hotel. Does exactly what it says on the tin!”", "Author": "Beechmont45", "ReviewID": "UR39808750", "Content": "My girlfriend Jo and I stayed at the Hotel Milton Roma for 8 nights in mid-August. The first thing we noticed about the hotel was how clean it was. The rooms and common areas were spotless. The air conditioning was very effective in the bedroom at all times and made a welcome change from the searing heat outside. The room, although a double, wasn't huge, but had all the amenities you need - except that being English, we would have liked a working English news channel on the TV. Instead we had to make do with CNN without a picture as it was impossible to tune in. So it may as well have been US radio news we were \"listening\" to. Apart from that, the room and bathroom were cleaned thoroughly every morning whilst we ate breakfast, so that when we came back up to our room again it was all done. As for the breakfast, we were very pleasantly surprised. I read in the previous review that the scrambled egg and the bacon were cold and congealed. This was far from true. The very friendly staff in the breakfast room and kitchen were constantly replacing any food that had been left standing, or was running low. There was plenty of choice from fruit and cereals, to cakes and pastries, cold meats, egg and bacon, to choices of bread and rolls with various cheeses. A self-serve coffee machine provided lattes, cappuccinos, espresso, etc and was hot and delicious! Basically, we were delighted with the breakfast! The location of the hotel was approx 25 metres from the nearest Metro \"tube\" line Manzoni which couldn't have been more convenient! Once on the Metro, you can travel to all the main sightseeing areas for a single flat rate of €1 per trip. The main station Termini is only 2 stops away. We hired a scooter from there from a great company called Treno e Scooter Rent, Rome Termini railway station - Piazza dei Cinquecento, [--] [--] for the whole time we were in Rome and the hotel kindly let us park it safely in their car park for free. So to sum up, the Hotel Milton Roma is a no-frills hotel, but well-located, spotless, comfortable, great breakfast, friendly staff (especially Rosanna Canzonieri on reception) and good value for money - we booked through Expedia. If I had to mention ONE small gripe, and it is small, that was being charged a minimum fee of €4 for 15 minutes to use the Internet in the hotel lobby when we only wanted to look up an address. If they have Broadband running anyway, I think it's a bit steep to charge a minimum of £3.50 to use the service. But as I say, that was my only gripe! Having said that, they don't charge for using the safe in the room like some hotels! If I was to visit Rome again I would definitely go back to the Milton Roma.", "Date": "September 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Belfast", "Title": "“Decent hotel and location - a few niggles!”", "Author": "Spanglor", "ReviewID": "UR39431631", "Content": "Stayed for a long weekend at the end of August. Weather was very hot and the A/C, while welcome, was ineffective. Staff generally pleasant and accommodating however the night porter at the front desk may as well be a manequin as he was simply unable to answer any questions or get anything done! Breakfast buffet comprised a good range of cold foods (lots of sweet and savoury, fruit, juices, etc ) hot food (scrambled egg and bacon) was consistently cool and congealed. We paid for double rooms for single use and got a good deal on Expedia. Would recommend the hotel as good VFM, decent location - waling distance to lots of places and metro opposite. Roma/Lazio bar across the way was a bit of a rip off but Revenge cafe further along the street was nice", "Date": "September 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Orange County, CA", "Title": "“Affordable, value, & location”", "Author": "cheaptravelbug", "ReviewID": "UR39288066", "Content": "We paid $130 per night and was here for 4 nights. It was a 15 min walk to the Coliseum, and the metro station was literally right across the street from the hotel. The hotel itself is a medium size boutique hotel with a breakfast cafe and a bar. After reading the reviews I specifically requested a room facing the car port away from the street. Upon arriving in Rome, it was very easy to find and the hotel and the room had all the modern ammenities. The room is very SMALL but it does have a recently upgraded modern bathroom and a large window which had a great view. The breakfast was probably much more over the top to be considered true European. They had a full buffet from pastries, fruits, mini sandwiches, and the typical continental breakfast elements (cereal, toast, eggs, etc) Everything was fresh and my fav were the blood tomatoes with mozzarella balls drenched in olive oil. The neighborhood was very safe, we walked around the nearby blocks many times and there are tons of trattorias and pizzarias along with mini deli/markets. I would stay again for the value and location, but the room was a bit too small for me even though the bathroom was fine. Between the two of us even though it still had enough space, I got a bit claustrophobic a few times. ***TIP*** The front desk gives great restaurant tips. We were very pleased with the choice of the restaurant and of course, the food in Italy is mindblowing.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Enjoyable stay - no complaints”", "Author": "Ginners_Mate", "ReviewID": "UR37861421", "Content": "Hotel was very clean and obviously very recently modernised to a very good standard. Staff were 1st class - very pleasant, smartly dressed and very polite. All staff also spoke very good English. Location to metro was spot on and could not have been closer. Was not interested in bar or restaurant facilities so cannot really comment since I never even poked my head around the doors. Having said that - breakfast was provided and was a typical continental buffet style - and could not be faulted. Would not hesitate to recommend this hotel.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto Ontario", "Title": "“Location, location, location”", "Author": "bacchante1026", "ReviewID": "UR37773722", "Content": "Hotel Milton has been my \"home\" in Rome 4 times. Via Emanuele Filiberto provides almost everything within reach. Among examples are the Manzoni subway entrance, a gelateria, a bar (Italian eatery), a pizza parlor, a grocery store, a dollar store where you can even purchase laundry detergent if you need to, a variety store where you can purchase tickets for the bus and subway, a shoe store with reasonable prices (just in case you wear out the shoes you brought), 2 internet cafes (because I refuse to pay the exhorbitant rate for internet use at the hotel), access to bus # 85 and #850 (which take you to the historic center with several stops within short walks from likely places tourists visit and enjoy shopping (Via del Corso, Piazza San Silvestro and vicinity). If you walk up Via Emanuele Filiberto, cross the street at the pink walled church (connected to the hotel at the back) and head down a street towards Via Principe Eugenio you'll find Fassi, an experience in gelato choices. The hotel has a great English speaking staff , is reasonably priced (don't book directly with the hotel though), and provides a huge selection for breakfast (including little ham and cheese sandwiches). Speaking of breakfast, hard-boiled eggs are overcooked, bacon is undercooked (in my opinion), espresso (capuccino, etc.) comes from a push-button machine so you can have as much as you want (though the staff made the real stuff for me when I asked). I usually book a double room ( not Room 109.) but have been happy in a single one.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Dirty Room, but big buffet breakfast!”", "Author": "AandN2009", "ReviewID": "UR37242110", "Content": "The staff were pleasant and they answered our questions about the city. I was not impressed with the cleanliness of the room. The bed was basic and the sheets seemed clean but the carpets were old and had water stains. The bathroom was basic but the shower didn't have a curtain that was long enough so the water got everywhere - which is probably why the carpet in the room had water stains. My husband and I did appreciate the huge spread for breakfast. Tons of food of a good variety (hot and cold). It filled us for a good part of the day.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Very Nice Hotel and Great Value!!!!”", "Author": "nytravelgal36", "ReviewID": "UR36128125", "Content": "I was just in Rome 7/11/09-7/13/09 and I stayed at the Hotel Milton which I must say it was a very good choice. I was looking for a nice hotel but reasonably priced and I found it. The room was a bit small but did the job, I really was only in the room to sleep. There was also a sfe in the room.The bathroom was very nice and updated with marble and they provided soaps,shampoo and a working hairdryer. I was quiet surprised by the lovely breakfast buffet that had everything from fruit,pastries,eggs, bacon and of course coffee,tea and juices. The hotel staff was very pleasant they were very accommadating. I came back from shopping and was in hurry to catch a tour and the staff offered and took my packages up to my room for me. They were very nice. They have a computer in the hotel lobby with internet but you need to pay for the internet for a small fee. I had my labtop but the wireless internet was not working. The hotel also has bicycles for loan if you are interested in taking a stroll around town. This hotel was not in the center of anything but it was a 10minute straight walk to the Colossium. They Metro station was right across the street which I thought was great.-(Manzoni stop). The hotel provided me with a map of all the great tourist attractions to visit and they were all metro stops along the A line-(very simple to get around). Now I'm from NY so this was a piece of cake and they subway was soooo much cleaner here in Rome. I was very determined and I basically went to all the major tourist attractions in a 2 days and was very pleased with the location of this hotel. They also had the Hop on Hop off bus stop right next to the hotel if the train is not your thing. When it was time to leave the hotel was nice enough to call me a taxi to FCO airport which cost 40 euro however it is also very easy to take the train to airport as well but I a bit too much luggage and I was by myself so the taxi was easier. So I highly reccommend this hotel to those who are looking for a very nice place to stay for a good price. Steph NYC.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“WOW! This is one of the nicest hotels this side of the US...”", "Author": "icemoose", "ReviewID": "UR36017588", "Content": "I had an amazing stay here and really enjoyed it. The hotel is clean, well maintained and the room was far above my expectation. It was my first visit to the country and the receptionist Rosanna was amazing, she helped me through the maze of venues and what to do. She had such a smile on her and made me feel like we were old friends. The bar was lovely, the breakfast was lovely, and generally this was an amazing stay. Anyway cannot recommend this hotel enough and you are guaranteed a lovely stay! Marks out of 10 --> 12 !!!", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Southampton, England", "Title": "“Reviews are correct - Excellent Hotel, location and staff!”", "Author": "BobbyPob", "ReviewID": "UR35899189", "Content": "My wife and I stayed for 4 nights, and for the price this hotel must be one of the best out there. All the good reviews about this place are spot on - good staff, rooms (except for the dodgy shower!), and breakfasts are a highlight! The receptionist moved us to a room facing the car park, which she did not have to do, but is highly recommended as the hotel is on a busy main road. The hotel is located right next to the Manzoni metro stop, two stops away from the main termini station. We walked most of the time anyway and the colloseum is only a 10 minute walk away. Would recommend this hotel and stay again!", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“A Very Good Hotel for our Honeymoon”", "Author": "LennyJ1", "ReviewID": "UR35341196", "Content": "From when my new wife and I arrived at Hotel Milton we were impressed by the warm welcome from the staff. when we got to our room at the back of the hotel we were just happy to get to our room due to delayed flights. The room was very clean with fresh towels and a bottle of Champagne and roses I asked for for my Wife. In the room is a safe which I think is extremely essential on Holiday and a nice TV (even though it is true it only has one 100% english speaking channel you dont go on holiday to watch TV). The towels and bedding was changed everyday while we was out. The breakfast that was put out was excellent with a wide range of choice (my wife did say they need a leason in how to scramble eggs). All in all the staff was great and so was our stay. Would go back.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kent", "Title": "“A hotel where they really care about service”", "Author": "MJWKent", "ReviewID": "UR34943441", "Content": "My wife and I stayed there from the 22nd to 26th June. The tall female receptionist who everybody refers to is an absolute godsend. She soon sorted out the taxi driver who collected us from the airport!! The place is clean, breakfasts are good. It may not look the nicest area but its OK. As others have said none of the main attractions are far away either by foot or Metro. Unfortunately the bar was closed on our visit but it didn't take much to find an alternative. Just cannot praise all the staff enough. It is a very welcome change. Thank you", "Date": "July 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Great Hotel Great Location”", "Author": "beckybox101", "ReviewID": "UR34598574", "Content": "Hotel is located right beside the Manzoni metro stop which links you to all main attractions and is within walking distance of ancient Rome there are a number of restaurants in the vicinity too! The breakfast was great large selection of breads fresh fruit eggs cakes and juices self service and filling enough to go and see a day of sights in Rome! Very quite but our rooms were not on the road side rooms were quite big for european standards, clean and sheets and towels changed every day! All in all a perfect choice for staying in Rome a little outside the centre so very quiet but close enough to access all the main attractions! Also safety deposit box in the room that locks by code great addition :)", "Date": "July 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Good choice in Rome”", "Author": "utt959", "ReviewID": "UR34506862", "Content": "Located down the street from the collesium and across the street from a subway station the Milton Roma was a very good choice for me. Traveling alone I chose the cheapest room available. It was small with a twin bed but clean comfortable and the staff was professsional and helpful. I would recommend the Milton to anyone.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Fantastic!”", "Author": "BILLMCC405", "ReviewID": "UR33999149", "Content": "From the moment we checked in we were impressed. The beautiful young woman who checked us in, (I beleive her name was Rosaria) was frindly and outgoing, speaking very good english and even going so far as taking a map and highlighting must see areas along with the transportation required to get there. As far as the hotel, it was great. The rooms were clean and comfortable, especially the beds. The showers were alittle difficult due to 1/2 of it being inclosed in glass and the other 1/2 open, it was hard not to get the floor wet. Other than that we could not complain about anything. We read about traffic noise, but after all it is a city. The noise was minor, and beleive me, after walking all day it made no impact on sleeping. The bed was one of the most comfortable we ever slept on! The Breakfast was adiquite with pleant of choices. One tip, go early, we went late and by the time we arrived the eggs were a little cold. Plenty of fresh fruit and pastries, all very good. Overall, we coulden't be more pleased, and will definatly stay there again when we return.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rhode Island", "Title": "“Exceeded Expectations”", "Author": "cuchiata", "ReviewID": "UR33056608", "Content": "I recently spent 5 nights at the Hotel Milton Roma and found it to be a bit of a hidden treasure. I was delighted with the cleanliness, the appointments and the exceptional breakfast offerings. Most of all I found the service and the hotel staff truly exceptional in their friendly, helpfulness and professional demeanor. The staff seemed to almost anticipate my needs and responded in an upbeat and cheerful manner. A strong recommendation from a frequent visitor to Rome!", "Date": "June 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "São Paulo / Brasil", "Title": "“Perfect Stay and perfect staff!!!!”", "Author": "Mozzys", "ReviewID": "UR32561517", "Content": "We´ve been in Rome at the Milton Hotel and we have an extremely pleasent stay!!!! The room was very clean and new and it has all that we need, minibar, safety box, dryer, good shower....The bed was the best , very comfortable. The room was just a little bit small but just like most of it in Europe, and the window room was too high so we couldn´t see too much of the street. There was no free internet acess in the hotel. The hotel staff was the best. Always very kind and helpfull. The breakfast was in a nice sunny room and food was delicious. The Manzoni metro station is just across the street and the Colosseo is ten minutes walk from the hotel. We liked very much and we will come back again!!!!!", "Date": "June 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rome", "Title": "“A thoroughly enjoyable stay”", "Author": "minniemouseRome", "ReviewID": "UR32130366", "Content": "we found the Milton Roma an excellent choice, Our friends recommended it to us.rooms were immaculate if a little small ,Bedlinen and towels lovely,The breakfast room was light and airconditioned and the breakfast was great. staff were very courteous and helpful. the milton roma is right next to the metro which is easy to use, if you are over 65 take your passport to colosseum for free entry.its essential to take comfy walking shoes. The colosseum is within walking distance of the hotel taking about 10 minutes to get there. We would certainly go back to the Milton Roma and would recommend it to anyone.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Miami FL", "Title": "“Good stay! Great service!”", "Author": "miamiicpa", "ReviewID": "UR31219509", "Content": "We had a nice stay at this hotel. Our room was on the first floor and the window began about 5 feet from the floor so our view was minimal not that there was much to see. The hotel is located across from a metro and a 5 min walk from a bus stop. The breakfast was good with good variety ( not a lavish buffet). I wish I would have stayed in a more scenic and central area (spanish steps) The staff was great. We had a pizza from the cafe across the street and it was fine. The cafe across the street is great for water and soda and storing in the hotel room minibar. Unlike other reviewers we did not experience any problems with noise. The rooms were a bit larger than other european hotels we have stayed at.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "SERRES", "Title": "“A GREAT CLEAN HOTEL”", "Author": "THANOS8", "ReviewID": "UR31191469", "Content": "I stayed at milton hotel during my vacations in rome in 19 may 2009. The hotel is very clean, the staff very helpfull, the location is great (across the street there is a metro station called manzoni).Breakfast was great too and the price was fantastic 320 euros for 3 nights. I suggest this hotel to everyone but the only disadvantage is the noise from the big road in the one side of the hotel. If u ask for a room in the other side everything would be perfect", "Date": "May 31, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Roma", "Title": "“Simply great”", "Author": "cimrox", "ReviewID": "UR30291052", "Content": "Very nice structure centrally located. All the staff is very friendly and polite. A special thank to the high, thin blond girl always smiling who has helped us at any time with a unique patience!! Thank you so much, we will be back.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "1"}, "AuthorLocation": "cebu", "Title": "“metro station is across the hotel”", "Author": "stregine", "ReviewID": "UR30110945", "Content": "The Palatine Hill, Forum and Colosseum is 15 minute walk. Rosaria, the manager is very helpful and sweet. The other lady on duty is rude. Breakfast is ok, doesn't vary much each day. Room size is ok for a couple. Matress is saggym with bedmites. Shower door is just halfway, which is common in any hotels in Europe. Floor near the tub gets wet. . Need your earplugs at night as you can hear the noise of the police and ambulance sirens, which always happens each night. No room service. No restaurants. Restaurants in the neighborhood do not offer good food. Did not feel safe dining out at night in the neighborhood Few street lights down the street. No night life around the neighborhood. Pricey for its location and service. I won't go back there again.", "Date": "May 16, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "India", "Title": "“Good Hotel but the location is not that great”", "Author": "RuchS", "ReviewID": "UR29443805", "Content": "The hotel stands right across the Manzoni Metro station - so if you are coming from the Railway station, take the Line A metro and get off at Manzoni. The colloseum is about a 15 minute walk from the hotel, and that's about the only historical site close to the hotel. One should stay near the Spagna or Barbariana metro stations if you want to be closer to most of historical sites or even the major shopping districts. The Hotel rooms are nice and comfortable, but they do not have a proper restaurant. One of the bigger halls is used for breakfast in the morning, but for dinner, one has to use the bar which has about 4 tables only. The staff is very helpful though.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Safe, convenient, clean & friendly.”", "Author": "WisconsinBadger", "ReviewID": "UR29191494", "Content": "It is easy to get from FCO airport to this hotel (FCO > Leonardo Express Train > Termini Station > Metro to Marconi stop). The hotel staff was always friendly & helpful. I appreciated the fact that they spoke English. We spent three nights in a row here, then left most of our luggage in our room while we visited other cities around Italy. We returned at the end of the week to spend one more night in Rome before flying home. I was very comfortable leaving our gear in the room for several days. Everything was in its place when we returned. I forgot our outlet/power adapter at home & they gave us one to borrow for the week. They also brought our luggage to our room when Delta Airlines dropped it off the day after we arrived in Rome. As many of the reviews state, the breakfast buffet was incredible. Of the three hotels we stayed at during our vacation in Italy, my husband said that the thought that this one was the best. There was always something that we both liked (I'm a vegetarian). Our room was perfectly nice. It did face out on to the window but the street traffic didn't bother me. Those that have complained on this site about the street traffic or room size should spend more time taking in the city... that way when you get back to your room you'll fall right to sleep! Yes the shower set up was odd, but it works & wasn't a problem. Throw an extra towel on the ground & you're set. I didn't mind that there was only one English speaking TV station. Again, you're in Italy! Soak up their language, culture. It doesn't hurt anyone to be a bit disconnected from the goings on in the world for a week. As many have mentioned, the hotel is about a 10-15 minute walk to the Coliseum (Colosseo). We walked everywhere in Rome- from the hotel to the Forum, Pantheon, Vatican, Spanish Steps, Trevi Fountain, etc. I'm sure you can take the Metro to various places but we're fit enough & found it easy to get around on foot. All in all I thoroughly enjoyed my time in Rome & at this hotel. I would recommend it to others.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "East Midlands", "Title": "“Made by the Metro!”", "Author": "rachc146", "ReviewID": "UR27774353", "Content": "The main advantage of this hotel has to be the close proximity to the Manzoni metro station on line A, which is literally across the road. As I was travelling with an elderly relative this feature was invaluable for us to get around comfortably. We took the ATRAL bus from Ciampino for 1.20 Euros which took us to the end of the metro line. Buy your 3 day pass here and save yourself a taxi fare from the airport. San Giovanni in Laterano is a very short stroll up the road, and the Colosseum is 10 mins away (nice evening walk to see it lit up at night). Not too many places to eat around he hotel, we found it better to eat elsewhere, but the pizza place over the road is good. ATM machine close by. The room was advertised with tea & coffee facilities which were not in the room on arrival, however they were provided when I queried this. Rooms were clean and adequate if a bit small. I wasn't bothered by the noisy road but you might be if you are a light sleeper. Good variety at breakfast, although the juices were not fresh. On the whole the metro proximity made the stay; I paid E111 per night for a triple room with breakfast for 3 (with Booking.com) and I thought that was fair. Rome is wonderful!!", "Date": "April 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "hampshire, England", "Title": "“Don't forget the earplugs”", "Author": "zorrobear", "ReviewID": "UR27397271", "Content": "I went with my daughter for a 4 night break in this hotel. It was a 'secret' hotel on Last minute.com, which means you are not told where it is until you have paid! The list of amenities described were all technically there, but as others have said, the room was very compact, mainly because this hotel used to be a convent according to the receptionist. We asked to change to a bigger room, but were told we were already in one of the biggest! What must the others be like???? Also, a very strange arrangement in the bathroom - the shower at one end of the bath with the screen at the other. Also, a heated towel rail fitted over the bath. A new modern suite & tiles though.The main drawback for us was that the 'climate control' was not working, and reception told us it is only for the summer, and just to open the window. I have come across this before in Italy, where summer does not officially start until mid June regardless of the temperature. As others have said, Rome is very noisy - sirens, cars honking, church bells, dogs, you name it and even dustbins being emptied at midnight! We had the choice between baking or being kept awake ( the noise only reduces slightly between midnight & 5am) , but fortunately had brought my earplugs with me! In fact, I slept very well, but not so my daughter. The good points - very clean, good breakfast & smack opposite the Metro. Near the Colosseum, but not much else, but the Metro got you to the main sights. The bad - the area not the greatest, (grafitti absolutely everywhere), small rooms (that seems par for the course in Rome though), and the lack of air con. HOT TIP - buy a 3 day Roma pass - it gives you unlimited Metro & bus travel (but not Airort Express) plus entrance to 2 attractions and discount on others. We didn't & lived to regret it.", "Date": "April 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Lancashire, Uk", "Title": "“Perceived value”", "Author": "Bimble672", "ReviewID": "UR26010450", "Content": "Myself and my partner stayed in this hotel for a five night city break and paid a bed and breakfast room rate of £72pn. Had I paid considerably more than this I would now be happily complaining about a lack of English speaking TV channels and a breakfast room toaster that had just about enough power to warm the bread before depositing it in its original pallid state. After three passes through the wretched thing I think the bread turned brown out of sheer boredom. We stayed in a first floor room with the road junction just outside our window and were not even slightly bothered by the noise. As with price, expectation precedes perception. Once you accept that a) You are in a city and b) You haven't paid the earth for your room then sleep is as easy as anywhere else. A pleasant surprise was the range of refreshment choices available on a Vatican visit. You can choose one of the cafes around the square and arm yourself with a dinner party horror story of paying £4.50 for a cup of coffee ( !!! ) or go into the excellent Vatican Museum cafe, pay £1.20 and spend the other £3.30 on three Vatican apple tarts. My one issue with the entire stay was the city itself, or more correctly those governing it. The whole place is covered by graffiti. Policing theory has, very obviously, not yet got within hailing distance of Rome and Zero Tolerance has to wait for the stalwart guardians to finish their cigarettes and gently mould an errant hair back into an otherwise immaculate hairstyle.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“Great Hotel for the money, solid 4*”", "Author": "TheHenDog", "ReviewID": "UR25915620", "Content": "Had the pleasure of staying at the Hotel Milton Roma for three nights in February ’09 and got a great rate on it. Here are my thoughts: Location Great location, within spitting distance of Manzoni Metro station. This is on the A line which takes you to the majority of the main sights in Rome. A leisurely 10-15 mins walk from the hotel and you’ll arrive at the Colosseum/Roman Forum/Palatine Hill/Arch of Constantine (all these 4 attractions are right next to eachother). It’s situated on a crossroads which has led some reviewers to complain about the noise. I have to say we had NO trouble getting to sleep - and after a busy day sightseeing followed by some vino in the evening, I doubt you will either! Service Staff at the hotel front desk were very helpful. More than happy to arrange cabs/give directions/hand out maps and point out where all the attractions were situated. Room Our room was small (I think all of the rooms in the Hotel are cosy) but was well proportioned and had everything we needed. The bathroom is a decent size (something that’s very important to my girlfriend!). One tiny gripe is that the only english TV channel is CNN. Room was cleaned daily to a high standard. Food Didn’t have an evening meal at the hotel but the breakfast was superb! I had enough yummy bacon and eggs to kill a cow! Great selection of fruit/cereals/cakes etc for vegetarians too. Summary Solid 4* hotel. Would definitely stay there again.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Milton Roma”", "Author": "cougaruk9", "ReviewID": "UR25878942", "Content": "Very Clean and tidy hotel, good breakfast, car park facing room so no noise, single room, a little small but more than adequate, literally across the road from Manzoni Metro as mentioned. Staff very friendly and helpful at all times. The hotel although central isn't actually in the centre, some prefer things like that, others may find they are a little further out than is ideal, although its only a 20-25 minute walk to the centre of old Rome. Apart from most of the other comments the hotel also offers complimentary push bikes for all its guests ... this for me was an unexpected added bonus which I'd not known beforehand although your not provided with any helmets or the like, its no different to cycling in any other major city and resulted in me seeing masses more in the 4 days than I'd have expected. No one seemed to have made use of the bikes as whenever I returned all the other bikes where in place and both Saturday and Sunday where perfect sunshine cycling conditions ... both buses and the underground metro seem frequent so you takes your choice I guess. From my experience the Navonna Piazza and Campo De Fioro were the areas that had that chill out factor where you'd happily spend the evening eating, drinking and people watching, possibly taking in a nightclub if that's your choice. Overall happy with my stay, wished I'd have been closer to the centre but the push bike more than made up for inconvenience.", "Date": "March 9, 2009"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guernsey, United Kingdom", "Title": "“Great stay”", "Author": "Mel_fuzz", "ReviewID": "UR24408134", "Content": "We stayed at the Milton Roma for a short trip to Rome. Overall I really liked this hotel. We got a great rate on Expedia. The hotel is in a quiet area but right next to the metro station so its very easy to get around. Our room was a nice size and very clean. The bed was extremely comfortable. The tv only had one english channel (CNN) which was not really a huge deal but it would have been nice to have a few more channels. The shower took a bit of getting used to. The main issue was that if the curtain wasn't pulled across perfectly water splashed out into the room. It was a little bit of a pain. On the last night the shower broke so we mentioned it to reception on our way out for dinner. The receptionist mentioned the repairman had already gone for the day but they would see what they could do. When we arrived back everything was fixed so we were very impressed. A lot of reviews mention the traffic noise. Our room faced the road and there was noise. It did not bother me at night but my husband did struggle to get a good nights sleep because of the traffic. Finally the breakfast is worth mentioning. Everything was fresh and very enjoyable. There was a nice choice of hot and cold food.", "Date": "February 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "uk", "Title": "“Near collosseum but not much else, Not 4*”", "Author": "topcat07Uk", "ReviewID": "UR23928079", "Content": "PROs: -Good breakfast -Friendly staff- gave good tourist advice -Metro across the road -can leave your bags if you have time before you go to airport CONs: -I was a bit dissapointed with the whole look of the hotel. My first thought was it was like a corner shop, with sliding doors. Nothing special - situated on a busy road. Noisy even for me. -The room window was higher than my height -The colloseum is 10/15 mins away, but even then its not a central location. So more walking! - the area around the back of the hotel is a bit rough. -Not 4* While I really enjoyed my time in Rome, I wouldn't return to this hotel", "Date": "January 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kansas", "Title": "“Good Enough”", "Author": "jene", "ReviewID": "UR22006044", "Content": "I would recommend this hotel for two basic reasons. Convenience and security. As many readers have mentioned it is directly accross from the metro station. Just as importantly, it is an A-line which is the far cleaner (safer feeling) line that connects to most major sites. I also felt we were in a very safe location. While I've heard Rome is not a dangerous city, we did wander into several unsavory areas that made me thankful for the neighborhood we were staying. Many view it as a downside that the location isn't geared toward tourists, but we found it nice to be away from the street thieves and pick-pockets of more touristy areas. The hotel offered a nice breakfast that was included in our rate. The hotel staff was fine, no major praise or complaint. We had a very loud street facing room and I found it very difficult to sleep. My husband had no problem. Overall I would say the hotel is a good value and worked well for what we needed.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Thanks for a great stay.”", "Author": "Hamo4lyfe", "ReviewID": "UR21918897", "Content": "Had a late check in with no issues. Room was small but facing the carpark (away from the main roads) which was a bonus. If booking, ask for a room by the carpark. That way, you won't have to deal with the traffic noises. Staff were excellent, friendly and helpful. Requests for extra blankets and linen changes were done with no hassle. I also recommend the hotel's breakfast, it was a great spread. Location is fantastic, the hotel is located across from Manzoni station (line A), with bus and tram services available also. Unfortunately, I got the flu during my last 2 days and luckily there was a pharmacy (Farmacia) two doors down. Also an internet and phone place next door to that - I was ecstatic. With all the internet prices that I encountered in various other countries, it was a relief to have one close by and at a fraction of the cost of what the hotel was charging. Hotel charges 4 euro for 15mins, internet place - 2 euro per hour. Restaurants, Fruiteria (fruit shops) and Tabacchi (buy metros cards from) are all located within walking distance. Would I stay here again? Definitely! The location is convenient and the staff made my stay pleasant. Mangaia Tofilau - Melbourne, Australia", "Date": "November 16, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Almost perfect but I won't be staying again”", "Author": "Dar27", "ReviewID": "UR21812440", "Content": "I'm just back from a 4 night stay in the Milton Roma with my girlfriend and we were glad to get back. For me, a hotel needs to provide just two things: 1: A clean room where I can get a nights sleep 2: Somewhere that I can safely store my belongings while I'm am out. When I travel to a city, especially one such as Rome, I don't expect to be in my hotel room for a great length of time, as there is so much to see and do. After the long days of walking around, sightseeing, in the city, all we really wanted to do was go back to the hotel and go asleep and get up, refreshed, the next morning and head off early for another day of wandering around. Like most/all hotels, there are pro's and con's with them and the Milton Roma is no different. Its then up to you to decide whether the pro's outweigh the cons or the other way around. PRO'S: Location: From either airport, you can make your way to Roma Termini Station, jump on the Line A Metro and get off at the Manzoni station. The hotel is directly across the road. Very easy. Five minutes walk down the road from the hotel is the Colosseum and the Roman Forum. For almost anything else, the Metro across the road can be used and there's a regular bus service and an over ground tram system that run by the hotel also. I didn't use the bus or tram but I'm sure they can ferry you to areas that the Line A Metro doesn't. All in all, very easy to get around the city beginning from the hotel front door. Rooms : Small but clean. TV with one English language channel (CNN). A safe, minibar and air conditioning. No complaints about the room. Hotel Staff: Very nice, friendly and helpful. While this would be expected in any hotel that you stay in, it's not always the case but no complaints here. CON'S: No hotel restaurant - I didn't mind this but others may not like the idea of a hotel not having an in-house restaurant. No room service - I must admit, I like hotels with room service, especially when you get back after a long day and just want to something quick and easy to eat, like a freshly made sandwich. Having said that, I didn't mind this too much either and there is a snack bar across the road that opens late enough. Noise from the traffic outside - This is the sole reason that I will not return to this hotel. We were on the 3rd floor, facing out to a busy junction and the noise from the traffic was incredibly loud - ALL NIGHT! The beeping car horns, police and ambulance sirens and the screeching trams was relentless. It was like the window was wide open. I am not a light sleeper but found it impossible to get a full nights sleep without waking up 8 or 9 times with the sound a tram going by. It sounded like an earthquake at times. The police and ambulance, complete with wailing sirens, were whizzing by every 7 or 8 minutes, which I was very surprised by as the Rome that I saw was very peaceful and non threatening. Its a shame that this was the case as I would have no problem in recommending this hotel to anyone who was travelling to Rome for a sightseeing trip. The location is excellent so if you are already booked in for a stay, bring earplugs, unless you're a very very heavy sleeper. There are a number of rooms facing into the courtyard away from the noisy junction so maybe that's the answer to the problem I encountered. However, I won't be going back to see if it does resolve the noise issue.", "Date": "November 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "telford england", "Title": "“Superb Great alue Hotel”", "Author": "burford8", "ReviewID": "UR21460856", "Content": "My Wife and i have just returned from a four day Roma city break we booked this Hotel last minute purely on price and were totally delighted with our choice on arrival. The Hotel is fifty yards from the Metro Station from which you can access all the main tourist places with ease the Hotel is very well equipped and clean the staff are simply superb breakfast is fabulous you will be spoiled for choice bacon and eggs, continental all you could wish for The one down side were the bar meals very expensive for what you got not well presented better give them a miss Overall a very good midpriced Hotel a bit noisy at night but then again it is on a main junction and you cant have everything will certainly stay there again when we next visit Roma", "Date": "November 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, UK", "Title": "“good hotel, great location”", "Author": "bikemonkey", "ReviewID": "UR21283876", "Content": "We picked the Milton Hotel as most of the other hotels in our price range looked chintzy and dated. The hotel itself was quite pleasant - the room was a little smaller than we're used to but not bad compared to other city centre hotels I've seen elsewhere in the world. The location was quite good - although not central, it's within walking distance of the Colosseum and (if you're relatively fit) the centre of Rome. We managed the walk a couple of times, but the Metro is so cheap (1 Euro for 75mins of travel) and convenient that it seemed to make more sense. The ticketing system is an absolute breeze to use. I had read the reviews before travelling that said the hotel was quite noisy and expected this to be people just over-reacting. We were on the first floor at the front of the hotel and I must admit, it was rather loud at night. My girlfriend got up a couple of times to check whether we'd left the window open! I'm sure if we'd been sufficiently bothered, we could have asked for a different room but we were that tired from sightseeing that we soon fell asleep anyway. The staff were exemplary, and couldn't have been more helpful. On check-in we were given a map of Rome and the lady on reception (I don't recall her name) went through which metro stops were best for which sites and gave us a leaflet of tours which could be booked through the hotel. We went on the Rome by night tour. We were picked up from the door and dropped back again later. It was nice to see all the attractions at night as some of them look twice as good. The square around the Pantheon is great for evening meals. The Pantheon itself is illuminated after dark and the square comes alive with street performers. With your back to the Pantheon, the best restaurants are opposite you and to the right. The restaurant on the left was over-priced, served the worst food we had in Rome and tried to get us to pay the 15% service charge twice!", "Date": "October 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, UK", "Title": "“A great little hotel”", "Author": "Peahead", "ReviewID": "UR21007041", "Content": "We stayed at the Hotel Milton for my sister's 30th birthday in October and had a really nice stay. The hotel staff were very friendly, the rooms were clean and modern (if a little small) and the breakfast was excellent. I'd definitely recommend staying here.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cardiff", "Title": "“Good Location, Noisy Hotel”", "Author": "emilysj", "ReviewID": "UR20982445", "Content": "Me and my partner visited rome (our second trip to rome-in which we previously stayed in welcome home residences, which I had booked again through expedia, however a week before expedia emailed advising hotel was closing down so expedia rearraned alternative accomodation for us at the hotel milton roma) stayed at Hotel Milton Roma 14-17 October 2008. The hotel was easy to find, we caught the terravision coach from Ciampino Airport which takes you straight to Stazione Termini (Main station in rome). From here we caught the Metro to Manzoni station which is directly outside the hotel. The Metro was 1 Euro for a ticket valid for 75 minutes or you can buy a 24 hour ticket for 4 Euros, either way its cheaper & quicker than a taxi. Our flight was delayed by an hour so we didnt arrive at the hotel until about 730pm. We were greeted at the front desk & given our room key along with a map of Rome. Breakfast which was complimentry is from 7am until 11am & consists of toast, crossaints either plan or with Jam or Chocolate, Sweet pastries, and one morning they even had pizza!! Also yogurts, cereal, bacon, cheese & ham rolls. We filled up on food at breakfast to last us for the day & we took some crossiants with us from breakfast in case we got hungry! The room was nice (two single beds pushed together-which is the norm in european countries) There was an LCD TV with CNN & MTV other channels were Italian. They also have tea & coffee making faciilites in the room, howvever there was no milk but when we asked at reception they got us a jug of milk, but there is a supermarket down the road. The room was on a busy main road, which was quite noisy at night as there is about 6 roads leading past the hotel & quite alot of police & ambulances passing with their sirens on. The walls were quite thin as we could here the shower running & the toilet bein flushed in the rooms next door, although we didnt hear anyone talking or the tv. The room overall though was nice and the hotel is completely no smoking. The location of the hotel is good as the metro is directly outdside which closes at 10pm each night. Its cheap & quick & the best way to get around the city, as we caught the metro to the vatican & the fontana di trevi. We visited the sistine chapel also which is a must see, as well as the pantheon & colloseum. I would recommend a restaurant we ate at on our last night called Ristorante Roma Rosae which is on via di pietra, 88, about half way between the fontana di trevi & pantheon off the main road via del corso. Overall the hotel is good in a good location with a good breakfast, only down fall was that it was a bit noisy if you have a room on the main road.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kristiansand, Norway", "Title": "“Great place to stay!!”", "Author": "KK-White", "ReviewID": "UR20693270", "Content": "I stayed at Hotel Milton Roma for 10 days this past August, and had a great stay there. Good location and very easy to get around. 10 min to Colosseum, and Manzoni metrostation just across the street, as well as busses going to and from all day.... I had a room in the back so the traffic didnt bother me at all :o) Very good breakfast, and excellent staff!!! Looking forward to going back!", "Date": "October 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego California", "Title": "“Very Nice Hotel in great location”", "Author": "3travelers_frm_sd", "ReviewID": "UR20429931", "Content": "Stayed here for four days. Staff was very friendly and helpful, especially Rosaria who was a real charm. Enjoyed the breakfasts and convenient location just across the street from the Mazone metro station which gives you excellent access to the rest of the city. Also, the Colosseum is just a short 15 minute walk away. Room was really clean and nice. Would stay here again.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Perfect location, clean and convenient.”", "Author": "jlaw1978", "ReviewID": "UR19933349", "Content": "Stayed at this hotel in a room for 3 people upon our arrival in Rome at the beginning of our 2 weeks trip. Stayed 3 nights in August 2008. Booked hotel via Expedia and paid about $240 canadian per night inclusive of breakfast. The hotel is conveniently located (RIGHT across a subway station that is 2 stops away from Termini station). No need to take a cab to the hotel as this will run you almost 30 euro taxi ride for a 5 minute distance. It takes about 15 to 20 minutes to walk to Coliseum. The breakfast was one of the best \"free\" breakfast during our trip. The rooms are very clean. Good size room. New flatscreen TV. Hotel rents bikes. Staff is helpful (especially the lady that works later shift). Internet is available but you have to pay. The elevator was not working one of the day that we were there but it did not affect us. The only bad thing to say about this hotel is that the rooms facing the street are a bit noisy. Thats all. It was a good choice. DO NOT eat at the restaurant right across the Hotel even if you are starving! It was the worst restaurant of our entire trip.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Best Place in Rome”", "Author": "BoLucky", "ReviewID": "UR19893779", "Content": "We were a party of seven spending 6 nights at the Milton. From the moment we arrived, the staff made us feel welcomed and a part of their family. The rooms were quite comfortable and well appointed. We would recommend obtaining rooms on the non-street side but the city engineers will not be taking down trees all the time. The morning continental breakfast was quite good with a wide variety of choices. We would recommend for the Hotel 'bar\" to open earlier as our cocktail hour habits begin earlier. Somewhere near 4 or 5PM rather than 7PM. We traveled at the hieght of an imbalanced exchange between the USD and the EURO but the price for our stay was quite comfortable The location of Hotel Milton is very convenient to almost all transportation needs and within a fairly comfortable walk to the Colliseum and ancient Roma. In making our reservations, the staff was very responsive to every email sent. We absolutely fell in love with everyone.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Location”", "Author": "cjm2279", "ReviewID": "UR19777977", "Content": "This hotel is great value for money. Nice clean rooms, and decent breakfast. Ideal location, only a few minutes walk to the Coliseum. Located directly oppisite the train station, really easy to get to.", "Date": "September 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abu Dhabi - U.A.E.", "Title": "“Very nice hotel”", "Author": "Backtowork", "ReviewID": "UR19334409", "Content": "We stayed 4 days in Rome in this Hotel. Very clean. Good breakfast buffet. Perfect location. Just opposite the Manzoni metro stop. Helpful staff at the reception. Extra cool waiters. Believe me just watch the waiters' actions while you are having your breakfast. So Italian…", "Date": "August 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“Make sure you get a courtyard room.”", "Author": "darnley", "ReviewID": "UR19289887", "Content": "Just had four nights in Rome staying at this hotel. located 20-25 minutes walking distance from the central train station Termini or 5 minutes on Metro to station which is right opposite hotel. Very convenient for seeing sights (1 euro per trip) 15 min. walk to Colleseum. Hotel was apparently full whilst we were staying but checking in process was quite swift and painless by friendly polite staff. Unfortunately the rooms facing the courtyard were taken but was assured that one would be available for remaining three nights. Room allocated faced the dreaded intersection which was indeed a little noisey with early morning traffic but reading previous reviews we came prepared with ear plugs. Room itself was a touch small for 4star rating but were moved to larger quieter room next day. Air conditioning was very good and needed as day temp. was very high. Breakfast was very good indeed with choice of cereal ,juices, fruit, yogurt, bread rolls, cooked meats ,cheeses, jams, toast , bacon and eggs with tea and coffee plentiful. Unfortunately like most hotels the drink prices were extortionate. May I suggest removing hotel drinks contents from the minibar, go to supermarket 10 min. walk and purchace beers, wines and water and keep them in minibar at a fraction of price.eg. bottle beers less than 2 euro. Whilst your at supermarket 2 min on same street is the oldest icecream place in Rome, its called Fassi's and is just fantastic to say the least. Overall this hotel was very clean and fresh looking with friendly staff and a good breakfast facility", "Date": "August 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kent", "Title": "“budget hotel, good location”", "Author": "TLCKent", "ReviewID": "UR19030938", "Content": "Hotel was comfortable, room was a little small but functional. Staff were friendly. Was well priced for such a good location. Hotel is about 10 mins walk from Colloseum and right across from the metro, we had and easy trip by train/metro from the airport. Not many places to eat around the hotel but as it's an easy walk to the colloseum it wasn't a problem apart from the fact that most of the restaurants were very touristy. Found a great fish restaurant on our first night, We didn't realise until we had been seated and got drinks, unfortunately, I don't eat fish, but they did me a basic pasta dish. overall the hotel was clean, friendly ad the breakfast was fine. Tip: at breakfast they have an auto coffee maker, if you like better coffee ask the waitress for one and they will go and make for you.", "Date": "August 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Wirral, Merseyside", "Title": "“Excellent 4* Hotel”", "Author": "Nando09", "ReviewID": "UR18686494", "Content": "Hotel is clean, quiet and provides a good breakfast. Loved the shower room. Air conditioned, fridge tv. It's convenient for trains (literally over the road from Manzoni train station) but a little bit too far to walk in and out of the central attractions although it is about a 10 minute walk to the Colosseum. We generally walked in and then picked up one of the many buses that pass the colosseum and walked home from there. Personally I prefer the Termini area (north of the station) to this area for convenience but coming home to a nice hotel at the end of the day more than made up for that. Internet too expensive but there is a little internet cafe just around the corner that is ridiculously cheap but closes of an evening. If you get a chance, walk down to San Giovanni in Laterano which is about 5 minutes downhill to see an absolutely wonderful church, really is breathtaking.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“Good Deal!”", "Author": "Merav_A", "ReviewID": "UR18604999", "Content": "Stayed at Milton for a whole week and had a great time! The room was spotless, the air-condition worked well, breakfast was wonderful and the staff was helpful. A metro and two bus and tram lines located right across the street connected us to wherever we needed to go. Some major attractions are a walking distance away. Good worth for money! Disadvantages: There is not much to do in the area at night. The nearby road could get noisy at night. Nevertheless – a great deal", "Date": "August 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Massachusetts", "Title": "“A pleasant stay.”", "Author": "MichaelH43", "ReviewID": "UR18321760", "Content": "The hotel room was clean, spacious and conveniently located. We stayed for 4 nights and were able to get to all the major sites in town easily, as the ancient center is a 10 minute walk, and the subway is right across the street for access to sites further away. Breakfast was good and plentiful. The hotel meets most \"average\" American standards.", "Date": "July 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“Rome with a view”", "Author": "helix77", "ReviewID": "UR18296529", "Content": "This was our first time in Rome and we did choose this hotel after reading a lot rewievs on tripadvisor. The hotel is located 1o minutes walk from Colosseo. You have the subway station right outside the hotel door, just across the street. The red line, Manzoni station. The red line is also an important line cause with this line you can get to the most of the sightings. We arrived at Fiumicino and took the Leonardo Express to Termini. From Termini we took the red line, two stations. You need to walk a bit to get to right platform at Termini and with big bags it can get a bit heavy. A ticket and the subway costs 1 euro. The hotel is at a crossing with trams, buses and cars. So if you’re a light sleeper ask for a room away from the road. The rooms 320, 321 and 322 is the onces you need to stay away from. It’s right at crossing and you will get a lot of noice. The hotel staff were kind and informed us about two trips with buses. But we also got a map over Rome were they informed us to get the red line as good way to see all things. Breakfirst was ok, were planning on eating as much as we cold before we got out on town. The had a buffet with, fresh fruits, eggs, ham, cakes and a couple of more things. Hotel has internet but it was expensive, it costed 4 euro for 15 minutes. I recommend to use the internetplace located if you go left out from the second door(not the door that face that subway) at the hotel. It is only about 20 meter from the hotel and they have internet, fax, telephone service. On you first visit you need to bring your passport. You will get a username and password that will last the hole time you are in Rome. If you go there a second time you don’t need to bring a passport. Just walk inside and login, you pay when you’re done. The price is better. 0,50 euro for 15 minutes, 1 euro for 30 minutes. The best Ice cream bar is just 5 minutes walk from the hotel, it's located at Via Principe Eugenio 65. It dosen't have a clear sign outside so you can miss it. There is also a supermarket at that road. The best thing is the location and the fact that is so close to the subway, Also across the street is Best Western President hotel and so if you want an even shorter way to the subway you should choose them.", "Date": "July 27, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Overall a good experience”", "Author": "clarkkr79", "ReviewID": "UR17958870", "Content": "Overall a decent experience with a slight hitch... We had booked a 3 night stay here about 8 weeks in advance and reconfirmed about 2 weeks in advance.. All was fine. When the two of us showed up we were told there was a computer problem and they did not have a room for us for the night, but they would have one available for the last 2 nights. After 3 flights and traveling all day from the western US, I was a little frustrated to say the least, BUT they had told me they already had a room for us in a hotel 5-10 minutes away on Via Cavour. They said it was a comparable room and we took it.. They called a cab for us, paid the cab fair, and told us in the morning if we wanted to leave our luggage at this new hotel they would gladly go and pick it up and bring it back to the Milton for us. We actually brought our luggage back on the metro the next morning around 9 AM and they had a room ready for us within 5 minutes, and asked us for a metro or taxi receipt so they could reimburse us the cost of getting back to the hotel. Now would they have been this outgoing if we only had a 1 night reservation? Can't tell. But they were very nice, and I genuinely believe them it was an honest mistake, and with the location to the metro I would certainly recommend this property to anyone looking for a nice, clean, relatively inexpensive hotel in rome", "Date": "July 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Felt Like an American Hotel (FINALLY)”", "Author": "Tannerrific", "ReviewID": "UR17556243", "Content": "Was a nice clean room. Felt like it was up to American travelling expectations. Modern, clean, newish (everywhere else we stayed was super old which is not common here in the states). The staff were okay, not the friendliest or the least friendly, decent. Loved the location (the metro is across the street! PERFECT for getting around). There aren't a lot of places to eat nearby but the little cafe across the street has some really awesome employees that speak fabulous english, (and one of them makes a killer ham, cheese, and mayo sandwhich).", "Date": "July 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Great hotel”", "Author": "ConyPard", "ReviewID": "UR17190124", "Content": "For the price, you could not beat this place. Close to the Metro and walking distance to Colesseum and other sites. Rooms are smallish (by North American standards) but, they were clean and quiet. The staff was very helpful. The breakfast buffet was excellent.", "Date": "June 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yokohama, Japan", "Title": "“Great location near Colosseum and Metro”", "Author": "amauldin", "ReviewID": "UR16426911", "Content": "Spent three days at the Hotel Milton Roma. The staff was very helpful, the breakfast (buffet) was good, and the location is great if you plan on using the Metro. The station is just across the street for getting on the A line. The Colosseum and Forum are just a half-mile walk straght down the street. Takes less than 10 minutes to walk there. The immediate neighborhood is pretty quiet, and if you get a room overlooking the courtyard, you probably won't hear a thing all night.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portsmouth", "Title": "“Great Location - Easy to reach & friendly staff”", "Author": "A13J", "ReviewID": "UR15652499", "Content": "The hotel Milton Roma was a great location, Rome is easily walkable and the metro -almost outside the hotel door- offers easy mobility and its cheap a single journy at 1 euro. The hotel offers smart, clean rooms friendly English speaking staff and good local tourist advice on arrival with a free map. The varied and excellent breakfast in the morning served 7-11 gives a great start to the day. The small bar area offer snacks and limit meal optionsn but plenty of places to eat are around every corner. The hotel is on a busy junction but not really a problem as Rome is a busy city and not for those looking for a peaceful place to visit. The hotels own website offers good pricing.", "Date": "May 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Lovely hotel, above its class”", "Author": "fussytraveler27", "ReviewID": "UR15645314", "Content": "This hotel was a pleasure to stay at. From the airport to hotel was pleasant, train to Termini station then 2 stops on the metro to Manzoni. Manzoni station is ont he door step of this hotel. but dont worry about the noise, we didnt here a thing. Check-in was very smooth, service was the Italian standard, abit lower than australian standards. The guests were mainly business and retirees who wanted a quiet and classy stay, so was a welcoming change for us two euro trip travelers. Rooms are lovely, best bed I slept in during whole 6 week euro trip, an actual king size bed, lovely pillows and specky LCD TV, tea and coffe making facilities and bar fridge. Bathroom was well equiped, however shower isnt well designed, we seemed to flood the bathroom everytime we used it. Heated towel racks are a nice touch. The breakfast was fanstastic a full buffet with cerals, fresh fruit, bacon and eggs, continetal section and the best desert table ever, thye love their nutella, and so did I. Our flight was leaving at 8pm however a late checkout allowed only until 1pm, they were happy hold our bags until 6pm though. Overall the best hotel we stayed at while on out 6 week trip. Booked on cheaperthanhotels.co.uk and paid 560 euros for 5 nights over a weekend", "Date": "May 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Best-in-class hotel for Rome”", "Author": "vagabiztravlr", "ReviewID": "UR14663277", "Content": "This is a Best-in-class hotel. Very clean and secure. Great central location, right by metro/trams/bus. Wonderful breakfast included. Only complaint is lack of Internet in the room. Nice people. Great Hotel for a World-Class city.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Auckland", "Title": "“Great place”", "Author": "mindfood", "ReviewID": "UR14248402", "Content": "Saw many great reviews on this place and wasn't disappointed. Got a great rate through Ryanair and it turned out to be excellent value. Beautiful rooms, lovely staff, great location. Only downside was that while our corner room had double glazed windows, the actual window frames themselves weren't that well insulated. The trams can be a bit noisy at night but not enough to detract from what was a great stay at this hotel. For the noise sensitive there are plenty of rooms facing into the rear courtyard which I'm sure would be quiet", "Date": "March 12, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Burton upon Trent, United Kingdom", "Title": "“Great for Price”", "Author": "MarkNewham", "ReviewID": "UR13375969", "Content": "For the money this is a very good hotel. During our trip to Rome we checked out a lot of other hotels in the city as we are coming back in May to marry here and this was far superior to a lot of the four star hotels in the city. We found many of the other hotels very dated and fusty however this hotel is much more upto date. The down sides were that the room was small (however this is to be expected in Rome) it was also quite noisy as it was road facing (again normal for Rome) and the window was high up in the room so not ideal. The room was as I say clean and modern and the breakfast buffet acceptable. I would go back here low season but not high season as the prices go up too much. The little coffee shop (and it is little) straight opposite has great cheap pasta / pizza and sarnies and was a good starting or ending place. Rome like most cities is expensive for hotel rooms and off peak this was extremely well priced howeve rliek I say we would not go back during peak season as it is too expensive for what you get. The only hotel we saw which beat this by a long long way was the Hotel S Anselmo, but then it is a lot more a night!", "Date": "February 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stoke on Trent", "Title": "“Great base for trip to Rome!”", "Author": "Fiffle", "ReviewID": "UR13227467", "Content": "After trawling through the vast lists of accommodation in Rome we found this hotel and elected to stay here. It was incredibly easy to find - catch a bus to Anagnina where you catch the Metro, from here you go directly to Manzoni, walk up the steps and there is the Milton! The rooms were very clean. Breakfast consisted of fruit, pastries, breads, cheese, cereal, coffee and 'bacon and eggs' (not really the kind we would eat - the bacon was pure fat and the eggs were very sloppy)! This aside, there was plenty to fill you and we strongly recommend the cakes! The hotel is a 10 minute walk from the Colosseum so is not as central as many other hotels but the fact that it was directly next to the Metro meant that we could reach anywhere in Rome in under 20 mins. The road was a little noisy but we managed to sleep through it (possibly assisted by the lovely Chianti at dinner)! We had a great stay here and would recommend it as a good base.", "Date": "February 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Enjoyable Stay”", "Author": "alichan", "ReviewID": "UR13060576", "Content": "There are a lot of things I can say about this hotel and I don’t even know where to start.Me and my friend has spent a lot of time researching on a hotel in Rome and we finally decided on the Milton Hotel as it was within our budget and the metro was outside the hotel.Off course, we did read loads of reviews on the hotel and we also found the same problems other people have wrote.The only thing they got wrong with our booking was we asked for a quiet room but we were put facing directly in front of the main road. A few other people has written about the road noise, but I didn’t realised it was that noisy and it continued all night, even at 4am. I felt that I never slept all on my first night there. Therefore we asked for a room change first thing the following morning. The reception guy did his best and found only one other room he can offer us at the back of the hotel. We went to see the room first and then agreed to move. It was a lot smaller and it was a double instead of a twin, but we didn’t mind because we just wanted a good night sleep. Quiet it was, but there was another problem! The shower! In our 1st room, the shower was inside the bath, but the glass screen wasn’t long enough so you will get the floor slightly wet. But in our 2nd room, the shower was on the floor, so there was nothing stopping the water from getting everywhere inside the room, including around the toilet and the sink and it also leaked out onto the carpet. We had to use loads of towels to get rid of all the water.Apart from all that, the hotel was very clean and all the staff was really friendly. Breakfast was lovely; I don’t understand why people moaned about the size of the breakfast room where there is more then 20 tables there. The section of food was brilliant too, cereal, fruits, cakes, bread and hot food, really fresh and yummy. I would recommend Hotel Milton as it is very good for the price you pay. Apart from the noise level (its noisy everywhere in Rome as nearly all the hotels are on busy roadsides,) it’s a brilliant experience after all as Rome is a beautiful place.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Ireland", "Title": "“Nice apart from small issue”", "Author": "baddiel", "ReviewID": "UR12127465", "Content": "This hotel is quite good by rome standards. The rooms are fairly small but clean and the neighbourhood is quietish and right next to the metro stop. The issue we had is for the first night they squeezed us into a single room instead of the double we had booked. Given that we didnt have a choice we accepted. We didnt mind too much although we felt a bottle of wine or choclates or a small gesture would have been appreciated given the inconvenience caused.", "Date": "December 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Great hotel”", "Author": "ashmorayw", "ReviewID": "UR10900332", "Content": "We really enjoyed our stay at this hotel. Our room was clean and spacious. It was noisy as it overlooked the main road but Rome is not the place to go if you are looking for peace and quiet! It was an easy 10 minute walk to the Colisseum and we also used the Metro which was directly across the street from the hotel. There is a limited and expensive bar service in the hotel but there are a couple of good bars across the street which are much cheaper. The staff were friendly. The internet in the hotel is very expensive but there are lots of internet cafes in Rome which are cheaper. To sum up a great value hotel for a stay in Rome.", "Date": "November 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bath", "Title": "“Great hotel, especially for the price”", "Author": "MrandMrsBBath", "ReviewID": "UR10057729", "Content": "We booked this hotel for our honeymoon based on reviews on Tripadvisor and were not disappointed. We had a room at the front of the hotel and did not find the noise a problem - much quieter than front rooms in London hotels. The shower was not a problem for us either as we had a bath with a shower screen, however another couple who just had a shower cubicle said they had problems with the bathroom flooding. Agree with the previous review though, the shower can go from chilly to boiling and back again without any input from you. The breakfast was excellent with a wide choice of items (not sure about the previous review that there was not much choice - there was something for everyone): Cereal, fruit (fresh and tinned), yoghurt, cheese and meat, tomato, scrambled eggs, bacon, bread, rolls and toast and a wide selection of cakes and pastries, coffee was also fine. We walked to all areas of Rome from the hotel quite comfortably and it is ideally situated for the colosseum and Roman forum. A good bus service from outside the hotel was well used by some guests. Staff were very friendly and helpful, with a couple of minor exceptions (breakfast cleared 20 mins early on first day and bar closed at 10.55 because the barmaid had done her 5 hours). We would certainly recommend this hotel and would stay here again.", "Date": "October 9, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "2"}, "AuthorLocation": "Stafford", "Title": "“OUR ROOM HAD BEEN DOUBLE BOOKED”", "Author": "Micmac01", "ReviewID": "UR10036174", "Content": "This is a hotel with a problem - its internet booking system. Despite having received e.mail confirmation of our 5-day booking we were told on arrival that there was no room available. The receptionist guy suggested he was having trouble with the booking part of the hotel website! But he hadn't thought to contact us in advance. Along with a Canadian couple who were having the same problem we were shipped out to a 3* hotel off the Via Cilicia which is a one long trek into the city. Not a good start to a celebration for a special birthday.", "Date": "October 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sheffield, UK", "Title": "“Milton Roma - lovely hotel”", "Author": "RuthSheffield_UK", "ReviewID": "UR10030924", "Content": "We found the Milton Roma to be a really nice, convenient place to stay. It was spotlessly clean and our double room was a decent size, with a great wall-mounted flat screen TV. The staff were extremely friendly and helpful, and had no problem in letting us have our room an hour and a half before check-in. Breakfast was great, a really good selection of cereal, fruit, youghurt, meat, cheeses, pastries, scrambled eggs and bacon, and served until 11 am. Manzoni metro station was still closed when we went (and to be honest, it doesn't look as if it was in any state to open at any point in the near future!) so the nearest Tube was Vitor Emmanuele, about an 8-minute walk away. When we arrived we actually walked from Termini, which took about 20-25 minutes with our wheelie suitcases, as we couldn't be bothered with the faff of getting on the Metro for only one stop. The Milton is also only about 10 minutes walk from the Colusseum. The only few negative points about our stay were: 1. The room did get quite a lot of noise from the street, particularly on Saturday night when everyone was out - but we took earplugs so it wasn't really a problem. 2. One of the staff tried to sell us their \"private shuttle\" to get back to the airport on Monday morning (for 55 euros, 25 euros more than a normal taxi) but when we said we wanted a normal taxi he became a bit offhand. 3. The shower, as mentioned in other reviews - curtain doesn't go all the way round the shower tray so you end up with a lake on the bathroom floor! Otherwise this was a really good place to stay, and would reccommend it to other travellers.", "Date": "October 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Nottingham UK", "Title": "“Good Hotel - a young couple review”", "Author": "Amsyyy", "ReviewID": "UR10013891", "Content": "We have recently returned from 3 nights in Rome and would summarise the hotel as follows: Positives: Clean Hotel - 4 star standard by appearance Okay Location - 10 mins from colleaseam but if i were to book again I would try to get a hotel near Piazza Nivarro as its central to everything Metro - the one opposite the hotel is closed but next nearest is only 5 minutes away (Victoria) Flat screen tv - although only english channel is CNN but there's so much to do in Rome your only likely to watch tv late at night Breakfast - Continental breakfast was Okay Staff on front desk were helpful in terms of maps, where to go and eat etc Metro closes at 9pm so we walked back past the colleaseam each evening when it was lit up - very romantic! Negatives: Shower wasnt great - water kept going from hot to cold Room service charge 5 euros Breakfast - no fresh orange juice, coffee was sub standard and it felt as though the staff wanted you to clear off as soon as possible Summary A good hotel by rome standards", "Date": "September 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Lovely Hotel!!”", "Author": "Antxl", "ReviewID": "UR8575919", "Content": "Upon arrival at this hotel which is really close to the nearest train station currently in operation, we were delighted with the lovely reception area. We booked a triple room but due to some mix up they gave us 3 single rooms for no extra charge which was great. The delightful reception staff also provided us with a map indicating key sights and info on how to get to them. The rooms are great, with the only slight problem being the shower curtain issue mentioned before in previous reports. Breakfast is wonderful with a great selection, and the scrambled eggs are amazing! All in all a great hotel to stay in with great travel links to all over the city with just a few niggling problems like the shower curtain thing. Would definitely stay again!!!", "Date": "August 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great hotel”", "Author": "nz7", "ReviewID": "UR8534796", "Content": "The hotel was great. The room was modern and very clean!! Bathroom was also modern and more than adequate. The breakfast was average I felt. Not as much selection as I had hoped but seems to be the standard for Rome hotels. Location of the hotel was great. It's not in the central area but it was fine as you can either take the bus or walk 5 mins to the nearest Metro. The closest metro station Manzoni was still closed when we went. The colosseum was also within a walkable distance (10-15mins). Just a word of warning - we landed at Ciampino airport and you can pay 30 euros max to take the taxi to this hotel. However, we were unlucky in that we had a taxi driver who didn't know where the hotel was and upon arrival to the hotel, he tried to charge us more than the 30 euros. We stood our ground and refused to pay anything more than 30 euros and he eventually left. So don't let the taxi drivers tell you otherwise!", "Date": "August 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Weekend break in Rome”", "Author": "AnneandRich", "ReviewID": "UR8464473", "Content": "We stayed at the hotel for our first wedding anniversary and had a fantastic time. The hotel was clean, the staff friendly and helpful and the facilities good. Several people have made comments about the road noise - we stayed in a room at the front of the hotel (i.e. facing the road) and although you could hear cars etc we didn't find it a problem and had no problems sleeping. The metro station outside the hotel was still closed, but there was another station 5 minutes walk away, so we still travelled around easily. I", "Date": "August 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Appreciated the service and comfort”", "Author": "chush", "ReviewID": "UR8399342", "Content": "We had a very pleasant stay in the hotel. Staff is extremely helpful and go out or their way to assist you. Rooms are clean and breakfast is excellent.", "Date": "August 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "memphis, tn", "Title": "“Great Stay”", "Author": "bandit7199", "ReviewID": "UR8398263", "Content": "Just got back from a 7 night stay at the Milton Roma. First, the staff was very helpful from the moment we checked in. They went out of their way to make our stay as enjoyable as possible. The room was not large by any means, but it was adequate for our stay. As many others have already stated, the shower situation is just plain weird. We just accepted the fact that the floor was going to be soaking wet when we finished our showers. The breakfast was really good. There was a wide selection including bacon, breakfast pizza, croissants, etc... Finally, the location was just fine. You can walk out of the hotel and be at the Colosseum within 15 minutes or be at the next Metro stop within 10 minutes. The Metro stop in front of the hotel still is not open. I read a bulletin at one of the other Metro stations that said the opening was being delayed due to archeoligical discoveries while constructing the station. Overall, the Milton Roma was a great place to stay. I would highly recommend this hotel for anyone visiting Rome.", "Date": "August 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Co Armagh", "Title": "“Pleasantly surprised”", "Author": "tessykins", "ReviewID": "UR8394921", "Content": "My husband and I stayed at the Hotel Milton for a week during July of this year, along with my sister and her partner, and I have to say that it was certainly great value for money. I was a little woried about the location of the hotel having read many reviews on this site complaining about the poor location, however I was delighted at how convenient the hotel was. Ok, it was a little far to walk to many sights, but it was very handy to the Collessum (max 15mins) and the nearest subway, which I found the best and cheapest way of getting around Rome, is only a five minute walk away - this, of course, will change when the Manzoni station opens and will mean that the nearest subway will be less than a minute away. I mean, what more could you want Our room was perfectly adequate. When we booked the hotel (via Venere.com), I asked for rooms facing onto the courtyard (an attempt to avoid the din from the noisy streets running alongside the hotel) and I'm happy to report that our request was granted with an added bonus for my sister and her partner who managed to get a room with a large balcony. Our room also faced out onto the balcony (the only one in the hotel I think) but we couldn't access it unless we climbed out the window! Our room numbers were 128 and 130 (as far as I can remember) and would be ideal if, like us, you are travelling in a group of four as we were able to sit out on the balcony at nighttime and enjoy the warm night air. On the topic of warmth and heat, the only real downside to this hotel is the noise of the air conditioner and, as we stayed during July, it was necessary to have the ac on all night in order to guarantee any kind of sleep. My advice to you is to bring ear plugs otherwise you could be in for some very restless nights. Breakfast was included with our booking and, again, was perfectly satisfactory. Of course, the now infamous coffee was a little disappointing but, hey, we were in Rome and could find a perfectly good coffee just about anywhere so were easily able to make up for the lukewarm and watery offering elsewhere. There's not much nightlife around the hotel so we forked out on a taxi most nights to the Trastevere area (an absolute must when you go to Rome - delicious restaurants and incredibly lively). The taxi fare was anything from 10-15 euros each way(depending on traffic), but this was shared between four of us so didn't work out to be too expensive. There is a gorgeous restaurant just a stone's throw away from the hotel called Romantica (or something along the lines of that), it wasn't overly expensive and the profiteroles are absolutely to die for!! Just head towards the Vittorio Emmanuelle subway, walk about 100 yards from the hotel and its on your right hand side (I promise that I don't work for this restaurant or anything, I'm simply plugging it because of those heavenly desserts!!) Anyway. overall I was delighted with the Hotel Milton and will definitely stay there again if I ever return to Rome (I did throw a euro into the Trevi Fountain so I had better return!)", "Date": "August 11, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Birmingham", "Title": "“Great except for the instant coffee at breakfast”", "Author": "Mattinbrum", "ReviewID": "UR8367027", "Content": "I agree with most of the comments so far. Lovely up-to-date rooms, good location, helpful staff. The breakfast offered a good selection but I found it strange that Italians should serve awful instant coffee out of a machine - the orange juice wasn't fresh either.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver, BC, Canada", "Title": "“Metro Station under repair!”", "Author": "barryontherun", "ReviewID": "UR8273204", "Content": "Note *** Metro station \"Manzoni\" next to hotel is still closed, dispite what the web site says *** Staff were friendly, rooms nice, and a very nice breakfast included.", "Date": "August 1, 2007"}, {"Ratings": {"Overall": "4.0", "Value": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Good value and convenient location.”", "Author": "salm0", "ReviewID": "UR8260753", "Content": "I stayed at the Hotel Milton Roma in early May 2007. While my single room was certainly small, it was very comfortable, I'd say above average, and the breakfast was outstanding, with a huge variety from which to choose. It's a little bit out of the way, if a 15 minute walk from the Colosseum could be called that, but public transport in the city is pretty good so that getting around is hardly a problem, and the price is very reasonable. The staff were friendly, fluent in English and very helpful. I'll definitely stay here again.", "Date": "July 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Boston, MA", "Title": "“Nice Hotel”", "Author": "MARodd", "ReviewID": "UR8236570", "Content": "I stayed in The Milton Roma during June 2007 and I found the staff to be friendly, the rooms to be big, clean and comfortable. The bathroom was a bis on the small side but perfectly adequate. The breakfast was very nice for a contenential breakfast. It's location is a small disadvantage as it takes 20mins to walt to the city centre but that was a minir issue. Overall I would recommend this hotel for a young couple or a lone traveller.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“One night in July”", "Author": "AnnaMM", "ReviewID": "UR8085186", "Content": "I stayed in a single room in the Milton Roma for one night. The room was a grand size, plenty of room in the bathroom, had a safe etc. The bathroom actually had a decent hairdryer! I had stayed in a 5* hotel the three nights previous, and while the 5* was allot more luxurious, the Milton Rome wasn't too bad in comparison. A more tourist hotel than business hotel, but at least the Milton Roma had a bath in the bathroom! Great after walking Rome all day. The biggest difference i noticed was the noise level in the mornings, you could hear other people's doors opening and closing which woke me up. The breakfast was OK, nothing too special, but had cereals, fruit, hot food etc. The hotel is directly across the road from a metro station, which wasn't in operation while i was there. About a 5 minute walk uphill to the next stop. The hotel was about a 10/15 minute walk from the colosseum and the forum. The staff on reception were very friendly and if you don't plan on spending too much time in your room, it might fit the bill.", "Date": "July 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "West Midlands", "Title": "“Fab hotel”", "Author": "SarahH_2007", "ReviewID": "UR8025994", "Content": "Excellent stay at the hotel, considering we were originally supposed to stay at another hotel, but there were problems with the air con so they moved us to this hotel. Check in was fine, rooms were nice and clean, cleaned every day and had fresh towels each day also. Room was okay for a twin room. Breakfast was great with lots of choice from cereals to pastries. Staff were helpful and friendly. Found everything within walking distance, although the vatican was a little too far but managed to walk to it fine as the weather wasn't too hot, would reccomend going to the vatican around 12ish as we didn't have to queue and only waited for about 5-10 mins to get a ticket once inside. The colosseum is short walk away 10-15 mins. The only complaint was that the bathroom floor got drenched when having a shower as it was a plastic screen on the side of the bath and the shower was in the wrong place, had to put towels on the floor to stop it from leaking all over the place. All in all an enjoyable stay in a fabulous city.", "Date": "June 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Mansfield, United Kingdom", "Title": "“very friendly & knowledgeable staff”", "Author": "suzysue2", "ReviewID": "UR7868786", "Content": "It took me a long time to finally decide on a hotel in Rome, partly due to the bad reviews I had read on various web sites about an aweful lot of the city centre hotels. Finally I decided on the Milton Roma & have to say that it was everthing I and my travelling companions could have wished for! As soon as we arrived, and we were earlier than the suggested check in time, we were shown to one of the rooms allocated to us so we could leave the bags etc. The other room wasn't ready at the time but would be on our return. Reception staff helped us with metro and bus routes etc. The hotel is a little way out of the City centre, it was a short walk up hill to the metro station and a 10 min ride to the Spanish steps. When the Metro by the hotel re-opens this will make it better placed. We walked 10 mins from the hotel and arrived at the Colluseum, nice flat easy walk but still a way out of the city. Hotel rooms were a little noisy as the other reviews had suggested but this is a capitol city! you should expect some noise surely? Rooms were spotlessly clean, not enormous but more than adequate. Tea and coffe making in room which was an unexpected nice touch, mini bar also. TV only had news channel in English but we had come to see the sights and not watch telly! Breakfast was very good with plenty of choice, continental of course, if you are expecting full English then this is not the choice for you! (book into Road chef!!) We got a deal with the breakfast included through Venere.com, it was 20Euros otherwise, a bit steep we thought for a bit of cereal & cuppa! Didn't eat in the evening at the hotel, we went around the Trevi and Sapnish steps, found some fab little places of the beaten track, have a look around before deciding. All in all , a lovely hotel with very friendly, helpful staff, would definatley go again.", "Date": "June 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fort Worth, TX", "Title": "“Fantastic!”", "Author": "elemschoolmarm", "ReviewID": "UR7858664", "Content": "We stayed at the Milton Roma for three nights this week. I took the advice of others on Trip Advisor and agree that it is a wonderful hotel. The rooms were clean and the staff very friendly and helpful. The breakfast was delicious and beautifully presented. It was in walking distance of ancient Rome and the bus was convenient. It is good to buy the all day bus pass from the hotel for E4. The buses run until midnight. One suggestion is to use the internet cafe right behind the hotel as it is about 1/4 the price of the one in the hotel lobby. We will definately plan to stay at the Milton Roma again.", "Date": "June 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Terrific Place”", "Author": "badwyer", "ReviewID": "UR7741984", "Content": "My family of 5 stayed here for 3 nights near Xmas 2006. The inside of the hotel is essentially brand new. Each of my 3 boys got their own room, which they loved. Both the singles and the double rooms are small but this is very typical for Europe and--who cares? You are going there for the city and not to spend time in a hotel. We had no problem with the location. There were perfectly acceptable restaurants and gelaterias in the immediate neighborhood, which also seemed quiet and safe. It was an easy walk to the Coliseum for our family and we continued walking further to the Forum and then the Pantheon before taking a bus home. There is a Metro station across the street (Manzoni) but it was being renovated when we were there. Anyway, the Metro in Rome is not extensive. It was only a 10-minute walk to the next closest station when we took the Metro to go to the Vatican. The Basilica of San Clemente is extremely close to the hotel and is definitely worth seeing. The hotel is also close to St. John’s in Laterano. The breakfast buffet was phenomenal and we usually ate enough to avoid eating again until close to dinner. One of my kids is a picky eater, but there were a variety of choices to satisfy even him. They didn’t have orange juice but instead had ACE juice, which is a mixture of carrot, and other juices that was surprisingly good. We didn’t have much contact with the staff but when we did, they were pleasant and helpful. Some people might find the street noise a bit loud. We were on the second floor and the noise didn’t bother any of us, but it was December and our windows were closed. I would definitely recommend this hotel to anyone and we would definitely go back if we return to Rome.", "Date": "June 2, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Essex", "Title": "“Could find no faults”", "Author": "Kazzer1", "ReviewID": "UR7626676", "Content": "This hotel was really nice. It was exceptionally well kept and very nicely decorated. The room was presented well..................very comfortable beds and proper pillows! Tea and coffee making facilities and a minibar plus flat screen TV (not many English speaking channels though). The bathroom was very clean........towels changed every day. The hotel's cleanliness was excellent. Breakfast consisted of fresh fruit, pastries, eggs, bacon,cereals, toast, yoghurts, juices. The staff were courteous and very helpful and friendly. The location was good but unfortunately the Metro station outside the hotel was closed due to ongoing repairs. The next nearest one was Vittorio Emanuelle but this wasn't far to walk. We had dinner in two nice restaurants which were recommended by the hotel receptionist Fabio. One of them was just a short walk away and was called 'something Bianco. The translation was The White Horse. The food and service was excellent. I would definately recommend this hotel.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, England", "Title": "“An excellent hotel”", "Author": "mr7958", "ReviewID": "UR7625399", "Content": "This is a good hotel just outside the centre of the city, but within ten minutes walk of the colloseum and fifteen minutes of the city centre. I had a single room which was small but clean and extremely comfortable. It overlooked the courtyard and was absolutely silent at night. The roads nearby did not seem unduly busy to me for Rome - the hotel does not appear to be on one of the main roads in or out of town. The breakfast was good with a wide selection of hot and cold food, but the coffee (especially the cappucino) was pretty poor, especially by Italian standards. Best of all about this hotel were the staff. They were friendly, spoke excellent English (much better than my phrasebook Italian) and extremely helpful. I would certainly return to the Hotel Milton in Rome.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Manila, Philippines", "Title": "“loved this hotel, except for its location”", "Author": "dartagnanaguilar", "ReviewID": "UR7477169", "Content": "as soon as the metro stop right across this hotel opens, milton roma would probably the best value for money hotel in rome. hotels in rome are quite pricey. and most of the time, you don't get what you pay for. but with milton roma, though it was my most expensive hotel from my europe trip, the service, breakfast, room cleanliness were worth every euro. they even asked whether i would like to be picked up from the airport when i booked my stay. which i did and the 55 euros was worth it because at least i didn't have to find the hotel knowing that because of its location it may be hard to find. the nearest metro is quite a walk, about 2-3 blocks away in a residential part of rome. rome's metro can become chaotic. the new york subway doesn't even compare. the staff is very nice, professional and helpful. the first thing they did when i checked in was to orient me on where the nearest stop was and how to get to the city's attractions through a map that they provided. though my room was small, i absolutely loved it. it was clean and modern, yet somehow it had character. check out their display of toiletries in the bathroom. i thought it was cool. the shower though was tiny, even for a small asian like me. it was hard to navigate the shower so that water won't spill over. but it's no biggie. the breakfast was well worth it because it really had variety. bring your british or american adaptors because they hotel doesn't provide one and unfortunately they don't have english programs so you'd end up watching an all italian tv program.", "Date": "April 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Seattle, WA", "Title": "“Don't book a single room!”", "Author": "Babycainsmith", "ReviewID": "UR7391028", "Content": "The rooms for singles are teeny tiny. I've stayed in small rooms but this one takes the cake. I switched to a larger room and it was fine. The bathrooms and linens are great. The rooms were clean and had everything you could ask for. HUGE problem though... the windows aren't soundproofed. This hotel sits on a corner of two very busy streets and all you hear all day (and night) is traffic. Bring earplugs... it's bad. The neighborhood is lacking the typical charm you can find in other parts of the city. The breakfast is huge and fabulous though.. for 20 Euro it should be.", "Date": "April 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Merseyside", "Title": "“Excellent - would stay there again”", "Author": "GlobetrotterS2007", "ReviewID": "UR7162627", "Content": "I booked this hotel through Expedia as a birthday present for my boyfriend after reading reviews on tripadvisor, and we weren't disappointed. The hotel is about a 5-10 minute walk to Vittorio Emmanuel metro station and is 1 stop down from Termini (metro opposite hotel still closed). From the outside the hotel looked great and it was just as good inside. The staff are friendly and helpful, the breakfast was a very good buffet with lots of choice, the breakfast room was light and airy. Our room was at the back of the hotel on the ground floor, it was nice, quiet (away from traffic - only sirens could be heard) and was kept clean and towels replaced. Very good location, only 15 minutes walk from Colosseum, we walked and or got the metro. Watch out for pickpockets on crowded metro trains or trams, try and get on at either end rather than going for the middle carriages.", "Date": "March 14, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great hotel, perhaps not the best area”", "Author": "s_neill", "ReviewID": "UR7160724", "Content": "We booked this hotel 60 minutes prior to check-in (our flight had been cancelled and, as we were flying with a budget airline, we had to make our own accommodation arrangements) and had no problem upon arrival. After four days walking in Rome and five hours in an airport queue (see bracketed comment above) we - or, more to the point, our feet - really needed some home comforts, i.e. a comfortable bed, and this hotel certainly didn't disappoint. The interior is beautifully decorated, and the rooms are excellent. LCD televisions (reception not the best), comfortable, immaculate beds, and a bathroom you would do well to beat. Breakfast is of the continental type and serves from 7-11, although the staff are a little eager to tidy up after 10.30! My only criticism would be it's location. Although it's a 15 minute walk from Termini - the main train station, which is dodgy area to be in of an evening - we didn't feel too safe walking the streets when returning of a night time. That apart, it's a very, very good hotel.", "Date": "March 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Leeds, England", "Title": "“A good find”", "Author": "cen6cw", "ReviewID": "UR6908639", "Content": "Booked this hotel via Expedia and got a good price. This was my first trip to Rome and I felt responsibility weighing heavily as I also wanted to book a room for my aunt who we were meeting in Rome and I didn't want to let her down with a crumby room or hotel. No problem! Hotel was new and was formerly a convent so expect pointy windows and high ceilings. Interior decor is excellent. The bedrooms are very well appointed with flat screen tv and tea/coffee making facilities which is much appreciated when you have come in from pounding the streets of Rome and you need a cup of tea. The bathroom was clean, new and had everything you could want, good shower and bath included too, so that was all sorted. Now, breakfast is important to get you off to a flying start and again this did not disappoint. I liked the extended hours of breakfast from 7 until 11am, very generous. Good breakfast spread, fruit juices, breads, cereals and scrambled eggs/bacon, toast, cake all served in a pleasant and airy room. Glad I chose this hotel and glad my aunt approved I would use this hotel again. The metro stop is directly outside the hotel and this is stop 'Manzoni', it is being repaired and is currently closed but you can walk to the next stop at S. Giovanni in Laterano which will take about 15 minutes. When this stop is open again it will be ideal for getting to all the important sites and getting you back to the hotel at the end of a long day. Recommend.", "Date": "March 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Good Hotel”", "Author": "Everyone", "ReviewID": "UR6856268", "Content": "Four of us (two couples) from England, spent the 21 - 25 Feb 2007 at this hotel, some what swayed by the other postive views expressed by other travellers; we were not disappointed. The service was good, with helpful staff, from the front desk to the bar lady; all responded well and were keen to make our stay enjoyable. Walking to either metro station was not a problem (the one opposite is still being repaired). We did walk miles, or so it seemed but then this is Rome and not London, so with comfortable shoes, water and a map you should be fine. I'm almost 64 with knees that are a problem to me. The youngest of our four was 59, and we all did OK with managing the many steps, queing and standing around taking in the talks and views. We used the train to come into Rome from FCO airport, and a taxi from the main station in to the Milton, and then the shuttle back from the hotel on Sunday leaving Rome. The queing, almost wherever you go, is considerable. We were told that a few years ago 400,000 visitors came to Rome, now due to the film Gladiators and Dan Brown et-al, this figure has grown to 4,000,000. We gave up on the Friday trying to access the Vatican Museum (VM) having arrived at 10.20! Succeeded on Saturday but this time arrived at 9.00, having breakfasted much earlier. Talking about food the hotel is only BB, but the BB should be read as Big Breakfast! They are good! We walk from the hotel to all the sights having prepared the night before with the map provided by the hotel and a guide book we took with us. We did see the Colosseum many times on our way back to the hotel. To visit the VM (both times) we used the Metro, changing at the main station, which was very simple to do. My italian is about four words, but what a difference it makes to try. So, do greet people and say goodbye, it is appreciated and does wonders for the service received. Small complaint, no observation about the hotel, the rooms are fairly hot at night and openning the windows is great for fresh air BUT does let in the road noise. Otherwise a great stay, both at the Hotel MIlton and Rome.", "Date": "February 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“Very, very pleased”", "Author": "CRDUSA", "ReviewID": "UR6835616", "Content": "We are a family of four (with two children ages 4 and 7) and spent Feb 18-23 at the Hotel Milton. We thought it was a great place. We were given an outstanding room in the back of the hotel with a queen-size bed and two twin beds. The room was a great size. The children had their own little area across from a spotless bathroom with nice fixtures and a hair dryer. Noise, because we were in the back, was never a problem Plus: 1. Cleanliness of hotel, size of room, newness of hotel. 2. Breakfast (I've read on this site where the breakfast was said to be \"outstanding\". I wouldn't go that far. It was okay, the pastries were uninspiring. But, there is enough choice to satisfy most anyone. The children were content with the chocolate rice krispies). 3. There is a telephone/internet place a few doors to the left if you exit on Emanuele Filiberto. This is an unbelievable convenience if you need to call internationally. It was rather cheap (if calling the U.S., you have to dial 001, area code and number, press the button on the phone after connection, then pay the attendant when done). 4. Additionally, right next door, and to the left on Emanuele Filiberto, is a Tabacchi where you can buy bus, tram, and metro tickets. Also, you can buy little souvenirs. Minuses: 1. Coffee. I have stayed in pensions and little hotels in Italy before and the morning coffee was outstanding. At the Milton, the coffee is self-service, comes out of a machine, and it was not good. I would have preferred, for breakfast, no choice and instead, been given great coffee in individual pots, with fresh pastries and various Italian breads. 2. Area. Don't let this dissuade you from staying at the Milton. It isn't all that bad. However, you are in a little bit of \"no man's\" land. It's a good 15-20 minute walk from Termini, and a 20 minute walk to the Colosseum. However, there is a bus, right across the street, and to the left, on Emanuele Filiberto, that will take you to Termini, and from there you can go anywhere (with a free transfer to bus or subway, 75 minutes after you initially validate your ticket in the yellow machine in the back of the bus). To the right when exiting on Manzoni, you'll find an assortment of buses, some that will take you to the Colosseum. The Manzoni subway stop across the street is still closed (if you have read prior reviews, you know this a thousand times already). However, the subway does not help very much for the historic sites. We took it once to go directly to the Spanish Steps. Other than that, I don't think you need the Metro at all. Stick to the buses. Miscellaneous notes: 1. We contracted with Rome Shuttle Limousine (do a Google search) to get us from Fiumincino (da Vinci) to the hotel. It was 35 Euros, an excellent bargain from what I've heard, compared to regular taxi and other services. I would have taken the express train to Termini, but since I was told I was going to have to pay for the children, financially and practically, a car service made much more sense. 2. I found the bus situation very confusing. I was never able to find a schedule, although I learned, on the last day, that I could have purchased a \"bus route\" map at the Tabacchi which gives a listing of the bus routes and numbers. That may have helped, although the map is so tiny that it was difficult to read even in the best of light. On my next trip to Rome, I will be better prepared for the buses. Do some work on the buses before you get there. 3. My face was in the city map so much, it was ridiculous. Walking around was the best, but the streets can be so confusing (they change names frequently, they end suddenly, they do whatever, etc., which makes Rome so charming). The map from the hotel is good (I had at least two on me at all times and got fresh ones everyday, because by the end of each day, I destroyed at least two). I would carry another map that you find beneficial. Maps are not always they same, and different ones can help you find different things. Also, when it gets dark, the maps become difficult to read. Rome is one dark city in the evening. Bring a small flashlight for reading the map at night. I wish I did. Also, a flashlight always seems to come in handy in a hotel room, especially if you want to get out early while others are still sleeping. 4. Eating. Since we over-ate at breakfast, we just had a small snack for lunch (slice of Pizza, folded together, and some espresso at various times during the day). Even though we are a family with young children, we tried to be like Romans and eat late at restaurants, although we still got there on the early side (around 7:30 when most re-open for dinner). If you want a real Roman experience that will bring tears to your eyes, eat at Ristorante der Pallaro, a block south of Corso Vittorio Emmanuele, located on Largo del Pallaro 15, north of Campo de' Fiori. There is no menu; they bring you courses of what they have cooked that day. It was an unbelievable experience and the proprietor, a woman who wears a kerchief around her head, will make you really feel like you've chosen the most authentic place. Rick Steves recommended this restaurant, and now, I am a big fan of his, and trust his judgment on food (that's how I found all of my restaurants and loved every one) and other matters. 4. Money. Be vigilant of pickpockets. I was very careful, looked around a lot and tried to not look like, or act like, a tourist (although the map being stuck to my face may have given me away a bit). My ATM card worked fine, although make sure you only have a four digit PIN, as I was told that more than that will not allow your card to work in foreign (non US) ATMs. Let your credit card companies and bank know that you will be away so they don't freeze you up, fearing fraudulent activity. 5. Kids (you can stop reading if this doesn't concern you). We live in NYC so our kids are used to walking a lot, and they were real troopers as we ran them around this fabulous city. We got our kids \"journals\" and they pasted/taped post cards, restaurant cards, sugar packets, leaves from Villa Borghese, etc. into the book. They did drawings, and writings (the 7 year old did a real diary). This kept them occupied at various times (especially during the witching hour when we were waiting to be served in restaurants) and allowed us to relax in a square while the kids worked on the journals. We didn't go to the children's museum (what's the point? We're in Rome). We didn't do the Time Elevator, although that may have been fun, especially if your children are older. Children, under 10 are free on public transportation. Our kids got in free at The Vatican Museums, but had to pay at the Colosseum. Children have to pay at Galleria Borghese, I was told (we did not go there). I don't know the rhyme or reason as to when children pay and don't pay. But, they did not have to pay on the 110, Hop On, Hop Off bus, which is a good way to see the city. If you get on very early in the day, it's worth it, although, the stops are hard to find and the bus only runs in one direction. Again, if you master the city buses, you probably won't need the 110. Our kids did all right adjusting to the time, but slept late every day. Not too bad (if you are a two parent family) to have one parent stay behind and allow the other to go out and explore early. That's what we did and it worked out great. Have a great time.", "Date": "February 24, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Stockport, Cheshire", "Title": "“Excellent Hotel”", "Author": "Preago", "ReviewID": "UR6820429", "Content": "Agree with everything that has already been said. Manzoni metro still not open but if you want to get to Colloseum and save tired legs jump on the No 3 bus outside (which appears to be free). Also going back to Termini, use the No 360 bus across the road. Train back to airport was 11 Euros each, quicker and cheaper than the taxi and takes you straight into terminal. If you fancy clubbing there doesn't seem to be anything for miles around, something to do with a law about dancefloors !!!! Very odd. Instead we went to Sloppy Sams in Campo di Fiori, great night out, lively, mixed age and nationality. Left at 2:30am and easily got a taxi for 8 Euros to hotel. Buy a metro all day ticket from tobacco shop next door as there is never anyone at the metro stations to buy from (4 Euros). Breakfast is a must and on till 11am which is good after a late night out !! Rome was busy even in February, can't imagine what it would be like in the summer. Waited over an hour at St Peters to walk up the dome, but worth it. Very narrow, tight steps, no good if you are claustrophic.", "Date": "February 21, 2007"}, {"Ratings": {"Service": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Loved the Milton”", "Author": "w9628983", "ReviewID": "UR6815193", "Content": "Fantastic hotel, after reading the reviews here we booked for a long weekend. We arrived on Easyjet at the Fiorentino airport and paid 13 euros for a return ticket on the bus. A 10 minute walk from termini found us at Hotel Milton. The immediate impression is clean and tidy and the staff were fantastic, provided a map and where everything was. Upon advice in the column we had requested a room at the back, which was provided, and I do recommend it because we could still feel the faint rumblings of the tram. Room was newly refurbished - Bathroom was fantastic. The Bar area was cozy and provided you free food and a good selection of drinks and the breakfast was very good too. We walked everywhere from this hotel - the colloseum is 10 minutes, half an hour got us to Saint Peters. If you want a tip, go to saint peters at 7pm at night, its deserted and even more magical. Cannot recommend this place enough!!", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Milton Keynes", "Title": "“Great value - but a bit noisy”", "Author": "Headaway", "ReviewID": "UR6797296", "Content": "Hotel Milton Roma has much to commend it. Our room was newly refurbished to a high standard, and the bed was extremely comfortable. The staff were courteous and very helpful, and there is an excellent breakfast buffet. The hotel is a short walk from the nearest metro station and one can easily walk to the Colosseum. The only negative points are that some of the streets immediately around the hotel are a bit grim, and our room was exposed to quite a lot of traffic noise. Also note that, on departure, if you are getting a cab to Termini station in order to pick up the airport bus, be very clear that you only want to go Termini. We almost had to resort to violence to get our cab driver to take us where we wanted, and not to his choice of destination!", "Date": "February 15, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "jalon spain", "Title": "“Better than average at attractive price”", "Author": "hendric", "ReviewID": "UR6772288", "Content": "I stayed with friends for 3 nights at this hotel. The location is a little on the edge of inner city but most places can be reached at reasonable taxi fare. To the Colloseum, Piazza Venezia, Forum Romanum, San Giovanni in Lalerano (Famous church) as well as the bid daily clothing market you can walk to. Once the Metro station outside the Hotel is open again(might take many more months) you can reach a lot of other important places by metro. Now you would have to walk 7-10 minutes to the next metro station. The rooms are comfortable and the bathrooms are spacious for Rome hotels. The breakfast is excellent compared to other hotels in Rome. The prices for mini bar and the hotels small bar are exorbitant. Room service was very, very slow!! By 4 a clock in the afternoon our room was still not made up! The hotel staff is friendly and helpful but gave us (deliberately?) the wrong information on taxi prices to the airport. We were told that a taxi from the hotel to Ciampino airport would be approx. 60 Euros when it turned out to be 30 Euros. I think they were trying to sell us their own hotel shuttle service at 65 Euro s and nearly succeeded. Unfortunately the Hotel does not mention anywhere in there publicity or own website that it is a NON SMOKING HOTEL. This could cause great inconvenience to some and should be clearly announced in advance. I still can recommend this hotel for its price, size of rooms and reasonable location. You should ask for rooms facing the inner courtyard or you may have some sleepless nights. (This is often the case in city hotels)", "Date": "February 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "north east England", "Title": "“Great location & breakfast!”", "Author": "N&GB6", "ReviewID": "UR6647459", "Content": "The hotel was very clean, the breakfast fab with plenty of choice. Ahough the bedroom was small it was cleaned every day, with fresh towels and bedding. The hotel is in a great location, 10mins walk to Colleseium and 10 mins to Metro (the one directly across the road is being reconstructed). Staff friendly and professional.", "Date": "January 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Excellent hotel!”", "Author": "Jane_1983", "ReviewID": "UR6634637", "Content": "This hotel was excellent!! The hotel is right next to a metro stop (manzoni), however this was closed during our stay. The next nearest metro stop is about 5-10 mins walk (vittorio emanuele), which is one stop from the main station. Turn left when you come out of the hotel & go straight on. We stayed there for 3 nights. Check in was very easy & the staff were very helpful giving us map & pointing out all the sights. The bedroom was very clean & we thought it was spacious for a city hotel. Rooms cleaned every day/fresh towels/bar refilled etc. Breakfast was exceptional, pastries; hot cooked food, cheeses/ham, fruit, juices, and hot drinks…. As for location the hotel is a ten min walk from the colosseum. We used the metro frequently but a lot of the sites are not on the met line. In which case we walked instead of using the buses. I think wherever you stay in Rome you will have a walk from site to site. I would definitely recommend this hotel to anyone visiting Rome, just be aware it is on a main road & you do get noise from the traffic. I’m not the deepest sleeper & it didn’t bother me! Tips: Line A closes at 9pm until 2008 due to works being carried out & take your passport or credit card to museums if you wish to get audio guides (for a deposit) or under 26's discounts!!", "Date": "January 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "America", "Title": "“Clean and friendly staff”", "Author": "E-DiFranco", "ReviewID": "UR6616481", "Content": "My husband found this hotel online...\"an inexpensive hotel ,with clean rooms and a very helpful and friendly staff.\" And if that is what you're looking for in Rome, then here it is. However, if you're looking for atmosphere, originality, something purely \"Italian\" then this is not the place. We were hoping for a hotel that was more \"authentic\", the Milton seemed very American/Italian. There also is a lot of road noise. The Milton is at an intersection of some major streets, so expect lots of traffic. It was very convienent to a lot of attractions, the Colleseum is a ten minute walk, many shops all close. Although we never ate in their restaurant, it was very pretty, and smelled yummy! We won't stay there again, purely because it isn't very quaint, or different, though it is very, very clean. Everyone we met at desk where all very helpful and eager to please. They also all knew some English, and were willing to try to understand your Italian! We loved the people!", "Date": "January 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Valencia", "Title": "“very nice stay”", "Author": "Paukenguy", "ReviewID": "UR6583469", "Content": "We just got back from a great stay at the Milton Roma. Before I get to the good stuff there are two drawbacks we encountered. 1) The metro stop right in front of the hotel is NOT open. 2) We had a corner first floor room. During the day which was fine, but at night, a tram car runs on the street at night. It kept both my wife and I awake the first night, manly because we were not expecting it. We asked to change rooms, but they were not able to accommodate us. I would just recommend to stay away from the ground floor street side of the building. That being said. I don’t think we could do any better for $90/night. Rooms we perfectly clean and very pleasant. Great morning breakfast and a very nice staff. I don’t know where else atleast for this rate you could find such a nice hotel, and because of that I would stay there again. The location does have it’s issues. But, once you discover the 85 and 87 busses you’ll be zooming around the city. Taxis are also fairly reasonable around the city. Finally it is very easy to get to the hotel from the Airport via the train and metro.", "Date": "January 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Saint-Petersburg", "Title": "“Freinds for NYE2007”", "Author": "MaxVG", "ReviewID": "UR6574201", "Content": "We have just returned from a 4 days at the Milton from 3 0.12 to 03.01. The hotel is well enough. Breakfast is a very good, much better than in other Italian hotels. Internet is rather expansive but very close are few internet cafes. It placed very near Collosium but far from other main attractions, anyway if you are young and ready to walk a lot - it o.k. (as we were). After the long walking days you can pick up the taxi and get back for 10-15 EUR from any place in central part of city. The metro station Manzoni is still closed. Next is 5 minutes away but you do not need the metro to explore the Rome!", "Date": "January 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Denmark", "Title": "“Good hotel, good experience”", "Author": "Jezz", "ReviewID": "UR6517074", "Content": "My wife have just returned after 4 night/5 days in Rome and stayed at the Milton Roma. It's a great hotel. Rooms are clean and the size is fine. Actually everything is great about this hotel. Room, bathroom, breakfast - only thing which was really, really awful was the noise from the road during the night. I normally sleep like a rock but woke up a min. of 4 times every night, when the trams came rolling :( A set of noise proof windows instead of single glas windows would improve it a lot, or get a room facing the away from the street. But again... besides the noise from the street I have NOTHING to complaing about.", "Date": "December 29, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Clean, Excellent Service, Location, & Excellent Service”", "Author": "smikho", "ReviewID": "UR6508118", "Content": "We booked the hotel for our honeymoon. I am 31 and my wife is 26, a Canadian couple, and newly weds. The location was excellent as we had access to a subway station, and a number of bus routes. Bottom line is, we were never worried about transportation. A 15-minutes walk from the Colloseum, everything was within reach and close by, nice restaurants few blocks away. The room's size was fair, which allowed comfort. An LCD TV! and a great marble bathroom, extra clean! The room was queen size bedded. The breakfast was good and fresh; we didn't need to go outside for breakfast. The receptionists were phenomenal, I can't thank them enough for their kindness, helpfulness and welcoming attitude. They spoke great English, and they provided us with great deal of information about everything we needed, they were our service guide and our source of tourist guidance. We would like to specially thank FABIO and SEMONE, very nice guys, well spoken and highly knowledgeable about the city's attractions and services. We hope that they will be recognized by their managers as they are professional hosts. We will DEFINITELY stay there should we go to Roma again. Ciao Bella Roma Sal and Kris", "Date": "December 28, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Sydney", "Title": "“Value for Money”", "Author": "Oodie222", "ReviewID": "UR6454014", "Content": "This Hotel was good value for money. We had a clean and spacious room, and perhaps the Hotel was recently refurbished. It is close to the Colloseum but it is a fair walk to the city centre and eateries. Most restaurants close from 3:30pm-7pm so if you are looking for dinner around the area, you will have to wait for the few around the area to open. The metro was still closed and if you catch a taxi from the Hotel to the city centre, it will cost you approx. 10Euros. We went at a time when the streets were chaotic with the recent presidential elections. Service at this Hotel was ok. Can't really say that reception staff were truly helpful - we know we have had better. Staff seemed to lack a friendly smile, not sure if this is just the Roman way! Breakfast was sumptuous though.", "Date": "December 17, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Germany", "Title": "“Not for solo travellers”", "Author": "McKaye", "ReviewID": "UR6177813", "Content": "I can happily confirm that ricky9301´s review was right: This was the smallest hotel-room I ever had. It was about the size of others hotel´s bathrooms (look at the photos!). The location of the hotel is okay, not 500m to the colosseum but 1km, but thats okay. CheckIn was quite fast and I was given a free map, nice gesture... The room was small, as being said but positivley silent at night, since it faced the patio. Bathroom was way to small. I managed to touch both shower walls with my shoulders at the same time! And I´m not large or X-Large as you might think. Breakfast was quite plentiful, but the coffee was bad, since it came from an automativ machine. Overall it was not terrible, but I´m sure you can get better rooms in rome for less money. Just avoid the single rooms next to the elevator (the x32 rooms).", "Date": "November 26, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Spain", "Title": "“fantastic hotel in a great location”", "Author": "Guy33", "ReviewID": "UR6153332", "Content": "we stayed at the milton for 4 nights and had a great time.we arrived at about 3pm and checked in straight away.we were given all the tourist info and a porter brought our bags to our room.we had a room overlooking the courtyard so we had no problem with noise apart from the churchbells ringing in the evening.the rooms are all brand new and very clean even if they are a bit on the small side but it doesn't matter because the staff are great and the breakfast is even better. it's only about a 10 min walk to the colosseum and a 20 min walk to the piazza navona.we used the 87 bus a lot.come out of the hotel,take a right,and the bus stop is just past the first set of traffic lights.it will take you right into the centre.if you eat good stay away from the tourist traps and ask the hotel staff to recommend somewhere. i really couldn't find any faults with the hotel and i would highly recommend it to anyone who wants to have a great time in rome for a couple of days.", "Date": "November 19, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Excellent, pleasurable, good value”", "Author": "London_E14", "ReviewID": "UR6131204", "Content": "This popular hotel deserves its credit. Modern (newhotel formerly a convent). Quality rooms and service. Above all the price was good value. Book in advance as they are popular and usually fully booked. Loved the breakfast. Great for all types of travellers. Its not far from either the main Termini station or the Colossium. Its next to the Manzoni subway/underground station which, at the time of our visit in Nov'06, had been closed for maintenance for several months. But its still only a 5-10 minute walk from the next nearest stop: Vittorio E.", "Date": "November 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "England", "Title": "“One night at Milton Roma”", "Author": "seanmcl", "ReviewID": "UR6095032", "Content": "I stayed here for one night. The hotel is in a good location but unfortunately is by a busy road junction with trams which meant I had a disturbed night's sleep. The bedrooms and bathrooms are small. The staff are professional and friendly. The breakfast was better than many Italian hotels.", "Date": "November 10, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent stay at the Milton”", "Author": "zoefran", "ReviewID": "UR6093302", "Content": "Excellent stay at the Milton for 3 nights. The staff make this hotel. Nothing was too much trouble for them and they went over and above anything asked of them. I have stayed in 5* hotels in Rome and the Milton beat any of them for the care that the staff take to serve the guests. Breakfast is very adequate for an \"Italian Breakfast\" and the food was quickly replenished. All in all this is a find in a city overrun with average 4* hotels. The rooms are not huge but they are perfecty clean + have very good amenities. I will be back.", "Date": "November 9, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sarasota", "Title": "“New Hotel Great Breafast”", "Author": "BoomerTravel", "ReviewID": "UR6059558", "Content": "Take a taxi from Termini Sation to get there. To far to walk with bags. A new hotel which must of recently opened. Automatic doors lead you into the lobby and front desk. Got there around two from Florence and had to wait for an hour for the room to be ready. Still a little disorganized, but staff were extremely friendly. Elevator ride to second floor to a very clean carpeted newly decorated room. Very comfortable bed with with flat screen TV. The room was tight but big enough. Bathroom was a good size very clean bright lighting big sink with a real hair dryer for my wife and a shower curtain which could of been wider to keep water off the floor. Location to the sites was great. Short walk to the Colosseum and the forum. Pantheon and Trevi are also all within walking distance. Alot of geat places to eat, drink wine or get gelato in Pantheon/Trevi area. The breakfast at the hotel was the best we had during out trip throughout Italy. Big bright dining room with tablecloths. Alot of varety of food to choose from. When they ran out of an item they were quick to bring out more. Great quality and excellent coffee. Front desk got us a taxi quickly.", "Date": "November 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "ABERDEEN SCOTLAND", "Title": "“A great find”", "Author": "ajbsh", "ReviewID": "UR5502978", "Content": "We booked this hotel with Expedia and got a great rate of 5 nights for the price of 4! The hotel is situated on the corner of a busy crossroads, and yes, the noise carries on throughout the night between cars, trams and buses. However we managed to sleep as our home is situated on a busy street so it was fine for us, but do take earplugs if noise bothers you. There are 2 metro stations nearby, both on the Metro A line, and a 10 minute walk either uphill or downhill depending on which one you go for. The hotel will benefit greatly when the Manzoni Metro station opens because it is literally across the street. We found a couple of really great Pizzeria and Pasta places nearby and the food was fabulous. The hotel was within walking distance to the Colosseum, approx. 10 - 15 minutes away. The reception staff were fantastic, very efficient and greeted us with a free map of Rome and told us how to get to the nearest attractions. They also helped us contact our airline when our luggage went missing. Our room was spotlessly clean, not the biggest room I've stayed in but we were in Rome to sight see not stay in our room. Ample storage space for luggage and a small safe (no use for a laptop). As well as CNN we also discovered MTV which had some english speaking shows on our LCD tv. The bathroom was great, very clean, no shower curtain but again this didn't bother us, its a minor inconvenience that's all. The hotel bar opens in the evening, and is very small but service was great with a good choice of drinks and light snacks. You can either charge it to your room or pay, as we did, direct. On the whole the hotel was fab, staff were very efficient and the hotel was very clean. The only thing that we noticed that had been advertised as being in our room but wasn't was a coffee tray - so what! Great coffee across the road, oh and gelato - mmmmm!!!!", "Date": "July 24, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bedfordshire, UK", "Title": "“Very good hotel for the money”", "Author": "markrlloyd", "ReviewID": "UR5495889", "Content": "I booked the Hotel Milton with only 6 days to go before leaving (an impulsive last-minute decision). I was generally very pleased with my stay. Location is a little bit out; the Colosseum is the nearest major tourist site & is a 10 to 15 minute walk away. I'm usually a very fast walker, but in the heatwave of late July I couldn't do anything at speed! Termini Station is a 15 to 20 minute walk away. Manzoni metro station is directly opposite, but is closed for restoration until later in the year. To be honest I only used it once to go to Ottavia for The Vatican, & just walked up to Vittorio metro station to get on. Staff were very polite and freindly, without exception. Room reminded me of a Thistle Hotel (if you're from the UK that'll hopefully give you an idea of the quality). As others mentioned, it's not so much a minibar as a fridge full of a few soft drink cans & bottled water. Room was fully air conditioned, but was quite noisey throughout the day and night, as it is located on the corner of two roads. Reception is 24 hour (I came in at almost 2 AM one night). My bathroom DID have a shower curtain, but due to poor design water still leaked out on to the bathroom floor, so by the time I'd finished there was a paddling pool to mop up with spare towels! Breakfast exceeded my expectations; a choice of fresh fruit, cereals, yoghurts, sliced meats and cheeses, toast, juice, coffee and various pastries. Cheap way to fill yourself before setting out for the day. I fully intend to visit Rome again (it's the best city I've ever visited, & I've been to a few now) and will definately choose the Hotel Milton again.", "Date": "July 22, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“So what there was no shower curtain....”", "Author": "A TripAdvisor Member", "ReviewID": "UR5416055", "Content": "Ok so it is weird not to have a shower curtain but once you get over this minor detail, the hotel had everything else going for it. My boyfriend and I stayed in Rome a couple of days before getting on a cruise ship. This hotel is close by the Colosseum (sp) and new so we went with it. The breakfast is awesome: scrambled eggs, bacon, lunchemeat to make sandwiches for later....good stuff. I would stay here again, very clean.", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Great Hotel, great location”", "Author": "TAM1764", "ReviewID": "UR5412092", "Content": "Me, my partner and his parents stayed at this hotel and would thoroughly recommend it. There was some ongoing work at the hotel but this was not detrimental to our stay. It is very clean, welcoming and comfortable and our rooms could not be faulted. The staff were very helpful and professional. The breakfast facilities were excellent with a varied variety of foods to suit all requirements. The location of the hotel is superb - the Coloseum being only a short walk away. We will probably visit Rome again and will be staying at this hotel as it was excellent.", "Date": "June 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Belfast", "Title": "“Loved Rome....Disappointed with hotel”", "Author": "miked102", "ReviewID": "UR5381602", "Content": "Firstly Rome is fantastic... if you are thinking about going..DO! Just a shame the hotel did not fit the bill. Previous reviews outlined a few teethng problems such as shower curtains/screens which were not really a problem. The buffet breakfast is great and the location is a wee bit out but not bad and close to the Colosseum and Forum. It will improve when the Metro opens accross the road but if you are walking about probably not the best hotel to stay at. The area around the hotel is not the best and there is even spray paint graffeti over the front of the hotel. The mininbar consists of two bottles of water and soft drinks and is not really a bar in any sense of the word. The hotel bar has no atmosphere is closed during the day and you must charge everything to the room! Minor points, but what really disappoints is the refusal of staff to place a surprise engagement ring in the hotel safe because it was 'full' even when I showed them the tiny ring box and the failure of the hot water sysytem so no warm showers or shaving etc, not my idea of a good holiday! To add insult to injury the 6 Euro discount offered by staff was a disgarce. What a disaster! This hotel does try but I'm afraid is not there and will not be for some time... I will not be back!", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "expat in philly", "Title": "“no complaints”", "Author": "Noz", "ReviewID": "UR5377655", "Content": "Have just literally returned from 6 days at the Milton Roma - I have nothing but praise for the hotel, the staff, the location. The room was small ....ish.....(I have stayed in smaller ...in the UK so I wasnt complaining!) but spotless and the bathroom was perfect - we had a bath with a shower head which was ideal. The staff were very nice and helpful and as for the breakfast..........they were replenishing right up to the end so no complaints there!!! We had a hotel on the 3rd floor overlooking the courtyard so noise was not an issue. For the money - this hotel is a bargain..... Good luck to it. :)", "Date": "June 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“A great place to stay”", "Author": "MrBundy", "ReviewID": "UR5372995", "Content": "We recently returned from a wonderful visit to a beautiful city in a great Hotel. I admit I was a little skeptical that a 4 star hotel with such a great location was so reasonably priced. At the time we made our reservation there were no comments about the hotel, as it was about to open. After I made the reservation with Hotels, I called the hotel and spoke to Claudia. I explained that I booked a room for 3 Adults and a child. She said that she would look at all the rooms and to find out which room would accommodate our needs. I called her back in a couple of days and she said she found the perfect room and she did. I had also told her the flight we were arriving on. As soon as we had got our luggage and started wheeling it out I saw someone with our name, at that point I knew that I had chosen the right hotel. The hotel was everything that Claudia had promised. Because of the central location of the hotel, we could get everywhere easily. Directions from the hotel staff helped, especially from Emanuele the front desk man. He will go the extra mile to make sure you get to your destination. Everyone was friendly and the afternoon happy hour was great. The breakfast was fresh and plentiful. The maid service was as good as we have had anywhere, if not better. Of course not anything is ever perfect, but all things considered this hotel comes very close. The showers did not have curtains. I asked Claudia why there were no curtains for the shower, she said the enclosures had been ordered and will soon be installed. One thing is for sure, you can not go wrong by staying at The Hotel Milton Roma. If you want a great tour of the Vatican City, call 349 8726 943, the day before you want to the tour and tell them that you want Brandon to give you a tour.", "Date": "June 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane - Australia", "Title": "“Just Perfect”", "Author": "A TripAdvisor Member", "ReviewID": "UR5363546", "Content": "I arrived at the hotel and was very pleasantly surprised by the cleanliness and friendliness of the staff. The just really couldnt do enough for me. Offered me excellent advice for a first timer in Rome. I was able to walk everywhere. Lovely location with several nice local restaurants nearby - nothing like traditional pasta in italy. As the hotel was only just recently opened still a a couple of cosmetic things to happen, but nothing major. The room was very well appointed. Another thing that impressed me was that I was quite unwell during my stay and travelling alone, which can make one feel quite depressed. The hotel was aware that I was resting in my room and checked up on me to make sure that I was ok. Even organising a staff member to bring me tea and a light meal. I will definately stay at this hotel again.", "Date": "June 20, 2006"}], "HotelInfo": {"Name": "Hotel Milton Roma", "HotelURL": "/ShowUserReviews-g187791-d603739-Reviews-Hotel_Milton_Roma-Rome_Lazio.html", "Price": "$117 - $392*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Emanuele Filiberto 155</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "603739", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/27/0d/9c/milton-roma.jpg"}}