{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Be very careful”", "Author": "Trevor M", "ReviewID": "UR127419518", "Content": "I recently stay in the Medinaceli and although not being used for several weeks the UK debit card I used to reserve my booking was fraudulently used 3 and 4 days after we checked out for up to £790. I know when I checked in they had my card details written down and stored in a draw at reception. The card was not used to settle the account.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Good location but very noisy”", "Author": "MrMrsGrumpy", "ReviewID": "UR127261599", "Content": "Just had 3 nights at the Medinaceli. Very nice hotel. Very Convenient for the port and las ramblas. Nothing wrong with the breakfast if you like cold meats and cereals. Nice bread good coffee gives an ok start in the morning.Surrounded locally by some great little restaurants. Very comfortable bedroom. Downsides : No coffee/tea in the room . Very Very very noisy through to about 3.00 in the morning / bit better on sunday as it went quiet about 1.00. You might be better off on the 4th floor - we were on the 2nd ! sadly the noise made it a bit of a bummer !", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vienna", "Title": "“Nice and clean litlle hotel, with perfect location”", "Author": "Dusan K", "ReviewID": "UR127236816", "Content": "Modern, stylish, spacious, very clean and quiet hotel, located just 2 minutes from la Rambla and metro and nice 15 minute walk to Barceloneta beach. Location is just the best thing about this hotel. You can go just about everywhere from the beautiful and quiet Medinaceli square. Reasonably priced for my accomodation. Breakfast was very rich and tasty too. Would recommend this one to everyone who doesn't need luxury, but very nice, clean, modern hotel at excellent location.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good location, clean, would stay again but skip breakfast”", "Author": "miwadi", "ReviewID": "UR126451971", "Content": "First time in Barcelona...had a great holiday...hotel very clean, great location in a traditional spanish square, near las ramblas but near the marina too.....staff very helpful..downside...no teamaking facilities in the bedroom...foul smell in the bathroom on arrival and on occasions after that....breakfast poor...eat out instead definately not worth paying for No bar/lounge just a lobby with sofas, chairs and tables....run down area next door, building going on adjacent to the hotel, Would stay again..location, pleasant staff and cleanliness", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Rochester, Minnesota", "Title": "“Avoid this one!”", "Author": "Mark B", "ReviewID": "UR123420230", "Content": "This hotel is ranked as 4-stars, but that is way too high! I'd give it only 1 star. There was a bad smell in the lobby and the room. The windows opened, but the loud street party, motorcycles, and garbage trucks went on all through the night, eliminating that option. There was a very noisy air freshener in the bathroom that activated every 20 minutes or so. The bathroom sink was very shallow and guaranteed to splash your clothes when the water was turned on. The packet of \"shampoo/body gel\" was a very harsh, cheap liquid soap. Many amenities one would expect from a 4-star were missing: no clock or clock-radio, no hand lotion, no hair conditioner, no coffee/tea pot for hot water, the safe was tiny and obtaining the key required paying a fee, very limited drawer space, the pillow was rock hard, the thermostat didn't work properly, and there wasn't a single picture on the walls of the small room. Please explain to me how this is possibly a 4-star hotel. It was a good location, but do yourself a favor, and steer clear!", "Date": "January 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belfast, Ireland", "Title": "“Excellent Location for the Barri Gotic and beyond”", "Author": "NokyEily", "ReviewID": "UR122027383", "Content": "Booked as part of a flights and hotel weekend deal. Google StreetViewed the location and was a bit worried by the all the graffiti on the buildings in the area. Only on walking around Barcelona do you realise this is pretty endemic and not a reflection on the safety of the area. Hotel was very good; from friendly reception staff, decent sized rooms (by European City standards), comfortable bed, great shower room. Bit of street noise in the early hours as there are a few restaurant/bars close by but this was to be expected - night life in Barcelona runs quite late (or early!). Breakfast was the typical euro buffet - used the first day but too many good places to eat breakfast and watch the world arise to eat in a hotel. Pricey if not inclusive - about €16 (Dec 2011). Location was great - just off Las Ramblas at the Colom end (near the Port) so great for going around the little streets in the Barri Gotic, Cathedral (joining point for the City Tour Buses), as well as the Port area. Would use this hotel again as a base.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“FAB hotel, excellent location for exploring an amazing city”", "Author": "Lau8409", "ReviewID": "UR121167671", "Content": "Excellent hotel, rooms are spacious and clean with a very modern feel throughout the hotel. Our room overlooked the square with lovely views. The breakfast on offer provides variety and would suit all tastes. Hotel staff were extremely helpful when travelling to Camp Nou for a Barca football match. Would recommend this hotel for exploring an amazing city and suggest you take a trip on the bus touristic to explore the city with ease. This allows you to get off and on the bus at the major sites. We are looking forward to visiting Barcelona again and would not hesitate in booking this hotel.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Herne Bay, United Kingdom", "Title": "“Hotel Medinaceli”", "Author": "Fi S", "ReviewID": "UR120590028", "Content": "Rooms spacious and clean. Close to cruise terminal but you will still need a taxi approx 11.50 euros for two including case. Hotel reception were happy to call taxi and store luggage. Breakfast good variety of cold meats and cheeses together with hot food of bacon and sausages and toast and jams. Reception area clean and spacious. English speaking reception staff were very helpful with our planning/assisting with our day out in Barcelona. Lovely time would stay again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Albany, New York", "Title": "“Less than four star”", "Author": "Scoot45", "ReviewID": "UR120201934", "Content": "The hotel where we prepaid our room placed us in the Medinaceli. The room was pleasantly laid out and opened onto the square. The room was hot, so we opened the balcony door; there were several noisy men in the square day and night. The room was very musty. The tub was difficult to get in and out of. The staff was reluctant to be helpful. Had to use the reservation computer to send emails. WiFi did not work with Ipad. Location is good for access to the waterfront, poor for exploring the Barri Gotic. One channel in English, but it crackled too much to tolerate.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent location and reasonable value”", "Author": "John G", "ReviewID": "UR119506334", "Content": "I stayed here for 2 nights in September 2011. Was conscious of previous reviews and concerned that I might experience the same. Pleased, however, that either there had been either attention to the reviews by management or the reviews were incorrect. The location is excellent and at the end of La Ramblas, the room was clean and very satisfactory, the bed more that satisfactory for an excellent night's sleep, breakfast similar to other 4 star hotels I have stayed in (and quite satisfactiory) and the staff very helpful and able to speak very well in English. More than happy to recommend it and would stay again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bude, United Kingdom", "Title": "“Nice Situation But no coffee making facilities”", "Author": "detectorist_11", "ReviewID": "UR119436160", "Content": "We stayed here for 1 night after a cruise, good for easy access to city but I had a cold and wanted some boiling water for lemsip, no kettle in room, reception said they could not boil me water!!, until breakfast time. UK TV channels didn't work, noisy outside at night, seemed to be tramps sleeping in doorways nearby, not a nice place to be late at night possibly. Buffet breakfast was fine for fruit and rolls etc, but hot food didn't look appealing. Not a hotel I will use if ever in Barcelona again.", "Date": "October 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Tokyo", "Title": "“Nice location, rather high price , not 4*”", "Author": "JackieMoon80", "ReviewID": "UR118238795", "Content": "I took this hotel for just one night with friends. Location is nice, right at the end of La Ramblas very close to the port. Quite street on the side. Rooms were odd, my room basically had a window only to the corridor, which I find odd and quite uncomfortable. TV was on the slant (broken), no English or foreign channels. There was a very strong scent of cleaning materials. Internet cost EUR12 / 24 hours. No room service. All in all ok for the location, 120 EUR / night for this level sounds off and I wouldn’t call this place 4 stars, max 3.", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Had to saty here...”", "Author": "cityshopper10", "ReviewID": "UR116103182", "Content": "We had a reservation in another hotel of this chain, Gotico, but we had to change here because there was some sort of problem with our room in Gotico. It seemed that there was either a lot of problems in the hotel chain's rooms or this was just a trick to fill this hotel up: there where three other couples/families also changing from another hotel same time as we, due to a water, air conditioning problem etc. We were not pleased with the hotel. The room was stinky, ugly, strongly colored (burned orange?). Air condtioning was loud and not very efficient. The bathroom light was blinking and towels unbelievably thin for a 4 star hotel. The only thing nice about the room was beautiful balcony facing the Medinaceli plaza. Ok, the location was good, specially if you like the Ramblas (I think it totally overappriciated) and there are some nice restaurants and bar near by. And finally: don't waste your money to the hotel breakfast! It's really poor.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Great hotel! Would definitely recommend! Excellent location”", "Author": "YBandJimASG", "ReviewID": "UR115179694", "Content": "Hotel- Very clean, nice hotel staff but the English for some of them was a little poor. Because I speak Spanish I found it easier to get around in Barcelona and the hotel but for my boyfriend he found it a bit difficult to converse with the people there. The staff otherwise are very helpful and relaxed. There is also a luggage storage room if you have an early checkout but a late flight which we found very useful Hotel Breakfast- the hotel breakfast was excellent! We thought it would be a continental breakfast of the usual boring ham, cheese and toast but here there was a selection of chorizo, jamon, tortilla espanola (vegetarian), croissants, baguette, buns, sausages, fruit, tomatos, coffee, juice, sausages, boiled eggs and some little cakes. The eating area is located in the basement of the hotel and is really, really nice Location- The hotel is located in the Medinaceli Square which is seen on most Barcelona city maps and is very easy to find (at least for me because I google mapped it before). It is located not even 5 minutes from Las Ramblas, about a 10 minute walk to Port Vell and 25 minute walk to Barceloneta (I'm sure the walks would be shorter for us if it wasn't so hot and we weren't trudging along!). During our stay my boyfriend and I walked around and visited the sites and were very thankful for the central location of our hotel. We flew into Spain from Girona aiport and there was a bus that took us to the bus station in Barcelona (about 20 minute walk from the hotel). A return ticket to the airport was 22euros and valid for a month. Food- Barcelona isn't a cheap city and the average cost of a meal if about 10euros and this isn't usually from the nicest restaurant. We bought some jamon, baguette, olives and chorizo from a local supermercado and ate that on the 'balcony' of the hotel room which was a lot cheaper than eating out that day! The food is very nice in Barcelona but the restaurants are very repetitive. Avoid eating at or around Las Ramblas as the restaurants are expensive. Overall a great hotel and brilliant trip! Barcelona has a great day and night life and the culture there is very relaxed and chilled. Beware because there are a lot of pick pocketers around and a lot of the people in the tourist shops are waiting to rip you off! Always haggle!", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Bedfordshire", "Title": "“Good location but 4star?”", "Author": "CaptainBedfordshire", "ReviewID": "UR114640402", "Content": "A party of us were originally booked for the Rialto, another hotel in the same chain, but when we arrived we were told that the central heating was broken and that we were being transfered to the Medinaceli ( a 4 star hotel ) at no extra cost. Taxis were ordered and we then spent some time driving round Barcelona trying to get to the hotel as there was a demonstration in progress which blocked a number of streets and we finished up walking quite a way with our cases. The hotel was formerly a palace and there are signs of this particularly in the central atrium.There is a strange smell on entering the hotel but once inside this disappears. The reception staff were O.K but not particularly welcoming or over friendly. Our bedroom was fine overlooking a small street at the side of the hotel, a reasonable size, clean and light with a decent shower ( which we had requested). The hotel is in a small square just across the road from the marina and on the edge of the gothic quarter so very convenient for everything. Unfortunately the building on the side of the square next to the hotel is virtually derelict and appears to house undesirables at night. In the square itself people congregate to drink, talk and shout until the late into the night. This was not a problem for us in January but could be in warmer weather with the windows open! The breakfast room is in the basement, pleasant enough but uninspiring. Breakfast was virtually the same each day and not particularly exciting but there was enough to eat. The coffeee machine was not a good one and the drinks it produced we found to be of poor quality. There is no bar or restaurant at the hotel and other facilities which would often be found in a 4 star hotel are also lacking. I would not rate the hotel as more than 3 star. Would we stay there again. possibly but only after exploring other options first.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Wiganio", "Title": "“Good locale, thats it !!!”", "Author": "Spanishhaterno1", "ReviewID": "UR111881486", "Content": "In a nutshell: Room = ok ? Receptionist (Bald guy with glasses) = Shocking, rude, ignorant, unhelpful !!!! Breakfast = Disgrace for 4 star, 1 waiter, no cups, or anything else for that matter !!!!! Location = Bottom of Ramblas so quite good really ! Would i go again: NO chance, not even for a 3rd of the cost !!!!!!", "Date": "June 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mashad, Iran", "Title": "“great location poor service !”", "Author": "RoozbeH", "ReviewID": "UR97666998", "Content": "the location couldn't be more perfect it's on place de duc medinaceli 3 min walk from the famous La Rambla (there u see a nightlife u have never seen before,street artist,restaurant cafes and try the Sangria)... overlooking the beach and the tour bus stop in 1 min away ..so from the pint of location it's an Ace. rooms are great spacious ,cleaned every day and hotel itself is renovated old building so u'll like it anyway .. the bad thing about it is the service .. AWFUL breakfast plenty of things missing the first day we had an undrinkable sour orange juice and yet that didn't exist from the second day ... half an hour to the end of breakfast they ran out of toast ... so go there enjoy the hotel but don't pay and use the breakfast u'll get much better in surrounding cafes ! and the lady at the restaurant doesn't speak a word of english so i had to use my few-worded spanish !!", "Date": "February 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "toronto", "Title": "“hotel before cruise”", "Author": "mols0n", "ReviewID": "UR79627374", "Content": "This is a god value only if you are embarking on a cruise. Walls are paper thin. The breakfast is terrible. Safe key requires a daily fee. I've had thefts at other Spanish hotels but this hotel was average for comfort and nothing was stolen so I was content that we had no problems.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Decent hotel in great location. Near Marina, Las Ramblas and Barri Gottic.”", "Author": "swmpls", "ReviewID": "UR76168958", "Content": "Stayed here for 3 nights with husband and two teen daughters. Booked 2 rooms through Hotwire using \"Las Ramblas/Barri Gottic\" area filter at about $95 per room/nt. Rooms nice and clean. Honored our request to have two rooms near each other on 4th floor. Wi-fi access in lobby only and $12/day but lots of cafes nearby offer free Wi-fi. Location is fantastic. Right off of Las Ramblas and across street from marina. You can get great coffee and bakery right behind hotel in many different shops. Take Bus Tourista to all the sites one block from hotel. You can get small amounts of ice from front desk...they will seem annoyed but will get it for you. We bought beer, wine and snacks at nearby shos and brought to our room. Beer and wine very cheap and good! Make sure to try the Cava...Spanish champagne...wonderful. You can buy bus passes at hotel...very convenient and great way to get around Barcelona. If you are short on time take the Orange line bus...more great attractions on that line than the green. Many great shops and restaurants behind hotel in the Barri Gottic right behind our hotel. We just loved the Barri were amazed with the narrow streets, old buildings and food/drink places within. A maze of fun. Great during the day but warned to be careful and not go in dark streets of Barri Gottic at night. Check out L'Example area and Passeig De Grassia street with great shops and Gaudi buildings. We loved this great tapas restaurant off of Passeig de Grassia called Cerveseria Catalana. So amazing and inexpensive. Usually crowded and a bit of a wait but definitely worth it. Our family of 4 ordered about 8 tapas plates and wine for under $50 Euro.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dissapointed”", "Author": "stephenslimbean1", "ReviewID": "UR72008832", "Content": "A 4 star hotel differs from country to country, but this hotel has no mini bar, restaurant, bar, tea/coffee making facilities, and a small vending machine in the lobby. We stayed in a dull room on the second floor with no windows to outside, and the only windows were on to the internal open area, with a staircase feature that only lead from 1st. floor upwards, so we heard everybody coming back to their rooms at night. The hotel is in an excellent location near La Ramblas and the marina and is a place to sleep only as the facilities are limited. The hotel is clean but there is a smell in the lobby where the receptionist is only partially helpful and not very welcoming. If you like buffet breakfast it is very good, but we ate out in the cafes near for breakfast at a much cheaper rate than the hotels 9 euros each.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Location": "5"}, "AuthorLocation": "North Vancouver, BC", "Title": "“Wouldn't go back.”", "Author": "Ronalynne", "ReviewID": "UR62410412", "Content": "Good location and clean/modern but staff not helpful with limited or no English, no business centre and staff didn't know where to send us to internet cafe, paper thin walls so you can hear everything. Could hear people outside smoking/talking all night. Wouldn't recommend it.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "British Columbia", "Title": "“Everything we'd hoped for- thank goodness the other hotel fell through.”", "Author": "Gustav60", "ReviewID": "UR60609056", "Content": "We were booked at a hotel in the Eixample area that offered a discount for early booking. Unfortunately we learned that the discount would not be honoured when it came to make the booking \" non- refundable\" , as the hotel was fully booked at their full price! So rather than pay the full price there, we decided to spend an equal sum elsewhere. We found this four star hotel ( maybe it's just a 3 star to some folk, but to us it met all our requirements). It fronts on a classic Spanish Placa complete with monument, fountain and local colour. It's location along the Colom made strolling the Harbour very pleasant. It was near enough to the Gothic district to walk to. If you are lucky enough, as were we, to have a room fronting the square, be prepared for a little night chatter but remember this is part of the culture! The room was well appointed and cleaned daily to a high standard. The staff were more than helpful and spoke English flawlessly. Their recommendations and directions never failed us. We had 5 memorable days.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“There is space to improve”", "Author": "from_moscow", "ReviewID": "UR59153024", "Content": "I may say that I'm pleased with my stay at Medinaceli, however there are some negative points I would like to underline below. The thing that really shocked me was a guy at the reception desk who did not speak English. This is my first time in Europe when I face such a problem. The second negative moment is very cold room. It is nice itself, decorated in dark red colors (even with balcony and amazing window view as we requested), but there was not any kind of carpet on the floor and I was feeling like walking on ice. We had to turn on air conditioner and to set up the max tempererature, but it was still cold in the room. I have booked my room for my girlfriend and me, but the hotel provided us with a room with two beds. They said that the hotel is full and they don't have any other free rooms. You may imagine that it was not very convenient for us... Please also note that you have to pay for breakfasts when you stay in Barcelona hotels. A continental breakfast for one person costs about EUR 20 and its price is not included in the room's price. Business travellers shall not choose this hotel cause there is no Internet connection there. But all the rest was perfect! Location on of the most beautiful squares of Barcelona, close to the sea, close to La Rambla and Gothic Quarter, very friendly staff (except for \"I Speak Only Spanish\" guy), excellent room service, amazing hotel interiors.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“All you could ask for”", "Author": "clkckclack77", "ReviewID": "UR57817908", "Content": "Stayed here for 4 nights last week and LOVED it. Perfect location near the bottom of La Rambla, near the metro stop of Drassanes, near the water, and on a cute street with some nice bars, shops, and cafes! Room was nice and clean and bathroom was very modern. Nice little flat screen tv with a couple of english channels. Great hotel to enjoy all that Barcelona has to offer. Rates were very good and affordable!", "Date": "March 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Vancouver, BC", "Title": "“Very nice hotel, would recommend it to others.”", "Author": "BCWendy", "ReviewID": "UR48766408", "Content": "We are from Canada and went on a Mediterranean cruise at the end of October, then spent 1 week in Barcelona in this hotel. Overall, we were very pleased with this hotel, and I'm very picky :o) Positives: - good central location just 2 short blocks from one end of La Rambla. Easy walk to the new pier/shopping area called MareMagnum, and central to catching the metro and sightseeing buses. Only a few blocks from the Gothic Quarter area. - very clean hotel, well equipped with a mini-fridge and very updated bathroom (except the hairdryer is the old, wall-mounted hose kind), and very modern shower stall. The atrium has a beautiful spiral staircase. - front desk staff is friendly and helpful, and most spoke English Negatives: - although this wasn't a big deal, the adjacent building is an empty condemned building, and the park across the street is being renovated.", "Date": "November 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "washington dc", "Title": "“Great location, decent room”", "Author": "ebleimund", "ReviewID": "UR48200922", "Content": "We spend 4 nights at the Hotel Medinaceli. It is in a great location - right on the waterfront, close to the metro (Drassanes), right at the bottom of Las Ramblas, and easy walking to Barrio Gotic (where you'll find great dinner restaurants, etc). The staff was very friendly. They had a buffet breakfast for 9 euro but we never tried it. There were several small grocery stores around the corner where we instead bought yogurt and pastries for breakfast. The room was big enough, and relatively quiet. They had great curtains that blocked out the light so well that we accidentally slept in twice! My two complaints about this hotel were that the beds and pillows were pretty hard - ok maybe if you're used to really firm beds, but for me I woke up with a back/neck ache. Also, they charged 3 euro/day for use of the room safe.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "USA", "Title": "“good choice overall”", "Author": "dart43", "ReviewID": "UR46927804", "Content": "quite nice hotel ... with a good location. room was fine, and desk (Tony) was VERY helpful. If I return to Barcelona, I would consider this hotel", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "West Bromwich", "Title": "“Nice Hotel in the best location”", "Author": "Gaparker", "ReviewID": "UR42479056", "Content": "Good location, very clean and modern would stay there again. The only downside is that the breakfast choice is a bit limited and does not change. Apart from that no complaints.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "State College, PA", "Title": "“decent hotel, great location”", "Author": "GHG_Czarina", "ReviewID": "UR35271599", "Content": "This hotel was in a great location, close to La Rambla, in the Gothic district, and very near the water. The room was clean, and while the first two nights the air conditioning didn't work well, they must have resolved that problem because we had better luck the rest of the week. My card kept deactivating, which was annoying to have to go down and get it reactivated all the time. The rooms were fairly quiet for being in such a busy location. The telefonica internet that you could allegedly buy did not work, and the staff wasn't too helpful with that. Overall, I would stay there again. The room was clean and in a good spot.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Superb location and friendly staff”", "Author": "DivaCaledonia", "ReviewID": "UR33633510", "Content": "This freshly and stylishly refurbished hotel is in a fantastic location on the coastal edge of the Barri Gotic. Unlike some previous reviewers, I found the staff to be unfailingly helpful and friendly. The same applies to the previous reviewers' complaints about noise - we had a ground floor room by the street but the double-glazing kept our nearly everything and we slept very well. We think it unrealstic to expect an hotel to be completely quiet in the centre of this most vibrant city! The rooms are very clean and the beds are comfortable. Our only small diasappointment was that there could have been a little more choice at breakfast (there was no muesli or wholemeal bread and the fruit salad was from a can - there was whole fresh fruit, however) and it would be much better to have properly made coffee rather than a do-it-yourself machine. In short, we would have given this hotal five stars but it lost one for the breakfast. Finally, we don't think it is worth paying the full price for this hotel. We booked through laterooms.com and got a huge discount.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "pisa", "Title": "“clean, recently renowed, very close to centre”", "Author": "frabor", "ReviewID": "UR31659389", "Content": "We stayed there for three nights and we had a very comfortable accomodation. We red a lot of bad opinions before to start and we were a bit worry but when we arrived we have found a very large room, very clean, recently renowed and a perfect bathroom. We had breakfast included and we can confirm it's a real continental breakfast, with a very good choice of foods, fruits, pastry, eggs etc.. Definetly an excellent hotel.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Salonica", "Title": "“Great Location, Awfull Smell”", "Author": "IngoGR", "ReviewID": "UR31282842", "Content": "First things first. The location is excellent. Spending 5 days in Barcelona and being around on almost every place of the city I can't thing of a better location we could have stayed. I must admit that I haven't done a market research on prices around that location, but spending €570 for 3 nights for a single room with 3 beds seemed quite a lot. However it's not the price that led me to give this Hotel only 3 stars. It is the awful smell at the reception (thank god it wasn't in the room), the small room and little details like the fact that they didn't have a \"do not disturb\" card, a toilet brush, shower gel or a late checkout option. Nevertheless I would say that this hotel is average and I would recommend it to someone who's not willing to spend much time in his room since the location is extraordinary.", "Date": "June 1, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "london", "Title": "“Terrible customer service!”", "Author": "travel67070", "ReviewID": "UR27846869", "Content": "The staff is so rude and stubborn that we had to bring the police over to the hotel to resolve the issues created by the staff themselves. The personnel has a very poor command of english and were never willing to help with the most typical needs of foreign tourists. Have to point our particularly the receptionist - HECTOR GATICA who dared swear at us and refused to help us with our luggage claiming that he has more important things to do. The worst hotel I have ever stayed in my life. Do not recommend at all!!", "Date": "April 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great Location”", "Author": "KarenB_007", "ReviewID": "UR21832687", "Content": "Stayed here for 10 days. Think the key to the good/bad reviews may be which floor your room is. Did hear a few people complaining about noise who were all on the top floor. I stayed in a room on first floor overlooking the square with 2 balconies and had no noise problems and also stayed in room on second floor (also with 2 balconies) over the side street and again had no noise problems. Always found the front desk staff helpful and able to speak English. Breakfast was good but was included in my price (booked hotel online). Heard it was 9 euros otherwise which is a bit steep unless you are a big breakfast eater. Rooms were clean and location is 5 minutes from beach, shopping centre, Las Ramblas and a metro station... ie GREAT ! Minor points but... no shampoo, conditioner, lotion, radio or alarm clock. Also no internet, business centre, gym, restaurant or bar on site. Charged 3 euro per day if want to use the room safe. If request the mini bar key can have use of the small fridge in each room. Overall - think the key is how much you are paying for the rooms. It is a good hotel, good staff, good breakfast, and excellent location - probably in reality more what you would expect from a 3 star hotel though.... As far as pointers - do take the airport bus (vice train or taxi). It costs 4.05 euros and brings you to Catalanya place. From there either take the metro to Dassanes and walk 5 minutes or take a taxi (about 5 euros). I made the mistake of sleeping in a bit and deciding to take a taxi to the airport and it cost me 20 euros + 12 in surcharges (32 euro total) due to 1) leaving before 0800 which is a higher tarrif rate, 2) having luggage - of which he counted my handluggage/small backpack as a full piece of luggage on top of that because I put it in the trunk instead of bringing with me up front 3) extra charge to go to the airport 4) extra charge for the hotel calling for him (vice being flagged down) and 5) best of all when I asked to confirm I had the right airport terminal my flight would be out of ... he called in to his central dispatch to confirm and then told me that \"call\" would be an additional 2 euro surcharge.... as I said... take the airport bus.......", "Date": "November 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hastings, East Sussex", "Title": "“Great Location, bad smells! and definately not a 4 star”", "Author": "killakellers", "ReviewID": "UR21311623", "Content": "We arrived in Barcelona late, and were told that our hotel had been double booked. We were then sent to the Medinaceli which was a higher star hotel, so were originally pleased. However on arrival we were soon dissapointed. The hotel stank of drains and the staff spoke little or no English. There was no bar and the rooms had no balcony. There were also Pipe noises throughout the night which was infuriating! On the plus size, the room was clean, modern and a reasonable size. The bathroom also had a good quality power shower and was clean and well equiped. Also the location is amazing! 5 mins from les Ramblas, 5 mins from Harbour and near to many metros etc. Overall this is a good, basic hotel, with clean rooms in an excellent location. It is definately not 4 star, and am unsure how it recieved this classification, but we enjoyed our stay and were pleased to be so near the action!", "Date": "October 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "cornwall", "Title": "“nice enough but disappointing”", "Author": "pastyfaceCornwall", "ReviewID": "UR20876519", "Content": "Third time to Barcelona, so had a fairly good idea of hotels and locations. Booked the Medinaceli as it seemed to offer a reasonable price for centrally located four star accomodation. Not a great start as we had booked twin beds and were taken to a double room. The room was changed to one overlooking the (rather seedy at night ) square and was very comfortable with an excellent bathroom. Unfortunately it also had a drip from the air conditioning grill in the ceiling which splashed the bedside unit. The hotel itself is a grand old building completely modernised, 300 metres from the ramblas and 150 metres from the waterfront. Many unassuming bars and restaurants nearby - recommend Guru (from hotel exit ,its left and left again for 50 yards). Breakfast was not 4 star standard and overall the price (£427 for three nights) was a little high for what was received.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toms River, NJ", "Title": "“Excellent location, great hotel, definitely recommend”", "Author": "BVThomps", "ReviewID": "UR16369760", "Content": "We used this hotel as a pre cruise night place to stay to be near Port Vell as we were leaving for a cruise the next day, and it was excellent for our needs. The front desk staff was helpful and our room was larger than we expected upon arrival, considering the typical European hotel room. We found the room to be comfortable, and there was no outside noise at all to bother us which was perfect! We didn't need use of the room safe as we were only staying one night and the bed, linens and bathroom amenities were very good and perfect for our needs. Our only complaint is that in our room the air conditioning did not seem to function. Because we traveled to Barcelona during mild weather this was not an issue for us, but other US guests may complain about this since we are spoiled with our expectations for the typical hotel. We disagree with other guest's impressions of the breakfast - we were pleasantly surprised to see a nicely decorated , brightly lit and large breakfast room with elegant chairs and table linens and the hot buffet selection was delicious, plentiful and replenished regularly. There were also a variety of meats [chorizos or sausages], pastries/cakes, yogurt, cereals, fresh fruit and an easy to use coffee machine that dispensed a choice of hot beverages with and without milk and caffeine. If you chose hot cocoa or tea this was also available. It exceeded our expectations and we definitely recommend it to any guests who don't want to pay excessive euros looking for a meal early in the morning because of a misleading review. Also, the location to the Ramblas was ideal, just a few short blocks and we were in heaven. We arrived during Mother's Day in Barcelona and the Ramblas were full of life and entertainment. We enjoyed an amazing meal and delicious Tapas at a restaurant on the Ramblas only a short walk away - Amaya. I strongly recommend it. We noticed several of the other patrons eating there were repeat visitors, as the wait staff remembered them and took extra good care of them. This is what you want from a vacation! The prices were right in line with similar restaurants located on the Ramblas - you can compare menus as you walk by and see for yourself. Overall, I would definitely stay at this hotel again. It is charming, beautifully decorated inside, and there is a Tabacco store not two minutes away from the entrance where you can buy stamps for the post cards you'll be sending to your family telling them how amazing Barcelona is. The Front desk reception will kindly mail the post card for you - now that's service. Also, since we had a sightseeing tour booked for early morning the day our cruise departed, the front desk has a special room to hold luggage at no extra charge, and they will monitor it for you. You can get to it whenever you need it and they can arrange taxis or recommend tours for you if you are spending extra time in Barcelona. The hotel was also within a short walking distance of the Plaza de Colom [or Christopher Columbus Plaza for those of us from the states] and it seemed the Touristy thing to do was to take pictures on the lion statues and buy tickets on the Hop On/Hop Off city bus. The pier area has a great little mall [Maremagnum] and the Aquarium is nearby for anyone who is interested.", "Date": "May 24, 2008"}], "HotelInfo": {"Name": "Medinaceli", "HotelURL": "/ShowUserReviews-g187497-d603788-Reviews-Medinaceli-Barcelona_Catalonia.html", "Price": "$122 - $241*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Plaza duc de Medinaceli 8</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "603788", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fe/8d/fe8d8f25506d6895d5815a2aab540ffc6large.jpg"}}