{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Lovely time in Istanbul”", "Author": "Keiran Q", "ReviewID": "UR127960601", "Content": "I travelled to Istanbul last summer to visit my father who was doing a trip around Turkey. I stayed one week at this hotel and had an amazing time. The best memory for me was the friendly staff, especially Nekati who was really helpful at the front desk. The backyard was lovely and so was the breakfast with lots of turkish food. this backyard was kept open throughout the day and had a great atmosphere.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Richland Hills", "Title": "“Trip to Istanbul”", "Author": "D J g", "ReviewID": "UR127890418", "Content": "My girlfriend and I met up with some friends and stayed at the Vezir Hotel. We were a bit disappointed by the exterior on arrival but soon got over it once we were greeted by hotel staff. Altun at the front desk took us into the garden area and served us hot tea and home made cookies. Then we were taken to our rooms and were quiet surprized as to how nice the rooms really were. After a short rest we came down stairs and Altun briefed us on the hotel ammeneties and info on everything from restaurants, city tours and must see tourist attractions. The remainder of the staff was super friendly, helpful and always ready to answer any questions we might have. All of our friends indicated their rooms were great also and very clean. The rest of the hotel was kept clean and the only time we saw any other guests were we we went to breakfast. All the main tourists spots are withing a 10 minute (or less) walk from the hotel. Breakfast in the morning was simple and enough to get your day going and there's plenty of nearby restaurants with excellent menus. I recommend this hotel if it's your first Istanbul trip and want to hit up all the main sites in the Old City", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Islamabad", "Title": "“Visit to Istanbul”", "Author": "Muhammad N", "ReviewID": "UR127174502", "Content": "One can only talk about his own experience and mine was an awesome. The hotel is located which you would always prefer because the historical places like Hagia Sofia, Blue Mosque, the Topkapi Palace and the Underground Cistern are just at a walking distance of not more than five minutes. Similarly, in the same street where the hotel is located, you would find a chain of some very good restaurants. The staff is as friendly as you can Imagine. They guide you in every manner they can with smiling faces. the two young and beautiful ladies at the manger counter and very friendly and energetic and would help you in every possible manner they can. Another staff member wold always know when you need to drink (tea or anything) and would present you with it even before you ask for it. The rooms and especially the washrooms are very clean. Everything in here would make you feel like home. So I Highly recommend it and I will definitely stay here in future upon my visit to turkey.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benbrook, Texas", "Title": "“Visit to Istanbul”", "Author": "Mae F", "ReviewID": "UR126568111", "Content": "This was our first time to Istanbul and the helpful and comfortable Vezir Hotel experience made it a wonderful trip. The hotel was clean, modern and in the perfect location. The staff were extremely helpful and accomodating. It gave you a very homely feeling. The staff spoke good english and took care of arranging all your transfers, trips and whatever you would ask them.We have never had such a great personal hotel service. The buffet breakfast was good and the Bazaar, Blue Mosque and Hagia Sohia were just steps away.We stayed in this hotel from a recommendation from a friend and it lived up to its expectations.We will be referring this hotel to all our family and friends and will definitely come back and stay there. It was defintely worth the value.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Wider berth advised”", "Author": "H B", "ReviewID": "UR121698906", "Content": "Reading other reviews leaves me astounded. Definitely not recommended. The place smells of cat urine. Drunk Russians very welcome. We stayed in places all over Turkey, and this was by far the worst.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“OK, centrally located in Istanbul”", "Author": "FiftyNiner", "ReviewID": "UR118810745", "Content": "I stayed 1 night at hotel Vezir early september 2011, as part of a tour group. The hotel is conveniently located in a charming older part of Istanbul, close to for example the Blue mosque and Hagia Sofia. Many shops and restaurants in the area. Nice charming room with nice beds and Ok shower. Cozy, but small and crowded lobby. Adequate buffet breakfast, but nothing outstanding. They have an internet terminal in the lobby. In the morning of our departure it was not working all the time, but this might have been temporary.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“excellent accomodation”", "Author": "raceland47", "ReviewID": "UR93703817", "Content": "Staff was excellent and made me feel at home. No problems breakfast was great. Met witht the Owner Mr. Ismail and had pleasant conversation about his country and his family.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albany, New York", "Title": "“accommodating”", "Author": "SeanShoe", "ReviewID": "UR90237823", "Content": "this hotel is very nice, the beds were comfortable, breakfast was vast and delicious. The lady at the front desk wouldn't give us keys unless we asked in Turkey. I found that to be hilarious.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ukraina", "Title": "“little pearl of Istanbul”", "Author": "Knarin", "ReviewID": "UR81357961", "Content": "I not for the first time in Istanbul. Came here to excursion rounds. Has this time arrived to business-round. First has stopped in big and comfortible 5 stars hotel. Greater rooms, nice feed. But in three days simply bored. To reach far and not conveniently. Late at night to come back terribly. And certainly I have there were no questions where to stop once again. Certainly at the Vezir hotel. Where I stopped last time. Small cosy hotel in the heart of Istanbul. At any time it is not terrible to come back in it. All transport beside. Yes rooms small, usual feed for 3 star hotel, but anybody hungry did not go. But it in fact ancient osmanli style. In it that and charm. As to go up on a roof in pleasantly evening and to look at night Istanbul or in the morning to meet a sun rise. Have now expanded yard and have increased a zone of rest in a courtyard. Therefore any more I shall not do experiments with hotels and I shall go at once to this hotel if I shall go to Istanbul again. There it is pleasant to me. Super.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bucharest", "Title": "“never again!”", "Author": "dragonfly091", "ReviewID": "UR80231595", "Content": "\"clean\" is a word that probably owners do not know! bad service, unhealthy rooms, tv does not work...good location but you can find better places to stay in the center of Istanbul", "Date": "September 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "brussels", "Title": "“poor thing ...”", "Author": "khaylo", "ReviewID": "UR79760302", "Content": "Hotel Vezir : our room (303) was terrible ... very small, a bed putted between 2 walls, a view we never saw before ... a plate before the window.... Shower was terrible ... Breakfast in the garden (if you can call that a garden, it was more like a jungle). Breakfast was simple but ok for us. And then the noice at night, awfull ! We were staying just next something that was also a little hotel with very loud music and loud people. After a whole day visiting Istanbul you would like to sleep a little. That was not possible at that room. So we didn't sleep about 5 nights. If they would do a little effort to renovate the building a little it could be a good, nice hotel because the location is very good.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Great staff”", "Author": "LizH_10", "ReviewID": "UR79068674", "Content": "We stayed at the Vezir Hotel in the Sultanahmet area. It was reasonably priced and only a few minutes walk to the Sultanahmet Mosque - Blue Mosque, the Hagia Sophia and the Cisterna. Let alone all the other drawcards - Topkapi, Museums, Bazaar etc The friendliness and help given by the staff was great, in particular the manager on duty at the times we were around - Babursah Yavuz was extremely helpful without being pushy and was responsible for us having such a great time in our four days there. The breakfast that was provided was great; with basic cereal type but also with with Turkish style cheese, salamis, cucumber, tomato and a variety of breads. Juice, coffee, tea and water also were provided; and drinks or hot drinks were also readily available at any time of the day from the bar with friendly service from Suleyman. The internet - computer was on and ready for use in the lounge/ bar area at any time, just be aware of the fact that Turkish keyboards have 2 letter i's and the one I kept trying to use at first was actually \"y\" so I had trouble connecting till someone pointed that out to me. Our room was comfortable with good bathroon facilities - not overlarge and looked out onto an airshaft but we weren't in it much. We would go back there like a flash if some kind soul would like to give us a few thousand dollars ! to travel again from New Zealand to the other side of the world as we found the Turkish people in Istanbul very friendly, helpful and great to talk to.In the streets- yes, they want to sell to you but they are not upset if you don't buy and are happy to talk with most having some English. We would recommend the Vezir Hotel to anyone wanting reasonably priced accommodation with friendly and helpful staff.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great hotel in Istanbul's old city”", "Author": "AL_EXswe", "ReviewID": "UR73456199", "Content": "Very nice hotel in the middle of old Istanbul with all the turist sights around the corner. Satff speaks english which is rare in Istanbul.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kabul", "Title": "“excellent place to overnight between long flights”", "Author": "KabulGabor", "ReviewID": "UR73111295", "Content": "I have spent here more nights, when I traveled and needed one night rest betwen flights. The staff was everytime helpful and polite. They solved the problem of unusual arrival (very early check in, transfer etc) I will choose this hotel again", "Date": "July 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bucharest", "Title": "“Worst time ever”", "Author": "lazarlumi7", "ReviewID": "UR66728400", "Content": "Even though we had reservations made two months in advance, when we arrived they did not have two rooms at the same floor (we travelled with some friends). So they gave us rooms at different levels. One of the rooms was unbelievably dirty: the sheets were miserable; the window lever was so dirty it made us sick to touch it; the outlet was completely missing, it was just a big hole in the wall; the bathroom ceiling was falling down. We couldn't take a proper bath because warm water does not reach third floor, and the breakfast made us sick just to look at. So we'd rather skip it. Moved out the next day without room for discussions. Will never recommend it to anyone. Absolutely horrible!", "Date": "June 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Rooms awful, location excellent”", "Author": "1gruesome", "ReviewID": "UR64227225", "Content": "Perhaps I was just unlucky with my room but I had quite a different experience from a lot of other reviewers. I had booked a small double, the small bit was very accurate. The first room (308) I was given had no air conditioning, there was no power and bathroom ceiling had nasty damp stains and paint peeling off plus the odd bit of furniture present was badly chipped. When I complained I was shown another room but was advised that this would be noisy as it was opposite the stairs. The view was of a brick wall about 4 foot away and the back wall was obviously damp as the paint was bubbling up. However, as it had air conditioning and no other rooms were available I took it. It was still bad though and very small, plus the plugs were coming away from the wall. I do not expect UK standards of rooms when I travel but this was really substandard - please try and stay somewhere else Having said this, the staff were lovely and the location is very good for the main sites.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“babstone”", "Author": "babstone", "ReviewID": "UR57590643", "Content": "hotel location very good all the historical places near...", "Date": "March 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tallinn", "Title": "“Very lovely hotel, with good location and economical.”", "Author": "Katya63", "ReviewID": "UR50121353", "Content": "The hotel is not big, but very nice and comfortable. The location is very appropriated, it s situated in the most beautiful part of Istanbul, near the most important sightseeings (Blue Mosque, TopkapÄ± castle, St. Sofya, Ciscern Basilika and others. The rooms are small, but very lovely and comfortable-the good airconditioner(NOT central, but private in every room), heating(also private, so that You can regulate the temperature by yourself) and other basic equipment(hairdryer, soap, classes and s.o.). Bed linen were always clean and also we had extra blankets in our room. Only one time we had a small problem with tap, but it was immediately repaired. The room was always well cleaned and the staff of the hotel was friendly and helpful. I would recommend this hotel, because you can feel here like at home and at the same time anjoy the beauty of Istanbul.", "Date": "November 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "kent", "Title": "“Ok Hotel!!!!”", "Author": "chipmonk2009", "ReviewID": "UR49764293", "Content": "This is a very pleasent hotel if you like it cheap and small, the staff were very friendly and the night receptionist was very helpfu, friendly and gave us a apple tea on arrival and showed us the local sites on a map. The maids were very pleasant and entertaining. The breakfast was ok with a buffet, but there was no kettle in the bedroom to make you feel welcome. On the down side the health and safety of the hotel was unacceptable our room was a walking hazzard with the toliet not bolted to the floor, nails protruding from the door frames, wires on the hairdryer in the bathroom exposed as well as the fridge in the bedroom, and the bed sheets had holes in them, holes in the lino. I do not think we would not stay here again as it was too unsafe for my liking.", "Date": "November 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Finland", "Title": "“Falling love in certain hotel”", "Author": "inkyINK", "ReviewID": "UR49568377", "Content": "I am not much of a traveler and I have very less experience about hotels or other places to live during a vacation. I traveled with my mother and while searching nice, but cheap, hotels from all over the Europe, we ended up traveling to Istanbul and staying to Vezir-hotel in Istanbul's Sultanahmet. All we knew while we came to hotel was that it was close to the Blue Mosque and Hagia Sofia. Soon we found out that hotel's location was pretty much like ideal for our purposes: walk-away there was a tramp stop which took us to shopping, museums and other sort of places we ever wanted to go. And so we had whole Istanbul in our hands! The mood and view of old cirty part of Sultanahmet was very beautiful, and even though tourists weren't rare, it was still easy to get surrounded by Turkish culture and habits. The hotel itself was a happy surprise for us. Small, comfortable hotel was clean and neat, very beautiful and has a amazingly good service. Hotel crew was ready to help us in all problems we ever had, helping us to find certain places and gave us some hints for places to go. Nice atmosphere made our holiday a succes!", "Date": "November 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Terrible value”", "Author": "barve", "ReviewID": "UR47461392", "Content": "I was forced to stay at Hotel Vezir because the hotel I had booked turned out to be overbooked at the last minute. The room cost 60 euros and was the size of a postage stamp. The only view from the room window was a wall!!! Needless to say I wouldn't want to stay here again.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Cute and Comfy!”", "Author": "arkeobaby", "ReviewID": "UR45440626", "Content": "Vezir is located in the Old City or Sultanahment which is first of all a great location!! I stayed here a few days with my friends. Upon arrival the staff were very accomodating and helped us get familiar with the area by showing us where we were on a map they let us keep. When we had an issue with the room one night they did no't hesitate to re-accomodate us to another room that was better with no problems. There is free internet in the lobby (be aware the Turkish keyboard is slightly different to English) and free chai/tea as long as the urn in the kitchen is gurgling. Breakfast every morning was satisfactory. Most of all I love being located minutes away form the Grand Bazzar, Haggia Sofeya, Blue Mosque and the train stops! There is a guy with a kebab cart outside and his kebabs are pretty good! Upstairs you can cross the fence and have a drink next door at the Bahaus Hostel's bar. The staff was also amazing and like old friends!", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "CRETE GREECE", "Title": "“My unforgetable stay”", "Author": "kreousa", "ReviewID": "UR40374886", "Content": "I stayed in vezir hotel 28 unforgetable days!!!!!!! The staff was exellent and very friendly standing by me as a second familly!!!!! The room was very clean and it made me felll very welcomed! i recommend it for a pleasant stay at Sultanahmet!!!", "Date": "September 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Great location but nothing special”", "Author": "sasandtim", "ReviewID": "UR35126967", "Content": "We recently visited Turkey starting in Istanbul and then making our way around and finishing there...sadly, the place where we stayed when we started wasn't able to offer us a room for our return so we booked at the nearby Vezir Hotel. The hotel was fine - nice, clean room with en suite (with very small shower) and breakfast in a nice little courtyard but it didn't have much character and wasn't particularly memorable. On the upside, the location is fantastic as it's in walking distance of many sights, restaurants and shops. There wasn't anything wrong with the hotel but, for the money, I'd be willing to bet that you could find something better in the area (there are loads of choices!).", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Absoulutely amazing”", "Author": "Gulsum", "ReviewID": "UR34378088", "Content": "Me and my friends stayed in the Vezir hotel for 2 weeks and had the greatest 2 weeks of our lives because of some of the friendly staff.The hotel is located in a brilliant place,very close to the sites of interest, museums and a lot more.Not only were we impressed by the location of the hotel but also four of the staff at the hotel, the cleaners and the manager.They are all very friendly and are always happy to give good service to customers. During the 2 weeks of staying at Vezir hotel, we all became very attached to it and to the staff, we were almost like a big family.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Suffolk", "Title": "“First class service”", "Author": "JTSuffolk", "ReviewID": "UR33440139", "Content": "The Vezir is a small, but very friendly hotel. The staff could not do enough for us, even going out to buy a different beer for me as I didn't like the one they had. Relaxing in the peaceful garden with a drink was the perfect end to a day of sightseeing. Breakfast was typically Turkish (but you could ask for omlettes to be cooked for you) served in a lovely conservatory. The rooms were small & fairly basic, but very clean with comfy beds. The location is perfect, within a short walk of the Ayasofya, blue mosque, Topkapi Palace & the Grand bazaar (if you don't mind a little longer walk). The tram stop was also a short walk away so the Dolmabache & Bosphorus were easy to get to. There were several bars & restaurants just at the end of the street. (We really liked the Family Restaurant) I would definitely recommend the hotel to anyone.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tipp", "Title": "“All we wished it to be”", "Author": "tippirish", "ReviewID": "UR31390536", "Content": "This was our first trip to Istanbul. On arrival at Vezir hotel my friend had migraine. The staff were so kind to us with tea and coffee brought out 'on the house'. Never had we been so well looked after and we travel quite a lot. Our room was small but very clean. The breakfast area was a delight , a place you could relax and enjoy your meal and a second cuppa. Being central to historical monuments was very important to us and those were just a walk away. Trams were available for 1.30TL to anywhere else. A glass of beer at night in the relaxing surroundings of foyer was great way to end day. Thanks to everyone for great holiday and especially for getting us to airport at 5.15am..Evelyn n Mary", "Date": "June 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Baku", "Title": "“Not the best place to stay inâ€¦”", "Author": "Adeline22", "ReviewID": "UR30023148", "Content": "There is no service at all, no security. Breakfast was very poor and the restaurant where it was served actually was very smelly. Location is fine for those who prefer to sightseeing only, due to the fact that itâ€™s pretty far from the actual centre. The hotel can be acceptable, if you need just a bed and roof, but in case if you are looking for some form comfort, try something else. Definitely, itâ€™s not good for families and canâ€™t even be compared with 3* hotels in Western Europe", "Date": "May 15, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bahrain", "Title": "“Small but Nice”", "Author": "Addel2009", "ReviewID": "UR28653888", "Content": "I had my 2008 short vacation in Vezir Hotel, Istanbul. Although, it is a small hotel, but, it is big in its services. People who like the counrty side, this hotel is located in the old part of Istanbul where you enjoy the stay and living with old and young kind and gentle people in this area. All the best, Regards, Adel", "Date": "April 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Zurich", "Title": "“Economic, neat and clean accomodation.”", "Author": "berman48", "ReviewID": "UR28579823", "Content": "The Vezir Hotel is a jewel tucked away on a side street from the many tourist bars and restaurants. Itâ€™s a small family hotel with small charming rooms. Economic, neat and clean accomodation. The nights were quiet and the mornings filled with birds chirping.The hotel is basic and that is what gives it its charm. It is a safe, cozy and wonderful haven in a busy city. The staff cannot be thanked enough as they are the true heart of the hotel and are fantastic in every way. Especcially sweet Aytun, the girl who works at the hotel desk. A happy turkish young lady always helpfull and friendly. We have had a lovely time at the Vezir Hotel. Turkish Breakfast on the garden in the shade of the trees was heavenly, the breakfast was fresh every morning, a great way to start the day and throughout our stay we have had such fun and friendly service. The hotel is very homely, with a good ambience, and in a very good location. The hotel is located well within easy walking of all the major attractions and the helpful staff is there for anything else that you want transportation to. AtatÃ¼rk airport is so close, that a taxi ride costs max 16 euros. If you plan on staying in Istanbul stay at the Vezir, you won't regret it. B. Erman, Switzerland", "Date": "April 22, 2009"}], "HotelInfo": {"Name": "Vezir Hotel", "HotelURL": "/ShowUserReviews-g293974-d605004-Reviews-Vezir_Hotel-Istanbul.html", "Price": "$72 - $105*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Akbiyik Cad.Bayram Firini Sok.no.13</span> | <span class=\"extended-address\">Sultanahmet</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34122</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "605004", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/00/7a/007a2040b2f7a0b846676f33952eca523large.jpg"}}