{"Reviews": [{"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Clean and comfortable”", "Author": "Margieandfriend", "ReviewID": "UR116990026", "Content": "The woman running the hotel was very kind and helpful. As you would expect it is quite basic but very clean. Rooms cleaned daily with fresh towels. Fridge and jug for coffee making.", "Date": "August 20, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "4", "Service": "1", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Don't Book in Person”", "Author": "Stajovia", "ReviewID": "UR104874465", "Content": "I went to this establishment in person to book a room for guests, six weeks before they were due to stay. I was told they would have a room, and to come back 10 days before their arrival to pay for their stay in cash. I received a very unpleasant surprise when I came back to do this and was told my guests no longer had a room there. I'm quite disgusted that I could not take the owner at her word, and that her writing down my reservation was no guarantee it existed.", "Date": "April 21, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Attended a Stag Party”", "Author": "zeusmartin", "ReviewID": "UR89316249", "Content": "Recently attended a stag party. my friend is getting married and so he thought to organize a stag party for all friends at a lovely venue Trinity House. It was an amazing venue which i got to known that he got it booked through The City Collection website. Guys those who are planning to throw a stag party, this venue is a must visit and refer the website too.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Denmark", "Title": "“They oversell this hotel in there advertising”", "Author": "Henrik50", "ReviewID": "UR56646364", "Content": "The rooms are very worn out. There were only one duvt/blanket pr. room, and the bed was very small. The bathroom was without heating. One of the toilets couldent flush properly. Only one towel pr. person. The so called \"continental breakfast\" as advertised both on the internet and in the hotel consisted of toastbread from at plasticbag and jam from a jar.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin,Ireland", "Title": "“Basic”", "Author": "coono", "ReviewID": "UR5920757", "Content": "We stayed at Trinity House B&B in Walthamstow for 2 nights (Sat/Sun), primarily because of its reasonable price (Eur47 double room/per night) and as it was within walking distance of a nearby transport museum (Lea Valley Pump House-well worth a visit) that we had planned to visit on the Sunday. The location of the guesthouse is East London and is 5 mins walk from Blackhorse Road tube station on the Victoria Line. Also, frequent buses 158 and 230 stop directly outside the accommodation. Trinity House is a converted Victorian house. The rooms are basic and although they were clean, we did have to remove several spiders from our bathroom each day! Also, the shower curtain in our room needs to be replaced as it has dried in mould stains on it. Breakfast was also basic-corn flakes, orange juice, bread and tea/coffee. Although breakfast was supposed to be from 7-9, it was nearer to 730 before the (self service) dining room was opened each morning-a minor problem but for anyone needing to depart early it could be an issue. All in all, I would sum up Trinity House as being basic accommodation and if all you are looking for is somewhere to sleep and wash, then this is the place to stay for a night or two.", "Date": "October 5, 2006"}], "HotelInfo": {"Name": "Trinity House", "HotelURL": "/ShowUserReviews-g186338-d606934-Reviews-Trinity_House-London_England.html", "Price": "$71 - $90*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">26 Blackhorse Road</span> | <span class=\"extended-address\">Walthamstow</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">E17 7BE</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "606934", "ImgURL": ""}}