{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“Great hotel, helpful and friendly staff.”", "Author": "Suber t", "ReviewID": "UR137207920", "Content": "We stayed at this hotel over the weekend of 2-6 August. We found that the hotel was extremely clean, the rooms were quiet and the staff were really helpful and friendly. The breakfast was continental buffet style, but definitely worth getting up for. It was obviously the same every day, but there was a wide enough choice to have something different on all of the mornings that we ate (we missed one!). Can't understand why it was not worthy of a 4 star, there didn't seem to be anything missing. it is a 10 minute walk to the Gran Via and Sol square, a further 5 minutes walk to Plaza Mayor. There are plenty of good bars and restaurants close to the hotel, and it is approx 1 minute walk from the metro. We found it good value for money.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Excellent location, friendly staff!”", "Author": "gardenbear", "ReviewID": "UR136535842", "Content": "The front desk clerk was very efficient and friendly. He went out of his way to make our stay there very comfortable. Our bathroom was very spacious and modern. The room was big and well kept. It's got a perfect location right off the Gran Via.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Not worthy of a 4* rating”", "Author": "99wallaby", "ReviewID": "UR136130165", "Content": "My initial thoughts of this hotel were, 'disappointing'. I wonder how the Spanish rating system works, as the 4* hotel I stayed in Barcelona far surpassed this hotel. I would put this hotel as a low 3*. The rooms were small. Nasty stain on our carpet. Not much storage space (which was fine as we were only there for 4 nights, but any longer would have proved a problem). The false ceiling tiles jumped up everytime the door opened or closed, then dropped with a bang, we were told not to worry about that! The beds were comfortable. The shower was a troublesome to say the least, every which way you tried, you managed to douse the bathroom floor with gallons of water. Our towels were generally used for mopping the floor, as opposed to drying ourselves! Although in the middle of the City, the room was quiet and sleep came easily. The Hotel was extremely well placed in the Centre of the City, meaning everywhere was easily accessible. All Spanish speaking staff, so my Spanish vocabulary was required!", "Date": "August 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“great location”", "Author": "Daniel I", "ReviewID": "UR132005188", "Content": "i've stayed in this hotel twice. great location, very central yet not very noisy. the rooms are large with trendy look. staff is warm.", "Date": "June 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Malta", "Title": "“excellent location !!”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR128584041", "Content": "location 10 points staff 10 points only drawback is that you have one mirror only in the bathroom no long mirror by the wardrobe or by the tv. it was very anoying as we were 3 girls in one room :-) trying to do your make up in one mirror is a nightmare :-)", "Date": "April 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Work in Progress”", "Author": "Beenaround73", "ReviewID": "UR127640230", "Content": "As part of our Europe trip in May '09 we stayed here for a couple of nights. We got into the main train station and then took the Metro to the Santo Domingo stop. We were a little turned around at first so we actually wound up walking the Gran Via and after we figured out we needed to head in the other direction, we finally found the hotel. The first thing that stuck out was the large trash containers up front. There was construction debris in them and when I saw the plastic on the floor, I knew what we were in for. The price we got should have also been an indicator, but since I'm a morning person, I figured this wouldn't be a problem. It wound up being more of an issue for my buddy than me. When we checked in we asked about it and they told us what time we could expect noise, but it wound up being earlier. From what we saw, the changes were going in a good direction. The lobby was nice and contemporary in style. The person who checked us in was nice and professional. We wound up getting one of the newer rooms, so for the price we were happy. Even the new hallways were pretty cool. The room itself was nice and large with 2 twin size comfy beds, a large dresser/armoire/closet IKEA looking thing, desk with chair, and flat screen TV. The whole decor was in a contemporary style, even the bathroom, which was nice and large. The shower was pretty cool since it was a full body wall spray system. Our room was on the 3rd floor and faced the street, so the construction noise in the morning was noticeable. If not for that construction noise, I would have easily given this place a 'Very Good' rating. Maybe next time we visit Madrid we'll see how things worked out.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“fine for younger travellers”", "Author": "someplacenice12", "ReviewID": "UR126637920", "Content": "Although the reception staff were particularly friendly and helpful, and the hotel was conveniently located off gran via, it didnt really suit me. I regularly visit Madrid, and usually try to stay in a 4 star hotel. However this didnt really feel like a 4 star. The decor was rather tired and utilitarian and to be honest a bit grim - everywhere was a shade of grey, or black, which was quite depressing, almost nightmarish. The facilities weren't really 4 star, Rooms were basic and lacking the small touches usually available in a 4 star hotel. The in room lap top - which was why i booked the hotel - was also past its prime, without the basic programmes, and rather erratic. There was nothing to complain about - it was simply a disappointment. I stress again that the staff were very good - it was the hotel which was a let down. There are so many good hotels to choose from in the city, and it's such a lovely city to visit.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Ultra modern interior.”", "Author": "rockandrose21", "ReviewID": "UR122147549", "Content": "We stayed here on a short city break and found the staff on reception were friendly but had limited English. Our room was very modern however the space was not utilised to its maximum potential, as the dressing table/desk was squashed against the bed. The bathroom had a frosted glass door which was not very private and it also would not close tightly. The shower had additional shower jets in the wall, however the lack of door on the walk in shower meant the water would splash out into the bathroom. The location was great as it was handy for the metro and several bars and restaurants. It was a short walk to the main shopping area. There were tour buses around the city at a reasonable price with plug in earphones in different languages.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Lovely hotel, very trendy :)”", "Author": "Nads2011", "ReviewID": "UR121998437", "Content": "I usually stay in hostals when visiting Madrid but as a treat stayed here with my boyfriend about a year ago to try something different. Rooms were very modern, had comfy beds , big showers and a mini bar !!! Was quite expensive but we had an enjoyable stay and if I wanted to spend abit more money on future visits would stay here. Staff were friendly and helpful.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“ok”", "Author": "zinasj", "ReviewID": "UR121115603", "Content": "this hotel is definately not 4 stars as it claims to be but it is fine. The front desk is helpful. It is clean and in a good location. Problems are the non- confortable bed, small room and very slow internet! There is no alarm clock in the roon and we couldn't figure out how to use the phone, even just to call the front desk...", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Trip to Madrid with my elder parents”", "Author": "sicng", "ReviewID": "UR120742405", "Content": "We stayed at this hotel on Nov 15 for 3 nights. The receptionist has given us the wrong type of room. I have booked a family room for my parents and I, because I wanted more space. However, when we checked in , the receptionist gave us a triple room (way smaller), when I complained to her, she insisted that we have made the mistake. After advising her we might just cancelled the reservation we got a call stating that we were correct. The maid who cleaned our room is excellent, we got better service from her that the people from the reception. Hotel location is excellent. Room is clean and modern. However, dont expect a big hotel. This is a boutique hotel. Would not go back next time.", "Date": "November 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“Great hotel with a excelent location!”", "Author": "Vania1978", "ReviewID": "UR117531000", "Content": "I stayed a weekend in this hotel that I strongly recommend! It´s very cosy, elegant , the rooms are not very big, but are good enough for a hotel that is located just a few metres from the Gran Via. The breakfast is also very good and the staff very helpful and friendly! I´ll will stay there again next time I went to Madrid!!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Wembley, United Kingdom", "Title": "“Great location but not really a 4star hotel”", "Author": "Herpi", "ReviewID": "UR117120150", "Content": "The hotel has an absolutely great location right in the centre and only few seconds walk from the station. The staff at the reception were ok but not keen, we had a smoking room, even if never asked for it so we could always smell the cigarette smoke coming thru the ventilation from the neighbouring rooms (hate that!). Room was small but that was a not a problem at all. I think the walls would need repainting bcoz they looked a bit dirty. We always stay in 4star hotels with my husband but I think this was the worst 4star hotel so far. Breakfast was very nice though, good choice of different stuff. I usually leave the hotel early morning to do the sightseeing and come back late night so the room is fine just to sleep in it. I can imagine myself staying there again because of the location and the price. There were nicer hotels around but more expensive so I guess this hotel is not a bad value overall. Oh, and the laptop is rubbish :-) But wifi worked fine on my own devices", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "London UK", "Title": "“Very good location - extremely accessible to center”", "Author": "Reviewguy8", "ReviewID": "UR116293831", "Content": "Nice modern hotel located in the city center within walking distance to the main shopping areas of Madrid. Hotel seems to have been maintained well with room features working well with a nice small but functional washroom. The hotel has limited in house food option apart from a basic break fast and room service but is surrounded by restaurants of every kind and cuisine imaginable for take away as well as dine in. Very close to the castle and also the touristy areas such as the museums and Plaza de espana, Plaza Mayor etc. 2 min walk from large department stores and lots of street shopping and also 1 min from the subway station. Free Wifi to all guests which is a boon for a business traveler.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "north vancouver", "Title": "“Well-located hotel that is excellent for families”", "Author": "europetraveler4", "ReviewID": "UR115552921", "Content": "The Petit Palace San Bernardo was located near the Santo Domingo metro stop in the heart of Madrid. It is close to the Puerto del Sol (10 minute walk) and the Gran Via (a 2 minute walk) and several restaurants. It is very easy to get to by subway and our taxi driver from the airport also found it easy to locate. This is s very modern hotel, with free wifi and a complimentary computer in each room for your use. The bathrooms were lovely - very modern - the only trick is to make sure that the numerous jets on the shower are pointed toward the wall inside the shower and not the open-style shower door to avoid getting water on the floor. Our room on the first floor had a large bed (2 twins pushed together) and bunk beds. The top bunk has no railing but we found it easy to pull the mattress down onto the floor for our 10-year old to eliminate any fear of her falling off. Beds are firm as are the pillows. We found it easy to get to the Puerta del Sol, the Plaza Mayor and the Palacio Real from this hotel. All are within very easy walking distance. The Palacio Real was excellent. Our 13-year old particularly enjoyed the armoury and its extensive collection of armour (for people and horses) and weapons. The palace itself was lovely with good descriptions in English for each of the rooms you could tour. Unfortunately you are not allowed to take photographs in the palace. We would happily return to this hotel again.", "Date": "July 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Basingstoke, United Kingdom", "Title": "“A Mixed bag but overall Very Good for the price”", "Author": "busytraveller2008", "ReviewID": "UR92055762", "Content": "Stayed here for 7 nights in their Family Rooms, which were a great size with a 2 year-old. Our first room was on the ground floor and it was quite noisy so had trouble sleeping a few nights due to the outside noise. The staff were excellent and always willing to help where they could. The shower in this room was really good but yes it did overflow quite a bit so you have to put towels down. The bed was a double, but very uncomfortable as it's one of those flip down one. On our last night the toilet next door leaked so we had to move rooms. We were moved to a 6 floor family room and we so wished we had that room our whole stay. A lovely queen sized bed with an amazing massage shower. Location is perfectly situated just off Gran Via, there's not much of a reception/lobby area to sit and chill with a coffee or book.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Bathroom Hell in the aptly named \"petit palace\"”", "Author": "lolly1603", "ReviewID": "UR62459524", "Content": "Stayed here in April with a group of friends. The hotel is in a great location just beside the Gran Via & equally close to the Santa Domingo metro station. The hotel itself is very small. The reception staff were extremely helpful & accomodating. We had 3 rooms, all of which were very small, which in itself was not a problem as we didnt go to Madrid to stay in the room all day. The main issue we had was with the bathroom. They had glass walls & a glass door (lightly frosted) - there was no way of closing the bathroom door properly, never mind locking it. We had to prop the shut with the waste paper basket. This could be really annoying- as our bathroom opened directly out to the bedroom, so you felt as if you could be seen while in the bathroom, where as our friends in the other rooms had their bathroom door opening out into the \"corridor\" part of their bedrooms. That said the bathroom was nearly as big as the bedroom , the shower as we had read in previous reviews flooded the floor before you even got into it. This was extremely annoying to say the least. We also felt that there could have been a mirror in the bedroom, but we had just the one in the bathroom. This hotel is clean & comfortable & we had no major complaints, however I would not reccomend it to friends purely on the bathroom issue, as I found it annoying. WE didnt book the breakfast package, so we cannot comment on it. Would definitley recommend going to the sPlaza Mayor for a long lunch in the sunshine & close to it is the San Miguel Mercado - a fabulous food market where you can taste the food on offer while wandering around. There are also several wine bars in here. A great athmosphere & full of tourists & locals alike.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Smart boutique hotel in a perfect location for exploring!”", "Author": "ljluk", "ReviewID": "UR62191644", "Content": "I travelled to Madrid with my partner in March for a 4-day break. We booked into the San Bernardo and it was exactly as it looked online so we were pleased. We had a room on the 6th floor looking out onto the back of the building. That didn't bother us though as the whole time we were there it was very peaceful. The room windows open too which was great for a nice cool breeze. The room itself was a little compact but ideal for 2. Free use of laptop in the room and an LCD TV. Shower room was huge. This hotel is perfect for a few days break. It is very central and right beside Santo Domingo metro stop. We didn't get one taxi during our stay. Within ten minutes walk you can be at Plaza Espana, The Royal Palace, Plaza Villa, Plaza Isabell II, the Opera House and Theatre. There are restaurants, snack bars and coffee shops on the hotel doorstep. Madrid is an amazing city with something for everyone. I would stay in this hotel again due to it's fab location.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Not that nice. NOT WORTH IT!”", "Author": "britaintravel", "ReviewID": "UR55832764", "Content": "The hotel is not that great. It is definitely NOT 4 stars. It is more like 2.5 stars at it's best. It is close to the main plaza, so if you are planning to spend most of the time out of the hotel, and hoping to just crash to fall asleep then this may be ok. Showers are old, and broken, and floor literally gets WET outside into the hallway. I also got smoking room, despite when I requested non-smoking. The laptops in the rooms are so old, that it literally took 10 minutes to just start. Plus there is constructions going on. The noise level was unbearable. NOT WORTH it. Go find another hotel close by.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast, Northern Ireland", "Title": "“Exactly like the pictures. Another great central hotel from the Petit Palace Chain”", "Author": "Itsonlymark", "ReviewID": "UR49143304", "Content": "The Petit Palace San Bernardo is an extremely modern and stylish hotel finished to a very high standard. It is situated just off the Gran Vía (Main Central Street) and 2 minutes from the nearest metro station. If you have stayed in a Petit Palace/High Tech Chain Hotel before then you'll know what to expect - spacious modern rooms with quirky interior designs and nice finishing touches (in this case: flat-screen T.V. and a large walk in shower with multi-jet function) I found the staff to be very helpful; recommending restaurants and sites, as well as pointing out the nearest outdoor public swimming pool. I would definitely recommend this hotel and would return to this hotel on my next trip to Madrid.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Great location for this hotel but don't think it is 4 star - more like 3.”", "Author": "ilab", "ReviewID": "UR47814252", "Content": "I have just spent 3 nights at the Petit Palace San Bernardo and whilst it is in a great location, the rooms are clean, the breakfast good I really don't think this is a 4 star hotel. It is one of the High Tech Hotels so has all the latest gadgets - the shower with the massage jets is a great idea as long as you don't mind having a completely wet bathroom floor after your shower. I had one with the jets for about 3 seconds as the water really does go everywhere - useless really. I booked a double room and was dismayed to find two single beds together with the sheets firmly tucked in between the 2 - this is not a double bed as far as I am concerned. When questioned about it the staff replied that I had not booked a king room so do not get 1 bed for 2 people, but 2 beds - I'm sorry but if I want 2 beds I will ask for a twin room! This did not make for a very romantic stay in this hotel I'm afraid to say. I did have one of the rooms at the rear of the hotel which was great as it was really very quiet at night so we had no problems with noise as you would have if on the street side. Most of the staff was friendly, but definitely not all and I really feel as though a few more smiles from everyone would not go astray! Breakfast was great although the hotel does have a problem with the fact that the breakfast area is not large enough for the number of people staying in the hotel, especially during the weekend and there were often queues for a table for breakfast - this is certainly not 4 star material. Having said all of this I was very impressed with the cleanliness of the rooms, even though they are on the small side.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Liverpool", "Title": "“Great central location”", "Author": "Deb3", "ReviewID": "UR45882933", "Content": "This hotel is well placed to visit Madrid - just off the Gran Via. We took a taxi from the airport which cost 40 euros which is expensive for a 20 min journey. We took the Metro back (see below). We were given a room on the front which was too noisy so we asked to move. The staff were very obliging and we were moved to a rear room which had a view of a tatty roof but it was very quiet. Our room was small but perfectly fine for a weekend break. The staff were friendly & helpful. The lap top in our room was useful. If you need any printing then you can use the computer in reception. There are juices & water in reception for guests to help themselves to. The hotel is within easy walking distance of the Royal Palace & gardens, the Opera House, Plaza de Espana, Plaza Mayor, the Teleferico & parks. There are plenty of shops, bars etc in the area. We took the MadridVision open top tour bus which costs 17 euros for the day (the bus runs until about 9pm). You can buy your tickets at hotel reception at no extra cost. The bus stop is right near the hotel - go out onto Gran Via and cross the road to KFC/McDonalds & the bus stops there. We loved the Teleferico!! This is a cable car that gives you stunning views of Madrid. It's only open on Saturdays, Sundays & Bank Holidays from 12 noon. It costs about 5 euros for a return journey & takes about 25 mins. You can get off the cable car at one end and have a drink in the cafe or a walk in the park or you can just stay on for the return journey. Well worth a visit! You can easily walk to it from the hotel. Walk down Gran Via to the Plaza de Espana. Cross over the main road and keep walking right around the park (past the Temple relic). Keep right and continue along the edge of the park and you'll see the sign for the Teleferico and the steps down to it. Don't be put off by the long queue - there are lots of cable cars (seating 4 persons) and the queue moves along very quickly. We took the Metro to the airport which was easy & cost 2 euros each. Walk to the Metro station at Plaza de Espana and take the blue number 10 line for Hospital or Tres Olivias. After about 4 stops get off at Nuevos Ministerios and change to the number 8 pink line which takes you straight to the airport terminal (it's about 4 stops). The journey takes about 30 mins and the ticket machines are in English. Failing that just follow every one else with suitcases!!!", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hawaii", "Title": "“Good location, price & breakfast”", "Author": "fitgma", "ReviewID": "UR37114418", "Content": "Stayed three days in July, 2009. Hotel was very close to nearest subway stop, just off a busy commercial area, close to many restaurants and stores. The reception staff all spoke English. Room and bed were very large, well equipped with a laptop in every room, great AC when the temperature was in the 90's outside. Great bathroom and freshly squeezed orange juice in the breakfast which was well worth the 10 euros per person because you could eat all that you wanted. Hotel was very clean and even though just off a very busy street (the Grand Via) it was very quiet at night.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Stirling, United Kingdom", "Title": "“Very Central Hotel”", "Author": "AlCatraz", "ReviewID": "UR26717695", "Content": "We visited for 5 days in March. Hotel is very central with Metro station within metres. Rooms are small but adequate.The air conditioning did not work during our stay.On overhearing another couple complaining to reception regarding this they were told by the manager that Madrid was experiencing unnusually hot weather and the Hotel had not been able to change the settings from Winter to Summer!!. Our room was facing the main road and had a balcony. We found this room very noisy at night (as did all who stayed in the road facing bedrooms)from traffic,police sirens and party goers who seem to congregate in a square very close to the Hotel and party all night. Some were still there when we were getting up!!. Breakfast was good with a large selection. I would recommend this Hotel as a good base for sight seeing but only if you take ear plugs!!!", "Date": "March 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Helpfull Friendly Staff”", "Author": "Globalian", "ReviewID": "UR23486996", "Content": "The Hotel is close to San Bernardo Metro, and within easy reach of Gran Via and all tourist attractions. The Hotel reception staff were very helpfull and provided me with a map and advice on where the major city attractions were. My Hotel room was very clean and comfortable, with a laptop and free internet connection, and a LCD Television. I would recomend this Hotel for the friendly atmosphere and helpfull staff and it's good location.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "italy", "Title": "“perfect stay with 3 kids”", "Author": "cinziaItaly", "ReviewID": "UR23372137", "Content": "We stayed at the petit palace just before Christmas,perfect stay,right in the centre ,close to gran via ,the theatres,the shops.We were with 3 kids and I must say that the receptionist was very kind (free chocolate or coffee or tea from the breakfast machine in the afternoon,for the kids) We think we would come back again! The only drawback was we had a room on the top floor and the ceiling was very low,so we had to be careful not to bump our head on the ceiling beams!", "Date": "January 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "France", "Title": "“Free use of Laptop in Room”", "Author": "Mikel47", "ReviewID": "UR21495319", "Content": "We stayed in a family room with our two teenagers and the room still felt spacious. The Wifi access with a laptop in each room was excellent - unlimited access to Tripadvisor and google maps. The staff were friendly and helpful - we would return.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "miami", "Title": "“Nice Place- Close to everything!!”", "Author": "rebeccasosa", "ReviewID": "UR21464809", "Content": "My husband and I stayed at this property back in April. We were only there 1 night layover on our way to Rome. The room was really modern and contemporary, but a little small. The bed was fairly comfortable. The hallways illuminate as you walk by. That was pretty cool. The front desk was helpful when we needed assistance in locating a hardware store to purchase more electrical converters. They had breakfast but it was rather expensive considering it was only a continental fare. The best thing about this hotel is that it is centrally located near 2 Metros, restaurants and The Plaza Mayor. Also it is a short walking distance to the Spanish Royal Palace. If we were to return to Madrid we would mostly likely return to this hotel. We had a great night’s stay.", "Date": "November 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "london, UK", "Title": "“OK, if you like small rooms”", "Author": "longbaygirl", "ReviewID": "UR21430804", "Content": "OK, but overpriced. We paid 300 Euros for 2 nights for a triple room. After being moved from a sister hotel (leaking roof) we were expecting an upgrade. All we got was free internet access! Asked for a free breakfast, for the inconvienience (cost less than 30 Euros) and hotel said no. Room small, carpet stained, not enough pillows. Location good, but not matched by the quality of the rooms.", "Date": "October 31, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wigan", "Title": "“Fantastic!”", "Author": "Rozyb", "ReviewID": "UR19982932", "Content": "We're a young couple on a few day break to sight see and the location of the hotel was perfect. Right in the centre, very near to puerta del sol, palacio real, plaza mayor & santo domingo metro station is about 30 second walk away. Hotel staff were extremely friendly, helpful and spoke good english. Although another review warns about wake up calls we had a wake up call at 4am which was perfectly on time and a taxi waiting for us as we checked out which was infact early so no need to worry on that front. The room was a good size, plenty of hanging space and room for clothes. Bathroom was modern and nicely finished, brilliant shower but as people have said the floor does get a bit wet which is fine just don't leave clothes on the floor. The corridors with the purple lighting didn't make it difficult to see, you can see the room numbers easily and that's all that matters in a corridor as you don't spend any time there. Internet in the rooms was very fast and ours didn't have a dodgy search history or pop ups. We were facing the building site but the windows were very sound proof and the curtains blocked out all of the light. Even with the window open it was very quiet. The hotel may not have room service but there are so many retaurants and shops within very close distance so to us that didn't matter at all. Generally had a brilliant stay and have already recommended this hotel to other people.", "Date": "September 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "England", "Title": "“Palace.....in name only”", "Author": "Multi-Plug", "ReviewID": "UR16671511", "Content": "Stayed here for a week long business trip to Madrid (was my first visit to Spain too). Check-in was quick, a bit casual and felt like I was checking in to a hostel or B&B. Small reception, not much room. No porter around to help with luggage or take me to room which is never a good sign. Staff were ok, serious & pleasant not particularly chatty and always seemed busy. Room on 2nd floor at rear of hotel overlooking the construction site next door so no view. suprisingly, very quiet apart from occasional shouting amongst the builders. Did get a bit airless at times, so needed window open even though cold outside. The room initially felt small but soon got used to it. Cupboards were cheap and cramped, like something you'd buy from Ikea for a childs room. Not much space for my suit,shirts and stuff. Plasma TV but lacked variety of channels - no movies in English only CNN/Sky , yawn. The laptop in room is a great idea. Really impressed with that although it was full of pop ups, cookies and other nasty bugs (along with a very full pc history folder, the adult content of which I daren't mention!). A secure room safe which was very useful. Really needed tea/coffee making facilities in room! Bathroom - Good points: Modern, roomy, great shower that everyone mentions (water still floods out as shower has no door ) and always very clean. The lighting in the corridors is ridiculous, just like a night club (as some other reviewer said!) it's dark, purple, pretentious and impossible to see clearly, bet the Health & Safety Dept would have a fit if they saw it. Breakfast was a sad affair really. Located in a tiny area next to reception that looked like an afterthought. The offerings weren't that great - fruit, rolls, slices of meat but the luke warm scrambled eggs & fatty bacon were my usual, more from routine than appetite. At least you don't feel tempted to over eat and spend too long there. Didn't seem to be any room service? I live on room service on business trips so this was a big inconvenience for me. Can't eat out every night so ended up with sandwiches in room, no wonder I lost so much weight! The Business Centre - mmm, it's just a desk with a pc on it next to reception...not exactly a thriving, bustling hub of corporate activity. Maybe I missed it and it's on another floor? Hotel location was excellent as I needed the metro every day. Good for shops, cinemas, theatres etc and the street's not too noisy. It's a nice hotel for say, weekend shopping trips, sightseeing, romantic breaks etc but not for regular business travellers. Not particularly good value for money and the area is full of hotels with similar rates so next time I will stay elsewhere.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ontario", "Title": "“Uncaring Staff”", "Author": "ZoomJet", "ReviewID": "UR16593799", "Content": "We've just returned from Le Petit San Bernardo Madrid and although aesthetically this boutique hotel was nice, the service was less than adequate. Firstly, the floors reeked of bleach. The carpets were bleached just upon an afternoon arrival but the sad thing was the smell did not dissipate. It's rather difficult to sleep with the smell of cleaning products. Secondly, the worst part of our stay with this hotel was the unfriendly staff, specifically the front desk. We requested a wake up call and confirmed it twice to ensure with the shift changes that our request was put in the system. The day of departure we did not get our wake up call!! This caused us to miss our international flight! When asked what happened to our wake up call, they simply replied that they received the busy signal indicating the phone was off the hook (completely untrue). They didn't even bother going up to our room to check or knock on our door which goes to show their indifference. If anyone requests a 4:00am wake up call and a taxi, this should be taken seriously. We also didn't apprciate that the front desk passed the blame to their us, their supposed 'guests'. Their lack of friendly service and incomptence is the reason why I would not recommend this hotel to anyone.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice little hotel - convenient location”", "Author": "travellerTerry", "ReviewID": "UR16474606", "Content": "We stayed 3 nights at this cute little hotel. The room was rather small but quite efficient. We had a room facing the street and it was quite noisy. We realized there where rooms in the back of the hotel when we checked out. The location is very handy just a few steps to the subway and the Gran Via. We walked to most of the locations we wanted to visit and took the subway to the Prado. Breakfast was included in the rate we paid and it was quite delicious and plentiful. The receptionists were very friendly and tried to help us obtain tickets to the Alhambra in Granada. They spoke English quite well and we had no problems at all communicating.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pawtucket, Rhode Island", "Title": "“Excellent Find - comfortable and good service”", "Author": "AlecRI", "ReviewID": "UR16405128", "Content": "Stayed one night at the Petit Palace San Bernardo in first week of May, 2008. Very modern and up-to-date, and as part of the Internet Hotels chain, has good wifi and, a first for me, a laptop available in the room! The room was not large, but it was by no means small/claustrophobic. Just fine for me as a single. Looked on courtyard rather than street, which was OK for me as it meant it was very quiet. One funky element was the dark hallways on the floors with purple lighting - definitely a design statement. Bathroom very comfortable, however with that glass-half door on the shower which seems to be so common in Spanish hotels - I've never learned how to navigate not soaking the floor, and I did that again (in particular when I tried the fab full-body shower). The bathroom is separated off by a smoked glass front wall - I guess one could have privacy issues if sharing a room - but it really is not transparent at all, barely translucent. I got an excellent rate of 99 euros booking online through a service - would definitely come here again. Breakfast was not included in price. I paid for it since I was on business (I usually just go find coffee and a pastry somewhere) and enjoyed it. Service very friendly and efficient - can't comment on their English skills since I speak Spanish fluently. Also, location is EXCELLENT to the Gran Vía!", "Date": "May 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lisbon", "Title": "“Comfortable but not \"special\"”", "Author": "richeyint", "ReviewID": "UR15021393", "Content": "Nice Hotel but not special No bathtub wich I would have liked Average Breakfast", "Date": "April 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Upstate NY", "Title": "“Great location”", "Author": "T.B.Patriot", "ReviewID": "UR13803545", "Content": "We just came back from our trip to Spain and all the places we stayed were great!! This hotel is a part of a chain and this was our first stop. It's location was excellent and we were able to walk to many of our sites. Also the Metro system in Madrid is excellent and there is a stop just a block away. We stayed in a family room as we have two teenagers and they slept in bunk beds which they liked. The room was spacious for European standards. The front desk was friendly and had no problems. Other people talk about the bathroom where the door is made of glass and doesn't lock but I really didn't think it was a big deal. We'd stay here again without hesitation.", "Date": "February 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“30th Birthday Surprise!”", "Author": "amandam742", "ReviewID": "UR13506716", "Content": "I took my wife to Madrid for her 30th Birthday and although we'd never been there and we booked everything online...it was perfect. We wanted to write a positive note about the Petit Palace San Bernardo because the staff there was exceptionally kind and helpful and the hotel was satisfactory. We were a little scared when we first saw the hotel because it is just off the main street and almost misable. We were pleasantly surprised when we walked inside though at how up to date the hotel was and how nice the people were. The room was a little small but we thought it was very quaint. The bed was very comfortable and the full body shower was strong and warm! I speak a little Spanish and honestly the staff was super excited that I tried. The good news is that all of them spoke very good English so when my Spanish did fail me they could still help. As an example, one of the staff members (Jose I think) was able to book a reservation at the oldest restaurant in the world (Botin) with only a few hours notice. We still don't know how he did it because this place is always crowded. There were 2 computers with free internet that we used continuously and the food was good. We realized that the hotel was extremely close to everything but just off the main roads so that we were not up all night with noise. We have nothing but good things to say about this place and would absolutely stay here again. If you're looking for a place to sleep in and relax after a long day of walking, this is a good spot. If you're looking for a large lobby to hang out in or a bar, this is not your hotel. But with so many pubs, bars, restaurants and lounges around, why would you hang out in a hotel lobby???", "Date": "February 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Ultramodern,city centre hotel”", "Author": "Littleblue100", "ReviewID": "UR8862085", "Content": "Managed to get a unbelievably great rate on this hotel so couldn't turn it down. The location was fantastic - only a very short walk from all the main attractions of madrid city centre and there was no need to get on the metro system at all except to get to and from the airport (this took less than 1 hour). The hotel is small. The room had ultramodern decor and was immaculate (and we are quite fussy!). There was a laptop computer in the room with free internet access, a widescreen TV, free safe, 2 balconies coming off the room and a hydromassage shower which was fantastic. Some of the other reports I read say that the shower floods the bathroom - I think the hotel has tried to get around this problem by erecting a plastic sheet inside the shower cubicle. This did work but kept falling down which was a little annoying! Breakfast was not included in the rate but would have been 10 euros per person per day but we did not take this as there are so many little places close by to grab something to eat (in particular a churros y chocolate which must not be missed when in Madrid!). Check out was midday which was really reasonable and meant not having to rush on the day we left. If I have any complaints at all it would be that despite double glazing there was a lot of street noise coming in to the room. But really this is an absolutely fantastic hotel in the centre of Madrid that I would highly recommend.(NB - this hotel is part of a chain and there were several other hotels of the same group also in central locations)", "Date": "September 23, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Cork, Ireland", "Title": "“Really nice hotel”", "Author": "fuelfiredesire", "ReviewID": "UR8672610", "Content": "This hotel is really modern and fresh. Nice decor, trendy looking. Good size room, we had a twin room. Lovely bathroom, HUGE shower!! For those of you who like privacy though, the bathroom is glass (but you cant see through!) and the door does not lock. This did not cause a problem for us however, afterall, no one wants to look at their friend on the toilet!! We didnt have breakfast so cant comment on that, but the breakfast area is quite small. The location is pretty good too. Front desk staff friendly. Overall, a very enjoyable stay.", "Date": "September 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Excellent location”", "Author": "MissAManchester", "ReviewID": "UR7634320", "Content": "We have just come back from a long weekend in this hotel and thought that it was very pleasant. The rooms were nice, clean and comfortable. I agree about the flooding shower but it was lovely! The location is the best thing about this hotel, a short walk from Gran Via, tubes, shops and an easy walk to Sol and other areas with lots of lively restaurants and bars. Staff were friendly and helpful and happily moved us to a room with a double bed (rather than a twin) when we asked. Free internet in reception is handy. We ate the breakfast there but I think if I went again I would eat in local cafes instead for more variety.", "Date": "May 17, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Munich", "Title": "“Incompetant Front Desk Staff”", "Author": "Sevillana_in_Sandals", "ReviewID": "UR7572001", "Content": "I tried to call my sister, and it took the front desk twenty minutes to answer the phone (which was a challenge to find anyway). When they finally answered, the clerk could not locate my sister's room, and scared my family into thinking she had not arrived. With only 57 rooms in a hotel that advertises itself as high-tech, it's really scary that they could lose someone. We went back and forth for 15 minutes, and I emailed the clerk the details after spelling everything phoenetically five times. No response--she just gave up on me. This level of customer service is extinct in the States. I wouldn't stay here if you want the world to be able to find you.", "Date": "May 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“great find”", "Author": "pepsi35", "ReviewID": "UR7474958", "Content": "Myself and my husband have just returned from staying 4 nights at this hotel. We found it perfect location wise, there are two metro stations within 2 mins walk of the hotel. The hotel is also 10 - 15 min walk to plaza mayor, the royal palace, sol, etc., basically all the central areas. The area feels safe also, the Gran via is at the end of the street, and a little seedy at night, but ok. The room was clean, shower excellent, though i realise what other reviewers meant by the floor flooding when the shower is used. Basically the shower would benefit from a door, but thats its design (hi tech) as per hotel chain name!. Bed was good size, basically two single beds together, which was fine. We had a room at back of hotel which was very quiet. only downside is there is only one mirror, and thats in the bathroom, so kinda annoying when getting ready to go out at night. Staff were very friendly, with good english. We opted to go without breakfast, so ate out, cafe at the corner of street is fine though, and cheaper than hotel. All in all this hotel was good value for money, and we had no complaints, would recommend.", "Date": "April 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“Very good hotel”", "Author": "mogli43", "ReviewID": "UR7011491", "Content": "This is a very good hotel and we were very pleased with it. The location is excellent - right on the Gran Via, but on a quieter side street (though I wouldn't call it a quiet location). The room we got (605) was very large and everything was brand new. The breakfast was also excellent and very rich. The staff was friendly, efficient and curteos. The only problem I can think of is that rooms on the sixth floor (like ours) are just under the roof and probably extremely hot in summer - it was very warm (we slept with the window open!!) in early March.. Overall highly recommended.", "Date": "March 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“flooding shower”", "Author": "pfsdobbs", "ReviewID": "UR6473521", "Content": "my wife an i stayed here as a short break before Christmas the shower was hyped up in all reviews, when we arrived had to have a shower on the metro for a hour in rush hour if you go you'll know what i mean anyway the shower it took 10 minutes to work it out and when i did it was great until my wife told me the water was spraying outside the bathroom onto the carpet, so dried my self got dressed went to complain about this and was told by a member of staff close the door into the shower room and put a towel below the door to stop the water overflowing into the carpet --why didnt i think of that??/ also only one mirror in the room other than that it is a very friendly and right next to the grand via", "Date": "December 19, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Strongly Recommend this hotel”", "Author": "Jabei", "ReviewID": "UR6330522", "Content": "This is a really nice hotel... Firstly, what could be described as negatives to some people :- It has no bar or room service or restaurant The positives :- It is modern, clean...has a great location (just off the Grand Via but far enough away not to be bothered by noise) Very close to the metro - helpful staff - nice large bathroom, no bath but good shower....it is like a wetroom so sometimes some water might get on the floor, but that´s ok. Relatively inexpensive.....Free internet access in rooms....2 laptops with free internt in the foyer. I can´t think of a bad thing to say about the hotel", "Date": "December 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great Hotel!”", "Author": "Camundongo", "ReviewID": "UR6305356", "Content": "The hotel is clean, modern and has a great shower. The beds are big and the people are professional and friendly. The breakfast is good, but not included in the room price. I will stay here again when I come back to Madrid.", "Date": "November 29, 2006"}], "HotelInfo": {"Name": "Petit Palace San Bernardo", "HotelURL": "/ShowUserReviews-g187514-d607405-Reviews-Petit_Palace_San_Bernardo-Madrid.html", "Price": "$111 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ San Bernardo 3</span> | <span class=\"extended-address\">(Esquina con C/ Gran V&iacute;a, 53 y Plaza de Santo Domingo)</span>, <span class=\"locality\"><span property=\"v:postal-code\">28015</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "607405", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/4c/9a/e7/habitacion-doble-dui.jpg"}}