{"Reviews": [{"Content": "Sublime Week Went to Bali after a weeks work in Jakarta. Had been to Bali many times but never stayed in Seminyak before nor in a pool villa. Was travelling with my wife and 20's daughter. Arrived late, after 11, driven down pokey laneway off main road into a beautfully lit property to be met by staff. Taken to our 3 thatched hut villa compound, WOW. Goergeous high walled property, fabulous personal pool set in tranquil gardern with a decent deep end. Living areas including full kitchen all outdoors under thatched canopy. Individual rooms with kingsize beds in HUGE rooms with canpy over each. nets around you at night to ward off mosquitos but great A/C. Bathrooms attached to each room and are semi outside so take some getting used to.Before retiring through our front door we're asked when we'd like breakfast, from 6.30 till late. All included and the staff actually arrive at the specified time with ingredients and cook it for you in your kithchen whil you either lounge around or swim. You can have it different every day, and different per person, no trouble.While in your property you are completely private. If fact you can go the whole time and not see a sole. but when you want them they're there in less than a minute. Always smiling and happy.Dusun is a very short walk to the beach, high end restaurants and not so high end, recommend La Luciola and Breeze (both beach front) plus just up the road away from the beach is an amazing coffee/supply/eatery called Grocer  Grind (you'll find an excuse to pop in everyday).Only 13 units, no restaurant on site but they'll have food delivered in if you want to stay in (and you will) plus don't want to cook.Hope we can go there again.", "Date": "Dec 10, 2008", "ReviewID": "UR868312392", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Wenicks"}, {"Content": "Five Star all the way This a beautiful place to stay, given it was our honeymoon, the staff could not do enough, gorgeous people to deal with, I would highly recommend it for a few days, then stay in different parts of Bali, i.e. Ubud just to break it up a bit. Seminyak has a lot of road and building construction going on and is just as busy as Kuta. But the Dusun is very private, no outside noise and certainly couldn't hear the neighbours at all. The villas are very well maintained and clean, there was nothing I could fault about them at all. We loved it. As for the comment that the pool is not big enough to swim in the one bedroom villa (previous review), you fool, it is not a lap pool, it is a plunge pool to relax in and there is plenty of room, honestly!!! There is no pleasing some people. I would highly recommend this for couples and families, we wll be bringing back our children to stay here.", "Date": "Dec 1, 2008", "ReviewID": "UR956296312", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "jackson9"}, {"Content": "Totally Georgous We stayed at The Dusun for four nights in September '07 and our only regret is that we could not stay longer!What can I say about The Dusun that other reviewers have not already said? Luxurious solitude best sums up the place and your own cook really does come to your villa to make breakfast!!!! We stayed in a one bed villa with its own totally private pool - complete luxury! The villas themselves are mostly open plan with living area and kitchen overlooking the pool and separate bedroom and very cool bathroom! Being able to go for a swim at midnight in your own pool was sheer decadence, this is what holidays are all about!!The villas are located just 10 mins walk from the beach. Several good restaurants are just a short walk away also ( La Lucciola and the famous Ku Te Da - perfect for sunset cocktails) although the staff will drive you anywhere you want to go and it is very easy and cheap to get a cab back in the evenings.We had done most of our sightseeing earlier in our Bali trip so our last four days at The Dusun was a total chillout time and it did not disappoint.I really cannot recommend The Dusun highly enough and will definitely stay here again.", "Date": "Oct 6, 2007", "ReviewID": "UR958618601", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Chelle72"}, {"Content": "Super fine time, class in all respects       Villa 2", "Date": "Sep 12, 2007", "ReviewID": "UR276606428", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "TimmyTonsil"}, {"Content": "We didn't want to leave!       Dusun", "Date": "Sep 11, 2007", "ReviewID": "UR805107209", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "AroundThaWorld"}, {"Content": "Luxurious solitude Have stayed in Bali a number of times but decided to spend a little more for a special weekend and the Dusun did not disappoint. Booked a weekend deal(2 nights) over the website for $495 which included free minibar, laundry, breakfast, transfers , 1 hour massage for 2 and villa upgrade on availability. This turned out to fantastic value as we were upgraded to a huge 3 bedroom villa. We cannot rave enough about the Dusun- it is a fantastic place. Each villa comes with its own totally private, immmaculate garden, the centrepiece of which is a large elliptical pool. The villas themselves are open plan wth closed bedrooms coming off the open plan living area which look over the garden and pool. Although the villas are located a short (10min) walk to the beach we only ventured out of our villa for lunch and dinner preferring to relax by the pool. For a bit of a variety we broke up our relaxing by the pool with a massage by the pool.As mentioned in other reviews breakfast is cooked and served in the villa and forget breakfast served at a ridiculous early hour of 9 or 10am, you can order through till midday (which we took advantage of).A choice of Indonesian and American breakfast was offered and accepted.For restaurants recommend the Hu Bar, The Living Room and La Lucciola(great sunset cocktails!) which are all within 10min walk although staff will drop you off as it is a little tiring after lounging by the pool all day. If it is all too much to venture out most restaurants will deliver. Returning to the villa at night gave a different perspective with the beautifully lit gardens and pool, a late night dip (into the pool) could not be refused. Bed offered a blissfull nights sleep (thus the late breakfast) and the mosquito net over the bed was purely for atmosphere. The staff set mosquito coils at night which seem to effectively keep them away, although we did find it necessary to set a separate coil in the open air bathroom. The location and the villas themselves are totally peaceful. We did not hear or see any other guests during our entire weekend although Im sure they were there.The only gripe we have is that the included mini-bar consisted only of 2 beers and 4 cans of softdrink although it was refreshed each day and wine could be ordered at reasonable cost.We will most definitely be back to enjoy the Dusun.", "Date": "Feb 6, 2007", "ReviewID": "UR623888092", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Alena&Steve"}, {"Content": "Like travelling first class for the first time.... I've been to Bali many times but this was my first 'villa' experience, and I am afraid I have ruined myself for life now. It's a bit like always travelling in economy and then you are upgraded to first. That is what the Dusun is like. Breakfast is made in your own personal kitchen by chefs who make you whatever you want and your table that is laid with real linen looks over your pool (not a plunge pool but one you can do laps in and your 6foot tall husband can't touch the bottom of..). It is small and secluded, like most boutique places in Bali so don't fret when the driver takes you through the dark lanes. I prefer the area of Seminyak more so than the other areas of Bali as it is full of less tourist tackarama and the beach is nicer. The Dusun is the exact same design as The Villas Seminyak but in my opinion a better location as you can walk down to the magnificent La Lucciola resturant and Bodyworks Spa (best value in Bali).", "Date": "Oct 20, 2006", "ReviewID": "UR160119582", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Jusco"}, {"Content": "THE BEST !! I'm not sure if the last reviewer is talking about the same correct place?? ' ..the noisy breakfast' .. they come to your villa to cook it for you!!??I was married at our own private villa last year and it could not have been more perfect! The staff were SO wonderful and helpful, the villas are all high walled (with your own doorbell!!) and completely private; spotless and comfortable.Its in a great location; just minutes from the best restraunts and a lovely (and cheap) spa nad the staff will drive you to wherever you want to go. ( they drove us our next destination, 3 1/2 hours away .. he had only been there once before ..it was like the other side of the earth to him ! But all with good grace and spirit!)As I have said; you can request what time they come to your villa to cook your breakfast and what time you would like it cleaned ( none of this knoking at your door at some ungodly hour).I cannot reccomend it enough !! It was SO, SO wonderful !!", "Date": "Jul 11, 2006", "ReviewID": "UR172223652", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lardner"}, {"Content": "Fair value depending on what you want, The Dusun in Oberio could be your next destination for a getaway in Bali. The one-bedroom we stayed just last week was in good shape and price was reasonable. The villa is about 3 years old and the furniture was ok (not exciting), room was clean, but the bathroom was not well-designed and the most disappointing thing was that the pool was L-shape, meaning you could not really swim. It is situation in very good location, within 5 mins to good restaurants, clubs etc.The place was managed well, people were nice but the breakfast was really noisy. We skipped the rest of the breakfast after the first one.We moved to The Bale in Nusa Dua for the rest of the stay. It is a up-scale bontique villa/hotel and is really nice property. It was pricier - more than double we paid at the Dusun. Excellent restaurant and very good size pool. The beach (2 minutes from there) is very nice.", "Date": "Apr 19, 2006", "ReviewID": "UR966505711", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "tripConnoisseur"}, {"Content": "娣便亜銉椼兗銉亴鍗拌薄鐨?#x201d;   showReview(22994270, 'full');", "Date": "Dec 25, 2008", "ReviewID": "UR454240873", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "miki222"}, {"Content": "蹇仼銉淬偅銉?#x201d;   showReview(19169324, 'full');", "Date": "Mar 9, 2008", "ReviewID": "UR126935601", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儍銉椼儷銇亰銇欍仚銈?#x201d;   showReview(19161431, 'full');", "Date": "Jun 17, 2007", "ReviewID": "UR833290950", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "蹇仼锛?#x201d;   showReview(19160038, 'full');", "Date": "Jan 20, 2007", "ReviewID": "UR745842747", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "锛戙儥銉冦儔銉兗銉犮倰鐢炽仐...   showReview(19920777, 'full');", "Date": "Aug 26, 2003", "ReviewID": "UR230045050", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g469404-d607687-r22623566-Dusun_Villas_Bali-Seminyak_Bali.html", "HotelID": "607687", "Price": "$392"}}