{"Reviews": [{"Content": "Functional but nothing special We stayed in a private double room with ensuite for 2 nights. The room was functional and it did what we wanted which was provide a base to sleep in, but it was nothing special.It was pretty clean, but a couple of small things were a bit annoying: the hairdryer didn't work, the TV didn't work - things that aren't that important but when they are advertised as part of the hotel deal, I think the owners should really make an effort to get them working. The room was also right on the main street so there was a lot of street noise at night.Check-in was a bit of a pain. At the main building entrance there was a note asking guests to dial an Italian mobile rather than press the buzzer. This would be problematic if you were travelling without a mobile. Luckily someone came out the main entrance as we were waiting so we got in that way.I didn't find the owner particularly helpful, and the girl cleaning there complained about how much work she had to do which was why our room wasn't ready yet - not really my problem as a paying guest!The stay was ok, but I wouldn't recommend it to friends and wouldn't go back - there are plenty more hotels in Florence.", "Date": "Sep 29, 2008", "ReviewID": "UR844228783", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "scubagirlUk"}, {"Content": "Easy and functional, very nice/helpful staff Francesco  Magdelana were very very helpful and easy going giving as much information and interaction as you wanted.Any questions you had based on whatever your tastes and desired experience of Florence they were more than helpful with.The accomodation was functional and basic but delivered for us what we wanted since Florence is not a city where you are going to spend alot of time in your room-there is so much to see.The room was clean, neat and tidy along with the shower and wc. The building was secure right around the corner from the station, very easy to find and off the street so no noise at night.Location wise it was central for our needs and a very short walk to the centre and very near the excellent markets.Overall an excellent result for the price with brilliantly helpful staff, we will be back should we end up in Florence again,Richard and Stacey.", "Date": "Sep 21, 2008", "ReviewID": "UR199577735", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "Ire-Australia"}, {"Content": "Great Budget Hotel This is a great budget hotel. We were g in Florence for 5 nights in a 40 day European vacation. We stayed in the room that has a private washroom. The room was better than expected. The bed was modest, but not too hard. Location was good, but not exactly in the center. About a 10 minute walk to the Duomo. So, not that far...I would recommend this hotel to anyone on a budget and wanting a nice place.", "Date": "Jun 17, 2008", "ReviewID": "UR190329294", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "kaos_bobyn"}, {"Content": "the sweet escape Staying at Etrusca was the ulimate pleasure, its central location was prefect for shopping, accessing great restraunts, and sight seeing. Francesco and his friend Carlo took great care of us, the rooms were always neat and clean, and this cosy hotel, was a great escape from the busy streets of Firenze, especially in the hot summer heat, thank you franceso for your hospitality,", "Date": "May 8, 2008", "ReviewID": "UR585688978", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "prettyducky"}, {"Content": "good great location, super price.... very quiet at night even tough we were in a busy street, only stayed there for a night, but if we were again in Italy would goback..", "Date": "Mar 16, 2008", "ReviewID": "UR453799038", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "alexandrebombo"}, {"Content": "Superb budget hotel, perfect location       Hotel Etrusca entrance", "Date": "Nov 24, 2007", "ReviewID": "UR469377098", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "rayfontofall"}, {"Content": "Good rates, excellent service, clean place We had planned to stay in Florence for only 1 night, but decided to stay an additional night, partially because Florence was so nice and because of how helpful Francesco and Dana were at the Hotel Etrusca.We came in from Rome, without having booked a room and met Francesco at the train station. He offered us a double room (with private bathroom) at a very reasonable price (for budget travellers).The hotel was simple and very clean and the staff were extremely helpful and honest.- 5mins walk from the train station-walking distance (approx. 15-25mins) from most tourist attractions (like Ponte Vecchio, Duomo, Uffizzi Museum etc.)- very close to the grand market, where there are many restaurant patios (trattoria) that have reasonably priced meals -Very clean rooms and even the shared bathrooms are clean-We were able to leave our bags here all day (at no cost) even after we checked out-Francesco was amazing, he helped us find a place to stay in Venice and spent a lot of time helping us find a clean place that was reasonably priced-He gave us a free map of Florence (vs 1 Euro at the train station)and gave recommendations for good and cheap restaurants-He was so honest, helpful and so accomodating we were so glad that we met FrancescoThis is more like a budget hotel with hostel prices. If you don't mind simple, small rooms that are clean, you should stay here.", "Date": "Sep 9, 2007", "ReviewID": "UR142129197", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "RHTravel"}, {"Content": "We were very happy to stay at hotel Etrusca! This hotel was good value for my money, very convenient location.For a one star it was clean and the staff were super nice, especially the young man(Francisco) who did the night to morning shift.", "Date": "May 10, 2007", "ReviewID": "UR372686978", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "merrylinch"}, {"Content": "Wonderful Place To Stay In Florence We have stayed at Hotel Etrusca for 4 nights.It was the best hotel we have stayed in our 9 days trip to Italy. First of all it was cheap :) But also it was very clean and the staff was very helpful.- Very close to train station ( 5 min. walking) and if you think how difficult to walk with all luggage you have you can understand the importance of being close to the station. And also you can see all Florence in one day, then you want to go near cities and staying close to the staion helps you very much.- Close to the grand market, a cheap supermarket ( where I bought my breakfast stuff) -Very clean and even in shared bathroom rooms there are washbasin so you don't need to go to bathroom for toothbrushing:)-TV's in every room. - Close to the all monuments of Florence ( 10 min. walking to the Duomo and 15 min. to the Palazzo Vecchio and Ponte Vecchio )- They don't only give maps but also they give you all clear directions and the best places to go and how to go to nearby cities.-Francesco :) Hotel has Francesco there.. The most helpful Italian I have seen in my trip to Italy. Wihout his help I couldn't manage my trip to Siena, Portofino, Milano, Venice, Lake Como, Pisa vs... If you want to see everywhere near Middle Part of Italy in a cheapest way you must chat with Francesco. If you plan a cheap trip to Italy, you can stay in a hostel in Rome and then stay at Etrusca in Florence as a base. And of course find Francesco there :) If you find Francesco then no problem in Italy, believe me..Omur and Pinar..From Istanbul, TURKEY..+90 212 297 17 92", "Date": "Oct 13, 2006", "ReviewID": "UR638317089", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "omur"}, {"Content": "decent stay I stayed here recently with two friends while we were traveling through Italy. At first the hotel seems rather sketchy, since it is pretty tucked away and you have to go through a lobby and up an elevator to get there. The neighborhood is fine though and me and my two friends (all girls) walked around a lot at night. It was an alright stay. We had to share a bathroom and it ran out of toilet paper several times. The rooms were neat, but I wouldn't exactly say they were very clean. As far as hostels go it was fine, but it is definitely for budget travellers and students.", "Date": "Apr 26, 2006", "ReviewID": "UR842328312", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Basic and functional We stayed at the Hotel Etrusca in Florence for 3 nights in April 2006. It was tucked away in an unobtrusive apartment building on Via Nazionale, less than 10 minutes walk from the Florence train station, about a 10 minute walk to the Duomo, and just a few blocks away from the flea markets. It seemed a bit sketchy at first, as you had to enter the apartment building and take a dodgy lift to the small hotel on the 3rd floor. However, the staff were very friendly and helpful, and the lobby was welcoming. Our room was extremely small, with barely enough space to walk around the bed, let alone store our luggage. Although it was a bit rundown, it was clean, with tiled floors, and included a sink with mirror. There was also a small TV which was oddly placed high up near the ceiling. The towels were more like bedsheets but they did the job. Unfortunately, there was nowhere to hang the towels to dry, so we had to improvise using the furniture in the room. There were 2 shared bathrooms with showers, both of which were a decent size and kept spotless. Any scuff marks on the floor would be scrubbed away seemingly instantaneously. No soap, shampoo, or hair-dryers were provided. This hotel is nothing fancy, but provides the budget conscious traveller with a simple room, clean bathrooms, and excellent location.", "Date": "Apr 19, 2006", "ReviewID": "UR977825579", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "immaculate_itinerant"}, {"Content": "Che schifo...   showReview(23233273, 'full');", "Date": "Jan 3, 2009", "ReviewID": "UR290040706", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "maluna85"}, {"Content": "H么tel agr茅able   showReview(20029399, 'full');", "Date": "Sep 13, 2008", "ReviewID": "UR164265812", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Fifiwoodi"}, {"Content": "La reserva no sirvi贸 para nada   showReview(14227782, 'full');", "Date": "Mar 12, 2008", "ReviewID": "UR405860977", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "-1", "Location": "3"}, "Author": "Chulerica"}, {"Content": "Estancia muy agradable   showReview(13425545, 'full');", "Date": "Feb 10, 2008", "ReviewID": "UR979193580", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "Cochiguis"}, {"Content": "Buen Hostal y muy agradable   showReview(8708617, 'full');", "Date": "Sep 13, 2007", "ReviewID": "UR334697721", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "diegosainz80"}, {"Content": "hotel semplice a due passi dal Duomo   showReview(5614769, 'full');", "Date": "Aug 15, 2006", "ReviewID": "UR125284234", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "yato"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d607829-r20477168-Hotel_Etrusca-Florence_Tuscany.html", "HotelID": "607829", "Price": "Unkonwn"}}