{"Reviews": [{"Content": "Clean room, friendly staff I stayed here for 10 nights in October 2007. The hotel is one block away from the Akasaka subway stop, near loads of restaurants, clubs, and cafes (and Pachinko parlors). The staff was exceedingly friendly. The room was small, but clean. There was a fridge and a coffee maker in the room, in addition to a TV (it only received Japanese stations) and a computer with free internet access. The room rate included breakfast at the adjoining Excelsior Cafe. Everyone at the front desk spoke English. The neighborhood was quiet at night. I would definitely stay here again. For a central Tokyo location, it's a great value.", "Date": "Oct 30, 2007", "ReviewID": "UR640927154", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "MPLSKevin"}, {"Content": "Central, clean, modern but small rooms       Outside", "Date": "Jul 8, 2007", "ReviewID": "UR449371527", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Caroline_and_Timmy"}, {"Content": "Great Stay at Sunroute Second stay in Akasaka, first stay at Sunroute. Great little modern very close to a great station in Akasaka. The station has around 5 lines going to it if I remember correctly. The hotel is modern with crisp clean lines. Inside is mostly black, grey, and white. The staff is typical japanese friendly. The room was two doubles, wide screen tv/computer monitor. I think the coolest concept is the fact you can use the computer as your own. They reformat the hard drive or wipe clean whatever you do including software you chose to install. The bathroom is typical japanese with modern TOTO toilet. A nice little business touch was an in room pant press. The beds were nice and had plenty of pillows. We had a breakfast included with our stay wich gave us our picking from a menu in the cafe downstairs. Again the typical breakfast salad shows itself as a side, but you get used to it and its good. The hotel is very central and you can get to all the major sights within minutes. If you use the shortcut the subway is maybe 1 min. walk away. If you gothe long way its maybe 4 mins at best. Plenty of small soup shops, resturants, and 7-11 type shops around. I recommend to all my friends traveling to Tokyo.", "Date": "Jul 3, 2007", "ReviewID": "UR431278783", "Ratings": {"Service": "-1", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Garage"}, {"Content": "Perfect location Hotel was great, the staff exceptionally friendly with most speaking English, location tip-top for Shinjuku, Roppongi, Tokyo etc and my room was just perfect銆€锛峫arge western style room with computer and internet and wide bed, bathroom big for Tokyo standards too. Would definately stay here again. In fact I went travelling for a week before I stayed here and asked if I could leave a few bags as I didn't want to lug everything around with me, they were only too pleased to oblige..... 5 out of 5!!", "Date": "Apr 29, 2007", "ReviewID": "UR258065091", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Traveladdict1"}, {"Content": "鏉变含鍑哄嫉鏅傘伄甯稿   showReview(21417046, 'full');", "Date": "Oct 31, 2008", "ReviewID": "UR226200020", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "銇忋倣銇倗銈?> 銇忋倣銇倗銈?</a> </div>"}, {"Content": "tres bon hotel   showReview(11417414, 'full');", "Date": "Apr 30, 2007", "ReviewID": "UR421701694", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066451-d608077-r10454713-Sunroute_Akasaka_Hotel-Minato_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "608077", "Price": "$161"}}