{"Reviews": [{"Content": "Cheap and cheerful The hotel was cheap, clean and within ten minutes walking of the Christmas Market we had come to visit. The hotel did not have any frills, we did not expect them at the reasonable rates they were charging. But you could not purchase a drink (like coffee) on site. We would recommend you take your own kettle with you for a morning drink. The room was tiny, with two single beds set at diverse angles within the room. There was a very nice bar next door, which we headed to every evening. The worst aspect of the hotel was the noise from the adjoining bars. Two nights this continued until 2am. One night it finished at midnight. This would be great if you are the partying type and could join in the fun. We were tired after walking all day long around the city and just wanted to sleep!", "Date": "Dec 10, 2008", "ReviewID": "UR591922086", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "Beaglemiller"}, {"Content": "Shame about the noise I reluctantly have to agree with one point made by other; the street noise is dreadful. However, this is not from the hotel bar as others imply, it is simply from the street - it seems to be in the middle of the main place for the young crowd, who were milling around, shouting, chattering etc until 4am. But the room was faultless, as was the attitude of the man on reception during the day. Breakfast was adequate if generally unexciting (bar the marble painted eggs!) - but this seems to be standard in German Hotels.", "Date": "Jul 23, 2008", "ReviewID": "UR831764664", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "2"}, "Author": "Anglorus"}, {"Content": "As I expected This hotel was just as I expected. For the price and availability compared to other hotels in the area, It was worth it. I read the negative reviews before I booked my hotel stay. My intentions were to expect the worst which made my stay there that much better than everyone elses. If everyone thought they were staying at the Hyatt, no wonder they thought so negatively about the place. I am in my late twenties and wanted a place where I could walk to local bars, restaurants, etc. without struggling to find my way home at night. This was the perfect place for me. As far as the accomodations, the beds were small (but so was everywhere else in Europe) and the showers were unusual. Otherwise it was worth the money for a prime time location in the heart of the night life area.", "Date": "Jun 30, 2008", "ReviewID": "UR176995161", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "Dshaw"}, {"Content": "ok, but decieving info about accomadations the main problems i had was in the info i recieved on internet was completely different from what really was. there is no phone in rooms, there is no resturant, except a pretty crappy breakfast. there is no bar, but plenty of bars around the hotel. i did like the area, but you have to be a person who can sleep through nighttime partying. it was fun to watch germany play a socceer game in our room, and feel like we were a part of the gaity downstairs. i thought the desk clerks were nice, but i didn't have many questions for them. my advice is--don't stay there if you don't like loudness, not having a phone, and expectations of any kind. if it's just a place to crash, it's ok.", "Date": "Jun 20, 2008", "ReviewID": "UR972016751", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "reborntac"}, {"Content": "Dirty,and Not the Good Way,Welcome to the [-] Hotel THE RITTER HOTEL WEBSITE IS Misleading, But Fair play 2 the photographer, he made it look less of a dirty hole. THE STAFF dont speak english,and make you feel like you are intruding.the stairs and hallway are steep and cramped. We had a family room, which had sirty towels on the first night on tha bathroom floor, and on the second night they were replaced by cleaner ones, put back on the floor to soak up whatoozed from the toilet bowl.The tv didnt work.Theres no phone. It is dark and dirty.the room next door had a lady who liked to turn up the tv full and cry loudly.maybe she had a similar room.out side our room was a steep drop on the left,supposed to be a fire escape.not easy with a 17mth old childthanks for ruining our trip ritter.", "Date": "Apr 24, 2008", "ReviewID": "UR372542438", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "stephenmaher"}, {"Content": "Loud and bad I should have suspected that something had to be wrong with this place when I was searching for a hotel on a Messe weekend and every other place was about 200 eur or more and this place was just 59 per night. As other reviews have noted, it is very loud all night long and definitely not the cleanest although the bed linens looked ok. The Russian mgmt was not overly helpful or friendly but also not too bad. When trying to leave early in the AM (6:30 or so), I was locked in and had to wait for the receptionist/chef to come up from the basement and let me out. Possible fire hazard. Carpets dirty, piece of gum stuck to wall, bathroom in a slight state of disrepair (shower door not on properly, toilet paper dispenser broke when I used it, mold, etc.). No phone in room (TV though). I am a cheapskate and love a bargain but would shell out more money and stay elsewhere next time.", "Date": "Feb 9, 2008", "ReviewID": "UR523434573", "Ratings": {"Service": "-1", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "1"}, "Author": "MP1130"}, {"Content": "don't waste your time I was misled by the complimentary picture on the internet--however this is the 1st time I ever stayed in a hotel where I felt fearful of the environment. Maybe I'm too old for this stuff, but the very narrow stairs and hallway have to be original to the building, and the noise pounding up from the rathskellar until 4 a.m. was all I could stand. I left early the next morning and walked a few blocks to the Maingau (where I've stayed before) and enjoyed the peace, the park across the street, and I felt SAFE.", "Date": "Jan 19, 2008", "ReviewID": "UR322035474", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "centexkathy"}, {"Content": "By all means, don't stay there! We didn't even last a couple of hours. The front desk area was smoke-filled at 7 AM. The steep stairs made carrying our suitcases very dangerous. My room had exposed wires and considered the place a fire-hazard. The unfriendly management of the Ritter Hotel spoke no English. We were lucky to find another hotel down the street. The photo of the quaint hotel was truly deceiving. I should have checked TripAdvisor reviews first.", "Date": "Apr 14, 2007", "ReviewID": "UR899915907", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "-1"}, "Author": "IrisPleasantHill"}, {"Content": "Just avoid it! I stayed in this hotel over a weekend. Wanted to spend some relaxing time in Frankfurt having a good starting point for sightseeing and quiet place to relax.In choosing this hotel i was mislead by the photos on internet (different websites show always the same photos). They cut out the important details!The hotel is located in sachsenhausen on a corner on the cross of two pedestrian only streets. What you dont see from the pictures is that all around you have dozens of bars, discos and pubs. Just right of the entrance there is a cheapo disco playing music from 7pm onwards. On weekends the surroundings gets crowded and *very* noisy from 10pm to 3am. Expect real silence from 6am. If you are a night beast maybe you could be happy there.The hall doesnt exist: you enter the main door and you immediately face a tiny desk and steep stairs; room was small, dark and noisy but bathroom was relatively clean. No curtains at the windows.Breakfast buffet was horrendous and all in all it is also not easy to reach by trasportation means but it is relatively central to everything you want to see in frankfurt. Moreover the (russian) management was not very friendly at all. As said, it could be recommended only to young drinking backpackers but maybe if they are on a budget it could even be too much for them (one single 49 euros!) but in general avoid.", "Date": "Oct 16, 2006", "ReviewID": "UR630741614", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "pw9090"}, {"Content": "La zona dell'hotel 猫 molto...   showReview(19997925, 'full');", "Date": "Aug 26, 2008", "ReviewID": "UR668052446", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d608142-r22603647-Ritter_Hotel-Frankfurt_Hesse.html", "HotelID": "608142", "Price": "$151"}}