{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london england", "Title": "“last minute stay”", "Author": "javed h", "ReviewID": "UR121673650", "Content": "After much deliberation deciding where to stay , we resorted to looking for a hotel upon arrival in Amsterdam , With the rain pouring down on us , we soldiered on to the out skirts of the city , assuming a budget hotel or a better price would fit the bill.unfortunately not having much luck,we headed back to central station and stumbled upon HOTEL JIMMY , We paid a fair price considering the evening was pressing on .the staff were friendly and very approachable, and were offered a hot cuppa on arrival as we were soaked . the room was clean (room 21) and smoking allowed , with a good breakfast , excellent location was more than satisfactory for a short stay .My only criticism would be that its a budget hotel , and was slightly over priced, but the location and staff compensated for it, considering we left it to last minute.. literally .", "Date": "December 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“We would like to be back”", "Author": "verouge", "ReviewID": "UR114807526", "Content": "Although it's under our expectation, but financial wise, it was perfect and has a perfect location. For two nights only, it was okay! Stuff were friendly. Does anybody knows its email or phone number or website? We're coming again this August and we would like to book it online.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Glasgow", "Title": "“Really bad, really really bad”", "Author": "TheWestHighlandWay", "ReviewID": "UR101508476", "Content": "Please read the other reviews and take note, EVERYTHING mentioned in the previous comments are correct. We booked on the internet, and on arriving were jarred for 'extra' money as the money already paid online wasn't enough. We told him to hang fire and we'd come back down to reception after dropping off bags. Before we had the chance a man appeared at the door, nodding in direction of my friend counting his money and said, 'that's the extra?' He was told to beat it, and he did. He never asked again. THE ONLY WAY THIS IS GRANTED HOTEL STATUS IS BY SERVING A HOT BREAKFAST, BE AWARE, BREAKFAST IS ONE BOILED EGG AND ONE BIT OF TOAST, TEA & ORANGE JUICE. DON'T EAT ANY OF IT. I can't explain to you how bad this place is without taking you to a distant third world country for comparison.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“STAYED IN BETTER PRISON CELLS”", "Author": "gottzi", "ReviewID": "UR95504544", "Content": "not even joking the place is a POO hole it had painted white bricks for walls a manky sink a prison style bed and that was it and shared toilet wich u wouldnt let a animal use and got mugged of coz we payed 80 euros MUGS", "Date": "February 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“cheap n cheerful..you get what you pay for”", "Author": "gerry030", "ReviewID": "UR72750645", "Content": "stayed 3 nights, rooms were basic but clean..friendly staff, only complaint was no fans or air con and the rooms were really hot, but for a short stay i'd defo go back", "Date": "July 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "QC Philippines", "Title": "“don't even bother to look”", "Author": "GenevieveAquino", "ReviewID": "UR63064581", "Content": "Technically, I didn't stay in this dump. I was on a layover in AMS and decided to go to the city center. Since my flight to Brussels is in early morning, I decided to just spend the night at the hostel. Hotel Jimmy was along the street so I decided to look. The staff just asked me to register, asked for EUR50 for the night, refused to give a discount for scrapping the breakfast option and asked me to wait for a bit to get a room. I was shocked when he went inside a prison cell-like or closet-like hole and just pulled out the old bedsheet and just replaced it with another one. The space is like a closet with just a prison bed and sink! I could not help myself but complain that there's no space. He just said, \"But you're just going to sleep!\" I DEMANDED a full refund. Good thing he returned my money because I just can't stand the filth. This is a terrible option for any traveller. Only settle for this if there is absolutely no other choice.Exhausted and exasperated, I just spent the night in one of the recliner chairs in Schipol Airport. Definitely 100% more safe and clean compared to this dump!", "Date": "May 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Hartlepool, United Kingdom", "Title": "“From the nightmare of Ash Thursday, A descent into the hell of Hotel Jimmy”", "Author": "BluePete", "ReviewID": "UR62182355", "Content": "I was returning from Venice back to the UK , via Schipol Airport Amsterdam 15 / 04 2010 , when the nightmare of Ash Thursday hit with full force. As every flight was cancelled , European air space closed down . KLM refusing to provide any support or assistance , I spent the night at the airport which is not good , the next day I went into Amsterdam to find an hotel. No luck , no vacancies anywhere. Except for Hotel Jimmy, It was like something out of the League Of Gentleman. I have never been to prison but no prisoners would be housed in accommdation as that offered at Hotel Jimmy. Every resident was trying to escape Amsterdam or was it Hotel Jimmy ?, I felt pretty fed up , down , frustrated but lying in my cell at night listening to the drunken screams & shouts of fellow Jimmy residents, I thought , what have I done to deserve this . Even the bed isn't really a bed but a wooden box , I am not kidding . The staircase is really something, I have never seen any thing like it, is it designed to punish residents for crimes from another life ? The shower & toilet are in the same corridor as the cells. On a more postive note there was plenty of hot water. The internet is not free as advertised . When I think I was charged 80 euros to stay at this \" Hotel \" . I did return to the UK via Calais , but that is another story. I still shudder at the thought of Hotel Jimmy , probably the worst place I have ever stayed in my life.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "scotland", "Title": "“welcome to jimmys prison”", "Author": "salohcin0910", "ReviewID": "UR24343251", "Content": "this hotel (if you can call it that) was by far the worst place to stay anywhere in the world. After handing over 180 euros we were given room 28 which sat three floors up the worst staircase known to man. Once inside we couldnt believe it a 4x8 jail cell complete with bunks dirty prison like bedding a small sink and tv with no remote. The toilet was shared with the other rooms with the shower room a further floor down. BEWARE DO NOT STAY HERE IF THIS IS THE ONLY PLACE AVAILABLE THEN GO BACK HOME OR SLEEP OUTSIDE JUST DONT STAY HERE!!!!!!!", "Date": "February 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Waterford", "Title": "“I still shudder.....ugh”", "Author": "WaterfordSusieg", "ReviewID": "UR14643129", "Content": "The so called 'hotel' Jimmy may have been the most disgusting and degrading hotel I have ever stayed in. I have travelled around europe the last 2 summers and stayed in grotty hostels for less than 10euro but this one is by far thee worst. They stuck 3 of us(all girls) in a room with one bed and threw down a matresse for the 3rd. We all had to drink ourselves into oblivion to pluck up the courage to return to the place.I stayed clear of the shower for the 3 nights we stayed there, It made my skin crawl. With paying 35 euro on the spot(so foolishily) we were made wait for 2 hrs til the bed and floor was 'cleaned'. The room was like something from a prison.Unforuntaly we didnt book something before hand and didnt check the room before paying but make sure you dont do what we did. It was uncomfortable,run down and should be SHUT DOWN.I know that something of that standard would be shut down by the tourism board in Ireland within weeks........DISGUSTING!", "Date": "March 29, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "East Sussex", "Title": "“What a shithole”", "Author": "sussexdude", "ReviewID": "UR6717056", "Content": "I stay in many of the holes in my life being in the british army, places like Iraqi, Kosovo and other places. I would have been better off staying in iraqi when Hotel Jimmy! I stay there with my father and we were both shock to see our bedroom looked like cell you would have find in HM Prison's, my thoughs still away were the programme porridge! My friend on the other hand his room was somewhat to be said for! Him and this wife open there door to find that there bed was not made and looked like someone had just got out of bed! We walked around for ages intil i decided to get drunk so i could go back to the hotel and get into the bed from hell! No matter how much i drunk i was unable to get drunk not good as know i was heading to the bates motel! On returning back to the the room the nosie from outside was driving me mad, if the nosie of the bike bells or dust cart or the trains dont keep you away the nosie of something else would or the smell or some enlaw drugs or cig smoke! i laid there with the soap box on my nose to combat the smell. that night i would say i cryed to sleep but i laughed myself to sleep! The next morning well i decided to jump to the shower i need another just from that shower i though things were bad in barsa this was far worst! (i think the british army should use it for training for war zones when everyone would be redy for war) I turned on the shower only to find out no hot water aaaaaaahhhhhhhhhhh That was the final straw i decide with my father and friend we have breakfast and leave not to return, well in the breakfast room about 8 guys from the middle east were shavening that was it time to leave the hotel. If someone set fire to the place at least there would hot water and would make the place far better. I can only say one thing don't bother at all with place cross the road if you walking down the street it worst place in the world and should therefore be shut down for everyone safely.", "Date": "January 30, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Australia", "Title": "“Avoid it like the plague”", "Author": "Nova77", "ReviewID": "UR6560491", "Content": "The WORST of the worst...do NOT stay at this so-called hotel!!! After 2 weeks of a brief backpacking trip around London, Brussels, Luxembourg and Paris, staying in reasonable backpacker and hotel accomodation, my boyfriend and I decided to round off our trip in Amsterdam, with the hope of a relaxing and enjoyable week before heading back to Australia. Having made the mistake of not booking accomodation in advance (in July - the summer season), we trekked around the 'Dam for a couple of hours trying to find any available and affordable accomodation. Finally, in despiration, we tried a 'hotel booking service' who, to our relief, agreed to arrange accomodation for us. If only we had known what we were in for!! We ended up at the Hotel Jimmy (shudder!) where, for the sum of 80 euros a night (which we had to pay upfront) we had an army barracks style room on the fourth floor (no lift!), which contained one bed slightly only larger than a single, a small sink, and a TV that could not be turned on without the remote (which was not provided). We also had shared bathroom/shower facilities, which were unpleasant to say the least. On top of this, it turned out that the cleaner only came every second day, and guests had to request in advance for their room to be cleaned, bins emptied, and sheets/towels to be changed. As a result, in our 6 night stay we managed to get a change of sheets once. These features of the hotel, combined with the lack of air conditioning (in the sweltering summer heatwave of '06), non-stop noise from the street, inability to block out much light from outside, and the surly service from the owners, made our stay unforgettable for all the wrong reasons! The only good thing was the proximity of the place to the train station, so as to provide for a quick escape!! What a SCAM!! Do not be sucked in like we were. Book ahead is all I can recommend. And read the reviews first!! You have been warned.", "Date": "January 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Little Rock", "Title": "“Hotel Hell - But, came to my senses”", "Author": "bepineurope", "ReviewID": "UR6020651", "Content": "WHAT A DUMP!!!!!! Arriving pretty tired after my flight in to Ramstein and then the 5 hour train ride to Amsterdam, I walked in to the Hotel Jimmy because it was so close to Centraal Station. Walked up the stairs to my assigned room only to find the filthiest hotel room I've ever seen (including a $1.00 per night room I stayed at in Istanbul back in the early 70's!). The room next to mine was overfilled with what appeared to be Al Quaeda rejects. Walked back downstairs, threw the key on the desk, and kept on going without a word. Good thing I had asked to see the room before handing over any money. WHAT A PIECE O' CRAPPOLA!!!! STAY AWAY!!!!! FAR AWAY!!!!", "Date": "October 28, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Nightmare on Martelaarsgracht”", "Author": "beech_bunnie", "ReviewID": "UR5009266", "Content": "FALSE ADVERTISING: Both the sign on the front door and their business card indicates that breakfast was included and that they had free internet. Neither was true. OVERPRICED: The front desk clerk informed us that all the other hotels were booked and had no rooms available for the whole weekend (which I discovered the next day to be a lie). I noticed that he used the same fear strategy the next evening on other tired and weary tourists in order to instill panic in them so that they would be willing to pay any price to have shelter. We were charged 120 Euros for 3 people to stay in one cramped room. Nearby hostels charged only 20-30 Euros per person and their facilities were way better. Also we were told that there was a 3-night minimum stay although we only needed lodging for 2 days and was charged the extra day regardless. DIRTY: The back of the toilet seat was not clean and had urine build up from God knows how long. The sheets and blankets were also soiled. The room was evidently dusty and grimy. Although we had a TV, it was broken. NOISY: The hotel is located on a very busy street, therefore we were awoken at the crack of dawn with the public trolleys constantly riding by, honking their horns. This continues on incessantly until about midnight. INCONVENIENT: The hotel clerk has to open and close the automatic door at his discretion for security purposes, therefore you are not able to go in the building at your convenience. There is a camera that he observes and since you have to climb up the stairs to even get to the front desk, you are not able to see if there is anyone even there to let you in. At one point, we had to wait outside for over 15 minutes to enter the hotel. This was not reassuring. What could the staff be doing that they were too busy to let a guest in? Overall, I do not know what kind of scam this place was running but I was livid enough to write a review in order to warn other travellers from being horribly taken advantaged of like we were.", "Date": "April 25, 2006"}], "HotelInfo": {"Name": "Hotel Jimmy", "HotelURL": "/ShowUserReviews-g188590-d608329-Reviews-Hotel_Jimmy-Amsterdam_Noord_Holland.html", "Price": "$30 - $50*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Martelaasgracht 15</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1012 TN</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "608329", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/00/19/55/29/stay-away-farrrr-away.jpg"}}