{"Reviews": [{"Content": "loved the crown ! There was 6 of us staying at hotel the crown from saturday through till monday.I cannot fault this hotel. Very, very friendly staff .The rooms were spotless , very warm with very comfertable beds. The shower had red hot water and there were clean towels provided.Its situated right in the middle of amsterdam about 10 min walk from central station , it overlooks the canal and is a stones throw from the coffee shops and red light district.I really enjoyed my stay and will definatly be returning.They also serve the nicest hot chocolate i have ever tasted .", "Date": "Dec 2, 2008", "ReviewID": "UR214796171", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "emmapudding"}, {"Content": "fan'sixty'tastic from Durham, UK 9 females of all ages, young and young at heart, came to Amsterdam to celebrate our friends 60th - most of us hadn't been to Amsterdam but we had a ball. The Hotel was very reasonable and although small, it was very clean and tidy and the staff were so friendly - even when trying to get in at 5.30am!! The place is buzzing and the location/style of the Hotel made the trip one to remember - the other guests were very friendly too!! Would totally recommend and hope to return.", "Date": "May 26, 2008", "ReviewID": "UR613695979", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "CoDurhamGetaway"}, {"Content": "great stay!       the view in the evening", "Date": "Mar 9, 2008", "ReviewID": "UR397396913", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "amyamylynn"}, {"Content": "Gets the job done After traveling around a bit, I was back in Amsterdam for one night before flying out the next morning -- so I picked the Crown because it was pretty cheap and near Centraal Station. It doesn't have a whole lot of bells  whistles -- you check in at the bar, my room was probably the smallest I've ever seen, at the very top of 4 flights of steep stairs. But it was totally clean and was surprisingly quiet. The staff was friendly, and I liked the fact that they gave me a card to show every time I returned from being out -- made me feel safe. It's right in the red light district and just over from the bustling Damrak, so if you're looking for bright lights  hubbub, it's a perfect location. I wouldn't stay here for a long trip, but it's perfectly fine for a stopover.", "Date": "Nov 10, 2007", "ReviewID": "UR532597021", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "AG1"}, {"Content": "great place! Great place to stay, centrally located minutes away from Central Station. Hotel was CLEAN, staff friendly and helpful. Thoroughly enjoyed my stay. Hope to return soon", "Date": "Oct 29, 2007", "ReviewID": "UR837985509", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "loopyCentralScotland"}, {"Content": "Great Hotel Great Weekend Stayed here for 2 nights with 12 other guys on a stag do. Fantastic hotel, great location, clean rooms, basic but everything you need for a comfortable stay!Minutes from central station, minutes from bars...restaurants..and the red light areas.The staff were great..very friendly..and always cheerful.We paid 45 euro a night...bargain price for a great place!", "Date": "May 27, 2007", "ReviewID": "UR982502970", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Goonerguy"}, {"Content": "A great weekend away       the bar!", "Date": "Dec 11, 2006", "ReviewID": "UR723531037", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "ummm"}, {"Content": "Toastie-tastic hotel A group of six of us stayed at the Crown for Queens weekend this year (yes, yes I know this review is a little late!). One of our gang had stayed there before and had kept in touch one of the owners, Mark. She really wanted to say goodbye to the Crown gang before jetting back to Oz for good, a testament to how friendly the staff are.First off, great location! Just 5 minutes walk from the central train station, which links regularly with the airport and 5 minutes amble from any of the major sights, including the red light district. The rooms are basic but clean, most have their own shower but loos are communal. I stayed in a twin room, but triple and even quad rooms are available for groups. Downstairs there is a pool table and a bar which by the way sells the bestest toasted sarnies ever! Fab for the morning after the night before! The hotel is smoke friendly, so much so that if you're a non smoker, I wouldn't actually advise you to stay here unless you really fine with it.There are loads of decent restaurants and bars nearby as well as many of the major sights. For 40 Euros a night I don't think you'll do better.", "Date": "Oct 4, 2006", "ReviewID": "UR343196035", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Pinkie35"}, {"Content": "Absolutely Wonderful We originally booked our room there because of it's location and it's price, but we have found that there really is nowhere else to stay while in Amsterdam. The Staff: Always called us by our first name. They gave great recommendations on where to visit, and were extremely friendly.The Location: Right next to the Red Light District, but was extremely safe. Only a 5 minute walk from Centraal Station.The Rooms: Very adequate. We had rooms w/ private showers, and public restroom. The rooms were fine in size, and were very clean. The Price: For 40 Euro a night (for a single) you can find cheaper, but certainly not better. I witnessed a couple stop in and were quoted a price, they viewed a room and said we may be back. 2 hours later, after I'm sure higher prices and worse rooms, they came back. They should have saved that 2 hours!The Bar: Wonderfully stocked bar, great service. Every request was met with Certainly sir. In conclusion, you may find cheaper, you may find more extravagant rooms, but you will not find a better deal w/ a better experience w/ Hotel The Crown! Highly reccomended. Ask for Mark!", "Date": "Jul 31, 2006", "ReviewID": "UR784489782", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "BenWeasel"}, {"Content": "Stumbling Distance from Red Light Fun I found The Crown on my first trip to Amsterdam after I was unable to book another night at my $120 a night hotel. It was great and I have stayed there on my past 3 visits to Amsterdam.The best thing is the bar. You can drink late and it is smoke friendly. The bartenders are cool and they have remembered me from one year to the next. It is centrally located around several coffee shops and the red light district. For the price, you will not find a better location. The rooms are small but have everything you need. They are very clean as well.While I do usually stay at higher end hotels on my trips, I will never stay anywhere else in Amsterdam. I love the Crown!!", "Date": "Jul 18, 2006", "ReviewID": "UR107214953", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "Porter4128"}, {"Content": "Sans pr茅tention mais l'essentiel y est!       Vue canal depuis Crown", "Date": "Oct 15, 2006", "ReviewID": "UR776229980", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "ou32350"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g188590-d608343-r22368885-Hotel_The_Crown-Amsterdam_Noord_Holland.html", "HotelID": "608343", "Price": "$274"}}