{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Katowice, Poland", "Title": "“Average room right in the city center”", "Author": "kspr84", "ReviewID": "UR135932366", "Content": "Hostal Valencia is good choice if you're looking for cheap accomodation in Madrid for a night or two. It's right on Gran Via street, so it is very noisy. If you have problems sleeping in noisy places, make sure you take earplugs or at least try to book the back room. The rooms were ok, nothing extraordinary, but nothing to complain about either.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location but basic”", "Author": "Jarryd P", "ReviewID": "UR134291442", "Content": "Almost 4 star. We only stayed 1 night so enjoyed the location and 12pm check out. Pros -Friendly staff -great location -good room and bathroom size -quaint decor Cons -entrance very ugly -lift faulty -no air conditioning (fans ok)", "Date": "July 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Excellent location & good quality”", "Author": "Agnieszka L", "ReviewID": "UR129754323", "Content": "The location is excellent (the station Callao is across the street) and generally the distance to different places is smaller than you may expect. Staff is friendly and available on and on. Rooms are well-equipped and very clean. You have all you need - comfy beds, cupboards and so on. What's most important, especially when the weather is not good, there are radiators in the rooms which were still working in April. The hostal has available computers with internet access and free wi-fi in rooms. It's a great place when you're looking for a place to stay for a couple of nigts.", "Date": "May 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location and decent room”", "Author": "msjessies", "ReviewID": "UR123741454", "Content": "Located right next to metro station and on Gran Via. Room clean but very basic. Small room with most beds almost pushed together.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“EXCELLENT LOCATION, FRIENDLY & ACCOMMODATING STAFF”", "Author": "abg112070", "ReviewID": "UR108217922", "Content": "The hotel is centrally located (metro callao is just across the street). The room is basic (but we only used the room to sleep and have a shower). We requested a room facing the main street (gran via) but was warned beforehand that it could get noisy at night (we wanted the view more than the noise). They do have rooms towards the back which i assume would be quieter). The staff are all friendly and speak english. I would go back and stay in this hostal again.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Acceptable alternative”", "Author": "Dropko", "ReviewID": "UR85509955", "Content": "The photos on the site make this hostal seem much better than what it is in reality: mediocre. The location is conveniently superb (spot on Gran Via - Callao), as there isn't any reason to stay in the room, really, they're just bed against walls, which actually nails its purpose. What was not so nice was the persistent sickening smell of food during the entire day at the lobby; luckily nothing found its way to the rooms. These were overly simple, but the bathrooms were spacious and clean! The doors weren't too think so steps could be heard from the other side, but rarely was there movement in the night. There was free internet, which is a major bonus. Good if you're looking for a cheap place to just sleep for a few day and want to be over the Gran Via.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Devon England", "Title": "“Perfect for visiting Madrid, central, cheap and clean”", "Author": "LynnBeeston", "ReviewID": "UR48363090", "Content": "This hostal is run by friendly staff, although on the 5th floor there is a lift. We travelled as a group of 5 mature ladies, and both rooms were perfectly acceptable, and extremely clean. Reception staff spoke English and Salvatore was most informative with good recommendations for dinner. As this is right on the main street ( a six lane road) it is advisable to ask for a room at the back, if you are an early bedder. We found everywhere within reasonable walking distance, but I recommend the bus trip for its commentary. Watch out for pickpockets on the Metro although we knew about this problem we were almost robbed on our way from the airport (keep your hand on your valuables especially if there is a distraction)", "Date": "November 2, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sliema, Malta", "Title": "“Nice and clean hostel”", "Author": "rIGO11", "ReviewID": "UR46469704", "Content": "Excellent location and nice rooms. All the staff spoke English, unlike most of the city. Free Wifi for laptops or mobile phones. Great hostel!", "Date": "October 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Beware in Madrid”", "Author": "dublinerIreland", "ReviewID": "UR6576991", "Content": "This was almost the worst accomodation I have experienced in Spain in years of visits. I was completly taken in by the attractive photos on the web and the fact of the 30 rooms, which I believe may be belong to other hoslals in the building. I was so deleighted to get out of the comittment with a €30 loss. Our 3 days in Madrid would have been ruined if we had to stay here, luckily we got a four star hotel up the road on Calle Alcala for €10 less than the Valencia. Again it's buyer beware.", "Date": "January 11, 2007"}], "HotelInfo": {"Name": "Hostal Valencia", "HotelURL": "/ShowUserReviews-g187514-d609397-Reviews-Hostal_Valencia-Madrid.html", "Price": "$56 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via, 44</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "609397", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d0/fe/d0fec6fc1cfb43994f913b7577adddd86large.jpg"}}