{"Reviews": [{"Content": "Don't let the nice rooms fool you. I walked in off the street and was impressed by the huge, gorgeous room. I paid $35 for one night and went immediately to the pool. It had the dirtiest water I had ever seen...strike 1. The water shut off at 11:00 pm and did not come back on until morning...strike 2. Breakfast was not good...strike 3. Check out.", "Date": "Dec 5, 2008", "ReviewID": "UR350325382", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "galpine70"}, {"Content": "stole cash from us This hotel has a great location by the Monkey Forest and a bit off the crowded track on Monkey Forest Road. There were no other guests when we arrived, it was just my family and the staff. The first morning we had breakfast up by the pool and didn't lock our doors. Dumb. We weren't away for more than 30 min and found that cash was gone from my 11 year olds backpack. Without getting into all the details, I believe it was one of the staff. We informed the manager and did not accuse anyone. Anyway, they were concerned but without resolution, we found another place to stay immediately. We didn't feel our things were safe. Too bad, with some work, it's a lovely setting and spacious.", "Date": "Dec 28, 2006", "ReviewID": "UR835463087", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "-1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "3"}, "Author": "lunarwally"}, {"Content": "Beautiful room, great view, best balcony, excellent value We stayed in Pande Permai's Lotus Room last week. It was superb! We paid only $38 dollars per night, which included a breakfast (which was lackluster, but acceptable). The room was amazing, and the view was unbeatable. There is a large balcony with a perfect breeze from which you can watch rice farmers walking up the lush, green hill to begin work each morning. Finally, on our last day, we walked up that same terraced hill and entered the charming world of behind-the-scenes Ubud. The hotel smelled fresh and new. The room was impeccably clean. The cleaning staff was friendly and paid great attention to details. (Our towels were folded into swans, lotus flowers, etc. Fresh flowers all the time...) The grounds are gorgeous!! I could have stayed there forever. Twice we watched monkeys from our room. The location is ideal, close to the Monkey Forest, but sheltered from the traffic. Also, I'd rather be on the southern end, near the Monkey Forest, than up near the city center--and the market, where the tourist buses shuttle hundreds of people in from Kuta and Sanur all afternoon. That place can be a madhouse! One important note-- We peeked into another room, one of their budget rooms. It looked clean and acceptable, but very uninspiring. I say fork over the extra $15 and get the Lotus Room. You will be so glad that you did. AMAZING PLACE!!!Oh, one other thing...the previous review mentioned paying for local calls. Yeah, of course. Every place I've stayed in ANY country makes you pay for calls. We made a call and we were charged 1500 rupiah. That's right, 15 cents. No big deal. A lot less than what we were charged in our Sanur beach resort!", "Date": "Jul 12, 2006", "ReviewID": "UR877686742", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "not what I expected I don't recommend. The beautiful scenery is the only advantage but because it is very close to the Monkey sanctuary 鈥?one can't sit on the balcony  enjoy it as the monkeys visit  grab everything. . The head of the staff boss is very mean 鈥?charged extra money for every phone call in the area, wouldn't lend me a big umbrella like in other hotels, there weren't any shuttles even when it was pouring rain  dark  there was a car in the hotel yard. Small but essential things were missing in the bathroom like a rug  shampoo. No ordinary milk for breakfast coffee  the staff wasn't helpful at all. The room was not ready  the sheet on the first day was dirty. I paid 50$ to stay in a delux room! The room  bathroom are big.Another warning for elderly people or not in a good physical state 鈥?very slippary  dangerous when raining  at night. Many steps. Very dark.", "Date": "Apr 28, 2006", "ReviewID": "UR486067493", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "michal5"}, {"Content": "銉涖儍銇ㄣ仹銇嶃倠绌洪枔   showReview(21744969, 'full');", "Date": "Oct 16, 2008", "ReviewID": "UR893772288", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉兂銈兗銉曘偐銉偣銉堣繎銇?#x201d;   showReview(19172106, 'full');", "Date": "Jun 25, 2008", "ReviewID": "UR840437025", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d609333-r22469797-Pande_Permai_Bungalows-Ubud_Bali.html", "HotelID": "609333", "Price": "$30"}}