{"Reviews": [{"Content": "Drive away       The front patio", "Date": "Sep 2, 2008", "ReviewID": "UR899173360", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "1"}, "Author": "marco_mazzei"}, {"Content": "Sad place       beach", "Date": "Sep 1, 2008", "ReviewID": "UR728078148", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "simoma"}, {"Content": "loved this place We stayed here for one night. The ocean view room is very beautiful. It's direct access to the beach. The longue is comfortable. The room is so lovely. The tropical garden is full of fun. It's amazing place. However, we had to mention one thing. During the night, at about 4 oclock, I was scared up from sweet dream by my husband's shouting. He told me that he heard somebody was pushing the door attempting to open it. Oh, my god, I couldn't believe such thing would happen in such peaceful place. I guessed it was noisy from other rooms. But my husband insisted that he heard it very clearly. Oh, I really hoped it was a mistake.", "Date": "May 15, 2007", "ReviewID": "UR534333599", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "filliot"}, {"Content": "Loved this hotel We stayed for a couple of days at Nugraha - basically wanted to get away from the Kuta crowds and see more of Bali. Our stay at the Nugraha was excellent. The hotel is located right on the beach and every room has a sea view. We practically had the large pool and the beach facing gardens all to ourselves. The staff were amazingly warm and welcoming and the service was excellent. All in all we really enjoyed our stay at the Nugraha and would really like to go back again someday", "Date": "Aug 16, 2006", "ReviewID": "UR792070773", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "ishet"}, {"Content": "The room are so clean. the view are amaing, the people are excelent I came to Bali many times, and started to get bored with the crowds at Sout of Bali. My friend told me to get away to Lovina and I agreed with that idea. The journey to Lovina was excelent. we passed thru beach, mountain, lake and funny fatty monkey. It was 2 hours drive from Kuta but fun drive. When we got to Nugraha Lovina late afternoon we were suprised with the hotel. It is so amazing oceanview and clean room for cvery reasonable rates. We spent few days there doing tour around and diving to Menjangan", "Date": "May 16, 2006", "ReviewID": "UR826076503", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294226-d610881-r19621061-Nugraha_Lovina_Bay_Resort_Hotel-Bali.html", "HotelID": "610881", "Price": "Unkonwn"}}