{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Great Hotel in 2007 -- Location Now Closed -- HSH and www.hotel.de Very Unhelpful; Stay Away From Them”", "Author": "ccooperman", "ReviewID": "UR40369924", "Content": "Friends and I stayed in this hotel back in 2007 for the Berlin Marathon. I had come to Berlin first to research properties for 10 of us and found HSH Wilmersdorf to be perfect. In March of this year, using www.hotel.de, I booked HSH Wilmersdorf for our return to the Berlin Marathon in September 2009. In July, I was notified by HSH that the Wilmersdorf location had closed on June 30th and that they had no room at their HSH Mitte location -- I found it odd that they notified me after they had closed because surely they knew they were closing sometime in advance. They offered another nearby hotel, which was a 1-star, not a 3-star like HSH and was 1-room, not a 2-bedroom and living room as we (5 of us) had booked, for the same €200 a night rate -- I found the other hotel online for €90, so of course they wanted my €200 for a €90 room. HSH refused to honor their commitment and did nothing else for us. I contacted www.hotel.de, with whom I had booked the reservation, and they also did not stand by their commitment -- I think that another company such as Travelocity would have been more helpful. Unfortunately, Berlin Marathon weeked is a very full weekend in Berlin and by waiting until after they had closed the property, there were no comparably-sized apartment-hotel rooms in this price range left in Berlin. We were stranded and I would never use either of these companies again do to their lack of honor and commitment.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sheffield", "Title": "“Perfect for families”", "Author": "REF9", "ReviewID": "UR32430258", "Content": "We booked this as we were going away for the first time with our new baby and had my mum with us. We wanted somewhere that had separate bedrooms. This fit the bill perfectly. The apartment was roomy and the bedrooms were a good size. They provided a travel cot for the baby which was clean. The bedrooms and bathroom were very clean. The kettle didn't work but staff were quick to sort the problem out. The location was fab as it was very close to the u-bahn and took just a few minutes to reach the centre. But being in a residential area was quiet at night. The only grumbles I did have was the floor in the main part of the apartment was very dirty and we never saw the free muffins adertised for breakfast.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Very good choice for business travellers sick of hotels”", "Author": "reiseschreibmaschine", "ReviewID": "UR21295298", "Content": "I spent 4 night there in June being on a business trip to Berlin. I'm originally from Berlin and I always found it a kind of strange to use a hotel there so I was very happy to book myself to this place. My appartment was non-smooking with windows to the rear of this building so I could sleep with the windows open (there is no air-co at all). The street in front is very busy as well during night times. My appartment had a large bedroom, enough space for all my wardrobe and luggage, a corridor, a very good bathroom with bathtube and shower and a large living room offers a nice dining table as well with an open kitchen. The kitchen was very well equipped, I could have cooked on my own even. A very nice biological supermarket is just in the same building (they offer delicious ready made soups and salads), another cheaper discount market in the small shopping mall right across. I managed to leave my car in the parking of another hotel nearby (connected to the shopping mall, so it takes you 2 min walk) as the HSH doesn't offer own parkings. Public transportation is very good, you have 2 different Underground lines within 5 min walk each. Busses are also available, taxis of course as well. The Bundesallee is not a very nice street but some areas around are very pleasant, you'll find nice restaurants there and shops as well. I enjoyed the free W-Lan which worked perfectly, if you like TV, you'll find around 400 (!!) satellite channels there to choose from. The best here is that you don't feel like a stranger in just another business hotel. This HSH is really offering a kind of a home abroad. The rooms are painted with warm colors, you'll not hear your neighbors (I stayed there during the Football games this year...) and you have your privacy. Good for me as I'm sometimes really sick of living in hotels. If you need a lobby to welcome your guests, a 24hrs reception desk and room service, than this is not the right place to stay.", "Date": "October 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Lack air conditioning”", "Author": "ArbutusCa", "ReviewID": "UR16653030", "Content": "This hotel apartment claims as a 3-star property but has no air-conditioning. With temperature above 90 degree in Berlin, especially during the summer, no one can bear living in a room without airconditioning. The pollen level is high and to open a window is not an option if you are allergy to it, on top of the potential noise from outside if you are a light sleeper. Watch out and be aware of it !! Other than that, the property is fine with friendly staff. If it is not summer and the weather is not hot, I might consider to return to stay in this hotel.", "Date": "June 3, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Perth, Australia", "Title": "“Would stay here again”", "Author": "BukkenBruse", "ReviewID": "UR8840916", "Content": "We have three children and it is therefore often difficult to find nice accommodation that fits all five of us. The apartment we stayed in at the Hotel Apartments Wilmersdorf was spacious, nicely decorated and clean. We were also pleased to discover that free (and problemfree) Wifi was available. There were a couple of foodshops a few minutes walk away for those of you who would like to cook yourself. Hotel Apartments Wilmersdorf is a one minute walk from the nearest underground station, which will take you to the Kurfurstendam or the Berlin Zoo in a few minutes. On the downside, the kitchen could have been a little better equipped and the breakfast a little less sweet (doughnuts only). However, I would not hesitate to stay here again.", "Date": "September 21, 2007"}], "HotelInfo": {"Name": "HSH Hotel Apartments Wilmersdorf", "HotelURL": "/ShowUserReviews-g187323-d611248-Reviews-HSH_Hotel_Apartments_Wilmersdorf-Berlin.html", "Price": "$158 - $249*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Bundesallee 201 - 203</span>, <span class=\"locality\"><span property=\"v:postal-code\">10717</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "611248", "ImgURL": ""}}