{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lansdowne, Virginia", "Title": "“Affordable, far, great view, def. 1 or 2 USA star hotel”", "Author": "moniquem03", "ReviewID": "UR128145523", "Content": "I really would rate this hotel a little higher but the fact that the toilet ran most of the time, the resteraunt was closed the entire time which was one of the main reasons we selected the hotel in the first place, and the two twin beds pushed together that had a very flat mattress and kept separating all night. The staff did not speak English but they tried their very best which was nice but very frustrating. They were very friendly and sweet nonetheless. Please remember to bring outlet converters/adapters. And the reviews that were posted were very helpful. The views are stunning, the rooms clean, but really you get a bed and a washroom, nothing else. There is not even a phone in the room and if you are use to using washcloths, bring your own because they do not have any. There is a small 13in TV but there is only Italian channels. They will tell you that there is English ones but there is not. There is MTV and that only has English sometimes. Breakfast was toast (the size of crackers) tea and coffee. No water-oh and if you do not want club or seltzer water remember to say flat/still water. The best feature is that the bus is literally right outside the hotel and runs until 11 on most nights. There is nothing, I mean nothing to do locally so be prepared to use the bus often. Even the resteraunts that were close had sketchy hours and was hardly open. Load up on drinks and snacks at the grocery stores that the bus can take you to. Its the 32. We did finally catch the Le Isle resteraunt but they spoke no English and the menu was in Italian. Needless to say we ordered French Fries. lol. Oh and one day they do not serve meat so be sure to check. The church bells next door was very nice. If you are going to Rome for the food please be ready to be disappointed. The pizza is not like American pizza and the food is not that great. The wine was great though! we met great friends from NC at the hotel so this was a blessing. Take a day trip to Pompeii on your own. It is cheaper and you are not committed to stay with a tour. We were going to pay $300 for 2 for tour but we did it on our own by just taking the 32 bus into the terminal and then the train into Naples and then Pompeii. It was about $100 for the both of us. The same with the Collesum. It was $24 for 2. We paid about $120 for two online. Oh and ATM wills not let you get money from your savings just so you know. We found out the hard way. ; ). I hope this helps someone and God Bless.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bielsko-Biala, Poland", "Title": "“We had a really relaxing stay; just what we needed!”", "Author": "Benjamin R", "ReviewID": "UR127373286", "Content": "Another reviewer mentions being away from the hectic city life. He's absolutely bang-on. This hotel requires a bit of effort to get to, being fairly removed from the centre of Rome. It's well worth the effort, however, as there isn't a tourist in sight and the village of Isola Farnese is charming. The hotel itself is a little gem. The staff are not merely polite; they are just delightful! Friendly, cheerful, and full of suggestions for a day of wandering that took us to places we wouldn't have found in a guidebook. The best part? Being woken in the middle of the night by a hooting owl. It was like being awakened to hear good news, given time to enjoy it, and then drift back to sleep.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Amazing”", "Author": "Bryan W", "ReviewID": "UR124380750", "Content": "This was an amazing hotel to stay. The owner spoke english which was very helpful to our very broken Italian and was very generous to us. The rooms were very clean with stained wood cabinets and a great view of the gorgeous Italian countryside. It is not on the main drag which was nice to be out of the hectic city life and provided great scenery. Also, it is right across the street from a gorgeous Catholic Church.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“No better Service in the City of Rome”", "Author": "GabrieleY", "ReviewID": "UR124329730", "Content": "This was by far the most welcoming and friendly staff, as others have said they will make sure you are accommodated and truly a pleasure to be served by. The location is also much quieter and calmer than the busy city life.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome", "Title": "“very helpful staff”", "Author": "Nick H", "ReviewID": "UR124171467", "Content": "staff were fantastic--thirteen of us arrived in a snowstorm and they bent over backwards to get our stuff dry and find us good food.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Went out of his way for us”", "Author": "Tom H", "ReviewID": "UR124168622", "Content": "Even though the hotel was closed for the night, the owner was willing to open it up for us for a night, as well as providing dinner and breakfast. We had just gotten done with a full day of walking (in the biggest snow storm Italy had seen in a quarter century), and he drove in the bad weather to come out and take care of us. It only cost 50 euro as well, which was very reasonable. A real God-send!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Not too busy, and just close enough”", "Author": "Joseph119", "ReviewID": "UR124152271", "Content": "The hotel owner, Simone Giugliani, was gracious and provided service above and beyond what one would normally expect for our group. Service was prompt and polite, and the staff spoke English well. An excellent stay in a place that's not in the busyness of Rome but easily accessible by metro.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Crowborough, United Kingdom", "Title": "“A Real Taste of Italy - Beautiful”", "Author": "Christopher S", "ReviewID": "UR121114922", "Content": "This was a truly fantastic way for my girlfriend and I to end our little trip around Europe. We decided to stay at the Tempio di Apollo due to the location (just outside of the city centre) and the price (truly fantastic for what you get). I would allow an hour to get from Termini Station to the hotel, but it is well worth the travel. Follow the instructions provided by the hotel and get off at the very last stop on the bus (right at the top of a hill) and you will be rewarded by some of the kindest staff and truly spectacular views. The room was lovely, and the free and fast wifi was an extra treat. In the morning, we were served breakfast on the roof of the hotel, overlooking some of the most beautiful scenery of our entire trip. I'm not sure why others didn't enjoy staying at the Tempio di Apollo. This is the real Italy, and a fantastic way to experience the Italian way of life.", "Date": "November 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“\"We loved every moment. Great place,Great food and love\"”", "Author": "jbessidone", "ReviewID": "UR115471549", "Content": "A beautiful little Italian hotel in a picturesque part of Italy. The scenery is amazing with a stunning waterfall just a walk away. The customer service is 'benissimo' (outstanding). Allora, we were looked after by staff and the locals in a true Italian way with love, life and warmth like the morning sun. We are planning another trip already!", "Date": "July 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“The Best Kept Secret in Rome”", "Author": "KevinFortune", "ReviewID": "UR108926231", "Content": "One of the best kept secrets in Rome is the Hotel Tempio di Apollo. Located not far from dowtown (with a public transportation bus stop conveniently located right in front of the hotel), it is a genuine Italian hotel-not a touristy/commercialized one. The setting is in a quiet, secluded, and historic (across from a Church built in the 1400's) area. It is a family owned./ run hotel which has been in the hands of the same Italian family for generations. There is a restaurant conveniently located on site that serves some of the best authentic Italian food at a reasonable price. They make the best Pizza Margarita in all of Rome! But, by far, the hotel's greatest attribute is its service. The staff is friendly, courteous, and helpful-always greeting its patrons with a big smile. They are very accomodating, trying to meet their guest every need (for example,Italians don't use ice-but when I requested it , they went out immediately and bought some). Because of its small size, guest get personalized attention. An added blesing is to meet and wperience the glowing personalities of its owner family. First, you are officially greeted by the Mother Doninica, who has the biggest smile and brightest welcoming eyes in Italy. Simone (the hotel manager) and Egeo (restaurant manager), have the most oout-going, positive,and professional behaviour. They both release a flow of excitement and energy to the stay (its worth the trip just to meet these two-they're characters in the most positive/thrilling way). So, as an expert in international real estate/vacation properties, I can say this is one of the best hotels in Rome and the whole World!", "Date": "May 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0"}, "AuthorLocation": "New York City", "Title": "“A terrible experience”", "Author": "car1nyc", "ReviewID": "UR72326085", "Content": "Came to stay; the room was hot and stinky, with a humid feel all around. Room had a dustball in one corner and a condom wrapper in the garbage. No thanks; we left almost immediately after checking in.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Heidelberg", "Title": "“Visit Rome, don't stay at this hotel though!”", "Author": "favorsc1187", "ReviewID": "UR24672612", "Content": "This hotel was by far the worst hotel I have ever been to! First of all it is not \"centrally located\", it cost 100 euros in a taxi to the hotel! By the time we got there we all needed a good night sleep and try to forget about our expensive taxi. The next morning we woke up to find out that my father and his girlfriend hadn't slept at all that night because the bed was missing 4 slats right in the middle of the bed! Breakfast includes one cup of coffee and one croissant. Sure the bus comes every 20 minutes, but then your on the train or another half an hour and then tack on however long it takes on the metro to get where you want to go. The TV and the hair dryer in my fathers room didn't work. Our bathroom had no hairdryer, there was mold in the shower. One of the brothers was very nice, and the other acted as though we were inconviencing him b asking him questions. Our reveiw said there was internet throughout the hotel. Once there and we asked the man told us you have to be at least 10 meters in distance to the reception. I would not recommend this hotel to anyone!", "Date": "February 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "zurich", "Title": "“beautiful little hotel”", "Author": "peter020", "ReviewID": "UR17261932", "Content": "stayed there 4 days and had a wonderfull time. the room was big and clean and the toiletts was sparkling new.it s run by a young couple ,she s from sweden and the husband is italian, very kind and they even drove me several time to the station without any charge....which is very hard to find those days!", "Date": "June 26, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Stoke-on-Trent", "Title": "“Find rural peace near Rome”", "Author": "Pensionato", "ReviewID": "UR8395607", "Content": "The situation (rural but historically/architecturally interesting) is hard to beat, an escape from the hot bustle of Rome but easily accessible by bus and train. Run by two young brothers who are very friendly, helpful and informative and, when not too busy, will chat - important for those of us who like to talk. Dinner under a bright moon on the terrace/balcony overlooking a steep valley is magic! Food good but a bit pricy, rooms very good, reasonable rates. The place has atmosphere and real character. This middle-aged couple will certainly stay here again.", "Date": "August 11, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hampshire", "Title": "“Lovely setting”", "Author": "chickenpieHampshire", "ReviewID": "UR6616224", "Content": "Small hotel, run by 2 young brothers. Very helpful and friendly. Exceptionally clean. Rooms fairly basic but everything you need - showers very small. 2 restaurants, one cosy for the winter, one by the terrace with beautiful views. Very quiet. Excellent bus service every 20 mins to station, then quick run into Rome. We had a fabulous New Year's Eve there with a 7 course meal. Very quiet area in small hill top medieval village in national park, good for walking.", "Date": "January 18, 2007"}], "HotelInfo": {"Name": "Tempio di Apollo Hotel", "HotelURL": "/ShowUserReviews-g187791-d611389-Reviews-Tempio_di_Apollo_Hotel-Rome_Lazio.html", "Price": "$59 - $99*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Piazza della Colonnetta 8</span> | <span class=\"extended-address\">Isola Farnese</span>, <span class=\"locality\"><span property=\"v:postal-code\">00123</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "611389", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c3/a5/27/double-room.jpg"}}