{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Clean, well located and fast checkin”", "Author": "gens1980", "ReviewID": "UR126328576", "Content": "A good value for money hotel, in a nice part of Berlin. The room was cheap and the service was friendly and efficient.", "Date": "March 19, 2012"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Modena, Italy", "Title": "“Great deal”", "Author": "Carlo M", "ReviewID": "UR123106431", "Content": "This hotel is located in a great place. It is in a great community with all the locals being really friendly. It is a basic hotel with great deal on cleanliness, helpfulness, convenience and just the basics. We had a great time. The hotel was clean and spacious enough and a great deal on price. The staff were helpful and we had some great fun with them. I cant wait to go back", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Naxxar, Malta", "Title": "“Highly recommended, central, clean.”", "Author": "JBS70", "ReviewID": "UR121766332", "Content": "If you are looking for somewhere quiet, clean and central to stay then this is the place for you. Reception was very helpful. The place was very clean and the breakfast was very good. The pension is small so it is not rowdy or noisy. Train station is a 2 minute walk from the hotel and there are lots of lovely restaurants and shops in the area. Berlin Tegel is not far either. I could not have asked for a better place to stay. The bed is the most comfortable bed I have ever slept in. Like sleeping on a cloud. I would recommend this to friends and family traveling to Berlin.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Denver", "Title": "“Forget about it!”", "Author": "gahoppe", "ReviewID": "UR119826291", "Content": "Someone else picked this hotel for my wife and I to try to save money. Forget about it! It was dirty, noisy and creepy. I don'tr care how much we saved, it wasn't worth it.", "Date": "October 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“We could return here and be satisfied!”", "Author": "skiblue60", "ReviewID": "UR113464984", "Content": "We needed a place to stay near our friend's apartment near the Kleistpark UBahn. This hotel is near a quiet neighborhood with a couple of nice restaurants nearby. It felt safe to walk to nearby stores, restaurants and public transportation. We found free parking a block away. Considering that parking in Berlin is a premium, we were thrilled to have a place for our rental car for free. We appreciated having the grocery store under the hotel and found the employees helpful. We did not eat their breakfast partly because of cost and we wanted to dine with our friend. The beds were comfortable and it was nice having a small sofa to sit and watch TV. We had a balcony room which was adjoined to the room next door so security was a bit questionable in that sense. Overall, it is a nice hotel and served us well.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Good place to stay in a low budget.”", "Author": "traveluis", "ReviewID": "UR79924471", "Content": "What to say. Very clean and quiet hotel. Close to metro and has a supermarket at the corner. From the outside it looks a bit scary, but once inside you'll find clean, quiet rooms with friendly staff. Internet only works in the first floor. You need to pay 5 euros for wi-fi while your stay. Breakfast not included. You feel safe in the hotel. Hotel is well managed and is good if you are into saving money and like a clean basic place to stay. Bed was extremely confortable. More confortable than a 4 star hotel.. very impressed by it. Sheets were very white and clean and room did not smell like cigarette.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Good clean, basic hotel - very good value for money”", "Author": "BorisR", "ReviewID": "UR66712201", "Content": "Stayed early June for a few days with two young children. Rooms basic but clean, spacious and v quiet. Hotel provided a travel cot and we also used a sofa bed in the room for our eldest child. Staff were friendly and helpful. Had breakfast each day - service occasionally a little haphazard but breakfast was tasty with a nice spread of cheese, measts, bread, fruit yohurt etc. We also asked staff to keep some milk in fridge for our children for whenever we needed it and this was no problem. Although there is no room service you can buy a small selection of alcoholic and non-alcoholic drinks from reception. Excellent location in Schoeneberg - just a few mins from the main street but quiet with a playpark across the road and supermarket on the corner and near U-Bahn stations.", "Date": "June 7, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "birmingham", "Title": "“Don't judge a book by its cover”", "Author": "Smallpacket", "ReviewID": "UR60072407", "Content": "The internet pictures look great but on approach we found the building to have a communal entrance which did not enspire confidence. Ever the brave traveller we carried on up the stairs to the first floor (there is a lift). Inside we were well impressed with the light and airy feel. Our key gave us 24hr access to the building, first floor and our room. There was a bit of wear to the furniture however the room was clean, bathroom sparkling and linen as white as white. The carpet and settee were in good condition too. We did not take breakfast at the hotel as we were meeting up with friends however the breakfast room did look lovely. I would recommend this hotel as its location was great as getting into Berlin was really easy using the S1 underground line to Potsdammer Platz. The area is Bohemian, Turkish enclave, Artists boutiques and a nearby street stuffed full of restuarants all doing a brisk trade. The reception is only manned at certain parts of the day so if you are a traveller that needs plenty of reassurance this might not be suitable. Having said that when there is somebody there they do offer a proper service booking trips tickets etc.", "Date": "April 1, 2010"}], "HotelInfo": {"Name": "CCA Hotel Pension Delta", "HotelURL": "/ShowUserReviews-g187323-d611744-Reviews-CCA_Hotel_Pension_Delta-Berlin.html", "Price": "$63 - $129*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Belziger Strasse 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">10823</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "611744", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/28/fe/28fe673ad9ea66fb122c8840f8178a501large.jpg"}}