{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "edgemoor", "Title": "“Labor Day home away from home”", "Author": "andrea b", "ReviewID": "UR139675087", "Content": "I stayed in this condominum for a week and I had the most amazing of times - a true home away from home. The staff was very friendly. Our daugther enjoyed the swimming pool a lot. We had so much fun. The room was comfortable and clean, the view is perfect. My husband and I prefer B&Bs when we travel, and we are so glad we found this one place. We would recommend this to everyone We would definitely stay again.", "Date": "September 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chas", "Title": "“Beautiful place with friends and family”", "Author": "kim g", "ReviewID": "UR137174099", "Content": "I had the great pleasure of staying at a Sea Dip Beach Resort a few weeks ago. We got there around noon and checked in . We dropped our clothes off and when to the pool . It was relaxing and clean!!! Great view from the hotel room. The staff was great. We definitely going back.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Family oriented,and very friendly people.ive been coming to the sea dip for years and thats my vacation spot I recomend to anyon”", "Author": "Bellalucci", "ReviewID": "UR136818837", "Content": "I love it the owners are amazing,if you stay here you will not regret it its perfect for kids,and cooking out,its right on the beach Dont forget to stop by the sea dip.................ask for eszter shes amazing and will be glad to get you in to enjoy after a long drive to beautiful daytona beach florida", "Date": "August 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New york", "Title": "“Beautiful beach and great staff.”", "Author": "Jerry S", "ReviewID": "UR136478294", "Content": "We stayed in Daytona for a whole weekend at a Sea Dip Hotel. We have 6 rooms. Very nice place and clean. The manager, Esther is the best I've ever seen. She has a talent for making people feel comfortable, and welcome. Customer service is a specialty of her. Very friendly and helpful. Definitely a place to recommend to take your family and friends.", "Date": "August 7, 2012"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Orlando, Florida", "Title": "“Horrible Customer Service”", "Author": "Tracey_Red_1", "ReviewID": "UR132732924", "Content": "We cannot actually review the property because we never actually stayed there. The customer service given by the Manager was horrible. We had booked several rooms during an off time. (not Bike Week, BCR or Spring Break) There was never a mention of a deposit because we were Florida Residents and it was not on thier website either. They never called to tell us that they changed thier policy, they were going to spring it on us upon arrival.....a $250 surprise. We found out because another friend booked a room and was informed of the new policy. Our friend also explained the money is not refunded immediatly after check out, that it takes up to 12 days to get your $250 back. We called the Manager to discuss the issue. She was rude and unsympathetic. I explained that you cannot change policy after we already had booked and expect us to follow the new policy. Especially since she never notified us. She told us basically that she didn't care because they are full every weekend. I called that weekend to see if they had any rooms available, she told me they had many. I guess they don't really fill up every weekend like the Manager stated. They have been report to the BBB, of which they are not a member. I can see why, because you have to be honest and give good customer service to be a member. If you log on to the BBB you can see the lovely rating of F that this establishment has earned.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, Kentucky", "Title": "“Just Spent A Week at Sea Dip”", "Author": "Lonnie H", "ReviewID": "UR132256409", "Content": "I just got back from spendin a week at the sea dip resort in daytona beach. I had read other comments about it and was really worried about stayin there till i got there . It was one of the nicest places i have ever stayed for the price and would surely go back again next yr. the owners and help was wonderful in everyway I stayed in room 232 and for two people was great.Thank u sea dip for a wonderful vacation . Lonnie", "Date": "June 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“I love this hotel.”", "Author": "angelia6296", "ReviewID": "UR131448346", "Content": "I love this hotel and I stay here everytime we come to Daytona Bch. They are not the best in Daytona as far as the looks but for the price, my family and I really enjoys the place. It's a 4 star for me. Angelia Dariso in Orlando Fl.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Palm Springs, California", "Title": "“Terrible”", "Author": "John P", "ReviewID": "UR127372115", "Content": "We had reservations at America's Best Value Inn during Bike Week. They sent us to the Budget Inn across the street due to overbooking. We asked if the rooms would be as nice, and were reassured. The place is a pit. Our room had a clogged sink and we moved to one with holes in the shower walls. No ice maching. Sparse rooms, no coat hangers or closets.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Climax, North Carolina", "Title": "“Excellent Value”", "Author": "Ann C", "ReviewID": "UR124213432", "Content": "We have stayed at the Sea Dip for the past 10 years on our annual beach vacation. The value is excellent. We have always stayed in the same room(s) and loved it. We've had additonal family members stay in different rooms and these rooms were also clean and very presentable. We will be there again in 2012.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Beaverton, Michigan", "Title": "“Don't do it!”", "Author": "tbadour", "ReviewID": "UR104667879", "Content": "If you don't mind disgusting smears on the walls, front desk help dressed to go to the bar, no room service when it rains, and strange odors...then you might be OK. We were treated rudely by the front desk clerk who referred us to the supervisor. The supervisor's response was...\"The clerk was having a bad day.\" I'll never go back!", "Date": "April 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "Jacksonville Beach, Florida", "Title": "“WATCH OUT for the bed bugs!!”", "Author": "ydavis", "ReviewID": "UR71303204", "Content": "With not many options to stay on a Friday night in Daytona Beach, Fl, we found ourselves at the Sea Dip Hotel. The room was not bad priced at $66.00 a night, which should have been a sign. We checked in and went to eat. Upon our return we showered, which you better bring your flip flops The tub was badly stained and not in the best repair. When we got into bed we began to feel as if something was crawling on us. Within minutes we turned the bed completely and removed the pillows. Much to our surprise were small black bugs! There were multiple bugs and I along with most people would be totally disgusted. We immediately called the desk which no one answered. When we went down stairs and got the hotel emergency number again noone answerd. After trying for over an hour we went down the street and paid $100 for another hotel room. We were at the Sea Dip site at 8 O'clock in the morning.We were informened that we would not be given a refund although we only occupied the room for 2 hours. they stated that we had used the room and they would not do anything about the situation. I showed them one bug that i had caught, also that the neighbors did come into the room and viewed the conditions of the surroundings. The manager of this dive is worthless and her children, that run it in her absence. If you like to lay with the bugs stay on the beach its cheaper and probably cleaner, along with not having to deal with rude incompitent people. Y. Davis", "Date": "July 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "florida", "Title": "“Management that does not accommodate their paying visitors....”", "Author": "bambi69Florida", "ReviewID": "UR61224223", "Content": "Checked in on 4-9-10. We were suppose to stay 4 nights. Just me and my 2 teenage kids. The first room was not upgraded and was dirty. They gave us another room. It was better but I noticed the microwave and refrigerator did not work. I reported it at 4 pm. I called the desk 3 times afterwards till 8pm. Still nothing. They did not offer to give me another room or ice and cooler for my food. I could not feed my kids the food I brought and had to throw it away the next day. I asked the counter person that morning for some kind of accommodation to make it right. She was very rude and said there was nothing they could do.I checked out that morning and took my kids somewhere better. The amenities for this resort state microwave and refrigerator in all rooms. It should state, we might fix it, but your out of luck till then......", "Date": "April 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "daytona beach, fl", "Title": "“Excellent value, privately owned room - everything was great!”", "Author": "bobbielou", "ReviewID": "UR36520458", "Content": "We had the penthouse #516 which is owned privately - full kitchen with everything you need. Although we didnt cook in much except breakfast. Balconys great which is the reason I wanted to go here. Gorgeous pools - clean. Only one complaint and it had nothing to do with the hotel - kids not watched by their parents in the outside pool area. I dont swim but was standing in the shallow end and these kids are all over bumping into you Mother lying on lounge expecting others to watch them. Maybe should have a hotel staff person out there? Would be great if opened the outside restaurant.................", "Date": "August 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Tucson, Arizona", "Title": "“A big improvement”", "Author": "wptaz", "ReviewID": "UR30654822", "Content": "It's probably unfair of me to evaluate this place as we escaped from such an awful hotel that the Sea Dip looked like heaven. This place is old and a bit run-down. The desk staff was extremely kind and helpful. We refused to check in without seeing a room and the indoor pool (we were at the beach in horrible weather) and she gladly accommodated that. The \"penthouse\" room was adequate but the beds were old and uncomfortable. The efficiency kitchen was great, with a new fridge, microwave, coffee maker, and toaster. There was an older stove that we didn't use. The ocean view was awesome. The pool area outside was nice and the pool was large. The indoor pool was warm but really old. There are beautiful murals painted on the walls of the indoor pool area and they should clean and maintain the area better to preserve them. Overall, we would consider staying there again if the beds were upgraded.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“What You Need To Know for Great Visit”", "Author": "beachvacationsareus", "ReviewID": "UR20793054", "Content": "A friend told us about this place as a very good value. What we discovered is that because the 100 or so units are each privately owned some are beautifully maintained while others have been neglected by out-of-state owners. The oceanfront and oceanview rooms on the 5th floor penthouse level are mostly terrific #534 and #535 are gorgeous and can accommodate wheelchairs. #516,#517,#518 are also highly recommended. VERY reasonably priced at about $59. per night. Free wi-fi worked well; all local and long distance telephone calls were free. We walked on the white sand, watched the moon rise over the ocean from our balcony in #518, watched baseball and football on ESPN and movies on HBO (all free) and swam in both the indoor and outdoor pools. Enjoy!", "Date": "October 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Atlanta, GA", "Title": "“Pictures Are Not Accurate”", "Author": "TammyAtlanta_GA", "ReviewID": "UR18640527", "Content": "I don't know what the people who are saying this is a great place to stay are talking about. Our room was filthy and very much in need of repair. Our sliding glass door actually had bandaids on it trying to hold it together. The carpet was disgusting. No way would you walk around w/o shoes. It was so bad we complained and moved onto a different location. The pics on their website make it look inviting but don't be deceived. The worst place I have ever seen!", "Date": "August 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“We love the Sea Dip, We will keep coming back!”", "Author": "cant_findagoodname", "ReviewID": "UR18426316", "Content": "We love the Sea Dip! We've been there twice and are going again in a week, I CAN'T WAIT! The value is incredible! The outdoor pool was just remodelled, and I'm excited to see what it's like. I've seen pictures and it looks great! In response to other (negative) reviews - Most of the Condos are privately owned so the decor, cleanliness and style is really up to the owner, if you think your room is outdated or you just don't like it - ask for a different one. All Condos in all resorts all over florida have Palmetto bugs (they look like roaches) again, it's Florida. I've come to expect it. The Sea Dip is for families, couples and it is a private little place. Mostly quiet and very safe. There is a security guard and the place is gated, so no unwelcome outsiders! All the locals that live there or own are friendly and the staff is very helpful and eager to please. We love how equipped the condos with kitchens are! There really is everything you could possibly need in them. There are very inexpensive laundry facilities, vending machines and the office has plenty of info for out of towners looking for things to do. The indoor pool is very exciting! It has beautiful murals of Ocean life painted on the walls. Kids love it! We take a dip each evening, it's always refreshing after being out in the sun for the whole day. I would recommend this Resort to others! I had an absolute blast each time I went. Would love to see the restaurant open up again!", "Date": "July 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "florida", "Title": "“Small but reasonable”", "Author": "bobbiefla", "ReviewID": "UR17486984", "Content": "The rooms are small, even the PHs, But we were there for the beach, so it was suitable. Housekeeping is terrible though! they made the bed the first day only! None after that - maybe cause I made it myself the second day, the rest of the week they didnt touch it even when I left it unmade! No change of sheets only towels (which I had to ask for) and garbage removal. Even with this though, We would definitely stay again - the rates are good, the rooms are standard but right on the ocean beautiful pools (2) My biggest concern is always whether I feel safe in a hotel and I did here, so definitely will rebook - preferably not during a busy event month. I go to the beach for rest and relaxation and there were SO MANY kids this time of year. but definitely it was a great place to stay (no restaurants close - I dont know where that person said across the street!) you have to drive.", "Date": "July 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "fl", "Title": "“Sea dip worth the money, depending on the room you get”", "Author": "tcatflyer", "ReviewID": "UR16852661", "Content": "spent the long weekend at the sea dip Our room was newly remodeled and pleasant... some rooms are old with dirty carpet so make sure you ask for one with tile! out door pool was just re-opened after remodeling and the location is very good , right on the beach 2 miles south of boardwalk. good value for the price", "Date": "June 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "home", "Title": "“good value”", "Author": "travelingbuddy034", "ReviewID": "UR13998115", "Content": "good hotel for price and it is clean. we stay there 2 times a year. reasturant across the street.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kentucky", "Title": "“Sea Dip Resort”", "Author": "table4four", "ReviewID": "UR8091329", "Content": "June 26-28, 2007 -- I give our stay a 3 -or- 4. After reading some of these postings, I will have to say our visit was just fine. For starters- Just because the sign says \"resort\" don't roll in thinking that you're going to be staying at the Taj-Mahaul! The Sea Dip is a bit run down (afterall its been through a massive hurricane and lived to tell about it...) but from everything we saw during our 3 day stay there, it was just what we wanted. The location was about a mile and a half south of the Main St. Pier (you can see it in the distance) on A1A, so if you are traveling with children you are away from the more \"party\" crowd- especially at night. The people and staff were really friendly and made us feel welcomed! Of course the first place the kids wanted to look at was the pool and the beach.... both impressively clean! We were there during the middle of the last week of June 2007 and our kids had the pool pretty much all to themselves. There was no one there doing activities with the kids ...like some of the other resorts do... but that was fine with us! Very nice well kept poolside area and chairs. Access to the pool from our room was approximately 50ft. and about a 100ft. from the entrance steps to the beach. Both the pool and the beach gates are key-entries. There is a water hose when you come back up from the beach where you can stop and spray the sand off. There is also a very nice, clean outdoor grilling area with 4 large charcoal grills right next to the pool. You might want to line the grill surface with heavy tinfoil, but otherwise they were very clean. The parking area is well lit at night. The fact that we were trying to get the most bang for our buck brought us to The Seadip and we got what we wanted. It's a quiet place with older couples or families who stay there for long periods of time. Other rooms that are privately owned and aren't being used are leased out to vacationers like us. We were out and about most of the time so we really didn't need to sink alot of money into a place to snack, sleep, and bathe. For the money you couldn't beat the value. The room was clean and neat in appearance. It looked like it had been recently remodeled. There was only a stand up shower in our room, but being that close to the beach that was fine... its better for getting the sand washed out of hair and clothes. The beds could use new mattresses, but otherwise I don't think anyone had any trouble sleeping! There were no bugs in our room other than some very small ants (very few!). Being right next to the beach there's really not much you can do about a thing like that. If that sort of thing bothers you, stop and buy a room fogger and set it off before you unload your things in your room. Since I had been to the beach several times before, I knew to bring air tight ziplock bags to keep foods in. I fixed a huge breakfast two of the days we stayed there. The appliances were old but worked just fine. The kitchenette was adequate and had everything we needed to get through our visit. Parking is excellent and easy to get into and out of from the street. If you are planning to stay here and use the kitchen for cooking, etc... you might want to throw in some heavy tinfoil, large and small good ziplock bags for storage, and don't forget to stop at the grocery! There's a huge Publix grocery store north and south of the Seadip. It really does save money if you're not always eating \"out\". A few things to mention: The Ponce Inlet Lighthouse. If you have never seen a lighthouse in person before... it is humbling. Do a search on this lighthouse for more information and exact directions. Its about 10-15 minutes from the Seadip and worth taking the time to go see it! You will pass the entrance/parking lot for the \"Sunglow Pier\" which has a full service resturant called \"Crabby Joe's\"...great food, great prices, casual attire, and a very unique dining experience! The Main St. Pier is north from the Sea Dip about a mile and a half. It's definately a must see! If you have never ran the coastline up A1A toward St. Augustine, its worth the trip! Beautiful!! St. Augustine is awesome!! Susan Kentucky", "Date": "July 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Great Experience”", "Author": "lovin'daytona", "ReviewID": "UR5508389", "Content": "We love the Sea Dip. My family and I have stayed there several times and will go back again and again.", "Date": "July 25, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“This place is terrible!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5332317", "Content": "June,3 2006 Well where do I begin? The rooms were outdated and moldy yes, I said moldy, with bugs stuck to the walls gnats to be exact. They made an effort to make it right but it went from abd to worse when, returning from being gone all day we came back to find roaches in our room. When I tried to contact someone in charge the president lied and said she wasn't in charge but ultimatly made the final decision to give us our money back for the 4 days we refused to stay, were she not the one in charge how was that authorized? When we returned the next day to try and get our money back for the previous night (since we left at 11pm) the presidents husband began yelling at me in the lobby of the hotel in front of my 8 yr old daughter, he also was not in charge but had no problem waling behind the desk and into the office. We left that night and never looked back my review is that this place needs some serious help with the exception of the front desk clerks Shay and Estelle other than that I would never saty here and I would tell that to anyone.", "Date": "June 11, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Horrible experience!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5332132", "Content": "Don't even think about staying at the Sea Dip Beach Resorts & Condos on South Atlantic in Daytona Beach! Sleep in your car if need be, but don't check into what the locals in Daytona call the \"Sea Dump\". And now I know why.I planned a vacation for myself, my daughter and granddaughter ever since January of this year. I looked at all the hotels/motels in Daytona Beach, where my sister happens to live. I found the rates to be somewhat higher than last year, so I thought I would give this place a try. Don't judge this 'hole in the wall' by the pictures on line. We arrived at the hotel about 11:00PM. Finding 3 police cars in the lot, gave me a shutter, but I still went in and checked in. Went to the room, only to open the door and find mold all across the ceiling and dead bugs in spider webs over the one bed. We called to let them know about this and they told me that they would move us to another room. I sent my daughter to look at the next room, since she is a professional housekeeper. She came back and said that the second room seemed to be nice enough, so we loaded all the luggage back on the cart and went to the next room, which was in the next building. (I could not help my daughter with the moving, having had 4 major back surgeries and my granddaughter is only 8 years old.) We moved into the second room, ground floor, no ocean view as I had requested on the first room and no change in price to be on the ground floor. We were so exhausted by this time, we collapsed, knowing that the next day we were off to Tampa to see my Aunt, who just had major surgery. So we were gone all the next day. Came back to the room and my daughter turned on the light and low and behold a cockroach! My granddaughter said she was sleeping in the car and would not stay there. Fifteen minutes later, another. This one my daughter smashed and put in a plastic bag and put in the freezer to show the front desk personnel. The girl from the front desk did come down to the room to see us and tell us how sorry she was, but did not have anyother rooms to give us. I told her we were not staying there another minute that we were moving to another hotel. My daughter went into the kitchen area to check to make sure we did not forget anything and opened the cupboard doors, only to find the entire cupboard area \"infested\" with roaches!! Not the palmetto bugs you see in Florida, but Roaches! I don;'t live with roaches and did not intend to stay in a room with them that I was paying for on my vacation. We checked out immediately and went to another hotel, for the same price and it was totally lovely! I went back the next day with my daughter to get my credit on my credit card, and they gave it, but only part of it and not the deposit which I had give in January So, I paid for three nights, only stayed two and they wanted us to stay with mold, dead bugs in spider webs and roaches.I would highly caution anyone from being taken in by this hotel ( and I use that term lightly). This should be condemmed by the City. If I did not know better, having stayed in Daytona and lived in Port Orange, I would not be going back to this area again. The Chamber of Commerce should be aware that this hotel, giving a first impression is not good for that area. And the Health Dept. should close them down. This as my daughter said, is totally unacceptable and unliveable. We will be sending them the cockroach we kept as evidence, just so they know we did not take anything that did not belong to us! Run, hide, change your plans, but do not say at this 'so called gem on the beach\".", "Date": "June 11, 2006"}], "HotelInfo": {"Name": "Sea Dip Beach Resort and Condominiums", "HotelURL": "/ShowUserReviews-g34172-d613729-Reviews-Sea_Dip_Beach_Resort_and_Condominiums-Daytona_Beach_Florida.html", "Price": "$55 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1233 South Atlantic Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "613729", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/07/3b/6b/the-sea-dip-as-seen-from.jpg"}}