{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Miami, FL", "Title": "“Adequate”", "Author": "Caygo", "ReviewID": "UR128082659", "Content": "I took my parents to Amsterdam to see the Van Gogh Museum. We stayed one night at the 3 star side of the Westcord Art Hotel. We booked an extra large, \"Quadruple Deluxe Family Room.\" A picture on the hotel's website led me to believe there would be two queen size beds separated by a wall. In reality, this was a small room, with two twin size beds pushed together and a rather uncomfortable fold up couch bed. A person had to turn sideways to pass between the two beds. For the money we could have done much better. This hotel is clean enough, but there was absolutely nothing \"Deluxe\" about it. If you are American, expect the same type of accommodations as you find at a big chain motel off a major interstate exit. The best thing about the Westcord Art Hotel were the employees, who were all very friendly and helpful. Also, the shower was incredibly hot and powerful.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Style Over Substance”", "Author": "Richbrownowl", "ReviewID": "UR127870685", "Content": "I stayed in the Westcord (Room 228) for five nights 3-8 April 2012. My first impression when arriving at reception was although greeted in a semi-warm fashion, I was given no information regarding services offered by hotel (metro/bus cards, etc), it's only by listening in on another guest being checked in that I pointed it out to the person who by this point had bid me farewell. On getting into my room, the mini bar was locked (I was not given any info when checking in about the mini bar). I phoned reception and was told I had to leave a 100 euro deposit - fine. This should have been explained on check in. I pointed out that you have my card registered - the mini bar was unlocked. Although first impressed by the aesthetics and look of the hotel, on closer inspection I noted that there were burn holes in the day bed, stained chair and chipped moveable table. My bed (twin singles) was extremely uncomfortable (too soft) and had two small single duvets instead of a double. I could not sleep on the bed - it caused back pain, and had to resort to sleeping on the day bed at night. On my last night the mini bar was locked. I phoned reception, who told me I had exceeded my deposit. I told them TWO cards were registered. They told me they didn't have any cards registered - this is an untruth. I found this extremely unprofessional - that I was not offered a satisfactory resolution. The staff were sullen, particularly in the braissarie. I was not made to feel welcome, and will definitely not stay again. The only good thing was the food! The lady checking me out was very friendly.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Fine hotel outside city centre”", "Author": "Rick B", "ReviewID": "UR127595161", "Content": "Fine hotel for business purposes. For sightseeing and tourists maybe less interesting, unless you like to stay outside the citycentre. But public transport is easy avaiable. Busstop just in front of the hotel. Staff very polite and helpfull. Only thing is that computersystem shuts off access on keycard at midnight and not at noon. So after breakfast already with 2 visits I couldn't get back in the room. Was a bit annoying. Further it was very pleasant staying over there. Lunch and dinner excellent. Good wines. Nice and friendly staff in Restaurant and bar.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amersfoort, The Netherlands", "Title": "“Good rooms but poor staff”", "Author": "hage06", "ReviewID": "UR127461667", "Content": "To check in and check out at this hotel is always terrible. It takes way too long and the staff isn't flexible or cooperative. We made a reservation for 4 rooms (at one reservationsnumber) but when we checked in the rooms were all listed as separate reservations. We book 4 rooms at once because all the rooms had to be paid together and now these all had to be paid separate. Furthermore the staff was rude as well; we had a big party and all went late to bed (around 4 am) and we were all having breakfast around 09.30 am. One of our friend yawned (with his hand for his mouth) and the receptionist reacted to him with the remark; Sorry??? And the way she said it was rude and inpolite.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Westcord Art Hotel”", "Author": "Jeremy Y", "ReviewID": "UR127132630", "Content": "An excellent hotel to stay in for business, situated mid-way between city centre & offices in Sloterdijk. Rooms are decently situated and provide decent wi-fi, tv et cetera. The staff are always kind, friendly and helpful, it is always good to see a familar & friendly face when I pitch up on a Monday evening!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Berlin, Berlin, Germany", "Title": "“nice hotel”", "Author": "Sijia", "ReviewID": "UR127115926", "Content": "Art Hotel Amsterdam is not in city center, maybe it's the only shortcut of it. but the bus 48 and 22 are just an the door of the hotel. the room is really nice, it's clean and quiet, and also big in the sense of europe. hotel bar and restaurant are a bit too expensive.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“lovely room with luxurious feel!”", "Author": "Fleur T", "ReviewID": "UR127035893", "Content": "We just booked for one night, because we went to a wedding party in amsterdam, and we wanted to spend the night closeby. We got an upgrade, very nice!! 4 stars in stead of 3! Very nice room, very quiet, and with a very nice kind of love seat. We really really enjoyed it, and breakfast was very good as well!", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great, just overly warm!”", "Author": "Hannahstar", "ReviewID": "UR126906726", "Content": "I travelled to Amsterdam this weekend just gone, alone. I booked through lastminute.com, which went smoothly. I did e-mail the hotel a few days before to check they had received my booking, I'm always wary about booking through 3rd parties, but I never actually got a reply for a hotel, so I was sort of worried, but all turned out okay. I got a taxi from Schipol to the hotel, which cost me around 50 euros, which isn't exactly cheap but I had a heavy suitcase and was feeling lazy so it's fine. I got to the hotel about 1.30 and they let me have my room. Was greeted by friendly staff and generally nice atmosphere. The hotel itself is very nice, clean and well-presented and overally very nice. On checking out, I dealt with a member of staff who couldn't even be bothered to smile at me or thank me at all - my only bad experience. She was extremely rude and conversed with a colleuge in Dutch whilst I stood there. Nevertheless, she booked a taxi for me when I asked and paid less than I had when I travelled from Schipol. The room was great, very clean and nice, and had a great stay. The aircon didn't work however and it was so ridiculously warm all the time. My only other complaint! Oh and, there's no way you're getting cold water out of those taps, all the water was tepid or scalding. I ate in the restaurant twice, and both times I was extremely impressed. The food and the staff were just amazing, and I absolutely loved it. The travel links are amazing, buses 22 and 48 run every 10 minutes to Amsterdam Centraal, which is just perfect. And with a chipkaart you can't go wrong. I would definitley stay again! :)", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TLV", "Title": "“Excellent”", "Author": "95BP10", "ReviewID": "UR126672675", "Content": "This 3-star hotel is very nice and pleasant, the room was very clean and comfortable. The price is very much reasonable and including breakfast, unlike many other hotels in the NL. The location is great - It less than 10 minutes drive from the ring, and it's about 10 minutes ride in a bus to the central station. However, the view from the hotel is not of the canals but rather of the industrial area of North West Amsterdam.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“A Good Quality Hotel”", "Author": "xbisou", "ReviewID": "UR126511568", "Content": "The good: Very polite staff. For a 3 star hotel, it was of a high quality. The size of the twin/double rooms were quite roomy. Our bathroom was fairly new and spotless. The hotel offered free wifi in the room (but I couldn't make it work on my phone). 2 internet ready computers in the lobby and a printer... all free!! Hotel bar open until 1am. The bus (number 22 and 48) stops right outside the hotel. The not so bad: It's a 15 minute bus ride to Centraal station. â‚¬15.00 for breakfast.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Great service and nice atmosphere”", "Author": "MWalsh2908", "ReviewID": "UR126094720", "Content": "I was very happy with the service and the room. Staff was friendly and connection to central city is just in front of the hotel with the bus. They had a baby cot already in the room for the baby just beside my older daughter's bed. And the bed was even more confortable than my own.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Malta", "Title": "“Very very happy :)”", "Author": "Pilotesse89", "ReviewID": "UR125991377", "Content": "You can stop your hotel search here! My boyfriend and I must have spent 3 days going through hotel reviews and started getting very frustrated as almost all the hotels within our budget had something wrong with it. Eventually we decided to go with this hotel as it had one of the best reviews for our budget and honestly, we were NOT disappointed. The rooms are amazingly! Just what you see on the pictures! They are super clean, and the bed and pillows are ridiculously comfortable! The staff is really nice and the hotel is just overall lovely... even the breakfast was delicious! We paid 200euro for 3 nights B&B with Asda travel and honestly, it was well worth it! As other people have posted, there is a bus-stop literally outside the hotel and the buses are really, really frequent so you will have absolutely NO problem getting to and from the centre. Make sure you stop at 'Hempoint' Bus -stop and not at 'Spannerdijk' bus stop which is the name written on the hotel address.The Spannerdijk bus stop is only an 8 minute walk away from the Hempoint bus-stop (which is the stop right outside the hotel) but with suitcases it was a rather annoying walk after travelling for 8 hrs :) I'd highly recommend it to anyone else and would definitely go there again! (ps if you're on a budget, check out the Free Walking Amsterdam Tours)", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Crayford, null, United Kingdom", "Title": "“GREAT”", "Author": "Nikky G", "ReviewID": "UR123661333", "Content": "Very good hotel! Sooo big and has alot of services on offer. We hired out a moped for just 50 euros wich we rode to the center which is very very close! Absolutely loved the stay there! very comfy bed! Very smiley staff and a bar inside aswell!", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "lancashire", "Title": "“3 nights in a great hotel in a great city”", "Author": "fartmeister", "ReviewID": "UR123476871", "Content": "just got back after 3 nights, can't recommend it highly enough. very modern inside, walls covered in art makes it a really striking environment. buses run every 8 minutes from right outside the hotel into the city center until early morning, and every 15 minutes on a sunday, so don't worry about it being a bit out of town. staff are a credit to the hotel, particular thanks to christo, the bar / restaurant manager, and esther, reception, waiting on, general light entertainment for making the stay really special, laughed with them every time we went in the bar, which is really well stocked and similarly priced, and cheaper than some of the bars / dives we went into in the center of town. restaurant is a recent addition / upgrade from what christo told us, the quality of the food is exceptional, and again, more than comparable with city center eating joints, handy hint - dine before 7pm and have 3 courses but pay only for 2. as you can tell, liked it a lot and would go back without a moments hesitation thanks again, christo and esther, and everyone else at westcord hotels jonny", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "COVENTRY", "Title": "“Out of town but of a good standard”", "Author": "SRLeam", "ReviewID": "UR122661733", "Content": "Stayed here on New Year's Eve as was a better price than central hotels. Is a 15-20 minute walk depending on your walking speed into city centre but the number 48 and 22 bus stop is right outside the front door of the hotel and takes 5 minutes to get in, running until late. Hotel has a nice bar and restaurant area and though we did not eat breakfast it looked like a decent buffet spread. The decor is basic but bright and clean. Rooms are of a decent size (we had a triple room) and again clean with tea/coffee making facilities and good shower. It is over priced but it is in a major city and I have stayed in much worse for the same price. Staff are very friendly and helpful. Overall, the hotel is a decent choice for staying in Amsterdam as long as you are happy a little way out of the action.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stillwater, Oklahoma", "Title": "“Really good place to stay.”", "Author": "M B", "ReviewID": "UR121651644", "Content": "This is one of those hotels you hear about and you need to experience for yourself. This Hotels has everything going for it, Good service, Nice rooms, nice bathroom with good shower. Great Art by the Dutch Artist Herman Brood they even have his shoes on display and an artpiece motor bike in the Lobby. The restaurant has something for everybody and the Chef knows what he is doing great tasting food and also very nice to look at. You expect nothing less in an Art Hotel. The location is good for those who need to travel by car or when you need to use taxi or public transport everything is close. The price is good and this is one of those places you just need to stay at at least once.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Preston, Lancs", "Title": "“Excellent stay”", "Author": "JillyTPreston_Lancs", "ReviewID": "UR121480730", "Content": "We stayed 3 nights at the hotel this past weekend. We followed previous TA advise and caught the train from Schipol to Sloterdijk station (2 stops) and then 48 bus to Hempoint which is right outside hotel. It took no more than 20 minutes all in, much quicker than going right into Amsterdam central. We had room 612 with a view over the industrial estate opposite. The noise from the busy main road outside did not bother us. Breakfast was varied and hot. We did not eat any other meals in the hotel, but did call into the hotel bar each night after our night out in the city. The barmen were very pleasant, offering to make me cocktails (9 euros each) but worth it :-) Even though the hotel is out of the centre, having the bus stop outside the hotel made using public transport very cheap and convenient. We did purchase a 72hr travel card at Schipol with a return train ticket - cost 22.70 euro each. Would definately recommend this hotel.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cool hotel”", "Author": "FelixB4", "ReviewID": "UR121418745", "Content": "We just got back from this hotel after staying there for the second time in a couple of years. It's hard to pinpoint what we like about it so much, but there's something about the location (mile or so out of the town centre), the friendly reception staff, and the extremely comfortable beds that have made our two trips perfect. Highly recommended. I must just refer to the previous comment about the barman. We went in for a late drink the other night and the barman was very friendly and did a great job looking after us.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location great breakfast great hotel shame about bartenders and waiters .”", "Author": "Cynbin", "ReviewID": "UR120677883", "Content": "Reception staff very helpful,room was value for money,breakfast was very good for the price and better than expected.However the bartenders at night and wAiters in the morning were extremely rude telling me they were too busy to give out wine glasses and too busy cleaning to refill breakfast juice bearing in mind there was nothing else to drink!! Overall I had a great stay and Amsterdam is amazing .", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Fantastic!!!”", "Author": "lindivandyk", "ReviewID": "UR119966568", "Content": "This Hotel was absolutely AMAZING!! Stunning place!! Beautiful, clean, neat and tidy. Spacious and you actually get what they show you on the website. The rooms are fabulous. Location worked out great as there is a bus stop right in front of the Hotel and a bus running every 15min.. I can not praise it enough. We were extremely happy with the service and our stay was more than pleasant. I highly recommend it!", "Date": "October 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Value": "5"}, "AuthorLocation": "Harwich", "Title": "“Inadvertent Stay”", "Author": "GavRace", "ReviewID": "UR119781025", "Content": "Really enjoyed the trip here. Not a big one for long reviews so I'll make it short and sweet. Room was excellent, as was the company (R&O). Wished I could have stayed longer.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London", "Title": "“Way Below Average”", "Author": "busterjones33", "ReviewID": "UR119749572", "Content": "Booked through Easytobook, which described the room as 'Deluxe'. It wasn't. It was a bog-standard twin room with uncomfortable single mattresses and single duvets. The room was small and the hotel building itself was far from being a work of 'art'. When I raised the issue of the so-called 'deluxe' room with the hotel reception, they said \"it's not our problem\" and explained that I should contact Easytobook because they have advertised the rooms inaccurately. I was very disappointed with the whole experience. It is budget hotel experience for much more than budget prices. I recommend to stay away.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Average hotel, clean, decent nights sleep”", "Author": "chwb2003", "ReviewID": "UR119589631", "Content": "To be fair, this was only really a place to rest our heads so didnt really expect anything special. Reminds me a little of Premier Inn or Holiday Inn at best in UK. Reception staff werent exactly enthusiastic, seemed a little distracted but no trouble checking in. Beware though that Twin here means two single mattresses on ONE base. No too good for two single lads, I ended up moving the mattress on the floor to avoid waking up staring into my friends eyes. Rooms were clean, quiet and comfortable, pillows are a bit like cushions but slept well enough. Bit out of the centre and overlooking a large industrial estate and power plant. Buses run outside quite reguarly, would definitely recommend buying a travel card from reception. Found best way to get there from Schipol was train to centraal station which is about 4.20 euros and then get a 48 bus which stops right outside the hotel, I believe the stop is called \"Hempoint\". Theres also an hourly night bus after 00.30 which stops here and the travel pass is valid on this.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA, USA", "Title": "“Couldn't have been better!”", "Author": "ALfromBoston", "ReviewID": "UR118619502", "Content": "302 is the street number and Spaarndammerdijk is the street. This is a 3 star hotel. There is another hotel with the same name next door at 304 and that one is a 4 star hotel. My plane arrived at Schipol Airport at 6:00 a.m. and I got to the hotel about 7:00. I was pleasantly surprised that my room was ready and I could get settled right away. The front desk staff were exceptionally helpful in a number of ways such as selling me a bus and tram pass and following through on my request to have the minibar emptied out so I could put my own things in. The hotelâ€™s wi-fi worked perfectly but I couldnâ€™t get my iPad online. The front desk clerk showed me how to close all the apps to get it working. There are two computers and a printer available in the lobby. The climate control worked perfectly, as did everything else, including the sound-proofing. European hotels generally donâ€™t have ice machines but you can get a bucket of ice from the bar. They did a really good job keeping the room clean, replacing the towels, etc. On my birthday they left a nice card in my room along with balloons and a coupon for a free drink. As other reviews have mentioned, it is a 10-minute ride on bus #48 to Centraal Station and the bus stops in front of the hotel. At the second stop from the hotel there is an Albert Heijn supermarket, some restaurants and shops, etc. When youâ€™re returning to the hotel, you can get off there, do your shopping, and just catch the next bus for the two stops. (If you get a one-day or four-day pass, you wonâ€™t have to pay again.) From Centraal Station you can get a tram to the Van Gogh Museum (which is next to the Rijksmuseum), Leidseplein, Waterlooplein, the Albert Cuyp outdoor market (around the corner from the Heineken Experience), and, of course, the most fun place in Amsterdamâ€”Dam Square. You can also take a short train ride to Haarlem, a very quiet village outside the city, Edam, or even Paris. There are also several canal boat tours that operate at Centraal Station. There is no question that I would be delighted to stay at the hotel again. I couldnâ€™t have asked for a nicer stay.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Convenient and trendy”", "Author": "oegstgeest", "ReviewID": "UR115697855", "Content": "The hotel is modern, clean and neat. We appreciated the calm outside the city centre, away from the noice while just being at a 10-minutes bus drive from Centraal Station. Rooms and especially bathrooms are just great and well worth the price. The only unpleasant thing that needs to be reported is that the total amount of the bill was incorrect, not corresponding to the price announced upon booking, and that staff was unable to show an overview of what was charged.", "Date": "July 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Far from madding crowds”", "Author": "Calator438", "ReviewID": "UR114926964", "Content": "The hotel has normal size rooms, a bonus in The Netherlands but located outside city center. The acces to the city is via bus 48 with a station in proximity. The ride to Central Station is ~10 min. The bus arrives every 10 min or 15 min after 9 PM. A 24(7â‚¬)/48/72(15â‚¬) hrs can be purchased from reception. There is a good AC in every room and a fantastic huge pool in the back. Service is average and young receptionist may not necessarily speak fluent English; make good eye contact to determine if they understood you. Parking and breakfast are very expensive. If you do not mind public transit this business hotel is a more comfortable and cheaper alternative to a downtown hotel", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Lovely, relaxing and comfortable stay”", "Author": "Torontonian54", "ReviewID": "UR114903838", "Content": "After a gruelling flight from Toronto, it was a pleasure to rest and stay in that well appointed and furnished hotel midway between the airport and Amsterdam. The beds were good, the rooms were spacious, affordable and quiet. It was also easy to take a local bus to reach quickly and cheaply the city-centre. The staff was impeccably polite and accommodating. A very nice choice while visiting Amsterdam.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Great Value Hotel”", "Author": "Paulnd_01", "ReviewID": "UR112886880", "Content": "If you want a good quality and value close to Amsterdam city centre, then look no further thatn the Westcord Art Hotel. Staff are polite and provide excellent service, rooms are clean and comfortable and the restaurant serves good food. The hotel is about a 10 min bus ride to the city centre, but you will save around 50 euros per night on a similar quality hotel. All in all a great value hotel!", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mlada Boleslav, Czech Republic", "Title": "“Good hotel at acceptable distance from centre”", "Author": "ohorak", "ReviewID": "UR110459503", "Content": "We have got the room booked well in advance (2 months) so the price was at an acceptable level. So if you want the value for money, I suggest to that as well. The hotel is located approx 10mins bus drive from Central station. You can either take bus 22 or 48. I suggest 48 since it has a stop just in front of the hotel (during working days goes every 10mins and Sunday 15mins). We have spent there night only so cannot really comment on the services (we didn't take even the breakfast since it costs about 15EUR/person - it's a bit too much, isn't it?). Nevertheless, the room is big enough, bathroom with a bathtub with shower. After a long time I've seen such a full minibar (well surprised ;-). Beds are a bit soft, but I slept well due to tiredness without any backpain ;-) So if you find the hotels in the centre too loud, expensive, or are full and you do not mind to travel a bit by bus (10mins is not much) this hotel is a good option.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Look no further, this is the hotel with the best value for money.”", "Author": "LaoWan", "ReviewID": "UR109712690", "Content": "We just stayed there for 6 nights in mid May and were very impressed with the cleanliness, the services and the value for money this hotel provides. The hotel staffs were friendly, caring, unpretentious, yet kept your privacy in mind. The bathroom was well laid out and very convenient to use with modern designs and newer facilities. The hotel is located in a less crowded part of the city with easy access to the Central Station by Bus # 22 and 48. Overall, it's amazing to find a hotel in Amsterdam with these much to offer and in such a reasonable price range.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Decent 3* hotel”", "Author": "Metalactual", "ReviewID": "UR109096348", "Content": "Pros: Good size of the room, free safety box, free wi-fi with good sigal for check e-mail, good bed, good soundproof from outside / inside the building, except the below over the braserie. Fast & easy check-in & check-out. In the front of the hotel you have the bus station no. 48, to/from Centraal Station ( 30 min. including the wait time), or to the Amsterdam Sloterdijk ( an secondary train station ), good for Schiphol Airport or Haarlem. Cons: No breakfast for 105 eur/double - but to be honest, Amsterdam is an expensive location, I searched trough many hotels. We stayed on the first floor, over the Braserie and I heard on every night noises from below, moved chairs & stuff, around 3:00h a.m. The tv is an old 21\" CRT, not an modern LCD. Not light near safety-box, is hard to see anything inside the box. All in all I recommend this hotel. But for the Art, go to the museums, the city is plenty of them :).", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Good Stay at the Hotel”", "Author": "ElenaKiev1", "ReviewID": "UR107755349", "Content": "My friend and I stayed at WestCord Art Hotel 4*. in May 2011. Rooms sizes of the hotel are marked by letters L, XL. 2-person room is L size. It was a beautiful foom. We liked the glass bathroom with both a bathtub and a shower. To my opinion 20 euro for breakfast is a little too much. So we did not take the breakfast at the hotel and ate in the city. The bus stop is located near the hotel building and it takes you to Amsterdam Central Station. It is about 15 minutes ride. If you go by the same bus in the opposite direction you will get to Amsterdam Sloterdijk Train Station. So the location of the hotel is very good. The personnel was very helpful too. So the only thing that was upsetting - was the breakfast price.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Boussoit", "Title": "“Disapointing because very small room”", "Author": "hbenats", "ReviewID": "UR106996609", "Content": "I was extremely disapointed by my stay Booked a room thru internet and receive a very small and unconfortable room. (max 2 meters wide and about 4 meter lenght) Lukely internet acces was included in price Did not take breakfast and found out after having left the hotel that breakfast was charged in my room price. Agree that I cd have seen that before signing but ok, think it's first responsibility of hotel (corporate rate) By the way, 20 Euro for breakfast ? Spend about 100 nights/year in hotel. Not sure that i will book again at west cord", "Date": "May 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Verona", "Title": "“Nice place, silent and comfortable.”", "Author": "Simonecet", "ReviewID": "UR106197045", "Content": "Nice hotel,modern building, interiors in good conditions, We had the \"Deluxe Room\".It was very clean, the bathroom was very nice and very clean. The closet was just a space with a hanger for the clothes.Which is fine but I shall not call it deluxe. The staff helpful and competent.The room was very silent, I foud strange that the room door from inside it was not possible to lock. Only the cleaning staff could get in with a passepartout card, but if you forget to leave the \"do not disturb sign\" they may come in.So that made me a bit nervous hearing their noises in the corridor cleaning around. They come every day and make up the room. The bed wasn't one mattress but was two, separated , which makes it more difficult if you like to have some intimacy with your partner. It was too soft but still comfortable and we slept well. I've herad that that is a standard for dutch hotels. Breakfast was probably made of caviar and champagne because it costed â‚¬17 so we went to town. There are 2 computers in the hall with free internet and free wi-fi. I would reccomend this hotel to anyone but the price was quite expensive maybe because it was between easter and the Queen's birthday celebrations. Water is a theft, all over the city, a 0,5lt bottle can cost you even â‚¬2,50, so if you need water, behind the Dam Square there is a big Albert Heijn supermarket where you can roam through the typical dutch food habits and find a â‚¬0,20 bottle of water. The bus to the aiport is much more expensive than the train.And it takes over one hour, the train takes ony 20 minutes. The hotel is in the outskirts of town so you need to take the bus n.48,it stops just in front of the hotel, it's very quick (10 mins), to the trainstation.the bus n.348 with a different route will take you to the hotel, once every hour.Pls note that the 348 bus stop is not in same bus stop of bus n.48.check out the correct stop, there are works in front of trainstation so the bus stop might change.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Victoria", "Title": "“Terrific place to stay”", "Author": "Duzzy", "ReviewID": "UR105609256", "Content": "What a great little hotel!! The hotel is situated just 10 mins on bus 48 (bus stop right out the front of hotel) to the city centre. We had no problems commuting from our hotel to the city at any time of the day. Both days we were there caught the bus back late at night and felt more than comfortable doing so. The hotel is well appointed, a gorgeous Terrace bar and very kind staff always willing to assist in anyway they could. They have just refurbished another lounge/bar area but it was a few days away from opening when we were there. Wifi access was great and the rooms very comfortable and quiet. Breakfast was a little expensive however a great selection of foods. Would highly recommend this hotel if you are happy to stay a few minutes out of town, by the way it was 7euro for a 24 hour public transport pass. Oh and they also have options for late checkout too which helped us as we didn't depart Amsterdam until 3pm, I just emailed a few weeks earlier to enquire and received a response back in less then 24 hours.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "geneva", "Title": "“Pretty good hotel but next time we'll book earlier to find a more centralised hotel”", "Author": "mdang1986", "ReviewID": "UR103717209", "Content": "Hotel was nice. Room was clean, bathroom was amazing and service was alright. + room design, spacious, bathroom was brand new, comfortable, bikes/vespa to rent, affordable - not too far, but not central either..., housekeeping was intrusive, we booked a large double and got two twin beds pushed together - even upon request to have a double at the reception again.. the two beds were still 2 single covers, 2 seperate bed sheets... rather impossible if you are a couple... Overall, a positive stay but without bikes, public transport or taxi then its a bit out of the centre..", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great place to stay in Amsterdam!”", "Author": "redharvestmpls", "ReviewID": "UR99415727", "Content": "I booked this hotel as part of a trip through an online travel agent, and I also checked TripAdvisor to see other people's thoughts before booking. It was a great place to stay. It's true that it is not within walking distance of the main downtown area, but the bus ride to get into and out of downtown is easy and short, and the bus runs frequently, even at night and in the early morning. The single room was smaller than a typical U.S. hotel room, but it was in good condition, clean and quiet. The staff was very nice about answering my questions about the city and attractions. There were two computers in the lobby for guest use, which was very handy as I did not bring my own, and the breakfast buffet was excellent with lots of options. I would definitely stay here again, and I recommend it to others.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "birmingham", "Title": "“Nice hotel”", "Author": "ianjBirmingham", "ReviewID": "UR96727267", "Content": "We stayed in this hotel for 3 nights. Was very pleased with room, really comfy beds, kettle and hairdryer supplied. We paid 15 euros for a three day bus pass. We didn't mind the ten minute bus ride and regularly went in the dam twice a day. Only one gripe I've got is that when I arrived home and looked at my credit card account I noticed a hundred euro debit. I thought this was strange as I hadn't used it. After ringing my bank I found the hotel had taken it. I was not informed of this and after having to ring them at my cost I found out this is what they do. They hold onto money for two weeks then give it back to you. Obviously I'll also be charged a fee for this. Guests should be informed of this on arrival and I would of given them a cash deposit. This procedure of theirs has angered me. Apart from that moan a very nice hotel.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A very nice hotel”", "Author": "Dundeestoner", "ReviewID": "UR91385683", "Content": "I'd just like to say I've been to Amsterdam twice this was a much better but slightly more costly trip a modern hotel with almost everything u can need in a hotel ( not small an dingy like most central hotels).. Easy to get to from airport an there is a transfer service available on request which was very handy for a late night early morning flight, also transport to and from the centre is right out side the hotel u can have say a 45min walk of a 5min bus ride buy the day pass u can use any bus with one of then for about the same price it cost u there an back something like â‚¬7 an for a single fair ur I think â‚¬3.30.. Only stayed for 4 day an I'd be more than happy to say there again.. Very nice polite an helpful staff food is expensive so we never ate there but most of Amsterdam centre is expensive there are cheaper alternatives for food and plenty of then. So apart from the price of the food great hotel", "Date": "January 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Market Harborough, United Kingdom", "Title": "“Nice hotel and only a short bus ride into the city centre”", "Author": "BizFamMan", "ReviewID": "UR87396837", "Content": "We chose this hotel for the base of all our stag weekend activities and although concerned about the distance from the city centre, we need not have been worried. Buses (no.48 I think) run from outside the hotel every 30 minutes or so and there is even an a night bus (348 or close) which runs all night but less frequently. So we had no problems getting to and from the hotel - my only advice would be is too suss out where the night buses will pick you up as it is not the same stop as the day bus. 11 euro for a 48 hour bus & tram pass purchased from hotel reception. The hotel its self was easily reached from the airport (via taxi cost 6 of us 40 euro) and the staff were very helpful. We found the hotel very clean and secure all night, having a 24 reception to let you in. Even the hotel bar is worth a visit and we spend 2 hours enjoying many glasses of a beer called 'Palm' before venturing in to the city. We didn't op for the breakfast as once in the city you will find many places offering a full (but not 'traditional') English breakfast for around 9 euro. Or alternatively there is a BP garage just down the road if you get the munchies. Loved Amsterdam and was a much nicer city than expected. Good if you are a couple, family or just a group of friends like us!", "Date": "November 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Shame about the location, but fabulous hotel”", "Author": "Babelfish84", "ReviewID": "UR78386558", "Content": "This hotel is a little bit out in the sticks, but as my work in Amsterdam is just a short bus ride from here, my employer normally books me in here. I love this hotel. The rooms are funky, the paintings are cool, and service is always great. I have stayed here on numerous occasions so far and never had any issues, once I had a non-refundable trip but found my work had booked me the wrong days (Sun-Wed instead of Mon-Thu), I called up in advance and they changed it for me without any problems! The rooms are big, clean and with big windows. No nice views as such, but you get a good bit of sky. The bathrooms are very clean and a lovely bath and toiletries as well. Beds - fabulous, so comfortable! I have also eaten in the cafe a few times, their food is reasonably priced and very tasty, and their snacks are good too. The breakfast here is pricey (â‚¬17) but amazing, maybe not worth it every day but certainly as a treat. You could eat yourself full! The only thing letting it down is its location. If you are looking for a hotel in the centre of Amsterdam, I wouldn't really recommend it as it's a 10min bus ride or so away, it's not a problem but just not as easy. However, for anyone who doesn't mind, the hotel itself is lovely and well worth a visit, even just for the art!", "Date": "September 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Lovley Hotel But No Bell Boy”", "Author": "chelle10010", "ReviewID": "UR77038726", "Content": "Overall this hotel was pleasant, clean, and quiet, but there were a few quirks worth noting before someone should choose this hotel. I arrived with my boyfriend, we had six bags, and we were offered absolutely no help getting them to our room. Secondly we booked a large room, which was still seemingly small. Third the distance from the city center can be annoying at times. While there is a bus right out side of the hotel that goes straight to the city center in a relatively short amount of time, it is a nuisance to take the bus back and fourth. When you leave for the day you pretty much have to commit to staying out. You don't have the option to pop back in for a jacket because too much traveling would be involved. Needless to say we decided to stay another hotel in the city center for our last two nights. If you don't need help with your bags, are not concerned with room size, and don't mind a little traveling then I would recommend this hotel.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Coventry", "Title": "“Friendly staff, good location and clean rooms.”", "Author": "gdh200", "ReviewID": "UR75001793", "Content": "I stayed at the WestCord Art Hotel from 8 August to 11 August (travelling with my 14 year old daughter) and found it to be exactly what I wanted. We got a very good deal on Expedia. Â£262.60 for 2 adults (14 years is classed as an adult) for 4 nights averages out at Â£33 each per night. Location - 10 minute bus ride to Centraal Station. Buses run every 15 minutes during the day. We bought a 4 day pass for 25 Euros which also covered the trams and metro. Excellent value since we did on average 4 journeys a day. Get off the bus 2 stops early and stock up for breakfast at the supermarket - by the time you've done that, the next bus is due. Rooms - small but space enough to move around in, free wi-fi to help plan the day, free tea and coffee making facilities, mini-bar (get the staff to empty it so you can use it for your own food and drinks), air conditioning, television with stacks of channels including BBC1 and BBC2. Facilities - avoid breakfast at 17 Euros. Instead stop off at the supermarket. Free use of the public outdoor swimming pools. Beware - it's extremely cold but invigorating. Naked swimming up to 9:00 each morning - you have been warned. Staff - very friendly and helpful. They stored our luggage on our leaving day which gave us an extra half day to look about - it saved having to find and pay for storing it at the station. They stamped and posted our post cards - saved having to find a post office and work out how much the postage was - ok, little things but it all adds up. To sum up, great rooms, great service and good location - the bus ride to the hotel is no inconvenience at all. I'd definitely recommend the place.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Satun, Thailand", "Title": "“Average facility, below average location”", "Author": "Sens4life", "ReviewID": "UR72519553", "Content": "Room small but adequate, very friendly staff, two pools, two good restaurants and fast, free wireless Internet. The only thing I didn't like is the location. Situated outside of the downtown area, I didn't anticipate this being a problem since it was on the #48 bus route but the route is unreliable and found myself waiting too long for a bus that was supposed to run by every 15 minutes. On my date of departure I waited at least 35 minutes for the bus. Maybe I am nit-picking but I wasn't the only one who found this annoying. If you have your own transportation I'd recommend it, but for the rest of us I say get something closer to Centraal.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Constable Country, England", "Title": "“Quiet, clean, modern hotel”", "Author": "lifebeginsatfifty", "ReviewID": "UR67329645", "Content": "This was our second stay at this slightly out-of-town hotel. Just get the number 48 Bus outside Central Station, and within ten minutes you are there, just outside the main noise and bustle of Amsterdam. This hotel is clean and quiet. If you can, opt for a room at the rear of the hotel, with a view of the community swimming pools behind. The rooms are fairly small, but the beds are very comfortable and bathrooms modern. We didn't see anyone in the Restaurant all the time we were there, it was rather expensive. However, the Bar (or Terrace in good weather) offers good burgers and steaks. Do not be tempted into having the the very expensive breakfast. As there are tea and coffee making facilities in the bedrooms why not have picnic on the bed as we did.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Portugal", "Title": "“Good Hotel, good transportation to center”", "Author": "NMConceicao", "ReviewID": "UR61673149", "Content": "Quiet and modern hotel with a bus station just outside the door, about 7 stops until Central Station, every 25/30 minutes. Great breakfast; has a nice swiming pool (I didn't enjoy it). Staff was very kind, borrowed us free umbrella in a rainy day :)", "Date": "April 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Copenhagen", "Title": "“Redlight Luck”", "Author": "K3NN3T", "ReviewID": "UR52500909", "Content": "Westcord Art Hotel *** clean rooms friendly staff all the basics -no breakfast included (17â‚¬ pr.person i think) -twinbeds was a doublebed (1 frame/2 madresses) -no toking nor smoking -boring music in the bar", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice attractive hotel in a good location and good services!”", "Author": "Sharona6", "ReviewID": "UR47440823", "Content": "Even though the rooms were rather small it was still very cosy and comfortable. Most hotels like this in amsterdam do have small rooms anyway. The room was very clean and the only difference from this hotel to the golden tulip inn next door is that there is a glass bathroom and you get daily room service. The lady at the reception desk was very nice and the food was lovely but a little high priced but its ok when you are on holiday isnt it? Locations good too, bus stops right outside the hotel and it took us 20 minutes to walk to the centre (it was a lovely walk too!) I would reccommend this to anyone who would like to travel to amsterdam and stay out of the centre.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Bristol, England", "Title": "“Brilliant, brilliant hotel - location slightly out of the way though.”", "Author": "naturals", "ReviewID": "UR46116251", "Content": "I normally love digging in to hotels, however this place was superb. The staff were lovely, the rooms great, the restaurant in the evenings was superb (if a little expensive). The only thing that could be improved was the location - about 20min by bike into town.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Ryde Isle of Wight", "Title": "“Nice hotel”", "Author": "caulkheadmatt", "ReviewID": "UR40130616", "Content": "We booked this hotel online and got a very good deal. The hotel is located on a busy main road with a train depot behind, however in our room which backed onto the train yard we could not hear a thing. The room was a good size, nice comfy beds, large bathroom all very clean and modern. Also a minibar was provided which we didn't use. The hotel is not close to Amsterdam city centre, but I am told a bus departs from the stop outside. We used the train to travel around, and found it was a good 25 minute walk from the hotel to the nearest railway station which was Sloterdijk. However this station is a junction for many lines from all over Holland and has a train from Amsterdam Central every few minutes throughout the day and night. The hotel bar was in the style of an Amsterdam brown cafe and was really nice. It was lovely and relaxing with attentive friendly staff. Also the bar snacks, though expensive were very good. We didn't eat in the restaurant, so can't comment on this. The staff were very friendly and helpful, the rooms modern, clean and comfortable a nice addition being the art on the walls in every room. The only downside being the location away from the city. If you are happy with a bus ride or a walk to the local railway station then thats fine. It didn't bother us. Our room overlooked the swimming pool, and I found the naked swimmers in the morning quite unusual, maybe its a Dutch thing! Would stay here again as its a nice hotel, but you either need a car or bus pass to get into Amsterdam its self.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Coalville, England", "Title": "“Excellent and quirky - if a little way out of town”", "Author": "CoalvilleTraveller", "ReviewID": "UR39747127", "Content": "After arriving at Schipol we took a shuttle bus to the hotel, although our hotel was serviced by the shuttle bus service it was a long way out of town and certainly not walking distance (probably around five kilometres from central station). Having said that there is an excellent bus service which you can pick up from just outside the hotel. On arrival we were really impressed by the trendy look of the hotel. Whilst we did enjoy the 'brown bar' which is part of the hotel (and the food was excellent) it does seem a little out of place with the rest of the style. We booked a smoking room (when in Amsterdam) and although there was a a fusty smell this is to be expected. The room was large and well ventilated (we had a corner room) and overall was really well appointed. If you want very late nights and to stagger back to the hotel then this isn't the place for you (unless you want to pay for an expensive taxi ride). If you don't mind being a little way out of town you could do a lot worse than stay here.", "Date": "September 4, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Service": "5", "Location": "2"}, "AuthorLocation": "Delray Beach, Florida", "Title": "“Very Nice, out of the way”", "Author": "rickis", "ReviewID": "UR30294319", "Content": "The hotel was very nice and clean, as was the room. Bed too soft. Staff ver, very pleasant. No place to eat nearby, except at hotel and it was very expensive. Need a bus to get to Centraal Station.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "london", "Title": "“dont waste your time ...dirty,dirty,dirty rooms”", "Author": "adatheginger", "ReviewID": "UR29940618", "Content": "wery dirty rooms,courtains havent been washed for ages they have yellow almost brown color,carpet is full of stains,big hols in a sofa bed. hotel reminds me of movie ,,1984'' (Gorge Orwell ).there is nice pub downstairs.just dont waste your time...", "Date": "May 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“A worthwhile stay”", "Author": "woollysheep", "ReviewID": "UR29716755", "Content": "Lovely hotel to stay in with very friendly, helpful staff. Spacious, clean rooms with nice decor. Good transport link to City Centre right outside the hotel, only 10 minutes ride. Food very tasty in Art Cafe at hotel. Only downside is the overpriced breakfast. Other than that, would definitely stay there again.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Comfortable hotel, friendly staff”", "Author": "colmirl", "ReviewID": "UR27814590", "Content": "Stayed here for 4 nights recently and found it an excellent choice. Rooms/bathrooms were functional, clean and comfortable for a 3* hotel, staff were friendly and facilities were excellent. The only downside was the wireless internet - it sometimes slowed to a crawl in the evening. It's great that it's free, but the hotel needs to fix the bandwidth/capacity issues. The hotel is a little out of town - but the 48 bus to/from Centraal and Sloterdijk Stations is regular and stops just outside. The 348 night service also operates. It takes less than 10 minutes to reach the city centre, so it's not as far out as it seems. Alongside the in-house bar and restaurants there is a supermarket within easy walking distance which means you aren't tied to just what is on-site. I wouldn't hesitate to stay here again, all things considered - but I do hope they sort out their internet connection.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brasov", "Title": "“Excellent rooms”", "Author": "MarianTita", "ReviewID": "UR24559774", "Content": "Excellent rooms, very reasonable priced for what you get. Not the best area, but there is a bus stop right in front of the hotel. The bus takes you to the centre. Expensive breakfast, but nice breakfast. Nice hotel bar. I recommend it for couples. No real view from the windows. In summer it has a great swimming pool. The bathrooms are great. The beds are too soft. But overall it is a very nice place to stay. It is definitely worth its money.", "Date": "February 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "yorks", "Title": "“quiet and clean”", "Author": "bam49", "ReviewID": "UR19585322", "Content": "we were a party of three ladies looking for a triple room in amsterdam, and we found it at the Tulip Art. This was a clean and comfortable hotel, in easy reach of Amsterdam, and I would be happy to go back. It is a little out of town, but the bus service was clean, regular and convenient, being straight outside the door.", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "belfast", "Title": "“Great Hotel”", "Author": "fluffyBelfast", "ReviewID": "UR19053802", "Content": "Just arrived back from three wonderful days in Amsterdam.Stayed at the Tulip Inn Art . Although slightly out of the main downtown area, it proved to be a great choice. Excellent service from a very friendly staff, great rooms and a brlliant breakfast!!!!", "Date": "August 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Wonderful respite from an exciting, busy beautiful city!”", "Author": "Passtraveler", "ReviewID": "UR18444133", "Content": "Just returned from 5 nights at the Tulip Inn Jul 29 08 - best decision staying here! Arrived from states 11 am room ready. Front desk pleasant, informative and most beautiful english I have heard spoken in a foreign country. Check in a breeze - best rates at tulip hotels website. While a little inconvenient time wise (waiting for buses into city central) well worth the inconvienence. A new hotel, it is exceptionally clean, modern, roomy, comfy and overall very nice place. Room made up beautifully every day. Nice to have full tub to soak in after a long day of sight seeing. Pricey mini fridge in room, electroncially set - tell front desk you want to use it for your own supplies so you will not be charged if you remove something - they are happy to do this. Albert Heijn food store two bus stops up towards city center. Two city pools and park out back of the hotel for your use, are a pleasant and refreshing plus! Railyard in back of hotel never an issue - very quite place. Short bus ride to train station(s) City Central and Sloterdijk (sp). From airport during the day, take Central Station train and get off at Sloterdijk Amsterdam, go out front and take bus 48 - it stops right in front of hotel and is only a short, 10 min. ride. Make sure you check bus schedule if you have early flight home - weekend buses run later and longer between buses - taxi fare from hotel to train station 10.50 euros. Nothing much around this hotel, restaurant pretty pricey, outdoor bar nice - very quite location - would not suggest for young partying crowd that would be crawling back to theirs rooms late at night - lol - it takes some naviagting to get to the bus in the evening and some time to get back to the hotel, but if you are a little more reserved or have kids with you, and dont mind waiting on a bus once in a while - this place is a comfortable, affordable stay! Free wi-fi in room - what a plus - you must buy a pay card to use the internet in the lobby - we brought our laptop, For those that need something negative - yes, the doors do shut loudly - they did vacuum the hallways a little earlier than we would have liked them to one morning - but they did respect our do not disturb signs, and the modern design of the bathroom sinks reminds me of stainless steel prison sinks - there,,, Had wonderful trip - make sure you take short train ride out to Haarlem and to the beach - Van Gogh Museum a must to really get an insight into his short life as a painter - very interesting. Enjoy the city parks, museums and a local brew at any of the outdoor cafes along the canals - found Amsterdam to be very laid back and to be very beautiful, comfortable and friendly! Red light district a cultural must-see - very surreal, very safe, actually interesting, just very strange! You see all kinds wandering the district including many families and many, many tours during the hours of 8 and 10pm - Randy Roys Red light tour, , while we had to hoof it after our guide Ki-ki, who is quick-quick - was quite fun and entertaining! Enjoy!", "Date": "July 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Madrid", "Title": "“Better Than Expected!”", "Author": "Optima3", "ReviewID": "UR17009197", "Content": "I was pleasantly surprised that the hotel was so close to the center. We timed it. The bus takes 4 minutes to get to the city center. I could throw a baseball and hit the bus stop it's so close to the entrance. During the day and evening, the bus runs every 10 minutes. At night the bus runs every 30 mintutes. If the hotel is priced below other comparable hotels in the center, I definitely recommend this one. Here's the cool thing we did.... We rented bikes for the weekend to fit in like all the other Amsterdamers. It was amazing. I think everyone in Amsterdam rides a bike. We rode along the canals and went to dinner and the museums on our bikes. It was so romantic. Our bike ride each way to the hotel was....9 minutes. And it's safe with your own bike lane the whole way. We rented bikes in the center, but I think the hotel also rents bikes too through www.yellowbike.nl or ask the front desk. The hotel was new, clean and the beds were comfortable.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Decent hotel with one problem”", "Author": "Kaiser_Amir", "ReviewID": "UR16862615", "Content": "Stayed at the \"Tulip Art Hotel\" for one week from 19 to 26th of May 2008. I was in Amsterdam for work, alone, so I had made reservations for a single room. I was given room 601 on the 6th floor which was really tiny, similar to hotel rooms in Paris. However, it was very clean, had a mini-bar, a safe-box, nice, modern bathroom and air conditioning. The best thing about this hotel, especially if you are on a work trip, is that it has FREE WIRELESS INTERNET. This way you can stay connected all the time without going back home with a huge 3G internet bill. However, my room had one problem. It was placed right next to the entry door to the 6th floor. This meant that I could only sleep until the first guest on the 6th floor woke up. Why? Because when someone opened the door in the morning to head for the elevator, it would close with a big slam that shook the walls of my room! A few minutes later, I could hear the cleaning maids knocking on each door and saying: \"Room service\"! All this would start from 7:30, 8:00am! In my case, it wasn't really a big problem because I intented to wake up at around 8:30 - 9:00am anyways, but if you like to sleep til late, then you will have a nightmare, at least in the rooms which are placed next to the entry doors of each floor! The hot buffet breakfast was served in a nice saloon near the reception. It was decent and I had nothing to complain about. The \"Tulip Art Hotel\" is not located in the center of Amsterdam, but getting there is absolutely no problem. From Amsterdam's \"Centraal Station\" you can take two different busses that would get you to the hotel after a 12-15 minutes ride. I'd recommend bus number 48. You have to get off at the station \"Hempoint\" which is exactly in front of the hotel. Another option would be bus number 22. If you take this one, you have to get off at the station \"Koogstraat\", walk back to where the bus turned left and go in the opposite direction of the gas station for 3 minutes. One interesting detail is that if you want to simply open the mini-bar in your room you have to leave a 100 euros deposit at the reception. I did this since I wanted to keep the water I bought from the city cool and fresh. Of course, I was given my 100 euros back when I checked out. In conclusion, \"Tulip Art\" is a decent hotel, especially if you are travelling alone on a work trip. However, if I went back to Amsterdam for fun, I'd probably stay in another hotel, closer to the city center and the action.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Beautiful Property”", "Author": "Hotel_traveller32", "ReviewID": "UR14502553", "Content": "Wow. what a good little hotel. Staff are brilliant, room was a good size with no Coffee faciities but a cheap cafe downstairs in the lobby. Tea is 2 euros, coffee Latte is 2.25 euros. beds are very comfortable, with good quality linen. hotel is quite close to the railway and sidings but you cant hear them. there is a pool at the rear of the hotel not open in winter and its left to look a nasty sight, but im sure it will be good in the summer time. The staff are brilliant, courteous, friendly and professional. very swift check-in and check-out plenty of reception staff. No complaints about the hotel and would definately stay there again without a second thought. its out of the centre and served by bus number 48... not very reliable unfortunately but has a night bus too which is dead handy (buy your travel cards for transport as it includes the night bus number 353) 3 mins past the hour and 33 minutes past the hour form amsterdam centraal. if you need to know anything else please drop me a message. Have fun Preston and Carl", "Date": "March 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tyne and Wear", "Title": "“Very Nice Hotel”", "Author": "myholiday77", "ReviewID": "UR14241254", "Content": "I stayed in this hotel on my first trip to Amsterdam and wasn't disapointed, however, this hotel is not for you if you wish to be in the centre of Amsterdam as it is a 40 minute walk or 10 minutes by bus (numbers 22 and 43 stop outside). The hotel was very clean (rooms, reception, restaurant), staff were helpful and all speak very good English. The bedrooms are confortable and a re big enough to move arounf in, bathroom looked quite new and inside was very clean. If staying in Amsterdam I would recommend buying an 'I am Amsterdam Card' available at Tourist Information Office- the card is valied for 34. 48. 72 hours depending on how much you pay and gives you unlimited access on public transport, free access to many attractions and also discounts on many stores and restaurants.", "Date": "March 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Lovely moo cows”", "Author": "pompeydaz", "ReviewID": "UR13544463", "Content": "Nice place, well decorated. Spent some quality time in the bar there. Just my kind of place. Dark, you can smoke and get some good beers. Had a nice meal in the restaurant in the evening. They also did a lovely breakfast. The restaurant is very nicely decorated and there is ample seating. Free-WiFi access was ideal as I was there on business and could check my email without racking up a huge 3G bill with Orange !!", "Date": "February 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London, UK", "Title": "“Good value, but be prepared to take public transport”", "Author": "Expatastic", "ReviewID": "UR13495395", "Content": "I really liked this hotel for what we paid. The facilities are really nice, the only downside is that you can't really walk anywhere. There's a tram/bus thing that stops nearby, although it can be a bit tricky guessing where to get off on the way back (or maybe we were just enjoying Amsterdam too much). If you're okay with commuting that way, you're good to go. Oh, but important: the trams don't run very late, so if you want to have a late night, it might not work.", "Date": "February 12, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“Quality Hotel with Affordable Rates”", "Author": "SF-Coast-Traveler", "ReviewID": "UR13216950", "Content": "I recently stayed at the Tulip Inn Art - Amsterdam Hotel for three nights. The hotel is located about a 10 minute bus ride west of the Centraal Station in a residential and semi-industrial area. A rail barn is located behind the hotel, but the area is clean and quiet. I left the window open in my room at night and really didn't hear much train noise. If you take the train to Centraal Station from Schiphol Airport you will pass the hotel (left side of the train) approximately four minutes before arriving at the Centraal Station. The Tulip Inn is connected to the Golden Tulip Art hotel. It appears both hotels are run by the same management as they share a front desk. Based upon the brochures in the lobby, it appears the Golden Tulip has a more \"upscale\" product with larger rooms and better amenities. Nevertheless, I found my room at the Tulip INN to be quite satisfactory. The front office staff were very pleasant and efficient and were more than willing to assist with questions, recommendations and directions. The room was a comfortable size for a European hotel in the mid $$$ price range. I paid US$101 (inclusive of all taxes and fees) per night on Hotels.com. The room was spotless, the linens crisp and clean, and the bathroom amenities were nice. The hotel offers a full breakfast for 15 Euro in the restaurant. I did not experience the breakfast as I thought this was much too expensive. Overall I had a very comfortable stay and would highly recommend this hotel to anyone who doesn't want to pay the exorbitant rates of a \"downtown\" Amsterdam hotel or the overpriced mid-range hotels that often have poor quality rooms. Believe me, I know as I've stayed in several of these hotels! DIRECTIONS TO THE HOTEL (by bus): From CENTRAAL STATION: Walk out the main doors of the station towards the Damrak. Look for the \"HOTEL VICTORIA\" sign. It's located directly in front of the train station at the intersection of Damrak and Prins Hendrik Kade. Walk to the intersection BUT DON'T CROSS THE STREET! Turn right and walk about 75 yards. You will find a bus shelter there, directly in front of a kiosk for the Holland International canal cruise company. Wait for bus number 48. It runs every fifteen minutes from 0600-2000 M-Su and every thirty minutes thereafter until about 2400 hours. You will alight from the bus at the stop designated \"HEMPOINT\". The bus stop is directly in front of the hotel. Goto the GVB (public transit) website: http://www.gvb.nl/english/travellers/timetables/Pages/vertrektijden.aspx and select \"Timetable by Line\", then click on Line 48. I suggest stopping by the GVB office directly in front of the railway station and purchasing a 24/48/72/96 hour transit pass that is good on busses, trams and the metro. The pass is a good deal at Euro 7.00 / 11.50 / 14.50 / 17.50, otherwise the single ride bus fare is Euro 2.40. An alternative way to get to the hotel from the airport is via the airport shuttle which costs Euro 12.00 one-way or 19.00 return. You can find information at this website: http://www.schipholhotelshuttle.nl/site/home.asp", "Date": "February 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Durham", "Title": "“Nice hotel, a bit out of the way...”", "Author": "whiteke85", "ReviewID": "UR10107958", "Content": "About 15 mins from Schipol airport, in quite an industrial area, the hotel is fine. Clean, good value - all you can ask for really. Took about 15 mins by bus to get to the central station. Not a bad thing to say apart from the location ain't great if you want to see all Amsterdam has to offer.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doncaster, United Kingdom", "Title": "“Great at the Tulip Inn”", "Author": "scarletstockings", "ReviewID": "UR8590834", "Content": "We booked this hotel through superbreaks.com and got a great deal 4 nights for the price of 3. This is the 3 star hotel and not to be confused with the 4 star Golden Tulip Art which is right next door. The hotel is around 10 minutes by bus out of city centre, but to be honest its in a great location in that respect because it is really quiet. There is a bus stop just outside of the hotel (come out through the hotel doors and turn right..and its just down a little grass verge).The bus is the number 48 and comes every 15 minutes and is always on time! Reception were great, we arrived at 11am and you're not supposed to be able to check until 2pm but they found us a room straight away. The room was immaculate, quite spacious, lovely bathroom and the shower was fab and steaming hot. They have a tv with limited english channels.. but had bbc 1 and bbc 2 enough for background nois when getting ready to go out. Breakfast is continental and consists of various breads, rolls, croissants, a variety of cold meats and cheeses, scrambled egg, mushrooms and has browns and was really nice, enough to keep you going until lunch time. There is the restaurant which is a la carte. Do not make the mistake of eating in there, it is extremely expensive for what you get, you would be better going to the bar/cafe and having a burger which my partner highly recommended. Drinks in the cafe/bar are quite expensive but then Amsterdam in general is not that cheap, take plenty of euros with you. This was my first time in Amsterdam and was such a great experience that we're going back in April 08 and we will be staying at Tulip Inn Art again.. i would really recommend it to all.", "Date": "August 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Fabulous, Loved It”", "Author": "sukrita", "ReviewID": "UR8141022", "Content": "Very nice hotel more like a 4 star than 3 star. Excellent service, the hotel had kept a package waiting for us that we had asked to be delivered there. They were very friendly and guided us well throughout the city. Check in / out was very quick. Rooms are very modern, bit on the smaller side but very very clean. Bathrooms are very good, large although the door to the toilet is transparent (??) Excellent breakfast and only 15 euros a head so well worth it. Good location, bus stop is just outside hotel and the bus goes straight to city centre. Would definitely reccomend this hotel.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Truro, United Kingdom", "Title": "“very good modern hotel”", "Author": "knittycat", "ReviewID": "UR7006339", "Content": "Just got back from the Tulip Art in Amsterdam. Yes it is a little way out of the centre but there is a very good bus service, cheap and frequent from outside the hotel to the centraal station. Hotel is modern, clean and very pleasant, showers were excellent. Food in the art cafe was better than any we tried in the city, maybe we were unlucky but we couldn't find much that wasn't fried meat! The locals were extremley friendly and helpful much more so than say Paris or even London. We had a great time even if we did see some things that made us look twice! We also took the train out to Utrecht which was well worth the trip, half an hour on the train, like a miniture Amsterdam.", "Date": "March 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“pretty hotel, out of city centre”", "Author": "OWL364", "ReviewID": "UR5628788", "Content": "105Euro/night, booked at venere. LOCATION: out of the city centre. must take 15 min bus ride during day. night bus comes once an hour. not noisy, but a bit inconvenient. ROOM: was clean, not small but not super-spacious. double bed is actually two twin beds put together. bathroom was clean. room is modern. internet is 5euros/hour. restaurant and cafe are over priced...eat ur meals in the city centre. front desk customer service is good. lady at night was helpful with internet. no iron was available at lobby nor in room.", "Date": "August 20, 2006"}], "HotelInfo": {"Name": "WestCord Art Hotel Amsterdam***", "HotelURL": "/ShowUserReviews-g188590-d614078-Reviews-WestCord_Art_Hotel_Amsterdam-Amsterdam_Noord_Holland.html", "Price": "$111 - $255*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Spaarndammerdijk 302</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1013 ZX</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "614078", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/06/af/0d/art-hotel-amsterdam-3.jpg"}}