{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamburg", "Title": "“Typically old fashioned Berlin Hotel”", "Author": "Daniil M Posted by an Easytobook.com traveler", "ReviewID": "UR127256678", "Content": "Bed: very good, Breakfast: very-very good, Stuff: very nice, Building: charming, especially try the elevator Not very good: audibility of evtl. noisy neighbours next door", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Good value for a tight budget - a good alternative to a hostel”", "Author": "Dudel", "ReviewID": "UR124539183", "Content": "You get what you paid for and here even a little more. This hotel is worn, but it still offers good value and surprisingly good breakfast. Location is good. Not everything is working, but nothing is unbearable. Hotel is clean, but I never had a untidy room in Germany, not even in a 8 Euro single room in Bavaria. So if you are on a tight budget and are looking for a place to lay your head and don't need the atmosphere of a hostel, this is a good option.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“A nice hotel with good breakfast”", "Author": "Tanjuta", "ReviewID": "UR118564201", "Content": "I stayed as a solo traveller in Hotell Castell in September for four nights. I wanted to stay in a budget hotel at a reasonable distance from Das Deutsche Oper. The surroundings were elegant due to the Kurfuerstendamm Street. It took about 5 minutes to walk to the S-bahn station Savignyplatz. The friendly reception was on the 2nd floor. My double room was on the 3rd floor. I got three keys to the hotel: one for the street, one for the corridor and one for the room. The steps were steep. The old fashion elevator carried two persons. My room was spacious but the double and the extra bed took most of the space. The furniture was partly cheap looking. The bathroom was renovated. I had a view to a peaceful courtyard. The floor made some noise. There was a minor bad smell in the room. The breakfast room was nice and the selection of breakfast food was good. I could stay in this hotel another time if my main interest concerning the tourist attractions would be in this area.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kingsville, Texas", "Title": "“Nice Neighborhood - You Get What You Pay For”", "Author": "gabeha", "ReviewID": "UR106002194", "Content": "Castell Hotel is in the high-end shopping district right off a main street in Berlin. The high quality neighborhood combined with the low price and inexpensive parking are really the only things it has going for it. Park on the street and get a hotel street pass for 5 euro/day, some of the cheapest parking you will find in Berlin. The breakfast was acceptable, with slightly below average selection for this type of hotel, but enough to fill you up and get you going. The nearest public transit station is a few blocks away, with the palace and museums of Charlottenberg within a 15 minute walk and the Zoo within 10 minutes. One thing I found interesting (first time in Berlin, I don't know if it is this way everywhere) but everyone who worked in the hotel as well as all of the shops and restaurants in the neighborhood clearly spoke Russian as their first language. The desk clerk spoke an acceptable amount of English, but few other people on the staff/in the neighborhood did. Be ready to communicate the basics in German. When checking into the hotel, the hallway/stairway is usual older European building, could use to be updated, but charming with character. The first room we checked into smelled overwhelmingly like rotting urine. The second room only had a slight smell of urine. The rooms are a good size for Europe as well as the inexpensive price, but could use to be a little cleaner, with years of cobwebs on the ceilings and walls. We had a great set of huge windows that opened up into a large courtyard. The bathrooms looked as though they had been rennovated in the last few years and were average, but the water temperature would constantly change on your during a shower. As seems to be the trend with other people who booked through a discount website, I was put on the lowest floor in a hidden hallway, it is possible the rooms on the upper floor were a little nicer. To finish it off, we got a good nights sleep, were fairly comfortable, were fed well in the morning, all for about 1/3 of the average hotel cost in Berlin - and in a very safe and classy neighborhood. Everything considered, it wouldn't be my first choice, but I would stay there again when on a budget.", "Date": "April 28, 2011"}], "HotelInfo": {"Name": "Hotel Castell", "HotelURL": "/ShowUserReviews-g187323-d615483-Reviews-Hotel_Castell-Berlin.html", "Price": "$66 - $137*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Wielandstrasse 24</span>, <span class=\"locality\"><span property=\"v:postal-code\">10707</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "615483", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c6/c6/c6c6fb02de5c1d5f6efc7350f462e9cc6large.jpg"}}