{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“good value for money...”", "Author": "Eddie E", "ReviewID": "UR125402481", "Content": "I stayed two nights in the hotel... The staff are very friendly and helpfull... when i booked the room online i also confirmed with the management of the hotel that i get a non-smoking room, since they dont have many of them ... i got it and was pleasantly surprised.. Outside the hotel doesnt look really fancy, and the lobby is not that special too, but once u are in the room everything is fine... and as i mentioned before, the staff of the hotel are very welcoming and helpfull - Imad, Hicham (shift manager) and friendly lady with the scarf at the reception... i paid ca. 75 Euros per night for double room and it was worth every penny... its a 4 star hotel altough a lil bit outdated looking but well maintained.. I didnt try the food, but they have nice buffet lunch restaurant, and they have room service too... Its close to Deira City Center shopping Mall and of course not that far away from the airport... the big plus of the hotel is that u get a wi-fi free connection, since its is not the rule in Dubais hotels... many hotels in Dubai (over)charge you even nowadays for wi-fi, but this hotel no, and actually that was also one of the main reason i booked the hotel... since i think that free wi-fi nowadays should belong to the guest service... If you are looking for quite place you will be fine here, but if you look for a lil bit lively lobby or some bars you have to get taxi and go to other part of the city... but at the end I would deffinatly recommend staying in the hotel...", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very good hotel, nice and clean.”", "Author": "Maindak", "ReviewID": "UR125147462", "Content": "I stayed here while on business. a very good hotel, the rooms were very clean and the staff was very nice. it is a halal hotel that means there is no alcohol or night club. A very nice and clean atmosphere.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Best 4 star hotel in dubai”", "Author": "Siddiqullah16", "ReviewID": "UR121040930", "Content": "Very Clean and in walking distance to deira city center. Very near to airport - 20AED taxi fare from airport. Has a swimming pool. Plus you get free wifi.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "liverpool", "Title": "“Great hotel for stopovers”", "Author": "LiverpoolElaineS", "ReviewID": "UR120774002", "Content": "Stayed enroute from India to Uk. Stayed in room 7005 which we got on an offer so my value for money reflects price I paid. Located only a short distance from the airport. Very welcoming staff who were also helpful. Hotel beautifully decorated in Arab style. Located on a quiet side street near a mosque and close to Deira City shopping mall.Mall has a number of very pleasant and reasonably priced restaurants. The room was large, modern and very comfortable with lovely bathroom. It was absolute luxury after our trip to India. We had a problem with the aircon and a mechanic came within minutes to fix it. Only stayed one night and didn't use restaurant. Would recommend this hotel.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "philippines", "Title": "“Nice, cozy place to stay in Dubai”", "Author": "mcqe", "ReviewID": "UR119889560", "Content": "We stayed at Al Jawhara for 4 days after our pilgrimage in Isarel and Egypt. It was a welcome respite after a tiring but enjoyable journey. Rooms were quite small but it was clean and comfy. Buffet breakfast was very good and served wide variety. Staff were veery helpful. Overal stay in this hotel was pleasant. Would recommend to others!", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Karachi", "Title": "“Ideal for families.”", "Author": "Minar3", "ReviewID": "UR119245255", "Content": "If you are in Dubai with your family or for business there is no better place to stay than Al-Jawahara. Its neat , clean and most importantly free of alcohol. There is a mosque right in front of the hotel and the deira city center is a 3 mins walking distance. There is free wifi and the staff is extremely courteous. I have been staying at this place for the past 7 years and plan to for the next 7 as well.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“good”", "Author": "patrick p", "ReviewID": "UR119173284", "Content": "I have read the previous reviews and a deep sadness goes out to the person who was unable to have a bacon breakfast. Muslim hotel...bacon.... am I missing something here? The Location is close to the airport, rooms cheap at 300 AED (Arab Emirate Dinah) per night. I have found the staff very helpful and willing to answer all questions if they can and perhaps a little shy if they don't know the answer to the question. Some stranded travelers lamented that no shuttle bus from the airport was available...stranded you are not! I can see the tail fins of emirates planes from my window. Taxi from the airport costs 30 AED in colloquial terms a coffee and muffin. From the hotel to the airport is 10-15 AED. Minimum taxi fare in Dubai is 10 AED so if your trip costs 6 you pay 10. 10 Dinah is about $3. Dinner buffet at Al Jawhara Gardens (\"Al J\") was good - tomato soup yummy. We also ate at the Meridian down the road (sp?) which had a glitzier glam selection of food and a very elegant foyer but I think the food at Al J was more tasty and half the price. Has a pool on the top floor and a female only pool and a gym. I think it has a sauna also. Internet works well, occasionally there is a holding pattern due to overcrowding and log on takes 30 minutes but this happened to me only 1 time in the middle of the day. Air conditioners are great and to quote from Pat Benetar - cold as Ice. Shower, Bath and separate bidet rather than a hose/squirter attached to the loo. Room sizes were good. Windows opened not siliconed shut for that additional Dubai luft. Plenty of cabs sailing past no- need to wait long. Avoid the unmarked cabs associated to the hotels, stylish they may be but twice or thrice the price. There are restaurants and some coffee shops nearby An Italian restaurant just down the road near the Mosque. City Centre is a large mall within walking distance, good for money exchange and shopping, has electrical, fashion etc. Great coffee shop in the middle with an amazing White Forest cake. Seems to be patronized more by local than touristy types. Check out Dubai mall, taxi fare is approximately 35. A must do is the Dubai Marina at night time - have a meal, light up a tobacco pipe and relax for a few hours- taxi is 55 Dinah approx. If you aren’t used to smoking ask for the mild apple tobacco (I think its called) – it is very very mild wont make u cough and not at all like cigarettes. Al J is unashamedly a Muslim establishment. I was told gently when I arrived that there was to be no alcohol, and that single males and females are not to share rooms. If you are married - be able to prove you are married. Proof is simple, provide passports or documents with photo id and matching surnames. No matching surnames no bacon sandwich. If the weariness of marriage is scrawled over the both of you that might be proof enough... Al J isn’t a glamorous and ritzy hotel and not a lot of wow factor... for a less expensive hotel however it is good. I have found the staff to be friendly and helpful. As to that slightly 'out there' post in which the staff were accused of being illiterate (see previous posts) it is true English is not their first language but they were able to make themselves understood and had a desire to be helpful, and their English was a lot better than my Moslem which would make the non Moslem speakers illiterate I imagine? The staff was actually very nice and quite engaging. The young men had a dazzling smile probably aimed more at my wife than myself. Is this post too long, am sure I have breached all posting etiquette but am unable to sleep and so very tired. In conclusion it is a hotel that is a Muslim establishment, reasonably priced, down to earth accommodation, friendly, clean and economical. A welcome counter to the very materialistic nature of Dubai. I might in honesty say the décor in the room was a little long in the tooth but I paid for and bought a Volkswagen and to expect a Rolls Royce is silly. If you check in and don’t like it there are several hotels around the corner you can easily shift to, The Ibis and the Novotel are a 5-minute walk. The Ibis at about 380 AED doesn’t have a swimming pool or free Internet in the rooms, rooms are small and modern and nice foyer if foyers are your thing and internet at snails pace is free in the foyer. Try the AL J. for a more authentic atmosphere. If you don’t like it no problemo, scoot around the corner for a more western feel at the Ibis. Well it's time to go, my work is done here.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "iran", "Title": "“Best Location ,Nice and clean hotel”", "Author": "babakIran", "ReviewID": "UR119152719", "Content": "I think you can find this hotel as one of the best four star hotel in Dubai.It is near Deira city center , you can go there on foot. The breakfast and lunch acceptable and delicious. The staff are friendly and polite. The best part of Hotel is its room, They are modern and spacious with good furniture , They offer you coffee and tea free of charge. But you should consider this place as an Islamic place with its roles. In a nutshell I recommend it to everybody.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Comfy stay, Nice rooms, close to airport - Good Value”", "Author": "RayMamon", "ReviewID": "UR99041170", "Content": "I landed at 2 AM at Dubai and by the time I got out it was past 3 in the morning. A short taxi ride ($25 DH) from DXB. Check in was a snap but they do ask for your passport which was returned right away. They gave me a room on the 7th floor. Neat and clean room with Coffee / Tea maker, and a mini bar which I never used. Bathrooms were clean and well kept. Avoid the breakfast buffet (50 Dh), instead you could walk over (less than 5 min) to the Diera city center and have a nice buffet for about 20 Dh. I also converted currency there instead of the airport. It is also in a quiet area, no night clubs and is pretty much a family hotel as advertised. Staff were helpful and courteous. All in all a good 4 * hotel. I paid 540DH for my 2 day stay inclusive of 20% taxes.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "NYC", "Title": "“Beware!!! Worst hotel ever!!! Illeterate stafff!!!!”", "Author": "JBravo99", "ReviewID": "UR61021382", "Content": "I was on a business trip to Dubai for the first time and unfortunately my company booked this hotel for me, hotel staff is full of ILLITERATE Egyptians. I met a girl at my conference and she wanted to join me for the dinner and let me explorer Dubai. She was waiting in the lobby and i told her to come to my room and wait till i freshen up. After 5-10 minutes two stupid Egyptians people knocked on the door screaming SECURITY. The moment i opened the door the Egyptian guys started started yelling at me and they told me they will call POLICE coz i have a lady in my room!!!! i was stunned by this behavior. I replied them politely that she is my visitor and we are leaving the hotel in 5 mins and they said they will wait outside till i let the lady go out of my room. BEWARE OF THIS HOTEL", "Date": "April 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "london", "Title": "“Def. not a 4*”", "Author": "misspractical", "ReviewID": "UR16328752", "Content": "we had a few problems with this hotel- and these problems make that relaxing holiday a stressful one! transfers did not arrive, we even phoned fromt he airport, they kept saying the he was in arrivals, but checked many times (also it is difficult to miss someone dressed in bright blue). So that was complete lie, as i guess it costs them to get someone out there. on arrivals the staff, had the phone call and knew we were on our way, but check in- took an hour at the hotel. (the room was not tidy or ready). the staff were really unhelpful -asked about certain tours etc, they refused to help and look busy. They asked us to speak to the concierge every day.(every morning we waited for him at 9am!)The concierge was never there!! only got to saw him on the last day.Then he would not stop buggin us to get on the tours. staff refused to get taxis for u. Breakfast was ok. Room size was ok- bed was really UNCOMFORTABLE.Bath/shower was not the 4* standard u expect. The only plus point is that IT IS NEAR THE CITY CENTRE, WHERE U CAN ARRANGE TOURS .etc. Other wise the location is not great, taxis refuse to go there. well i have been to dubai many time, maybe the expectations are the same each time; but im starting to see a decline in the quality of service provided. But the places i would recommend are shei.Zayed road.jumeirah. and creek. this hotel is overall a 3*.", "Date": "May 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Perfect for transit stop”", "Author": "MissNicky", "ReviewID": "UR14132129", "Content": "We stayed here just one night as a stop-over between Paris and Melbourne. It is a 5min taxi ride to airport. Room very clean with lovely decor. Bathroom absolutely spotless and spacious with big fluffy towels, great hot water pressure, good amenities. Couldnt complain for a quick stopover. Breakfast was included in our rate. Although there was a good selection of cereals, bakery items and fruit, all of the \"hot\" food was stone cold as the burners underneath the trays had long gone out. It was also the first buffet breakfast Ive been to that has hard boiled eggs (in their shells) with no other egg variations and there were no sausages or bacon or tomatoes but instead crumbed chicken fillets and chicken nuggets which didnt look very appetising at that hour of the monring. Not that it mattered as they were cold anyway! So, a good, clean, well-located hotel but hopefully the breakfst situation will improve!!", "Date": "March 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Durban", "Title": "“Very good 4*”", "Author": "SAtraveller3", "ReviewID": "UR12484803", "Content": "We stayed at this hotel for 3nights. Staff were very pleasant and cuteous. Went out of their way to assist with anything we asked. Rooms are large and spacious and modern. Clean linen and fresh towes daily. Tea/coffee making facilities in rooms.well stocked Mini-bar. Hotel does not serve/keep liquor on site. Bathrooms were clean and well kept. Amenities a little sparse but housekeeping willingly supply more if requested. Did not eat in the restaurants but room service was good. Small downside is taxis are very hard to come by. My suggestion is if you know where you are going and when, arrange for a taxi beforehand.(private taxis are more expensive-try and get government taxi) Location is very good. City Center Mall less than 5mins walk away with shops and restaurants.", "Date": "January 10, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "london", "Title": "“They Were Useless.....”", "Author": "jamspips", "ReviewID": "UR10852925", "Content": "We wanted to go to dubai for a while now as we loved it the 1sy time we went, however the hotel we were offered was absouletly rubbish! 1st the transfers never turned we then had to fork out for a taxi, which they never refunded, we then tried booking day trips out but the excursion chap was never there to provide information. the consigee were rubbish never knew wat to say or do. the only good thing was that we were close to the city centre so we went to the tourist information and sorted it all out there who delightful and really pleasant. Thank fully we did salvaged our holiday otherwise we probably would have not seen any of the tourist sights.", "Date": "November 16, 2007"}], "HotelInfo": {"Name": "Al Jawhara Gardens Hotel", "HotelURL": "/ShowUserReviews-g295424-d615838-Reviews-Al_Jawhara_Gardens_Hotel-Dubai.html", "Price": "$81 - $218*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">PO Box 121711</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "615838", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2d/ac/2dac02ce4086d54c725ee570e2b6133a4large.jpg"}}