{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cumberland, md", "Title": "“not bad for the price”", "Author": "alison d", "ReviewID": "UR139608907", "Content": "hey there. i stayed at the rideau motor inn in august 2012 with my gma, aunt and two lil kids and myself. we did know there isnt an elevator so i made sure to book on the first floor. you still had to walk up a bunch of steps but the view is amazing and its worth the money.. the room wasnt anything special but it was clean. and very big.. its an older place so i wasnt looking for a million dollar room but the view was a million dollar view. ocean city hosted a laser lights show that i could see from the balcony so i didnt have to fight the crowd down below. and its in prime location. the pool was always very nice and clean and we were in it every day. you cant beat the location..it wasnt a bad hotel. if your looking for a nice clean place stay here. if you are looking for an expensive hotel with all new everything then id recommend going somewhere else. but i enjoyed it and will stay here again.", "Date": "September 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barnesville, Ohio", "Title": "“It's all in what you want.”", "Author": "brock201", "ReviewID": "UR137503432", "Content": "The room was clean and the staff was friendly, and we would definitely stay here again. It all boils down to what you want out of your hotel room. The room was not \"hear a pin drop quiet\" at night, but none of the hotels on the Inlet end of Boardwalk are, but it's quiet enough to sleep. The hotel doesn't have all sorts of amenities, but it's a nice little place to be when you're not on the beach. When we were there, Ocean City set off fireworks which were directly in front of the hotel, so we could watch them from the balcony and not have to fight the crowds of people there to watch them. If you want \"pin drop quiet\" then you shouldn't be staying at 1st and Boardwalk; stay further north. If you want a bunch of frills and extras, pay twice as much and stay at a chain hotel. If you want a nice, clean, simple room at a good price that just also happens to be smack dab in the carnival-heart of the Boardwalk, then stay here.", "Date": "August 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“I wanted to like this hotel...”", "Author": "Mamst256", "ReviewID": "UR135914362", "Content": "Our annual mini break to Ocean City, MD took us to Rideau Motor Inn for three nights. It was reasonably priced and at a prime location. Let me start with the Pros: - As mentioned, the location can’t be beat. We were located in the midst of all the action at the boardwalk. Also had an ocean front room. Loved sitting on the balcony in the morning and watching the waves and then again in the afternoon watching the crowd - The customer service was very good. Before, on arrival and when checking out they were helpful and courteous. - The pool looked nice. We didn’t go in, but it looked clean and wasn’t crowded. Now for the cons - I was concerned about security. They still use keys. Wouldn’t have been a huge issue but there wasn’t a safe either. We kept the DND sign on the door for our stay. Not that we didn’t trust the employees, but with no card swipe logs we wanted to keep the entry to the room at a minimum. - We spend most of our day on the beach so we really just need a place to sleep. However, the bed was TERRIBLE! I could feel every spring when I laid down. Every morning I woke up feeling achy. The overall room and hotel was worn down. But I expected that. In comparison to other hotels in OC it was priced low. If they swapped out the mattresses I would go back.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Harwood, Maryland", "Title": "“Great time was had by all!!!”", "Author": "pam018", "ReviewID": "UR135819902", "Content": "This hotel was great and the people there were very accommodating and pleasant. The only problem we had was the mass amount of steps to the rooms! They should invest in elevators as I love this place but don't know if I would stay there again due to all those steps!! Great location and very convenient to the boardwalk, beach and anything you want!! Rooms were very clean and large!!", "Date": "July 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland, United States", "Title": "“Enjoyed our Stay!”", "Author": "BLT4114", "ReviewID": "UR132746856", "Content": "Although it is an older hotel, our room was clean and comfortable. We had an oceanfront room on the lst floor...it was huge...lots of room to spread out. Balcony was very large and you just can't beat the location. Pool was clean and water was comfortable. Hallways and common areas were clean. Would absolutely stay there again!", "Date": "June 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Corning, New York", "Title": "“It's got what you need.”", "Author": "jdiegjdieg", "ReviewID": "UR131020996", "Content": "There was nothing spectacular, but we were satisfied. The pool is nice. It's not heated, and there is no kiddie pool (like the sign still says as of May 2012). This place is a little old and run down, but it is literally right in the middle of everything! The balcony overlooked one of the busiest places on the Boardwalk. OC has a new 5 story beach ball that they light up with a huge laser show every Sunday night on the beach, and it's directly in front of this hotel. We watched it from our balcony. I read some reviews about bad parking, but as of this date, every room has a reserved spot in the parking lot right by the pool. No issue at all. The maid service is pretty much \"do you need any towels today?\" But if you clean up after yourself, that's totally fine as far as I'm concerned. I will come back here again for sure. It's exactly what I'm looking for when I come to the beach.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edgewater", "Title": "“Great place to stay!!”", "Author": "Albert J", "ReviewID": "UR127995739", "Content": "We stay at the Rideau every summer. The rooms are big, and are kept pretty clean. Bathroom is a little small, but We can deal for 4 days. Awesome location overlooking the ocean and Board walk. Large ocean front is the way to go. Cant beat the price $239/night. Staff is very helpful. Try to get a room on the first floor, its a hike down the stairs to the boardwalk from the second floor. Nice pool that is kept clean. Private parking is also a plus. No need to drive everywhere, just park and enjoy!! Cant wait to go back this Summer!!", "Date": "April 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fayetteville, Pennsylvania, United States", "Title": "“This place is a joke.”", "Author": "Cole B", "ReviewID": "UR124633731", "Content": "So, my family and I have stayed there every summer for the past three years. The first year, before even getting to our room, we had to pass dried up puke in the hallways, which made the whole hall smell awful. This was not cleaned the whole time we were there. The second year we stayed there, our AC unit stopped working. The maintenance man had to replace it but had to wait until the following day. They gave us a small temporary room to stay in that had air conditioning. This room was filthy and dark. The third year we stayed, (Don't ask why we even came back let alone even a second time) They put a loud restaurant right under about 3 of the second story rooms. This place stayed open until about midnight or maybe even all night, i had to play music to muffle the horrible screaming and yelling that was occurring. So basically, this motel is dirty, more like filthy, not so greatly maintained, no elevator, poor utilities, lots of noise until very late hours, smells horrible, and just not worth it. For a few extra dollars you can stay at the Howard Johnson's on 24th street, with a much nicer hotel. Hope this made your decision for you, because once you go, you'll think, \"Oh crap, should have listened to that one review!\" because trust me, you'll hate it. Thanks. :)", "Date": "February 15, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "York, Pennsylvania", "Title": "“Rideau is fine”", "Author": "Rodfan", "ReviewID": "UR116776961", "Content": "It's clean, close to everything, the rooms are large. The pool is very nice and clean, always a parking spot. The price is very reasonable. Staff very nice. This is an old no frills motel. But you can't beat the price and location. If you are very picky, do not stay here. If you want a clean cheap room with a perfect location and great pool, this place is fine. Di", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Massillon, OH", "Title": "“Another great stay!”", "Author": "bsg5698", "ReviewID": "UR115871506", "Content": "Stayed at the Rideau Motel on the boardwalk between 1st and Division.WE SAW ALL THE DEW TOUR ACTION! Another enjoyable stay. Rooms have been updated with new curtains and larger fridges. Pool was GREAT on the too hot to deal with the hot sand days! Same price the last 5+ years for the LARGE oceanfront room $229 a night - NO AD-ONS for extra people! Call the hotel directly because center reservations adds-on for some reason the Rideau Management can't explain. Yes, the bathrooms are- well- old- but as I said before I can handle it for a week!", "Date": "July 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mechancisville, MD", "Title": "“Not Bad For The Price”", "Author": "2010CamaroSSDriver", "ReviewID": "UR103172312", "Content": "We go every year and stay here every year. The rooms are good sized. I do suggest bringing pillows but other than that, its really not a bad place especially for the price. The pool is nice. The balcony's are large. And they aren't strict on being loud and so on beings that we are a young crowd. Be sure to check out the hot tub though (which is now a flowerbed) haha.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Clean rooms but otherwise pretty run down.”", "Author": "LR1121", "ReviewID": "UR74933780", "Content": "We stayed here for a couple nights. The price is good for the location if you want to be close to the boardwalk rides and games. The beds were really uncomfortable and the rooms were pretty bare bones. The paper thin walls were a problem because every time someone shut their door it felt like someone was knocking on our door. Also we could hear the details of a domestic dispute in the room next door! I would recommend finding another hotel further up the beach from this one.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Gettysburg, Pennsylvania", "Title": "“Thieves working there..DON'T STAY”", "Author": "Marlen90", "ReviewID": "UR71570965", "Content": "Dont stay at this hotel. I left my purse in the room thinking it was safer there then leaving it in the beach while i went for a swim. When I returned to get my purse to go do some shopping in the board walk i notice my purse had been opened. I came to find out that there was a 100 missing out of it. I called front desk for them to do some thing and all I got was I cant do nothing. I never even got an apology for any of the trouble i went through .There was bugs on the towels and the bathroom was discusting. I called the desk again to let them know about the bathroom girl said ill be right up she never bothered comming up or giving us new towels..DON'T STAY IN THIS HOTEL AT ALL", "Date": "July 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Madison, Connecticut", "Title": "“Not worth the money for a well worn hotel.”", "Author": "mmckinno M", "ReviewID": "UR70899785", "Content": "My family & I have just returned from a 3 night stay at the Rideau Motor Inn. The positive side of the stay was that the staff was friendly & courteous, the rooms were clean, and the pool was clean & refreshing. The hotel is an old 4 story building with the rooms on the 3rd & 4th floors. There is NO Elevator only outside stairs for room access. The rooms are clean but well worn with bathrooms that are in need of replacement. The web site states that you get 1 car parking with the room but does not tell you it is $20.00 a night for an additional car even when the hotel is not full. After staying there I can see why they basically have a no refund policy, as we would have been looking for another place to stay after seeing the rooms.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Central PA", "Title": "“Good value for $ spent”", "Author": "46Dad", "ReviewID": "UR41322039", "Content": "When we go To OC, we usually stay around 20th St. and the Boardwalk, but this time we thought we would stay a little closer to the \"action\". We definitely did. There was a bar directly below our room which has a live band (at least on the weekend) and is very loud coming up through the floor. We are \"night owls\" and stay up very late so it didn't bother us that much. If you go to bed before midnight, do not get the first floor rooms at the South end of the motel or you'll have trouble getting to sleep with the band noise. Either get a room on the second floor or a room at the North end of the motel on the first floor. This is an older motel, but we found it to be clean and no musty or cleaning odors were noticed. If you are a \"people watcher\" the first floor has a balcony that overlooks the boardwalk at the perfect height (not too high and not too low). There is a very long distance between the motel to the ocean. We could always hear the ocean waves crashing on the beach from the other more Northern motels up around 20th St., but you can't hear the ocean from this motel. Would we stay there again? Yes, but I would get a room at the Northern end of the motel.", "Date": "September 13, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "center valley, pa", "Title": "“We love the Rideau!”", "Author": "erikac1041", "ReviewID": "UR38846267", "Content": "I have been staying at the Rideau for several years now. You just can't beat the location! Everything is right in front of you. I do think the place could use a little more updating than the furniture and paint. Other than that the staff is nice, the pool is great,parking is safe, there is a bar and funnelcake stand right underneath of you!!! We love the Rideau and will continue to stay here!", "Date": "August 26, 2009"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Rooms": "1", "Value": "1"}, "AuthorLocation": "Mtn. Lake Park, Md.", "Title": "“What a dump!!!!!!!”", "Author": "connies3699", "ReviewID": "UR35047567", "Content": "My husband and I drove to O.C. the morning of July 4,2009 to celebrate our 10th wedding anniversary. I was very tired because my I had just arrived back in the U.S. from Germany. We arrived at the Rideau Motor Inn and checked into room 204, when we opened the door I thought I would have a heart attack. The room was filthy, it had one little window which looked into another room that was completely gutted. The curtain rods were rusted, the sink in the bathroom was cracked and had a big seam of caulking on it. Then there was another sink outside of the bathroom, which was outdated and dirty. I'm a country girl,and come from a small rural area, I'm definetly not a fancy girl, or a rich spoiled girl, but this was horrible. I cried for two hrs. After I gained my composure, I went to the office and ask if there were any other rooms available and the unpleasant desk clerk said not until tomorrow and it will cost you $83.00 more,so the next day we moved from one horrible room to a less crappy room. This place should be called \"The Redo Motor Inn\", because it needs torn down and rebuilt. I can see why they don't give refunds, because once people check in and see the rooms, they would definetly check out!!! Dave and Connie Simmons", "Date": "July 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Winchester,Va", "Title": "“Poor for the money”", "Author": "DebbieWinchester_Va", "ReviewID": "UR32499861", "Content": "The room was very poor and needed a lot of make over. Very run down. Had a balcony and ocean front which was good. As much as the room cost they could at least replace the mattress which felt like sleeping on the floor. And bring your own pillows because there pillows there were so worn out that they were as thin as paper and lumpy. The service was poor. Would not stay again.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Massillon, OH", "Title": "“Best Kept Secret!”", "Author": "bsg5698", "ReviewID": "UR23022962", "Content": "The Rideau is the best kept secret in Ocean City. The recently updated NONSMOKING rooms are huge, the oceanfront balcony view is fantastic, parking is safe and steps from your room and the clean pool is great! Yes, the bathrooms need updated and it's a bit of a struggle hauling suitcases up several flights of stairs. However, if you are looking for a great value the Rideau can't be beat. Five women were very comfortable in their 5 night stay in the LARGE oceanfront room. Check out the Rideau website and their reasonable prices.", "Date": "December 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "wv", "Title": "“Good Place To Stay”", "Author": "lillbeck", "ReviewID": "UR22093099", "Content": "My sister and I stayed here for 3 days with 5 children, ages 6 months, nine, eleven and 2 fifteen year old girls. we had a wonderful time! our room was facing the pool and was the largest room i have even stayed in, it was easily the size of 2 regular rooms, our house keepers were awesome, sure the room was old but very very clean. The pool was amazing, and the location was ideal for us with all the kids. I will definately stay here again in the future, by far the best experience i have had in ocean in the past seven summers of going there!", "Date": "November 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pa", "Title": "“We enjoy our stays here.”", "Author": "seabreeze8", "ReviewID": "UR18219261", "Content": "My family and I stay here at least once a year. We enjoy the location and the staff is very friendly. Our children love the pool, and being right on the boardwalk is great. We like the seaside charm of this older motel!", "Date": "July 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Syracuse, NY", "Title": "“Worst room ever”", "Author": "lovethebeach133", "ReviewID": "UR17883013", "Content": "Stayed for a long weekend and would never, ever go back. The room smelled terrible -- very heavy smoke odor. The mattresses were ancient, uncomfortable and rust-stained from springs. The only window in the room was tiny and faced a wall. My sister and I spent as little time in the room as possible and will stay elsewhere in the future.", "Date": "July 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "York, PA", "Title": "“Decent hotel”", "Author": "RosieYork_PA", "ReviewID": "UR16640434", "Content": "Older hotel but you can see they're working to upgrade. We stayed in two ocean front rooms. The rooms were very large, had 2 double beds and a pull out couch that we did not have to use. The TV in our room was very old and the cable box did not change anything on the TV. When we told them about this they brought us a new TV. It is understandable they can't redo the entire place all at once but I did see a few new TV's in boxes when we were leaving and they were painting. The one thing I think they really need to improve on is housekeeping. There really is no excuse for zipping through the rooms and it really looks like that's what they do. The tables had sticky marks when we got there and they were never cleaned. Nothing on the coffee table was moved when we came back after the cleaning so it was obvious they didn't even dust it. (There were only 3 things on the table that could easily have been picked up.) The other issue that could be address immediately is burned out light bulbs and one light in the hallway that had no cover on it. I would stay there again if I couldn't find anyplace else because it is right on the boardwalk and I loved sitting on the balcony in the morning and watching the ocean.", "Date": "June 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New Jersey", "Title": "“Hated it!!!!”", "Author": "Surfer28", "ReviewID": "UR8458774", "Content": "Just stayed one night....we could not get out of there any quicker....arrive late ...around midnight and was charged alot of money ...for a digusting room....very dirty and smokey....the window of the room was in a very dark hallway.....I wish I never stayed there...but it was very late & we had been driving all night...never again...do not waste your money...not much fun bringing your luggage up the steps either!!!", "Date": "August 20, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "PENNSYLVANIA", "Title": "“Dirty, Disgusting, Old, Run Down (need i say more)”", "Author": "PAGIRL123", "ReviewID": "UR7482269", "Content": "We stayed there last yr for 4 nights and left on the 3rd night. It was my WORST hotel experience EVER!!! It was sooooo dirty and outdated. We had to wear shoes in the shower and never once laid our toothbrushes down anywhere. There were water marks all over the ceilings, flat sheets were used for fitted sheets on the brown mattresses, the ac barely worked, the tv was about 13 inches if that, the carpet was so old it was like walking on cement, the frig didnt work for the 1st day, the ice machine gave us water and charged you for it. We were embarassed to sit on the balcony because it was so dirty we didnt want anyone to see that we were staying there. I would NOT recommend ANYONE to ever stay at this hotel, you would be better off sleeping on a bench on the boardwalk in the rain!!!", "Date": "April 29, 2007"}], "HotelInfo": {"Name": "Rideau Motor Inn", "HotelURL": "/ShowUserReviews-g41298-d618382-Reviews-Rideau_Motor_Inn-Ocean_City_Maryland.html", "Price": "$104 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Boardwalk and N. 1st Street</span>, <span class=\"extended-address\">P.O. Box 220</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "618382", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/20/05/16/warm-pool-and-safe-parking.jpg"}}