{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salmiyah, Kuwait", "Title": "“great!”", "Author": "whitekrane", "ReviewID": "UR100862928", "Content": "beds were small and not very comfortable but in terms of atmosphere, price, location, safety, history, culture, staying here was wonderful. Eat cheap and exotic eats in their courtyard cafe and use the internet cafe.... I've stayed at much more expensive hotels in Dubai and I honestly could not say any of them were worth the extra price!", "Date": "March 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brussel", "Title": "“nice hotel, but you need a very open mind”", "Author": "flowergun", "ReviewID": "UR50598510", "Content": "The airport pickup was good, we found eachother very fast. Once in the hotel, I had a big family room for the first night, the boss his wife was sleeping in this room! She went out as I arrived, lucky enough there were some other beds in the room so I could sleep in a clean one. Breakfast was a good cop of coffee and some pancake, but dont expect a european breakfast. The house itself is beautiful and I enjoy sitting in the restaurant which was used by somalies. The second night I was in a normal room, but had some animals (small cockroaches) in my bed, this was really unpleasant. The third night my room was cleaned, there were not a lot of animals anymore but I still felt uncomfortable. The internet was not working, but on the balcony you could pick up a free signal. The neighbourhoud is awesome, the very old part of Dubai. Looks like india. If you are after partying, do not pick this hotel, since all the clubs and alcohol bars are in the new part.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "iran", "Title": "“information about Al-Hijaz Heritage motel”", "Author": "esmaeil", "ReviewID": "UR47096285", "Content": "Hi. I have spent a long time looking for a cheap place to stay in Dubai on a about 10 night, I heard definition of Al-Hijaz Heritage motel. Only I do not know the cost per night to stay and how to airport How far is Dubai. If someone is in this area to contact me by email. [--] yours sincerely, E.Rad", "Date": "October 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wales", "Title": "“Dubai on a Budget”", "Author": "BumblingIdiots", "ReviewID": "UR21998562", "Content": "My husband and I spent a long time looking for a cheap place to stay in Dubai on a 3 night stop over from south east asia. The Al-Hijaz was the best deal we could find. We had arranged an early morning airport pick up via email. Although we couldn't find the person to pick us up initially, he was waiting outside. We arrived at the hotel at around 6:30am and had to wait until 11am to check in, despite no one else staying in the hotel. We eventually checked into our room, which was very nice, quite traditional and basic, especially when comparing it to other hotels in Dubai, but comfortable. The major down side to the room was the mosque tannoy system directly outside our bedroom window. This made for a loud alarm call at 5am every morning. The breakfast was terrible, with no choice. An omlete and bread with tea or coffee. Some staff were friendly others were very grumpy. Overall this is a good budget option for dubai, though with a better breakfast and no tannoy at the window this would make for an excellent option in Dubai.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "KL", "Title": "“Local flavour with great value.”", "Author": "imkj", "ReviewID": "UR12970107", "Content": "This 5-room motel is a great value for money. I've yet to find a hotel in Dubai that can match the price for this hidden gem. It does not offer any of the usual 5 star hotel facilties; no 5 star dining, no swimming pool, & no butlers. What is does have is good friendly staff who were willing to go out of their way to help you. The rooms are clean. The acrhitecture IS Dubai, not the generic hotel rooms you get all over the world. This motel is within the Al-Ahmadiya/Heritage House Museum complex, thus giving the the phrase 'Night at the Museum' a reality. Airport transfer were provided, but we had missed him. My dad who arrived later during the day had no problems though. Point to remember, if the rates include airport transfer, get the motel's phone number and call them if you did not find your driver. He's there somewhere in the crowd of other hotel pickups. Location may be difficult to explain to taxi drivers, but simply tell them to get to the 'Al-Ahmadiya School Museum'. This disadvantage is also the plus point. It's in the centre of Al-Ras and within stricking distance to the Gold, Spice and Naif souqs. Photos of my trip to Dubai/Al-Hijaz Motel: [--]", "Date": "January 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "somewhere", "Title": "“A long way to go........”", "Author": "cadallaca", "ReviewID": "UR11684867", "Content": "A pick up service is purportedly to be available as stated in the email, but none when we arrived at night. Do direct the cabby to Al Ras , Al Ahmadiyya Museum about 40 AED. Cabbies can see the signboard from the primary road directing to the museum. You have to alight along the road as the motel is at the museum compound. We got to know this hotel through Lonely Planet Best of Dubai and got the help of our card concierge service to call them up. Location wise is good as its at the Deira souq area. You wont be bored at night. It has an internet \"cafe\" that is fully occupied at night with foreign workers from India etc. We were assigned a family \"suite\" which is spacious with clean bathroom. Dun expect nice curtains,beddings, carpeted floor and nice toiletries. But I certainly feel that it is overpriced even for a double. You can get a good deal for St George's,a hotel down the road, from priceline or octopus with all the services and other decent frills. . Regretted for choosing Al Hijazz. As a frequent traveller with experiences in living from a dinghy room with good service to a 5* accommodation. With a price of Euros $150. One could get a 4* suite room in a heritage hotel in Singapore, Marrakech, Istanbul and lisbon. These are the expensive cities that I've stayed more than twice. The plus point of Al Hijazz is that it is in a beautifully restored house. Service was of third world standard. It is a pity that YWCA Kolkata, India is even of better service from reception, calling of taxis,help and to the breakfast table. Big question...Is Al Hijaz an auberge de jeunes or heritage motel? Breakfast is just two strawberry jam buns for each person, coffee/tea and orange juice. we were offered cups of complimentary tea/coffee which were never served after waited for 40 minutes at the courtyard. We saw an Indian \"brewing\" the tea, gone, came back.... and its time for us to leave the motel. No offer is given to help with the luggage upon checkout except for a courtesy call for a cab. The cabby cursed the hotel when he had to wait 30mins along the road and was fined 200AED. No one at reception responded to the driver's call. We left with a bad experience of the poor motel service. A total ripped off!", "Date": "December 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Perfect for Exploring”", "Author": "chris8tine", "ReviewID": "UR7549185", "Content": "A great hotel for those looking for the authentic experience in Dubai. Located next to the Gold Souk, it was great for exploring. Air conditioned and with an internet cafe inside. Set around a quiet courtyard with no external windows (Yes, it sounds strange - but that's how it used to be!). Complete with lanterns and dark wooden furniture. This is not the place to go if you're looking for a relaxed beach vacation - but an excellent choice for backpackers or those just wanting a little something more.", "Date": "May 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good Budget Accomodation in Dubai”", "Author": "Marcus123", "ReviewID": "UR5498996", "Content": "On our way to Germany my wife and i decided to spend 4 nights in Dubai. I had heard there was alot of exciting things happening so wanted to have a good look around. The first thing we organised was accomodation and discovered that accomodation anywhere in Dubai is not cheap! After searching the internet we found Al Hijaz Motel (---), and given that we only wanted a clean place to sleep (as we would be out for most of the time) we booked it, the motel responded to our emails. Point to note, when you get to the airport head straight for the legitimate taxi rank (if your hotel cannot pick you up, Al Hijaz does not have a pickup service). Don't get suckered into getting into a \"private car\" like we did.Â It cost us AUS$30 to get to the Motel when a taxi would have cost half that! One thing i realised is that, not many people know where Al Hijaz is, so take along the address with you in case you have to tell your taxi the exact address. We found Alhijaz to be centrally located in Dubai, in the old city of Al Ras. You have to walk down a small walk way off the street to get to it. The building is a restored heritage building leased out from the goverment as a motel. Point to note, the website says 10% service charge, its actually 20% when you get there, but at the end of the day, much cheaper than most other places. Given we could not find any reviews on this motel, we were pleasantly surprised that the building was in quite good condition. I'd class it as budget 2 star, but what you get for your money is the chance to stay in a historic building with very large rooms, great atmosphere and a resonably modern bath room with shower and toilet. The door to our room was opened and locked using a sliding bolt and padlock (interesting). The room we stayed in had a great 4 poster queen and 3 air conditioners !!! All in all, if your after budget accomodation and just want something affordable and clean, Al Hijaz is a nice place to stay. While in Dubai we did the big bus tour, a great way to see the sights cheaply over a 24 hour period. Also point to note, alot of \"around the clock\" construction is going on in Dubai, and alot of it around the expensive resorts, so if your looking to stay in 5 star, many of the resorts especially along the beach front are surrounded by construction. Al Hijaz was not. Pro's Good location Good price North African Food prepared in the restauant is delicious! Internet cafe within motel is cheap and handy Room size is large and 3 air cons bed was confortable room was clean very safe Manager \"Sal\" very helpful and friendly Right next door to the famous Gold Souk Con's Alot of guests are north african, and although very friendly, some nights it was a bit noisy in the lobby area. Right next door to Mosque so expect the regular \"call to prayer\" wailing coming through the next door megaphones. Early morning call to prayer woke us up on the first morning. We had a great time in Dubai, one of our highlights was booking an overnight stay in the desert with Arabian Adventures called Starlight Express. It was unforgetable (if you dont mind roughing it a bit!) Dubai is a great place to visit, we would highly recommend it to anyone. We found it to be very safe.", "Date": "July 23, 2006"}], "HotelInfo": {"Name": "Al-Hijaz Motel", "HotelURL": "/ShowUserReviews-g295424-d618660-Reviews-Al_Hijaz_Motel-Dubai.html", "Price": "$114*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">15A Sikka</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "618660", "ImgURL": ""}}