{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stratford, CT", "Title": "“Good Location, But”", "Author": "mrfoxwoods", "ReviewID": "UR127621796", "Content": "We stayed at the Residenza Ki for 3 days. It has a great location, less than 4 minutes to the Trevi Fountain, and lest than 10 to the Spanish Steps. The hotel has no elevator. Front Desk personnel are available, at most, 7 hrs a day. Breakfast is typical Italian but the Breakfast lady is kind and helpful. The 2 rooms we had were rather small but clean. However the shower stall, no tub, had mold in many places. You obviously pay for the location as the room is not worth the price. Most of the furnishings in the room are so old, they should be tossed. At Best this is a 2 star hotel. Those on trip advisor who rated it as a 4-5 star hotel are delusional. this place needs a bulldozer but the location is prime. We would never stay there again..At check in they give you 3 keys. One for the door on the street, one for the door to your hall and one to your room. This certainly suggests that front test personnel are not available some of the day and all of the night. If you need a cab on the day you check out, you better have them call it in the day before because if you leave early, they wont be there to call the morning you leave. If you leave your screen less window open at night, you can hear the cars swish by in the adjacent tunnel... and bugs fly in", "Date": "April 10, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Heviz, Hungary", "Title": "“Warmly recommended!”", "Author": "Hegedus_Zs", "ReviewID": "UR127404614", "Content": "We stayed one week at the hotel and we were fully satisfied with everything. It is situated in the heart of Rome, close to the Trevi Fountain and the Pantheon. There are many good restaurants nearby. It is just a few metres from Barberini metro station. Our room was on the 3rd floor, which was quiet and well-furnished. There are free wifi and PC access. The breakfast was abundant and the coffee was tasty. The staff - Palmira and Diogo - , is truly great, very friendly and always willing to help. It's an excellent starting point to those who want to discover this magnificent city.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rehovot, Israel", "Title": "“great location, nice place”", "Author": "orendman", "ReviewID": "UR126976308", "Content": "just 2 minutes from trevi fountain and barberrini metro station. the colleseum is about 20 minutes by foot for those who like to walk, and you can use the metro ofcourse. Diogo, who stands at the reception office, is a very nice guy, and he helped us with great tips about where to eat and attractions at the area. there was a computer on each floor with internet, but the wi-fi signal in the rooms was unstable. we came late at night, after informing the hotel about that, but found the hotel closed. luckly for us we booked a pick up from the airport and the driver helped us get to a sister hotel nearby where we took the keys, and then he drove us back. to conclude, we had a nice time at a good place, but it is very important to inform people well ahead about what they are to expect if coming late.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grandview, Missouri", "Title": "“Great location, helpful staff”", "Author": "JJS856", "ReviewID": "UR126911195", "Content": "This hotel is situated within walking distance to all the main attractions Rome has to offer (five minute walk to the Trevi), as well as close to a Metro station (less than five minute walk). Diogo, the hotel manager, is full of information and helpful advice. He will set up taxi service to and from the hotel if you contact him prior to your stay. The other staff is also very friendly and welcoming. We felt like we were staying with family. Breakfast is not huge, but tasteful and sufficient. The coffee and cappuccinos are delicious and not to be missed. It is not the most luxurious or newest hotel. There are quirky things that may arise from this, such as spotty water temperature or a toilet that takes a moment to reset or a weak wifi signal, but all in all, we had an incredible stay and would highly recommend this hotel.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“very good location”", "Author": "Carmeng797", "ReviewID": "UR126177633", "Content": "the hotel is a small one but is in the hurt of the city and you don;t need bus or metro to visit rome.I stand 3 nights in the first floor is an quiet one,the breakvest is served on the second floor and it s a buffet with a great coffe and cappuccino,croisants,ham,nutella,milk,cereales.The lady which serves is very very nice.In the last evening we had a problem with hot wather it was a tehnical problem. I think I will return in Rome in this hotel.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sunny Hemel Hempstead", "Title": "“Not as good as expected...but ok”", "Author": "emgi99", "ReviewID": "UR125788245", "Content": "We stayed here for 3 nights over a weekend. I chose this hotel for location, cost and based on the very good reviews on tripadvisor. We caught the bus from FCO airport, cost 6 Euros each (usually 4 but the bus was just leaving so we paid the extra). From Termini station it was about a 20 minute walk to the hotel. Ok if you have light luggage or a bag with sturdy wheels! On arrival we were offered the sister hotel for one night as they had oversold. We declined as we were only staying 3 nights and didn't want to swap hotel mid-stay. I'm guessing a later arriving guest didn't get a choice. We were then given room 204. It was tiny! The window only opened onto the stairwell so the room was dark. Bed okay but with the flattest pillows I've ever seen. Unfortunately we also had a very noisy family staying next door and the walls were thin enough to hear every loudly spoken word. Bathroom also tiny but adequate. Room overall okay as we didn't spend much time in it anyway. Breakfast was simple but good - croissants, rolls, ham and coffee. Not enough tables if everyone comes down for breakfast at the same time so there was some hanging around one morning. The hotel is in a great location - 5 minutes to the Trevi Fountain and about 20mins to the Pantheon. There's a stop for the sightseeing buses about 5 minutes away which we used to get to the Vatican and back to Termini at the end of our stay. Loads of restaurants closeby so the hotel has a good location for resting feet and changing before embarking out for the evening. The Despar (Spar) is across the street - very handy for a pre-dinner beer as the cost of beer in the Rome bars and restaurants is prohibitive (6 Euros, compared to 1.59 in the Spar!) Overall maybe we were given the smallest, darkest room in the hotel. For location it was great, cost was competitive but on the basis of our experience I wouldn't stay here again.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Reasonably priced gem with a fabulous location & Staff.”", "Author": "mikhel", "ReviewID": "UR125610934", "Content": "We have just returned from a five night stay at Residenza Ki and can't recommend it warmly enough. The Hotel is in a fabulous location perfectly placed for walking to most of the major tourist attractions. We were astonished to be this close to the Trevi fountain for such a reasonable price. Rooms are of a good size, extremely clean (cleaned every day) and very comfortable. Breakfast featured pastries and the usual continental fare accompanied by juice and a good selection of hot drinks. Rooms feature flat screen TV's (some with English satellite channels) and the complimentary wi-fi has a strong signal. There are also a couple of free internet access points available for those without netbooks. What impressed us most about the Ki was the friendliness and enthusiasm of the staff. Diogo, the manager, provided friendly advice, useful information and was happy to arrange museum tickets and restaurant reservations. When we experienced a problem with our bathroom he sorted things out quickly and with the least possible fuss. Other members of staff were similarly friendly and happy to help. The only problem that we could see with the hotel was that its lack of a lift and multiple flights of stairs probably make it unsuitable for those with mobility problems. After a long days sight-seeing the stairs can be a bit daunting even to the more agile. In all other respects the Ki was a first class experience at great price. We would not hesitate to return.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Walsall", "Title": "“Awesome location for good price”", "Author": "brillwhensober", "ReviewID": "UR125355271", "Content": "Travelled to Rome with my fiancee for the Six Nations match against Italy. We arrived late at night and, as per other reviews, it is a bit of hassle to get the keys if your taxi driver doesnt speak English (!), but it is definitely worth it. The room we had was on the 3rd floor and was very clean and big by Rome standards. The bathroom was lovely. The room was cleaned everyday. Breakfast is basic but is just what is needed before taking to the streets. Make sure you have a chat to Diogo on the front desk even if you have been to Rome before as his restaurant recommendations proved to be brilliant! Location wise, this place wont be beaten, it is within spitting distance of the Trevi fountain and you can walk to all other attractions very easily. All in all, i would definitely recommend.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Amazing location, price...a hidden gem!”", "Author": "friends1178", "ReviewID": "UR124753052", "Content": "Just returned from a wonderful holiday, stayed 6 nights at Rezidenza Ki Rome during which time it snowed, something very rare for Rome. Diogo (receptionist) was extremely friendly and helpful throughout our stay, giving us advice and could not do enough for us. Diogo arranged transport from the airport to the hotel going via the sister hotel to collect our room key as Rezindenza Ki Rome does not have 24hour reception. Our room was located on the first floor which was very clean, fresh sheets everyday and quiet. We found the location to be fantastic and meant we could walk everywhere...even Vatican City only took 20-30 minutes passing by all of the main sights. 100% recommendation and we will be staying here again in the future. Very cheap for a centrally based hotel in Rome!", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Perfect place to stay over a weekend”", "Author": "DanyaV", "ReviewID": "UR123668178", "Content": "We've stayed in this hotel just for a weekend together with my girlfriend. First of all, location is perfect. It's just 2 min walking to Trevi fountain and to Spagna Piazza. Then, staff is very friendly, helpful and really professional. Rooms are nice and clean - ours was located on the third floor and it seems to be new as well as other rooms on this floor. Breakfast are not impressive, but still very decent. Summarizing - this is a perfect place (especially considering price) to stay over a weekend in Rome", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Trip to Rome”", "Author": "Ioanna T", "ReviewID": "UR123377359", "Content": "We had a difficulty in finding it (cause there was no sign and it is in the 1st floor of a building in Via Rasella). Cheap accomodation, clean rooms, relatively quiet, 5' minute walking from Fontana di Trevi! Good hotel for a 3day trip to Rome!!", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "South Shields, United Kingdom", "Title": "“Hidden gem”", "Author": "MelandDan", "ReviewID": "UR121997231", "Content": "My husband and I stayed at this hidden gem in November 2010. The hotel is quite difficult to find as doorway with tanoy only (no obvious signs). The room was on the small side but has all you need for a great trip. Lovely and clean too. The greatest part of this hotel is the location, all the major attractions are within walking distance. Trevi fountain is only 5-7 mins walk. I would certainly stay here again as we have fell in love with Rome.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“PERFECT!”", "Author": "Hlsad11", "ReviewID": "UR121959060", "Content": "We stayed here on our honeymoon and had the most wonderful stay! The staff are so friendly and helpful. The rooms are clean and the bed comfortable. We stayed in two rooms, one on the same floor as the breakfast room which was reasonable size, a small bathroom but comfortable and clean. We then moved to a room on the next floor (the owner gave us the option if we wished to have a quieter room when it came available) although we never found it loud we moved rooms anyway. It was much bigger and newly renovated! A pleasant suprise! The breakfasts were great! The best Danishes and croissants on our whole trip! Fresh every morning! The coffee is also delicious! We would definitly stay here again. We never used the train to get around as you can walk everywhere. We felt very safe. Great choice!", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jax, fl.", "Title": "“Very nice surprise”", "Author": "gilda", "ReviewID": "UR120974102", "Content": "We spend 4 days in this hotel. Really can't add much to the other great reviews. Location, location, location. We would walk for miles, and since the hotel is in the middle of everything, we would go to the hotel and take a 30 minute break and stretch our legs, etc. and then keep going. Also, so clean you could \"eat off the floor\". We know that this hotel has no lift (elevator) so it's not for those that can't climb. The hotel always smelled great, the bathroom was very modern, and the breakfast was very filling with great cappucino. The star, of course, is Diogo; he truly was wonderful. One of the nights there was a problem with the hot water and this young man didn't stop until the problem was solved. Please note that things like these can happen in any hotel at any time. Also, the hotel is not that hard to find at all and yes, it's at the end of a hill (there are a few of those in Rome, you know) but just take your time climbing. I really recommend this hotel in spite of any other negative reviews. Thank you for reading this review. G.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“perfect location”", "Author": "Valentina K", "ReviewID": "UR120909442", "Content": "Just returned back from Rome! The Hotel \"Residenza\" is pretty easy too find it. Before I start my journey I have read from a lot of people that's not easy to locate the hotel. Take the metro, stop at the barberini station go straight then left and at the next road \"Via Rasella 53\" is your hotel! Simply stupido...lol...anyway...The stuff is excellent very helpful and kind. The Location is perfect, nearby to everything, Trevi Fountain is 2 blocks away, right next to the metro, but I used it only to go to the Vatican everything else was by foot (my legs still hurts)!!! The rooms it's not something amazing but after all you just need a place to sleep. The breakfast is perfect the croissant filled with cream & chocolate, perfect cappuccino and a lot of other foods. The only disadvantage was that in one room the shower had zero pressure with result a we need about 30 mins to take a bath. The other room the air condition wasn't working at all and it was too cold. Everyday there was a maid and she was cleaning the rooms. That's all! I totally recommend this hotel for someone how wants to stay 3 or 4 days in the center of Rome!!!! Have Fun!!!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Redcar, United Kingdom", "Title": "“location location location”", "Author": "smon g", "ReviewID": "UR119683229", "Content": "this hotel is in a superb location, the room we had was very spacious and kept clean. The continental breakfast was good and plentiful. the staff are all very friendly and helpful. Diogo (pronounced diego) at reception was very helpful and friendly. this hotel is all about it's location. 5mins to the trevi fountain, 10mins to the Spanish steps, 20mins to the coloseum & 30>40mins to the Vatican. thats going at my wifes slooooow walking pace", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Excellent location but careful of the stairs”", "Author": "ScottishTeacher", "ReviewID": "UR118842698", "Content": "This lovely little place is more like an apartment than a hotel. Our room had a double bed and a single bed and was more than enough for the three nights we spent there. It had air conditioning (a must for Rome in the summer) and was clean and comfortable. The staff were charming and very helpful, and always able to advise on restaurants, directions and places to go. It's only a short walk from the Spanish Steps and the Trevi Fountain and we used this hotel as a base for walking to all of Rome's sights. It's hidden away so it's slightly difficult to find at first but it's on a very quiet road so no traffic noise to worry about. There's no lift so carrying luggage up the stairs could be a challenge if you weren't fit and healthy! Although I'm sure they would help if required. All in all an ideal place to stay for a city break.", "Date": "October 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rishikesh, India", "Title": "“Absolutely the best”", "Author": "Cathrine S", "ReviewID": "UR117967715", "Content": "We stayed at the Residenza Ki for 3 nights. Even from the day we booked a room we were taken care of. A nice e-mail from the hotel came shortly after reservation. They offered to arrange a pick-up service for us at the airport. Not only to avoid lose valuable time, but also because they said it is nice knowing there are someone waiting for you. And that is so true! The room was not big, but we had everything we needed: Bed, bathroom, shower, fridge, free Wi-Fi, and airconditioner. Just perfect! And: We arrived before the check-in time, but they were aware of that and had our room ready. The breakfast was really good, and the coffee...Mmmmm! The location could not be any better. Simply the best. But when all this is said I would like to say something about the man at the reception, in our case: Diego. If you are the next one to be one of his guests, you are just so lucky! I have never felt so good taken care of at a hotel before. You just got to like this guy! So all in all I can and I will recommend this hotel with my whole heart.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“We recommend this to anyone who wants to stay in the heart of Rome and is looking for a clean and comfortable hotel.”", "Author": "ZR123154913", "ReviewID": "UR117822784", "Content": "Although doesn't have an elevator, if you can manage stairs, help is available with luggage. Refurbished rooms are tastefully decorated. Staff is helpful and friendly. Plenty of hot water when we needed it. Air-conditioning worked well. Older building with character. We got there after reception closed but they kept it open for us as we were delayed. Internet on every floor and good security. Right in the heart of Rome, so convenient.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Place with Great Service”", "Author": "Darren B", "ReviewID": "UR117811609", "Content": "My girlfriend and I stayed four nights at the Residenza Ki in Rome and we were very happy with our choice. The room and the hotel were clean, there was free Internet and the breakfast in the mornings, although small, was very nice. The staff really made our stay even more incredible. The servers in the breakfast room made a fantastic cappucino and were very friendly each morning. Alessandro at the front desk offered us useful tourist information each day and allowed us to use his work computer to print off details of our trip. He was truly an amazing host and was incredibly friendly to us throughout our entire stay. He also kept our valuables safe in a lock box because there are no safes in the rooms. I can't say enough good things about Alessandro, especially after he left us with a bottle of Champagne in our room on our last night! I am convinced you won't find hospitality and service like this at any other Bed and Breakfast in Rome for the same price as the Residenza Ki. The hotel was quite and in a great location. The room was a good size and well air-conditioned. I would reccomend a room on the third floor so that you are not woken up by people eating breakfast in the morning. The hot water in the shower was a bit of an issue, but it does eventually heat up, although there isn't much pressure. This was the only issue we had during our entire stay and was nothing more than a minor inconvenience. This hotel is GREAT value for money and has incredibly friendly staff. I would reccomend the Residenza Ki in a heartbeat!", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“We loved it!”", "Author": "Gianluca6969", "ReviewID": "UR117211234", "Content": "We stayed at Residenza Ki for two nights. We enjoyed our stay. Location was perfect, walking distance from the main attraction of Rome! We rented a \"motorino\" just because we were so tired of walking around but we definitely didn't need it! We stayed on the 3d floor and rooms were very clean and very silent. Service was great especially breakfast! We loved Ms Palmira cappuccino and croissants were superb! Definitely a great deal for the price and location!!!!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Great base for exploring Rome”", "Author": "Charlotte P", "ReviewID": "UR117041327", "Content": "This bed and breakfast is in the perfect location to explore Rome. It is a short walk to the Trevi fountain and all of the main sites are walking distance, even the Vatican. Our room was a good size and the bathroom was clean with a good shower. The breakfast was nice with a selection of cereals and pastries and frshly made coffees. This isn't a fancy place, but it had eveything we needed as you do not spend much time at the hotel. The owner is very friendly and helpful and speaks excellent english.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Manchester", "Title": "“Great place to stay”", "Author": "Scotty118", "ReviewID": "UR116947113", "Content": "I booked last minute to visit Rome with a friend. He had already booked to stay here. We had to share a double as there were no room available, but that was no problem. Its only a place to stay and as long as its clean and friendly, what more could you want? Very friendly staff, Diogo was very helpful with advice ever time we asked about something. Nice breakfast in morning and good coffee. Really handy for getting around -- as everyone has said its an easy walk to the Trevi Fountain (great place to have an ice cream before going back to the hotel)", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, with friendly staff”", "Author": "eskimodave", "ReviewID": "UR116844137", "Content": "Located ten minutes walk from the Trevi fountain, this place had clean rooms and friendly staff. Look out for the big green door, as there's no indication on the front that it's a hotel. Nice breakfast in the mornings, and easy walk to the tourist buses and metro station. Rooms were rather dark and didn't have many facilities. For the price you could probably find something nicer nearby", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great Experience!!!”", "Author": "Tina K", "ReviewID": "UR116772367", "Content": "My friend and I recently stayed here for 4 nights while traveling through Rome. We have nothing but good things to say about this hotel! Great value for the room and location. You are close to a few attractions and the metro is easily accessible. The staff here is incredibly friendly and very helpful. Our room was clean and recently remodeled. After reading other peoples reviews where they are complaining about room size, stairs you have to walk up, A/C, etc… They should probably not be traveling Europe or go find a Four Seasons if you are going to complain about these petty things. I would recommend this hotel to someone staying in Rome.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Colorado", "Title": "“Wish I wouldn't have stayed here”", "Author": "ColoradoGina", "ReviewID": "UR116118238", "Content": "We stayed here July 15-17. Unfortunately it wasn't the greatest experience. To begin with, we booked a driver through the hotel to pick us up from the airport. Fortunately I printed the email the hotel sent me with the rate, because the driver wanted 10Euros more and argued with us. Apparently our rate was negotiated through the hotel and he wasn't aware of it. Also this hotel is in an apartment complex-something I wasn't aware of, so it didn't even look like a hotel. When the driver dropped us off out front and left, we had no idea where to go or what to do. We were relieved when Diego from the front desk cleared things up with the driver and then directed us into the hotel (apartment). Unfortunately there is no elevator so lugging our bags up three flights of stairs was no fun. Finally although Diego was very helpful regarding directions around Rome, the air in our room wasn't working-we told him about it but it never got fixed. All in all, terrible location, no elevator and no air. Not the quaint, airconditioned hotel it described itself as.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Great! :D”", "Author": "simenknudsen", "ReviewID": "UR116056556", "Content": "Well, I see people saying this is a bad place. we got the message this was an bed and breakfast. And it was Great!! Okey they do not have a big sign, but if you ask the cab driver, he pointed it out! The reseption guy, was extrimly nice and helpful! room was great, shower okay. I work in the navy in norwayand have to say i coming back. To everybody saing this is a bad place, well take a 4 star hotel. dont expect it from an B&B. This is a exelent stay 4 min walk from fontana di Trevi!", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Aud1230", "Title": "“Not a good experience - please choose somewhere else”", "Author": "Aud1230", "ReviewID": "UR115835554", "Content": "We recently stayed here for several nights and encountered several problems: 1. We arrived on the road, and the taxi driver dropped us off on the road and we couldn't find our hotel anywhere. We wandered down the road with our bags before figuring out that it was not labeled at all. There is no sign. 2. On the hotel's website, it says that reception is open until 10pm. We arrived at 8:30, and found a note taped to the unlabeled door that is outside that hotel that said \"As you can tell from our website, reception closes at 8:00pm every night\". They told us to follow the attached map to a sister hotel that was a 10 minute walk a way. They did not attach a map, so we were left in Rome, with our bags, at 8:30pm with no map. Also, when we figured out where it was, it was more like a 25 minute walk away, not 10 minutes. This was completely unacceptable. ***On a side note, the next night we came back to the hotel at 6:15 at night and saw a note taped to the door for another person that said \"As you can tell from our website, reception closes at 6:00pm every night\". However, whoever this was intended for did have a map attached. 3. I've stayed in a lot of budget accommodations. This hotel, while clean, had the worst bed I have ever slept on. It was similar to sleeping on a rough futon and I actually hurt all night while sleeping on it. It was awful. 4. The air conditioner worked, and was lovely. 5. For the 4 days we were there, we only had hot water 1 time. It was terrible, and nothing was done to fix it. It seems to be a problem over the past few months. 6. Our room, and another room, was actually IN the breakfast room. Our door was literally 6 inches away from the loud juice machine. This means that we were woken up every morning by lots of noise when breakfast was being set up (at about 6:30 am). Overall, this was an awful place to stay. It is in a good location, it is clean, but other than that I would not recommend staying there. We definitely wasted our money on this one!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Paramus, New Jersey", "Title": "“Disappointment”", "Author": "Nando738", "ReviewID": "UR115743527", "Content": "You start your trip by barely stumbling on the place because there is nothing resembling a sign or name. Then, you must walk up four flights, with luggage, to your room. We must say the room was extremely clean and the bathroom was nice. However, the shower was absolutely miserable. My husband and I have traveled Europe quite a bit so we are aware of the differences in accommodations (most often showers) but this was beyond ridiculous. The water literally trickles out and it switches from hot to cold. Location is decent as it is in walkable distance to most attractions (Trevi Fountain and Spanish Steps). With all the competition, you can definitely do better for your money.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Royal Oak, Michigan", "Title": "“Great location and comfortable place”", "Author": "Audra81", "ReviewID": "UR115593933", "Content": "The Residenza Ki is a great hotel near the Trevi Fountain. Diego, the desk manager for the three nights we were there, was great. The rooms had amazing air conditioning and excellent wi-fi, and the breakfast was a wonderful value. It's not perfect - the shower head didn't always stay on for us, and the plug in the bathroom did not work, but overall, this is an excellent hotel in a great location. Highly recommended!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Worst hotel ever”", "Author": "amess002", "ReviewID": "UR115574233", "Content": "Worst hotel ever. (And we loved all of our hotels during our Italy trip, and we stayed at mainly 1 and 2 star hotels.) Other than nuisances you can expect from most Italian hotels (no elevator and hotel not on first floor, queen bed is just two cots pushed together, TV has no English channels, strange location up a very steep street), there were two minor problems and two major problems that made this hotel a uniquely awful experience. Minor problems (frustrating but you can deal with them): *Air conditioning didn't work *Arrive past 4pm (when their concierge desk closes) and you'll need to walk 10 minutes with your luggage (mainly uphill) to their sister hotel, Saturnia. They'll give you your key, and then you're told to walk back another 10 minutes to Residenza Ki. (This happened to us, and, while apparently it's on their hotel's website, we were caught surprised because we booked through a third-party website as most international travelers do, and that website didn't mention this bit of information.) Major problems (main reasons not to stay here): *Building door lock jams randomly and can only be opened from inside *No 24 hour concierge desk (closes at 4pm) Because we dropped off our bags in our room and went out to dinner, it wasn't until around 9pm that we came back to the hotel and discovered the building's outside door was jammed. The Residenza Ki's concierge desk had closed at 4pm, but we were told (in perfect english) by their sister hotel Saturnia that we could call them at any time of night. So we called Saturnia about the door jam at the Residenza Ki, but no one there speaks english at night! Even better, when we got an Italian speaker from a local restaurant to translate for us, we were told by Saturnia they couldn't do anything right now!!! We had our bags locked upstairs in our hotel room, and we had to fly back home the next morning! While we waited over the next three hours, 8 other people staying at the Residenza Ki tried to get in with their keys and couldn't. We finally got inside around midnight only because one of the couples waiting with us had a sister in a hotel room taking a shower; we had to go down a dark alley behind the building, climb a grate, pound on her window, and finally she came downstairs and let us in. By the way, once we got inside, the front door lock didn't have any obvious problems with it, which suggests their building's front door lock is generally faulty and can jam on any hotel guest at any moment. Long story short, most Italian hotels (including the 1 star hotels) have 24 hour concierge, so why pick one of the few places without it? It was really the source of all our problems: we had to walk an extra 20 minutes with luggage to get our hotel key, we couldn't switch rooms when our AC wasn't working, we had no one to turn to when their buiding door lock jammed. It seems like a small insignificant thing if everything goes right, but a 24 hour concierge desk can be a lifesaver!", "Date": "July 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A very pleasant surprise”", "Author": "Emma496", "ReviewID": "UR115262497", "Content": "We booked last minute and had little expectation of the room, but the location was perfect so booked any way. Before even leaving to go to Rome within a few hours of booking we received an e mail from hotel with very helpful info and directions to sister hotel where we had to pick up keys. On arrival on a very hot day we had to make our way to sister hotel, as we were late arriving. (1930 hours) directions were good and took ten minute walk from train station. The stressful bit was finding our hotel and ended up getting taxi as we had, had enough by then. The room it's self was very large clean and a brilliant surprise aircon was awsome and really essential in the heat. Bathroom small but spotless breakfast good and staff very helpful would definatley recommend to friends and would stay again no problem", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Fantastic Location and Personalized Experience”", "Author": "sdandashy", "ReviewID": "UR115224604", "Content": "We had a wonderful time at Residenza Ki. Diego greeted us with such hospitality. He took his time in showing us where to go and what to do. Even was able to find us a tux rental place last minute for an event we were going to. Be advised, the style of the hotel can be best described as part of an apartment building, where they own several floors. Each floor has several rooms off of a main central room which has a computer for your disposal (very convenient!! a nice surprise!). The rooms are smaller, but as to be expected for any city hotel. It has recently been renovated which is great! The bathrooms are really nice. Only caveat, the water pressure in the shower is not so great. Otherwise, it's really really nice. Oh and the AC is really great! Perfect to save you from the summer heat! As it is an apartment style hotel, keep in mind that you will have to walk up a flight of stairs to get to the reception, and an additonal flight to your room. But it's really not bad at all. The location is SUPERB! We came from FCO on the train to the Termini, then took the subway to Barberini. It's three blocks form the subway, which is great if you a traveling on a budget. Now as for location to sights, it's super close to the Fontana di Trevi. Walking is great in Rome as you can get to so many places in 5, 10, 20 minute walks. It's certainly safe and clean for a big city, plus you get to take in so much! It's also close to the Spanish Steps and the shopping on Via Del Corso. We even checked out the Villa Borghese, which is also a close walk. For the price, it is totally worth it! We loved, loved, loved our stay there! Just keep in mind that it's not the type of place with a grand foyer, but it's such a personalized experience. You feel like you've got your own awesome apartment in ROME! I highly recommend it! ***Side note: Be sure to buy a Roma Pass. It's 25 euro and admission is included to TWO sites, then discounted admission to places you visit after. I highly suggest you use it for the Colliseum. You get the breeze by the 1 -2 hour line of people waiting to get in. SOOOO worth it! Also you get ulimitated use of the subway for three days!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice, basic, good location”", "Author": "Stuffy193", "ReviewID": "UR112919923", "Content": "We (2 adults, 2 teenagers) stayed here in late May/early June for 3 nights. I think it is a very nice hotel (more a B&B I guess), very basic and amazing location. We knew we were arriving late so were told to collect our key from their sister hotel, where the nicest man in the world was waiting for us - so helpful, he gave us a map and directions for an amazing place to eat (La Rampa, just down the road), and booked us a free taxi to take us to the hotel! The rooms were basic, just a bed and a tiny bathroom. One of our showers was a bit dodgey, the shower head kept falling off, but to be honest I could live with that for a few nights. The water pressure was also rubbish :S The man at reception was nice and friendly and very helpful, and the breakfast was good - croissants and fruit and eggs, nice orange juice, excellent coffee. At the end of the day, it's the location that sells it - so central! Trevi Fountain literally 30 seconds away, Spanish Steps just round the corner, lots of nice restaurants. If I'm going to be picky, these are the problems: 1. If you sleep with the windows open there is quite a noisy road/underpass nearby, but if you've spent all day walking around Rome that's not going to be enough to keep you up! 2. As I said, rubbish water pressure from the showers. 3. Don't turn up late and don't tell them because you'll be locked out and confused and have to go to the sister hotel. Just be organised and everything works out fine! And you get to meet the lovely man at the reception in the sister hotel!", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Brazil", "Title": "“Good location, confortable , very good experience”", "Author": "Carol024", "ReviewID": "UR110825212", "Content": "Good and simple hotel, located near Fontanna di Trevi and Via Veneto, nice staff. Clean and confortable, close to subway and major attractions. Generous breakfast.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great Hotel, Geat Location, Great Staff!”", "Author": "Tlong60", "ReviewID": "UR110746515", "Content": "We stayed at Residenza Ki for two nights in May. The hotel has clean and spacious rooms and the staff could not have been more friendly and helpful. We will definitely stay here again!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rehovot, Israel", "Title": "“fantastic location”", "Author": "rd431982", "ReviewID": "UR110558991", "Content": "The Manager, Diogo, was everything we expect from someone in the tourist industry - polite, helpful, friendly and courteous. As mentioned in other reviews, the hotel is perfectly situated and we were able to reach the main tourist areas on foot. The rooms on the top floor had recently been redecorated and the bathrooms were shiny and new, the bed sheets were crisp and white and the bathroom towels were fluffy.Breakfast was plentiful. We would unhesitatingly recommend this hotel for anyone who does not have a problem with stairs.", "Date": "May 30, 2011"}, {"Ratings": {"Overall": "2.0", "Value": "2", "Service": "2", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“Disappointing: Rome is a fantastic city but book something better than this hotel.”", "Author": "jeffacake", "ReviewID": "UR108771084", "Content": "My husband booked us a trip to Rome for my 30th birthday, which we were both very excited about. However, on arriving at Residenza Ki we were informed that a water problem on the first floor made our room uninhabitable for the weekend. Diago who greeted us at reception was pleasant enough and very apologetic. He explained that the hotel is old and that it's difficult to maintain. We've since seen a review on TripAdvisor that suggests that they may simply have overbooked... your guess is as good as mine. He put us in a taxi (which he paid for) back in the direction we'd just walked from to the 'sister' hotel - Hotel Saturna - which we were told was compariable. I have no idea if it the Saturna really is a compariable hotel because I didn't get to see what the inside of a room at Residenza Ki was really like. However, the Saturna was horrible. The room was small, it smelt of cheap air freshener, the bed was at an angle so your head was below your feet, the lights didn't all work so the room was dingy, the sheets has suspicious stains on them; the bathroom was tiny, mouldy and claustrophobic. There was also a pointless LCD tv that you couldn't actually see unless you would stood in the opposite corner of the room because of the angle it was sellotaped on to its stand at. Breakfast was adequate, but some of the offerings were stale. The staff, though pleasant, were a bit disorganised and sent us off in the wrong direction to buy opera tickets. Ultimately though, all of this would have been water off a ducks back as we've stayed in worse places as backpackers. But on this occassion we were not backpackers, we were away celebrating and although not expecting 5* luxury niether hotel was really up to the standards they advertise themselves at. Good points were, the location of both hotels. Residenza Ki is right by the Trevi fountain and the Saturna although near the Termini is also right by the Colleseum.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Excellent hotel . Very well located. Very nice people! Really good stay”", "Author": "187147Hello", "ReviewID": "UR105795839", "Content": "Excellent hotel . Very well located. Very nice people! Really good stay. We spent 4 wonderful days there! Coming back as soon as possible! Elisabeth", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "staffs, england", "Title": "“excellent hotel, friendly and clean, and in an excellent location”", "Author": "Bracken25", "ReviewID": "UR105184187", "Content": "When we arrived I was a little concerned as it was just a door in a back street, but when we went up the stairs I was very pleased it was clean , friendly and very helpful. I would recommend this hotel to anyone.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "leeds, United Kingdom", "Title": "“Comfortable hotel, excellent location”", "Author": "ceclemmens", "ReviewID": "UR103519502", "Content": "Travelled with two grown-up offspring. This hotel ticked all the boxes. Diego greeted us with a sightseeing map and info about local restaurants. Excellent location. Less than 5 min to Trevie Fountain and a little more to Spanish Steps. An ideal hotel for walking to most of Romes historic sights. Delighted to find that Rome is mainly flat. I have MS and my mobility is restricted and walk with a stick but managed with frequent stops. Would definately stay again. Will recommend to friends.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“exellent location lovely stay”", "Author": "bestravel2011", "ReviewID": "UR103006140", "Content": "Great hotel, great service, professional staff!!!!!Our room was cosy but with a lovely huge bed which was very comfortable. Everywhere was very clean and well tended. All the staff were very friendly and helpful with questions about the city. I would most certainly recommend this hotel to anyone visiting Rome as the location is perfect for walking to all the sights and to the bars and restaurants in the evenings. All in all a very pleasant stay in a lovely city.Special thanks to Diogo!", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Good value and set up for our high school girls group from U.S.”", "Author": "Abelian", "ReviewID": "UR100438200", "Content": "Two chaperone couples traveling with 14 high school girls from the U.S to visit Rome on the way to a conference in Genoa. We took advantage of two quads and two triple rooms as well as two doubles. Worked out great on the same floor with the breakfast room between the rooms. Rooms were adequate for our group even if there was a little shower overflow in one room as described by another traveler. Our plane was also late to Rome and the staff rearranged the service to pick up our group 7 hours later. We walked everywhere easily and took the metro to the Vatican and then to the Termini station to go to Florence. The desk staff also had the maid come early for breakfast for us and served all 18 of us in good time so we could get to the Vatican early. Overall good place to stay with a group and great service from the staff.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great little hotel in great location!”", "Author": "SianM75", "ReviewID": "UR99873189", "Content": "I wasn't expecing much from this hotel given the mixed reviews but I was pleasently suprised. Informing the hotel that I would not be able to make the standard check-in time, the hotel e-mailed me directions to the alternative hotel to pick-up the keys from. Slightly disconcerting that the person at this propoerty did not ask to see my confirmation but it was easy to find and then go onto the Residenza Ki. The rooms could be cleaner (the floor didn't seem to be cleaned) but the rooms are good with toiletries, haridryer and SKY TV. The air conditioning didn' t work too well but we didn't need it. Our room was in the breakfast area but we didn't get disturbed by this - if we had slept in late in the mornings it may have affected us more but my travelling companion was a very early riser!! The location of this property is perfect - 3 minutes from the Trevi Fountain and is on a quiet side street. There is a small Spar at the end of the road plus an English pub and lots of lovely local restaurants in the area. Don't be swayed by reviews about the area, if you are street-smart you should have no concerns about the neighbourhood. I would recommend this property if you are looking for a basic hotel in a central location.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Location was perfect and great price!”", "Author": "MSP_one", "ReviewID": "UR94799849", "Content": "Traveled with a group of friends and booked the quad room which was very spacey. The location couldn't of been better. Spent hours exploring the city on foot and this was the perfect spot to stay right near Trevi!! The manager was very helpful and nice. Definitely way better than the hotel near the train station that I stayed at on my first trip to Rome. Would absolutely stay here again!", "Date": "January 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "kaiserslautern, Germany", "Title": "“Great Location but disappointment”", "Author": "gatormom79", "ReviewID": "UR92740015", "Content": "Here is an honest review of this place. It seems it is being renovated, however, the room we got had mold on about a third of the walls in the bathroom. I was going to post pictures, but there is no need. I checked another room in this place and it was nicer than the one we were given and since people were moving furniture into the hotel, it leads me to believe it was being renovated. The double room, which we were given, is not for families unless you have teenagers or the room is for 4 grown adults. Everyone is nice, but if you need any assistance, it will be hard because they leave the desk at around 3:30 every day and then, it's like you are in an apartment building. If you need anything, you are on your own. Another suggestion...If you are planning to stay in a place like this during any holiday in Rome, they will not be around, and if they are, it will be hard to get them. Word of advice: Do not stay here with young children. It is perfect for a young couple or college kids. Comfort and Cleanliness: The mattresses are pretty thin compared to other European hotels. The window wouldn't close, which is, according to the manager, is \"illegal in rome\". After our complaint, we got a promise that it would be fixed so we could get a good night sleep, and still no repair. The street that this hotel is on is busy so it's noisy at night. We also had an issue with our shower. It wouldn't drain and when we complained about it, it, too, never got fixed. We just moved to another hotel because taking showers 6 inches deep in water was not fun. The rooms are clean, but because of the mold, couldn't give them an excellent. Location: The location is wonderful. This is the reason why we picked this \"hotel\". It is right down the street from the Trevi fountain and Spanish steps. Also, a grocery store is only a stone thrown away. There are other hotels in the vicinity that are much nicer.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Brilliant Location”", "Author": "jbell_79", "ReviewID": "UR92163868", "Content": "We selected Resedenza Ki because of its location. Right near the Trevi Fountain, and within half an hours walk are all the big tourist spots- Vatican City, Spanish Steps, Colosseum, Tratsevere... etc. We were told by reception that there were public transport links very close by to all these places, but obviously the walk is well worth it to see so much more. To put in a negative spin, the only 'problem' we had was the thinness of the walls. There are only a small amount of rooms, and you can hear whatever is going on in each room, very clearly. It really wasn't a problem to us, but it was to some. We took the advice from someone elses review and asked for a room on the first floor. Otherwise, the rooms open straight onto the breakfast area. Rooms and bathroom were clean. A small room, but thats to be expected in the area and is was very nicely presented- simple but attractive and it had everything we needed. We had breakfast on the first 2 days, but then skipped it, preferring to eat out. It was a decent breakfast though- cereal, breads, cheese and meats, croissants. Due to location, would stay there again.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Simply excellent budget accommodation. Total money worth!”", "Author": "SundeepMithran", "ReviewID": "UR91983085", "Content": "The hotel was a pleasure to stay in. the rooms were neat and tidy and is located 5 mins from a metro. So you can travel to anywhere in rome easily. Even the vatican is only a few metro stations away. Also, the gentle man at the reception is helpful and will tell you how to get around and plan your day. However they will try to coax you into a cab to the airport when you leave, its just way cheaper to take the metro. If you are looking for a neat budget hotel thats easily connected to the rest of rome by metro then this is highly recommended. Be warned though: the hotel is not easy to find.there are no hotel boards or signs. Take a print out of the google maps blown to maximum zoom in, and have the hotels number handy. Otherwise, highly recommended!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“you get what you pay for, cheap and cheerfull”", "Author": "Receptionist_11", "ReviewID": "UR91313097", "Content": "Upon arrival the gentleman behind recption was very polite and helpfull and talked us through the area and how to reach all the tourist hot spots etc. However the bedroom was not up to scratch. As I myself work within a Hotel i was disgusted to see the poor hygine standards in the bedrooms, unfortunately i did not get any photos but there was a very large patch of mold within the shower cubicle and our bed was held together with celotape! not so handy when you have a partner weighing over 13 stone!! the bedroom was small but perfectly adequate and did provide a television etc, Very Basic. The location however is GREAT! 200m if that from the trevi fountain, right in the middle of the hussle and bustle of rome allthough there is a very noisy tunnel right next to the hotel which kept me up at night a bit. Food: Basic! Breakfast very very simple, coffe and a small pastry at a stretch. All in all i would say great for young couples such as ourselves and people on a tight budget but if you can afford to stretch a bit id chose elsewhere.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“Disappointed...”", "Author": "nielmala", "ReviewID": "UR88732105", "Content": "I picked this hotel approximately six weeks prior to my visit after reading the reviews. It was a little difficult to find, but that was partially my maps fault. The sign is very subtle and easily missed. Francesco was very nice, but thank goodness he was there... His hours are 9 ish to 5ish, and not on Mondays. My full payment was requested up front, I guess since their office hours are so sparse. Breakfast was supposed to start at 0730. The first day, the lady didn't arrive until after 0830 and there was watered down juice from concentrate, hard bread and white American cheese in wrappers. Coffee was denied to guests. The second and third day, I opted to not even attempt breakfast since it was again running late both days. There was plenty of hot water after you let it run for like 10 min but the sink and shower did not drain well. I knew it would be a basic b&b, but the breakfast was ridiculous and the lack of staff attendance was notable. The only good thing was the location and vicinity to metro.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Norfolk, Virginia", "Title": "“Feel a little duped by all the positive TripAdvisor reviews”", "Author": "scasiello", "ReviewID": "UR86572678", "Content": "This was my family's first time in Europe. All the other hotels we had stayed in throughout our vacation, London, Florence, Reggalo, had been recommended to us by friends. The Residenza Ki was the only location we had to scout out on our own. We read through several reviews on TripAdvisor prior to booking. The Residenza Ki had very positive, in fact glowing reviews. When we got there, around 1:30pm in the afternoon, we had to climb 3 floors to finally find someone to help us, because the front desk is not \"manned\" on Mondays. We got our room. It was dingy, dark and cramped. It was my husband, my 10-year old son and myself. The room was supposed to be a triple but really it was a double with a sub par rollaway bed against one wall. There was barely room to walk between the armoire, the 2 beds and the wall. Our room was right outside the small checkin desk so we heard with some clarity every conversation that took place at the front desk. The front desk gentlemen were very nice and even arranged our ride to the airport. Upon our leaving, they offered a future discount if we went online and wrote a positive review. Perhaps this is the reason for all the \"great\" reviews we had seen. I don't know. It was the most expensive place we stayed the entire time we were in Europe and the worst quality room.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Exactly what we expected... and more”", "Author": "molley_pop", "ReviewID": "UR86013426", "Content": "It was everything we expected... the perfect location. The hotel is in a central area to EVERYTHING!!! We could walk anywhere (and did) in the city within 20 to 30 minutes. Before going to Rome I was very skeptical of the hotel. Originally when we booked it, it had many great reviews, but the month before we left the reviews were more concerning (ie. some say there is mold in the bathroom and the service is terrible). We actually got a great reception and introduction to the city by the front desk staff (he gave the best recommendations on where to eat). The first night we were upgraded to the hotel next door because the hotel was \"under renovation\", which may have been an overbooking; however, when we finally got to stay in our hotel it was perfect... for what we needed. It provided us a place to stay in the perfect location, we did not need a fancy room since we ARE in ROME and aren't spending a lot of time in the room. However, previous reviews made the rooms sound terrible... but it also seems as though these people may have been expecting too much. Anyway, it was perfect for us, and if you need a room (which was a decent size) in a central location and you want a great staff I would definitely recommend staying here.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Fantastic”", "Author": "mira_savic", "ReviewID": "UR85529389", "Content": "Fantastic location, close to all of the main sites. Staff were very helpful. Would definitely stay at Residenza Ki again.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Strabane, United Kingdom", "Title": "“Try elsewhere.....”", "Author": "Jmay", "ReviewID": "UR84812067", "Content": "Firstly we had to haul our cases up 2 flights of stairs just to check in. Then another 2 flights to get to our room. The guy at check-in was very helpful however he was only working the day we arrived. (reception is only open 8ish - 5) The remainder of the days we got the impression it was the owner, who was quite abrupt, especially when he wasn't busy! We were given a room through the breakfast room and were woken on the 3 mornings we were there by the lady who set the tables etc banging dishes from 6.30 on. We had a large enough room but the bathroom was tiny, particularly the shower - hard to wash your hair without banging your elbows off the wall or the shower door!! On reflection we would have been better paying a bit extra for better facilities.... thankfully we only had 3 days here but it was more than enough.... When on reception the owner spent most of the time trying to persuade people to get taxis to the airport that he would arrange with a particular driver - you paid the owner! When we did ask him to arrange a taxi for 4 of us plus cases which we'd left with him on our last day, he got us probably the smallest taxi in the whole of Rome!!!! Funny now but it wouldn't have been if we'd been in a rush. The taxi driver wasn't pleased that the person booking the taxi hadn't said about the number of people and the luggage so that a bigger car would be sent. Needless to say we know it was because the owner had wanted us to take his taxi to the airport and wouldn't listen when we explained we were going to Florence, via train and not the airport.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Great location, in a very friendly and clean hotel.”", "Author": "TheRiklyns", "ReviewID": "UR84426898", "Content": "We have just spent the most enjoyable week in the Hotel Residenza Ki. The location is fantastic, only 2 minutes walk to Trevi Fountain and most other attractions are very easy to walk to. The staff, Francesco and Diego were very friendly and most helpful. They offered great tips for sight seeing and restaurants. The rooms are very clean and the breakfast was good. Be very careful of the taxis from the station though. It is only a 10 minute walk but we were charged $45 Euro, maximum charge should be no more than approx $20Euro. We would highly recommend Residenza Ki, congrats to Franseco and Diego for helping us to have a fabulous Roma Experience!!", "Date": "October 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "england", "Title": "“Good location”", "Author": "polperro", "ReviewID": "UR84343906", "Content": "Just returned from a three night stay. The hotel is in a brilliant location just minutes way from the trevi and spanish steps, all the other sights apart from the vatican are within a 30 minute walk away Breakfast was great for a free one and the lady who does it could not do enough for you. The only downside was the room we had a twin (room 204), it had no window and was tiny although very clean, we asked to be moved the day of arrival when finally someone who spoke english turned up on reception we were advised we could be moved but not until the next day. Due to a hectic scheule of tours already pre booked this was not going to be possible so we decided just to stay there and put up with it. Overall the hotel was very good and as i have said you cannot beat the location but did not like the fact that their was not anyone there all the time. Worried that if for any reason the keys did not work of the three doors you had to get through there was no one there to let you in etc. Would probably stay there again if i was to return to Rome but would specify not in that room.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Appreciate the Value”", "Author": "lfeltus", "ReviewID": "UR84204756", "Content": "We are value-oriented travelers and felt we got a good value with this hotel. The room was a bit small, but it was clean and had a very comfortable king bed. A smaller bed would have given us more space but considering the small amount of time we spent in the room, I'd rather have the larger bed. The bathroom could have been roomier, but it was clean and, again, it was adequate for the money. We found the staff to be more than accommodating and the breakfast was plentiful. An elevator would have been nice, but not worth an extra $50 or more a day. Besides, exercise is a good thing. The location was quiet, yet very central for walking to the sites, catching the metro or getting to the train station. We truly have no complaints.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Burlington, Canada", "Title": "“Our treatment at this hotel was very poor and would not recommend.”", "Author": "DougandChris", "ReviewID": "UR83786057", "Content": "We had pre-booked (and pre-paid) our stary at Residenza Ki for four nights at the end of our Italy vacation, mainly due to the location of the hotel near the Spanish Steps and Trevi Fountain. When we arrived we were told that they had made a mistake and overbooked the first two nights and sent us to their \"sister\" hotel - the Hotel Saturnia, which they told us was a comparable. Far from it, this was a two star hotel closer to the Roma Termini. The only available room for the first night was so small that we could not even open our suitcases on the floor. The window was falling out and the bathroom was ridiculous (to sit on the toilet you had to put your feet in the shower). We complained bitterly and they did move us to a bigger room for the second night and finally back to Residenza Ki for the last two nights. We really felt like we had been scamed but there was little we could do as we prepaid the hotel on Expedia and didn't have any option. I would caution anyone booking this hotel to beware, as we felt that this was probably not the first time they had pulled this on an unsuspecting traveler.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bognor Regis, United Kingdom", "Title": "“Great Location, But Not The Best”", "Author": "angusmcwalsh", "ReviewID": "UR83648713", "Content": "Firstly, I have to say that this was an ideal hotel for us, and in a great location. With the Trevi Fountain and Spanish Steps minutes away and the rest of the torist attractions a short walk or bus ride away i dont think you could fault the location. The hotel is poorly sign posted and if you dont get transfers from the airport to the hotel door you may miss it. The rooms were samll, however, who stays in their rooms for long periods of time whilst on holiday. If you only want somewhere to get changed and sleep then this would be ideal. Dont expect too much and you wont be dissapointed. Understand what breakfast is on the continent and you will be happy with what you get. Cereals, pastries, biscuits, fruit, meat and cheese is a standard continental breakfast. So i was pleased with breakfast. Probably the only thing i was most dissapointed with was there was no tea or coffee making facillities within the room. I would have liked to make a cup of tea before going out or after an afternoon nap. So overall I was very pleased with our stay at Residenza Ki. Its not a 5 star hotel but it was perfect as a base for our trip. Thanks to the team for looking after us :D", "Date": "October 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Not bad for one night, but if staying longer, look elsewhere”", "Author": "JillyConQueso", "ReviewID": "UR83488723", "Content": "My travel agent booked this for us for the last night of our trip. After spending a week in Capri we needed to stay in Rome one night before our flight home. The location is amazing, on a side street about a block from the Trevi Fountain. We walked from there to Piazza Navona, St. Peter's, Castel Saint' Angelo and back easily. Finding the place in a cab from the station was difficult as it's on a side street and upstairs in a building. There was no one to check us in and the Italian-speaking housekeeper had us wait in the \"lobby\" for 25 minutes before a guy called and I spoke with him on the phone. This seemed unnecessary as the housekeeper then just handed us a key to a room that opened into the lobby. Our room was pretty spartan, however the AC worked very well (but was loud) and there was a small mounted flatscreen with lots of US channels. As we left to walk around my boyfriend slipped down the old marble stairs that were covered with cement powder from bags being carried up to the 3rd floor all day. There is no elevator. I believe breakfast is included, but our ride to the airport was before the serving time. The bathroom was tiny but clean and the shower was also very small but had great water pressure. The mattress was uncomfortable. I didn't mind this place since it was for one night, however I won't go back mostly because of the inconvenience during check in, the lack of elevator and the messy construction guys.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Friendly staff, great location.”", "Author": "hyperjumpingbeans", "ReviewID": "UR83189622", "Content": "Spent 4 nights at the Residenza Ki Rome, the location was great, walking distance to all places of interest. The staff were very friendly and helpfull, Francesco recommended a number of restraunts which were excellent. The rooms were spacious and very clean. I would have no hesitation in returning to this hotel.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Worst accomodation experience”", "Author": "xanthia12", "ReviewID": "UR82019889", "Content": "Arrived here at 8pm after walking right past it initially because it was so poorly signposted and on a quiet street. We found a note telling us that reception is closed, and to go and pick up keys from another hotel more than 1km away. We spent another 45mins hauling our bags around in the dark to pick up the keys. The hotel website clearly states that reception is open until 10pm. We confirmed with the management beforehand our arrival time and they said it would be no problem. The did not even warn us beforehand that they would be closed. During our stay, the manager closed reception early - e.g. 3pm or 6pm. We saw notes to other guests telling them to pick up keys elsewhere. Standard of accomodation is poor. Bathrooms were dingy, with mould in the shower cubicle, and shower drains which overflowed. Beds wereold and soft. Breakfast was substandard with stale croissants and old hard boiled eggs with black looking yolks. After the first day, we opted to have breakfast elsewhere. The only positive aspect about this hotel is the location which is within walking distance to the Trevi Fountain and Spanish steps. This was our one regrettable booking out of a 3 week holiday in italy. We couldn't wait to leave Residenza Ki. We recommend against booking here, especially if you plan to arrive in the evening.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Location, Friendly/helpful staff”", "Author": "jetsetterforlife", "ReviewID": "UR79979591", "Content": "i travelled to rome for the first time with my parents who aren't so young anymore. I found this place online and thought it would be ideal. Be warned there are no elevators and two flights of stairs to get to the rooms (no so good travelling with the oldies). Rooms were incredibly small but comfortable and clean. Bathroom impossible to get around in it and the hot water in the shower took several minutes to heat up (not ideal if your in a hurry, you'll be having a cold shower). AC was great and view was fantastic, we looked out in the street. There is a cafe next to hotel that stays open late but the shutters and windows are so thick it blocked out all the noise!! Best part, was the staff Diego is the most helpful and genuine man in Rome, he couldn't do enough to help us, showed us where to go and warned us about tourist traps and scammers. Breakfast was incredibly dull... although it is hard to find breakfast in Rome... they like sweet cakes and things like that. So would be best to eat b/f there. they have cereal and cakes and toast. Location was also a fantastic aspect of staying here. Minutes from Trevi Fountain and bus stops and train station (easiest railway system to work out ever). Although, it is very easy to get lost so always carry a map and a hotel business card in case you loose your way.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect location, very friendly service, great room - all in all 10/10”", "Author": "Gracie3055", "ReviewID": "UR78200910", "Content": "RESIDENZA KI WAS PERFECT FOR OUR STAY IN ROME. The hotel is very central, making access to any part of the city very easy - located just near Fontana di Trevi, everything is within walking distance. When I arrived at the hotel, I was greeted by a very friendly guy who gave me a map and showed me all the points of interest in the city which was very helpful. Throughout our stay, all the staff were very kind and helpful which made our stay all the more pleasant. The room was a great size and provided all we needed - we had a private bathroom which was newly built & very clean, a comfortable double bed, air conditioning and a TV with a few English channels. For the very reasonable price we paid, we couldn't have asked for more. RESIDENZA KI COULDN'T HAVE BEEN BETTER FOR THE FEW DAYS WE SPENT IN ROME AND I WOULD HIGHLY RECOMMEND IT TO ANYONE TRAVELLING THERE.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“More than expected”", "Author": "Lollyw81", "ReviewID": "UR78085219", "Content": "I stayed at the Residenza Ki Rome with 2 friends and for the price that we paid for our holiday, we were definately impressed with our stay. The first thing to mention is that the location is fantastic. Literally across the road from the Trevi Fountain and a further 10 minute walk to the Pantheon. We couldn't have asked for a better location. We were glad that we emailed to confirm our reservation before our arrival, as we were pre warned that we had to collect our keys from their sister hotel, a 10 minute walk away. When directed to our guest house we were told it was the Green door on the street, amongst about 5 other Green doors! The Guest House is not clearly marked !! The room for 3 adults was a Queen sized bed and 2 single which was perfect for us. The room was clean and comfortable but I would say that the air con was a little disappointing. It wasn't particularly powerful and although it was reading 16 degrees (the lowest it will go), it certainly didn't feel very cool, especially in the August heat! The staff are really friendly and as we checked in late, they made an effort to come and say hello and introduce themselves the next day. Reading the previous review I agree that if you're staying on the 2nd floor, be warned that you will receive an early morning wake up when the staff prepare for breakfast - and we stayed at the furthest room from the kitchen! Breakfast was ok for what you paid, although our only complaint would be that on our last morning there was only 1 croissant and a few biscuits left for us to eat. It was perfect for our first morning but they don't seem to replenish the breakfast after each day! Overall we had a fantastic trip to Rome and would certainly stay at the Residenza Ki Rome again.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great Service and location!!”", "Author": "becbig", "ReviewID": "UR76922700", "Content": "This hotel was in a great location next to the trevi fountain, the staff was helpful and friendly and the room was clean and spotless. Breakfast was included which was great to start your day of sightseeing", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Location, location, location!”", "Author": "KevinS20002", "ReviewID": "UR76633610", "Content": "Room was spartan, but clean. Staff was INCREDIBLY helpful and nice! I'd been initially worried, given some of the reviews online, but it became clear that those reviewers were either very picky or very unrealistic. This hotel is STEPS to the Trevi Fountain, and it's very affordable. I would recommend to friends and family.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sunderland", "Title": "“Great Location but few issues”", "Author": "JPGSunderland", "ReviewID": "UR75603671", "Content": "Stayed over for a long weekend in August. Firstly this hotel was in an excellent location - situated only 5 mins walk (max) to the trevi fountain. The room was basic but clean which is what we expected. I was however a little disapointed with the Air-Con. This was working as far as i could see however it was of little help. It was set to the lowest temperature but didnt appear to be blowing any cold air. This made the nights sleep very uncomfortable. Breakfast was really nice -exactly what we wanted before a days exploring. My advice would be to ask for a room on floor one as every morning at around 7am the maid woke us up by preapring breakfast in the breakfast area which rooms open onto on the second level. Not a lot of noise but enough to wake you up from a nights sleep (however this was handy on a positive note as we had no alarm). Lastly if you check in late be prepared for a 10min walk to the sister hotel to pick keys up. I did email the hotel stating we were due to arrive late and asked for the sister hotels address to go straight there however heard nothing back. This would have been helpfull and i suggest people email ahead in future to save some time. Overall great basic hotel to explore rome at an affordable price.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florence, Italy", "Title": "“The best place to stay at in Europe”", "Author": "sigaleibo", "ReviewID": "UR73438348", "Content": "The hotel is bed and breakfast hotel the best one we have ever been in! Me and my friends found this place on the internet we arrived to the hotel with very low exceptions but were very supriesd to find a wonderful place with a very nice staff the room was so comfortable and clean we loved it The hotel is located in good Location near to the center . the thing that makes this place most special is the staff that was so very nice to us and took care of our every need was very patient with us and with all the questions and requests that we had. Each morning there is fresh coffee and a very nice breakfast even the lady from the kitchen was so nice!! i have no words to describe the kindness of the staff I definitely Recommend this hotel to young people and also Families!! a big thanks to the guy in the reception name Diego-he is the best!! we will definitely return to this hotel in the future!!", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“fabulous”", "Author": "dorisblonde", "ReviewID": "UR73011716", "Content": "I come back from Rome where I spend a wonderfull travel. I will be in a little hotel near trevy fontaine. the breakfast was delicious with many many choice to eat and to drink. My bedroom was clean every day and quiet. the staff was very nice and helpfull with us, the boy always helped us when we want to go in a good restaurant for exemple. if I come back a day I will choose residenza ki of course thanks a lot everybody", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Residenza Ki was amazing! My husband and...”", "Author": "Artistsbridge", "ReviewID": "UR72398588", "Content": "Residenza Ki was amazing! My husband and I stayed here for a week during our honeymoon, and we kept saying how glad we were that we did. The location is very close to the Trevi Fountain and within walking distance to everything else. We only used the metro to go to the Vatican and Termini. There are tons of wonderful restaurants in the area, as well as plenty to see and do. As for the staff, we cannot say enough about them. Deigo was incredibly sweet and helped us with any little thing we needed. He gave great restaurant recommendations and directions. The housekeepers also made breakfast, which was delightful. They even remembered what kind of beverages we liked after one time! We were so pleased with Residenza Ki and will hopefully return some day soon!", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "illinoise", "Title": "“Location & Staff”", "Author": "jenn2662", "ReviewID": "UR72245372", "Content": "We spent 5 days in residenza ki in June.Confortable room, A/C super ,breakfast in the morning delicius.All staff speak fluently english and are all fantastic persons. About the location i would raccomand this place i never used a pubblic transportation Residenza ki is near trevi fountain and spanish steps. I come back again jenn&rob", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tromso, Norway", "Title": "“Honeymoon”", "Author": "franknor48", "ReviewID": "UR71623833", "Content": "nice place where you can spend your holydays.Fantastic staff,excellent aircondition sistem amazing breakfast as location.a special thank to mister diogo & andrea (best cappucino in the area) i will come back in the next few weeks after norway cruise for a couple of days. see you son my friend", "Date": "July 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Central Location”", "Author": "ricwee", "ReviewID": "UR70739081", "Content": "Stayed over at Residenza Ki from the 4th July till 6th July, enroute back to Malaysia via Rome. We were already tired by the time we reached Rome, as we were initially at the Amalfi Coast. But Residenza Ki's location made it easy for us to walk about as it is fairly near tourists spot (especially the Trevi Fountain) & also a few minutes away from the nearest Metro Station (Barberini). The room we got was cosy and the washroom was decently clean. We will likely visit Rome again, since this trip was too short, and we would very likely return to Residenza Ki.. Regards, ric wee", "Date": "July 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“An upgraded Hostel with a Great Location”", "Author": "travel_allsn", "ReviewID": "UR70699726", "Content": "We had two room and like many other reviewers got asked to move to a sister hotel down the street due to booking problems. The bathrooms were not clean but the hotel is decorated nice. I would recommend this hotel to someone who is used to staying in a hostel and would like his/her own room for the night. The price was cheap and the location is great, however it is not a fancy hotel with a lot of frills.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Fit our needs”", "Author": "mari962", "ReviewID": "UR70582921", "Content": "HI. We were on vacation just this past week- Rome and Venice and stayed in these types of Bed and Breakfasts. We were very pleased. The host let us use his phone and helped us reconfirm our flights. The room, including the bathroom, was very clean. The location was great- we ambled through the streets that led us to the Trevi fountain, one of the high points on our trip.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "California", "Title": "“not a good hotel, but at least its cheap”", "Author": "jeffiner52", "ReviewID": "UR70449320", "Content": "So the friend we were traveling with was asked to stay in another hotel, because the A/C was broken in some rooms, which wasn't too bad as it was right next door, and nicer than the Ki. After the 1st day, we were asked to move onto the second floor because the A/C was going to be checked to make sure it didn't break, which was a little annoying. Warning: There is no elevator, which is common in a lot of European hotels, be prepared to walk up/down a couple of flights with your luggage. In both rooms, the room and the beds were seemed clean, but the bathrooms were not. Besides being the smallest bathrooms in our 4 hotels in Europe, the showers had mold and rust stains on the walls, which made me feel worse after coming out of the shower. Also, the walls were thin. I usually don't let stuff like this bother me, but when you can hear people turning on and off a light switch from another room, that's bad. We were near the entrance from the stairway and could hear everyone coming in/out at night, which was very annoying. The hotel did have a free breakfast of very standard toast/pastries/coffee type stuff, and was probably around 15-20 min walking from a lot of the sites. And only around 10 min from the Trevi fountain, so there were plenty of shops/restaurants and the area seemed safe. Also, the stops for the hop-on/hop-off buses, as well as the Metro was only around 5 min away at Barberini. The hotel also arranged a taxi to the airport for our group of three at 50 euro, which seemed reasonable as the leonardo express train costs 45 euro for three people. The taxi was on time, comfortable, and got us to the airport without any problems.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“feeling like home”", "Author": "jaryeon", "ReviewID": "UR69363991", "Content": "Two of my friends and I spent 3 days in Rome and actually we chose another hotel to stay. But previous hotel was terrible and we moved to this hotel. The room in residenzakirome was very clean and spacious and it's very close to the Trevi Fountain and very good location to get to lots of sights. The best thing in Residenzakirome was people, they were very kind and tried to give best service to guests.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "santander", "Title": "“great location with fair price”", "Author": "grmatanzaas", "ReviewID": "UR69352123", "Content": "we found a hotel with a great locarion close to the fontana di trevi and the metro station so we were not worryed about public transport even when coming back at night. the room was clean and the breackfast nice. only a detail to improve, we had to pick up the key from another hotel (10 min walking) but last day Francesco allowed us to leave the luggage till 18.00 when we had to leave Rome and this is a good datail.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent. Highly recommended.”", "Author": "lhx58", "ReviewID": "UR68932035", "Content": "Best hotel we stayed in during our trip to Italy. Our room was huge and absolutely spotless. The area is quiet, but if the street gets too loud you can just close the windows and turn on the A/C. Breakfast was outstanding (just don't expect bacon and eggs). Staff was diligent and clearly take pride in their work. Location is good too -- walking distance from the Forum, otherwise 5 mins. from the subway station. If you're looking for a reasonably priced room in Rome where you can get a good night's rest and a solid meal before heading out to see the city, this is it.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Highly Recommended!”", "Author": "lvillegirl", "ReviewID": "UR67692649", "Content": "My fiance and I stayed at the Residenza Ki for 5 nights in June and had a wonderful time. Its a small hotel - I think only 10 rooms, but the wonderful staff made us feel right at home. Francesco and Andrea were warm, friendly, and very helpful hosts. The hotel is located just a short walk from the Barbarini metro stop, and within easy walking distance to many major sights - especially the Trevi fountain. We loved walking by and stopping for a gelato at the Trevi every night as we returned to the hotel. One suggestion though - the entrance to the hotel is easy to miss. Its a plain green door right next to a little cafe. Look up a photo of it on trip advisor or search for it on street view of Google Maps before you leave so you know what you're looking for. The rooms were simple and clean. We stayed the first three nights on the second floor and came back a few days later to spend our last two nights in a room on the first floor. I think the room on the first floor was a bit larger, but just off the lobby, so not as quiet as the second floor room around afternoon siesta time. Breakfast consisted of pastries, bread, cheese, some sliced meat, hard boiled eggs, cereal, juice/cappuccino/tea. Bigger than the typical European breakfast I think, and nice and fresh. Overall I was very very pleased with our stay and I hope we can return the next time we visit Italy!", "Date": "June 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salisbury, Wiltshire", "Title": "“Great little budget hotel, amazing location!”", "Author": "beznee", "ReviewID": "UR66906825", "Content": "This is a great little hotel, with a fab location. My partner and I spent 3 days in Rome and we were looking for a budget, basic hotel to serve as our base whilst sightseeing and this was exactly that. Breakfast fine. Spacious, quiet room. About a 2-3 minute walk to Trevi Fountain, very close to almost all sights. Good air conditioning which was so very welcome in the July heat. TV with various English and foreign channels, big wardrobe. Also had fridge in our room with various soft drinks, we drank a few which were replaced the next day and they didn't charge us for them. Good value, clean and comfortable. Would go there again.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "liverpool", "Title": "“Excellent choice”", "Author": "shal84", "ReviewID": "UR66465191", "Content": "We stayed at this nice little hotel from the 24th-26th of May 2010. It is situated in a great central location for a very reasonable price. The hotel is about 5 minutes away from baberini metro station, 3 minutes to the trevi fountain and about 5 minutes to the spanish steps. It also within reasonable walking distance to most of the other sites as well. The surrounding area has a very lively and safe feel to it. There are many eateries and shops close by. However, Francesco the owner recommend some of the best places to eat in ROME - definitely worth trying! the rooms are all spacious, clean, neat and has everything you could possible need. There was air -conditioning which was great given the HOT summer in Rome. The continental breakfast included in the price was satisfactory. Loved the great coffee. As an added bonus, we were able to leave our luggage in the hotel after check out as out flight was later in the evening. We were therefore able enjoy another day of leisurely sight seeing without having to worry about lugging our bags around. All in all a great value for money.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Needham", "Title": "“Perfect Location to see all the sites”", "Author": "rmsr163", "ReviewID": "UR66264612", "Content": "My husband and I were delighted at how convenient the location was to reach all the major sites in Rome; 5 minutes walk to the Trevi Fountain, Spanish Steps, and Pantheon. Also, only 5-7 minutes from Metro station and therefore only 5-10 minute train ride to Coliseum, Forum and Palatine Hills. The staff was friendly, very helpful and accommodating. The room was decorated nicely, decent size for the city, and had a flat screen TV. The breakfast was ample with choices of cereals, croissants, toasts, hard-boiled eggs, yogurts and fruit. This is a great place for those on a budget.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Every business should learn from the customer service that the staff of this bed & breakfast provide”", "Author": "Arpana524", "ReviewID": "UR66247888", "Content": "I stayed here with my sister and brother and law for 2 to 3 days. Great customer service, convenient location, staff with excellent attention to detail. I would choose to stay here again.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "madrid", "Title": "“very good hotel”", "Author": "frankythewish", "ReviewID": "UR66169891", "Content": "first sorry for my first review I mistake. So I want to talk about residenza Ki little hotel in Roma. very sympatic hôtel with a wonderfull breakfast with so food to eat... very very well. then the staff is absolutely fantastic, very helpfull and nice thanks to Francesco, Andréa and Diogo. I was in Rome for job but they help me to conciliate job and pleasure. I will come back, for holidays with my family Now Im in France and my hotel is not so sympatic !!!!!", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Excelent Service and location. Awesome time!”", "Author": "ikciN44", "ReviewID": "UR65857360", "Content": "Francesco was very helpful in telling us where to go and what to see. Breakfast was nice, simple but enough. Location was great. In walking distance of all the major sights. Rooms were clean and the quad was a perfect size for the four of us. Quads can be hard to find but these were very nice!", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Great trip to Rome”", "Author": "Julie-AnnHamill", "ReviewID": "UR65805197", "Content": "I stayed in this beautiful hotel with family for 4 nights, very well situated for everything that you need during your stay. The staff where very helpful always on hand to assist you especailly with directions to places. Would recommend this place for future holidays.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Great location and hospitality”", "Author": "SunnyinSanDiego", "ReviewID": "UR65612092", "Content": "Had an excellent stay at this hotel. Francesco helped us plan out our stay and even got us a bottle of wine because we were celebrating our Anniversary. Great location, close to everything! It is on a nice quiet side street, but a block away from major roads to navigate Rome. Will definitely stay again when we come back.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "wolverhampton", "Title": "“Couldn't wish for a better location for exploring Rome”", "Author": "sarah_3939", "ReviewID": "UR65410175", "Content": "Great central location, only a 10 minute walk from the train station or two minutes from the nearest metro station. Two minutes from the trevi fountain and the spanish steps and easy access to other key sites. The hotel itself is located in a quiet side street and has double glazing to keep out the noise of the nearby main road, there is air conditioning in the bedrooms which ensures a good nights sleep! Hotel staff are friendly, knowledgable about the local area and happy to give advice on how to get around the city. Rooms are comfortable and modern, our bathroom was small but perfectly formed. Breakfast was continental buffet, great selection of pastry's, bread, cold meats, jams, cereals etc. coffee and tea were freashly made by staff, greate latte's and capachinos! Would certainly stay there again.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Macomb", "Title": "“Home away from home”", "Author": "Princess724s", "ReviewID": "UR65283998", "Content": "The staff at Residenza Ki were very friendly, welcoming, accomodating and helpful with anything we needed during our stay in rome. We felt like it was our home away from home not a hotel, they made sure to get to know us by name instead of room number. I would 100% go back and stay at Residenza Ki when I visit Rome again!", "Date": "May 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“great B&B on a PERFECT location in the city center”", "Author": "Veule", "ReviewID": "UR65241651", "Content": "great Bed&Breakfast on a perfect location near the city highlights", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Best Bed and Breakfast in a big city.”", "Author": "karenlm2ooo", "ReviewID": "UR65190386", "Content": "This hotel was very clean,comfortable and in an amazing location in the center of Rome ,from there all the major places like the Trevi Fountain and the Spanish Steps were within walking distance .We were treated not like guests but like family ,Francesco was very helpful and arranged all our tours and gave us great tips on which restaurants to visit and what the best times were for places like the Vatican.Andrea took care of our brakfast in the morning and it was perfect ,she made us the best cappuccino in town and then prepared our room for when we returned later in the evening .For me and my best friend Rosa staying in Residenza Ki was the best decision we made and we can not wait to return.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Great place-Excellet location”", "Author": "eri76", "ReviewID": "UR65137213", "Content": "Me , my husband and my sister stayed at Residenza Ki for 3 nights. we were met from the lovely manager Fancesco that answered all our questions about Rome. Very frendly service and lovely breackfast daily. The hotel is in the midle of everything that you want to see. Trevi Fountain is 2min walk , Piazza Barbirini 5 min walk, Piazza Navona and Pantheon 7-10min lovely walk , everithing is near and nice restaurants around. We would strongly recommend this hotel.", "Date": "May 24, 2010"}, {"Ratings": {"Overall": "1.0", "Location": "5", "Service": "1"}, "AuthorLocation": "Perth", "Title": "“Our Holiday was cancelled after a family death and they kept all our money!!!”", "Author": "simbot82", "ReviewID": "UR65051007", "Content": "My Wife and I were due to stay here for the first week of our holiday in mid may. My wifes Grandfather sadly passed away 4 days prior to our flight and we had to cancel. We rang that very day to allow all hotels time to have our rooms relisted and booked by other travellers. All hotels and museums showed compassion except for the Hotel Residenza Ki. Through all contact we were at first offered nothing in return and given the standard \"non-refundable rate\" clause. Whilst we understand the need for such a rate and its application surely some compassion could be afforded. Then we were informed that perhaps we might be refunded 50%. Then perhaps we could be credited for a stay when we could reschedule our flight and as their final offer they informed us that graciously they would keep our initial booking (over 600 euros) and allow us to rebook at a later date at a discounted rate. In a nutshell give them still more money. After 5 or more emails and over an hour in phone calls we still had not recieved any compassion and as a final insult my wife was informed by the Residenza Ki via email that \"surely she should be focusing on her family and not money at such a time\". For us that was the final straw. We were so excited to visit Rome and stay at this hotel. It may be highly rated but do you want to stay at a place which profits off the grief and loss of others with abolutely no compassion?", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pays de la Loire", "Title": "“Very good!!!!!!”", "Author": "alpi23", "ReviewID": "UR64885909", "Content": "It was a fabulous trip, and I will come back in this hotel, everybody is cool, it was fantastic, Thank you at everybody, I will speak to your hotel to all my friends!", "Date": "May 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kennesaw, Georgia", "Title": "“great place - awesome location”", "Author": "SaraJane17", "ReviewID": "UR63947486", "Content": "Stayed at Ki for a week with a friend and we were met with a clean/neat room, friendly service, breakfast daily, and an overall positive experience. The Ki has an absolutely ace location--it's just blocks from Trevi Fountain, the Spanish Steps, and Piazza Barberini. It's within walking distance of EVERYTHING in Rome, including the Colosseum and I'd highly reccomend staying there to anyone, especially those with an interest in ancient or papal Rome.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“great place to stay in rome”", "Author": "jiil", "ReviewID": "UR63715748", "Content": "i am currently travelling around europe and have stayed at a range of hotels. I arrived in Rome after 14 hours on a train to be warmly greeted by Francesco he explained all the best places to go and provided me with map. Was very warm and friendly and is the best check in service i have had. the breakfast was good and the expresso is exellent if you are into coffee. Great location near everything...... Strongly recommend.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nice hotel”", "Author": "campingvogn", "ReviewID": "UR62845046", "Content": "The hotel was in a great location with nice, clean and very nice newly renovated rooms. The staff was friendly and there was a buffet breakfast with cereal, bread, different types the italian way. It was nice that it was possible with transfer to ond from the airport. The price was low and I would prefer to stay there again.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Odense, Denmark", "Title": "“Cozy hotel - Great service - Perfect location”", "Author": "Carsten_H_Denmark", "ReviewID": "UR62835296", "Content": "We did arrive late, and the reception was closed and so was the front door. But a note at the door showed us where to get our key to frontdoor and our room.Our fault that we did not let Residenza Ki know in advance that we would be late. The great service at this little cozy hotel kept on during our stay. Breakfast is perfect, and dont hesitate asking for more coffee/cappucino it´s made instantly with a tender touch. The location is great. No need to use public transportation, put on your walking shoes instead and enjoy the short distance to almost anything.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nice hotel in great location”", "Author": "ALSvendsen", "ReviewID": "UR62506190", "Content": "The hotel was in a great location with small, but clean and very nice newly renovated rooms. The staff was friendly and there was a buffet breakfast with cereal, bread, different types of coffee etc. Plenty of food. Only reason why I don't rate it with 5 stars is that one of the beds was very (=too) soft and saggy. It is their next project to change this (after renovating the rooms), if this happens I think it will be the perfect hotel for the price.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“General feeling – for a week we felt like real Roman citizens!”", "Author": "an_lit", "ReviewID": "UR61875555", "Content": "Residenza Ki Hotel is brilliant for those who are trying to avoid transport while in Rome. Most of the city historical and cultural musts are within walking distance. And just in case you decide to visit Vatican or any other remote corner of Rome, the Barberini underground station is round the corner. Location - could not be better! Rooms – clean and being cleaned every morning, warm – if you come in colder times, don’t know about summer, hopefully cool. Stuff is very friendly and helpful!). Breakfast – a variety of choice, bread always fresh and delicious. And if served with a smile, lasts for a long time. Plenty of smiles guaranteed. Hotel administration – non-intrusive, yet caring. General feeling – for a week we felt like real Roman citizens!", "Date": "April 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mora", "Title": "“Clean, fresh rooms at a good price.”", "Author": "sctMora", "ReviewID": "UR61776164", "Content": "We got a lot of advices how to see as much as possible during our 3 days in Rome from the staff at the reception. They where very serviceminded. Room was good, clean with comfortable beds. The breakfast was poor, but the breakfast-room was just renovated, so the staff hadn´t got it all going as I´m sure it will further on. A good accomodation for a decent price. Sven and Catharina, Sweden.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bergenfield, NJ, USA", "Title": "“Great place, great staff!”", "Author": "Gladys4412", "ReviewID": "UR61764591", "Content": "The Residenza Ki is great. As long as you don't mind a few flights of stairs (which the staff will help you with your suitcases with!), this is a great place to be. It's close to a subway station and the Trevi Fountain, the rooms and the breakfast is great, and the staff couldn't be more helpful! Right next to a few reasonable places to eat in case of night-time or early morning cravings, cable TV and an hour of free wireless internet, along with a good-sized bathroom and a great setup, we couldn't ask for anything more in the Residenza Ki!", "Date": "April 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent value for money, very friendly staff and delicous breakfast.”", "Author": "rachel_b28", "ReviewID": "UR61745674", "Content": "We really enjoyed our stay here. The Bed and Breakfast has a great location and the breakfast was lovely. We would stay here again.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "malmö", "Title": "“Friendly and welcoming”", "Author": "oscardanefors", "ReviewID": "UR61072756", "Content": "The Hotel is a cosy family-owned hotel with a perfect location. The owners are very friendly and helpful and you will get your moneys worth if you stay here.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Great Location! Good Value!”", "Author": "nyfep", "ReviewID": "UR61032731", "Content": "Residenza Ki is located right in the heart of Rome -- within walking distance of the Trevi Fountain, the Pantheon, the Spanish Steps. The Barberini metro stop is practically around the corner. This is a true Bed & Breakfast -- it is located in an apartment building. As others have said there is no elevator so you do have to carry your luggage up and down the stairs. However your hosts, Diogo and Francesco will surely help you. We arranged for a cab to pick us up at the airport so finding the hotel was not a problem for us, although I can see why people might have a problem locating it -- there is no sign so you need to look for the building number. The breakfast served every morning is very good, delicious pastries, bread, meats, cheeses, fruit. Our first morning there they also had yogurt, however for the rest of the week they seemed to have run out. The cappuccino and espresso is amazing, we always had to have two cups each morning. The women who run the breakfast room are very sweet. We stayed on the first floor, and given the fact that the hotel is in a very busy, touristy part of town, it was extremely quiet. Guests on the second floor literally wake up and walk directly into the breakfast room -- so be aware of that when booking a room. Our room was very clean, a nice size, the bed was very comfortable, but furnished very sparingly. We were lucky we were given a chair to keep in our room, so we had another surface to put things. However, the reason we were given the chair was due to the fact that the armoire to hang your clothes was made for someone playing for the New York Knicks. The bathroom was also very clean, nice shower, great water pressure, but again very few surfaces to keep toiletries. If you like to do any kind of stretching or morning exercise be aware that the floors are marble and extremely hard. Maybe bring your own yoga mat along. As another fellow traveler mentioned the wifi in the hotel was not working during our week-long stay, which was a bit of a pain since we lugged our computer with us and wasn't able to use it at all. Also during our stay our two hosts were dealing with some personal/health problems and were not around as much as we assume they normally are. We still have to say if you are a self-reliant traveler, don't need a lot of hand-holding, no 24-hour desk service or concierge - then we do highly recommend Residenza Ki -- you truly feel like you have your own apartment in Rome. But if you are expecting a true hotel -- this would not be the right place for you.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Uppsala", "Title": "“Great location, good value”", "Author": "teaterspoket", "ReviewID": "UR60808472", "Content": "Average hotel in a great location, clean, nice staff, simple breakfast, hard to find - no sign! The bed was too short for my tall, teenaged son (1, 98 cm) otherwise the bed quality was good.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Just go”", "Author": "Casdub", "ReviewID": "UR60720151", "Content": "The Residenza Ki was a great place to stay. Perfectly situated between the spanish steps and the trevi fountain. Barberini metro stop was just 5minutes walk away. The one thing better then the location was the staff, especially Francesco. As soon as you get there you get a map from him circled with all the local attractions. And most of them are local, if you really dont want to walk hop on the metro for 2 stops(which comes every 2mins) and your practically there. Ask about the ROMA PASS which makes everything a breeze. One thing to know as well to save yourself a tenner in a taxi-when you get to Termini train station from the airport the Metro station is directly underneath. Go 2 stops to Barberini and its just a couple of minutes walk from the Metro and mostly downhill! We had a great stay, any question we had Francesco would try his best to answer, and he may have a tale or two to regale you with also. The room was well maintained, comfortable, very clean and there is air conditioning(that works) and sky tv if you really need it. It was basic enough but we werent there for the room. All in all a wonderfully stress free long weekend in a beautiful city. Cant ask for much more.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "guadalajara", "Title": "“Location and staff that cant be beated!!”", "Author": "linkyta", "ReviewID": "UR59837652", "Content": "This was the second time I had the pleasure to visit Rome, this time I took my mom with me. I chose the Residenza based on the reviews and the location and we cant be more pleased We arrived in the afternoon, had a bit of trouble finding the place, since it's in an apartment building, not an actual hotel. But then we saw the doorbell corresponding to the Residenza, unfortunately we didnt get an immediate answer and we got a little nervous, but a charming gentleman who came out of the building was really nice and dialed the number that was indicated in the doorbell, but at the same time Diogo came in and took us inside. I emphasize: THERE'S NO ELEVATOR IN THE BUILDING, the reception is in the first floor and in our case the room was on the 2nd. So either workout before you go or pack lite ;-P ! The place was incredibly clean. Our bedroom was seriously large and comfy, the bathroom was regular sized and spotless (I really liked the mirror). The only downside was that they had a failure with the internet service and during our 3 day stay we couldn't go online wireless, but Diogo offered us to use his computer. One interesting detail is that you get SKY system in your tv, not that you want to watch much tv when in Rome but I've been to a couple european hotels and you only get a couple of channels when staying at budget friendly places The breakfast room was cozy and Andrea was always checking if she could get you anything. Breakfast itself is good: cold meats, buns, toast, fresh juice and fruit and delicious cappuccinos or lattes made at the moment. I really liked the fact that they give you your keys and it's like you have your own apartment in Rome! (that gets perfectly cleaned everyday :-) ) And the location is unbeatable: 20 min s max of a delicious walk get you everywhere, in fact, Trevi fountain is 2 blocks away! Metro station is a 2 min walk and the fastest way to get to the Vatican. We really recommend this place for anyone who is in a no frills mood, wants to be in the middle of everything and be greeted by the friendliest staff ever", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "stafford england", "Title": "“best place to stay to see all the sights in walking distance”", "Author": "elizabeth074", "ReviewID": "UR59491228", "Content": "Residnza Ki is a little gem of a hotel. The location is fantastic, nestled between Trevi Fountain and Spanish Steps. The Staff were extreamly friendly and helpful providing maps and advice to help us not to miss anything during our stay. The breakfast were fresh and plentiful and they even provided an early breakfast on our departure.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“location & staff”", "Author": "rightrichard78", "ReviewID": "UR59075686", "Content": "Mr Diogo was fantastic all rooms all renovated and breakfast was excellent. I would suggest to all fúture guest to organize a meeting point to have a check in like i did.", "Date": "March 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lake", "Title": "“it's a gem”", "Author": "robhil57", "ReviewID": "UR55468261", "Content": "The hotel itself is a short 5 minutes walk from trevi fountain and spanish steps, the only time we used the metro was to get to the vatican,althourg this probably would still only have been a 45 minutes walk away. The staff at residenza ki - really friendly - from the front desk to the weitress expecially andrea in the breakfast room. -great service (it's great when someone remembers how you take your coffee from the firt morning and has it ready for you every day for the rest of the trip). the breakfast was also great ...big selection of pastries,cereal,juice,bread cheese salami and ham,eggs and homemade cakes, but the most important was a personal greeting to my girlfrien who was celebrating her birthday and had a nice bootle of chianti waiting for us in the room when we arrived....A LOVELY TOUCH. i booked this hotel based on a combination of tripadvisor ranking and price and had a very positive experience for 4 nights we were there.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "preston", "Title": "“Nice Hotel”", "Author": "josrob40", "ReviewID": "UR55076594", "Content": "Nice hotel in Rome. I Spent 3 days with my family for my birtday,best in my life,the cake's present from residenza ki was delicius and we offered also to the other guest. residenza ki staff was excelent ,loved the location and the hotel,clean and very confortable.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "madrid", "Title": "“nice central hotel”", "Author": "senador", "ReviewID": "UR54150893", "Content": "I booked this hotel just for 2 nights on internet but at least I decided to spend there 3 nights more because the structure was more than I expected,very clean room,fantastic staff,marvellous breakfast a I can also saw my team soccer on television for champion league.great and excellent position.don't believe to all rewiews my experience was great.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oakland, California", "Title": "“Great Value, Great Service”", "Author": "Semicolon2010", "ReviewID": "UR54124387", "Content": "I recently spent four nights at the Residenza Ki while on vacation in Rome. It's a real hidden gem, two short pedestrian-only blocks from Trevi Fountain, and a short walk from the Metro. The rooms are clean and very spacious for a hotel in this price range, the bed comfortable, and the service was really exemplary. Overall, I would strongly recommend this hotel.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Helsinki", "Title": "“Terrible place, horrible!!!”", "Author": "efapallo", "ReviewID": "UR52567196", "Content": "I (26 years) stayed with my mother (61) in Residenza Ki for four nights 23-27.12 and it was horrible!!!! The whole \"hotel\" is rotten, everywhere is black mould growing from the walls, they have a huge humidityproblem. And the solution is to paint the black mould spots with chaulkpaint! As a doctor I can tell you, it doesn't help anything! The mould is so deep in the walls that the whole building should get torn down so people wouldn't breathe the spores in their lungs and get a bronchitis, asthma etc. Everything in the hotel was broken; the beds were broken, the bedspreads had holes and all kinds of stains (disgusting white stains..) on them, as well as one of our matrasses had huge stains of urine or faeces on it! The only chair in the room had different kinds of stains on it. There hadn't been cleaned in ages, on the walls were stains and on the sideboards loads of dust. There was no hook for towels in the bathroom, it had fallen off and no one had bothered to fix it, in the wall were just the holes. The shampoostand in the shower was totally rusty. The dustbin was broken. The drain in the shower didn't work so as I showered the water flood on the floor of the bathroom and from under the door in the room. As I noticed it I had to soak it up with my towel fot the next 10 minutes. As I got new towels and explained the problem of the overflow to the cleaninglady she seemed to think it was perfectly normal. In the toaster from the breakfastroom only one side worked, the cleaninglady had to tell her guests every day the left side doesn't work. They serve some kind of croissants and danish pastry for breakfast. On 3 of our 4 breakfasts there was this same peace of pastry in the vitrine which contained quark and eggs, so it was definately not eatable after the first morning. But it was every mornig offered to the hotelguests. Probably someone ate it on our 4. morning, then it was gone. On our last mornig I must have gotten a foodpoisoning from the cold eggs, which had been cooked god knows when, and vomited and sat on the toilet for 24h. The personal was unfriendly and always tried to get up with excuses as I complained about for example the mould. As I told one of the staff I had been in better hostels than in this so-called hotel he even admitted he believed this. He tried to tell me something about italian standards, but I don't think this explanation is enough. We are in the EU and have standars that even Italy has to follow. I wouldn't recommend this shabby \"hotel\" to anyone!! The room I am talking about is by the way the room shown on their own internetpage, but the fotos must have been taken about 20 years ago. The adress Via Rasella 53 is by the way wrong, checking in is in number 56 and there is not \"Residenza Ki\" displayed there but something else about Bed and Breakfast. Didn't know that in the middle of the night. The telephone number on the doorbell of 53, that by the way doesn't work, is also wrong. As well as the number on their own internetpage is wrong. So I went to another hotel nearby and the nice portier made 5 phonecalls to reach our real \"hotel\". At 1.30 in the night. In my opinion the whole hotel was such a mess, absolutely horrible!!!", "Date": "January 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Canberra", "Title": "“Great Staff & Location, pretty dirty though”", "Author": "steveofcanberra", "ReviewID": "UR50908095", "Content": "I stayed here for a week from late Nov to early Dec 09. Staff are exceptionally friendly and helpful. Breakfast lady is very nice also. Location is awesome. 3min to Trevi, 5min to spanish steps and train station. I would not stay here again though. Unfortunately there was SO much mould in the bathroom I didnt want to touch the walls while I was having a shower. I went to the local supermarket and bought a bottle of bleach I was that disgusted. The floors in the room are tiled. Walk round the room in bare feet for 2 min and then look at your feet.. Ewww!!! The floors have like never been mopped and look ok at first glance but are actually really filthy. Apart from that, the room was great and everything else appeared clean and functional enough. So yeah, by all means stay here, its just that our room was pretty feral in the bathroom and the tiles were dirty. Also there was no hot water for our last 2 days on our floor (1st floor) as the boiler apparently stuffed up. Communication could have been a little better... as in they could have offered us another room on another floor. So yeah, I wont stay here again nor will recommend it, but I may have just had a bad experience as everyone else's review seem pretty positive.", "Date": "December 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "wyoming", "Title": "“it's a gem”", "Author": "robert13Wyoming", "ReviewID": "UR50414908", "Content": "residenza ki is fantastic.We booked it for location but we found it so lovely.the staff very helpful,diogo can suggest you nice restaurant and how visit the eternal city in the best way to save time and money,consider it, this is important . In a breakfast in the morning you can find past,ham,salame and some cake i would raccomand to try espress italiano. they clean every day the room. so we definetely reccomand this place. rob& mary", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "indianapolis", "Title": "“perfect hotel”", "Author": "74denism", "ReviewID": "UR49638679", "Content": "perfect location,deligtful staff and pleasant room.What could be more perfect?residenza ki is a gem,planted within a short stroll from so many of the top acttraction (walk to trevi fountain in 2 minutes,Spanish steps in 3 and pantheon in ten minutes).the front desk staff are faboulos.My favourite was Francesco,but they are all wonderfull.the breakfast room is small but pleasant.there was a nice selection of breads,fruits,meats and cheese. this is ideal hotel to enjoy this fabulous city", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "sacramento", "Title": "“Family Holidays”", "Author": "browncurtis17", "ReviewID": "UR49118968", "Content": "Our family ot three stayed at residenza ki in september . first two night were in a small room,then we upgraded to a large rooms for a large rooms for the final two nights. The residenza Ki has the best location in rome.We walked everywhere from this hotel.the decor was nice.the staff was helpful and breakfast was above average.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "vilnius", "Title": "“Great experience”", "Author": "vladVilnius", "ReviewID": "UR48037099", "Content": "Excellent hotel with helpful staff, room and breakfast was fine and location fantastic. I was a solo travel but i found a new friends in Rome. nice suggest for restaurant and good organization for the airport . i come back again", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "pretoria", "Title": "“around europe”", "Author": "35steve", "ReviewID": "UR47588488", "Content": "what a nice place to live Rome! We spent four days and we really feel like home.thise place is managed from a family,they told us,so ewerything well done. they take care about clean,about breakfast fresh croissant ham,salame,cheese,fresh fruit salad and homemade cake. Room are good always cleaning.the staff is fantastic they help us with map and suggestion for restaurant and museum.but the best quality of residenza ki s the location... 2 minutes to arrive in trevi fountain and spanish steps,you can forget bus and metro if you like walking like us just to know is 45 minutes to arrive in vatican city by walk and 20 by metro. we reccomend this place to all people want save a money choosing a good quality", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "illinois", "Title": "“holidays”", "Author": "cmartin087", "ReviewID": "UR47479973", "Content": "Amazing relation quality and price.Delicius breakfast,free wifi,central location. The restaurant suggested from all staff was fantastic and chip. Francesco suggested non touristic restaurant i promise to frank to don't write my preferite...please ask directly to Francesco i will come back", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "rotterdam", "Title": "“nice place to stay”", "Author": "dukeRotterdam", "ReviewID": "UR47478011", "Content": "i have read the previous review and also i have to pay cash. we have asked explanations and the boy of the reception has explained to us that they were change operating telephone and they did not know when would be returned the line. we haven't problems because at the end of the street there was a ATM machine. fantastic location 2 minutes walking to arrive in spanish steps and trevi fountain,pick up service from and for airport was fantastic and efficient as a breakfast (we found cheese,salame,ham fresh croissant and fruits salad. staff always available and helpful i just suggested to my friend to choose in rome Residenza kI .", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Very pleasant stay”", "Author": "kenallroundtheworld", "ReviewID": "UR46467478", "Content": "Great location, comfortable rooms and excellent service. The bathrooms were a slight disappointment in what would otherwise would have been a very enjoyable stay. Highly recommended.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sweden", "Title": "“Perfectly located”", "Author": "EAAL", "ReviewID": "UR45742785", "Content": "Via Rasella is a quiet street with little traffic. The entrance at #53 and the 24 hour reception at #56 almoust next door. Very helpful personal. We, four people, spent four nights in two twin beds and had all tourist sites within walking distance. Used the nearby underground station just once to get to the Vatican. Bathroom with shower all neat and clean, new towels every day. Breakfast with milk, coffee, cerials, toast, buns, pastry, different spreds, ham. Good value.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Awesome hotel in the heart of Trevi”", "Author": "bensgirlSydney", "ReviewID": "UR45694965", "Content": "My Husband and I just arrived back from Europe after a three week honeymoon and while in Rome we stayed at the Residenza Ki. The excellent service started from as soon as we made our booking. We received a confirmation from the hotel within an hour of making the booking (and considering we booked this accommodation after having major issues with the original hotel we had booked with this prompt confirmation was most welcome!) wanting to know the details of our flight or train and did they want us to organise a taxi to be waiting for us when we arrived in Rome. I can comment on two of the rooms, the family room 203 and the double room 205. When we arrived we were told that they had noticed a small problem with room 205 (not that this was something we noticed when we went to our intended room so it must have been fixed) and they upgraded us to a family room (room 203) so they could rectify the issue in our room. This forward thinking is not something that I have seen in budget chains and it was greatly appreciated by us. The family room was excellent, a queen and two single beds in the room so absolutely large enough for the family. It faces the street the hotel is on but is so quiet, very clean and modern room. The next day we were moved to the double room 205 (they moved everything for us, we did not have to do anything) and this room was also excellent. We had been travelling around Europe for about two weeks at this point and the previous double rooms we had stayed in were quite small and for the price we paid that is what we expected, but it wasn't that small at all. Might get a bit small if you want to spend all your time in your hotel room, but why would you want to do that, you are in Rome! Great room, again very clean (cleaned daily and linen changed daily)and quiet. And the rooms had air-conditioning which was most welcome due to how hot Rome can be (and was when we were there). The location of this hotel is fantastic, in a few minutes of walking you can be at the Trevi Fountain, Pantheon, Piazza Navona, Spanish steps and other monuments. You would expect the hotel based on the location to be noisy, but it is so quiet. Close to heaps of restaurants and cafes and about five minutes walk to the closest metro station. The free WiFi also came in handy. The service that we experienced from all of the staff is on par with what you would expect from a five star hotel, they were the nicest, most knowledgeable people that I have encountered in any country while travelling at any time. The knowledge of their city is excellent, the pride in their hotel and work is evident at all times and they were such lovely people. They asked us regularly if we were comfortable with everything or if there was anything they could do for us, it was great. They also provided a great daily breakfast and the women working in the mornings make awesome coffee! Needed when hungover from too many red wines at the great restaurants! I would (and have) recommended this hotel to anyone who is looking for a fantastic hotel in Rome in a great location with excellent staff. Now if you are used to the Hilton and expect the rooms to be like the Hilton you will be disappointed, remember that this is a three star hotel. But the service is better than a five star hotel and you will not be treated like a number like you can be when in a five star hotel and the rooms are great. These people will go out of their way to make you feel comfortable and at home and that is just what you want when travelling in another country. We are looking at going back to Rome next year and we would go back to the Residenza Ki again for sure!", "Date": "October 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "vancouver", "Title": "“Best honeymoon”", "Author": "mrnroger80", "ReviewID": "UR44982447", "Content": "Amazing honeymoon, one week in a comfortable situation with a fantastic staff .Nice room always cleaning and abundant buffet breakfast congratulation to Andrea for the cappucino. i would also say thanks Diogo Daniel and Francisco we want to you well marion and steve", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great people at Residenza Ki!”", "Author": "Praxitellis", "ReviewID": "UR39629108", "Content": "Look Yeah there's more fancy places out there and for some that's what there after but the Residenza Ki has alot going for it here's a few things... Great location within walking distance to the Trevi yet Quiet side street so you can sleep (if you want) Rooms a nice maybe need a little touch up of paint but that can be forgiven. Really homely feel great check in with our man Francesco very knowlegable also the other fellows who do the night shift great bunch of guys! The Maid/Breakfast lady is GREAT and breakfast was good to.. Highly recommend this joint little touch up's and they'll be no complaints!", "Date": "September 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Great Poroperty and Location”", "Author": "djdarrendc", "ReviewID": "UR39523593", "Content": "I just returned home from my 4 night stay at the Residenza Ki. We arrived early and we exhausted but were give a room early, which we were grateful for. Once in the room, I have to say that I was a little surprised as the room was quite small as was the bathroom. However, after the first night, it was not an issue at all. The reality is that we only used the hotel for the basics, at no time did either of us want to stay in the room and relax, hello...it's Rome, get out and enjoy the city. The staff was very friendly and very accommodating, we went out every night so we never made it to breakfast but I am sure it was great. I would tell anyone thinking of booking here, know what you are getting. If you think you are going to get a Mariott room for a motel 6 price than you are going to be disappointed. If you are looking for a clean, well managed property in an excellent location, than this is the place for you. Simply put, it does what a budget hotel room should do, provide a place to hang your clothes, get something to eat, shower and sleep. Diogo, Francesco and Danniello were all very polite, and gave every single person that we saw them interact with customized service.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Trondheim", "Title": "“Very nice place!”", "Author": "IdaMari", "ReviewID": "UR38904488", "Content": "The hotel has a perfect location, friendly helpful people and comfortable rooms. Our stay in Rome was perfect thanks to very good advices and guidance from the guys at the hotel. The guys at the reception and the housekeeper/ breakfast lady all gave us good advices on what to do in Rome. Very helpful! Airconditioned rooms with minibar made our stay even more pleasant! When we go back, we will definately book in to that hotel again, and we will be sure to recommend the place to our friends and family who are traveling to Rome.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Perfect hotel, very well situated, for a small stay in Rome.”", "Author": "Marcoandreszs", "ReviewID": "UR38615793", "Content": "Very good advice of the desk clerk (Diego), for museums, restaurents, etc. A very pleasant stay thanks to the good reception of the staff of the hotel.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Århus", "Title": "“Fantastic location”", "Author": "irakmp", "ReviewID": "UR37440057", "Content": "Situated in the heart of Rome, the Residenza Ki is a nice hotel with some nice and helpful staff. Most of the sights can be reached by foot and the area around the hotel is very cozy with the Trevi Fountain within 100 m. Some great restaurants in the area around the hotel.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "windsor,canada", "Title": "“Great Location,Good Value”", "Author": "yoozeer", "ReviewID": "UR37232747", "Content": "My Family and I (2 children aged 15 and 11) stayed for 6 days in July 2009. This was the first time we have ever booked anything online and we chose Residenza Ki based on Trip Advisor reviews. We were very happy with our choice. This place is very ,very close to the Trevi fountain and the Spanish Steps is also within walking distance of the hotel.The Metro system is a 5 min walk from the hotel. The hotel itself is clean and well run. Francesco and the other staff members were more than willing to offer their recommendations to any of our questions. Our stay included breakfast and we were happy with the selection of items in the am.The lady working the Breakfast room in the morning was very pleasant and attended to you promptly with coffee and hot chocolate for the kids. All in all i would recommend Residenza Ki as a good Value for both price and location", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "oslo", "Title": "“Great and cheap hotel, located near all the main attractions in Rome”", "Author": "tamol", "ReviewID": "UR36266512", "Content": "This hotel had everything we were looking for! The room was clean and quiet, and with air condition we were able to get a good night sleep even though it was extremely hot in Rome during our stay. The staff was also very helpful and friendly. The hotel is located near all the main turist attractions in Rome. The Trevi fountain and the Spanish steps are both only 5-10 minutes away by foot, while the Pantheon and Piazza Navona can be reached within 10-15 minutes. We never felt the need to use public transportation or taxis when exploring the city. We felt we got good value for the money we spent, especially when considering the fact that the hotel was not very expensive compared to others in the same area and of the same standard. We would therefore like to give Residenzia Ki our best recommendations. Jørgen and Tale from Norway", "Date": "July 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Vacouver Island, British Columbia", "Title": "“Disappointing/Dirty”", "Author": "LoveItalia09", "ReviewID": "UR35606238", "Content": "Oh what a disappointing experience for us while in Rome. Although we were close to the Trevi Fountain. The room was dirty and the shower disgusting, I had to buy cleaning supplies and clean the bathroom before using it, as the shower curtain was crunchy and stuck together, mold and mildew was everywhere, the drain did not work, so flooded the bathroom everytime we showered. Towels that were 2 days old and on the floor were picked up and hung up. The floor was never swept, so I found a broom and dustpan in a closet with no door that had many many other items in disarray, I swept our room daily. When the linens on the bed were changed they were made with holey (many holes)sheets. Bars on our windows and could not open the bathroom window. No safe, T.V did not work and we could not phone out of the hotel, when I asked how I could make a local call I was told rather rudely to use a pay phone. The linens on the tables in the breakfast room were dirty when we arrived and stayed dirty until we left. The floor in the breakfast room was not cleaned once in 5 days. Had tea the one morning we ate there and didn't get to finish it as the pot was needed for another person (they only had one teapot). We only ate breakfast here once (first morning) and then ate elsewhere due to the uncleanliness of the room. I will not be back. I had read the reviews before hand so was expecting something way different, obviously they had different rooms or we where put in a different hotel. We had paid before hand so would not get our money back if we moved to a different hotel, although I really wanted to.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Houston", "Title": "“Great Location!! mins to Trevi Fountain”", "Author": "mailman33", "ReviewID": "UR35396971", "Content": "This hotel was a little difficult to find. The check-in office is located in what looks like a bed and breakfast/tour guide/travel agency office on the first floor. The staff was very friendly and courteous. Our room was in the building next door. You have to carry luggage 2 floors before you can use their extremely small elevator (1person+1luggage or 2ppl,no luggage). Our room was spacious, clean, and somewhat cool. Our private bathroom was located right outside our front door, across the hallway (which i thought was very weird). Breakfast was located on the fifth floor on a balcony overlooking several buildings which was a delight. The hotel is conveniently located minutes from the Trevi Fountain, Colosseum, and other major sites.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Excellent location, nice cool, clean rooms”", "Author": "Poldcess", "ReviewID": "UR35102828", "Content": "We stayed for 4 nights in mid July and the city was HOT HOT HOT ! The rooms however were perfectly cool and air conditioned, a welcome relief! The room was spacious, comfortable, clean and the complimentary mini bar was a nice surprise as well. Shame we didn't realise this upon arrival as I'm sure we could have done more damage to it. Always plenty of hot water and a powerful shower, just what you need after a hard day's sightseeing. Coffee at beakfast was great, the rest was standard continental affair - bread, cheese, cereals, juice, ham. Fruit would have been nice, but there was plenty to keep us happy. The hotel was initially fifficult to find as it isn't labelled Residenza Ki and you have to go into the 'Fellini B&B' office two doors down. The very helpful Francesco explained that they had switched companies and everything would soon be renamed. Francesco and the other staff were all very helpful, providing maps, advice and directions. It is so close to all the popular sights and transport links, although nearly everything is in walking distance anyway. We would definitely stay again and would recommend it to friends and family. The Residenza Ki is very good value for your weak pound and, having stayed in innumerable continental hotels, far exceeds it's three stars. Thumbs up to Francesco and his staff.", "Date": "July 18, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Helsinki", "Title": "“Good”", "Author": "Anstrav", "ReviewID": "UR33782579", "Content": "Hotel was at a really good location, easy access everywhere. Our room was excellent for that purpose, we had 4 people staying in one room, which was a bargain. Quality of breakfast could have been better, but it was adequate as well.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Great hotel for people on budget!”", "Author": "Wolika", "ReviewID": "UR28012613", "Content": "The hotel is in a great location. The Trevi Fountain is very near, but not too near so you don't get bothered by too much tourist traffic. There are loads of proper Italian restaurants around...avoid anything that puts pictures of food on the menu! Kind of hard to find. It's near the bottom of the hill. On top of the hill you've the Bernini Hotel...just walk down and you'll find it. The hotel was good. Clean towels every day, room cleaned daily as well. The bed was comfortable and the place is pretty quiet at night (just normal traffic). The breakfast was okay, but the juices they offer are disgusting. Also, the drinks in the little fridge in the room must have been there for months cos they were all dirty (mouldy)from being in there for so long. Great place to stay in ROME!", "Date": "April 14, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney", "Title": "“Good price”", "Author": "ACRSydney", "ReviewID": "UR23084175", "Content": "We spent a night in this B&B in October 2008. We found the location superb, very close to the Trevi fountain and the bustle of central Rome. The staff were helpful, and the rooms clean. Overall the price is good, and the location excellent.", "Date": "December 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "london", "Title": "“Nice hotel, a bit strange:)”", "Author": "bulkaibublik", "ReviewID": "UR22804888", "Content": "Just come back from a weekend away in Rome having stayed at Residenza Ki for 2 nights. This Hotel itself is very hard to find since there is no sign outside so we walked past it couple of times. It is even more confusing because once you find the adress the name of the hotel does not match and the reception for residenza ki is at Fellini Inn.... The room 305 was not big, but clean apart from black hairs on the floor...that kept appearing (not ours!). The lack of bath was dissapointing, but shower was a good size and clean. The hotel is next to a arch type car tunnel so can get a bit noisy , depending where your room is but once the telly is on you can hardly hear the outside noise and the view from the window is nice anyway.", "Date": "December 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Very good bargain”", "Author": "FortyNineCountries", "ReviewID": "UR22481268", "Content": "Mom and I decided to spend a week in Rome, and picked Residenza Ki because it offered a good price in a good location. We were disappointed on the first evening (a Saturday) because our room faced the street, and immediately below us was a restaurant that was holding an outdoor party. (I slept through it, but mom did not.) As it happens, they were going to move us to an interior room the next day anyway. We never had any problem with noise after that. In fact, the restaurant appeared to be closed during the week, and there was no party the following Saturday night. Apart from that, we had absolutely no problems. The room was always clean. Breakfast was always good. Francesco at reception was always friendly...each morning he would draw us a map of how to get where we were going that day. The hotel is small, tucked away on a little side street... in fact you have to \"just know\" that you check in at the Hotel Fellini next door. But this was definitely a plus, not a minus. There was always hot water. Lots of restaurants, bars, cafes, and so on nearby. The metro is a block away, as are main bus routes. We would usually spend our mornings walking to our destination, then take a bus back to our neighborhood in the evening, after dinner...we never had to change buses. The neighborhood felt perfectly safe at all times. In addition to English, I heard French, German, and several other languages in the breakfast room. It was an ideal little European inn, and I would definitely stay there again.", "Date": "December 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maroubra", "Title": "“Super friendly, best location, senstaional value”", "Author": "artgal44", "ReviewID": "UR21664986", "Content": "I can only say fantastic things about this great place to stay. Firstly, a sensational location. It really is close to the Trevi as they had descibed, and in fact close to everything. One of the great pleasures of Rome is to be able to walk to as much as possible, in order to take in the street life of this buzzing city. Residenza Ki really has one of the best locations, with a very reasonable cost. The rooms are good, clean, and you feel like you're living there as it's not like a hotel. The rooms are all off a common breakfast room. They have a lovely lady who prepares breakfast for guests every morning. We found the breakfast adequate ( a typical Italian buffet, just don't expect a big American style breakfast - after all, you're in Rome ) and the staff just fantastic. Diogo at the front desk (a couple of doors down the street from the building that the Residenza is in) is particularly helpful. He is warm and generous with his advice about any questions you may have, gives GREAT suggestions for the best places to eat, and assisted us with a great many things (as did Francesco). Do not expect a \"big hotel\" feel, this is more like having your own little place in Rome, which is so much better. We have stayed in many places, from small B&B's to luxury 5 star, but all in all, this is great value for the very best location and friendly service in Rome. A wonderful place to stay where you will feel like a local after only a few days.", "Date": "November 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague", "Title": "“Terrific B&B in Rome”", "Author": "wisewithage", "ReviewID": "UR21148020", "Content": "We stayed at this hotel in October of 2008 and had a very nice visit. The hotel is tucked away on a side street in Rome, close to the Metro station and near several bars, restaurants and shops. We stayed here for 2 nights and had 2 rooms. The staff was helpful and courteous and each morning we ate a terrific breakfast upstairs on the rooftop terrace. SImply a great way to start the day. Will definitely stay here again on our next trip to Rome.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greenville, SC", "Title": "“Nice Stay: ResidenzaKi”", "Author": "LKJM", "ReviewID": "UR20796629", "Content": "ResidenzaKi offers a simple, quiet room near subway and bus stops that make it easy to get around Rome if you're OK with public transport. (Itis relatively user friendly in Rome). It is near the Trevi fountain. The rooms are clean and the room service staff kept them that way during our stay. The staff is friendly and helpful, particularly the desk staff. Francesco of the desk staff in particular went out of his way to help us on several occasions. The key situation to enter the room area from the street can be tricky. I couldn't extract the key from the lock until a kind employee of the next door restaurant came to my rescue and showed me the trick of it. The beds were servicable but not especially comfortable. Breakfast seem typical of Rome for this class of establishment. Cappucino is very good but since there aren't many tables compared to the number of rooms, it isn't a leisurely breakfast experience. Overall ResidenzaKi worked very well for us.", "Date": "October 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Not so great Residenza Ki”", "Author": "LondonCamilla", "ReviewID": "UR20466799", "Content": "I booked this hotel through Opodo as it had a good central location and was reasonably priced. I had also read some very positive reviews on it. Overall, I found the hotel okay - no nightmares - but there are a few points that may be of help to others planning on staying there. Firstly, avoid room 205 - it is very small and looks nothing like their advertised picture. The bathroom left a bit to be desired (mouldy walls etc) and the air conditioning unit hadn't been plastered into the wall properly (bare wires and holes). On the plus side the room was clean and the breakfast good but three nights in this hotel was long enough. All rooms are advertised as having a safety deposit box but in reality at least two of the rooms safes wern't working. When we questioned this we were told at reception that a new safe would be brought in and that we were welcome to use the one behind the desk. We asked 3 times and nothing was done - in the end we just felt a nuisance, but we felt disinclined to leave large sums of cash in a shared safe as this would be a risk for the hotel (they're leaving themselves open to accusations, surely) as well as us. So we ended up carrying all our cash around with us - not a great idea in a city where the main crime is bag snatching. I even asked if they had another room with a working safe but they said the only rooms they had left were triples and, no, we couldn't exchange. Funny, at breakfast we saw the residence of each of the 6 or so rooms and none ever had more than two people staying in them.... When we arrived on the first day at 11 am we were told our room would not be ready until about 1pm. Official check in time is 2pm so we came back around 1.45pm. We then had to wait a further 45 mins until we could get into the room. Goodness knows what they were doing in such a small room - could have cleaned it myself in 20 mins. Official check out time in the hotel literature was 12 noon but on our last day we were told to vacate the room by 11am. We also took up the hotel's recommended airport collection taxi service . This cost Euro 45. If you get a regular taxi from Fiumicino they can only charge Euro 40 by law, so this was fair enough. However, on our last day we were told by other residents about a service called Roma Shuttle, which only charges Euro 30 for 2 people back to the airport. We tried to book this through the hotel but were told it was booked up. They seemed to know all about it but hadn't told us. Unfortunately there was a train strike on that day too so we had to get one of their taxis back as well. Some general info that may be of help in Rome: You can buy metro/train tickets in the stations - we were told metro tickets had to be bought from a newsagents shop. A single trip ticket valid for 75 mins costs only Euro 1 - bargain! I had read that if you have a small appetite and only want one or two courses eat in a trattoria or pizzeria instead of a formal restaurant (where they expect you to have the full four courses plus wine). Well even the most basic trattoria was not very amenable when we said we only wanted mains and soft drinks. They charged Euro 7 - 8 for two Cokes. And they expected a large tip (the norm in the UK is 10%) So either ignor the rudeness or be prepared to plough your way through four courses!! And don't fall for any 'cover charge' as this is now illegal in Rome. Overall we did have a great time - Rome is an amazing city, and coming from London we felt very safe - there's not much violent crime there. So just wear your bag slung across you and enjoy!", "Date": "September 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florence, Italy", "Title": "“Best holiday yet !!!!!”", "Author": "cas45", "ReviewID": "UR20308868", "Content": "Well what can I say. This holiday is the most memorable to date. The hotel was brilliuant including all the staff who work there. They were so helpful and made our stay worth while. Also they took time out to greet us every morning as we tried to say a few words in Italian and they also spoke good English. The maids who served us at breakfast were great warm and friendly and our room was spotless we just couldn't fault anything at all. We would also reccomend this place to anyone wishing to stay in Rome as it was also a great location. Thankyou and a big Grazie to the Residenza Ki from Carol and Ian Manchester England.", "Date": "September 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Functional, clean and good value”", "Author": "Edjimundo", "ReviewID": "UR18498591", "Content": "Residenza Ki is fine for a basic short stay. Slightly confusing in that you check in a few doors down from the B&B - this had not been explained when we booked. Residenza Ki has a quiet, central location (five minute walk to the Trevi Fountain) and is clean and safe. Breakfast is fine and the staff are very helpful.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“everything was good,but just some problems that u need to know”", "Author": "IrelandYip", "ReviewID": "UR18271817", "Content": "the hotel name is different from the website that i booked with....the staff are good...cleaniness was ok,just they didn't change towel as we stayed there for 3 nights....also,the pillows weren't comfortable to sleep", "Date": "July 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Fantastic find in the centre of Rome!”", "Author": "LucyLogic8", "ReviewID": "UR18162383", "Content": "Ki is made up of a couple of apartments in a building a few doors along from the reception of it's sister hotel Fellini, where you check in. Diago was very welcoming, helpful and polite and our room 101, a triple, was a good size and in very good decorative order with great air con, a fridge, tv and comfy beds. The bathroom was newly refurbished (the water temperature was a bit erratic but we could live with that!) and the whole place was lovely and quiet. The breakfast was great with good choice and a nice lady serving. They were happy to hold our bags for us in a locked room for the day and ready with advice and suggestions at all time, all the staff were great. It really exceeded our expectations and was definitely great value for money for the location - maximum 20 minutes walk to most sights and we would definitely recommend it to anyone and will certainly stay here again. There's a great little restaurant in the next street called something like Pisca Piano which served lovely food at good prices.", "Date": "July 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Loved this place , Staff and Location superb”", "Author": "ozzykiwitravellers", "ReviewID": "UR17853822", "Content": "We stayed at this hotel in early June, The location of this place is so central. It is only minutes walk to the Trevi Fountaion, Spanish Steps, and the Coliseum. The metro is at the top of the street.not to mention minutes from fabulous shopping.The room was more than adequate being reasonably spacious by European standards, and also remarkably quiet considering its locale. We have to say that what made this stay so special was the people that work at this hotel.We arrived late in the afternoon ,we were greeted by a young man by the name of Diago who guided us through the map of the area pointing out the highlights and what to be aware of then helped us to our rooms, explaining where breakfast was served etc etc and all spoken in English which can alievate any stress trying to make yourself understood in a foreign speaking country .Reception is manned 24/7 and another delightful young man , Francesco made us so welcome and couldn't be more helpful, taking time from his busy job to explain things to us that we would probably have never known about . I have to say it is the people that make these stays so special and memorable. I would recommend this place anyone", "Date": "July 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Norwich", "Title": "“good location”", "Author": "6scootergirl6", "ReviewID": "UR16846627", "Content": "Stay for four nights in a double room. Rooms was clean, shower was either too hot of too cold some of the time. breakfast suffiicient and staff friendly. The hotel is in a fantastic location to walk to most of Rome's famous sights. Overall though had a lovely city break. Warning - taxi driver tried to steal some of our money by distracting my boyfriend as he got his cash out to pay him, luckily he spotted the taxi driving doing this. He was very quick and had obviously done this before. Would advice if using taxi for the person who pays to sit in the back of the vehicle. Take care, and have fun.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cumbria", "Title": "“Great value”", "Author": "holli63", "ReviewID": "UR16200977", "Content": "Stayed here recently and had great experience. Hotel clean and very friendly. Ideally located for all the sights. Only complaint was the cost of prebooked taxi (we arrived late at night so hotel arranged a taxi) -80 euros. Flagged a \"white cab for return to airport & it cost us 35 euros! Provided you do not want 4 star facilities this is fantastic value.", "Date": "May 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saskatoon", "Title": "“Great hotel downtown rome”", "Author": "RaeSK", "ReviewID": "UR16176848", "Content": "Residenza Ki is a great hotel with the perfect location for those wishing to experience the culture and sights of Rome. The staff is incredibly helpful and friendly! We stayed at both of their locations Fellini B&B and Residenza Ki. THe rooms are clean, the bathrooms are clean, you feel right at home. For us it was the staff that made the experience- they go out of their way to help you with whatever you might need - even asking the bar across the street for a bag of ice to cool our beer!", "Date": "May 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "UK London", "Title": "“A DUMP!”", "Author": "JeryA", "ReviewID": "UR16038417", "Content": "We had booked for 3 nights, but when we arrived the staff (Francesco) told us that we would have to change rooms in the morning, so our bags should be packed and ready to leave the room after the breakfast. When I asked for why this was, and what our next room would be he (Francesco) said that he didn’t know, But for the inconvenience he promised us a much better and bigger room, so we shouldn’t worry. So we packed our bags again and left them with the staff. When we came back to the hotel that evening we found that the room given us this time was a DUMP!!! The room was shabby, small and dirty. The bathroom was cramped and dirty with a shower that didnt have warm water half of the time. There was fungus on the shower walls (see pictures) and the shower was so dirty!! When we complained about this to the night courier he said that we had to wait to the morning as he couldn’t do anything for us. So we had to sleep on dirty \"double bed\" which was 2 singles put together with a gap in between so sleep wasn’t possible in anyways. In the morning we were told that all rooms where full and there was nothing they could do about this. When I questioned the fact that I had booked for 3 nights in a double bedroom and got 1 night and the rest been packing and unpacking and staying in a dump the guy from the staff said he apologizes about this and blamed it on Francesco. He admitted that it wasn’t unusual that staff would “sell” already booked rooms to tourists walking into the hotel, and that the situation with our room could have been such an event. That the room we got was the \"extra room\" in the hotel and not a normal room for customer already booking. What apparently had happened was that our room had been given to another quest because the hotel could get more money per night out of our room, and we who had booked in advance where given the worst and cheapest room because they already knew we had paid. As an evidence to this we have made sure to take photos of the room which was a dump, and also a letter from the staff in the Rezidenza KI where they apologize for the situation and admit to the fact that they changed our rooms in purpose to get more money. At end of the letter they ask us not to tell anyone about fraud as it would lead them to lose their jobs! I don’t recommend this hotel to ANYONE! For the money you spend you expect to go somewhere safe but this hotel and the staff are not trustworthy.", "Date": "May 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Homely Reidenza Ki”", "Author": "EssexEasyrider", "ReviewID": "UR14732735", "Content": "I would like to thank you on behalf of my wife and I for making us so welcome on our recent visit with you. I would especially like to thank Diego for his attentiveness and helpfulness, but indeed all of the staff were very helpful and made our stay idyllic. Your residenza was exactly the type of accommodation that I was looking for when booking, with charm and also an air of a family home – rather than the antiseptic atmosphere of the larger chains of hotels that are in large cities. We were lucky with the weather and cannot express the quality of the sites that Rome has to offer but that combined with the Residenza Ki made our stay just magnifico! Once again, many thanks for helping to make our visit so very special and I can assure you that I would not have second thoughts of recommending your establishment to any and all of my friends and acquaintances that might be contemplating visiting Rome in the near future.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Terrific Value, Great Experience”", "Author": "TripperToo", "ReviewID": "UR14601997", "Content": "I spent a lot of time reading reviews of hotels in Rome on the TripAdvisor web site before deciding on this hotel, and it definitely paid off. The Residencia Ki is a clean, comfortable hotel with extremely reasonable rates and an excellent location - just a few blocks from both the Fountain of Trei and the Spanish Steps. I arrived early in the morning with a reservation for two nights and was greeted enthusiastically, offered a cup of coffee and invited to sit down and have breakfast. After I finished eating I was very apologetically told that despite my reservation the hotel was overbooked for the first night of my stay, but arrangements had been made for me to stay at another, higher priced hotel a couple of blocks away with the difference in price paid for by Residenza Ki. I was escorted to the other hotel, where I was well received. Although that hotel was fine (it was priced about 30% higher) and I was ok with the accomodation, I found Residenza Ki, where I did stay my second night, preferable. The atmosphere there was warmer, less sterile and more comfortable. When I did check out before a full day of sightseeing, the staff at Residenza Ki was not at all hesitant to let me keep my luggage there to pick up that evening when I left Rome. As promised, they took good care of a parcel of easily breakable ceramic and glass gifts I had purchased. I stayed in several hotels while in Italy, and although I was pleased with all of them, Residenza Ki defintiely provided the best value and the best overall experience.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location, excellent service”", "Author": "koakakola", "ReviewID": "UR14523724", "Content": "The hotel is a little hard to find but the reception area is moving a couple of doors down which should make it a lot easier to find. The rooms are basic, but extremely clean and in good working order. The location is second to none, the hotel is very close to the trevi fountain, spanish steps and barberini metro....right in the middle of Rome's historical centre. The best part of the hotel is the service. Diego manages the hotel and is the most helpful person you could wish to meet. He suggested places to go, places to eat, made reservations for us, etc. His efforts really made this a great holiday and not just a good one.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location”", "Author": "blueDmx", "ReviewID": "UR14358355", "Content": "We booked this hotel through Lastminute.com. Firstly, the location is great! We didn't realise how good it was until maybe a second day when we decided to go through a little lane and came out by the Trevi Fountain which was a great surprise! Firstly, we couldn't find the hotel easily. There is no big sign and it took 2 trips up and down the street wondering if we had missed it to find it. (Tip: pay attention to the door numbers!!) We were greeted at the door and went up 3 floors... (there is no lift for those who would prefer it). We were told that we had to stay in a family room as they were over booked and then change the following night. This was fine with us.. until we went to sleep! Firstly the ceiling had a big hole in it which was covered by a blanket, and the bed was the most uncomfortable bed i think we've ever stayed in! It was creaky with every tiny move, the pillows were just rubbish. The bathroom was tiny and for a family room I was surprised at it's size. Anyway, we changed rooms the next day as we expected to, they told us in the morning that we could stay in our family room for the rest of our stay as they had a cancellation, but we decided to move anyway, we needed a good night sleep! Our second room was much better, even though it was off the reception/breakfast area. We did not find it very noisy but could quite possibly get noisy depending on how many people were staying. OUr bed was much better, but still a little hard, teh pillows flat and the room was freezing but once we worked out the aircon/heater it was fine. The bathroom was much better, more spacious than the last room so we settled in perfectly. The breakfast was simple and the coffees delicious. I probably wouldn't stay here again, purely for the comfort of the bed, however, the hotel is in an excellent location so would recommend on this basis for a short stay.", "Date": "March 18, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tel Aviv", "Title": "“Rezidenza Ki Rome”", "Author": "Daiana_60", "ReviewID": "UR12723988", "Content": "Dany, Tel Aviv January 17th,2008 We just returned from Rome. The family hotel Rezidenza Ki is in the middle of everywhere.You can walk to almost every\" must see\" place in Rome. The rooms are not big but clean.A chair and a small table would be nice.Nice accommodation and great location The second best thing to the location is the staff. First we met Diego who was very kind.10x Diego. On the next day and for the rest days of our stay in Rome there was Gigi. Gigi was more than helpful,very attentive, very nice and pleasant . He also helped us with the luggage . As it happened it was my daughter's birthday.As we sat down to have our breakfast we heard from the computer nearby the song \"Happy birthday\" and a delicious small cake with lighted candles was presented to her.Needless to say that we were extremely touched. They arranged a private car service to take us from and to the airport , which was a good service, and much appreciated. Thank you Gigi once more.", "Date": "January 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eastbourne", "Title": "“Welcoming and convenient hotel”", "Author": "studenttraveller1", "ReviewID": "UR11981269", "Content": "This hotel was a real find. Located in the centre of Rome it is within walking distance to all the attractions of the city and it is close to at least two metro stations that allow access to the outer areas of Rome as well. When we arrived we were made to feel very welcome wirth coffee and breakfast while our room was prepared (even though we arrived before check-in time!). Gigi, the local who works on reception, gave us a map and circled everywhere we needed to go. he knew how long we were staying and so recommended where to go and when, as well as where to avoid in order to avoid crowds and areas that were too touristy. Gigi told us all the local secrets and was able to recommend restaurants and detailed transport information. He was always friendly and ready to help with anything we needed. The room was lovely as was the atmosphere of the whole hotel, which is very small and cosy, making you feel priveleged to stay there. We were very lucky we found this hotel as it is a real treasure and made us feel welcome in a foreign and new city where we could easily have felt lost. The food and services provided were lovely, and very fitting for the price we paid. Overall, I'd really recommend this wonderful hotel and I will certainly be staying there if I return to Rome.", "Date": "December 27, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "athens", "Title": "“Perfect Receptionist Gigi”", "Author": "kaklis", "ReviewID": "UR11293100", "Content": "Very good place for a tourist . you can walk everywhere in the town. Clean rooms. Excellent service due especially to GIGI.", "Date": "December 7, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Suffolk", "Title": "“ideal location”", "Author": "SuffolkWil", "ReviewID": "UR11208454", "Content": "Excellent location. 2nd floor. adequate rooms - very good value for the price. Gigi so helpful and always makes welcoming coffee when you get back. Good advice about transport and the sights. Good value all round and highly recommended.", "Date": "December 2, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dublin", "Title": "“Brillant location”", "Author": "holiday0", "ReviewID": "UR10938574", "Content": "This is a great little residence, in a great location, only a stones throw from the Trevi Fountain. Plenty of little Restaurants, and bars right on its doorstep. A real taste of Rome. The room was spotless, with T.V. and DVD player, nicely furnished. Clean towels supplied each day and hot water in shower at all times. Great Coffie from GIGI the Manager, I will definitely go back, Gigi was very helpful and friendly. I dont think anyone could fault this little place. Breakfast also very good. Thanks GIGI", "Date": "November 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hobart", "Title": "“Great location and friendly staff”", "Author": "chinaplate", "ReviewID": "UR10841250", "Content": "On arrival Gigi made us welcome and even made a cappuccino. The information and friendliness Gigi and the location of this hotel made our stay. We were about two minutes from teh Trev fountain and short walk to the metro. The rooms are clean and suitable for families.", "Date": "November 15, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "catania", "Title": "“nothing less than a 4 star”", "Author": "polliciccio", "ReviewID": "UR10045632", "Content": "This place was just fantastic. Consider a little hotel, 10 rooms only, with a really friendly staff, new confortable rooms, all service included...nothing less than a 4 star hotel. And at least the location...you really stay in Rome. I'll definetely spend all my holidays in Rome there.", "Date": "October 6, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "japan", "Title": "“Great location!”", "Author": "akira2", "ReviewID": "UR8723246", "Content": "Hidden away in a normal street in a normal building, this little hotel was at first hard to find. Once found however, it was easy understand why other reviewers say this hotel is close to major locations! Within 5 mins from the Trevi fountain, who could ask for more? Dont expect a brightly lit reception. On arrival you are given your set of keys and shown your room. Its pretty much self-service - great for travellers who want to avoid the usual hotel experience. The rooms are basic but clean, and the service is friendly. At breakfast on the first morning, Francesco (owner?) gave us a brief guide of the city with the aid of a map. Hospitable and helpful man. The breakfast was simple but wholesome, and the kitchen serves a nice expresso to start the morning. Dont expect 5 star pleasures, but do expect value-for-money and a nice memory from Rome.", "Date": "September 16, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Clean large friendly helpful comfortable”", "Author": "thewendyhousen12", "ReviewID": "UR8619385", "Content": "Enquired about availability two doors away, full, staff telephoned Francesco, family room available, went straight there. Very nice welcome. Clean, comfortable room, good breakfast. Friendly atmosphere. Would definitely recommend to others and stay there again.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "england", "Title": "“Enjoyed our stay at the ResidenzaKi”", "Author": "kinverdave", "ReviewID": "UR8606080", "Content": "Just thought I`d let everyone know how much we enjoyed our stay at the ResidenzaKI hotel in Rome recently. The landlord Gigi could not have been more helpful, for example when we first arrived he insisted on carrying all our luggage ( family of 5 ) to our rooms, nothing unusual in that you may think, but when I tell you he had 2 suitcases under 1 arm, a large heavy one under the other arm, 2 shoulder bags around his neck and he carried them up 4 flights of stairs! , I for one was well impressed. He then gave us useful information about all the major attractions over complimentary drinks which were most welcome. The air conditioned rooms were nice, spacious and very comfortable. The hotel was well placed in a quiet street being centrally located and if we go back to Rome we will definately stay there again. Cheers Dave Kelly and family.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nice Hotel, brilliant location”", "Author": "LondonKevinM", "ReviewID": "UR8484034", "Content": "My daughter and I have just returned from 6 nights at the Residenza Ki. We found it to be a hotel that suited our needs entirely. As other reviewers have indicated there is not much of a front to the hotel. It is simply a door into a block of apartments. We arrived late but were met at the door, greeted by name and made welcome. Throughout the stay Francesco was friendly and helpful, without being too pushy. The rooms are simple, but they are clean and comfortable. Breakfast was what we expected rolls, cereal, croissants etc. It was fresh and tasty. The best feature of the Residenza is definitely its location. From the Hotel we managed to walk to everywhere we wanted to get to in about 30 minutes. The Vatican, Coliseum and Bioparc are all with 30 minutes walk. The Trevi fountain is about 2 minutes away with the Spanish steps about 4. There are so many restaurants with 2 or 3 minutes we tried several different ones each day and were never disappointed with any of them. The Termini station would have been a bit too far to walk carrying luggage so getting a Taxi was a good idea. The Hotel is not a luxury accommodation with everything provided in house, but then it does not charge for these features we did not want. For us it was a clean, warm and friendly hotel in a brilliant location.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect Location, average hotel”", "Author": "memoo", "ReviewID": "UR8441834", "Content": "This is a perfect location, only 2 minutes walk to the trevi and less than 5 mins away from the spanish steps. All major tourist attractions are definitely within walking distance. The room we stayed in was on the first level, which was a basic room. Had problems with the hot water (no hot water for the 3 out of 4 days we stayed there, but eventually fixed). Floors were dirty and had not been cleaned. Small room, with small bathroom. Good aircon. Breakfast was very basic. If you are arriving late I would highly recommend aiport pickup as we had to check in at another hotel and were then driven to Risendza Ki. I am not sure if we would stay here again. We found a great restaurant nearby called That's amore which served great pasta and meat dishes. Went back there a few times.", "Date": "August 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northumberland,", "Title": "“Five enjoyable nights in Rome”", "Author": "J_DNorthumberland", "ReviewID": "UR8354134", "Content": "A taxi, organised by the hotel collected us from the airport, as we were late arriving, this took us to register in sister hotel and then to the Residenza Ki, otherwise it would have been difficult to find. Overall it is clean, quiet, with functioning air-con. The staff were attentive and helpful, especially Gigi, with smiles and coffee. This is an excellent base to explore, central to the Trevi and Spanish Steps, close enough to walk to all the major sites. We stayed five nights and looked forward to returning to the room after a morning sight-seeing for a cool siesta, and then off to dinner. The atmosphere was relaxed but attentive. We slept well, unusually for us when on holiday, in comfortable beds and with the the optional hum of the air-con the only distracting noise. This is not a hotel in the sense of sitting areas and a bar, but it is a small and friendly pension which is welcoming and with rooms I looked forward to returning to after a hot days walking. Overall I felt good value for money, and I recommend it for your stay.", "Date": "August 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "England", "Title": "“Always helpful”", "Author": "Trific", "ReviewID": "UR8349446", "Content": "Centrally located in the middle of the main tourist attractions. The level of customer service from Gigi (the concierge) was exceptional. He was always courteous and especially helpful with advice on the best places to see. We really appreciated the coffee he offered upon our arrival and every day after we had walked around the city in temperatutes of 35C. The only reservation concerning the accommodation was the condition of the shower which frankly had seen better days and was in dire need of a complete re-furbishment. If you want a good restaurant nearby, try the Colline Emiliane in Via degli Avignonesi (parallel to via Rasella where the Resedenza Ki is situated). Good food and service, £22 a head for 3 courses and wine).", "Date": "August 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "ROME RESIDENZA KA", "Title": "“Handy, but some reservations”", "Author": "SAZANDPAUL", "ReviewID": "UR8252452", "Content": "We arrived at the hotel at around 1pm, and there was no easy identifiable signs. The only way we found out was the nice guy outside who appeared to camp out there 24/7! He and Gigi(manager) both helped with our luggage up the 2 flights of stairs. The first room we stayed in for one night was basic, dirty and and a dull room, and kept in a poor state of repair (the toliet seat was not attached properly, walls had numerous scrape marks, shower walls and shower curtain were dirty, pillows and bed spread/cover were also in need of a proper wash.) Gigi agreed to move us to the second floor, for our remaining stay. Our second room was not perfect but an improvement. The safe didn't work, nor did the fridge again the showers walls and curtain were dirty and the bed spread and pillows in need of a wash. On the plus side the air conditioning was a god send and worked well. Gigi was polite and helpful, breakfast was nice, basic but plentiful.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Folsom, California", "Title": "“Enjoyed our stay”", "Author": "dindio", "ReviewID": "UR8238215", "Content": "We enjoyed our stay at the Residenza Ki. We booked two rooms, one for two teenagers and another for my husband and I. The rooms opened out into the dining room, which we felt was convenient when we just wanted to eat before showering and getting ready for the day. Gigi was so helpful and showed us on a map how to get to where we wanted to go in Rome. The breakfast was very simple, but very good. We enjoy the typical European continental breakfasts. Gigi made the most delicious coffee and it felt very homey. The location was excellent, as it was very convenient to walk everywhere. We did have to carry our bags up the flight of stairs, however, Gigi came down and was more than happy to help us with them. It was like staying in a little private home. The teenagers had a triple, which was very roomy, and our room was a double which was smaller. We didn't mind. The experience of staying there was nice. Thanks for a nice stay Gigi. Mike and Phyllis, California", "Date": "July 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Rome”", "Author": "Welshie21", "ReviewID": "UR8231293", "Content": "Our requirement was for somewhere conveniently located, clean, reasonably priced and where we could just crash. We were visiting Rome for 2 days and wanted to pack in as much as possible, so time was crucial. Despite a check in time of 2pm, we arrived at 8.30am and were offered coffee and breakfast whilst the room was checked. We were able to leave our bags in our room. GG the hotel manager was helpful in showing us how to get to sites and advised us of some that didn't appear obvious in the guide books. The next day we were able to leave our bags in the room and check out later in the day. When we returned at 6.30pm we were again offered drinks whilst GG ordered a taxi. He told us the mamimum we should be paying. He waited with us until the taxi arrived and informed the driver we were aware of the max price. GG was friendly, curteous and nothing was too much trouble. Remember this is a 3* not a 5*. There is no sign outside the hotel so you need to look for the number. Previous reviewers had said it was hard to find. As we were aware of this we had no trouble in finding the hotel as we were not looking for an obvious building or sign. Jacqueline, Lynn and Lisa", "Date": "July 25, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Mexico", "Title": "“Bad place to stay!”", "Author": "EChy", "ReviewID": "UR8221609", "Content": "Not a nice hotel. It is not even a hotel, it is more like a bed and breakfast. You pay a lot more for what you get. The rooms are not nice, nor clean. The staff was not helpful at all. The only good thing was that it had a good location, but other than that for that same price you can get a much better hotel in rome.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "NY, NY", "Title": "“Go Elsewhere”", "Author": "KenfromNY", "ReviewID": "UR8190819", "Content": "We booked this hotel based on feedback on TripAdvisor. I am still wondering how people gave it positive reviews (or how it has a 3 star rating). It was unquestionably the low point of our two week vacation in Europe. First, let me say that the front desk staff tried to be helpful while they were there (8 am to early evening each day). But so did the crew on the Titanic. When we checked in (we had two rooms), I was told that I had to pay for everything up front. That alone should have been a warning. Unfortunately, I ignored it. The rest is a blotch on a great family experience in Rome. My wife and I stayed in Room 5. The sleeping area of the room was dirty (and trust me, I'm not being picky). I opened the doors to the armoire, sent some dust flying, and quickly closed them. The shower stall was rusty, the shower was curtain ripped, there was dirt hanging down from the bathroom ceiling fan, and there was serious black mold growing on the bathroom walls. If asked for a one word description, I would have to pick DISGUSTING. I immediately asked for another room, and was told they were all booked. In retrospect, I should have just taken our luggage and left. There were continual problems with hot water. Of the five nights we were there, we showered in cold water three times. And when the hot water went out after 6 pm, there was no one there to \"fix\" it until the next day, as there is no staff on site in the evening. We even tried to call the emergency number one evening, but it was just the front desk number! My kids had problems with the air conditioning in their room. They too showered in cold water. And their room didn't even have a phone. The general areas have marks on the walls, and are in serious need of painting and a new floor. There are wires hanging from the ceiling in the reception area. On this trip, we stayed at b&b's in Paris, Florence, and Rome. The others were fine; this one was terrible. Our suggestion is - find any other place to stay.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Different”", "Author": "mirlag", "ReviewID": "UR8107642", "Content": "Residenza Ki was a new kind of experience for me. It is on the 3rd floor of an apartment building with no elevator. It is laid out with the reception desk facing the entry into the residence. To the right is a small eating area with 4 tables where breakfast is served. Three bedrooms are right off of this area and a few more bedrooms are off to the left of the reception desk. When we stayed at Residenza Ki, Diego was the whole enterprise, with the exception of a maid. Diego is a very nice young man whose English is excellent. He made excellent recommendations for restaurants. He was always pleasant and friendly. Residenza Ki is in an excellent location----a short walk to the Trevi Fountain and the Spanish Steps. The location and price were two of this \"hotel's\" strong selling points. The third selling point was that reviewers on this site rated it high for cleanliness, which it was. The first room we stayed in was small and the bathroom tiny. The second room we got, upon our return from Florence, was a triple and a nice size---a definite improvement on the first room. However, both rooms are somewhat austere. The breakfasts were fine. One night and for most of the next morning there was no hot water. When we arrived, Diego said that their computer system was down so that we would not have internet access. He said that he was hoping it would be fixed soon. My husband, an electronics and computer expert, checked around in the evening and easily hooked easily hooked us up to their system, which was not really broken. We were able to use our computer during our entire stay. Interestingly enough, the last morning of our stay, a Brit, who had recently arrived, asked about internet access. Again Diego said that the system was down, which was not true since we had just hooked up a few minutes earlier. Would I stay there again? Not sure. If I did, price would be the only lure. By American standards I would rate Residenza Ki as a two star.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "dublin, ireland", "Title": "“great!!”", "Author": "shane-murray", "ReviewID": "UR7808108", "Content": "great stay, nice little quaint hotel at a reasonable price. we left a bad hotel and booked this with an hours notice. the receptionist couldnt do enough for us and he was helpful in any way possible. beds comfortable and spacious room. great overall!!", "Date": "June 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Farnham, United Kingdom", "Title": "“Friendly and Central”", "Author": "Lindy61", "ReviewID": "UR6789289", "Content": "Simple but very well done. Our room was spotlessly clean. We had a large room, 203 on the same floor as reception. It had a tiled area with a dressing table and 2 easy chairs then a step down to a double bed this area had a wooden floor. we had a small en suite bathroom with shower. We sometimes found it hard to regulate the water temperature, but there was always pleny of hot water. The temperature in the room was perfect. Breakfast was delicious, continental with pastries, rolls, meat, eggs and cheese. There was fresh fruit and cereal as well. The coffee was fresh and made just as we ordered. This hotel was in a really central location. We walked to the Trevi Fountain, Spanish Steps and the Pantheon. It is a five minute walk from Baberini Square with it's Metro Station and open top bus stop, these put you within easy reach of St Peter's and the Colloseum. However the hotel's situation on a small side street meant it was very quiet. We ate well but especially enjoyed Pepys Bar on Baberini Sq for lovely sandwiches, cakes and coffee to die for, and also Valentines Gelataria on the road to the Trevi Fountain from the Hotel. But I have left the best until last this hotel is 5 star because of it's excellent staff, from the minute we arrived early and dripping wet to the moment we left 4 days later after a late check out, we were treated like royalty. Nothing was too much trouble we were welcomed with coffee, talked through restaurants and given directions for sites. On our reservation I had put a request for foam pillows and this had been noted and was one of the first things Gigi spoke to me about, I always make this request and usually have to ask again once I've checked in, this level of service makes customers feel very special. Firstly Gigi and then when he went on leave Francesco looked after us very well. We would certainly recommend this hotel to our friends and would go back ourselves in a heartbeat. If you want a really Italian experience you can't go wrong. BTW our bed was also a little lumpy and a bit creaky but we slept soundly and woke without backpain on all 3 nights which is unusual for us!", "Date": "February 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norway", "Title": "“Great location, friendly staff”", "Author": "NOR_OZ", "ReviewID": "UR6752425", "Content": "My partner and I stayed three nights at the Residenza Ki at the beginning of February, and we were very pleased with the stay. The staff is very friendly and serviceminded, and at a arrival Gigi welcomed us with a cup of coffee and sat down with us to show us the map of Rome, pointing out what we should see and how we could get there. The room was clean, had nice timber floors and a tiled bathroom. We had no problems with the shower. Breakfast was simple but nice (filled croissants, breadrolls, ham, cheese, juices, cereal, milk and fruit) and we appreciated the coffee - real espresso - made from freshly ground coffeebeans. We did all sightseeing by foot, and the hotel is very close to many main attractions, and shopping on Via Del Corso is also just a stroll away. We would stay here again and can recommend this to anyone on a budget wanting value for money.", "Date": "February 7, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Brighton UK", "Title": "“Great hotel”", "Author": "nicktaylor25", "ReviewID": "UR6715747", "Content": "This hotel is in a great location, just a couple of minutes walk from the Trevi Fountain and Spanish Steps. We spent 5 days in Rome and did not get any public transport but managed to see all the sites on foot. The hotel is very small, but is run by a very helpful and welcoming man (Gi Gi). He provides a map upon arrival and circled all the main attractions. The room was nice, with a good and fully functioning bathroom (good shower). I would say that the bed could have been better as it was pretty uncomfortable and very squeeky. Other than that, no complaints. The breakfast is simple but very nice - cereal, fruit, toast and great coffee. I would reccommend this hotel for a short break, if a budget hotel is what your looking for.", "Date": "January 30, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bristol", "Title": "“Great location”", "Author": "BabyTBristol", "ReviewID": "UR6610767", "Content": "The hotel was clean and the staff were friendly. The room was quite small, but I guess that's what you get for a reasonable price in the centre of rome. The shower took ages to warm up and didn't drain well so the bathroom floor got flooded. There is a fridge in the room which was handy but it was noisy so I had to unplug it during the night in order to sleep. The location was great though, we manged to walk everywhere we wanted to go and as it was such a good location that we didn't spend much time in the hotel anyway. I would recommend this hotel as good value for money, but don't expect luxury.", "Date": "January 17, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sydney", "Title": "“But we booked to stay at Residenza Ki!”", "Author": "MopheadSydney", "ReviewID": "UR6545743", "Content": "We made a website booking on lastminute.com to stay at Residenza KI from 27 December to 29 December 2006 and paid in advance . The hotel promptly responded to our advance emails about a taxi transfer and we were duly picked up from the airport on arrival. However, when we reached the hotel we were told that we had to spend the night at the sister hotel, Hotel Saturnia (about a 10 minute walk away). This was extremely annoying since the reason we had chosen Residenza Ki was due to its central location. Residenza Ki arranged for the taxi to drop us at the sister hotel where we then spent one night. The next day Residenza Ki moved our bags over to the correct hotel and paid for our return taxi to the airport (45 euros) as compensation. I do not consider it is OK for a hotel to overbook you, particularly when you have paid in full in advance and the hotel knows for sure you are coming because it is sending a taxi to the airport to pick you up. On a better note, the staff at Residenza Ki were very nice, the accommodation basic but clean (unreliable showers) and the location great. Check out the history of Via Rasella if you stay there because it is interesting. We would stay there again if we could have the guarantee that we would be staying there ! The sister hotel is in fact of a slightly higher standard but that's not the point.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Brilliant Hotel!”", "Author": "jojojinx", "ReviewID": "UR6532362", "Content": "This is a great Hotel, easy to find and only a few minutes walk from the Trevi Fountain. The staff are freindly and we were greeted by a cup of coffee and and were given advice on the best way to get around Rome etc. The room itself was clean and although not huge it had everything you would need. The breakfast was fresh every morning, and you can come and go as you please all through the night. We will definately stay here again. :)", "Date": "January 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "leicester, England", "Title": "“good location hotel not bad”", "Author": "nije", "ReviewID": "UR6452949", "Content": "We booked after reading the reviews on tripadvisor. The location is very good only 200 meters from the Trevi fountain, and easy reach for Barberini metro stop. Hotel is hard to find and the front door looks just like a private house. The owner is very helpful and explained TV etc. Room was clean but bed was old and uncomfortable. Shower was 'iffy'. He recomended' Al Bochella' restuarant which was quite close and very good. No breakfast on check out day even though information said it was available from 8.00 no one was there.(our room was on a different floor with no access to dining room unless someone unlocked it.) Overall not too bad and fair price, but i have stopped in better for the price.", "Date": "December 17, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Location Location Location”", "Author": "CDV&HA", "ReviewID": "UR6313987", "Content": "We were looking for a place for a girly (40th birthday weekend) somewhere you didn't need to get a bus or a metro before you started your day, not hilly, not too expensive and near to the Trevi Fountain.it took a long time to find it but we were so glad that we did - well Karen did. I agree with the other reports say the room (we booked a triple) was very spacious, comfy beds, air con - mini-bar etc. tasty breakfast .. We found ourselves at breakfast wondering how it must have been when it was an apartment. A very homely place to stay in. The most fantastic thing was it's location! (5 mins from 2 famous landmarks and the Barberini metro station) We came out of the 'door' crossed the street walked down a bit, round the corner and there it was La Fontana di Trevi. Day or night it was beautiful as were the Spanish Steps.We mixed sight-seeing, shopping (bought a few handbags in the Carpisa shop), eating etcc. and didn't get lost once (our hubbies don't believe us) Went to a concert in a nearby church - mix of opera & classical which was nice. I love to see the t A small guide book and comfy shoes is all you need to see lots of famous landmarks. We took the metro to the Vatican - and went into the castell which was built for Hadrian (a bit of his wall is nearby our home - felt quite important!). Our weather for the 22nd of September was glorious. Even used a bit of sunscreen ?? We did find it a bit of a nuisance having to check in at the sister hotel (our flight came in at 9.30 pm) but we had prebooked a taxi with the hotel from the airport and I made sure it took us to both hotels. What was more of a nuisance was having to take our luggage back to the sister hotel to store it (our flight left at 10pm). However, it did let us see that we had chosen a much nicer, quainter part to have stayed at. Would recommend anyone to stay here. Have friends going out in January - quite jealous actually.", "Date": "December 1, 2006"}], "HotelInfo": {"Name": "Residenza Ki Rome", "HotelURL": "/ShowUserReviews-g187791-d619010-Reviews-Residenza_Ki_Rome-Rome_Lazio.html", "Price": "$104 - $361*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Rasella 53</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "619010", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b5/1f/b51f2ecce8d7d4f249fc8a0f15ad169e5large.jpg"}}