{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Just what we expected”", "Author": "1BenjisDad", "ReviewID": "UR139525868", "Content": "We wanted to spend a week in Ocean City with our dog. Barefoot Mailman was the principal option because it is the only completely dog friendly hotel and it is located in a good area. The reviews suggested that the hotel would be small but comfortable and well located. The rooms would be clean and up to date. The people would be welcoming and accommodating. We didn't expect Las Vegas. We expected Ocean City. That is exactly what we got. The room was beautiful, we had a great view, the location was perfect, and my wife, I, and our pet had an outstanding week. My suggestion to the front desk, which they said would be followed up, was that they prepare a detailed,listing of pet friendly restaurants and other facilities that would be handed to visitors upon arrival. I happily recommend Barefoot Mailman.", "Date": "September 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "greenfield township pa", "Title": "“Very Pet and People Friendly!”", "Author": "DebbieW112", "ReviewID": "UR139203364", "Content": "We just checked out of the Barefoot Mailman today and because I rely on reviews I wanted to praise this hotel. The rooms are beautiful. Mattress was fantastic. We opted for the efficiency which was spacious. Everything was completely remodeled. We had a problem with the towel bar in the bathroom, fixed immediately. Housekeeping was great. Only complaint noise from coastal highway which hotel has no control over. Oh and then there were the biting flies at the beach, again OC problem not hotel.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olney, Maryland, United States", "Title": "“Best of the best if you need pet friendly accommodations”", "Author": "Lorali G", "ReviewID": "UR138895266", "Content": "Check-in was a breeze, dogs got a goodie bag and we were given info about pet friendly restaurants and beaches (never knew there were any in OC). Room was VERY clean and you would never know pets stayed in them. Surprisingly, they were quiet as well. Obviously the motel took the time to insulate their rooms VERY well. Parking was great, we were always able to find a spot anytime of day or night. Adequate areas to walk our dog and if you forget your poo bags, they have bags available for free. The pool was very clean. All of the guest in the hotel are pet friendly as well, even those who did not bring their pets. Located on 35th street, very close to may attractions, restaurants and shopping. Balconies on each floor are individual and have your own entrance to the main walkway We will def return to this hotel in the future!", "Date": "August 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Springfield, Virginia", "Title": "“Pet and People Friendly”", "Author": "William H", "ReviewID": "UR137088389", "Content": "Needed pet friendly accomodations for our Ocean City, MD vacation and so glad we discovered the Barefoot Mailman. Very friendly and accomodating staff and our third-floor room featured a full-size refrigerator, microwave (that also serves as an oven), two electric stovetops, pots/pans/cooking utensils, dinnerware (plates, utensils, cups) to serve six, kitchen sink, coffee maker, toaster, flat screen HDTV, free in-room wi-fi, a large bathroom and additional wall mirror/sink/full-size bathroom counter adjacent to one of the two beds (queen size and twin). Room also contained a round table with four seats and large dresser. There was ample room for our large dog crate and luggage. Just outside the main entry was a small patio seating area with two chairs. There is an elevator, small outdoor pool, and ample parking (limited, tight parking beneath the motel and a larger, exterior lot adjacent to the hotel that requires passcard access--provided at no additional charge). There is a small area adjacent to the parking lots for pets to do their thing (waste bags and covered trash can are provided on site). The facility is about a three-minute walk to the beach (it's on the Atlantic side of the main thoroughfare so there's no street crossing required). The room could have been cleaner (e.g., uncarpeted white tiles leading to the bathroom and within the bathroom, plus the bathroom itself) and if you're seeking four- or five-star accomodations you will be highly disappointed; however, was merely a minor nuisance. Being able to keep the dog with us in a relatively clean room with the ability to prepare all our meals (saved big money eating in vs out) was a big plus. Only drawback was we could not take our dog on the OC Beach (prohibited from May to October) but found we could (and did) take our leashed dog onto the beach at Assateague National Seashore's beach (about a 15-minute drive from the Mailman--there is a modest fee to enter the site but it's worth it as the beach is huge and very clean). We will definitely check Mailman availability whenever we plan a future OC, MD stay.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, Maryland", "Title": "“\"How do we love thee....\"”", "Author": "caroledavesofiezoe", "ReviewID": "UR136322461", "Content": "We visit the Mailman twice a year, in July and October. Two very friendly cavaliers accompany us each visit. We've watched our favorite place go from very, very nice for family and pets to \"WOW\", can't believe the wonderful changes made each year!\" The Mailman is NOT a place for dogs only; and sorry pet owners, settle for what you can get if you want to take your pet to the beach. NO, this is a classy place with the best staff anyone could ask for, especially at a beach resort without an international name (ie, Hyatt). Everyone is friendly, accomodating, even pampering, if you choose, very clean, caring, and genuinely happy to have you and your pups visit. The pool is lovingly cared for and always receives excellent ratings from the city inspectors. There are many repeat visitors, (with and without pets!) that many of us look forward to seeing each year because we have all become part of a summer family. This also includes many staff members at the Mailman who greet us and treat us with genuine affection. How many other O.C. lodgings do that for their \"friends\"? I really could go on and on, but in closing, we must give kudos to Stevie, Joy and the other wonderful staff members at the Mailman. This is truly a great place to visit!! SOFIE, ZOE & FAMILY", "Date": "August 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lancaster, Pennsylvania, United States", "Title": "“Barefoot mailman”", "Author": "hacarr88", "ReviewID": "UR136262419", "Content": "Best place I stayed at in OCMD. Great price, huge room and huge beds. Great view. Extremely clean, quite and wonderful staff. They truly love animals. Best pet friendly motel. I would definitely stay there again.", "Date": "August 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena", "Title": "“Clean, very well kept, VERY PET and human friendly with kind front desk personel.”", "Author": "Liv2dyv", "ReviewID": "UR134616455", "Content": "I chose this hotel as it was close to a friends condo. The hotel let me park here early in the am prior to check in and remain parked the entire next day. Since it was listed as pet friendly, I was a little worried.You know, yapping dogs and such, but no such occurrences. My room was on the 3rd floor and very nicely accommodated. The only issue I had was the overpowering smell of Lysol. While I know I am a sensitive person, it was really strong. I spoke to the front desk at check out and they told me that should not have been the case and they wished I had brought it to their attention when I first checked in. If I had been spending more than 8 hours in the room, I would have but as it was, I was only there one night. Monday is trash pick-up so be prepared to be awakened at 7am by a very loud BANG! I think a little sound/weather stripping around the door might help this situations/ I would definitely return to this hotel if I had a pet. The price was great for the room, especially in Ocean City Maryland.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Woodbridge, Virginia", "Title": "“Not just dog friendly but DOG FRIENDLY!”", "Author": "Backofyourmind", "ReviewID": "UR134395205", "Content": "I thought this motel was fantastic. Great location, beach is nearby and less populate than down by boardwalk and the front desk staff was very nice. Rooms are nice and clean,recently seem to have been renovated, and everything just makes you comfortable as a dog owner. The front desk gave me doggy treats for my labs when I checked in as well. I will stay here everytime that I come to Ocean City in the future with my dogs. Oh, and they have a doggy walk and the buffet at castle in the sand is a steal!", "Date": "July 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Love the Barefoot Mailman!”", "Author": "Amy S", "ReviewID": "UR132728826", "Content": "This past week was our third year at the Barefoot! Every year it gets better as you get acclaimated with the surroundings! 10 blocks from Seacrets - Coconuts beach bar at your back door - and 5 blocks (ish) from the Boardwalk! They are super great with pets. Not a place where \"yea we take pets but we don't like them\" - this staff actually is very friendly with the pets and very accomodating to them (welcome bag!). The hotel is well kept and clean. This hotel may not have an ocean view but is only steps from the beach! This hotel has the best sunsets from the 4th and 5th floors! We are sunset watchers so it's the perfect place for us! Thanks Barefoot for another awesome stay - we'll see you again next year!", "Date": "June 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Good for parties with pets only.”", "Author": "dobbys_sock", "ReviewID": "UR131927067", "Content": "The Hotel: It's average. It is oceanside but does not face the ocean; it instead faces the highway. If you're high enough up, you may have a nice view of the bay. Nice landscaping and clean (surprise because of pets). The room: Very nice in appearance. We stayed in a recently-remodeled efficiency which included a refrigerator, freezer, sink, two burners, and numerous kitchen supplies (pots, pans, plates, cups, bowls, silverware, measuring cup, etc). Two big complaints: extremely uncomfortable beds and absolutely no WiFi signal whatsoever. Pet-friendly: Indeed it is. Caveat emptor: if you are traveling with your dog, you will not receive room service unless you stand there, holding your pet, while staff cleans. I personally find this absurd - of course, I understand that it is for the safety of staff, but they will not even clean if you remove the dog. You may also want to think twice about bringing your dog to Ocean City: from May to October, the dog will not be permitted on the beach or the boardwalk (min. $25 fine). Our poor pup seemed miserable because he couldn't partake in many aspects of our vacation. There is a dog park on 94th Bayside, but you must purchase a pass at City Hall in advance. Bottom line: Barefoot Mailman's only real appeal is its pet-friendly policy. Otherwise, it's just your typical OCMD hotel.", "Date": "June 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Cumberland, Pennsylvania", "Title": "“Very Nice”", "Author": "MICHAEL D", "ReviewID": "UR131759973", "Content": "This is the third time that we have been to the Barefoot Mailman and every time the staff and accommodations have been very nice. They were very nice to us and loved out pet. We went for a three day weekend and they told us about Petco where we took our pet for the day. They did his nails, cleaned his ears, brushed his coat and took him out for exercise. We dropped him off at 8 am and picked him up at 6 pm. All that for $26!! We had the day to ourselves and our pet had a great time.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great Price”", "Author": "TravelAssistant712", "ReviewID": "UR131571807", "Content": "I have never stayed in a Motel before, and this is definately a motel. But, i have to say, they are a fantastic choice to stay if you have pets coming on vacation with you. They are family owned and have a larger hotel down the road, but their motel does allow pets. The rooms are a bit skeevy & dark, i wouldnt use the kitchen, and felt icky when in the bathroom.... but i did see the cleaning people cleaning all ofthe bed sheets including teh comforters in their massive washer machines which are out in teh open when your coming and going if they leave the door to the room open. It was safe for my pets, convenient to the beach and a short drive to the boardwalk. I called last minute to stay for labor day weekend once, and got a rate of $100/night which was fantastic. They do have a small chincy pool.... but the beach is a 2 minute walk behind the motel, so its not worth it, its nothing special. They do have parking both covered & not covered. They dont offer a breakfast, but they do offer i believe a discounted breakfast at a local hotel which was okay... but i would recommend mcdonalds over it. The office staff was extremely nice, but they are only there during the day and go home at night.... so their is no overnight security/staff....", "Date": "June 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "alexandria, virginia", "Title": "“Dog Day at The Beach !”", "Author": "esdugo", "ReviewID": "UR128499146", "Content": "The more travelling I do based on the reviews from TripAdvisor, the more I realize that everything is relative. My expectations can get disproportional to reality if I put too much weight on reviews from people with less travelling experience or those that posess more tolerance to conditions I may consider below standard or discomforting. I can only compare with other places I have visited and with each travel experience my perception of the perfect vacation destination is forever altered. For me, the fun of traveling lies in discovering the unknown and sharing these truths honestly with fellow travelers. From April 15 - 18, 2012, my wife and I along with our new dog stayed at The Barefoot Mailman Motel in Ocean City , Md. This was our dogs first trip to the beach and we were lucky to have found a place so welcoming of pets. We stayed in room 205, which is the first floor, elevated over the parking area on ground level, and overlooking the pool. Upon arrival our dog was given a bag of treats which was very nice of then to provide. Check-in was slowed down by some computer glitches but we were in our room within 10 minutes of arrival. The folks at the desk were very friendly and made us seem very welcome with our slightly nervous dog in the lobby area. Covered parking beneath the building provided easy access for unloading the luggage from the car. There is also an elevator, but we just used the steps for the extra exercise. They also provide poopy bags near the alley where dogs can walk and do their business. The room had 1 king bed and one double bed and was slightly more spacious than a standard motel room. The kitchenette area was well equipped with what appeared to be new appliances, large refrigerator, 2-burner cooktop, toaster, coffee pot, dishes, utensils, sink with soap and towels. There was an additional sink/mirror/vanity top next to the bed which functioned as an after-shower, get-ready to go out preparation area required by most women. Since the bathroom was too small and lacked any counter or storage space, this was a suitable alternative and allowed one person to get ready while the other showered. The new tv was small but did the job and the remote worked well. I liked the fact that they printed out station guides and had them laminated so you can figure out what station you want to watch without just searching until you find something. I wish all hotels did this because its really annoying trying to figure out a new cable system when your brain has been programmed to the one at your home. I was informed that since they allow pets, they have to wash the comforters each time an occupant leaves which is not customary in the hotel industry. My wife actually oberved a large pile of comforters in the laundry room awaiting washing which supported their claim. The hotel is the third building back from the beach, and its just a short 2-3 minutes from room to beach. ...... which now leads to the cons: The rooms actually face Coastal Hwy with nothing except a few pine trees to block all the noise from the traffic. If you are used to this it wont bother you at all. Since it is situated fronting the Hwy, it does not have an ocean view. At night with the doors closed and the a/c running it was relatively quiet with the exception of a few loud motorcycles, sirens from emergency vehicles, and the occassional thumping from room above. The a/c itself was another issue; every time the compressor cycled on or off it made a loud pop, which woke me and the dog up numerous times. Ou dog got so frightened by the sound that she crawled under the bed for safety. I eventually had to turn it off because the room got too cold if I tried to turn it all the way up to keep it from cycling on/off every five minutes. Advice:bring earplugs to sleep. The first night of \"sleep\" was very restless due to intermittent awakenings and the harder than usual mattresses that gave both my wife and I stiff backs in the morning. I really like firm mattresses and sleep on a firm Tempurpedic, but this was beyond firm without relieving any pressure points. We did not use the cook top so I cannot comment but I did notice that any counter space needed for any cooking must have been an afterthought. One little nook, with a toaster and coffee pot and a cutting board with maybe one square foot of space would challenge any Iron Chef. The dish rack that would be used to allow clean dishes to dry was stored under the sink, but if you wanted to put it somewhere to actually perform its intended purpose, you'd be out of luck. There was NO lighting in the kitchenette area aside from the small light on the microwave. The light fixture above the nook was missing, with just bare wires exposed. The light from the window with the blinds open helped during daylight or you could open the bathroom door and let the light shine into the kitchen area. Not very well thought out. Overall the place seemed dark and lacked sufficient, modern lighting. The only other issue worth mentioning has to do with other pet owners and not the hotel itself. Every morning around 6:30 am we were awoken by two yapping dogs which I assumed were the twin Dachsunds that let everyone know of their presence by yapping at everything. Lets face it, all dogs bark, thats what they do. But for an owner to let it go on and on and not provide any discipline is beyond inconsiderate when your sharing a living area with other pets and owners. This is not the hotels fault although they might step in and remind the early risers that some people like to sleep past 6:30 on their vacation and try to keep pets quiet until a more reasonable 8 am or so. Overall, the stay at The Barefoot Mailman with our dog was worth the price since a three night stay with the $10/nt dog fee and taxes came to just over $200. I've stayed at hotels in OC where that will barely get you one night. It was the off season, but the weather was decent and we enjoyed the time with our dog. PS, there is Bayside Park at 127th street that is a great place to walk dogs and walk out on the pier to catch sunsets and take pictures. Go in the evenings when fewer people are out. If we came back with our dog, I would probably stay here again. If we travel without the dog, I would look for an Oceanfront hotel like the Quality Inn at 54th St, only because I'm a beach person and like to be as close to the water as possible and away from the noise and traffic of the streets. Although the hotel is in the process of remodeling ( I was told the bathrooms come next year ) it still has the look and feel of an older hotel. Many of the hotels in OC are just run down by years of tourist traffic and some are just simply disgusting. This hotel would rank slightly above average. The owners/operators seem to have an honest desire and are making an effort to improve the quality of the rooms. In some ways they have made progress but they still have more work ahead. Take your dog and enjoy the trip, I'd love to hear from everyone who reads this and goes to stay here. Until then, live well.", "Date": "April 24, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Great place to stay!”", "Author": "hlnkid", "ReviewID": "UR128380215", "Content": "I stay at the Barefoot Mailman each Spring for a few days with my 2 small dogs, and am never disappointed. It is always clean and well kept, the newly renovated rooms are beautiful and they now offer free wifi access. The staff is always friendly and helpful. The excellent cleaning staff visits each morning to change over towels, soap, trash, etc. Location on 35th street offers easy access to downtown Ocean City, Fenwick Island, etc. And only a block walk to the ocean. I love it as do the dogs. My only negative is that the mattresses aren't all that comfortable. Work around that and you can't find a more reasonable stay at the beach with your pooches. I highly recommend the Barefoot Mailman.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kingsville, Maryland", "Title": "“Pleasantly surprised...will be back!”", "Author": "Dino1959", "ReviewID": "UR126652818", "Content": "We just returned from a weekend at the Barefoot Mailman and plan to visit many times again! I wasn't sure about a hotel that actualy allowed pets, thinking that the place would be run down and smell from years of pet visits. Was I surprised!! The hotel was cleaner than some of the \"humans only\" hotels in OC. The room was large and recently renovated. The balcony area was a great place for my dog to watch the world go by. The staff was friendly and you can tell that they are pet lovers. Milkbones in the lobby area too! The Wi-Fi was great and easy to access. I can be quite picky about rooms and I couldnt have been more pleased. I would highly recommend the Barefoot Mailman to anyone with dogs!!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westminster, Maryland", "Title": "“Like Coming Home”", "Author": "Wickedladyj", "ReviewID": "UR126211126", "Content": "My family & I have stayed at the Barefoot Mailman for several yrs now. Our Vacations only get better with each yr. All the Barefoot Staff ensures that your stay will be made a Special one. I just came back from a short stay and the \"NEW\" look is a just Beautiful. All the units have been Redone from Ceiling to floor. High Quality Furnishings. This is a Must See! Just Lovely! I can not wait to return this summer. Jvb258", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Greenbelt, Maryland", "Title": "“Great for families with dogs!”", "Author": "Karen B", "ReviewID": "UR122895499", "Content": "We have stayed at the Barefoot Mailman several times. We went the first time because they allow dogs, and we had 2 big dogs traveling with us. We have returned because of the great service we have experienced each time we have visited. The staff are very friendly, helpful, and understanding about the dogs. The last time we stayed here, they even had a goodie bag for the dog when we arrived. When we decided to stay an extra night, and the Barefoot Mailman was booked, they helped us make arrangements to move over to another local hotel for that night. Plus, it is walking distance to the beach! The Barefoot Mailman in Ocean City, MD is our favorite place to stay for family trips. We love it!", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Pet Friendly!”", "Author": "itmeitmeitshlb", "ReviewID": "UR122205151", "Content": "Friendly staff. Clean rooms. Comfortable beds. What made Barefoot Mailman stand out was they semed to care for animals. There are hotels that accept pets but the Barefoot Mailman is truly a pet friendly hotel.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Very clean pet room”", "Author": "dogzrule", "ReviewID": "UR120550285", "Content": "The pet room was kept in great condition and you can tell that it's family run. Nice to stay in a pet room that is immaculate. Great deal.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Weirton, West Virginia", "Title": "“Best on the shore for your four legged friends...”", "Author": "Gail8269", "ReviewID": "UR120047963", "Content": "We have stayed at the Barefoot Mailman for the last several years. The rooms are affordable, big, clean and comfortable. The location is fabulous - just a quick walk to the beach. The staff is friendly and efficient. If you're looking for a place to stay with your pets (or even without) this is the place to be.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great place to book with your pets!”", "Author": "BiscuitnBrisket", "ReviewID": "UR119666971", "Content": "When I entered the room, the first thing I noticed was that it did not smell of animals. I have been to other hotels where they don't allow pets and they smell musty. The furniture is a little old but everything was clean and comfortable. They gave a treat bag for my little girl and she loved it. The staff is very friendly and helpful. They obviously love pets and have a little area that is well groomed to take your pet to. Everyone on my floor had a pet. I registered with tripadvisor just so I can voice how wonderful these people are. They are reasonably priced and you are near the beach. My girl loved it here! I will definitely come back.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester Springs, Pennsylvania", "Title": "“Great place to vacation with your Dog”", "Author": "Vicki J", "ReviewID": "UR119534650", "Content": "We wanted to go to the shore with our dogs so I booked a room here from 10/13 thru 10/16 to try this hotel out as there are very few hotels that allow you to bring your dog.. Rates were reasonable and room was dated and worn but clean and comfortable. No smell of dogs. Close to beach and dogs had a blast there. Had a great stay and will definitely return again soon. Would definitely recommend this hotel to anyone wanting to take their dog with them!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taneytown MD", "Title": "“A night at Barefoot Mailman V. A night on Bald Mtn.”", "Author": "Josh H", "ReviewID": "UR119340742", "Content": "I just returned from staying in room 311 at Barefot Mailman. It Was GREAT!! First, the management was extremely cooperative by waiting up for us, though we arrived at 2330 hours. Even at that hour the clerk was cheerful. The room was spacious and clean. The furniture was a little old and showed it, but it was in good condition. The bed was comfortable. There are NO insect guests. The place was full in mid-October. WE spoke with other guests and had a good time. The management is extremely pet friendly. Every other guest we encountered had their dog. The dogs used the swimming pool. The best part: Very few hotels in OC are pet friendly. The few that do allow pets gouge the guest for $35 /night extra. Barefoot Mailman charges only $10/night and welcomes the dog with a bag of treats (NO tricks!!) Stay at Barefoot Mailman. You wil get your money's worth. Staff very friendly and helpful.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, PA", "Title": "“\"Our home away from home\"”", "Author": "Carol K", "ReviewID": "UR119274396", "Content": "We have never stayed at a hotel that was so friendly and pet friendly. The staff could not be more helpful. Everything was clean and odor free. The maid was excellent, made sure you had everything you needed. The people in the office truely made you and your pet feel welcome. We had a super stay and will return for our 11th stay with them.", "Date": "October 13, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Runnemede, New Jersey", "Title": "“Back to the Barefoot Mailman Motel in Ocean city Md.”", "Author": "jean036", "ReviewID": "UR118235819", "Content": "We stayed at this Motel last October and we will be going back the early part of Oct. This place was spotless and order free of dogs when we were there last year and I am sure it will be again this year I will sent a review of this motel when we get back. Jean36", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Maryland", "Title": "“Good for Dogs, OK for People”", "Author": "BFRMaryland", "ReviewID": "UR117986961", "Content": "This is one of the few dog-friendly hotels in OC, so options are very limited. Seemed all the guests had dogs, all well behaved. The only noise we heard at night was from human activity. The place is OK and the staff does seem to like dogs. Upon check in you're given a treat bag with a ball and treats. The main drawback is OC, where dogs are not allowed on the beach or boardwalk until after Sept. 30. Still, we took our dog on the beach in the evening and walked her on the boardwalk. Room was fine with a King and double bed, microwave and small fridge. Clean with free internet. Hotel is in ocean block but faces the sound. It backs up to a condo building.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Disappointing. Pet friendly was obvious from the first whiff.”", "Author": "jmcnel44", "ReviewID": "UR117956356", "Content": "Pet friendly, as long as you like to smell the urine. Rooms dated, smelled like disinfectant. Awful appeal and just a real big disappointment. Properties can be old but they need to be updated and clean.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Wonderful and Clean Accommodations and great location”", "Author": "Matt D", "ReviewID": "UR117706779", "Content": "This was the cleanest place we have stayed in OC. There was a very spacious room with a wonderful staff. They were very friendly and helpful. The location was superb as it was less than a block to the OC beach. Great restaurants within walking distance. I highly recommend the barefoot mailman. We were able to bring our puppy and walking areas were very close. Beds were very comfortable with a king and a full in the room.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hillside, New Jersey", "Title": "“Stumbeled upon...”", "Author": "BeachLuva779", "ReviewID": "UR116223548", "Content": "After taking the long way home and getting lost on purpose we found this neat little spot. Had free wi fi from the parking lot as we scrambled the web for a place to rest for the nite and explore. It was a refreshing switch from the VA beach vibe we had just left. And it was just what the doctor ordered. Family friendly, pet-friendly, close to everything we needed--and steps away from the beach. And the staff really aim to please...Everything in walking distance and breakfast in bed with the fully ready to go kitchenette. If you are looking for high end...look elsewhere. But if you want a chill laid back great nites sleep and cute view...this is the spot. I am tired of hiding my shiz-tzu in my purse...and this time we get to bring the latest addition Kingston...the bulldog. Luvz it...", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cambridge, Maryland", "Title": "“Had a great stay at Barefoot Mailman”", "Author": "averi-04", "ReviewID": "UR116086210", "Content": "Our family stayed for a week, enjoyed our stay. The room was very clean, kitchen was neat and efficient, and maid staff was friendly and polite. Hotel manager, Stevie, was very genuine about making sure our stay was pleasant and comfortable. Looked out the window one morning to see her cleaning the pool! Great place to stay in Ocean City.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "whirled", "Title": "“Great for pet-friendly vacation”", "Author": "whirled", "ReviewID": "UR115944123", "Content": "We often spend a long weekend during the off season at Ocean City, Maryland, when you can bring your dog on the beach and boardwalk. Barefoot Mailman is one of the few hotels/motels around that allow you to bring your pet. It's nothing special -- don't expect resort quality rooms or service. It's more of a clean, comfortable motel that allows you to bring man's best friend. (Kind of along the lines of Comfort Inn/Motel 6). The place is a little old (could use renovation), but it's not too expensive. What was a nice surprise to us was that, being pet friendly, it did NOT smell of dog at all! And there's a little area outside each room where you can sit -- has two plastic chairs, small table. Our dog (lab mastiff mix) loved sitting outside watching people go by. Staff was friendly, we had ample parking. Again -- this was OFF SEASON. Motel is a bit far from the \"downtown\" of Ocean City, but the beach is very close (it's on the beach side). Basically you can walk outside and the sand is about 20 yards away. To get closer to downtown and the boardwalk stuff, you should probably drive down.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "yonkers", "Title": "“Ok for some. But not what we needed.”", "Author": "buffy19712000", "ReviewID": "UR115395683", "Content": "I book this MOTEL based on the reviews of cleanliness. It is what it is. I wanted to leave as soon as I got there just off the check in area alone. The staff, very friendly and helpful. The rooms, clean and roomy. The property and pool, leave much to be desired! We have two boys that love pools. Couldn't use theirs. Just way to small. Overall not a horrible stay but if you have the money, spend a few bucks more for the quality inn.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New york", "Title": "“Just a place to sleep”", "Author": "shelbyblue", "ReviewID": "UR114811270", "Content": "Went out of the norm to stay here and save a few bucks, remember the saying you get what you pay for. There are no amenities here can't count the pool because it is sooo small,four people makes it overcrowded I mean really. The rooms are big beds are comfy and clean, this is a motel so if you want a real pool and other amenities spend the extra and stay at the Quality Inn a few doors down.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Preston, Maryland", "Title": "“Okay Experience But....”", "Author": "nicholew410", "ReviewID": "UR111479187", "Content": "The hotel was fairly clean and the staff was friendly and it was great pets were allowed! But the dog \"bathroom\" area looked nothing like the pictures provided on the hotel website. The only problem we had was there was a group of people 15-20 that were very loud and drunk (adults). We could not swim in the pool because they took it over and were even drinking beer in the pool. I understand you are on vacation but this is suppose to be a family friendly place. There was hardly any ice in the ice machine because the \"drunk\" people were constantly filling there coolers with ice. The soda machine at the hotel also ate my $ but when I told staff members they promply returned it to me. It would have been a much better experience if the large group of people were told to keep it down. I am not really sure if we will be back or not.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great Little Secret! We're going back in August!”", "Author": "HotelReviewer67", "ReviewID": "UR111318960", "Content": "When you normally think of a cheap hotel, you automatically imagine... dirty, run down and unsafe. Not this place! It's clean, updated and comfortable. The staff is sweet and friendly. We arrived early, so I called and the front desk person said \"no problem\". Not only was our room ready, they gave us a private section of the hotel, where it was very peaceful. (Arrived Memorial Day Holiday) *Not telling what room, That's my secret. When we walked into the room, it was clean and smelled wonderful. The room had a kitchen area that showed no sign of use or left over food and the carpet was cleaned and not sticky! One of my pet peeves are dirty top sheets. You know, the cover sheets that go on top of the bed, that is normally stained and fithy. Not here! They were clean and stain free. The beds are very comfortable. I normally don't sleep well in hotel rooms, but slept very well. The pillows are full and the mattress is not too firm. I loved the fact they situated the room with one king and one full size bed. Made the room bigger and better for a family of four to move around in. This hotel is also pet friendly. You never know it when you walk into the room. No sign of pet smell or hair anywhere! Maids are wonderful. Very friendly and helpful. Never saw one attitude. Always willing to have a friendly conversation. This hotel is also right off the beach and about fifteen blocks from the boardwalk. You can catch a bus right across the street. Close to the Dough Roller restaurant and market. I quess with the good there has to be some bad. A young man, who happened to be a guest staying next door to me, got drunk. Somehow my passing grin (disgusted really) in the hallway, gave him the impression I was interested. Don't asked me how. Anyway, as my daughter and I was enjoying the pool, he decided to come down and try to grab me in front of her. I handled the situation well and got him to leave. But, when he began shouting curses at me, I notified the front desk immediately. I would have liked him to be moved or kicked out of the hotel, but instead, they gave him a warning. Didn't like that. Never heard anything after, even when we checked out the next day. We are still going back in August. Also, the pool is very nice, but could stand a daily cleaning or check. I like the fact the pool only goes up to five feet, but many guests use the pool right after leaving the beach and it's full of sand and film from lotions. This is the only reason why I gave my rating as very good not excellent.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frederick, Maryland", "Title": "“Good Pet Friendly Motel, but…”", "Author": "Vatrahaki1", "ReviewID": "UR103624637", "Content": "We (husband, toddler, dog, and I) stayed here April 2-3. We liked the size of the room. It had a king size bed and a double bed. There was a vanity area, with a sink, next to the king bed, along with a microwave, mini refrigerator, flat screen TV, iron, and board. The carpeting, bed spreads, room curtains, and shower curtain looked new. The bathroom ceiling had some rust and a little mold. The chair cushions in the private patio area right outside our room were stained, as well as the ironing board. There was other wear and tear throughout the room, but it was minimal and did not bother us. The hotel was at full capacity, but we didn’t hear a peep from our neighbors. Maybe good soundproofing or just some quiet people. The motel is about a half mile walk to the end of the boardwalk. Then, it’s about a 2 mile walk to where Jolly Roger Amusement Park. So, if you’re planning to hoof it, just want to let you know what you are in for. Now, for the”but… “part. I called the motel to cancel our reservation 72 hours before our stay because we weren’t uncertain about the weather. I spoke with Stephanie, the manager, and I told her about the cancellation. She said, per motel policy, cancellations must be made 2 weeks prior to stay in order to receive a refund. I told her according to my confirmation page, reservations can be cancelled 72 hours before hand, not 2 weeks. She then replied, in a snippy tone, “I don’t know where you are getting your information, but it’s 2 weeks, not 72 hours.” I just told her where I got the information, but I kept cool and repeated myself and she as well. She did not ask me to email her my confirmation page, but I took it upon myself after our call to send it to her. She called the next day and offered to honor the 72 hour window, which we declined. We will not be returning to Barefoot Mailman because of my interaction with Stephanie. The motel, location, and check-in clerk were fine, but her attitude was not. If we had just exchanged pleasantries, I would feel different. I got a little taste of her managerial style and, at least in my case, it was “You are wrong unless you prove yourself right”.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "midwest", "Title": "“wonderful place”", "Author": "jrmich", "ReviewID": "UR83665533", "Content": "Enjoyed our time here, our 4th year to visit in October. Wonderful location, great staff, rooms are dated but nice size and clean, accepts dogs, all rooms have refrig and micro.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "West Mifflin, Pennsylvania", "Title": "“Just wonderful, a gem!”", "Author": "cjwr321", "ReviewID": "UR81633866", "Content": "I cannot say enough about the Barefoot Mailman. I have never met such nice people. Sonja and Carol were especially nice. I didn't get to speak with many others but I'm sure that they are just as nice because they always said hello. Will definitely stay there again next year. We had a dog with us. I expected a pet room, with spots on the carpet, maybe a little doggy odor. Nothing. I don't know what they use to clean, but it's wonderful! If you get a chance to go, you will enjoy it.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Clarks Summit, Pennsylvania", "Title": "“Pet Friendly”", "Author": "lmjen1947", "ReviewID": "UR79923131", "Content": "We have stayed in OC for many years but now traveling with our small dog presents lodging problems. Our frequented hotel [non pet friendly] referred us to the BF Mailman. Great choice. We were pleased with the accomodations. Clean and fresh. Sorry that it is not open year round since we frequent OC during the winter season but will definitely keep it in our listing for future travel. PS A hairdryer in the rooms would be a nice upgrade for those who travel without one.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Middletown, Pennsylvania", "Title": "“This motel was by far one of the best that I have stayed at!”", "Author": "Crissy64", "ReviewID": "UR79825520", "Content": "I just returned from my vacation today and I had a great time. I stayed for five days with my boyfriend and my two dogs. It is very hard to find a pet friendly hotel in Ocean City. Let me just say that this place was spotless. They had a doggie park to walk our dogs. They even had \"potty bags\" for you at the end of the doggie park. The pool was sparkling. And the staff were very friendly. I am looking forward to returning next vacation.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palmyra, Pennsylvania", "Title": "“WOW !”", "Author": "wef14", "ReviewID": "UR78699893", "Content": "We decided to take our great dane along with us for a quick week-end get away to the beach. We were pleasantly surprised when we arrived at our room late at night to find the pet friendly room, clean and well taken care of. The Motel staff was friendly and caring of our needs. We will be back with our baby.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frederick", "Title": "“I love the Barefoot Mailman Motel!”", "Author": "AuntShanny", "ReviewID": "UR78691572", "Content": "I was introduced to the Barefoot Mailman Motel on a girls' weekend in 1990. Since that time I have always made reservations for this motel regardless of the season. The hotel has beautifully landscaped bushes, flowers and trees and is in a great location - not even a one block walk to the beach. Complimentary towels are available at their outdoor pool which has very comfortable lounge chairs with pillows and large umbrellas. The rooms are always clean and the staff is always very helpful and friendly. I recommend this hotel for families or couples looking for a great get away for a low price. There is no other hotel in Ocean City that can compare!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Freedom, Pennsylvania", "Title": "“Do not miss out on this place!”", "Author": "BonBon0926", "ReviewID": "UR78687472", "Content": "We have gone to OC for many years but never stayed at the Barefoot Mailman. After reading reviews and seeing how reasonable the rates were, we decided to give it a try. What an awesome place! It is about 100 yards from the beach, has a great pool, VERY large rooms, is pet friendly, was very clean, great rates and the staff was very friendly and helpful. It is also a great location at 35th street. We had a 4th floor room where we could watch the sun set over the bay. The balconies were very roomy with padded chairs. The pool also had loungers with pads on them and towels were right at hand as you entered the pool area. What more could we ask for! We will definitely stay there again. Way to go Barefoot Mailman!!!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“My home away from home”", "Author": "travelerplus3", "ReviewID": "UR78546691", "Content": "We just finished our fourth week at Barefoot Mailman this summer, so you know we love it. Rod, the manager, and his staff at Barefoot Mailman make this a fantastic place to stay. It is a small, pet-friendly motel, and you feel like you are among family, they are so friendly and helpful. Our children and grandchildren also love it. Our minpins love it. We have been going there for some 15-20 years now, and have seen many of the same staff, as they have also been there for years. You know about them and their families, and they know about ours. One even gives our dogs biscuit treats. During the four weeks we spent at Barefoot Mailman this summer, we saw one of the co-owners, Ann, always adding plants, new benches and pool chair cushions, etc., to make it an even more enjoyable place to stay. We like having a well-equipped kitchenette so we can fix meals and enjoy them watching the exciting Ocean City activity and bay sunsets while eating by the window or on the room’s patio. It’s like your home away from home.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Browns Mills, New Jersey", "Title": "“just awesome place for pets and their family”", "Author": "whitedove4u", "ReviewID": "UR78398101", "Content": "Barefoot Mailman Motel was a very pleasent experience for my husband and I but most importantly to us for our 3 little dog babies. They enjoyed the time at the motel,which was very very clean and large enough for our comfort. Rod and all of his staff were very helpful and kind,all were just real good people. We felt right at home, the motel is located close to beach,resturants,boardwalk, miniture golf,water park, just up the road you can rent scooters if you desire. everything is just so close by. Also they have an awesome pool at barefoot mailman. When you arrive they have carts avalible so you can load all your luggage on it and just push it to elevator and striaght to your room. Go check out barefoot mailman pet friendly motel you won't be sorry. I know we will be going back. We had a blast.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Elizabethtown, Pennsylvania", "Title": "“Great Stay with family and pets!”", "Author": "Sherri1102", "ReviewID": "UR78232103", "Content": "This is the first time we ever took our dog on vacation with us. We have a mini dachshund. It was very important to me to find a clean, pet friendly hotel. I read a lot of reviews before choosing the Barefoot Mailman Motel. After we arrived, I was so pleased that we went there. The staff is very friendly and they have a nice area for your pet to \"go\". There is a scooper there to use and also poop bags and plenty of trash cans. The motel is an older construction. Which is nice, because of the thick concrete walls. We stayed an entire week here and didn't hear any barking while in our room. My husband was talking with the people beside us, who had 2 dogs with them, and they were barking inside the room the whole time. When he came into our room, he asked if I could hear them barking? I didn't hear a thing! I also liked that the elevator is accessed outside the hotel, you don't have to walk through a lobby with your dog. The maids do not enter your room when you have pets with you. So you just have to ask her for any supplies you may need. I liked this beacuse I could leave the room and not have to worry about my dog accidentally getting out. The hotel is just a few steps to the beach. You don't have to cross any roads. Which is nice with children. We will definitely be returning to this hotel! Sherri - Elizabethtown, PA", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eagleville, Pennsylvania", "Title": "“The best ever!”", "Author": "josep141", "ReviewID": "UR77540855", "Content": "We have been coming here fort two years now and it just gets better each time. This establishment is very clean. The rooms are great and they each have a balcony of the pool. It is located a 1/2 block from the beach (and you don't have to cross the street! The office staff is wonderful. Since I usually arrive at night I have had the pleasure of dealing with \"Stevie\" . She goes out of her way to make everything work well for the guests. She has always been polite and very helpful. In fact, so many people here make you feel as though you were visiting your favorite relatives (I must also mention Rod, Joy, Carol, Sonia and the rest) I have learned that most people who come here are \"regulars\" and they just keep on returning. I come here in the spring, summer and fall. This is the best place to stay. I highly recommend the Barefoot Mailman. JC", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“great to see a motel with old ocean city charm”", "Author": "softballmom2014", "ReviewID": "UR77534712", "Content": "I have been going to ocean city since I was a child and rememember this hotel over the years in my travel up and down costal highway, and finally took the opportunity to stay. Even though hotel has been around for years it is a charm. Room was very clean and so was bedding and towels. It was great to have the opportunity to stay in a king size bed and still have room for a double bed for my 2 kids to sleep in and plenty of room to move around. The hotel was very quiet and the landscaping which helped to seclude the hotel from the highway gave it a more private,tropical and secure feel. The personel at the hotel were very friendly and very informative. Check in and check out was a breeze and parking in a private lot with gated entrance was definately a plus. If you are looking for a clean, quiet place to stay that has a nice little pool this is the place. It is reminisent of \"old ocean city \" before all the high rise buildings.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampstead, Maryland", "Title": "“Barefoot Mailman Motel is like family to me!”", "Author": "djlangel", "ReviewID": "UR77415899", "Content": "I have been staying at the Barefoot Mailman Motel for many, many years. My Mom and Dad and Brother and Sister-in-Law and Boomer also stay here. The rooms are always so clean - you walk in the room for the first time and it smells clean and everything is nice and neat. The staff are all so friendly and nice. I have gotten to know everyone who works at the Barefoot Mailman because of my frequent visits over the years. It is so nice to be greeted so friendly when you arrive and again when you depart. I have made friends with Rod, Joy, Steve, Stevie, Carol, Gin and the other housekeeping girls I have met over the years. The rates are very reasonable, the location is perfect. Everyone around 35th Street are very friendly. The beach at 35th Street is lovely - a lot of nice families. One of my favorite things about Barefoot Mailman is walking down to the boardwalk from 35th Street. It is a nice walk. We walk up the quiet alley to Baltimore Avenue and from there down to the Boardwalk. Besides everything I mentioned above, one of the reasons I keep coming back to Barefoot Mailman Motel - I feel like I am amongst family and that means a lot to me and my family. In a world where there is a lot of negative things today it is nice to find such a good thing - THE BAREFOOT MAILMAN MOTEL!!", "Date": "August 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "King of Prussia, Pennsylvania", "Title": "“A nice hotel with friendly staff make us comeback year after year.”", "Author": "pennstatebrenda", "ReviewID": "UR77101823", "Content": "The hotel rooms are pretty standard. They are clean with an extra sink outside the bathroom which comes in handy. The fridge and microwave allow us to save money on eating out b/c we can bring drinks and snacks. It's a two block walk to the beach, which is nice and there's a bus stop on the corner which makes our commute to Secrets, short and sweet.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Rain or Shine....Always trust the Mailman”", "Author": "lnovack", "ReviewID": "UR76853752", "Content": "My friends and I have been staying at the Barefoot Mailman for 7 years running. The kindest people on earth. The staff is friendly, the rooms are clean and reasonably priced, the pool has a ton of sun and is not shaded by the hotel and it is close to Seacrets and the board wall. It took a few years to find this gem of a hotel. But once we did, we have never tried another. A+ in my book", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“Were going to visit again and again!”", "Author": "travelwithpennygirl", "ReviewID": "UR76229202", "Content": "This was our 2nd year there and just like last time, we were treated like royalty. It felt like we were comeing home again. The room is spacious, the Motel is a short walk to the beach. It is also close enough to get to the boardwalk but far enough away that you enjoy the peace and quiet. The pool is cleaned every day and you can see it from the balcony, so it was nice to be able to watch the kids and hubby in the pool while preparing dinner. The staff is really personable and friendly, The rooms are clean, you wouldnt know that a pet had been there before you. Price is reasonable. It is an older establishment but kept up well. I have 3 children so it was a tight fit with a king and double bed, they provided a cot at the last minute and were happy to do so. I cant say enough good things about this place... it was fantastic, and we will be back. Penny thanks you as well. :)", "Date": "August 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Chester, Pennsylvania", "Title": "“I liked it but.................”", "Author": "kobyg", "ReviewID": "UR72756577", "Content": "I was looking for a Hotel that accepted my dog, i refused to travel without him. I made my reservations over the phone 4 days prior to our arriving. We got to the hotel... I loved the locaton and i was greated at the door by \"STEVIE\" the night desk person. She knew exactly who i was, and i immediately felt at home....and thats where the good vibes went out the window. I paid 190.00 down as a deposit on my room, the balance was 696.00. We arrived Sunday night and left thursday morning. A little steep, but i wanted to take my dog. At the desk, I'm told by Stevie that my balance is 748.00 dollars. I said...NOOOOOO thats not what you said. Long story short we went back and forth and she even sugggested that i could stay at another hotel!!!! Where is a family of our with a dog going to go on a Sunday night, in OC???? She never said, we can handle this is the mrning, lets just get yu checked in. No!!!!! She then stated i could talk to a manager, or whoever, it wouldnt change anything!!!!!!! dont get me wrong, we had the balance, but it was just something about her attituse that made me feel very uncomfortable and helpless!!!!!!!! The hotel was great, but over 900 dollars dollars for 4 days, with one King and a doulble, dog or not was a little too much!!!!! Although i was given free breakfast buffet vouchers, first impression is definately a lasting impression, and i will plan better for any upcoming trips. For a few more hundred, i could have rented a condo for seven days...not worth it!!!!!!!!", "Date": "July 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great price”", "Author": "Delmiss", "ReviewID": "UR71829073", "Content": "Stayed here with my family and me pet. It was very affordable and clean little out dated but other wise comfy room! You would think it would smell funny cause of pets but it doesn't the staff we nice", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johnstown, Pennsylvania", "Title": "“Great place to stay with pets”", "Author": "coors51", "ReviewID": "UR64433643", "Content": "Have been staying here for several years during Ocean City Bike Week and feel it is a great place to stay with pets and it is clean. We have two dogs and they seem to okay with it also, Staff has always been very kind and helpful.", "Date": "May 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "North Wales, PA", "Title": "“Great Motel”", "Author": "kimwa19454", "ReviewID": "UR60363476", "Content": "My husband and I just returned from a 3-day Easter getaway in Ocean City, MD. We had been planning this trip for several weeks and were searching for a pet-friendly hotel, as we wanted to take our dog with us. Seeing that the Barefoot Mailman allowed dogs, I called for the reservation. From that first phone call, through our entire stay, everything was wonderful. The hotel staff are extremely customer service minded and friendly to not only us, but our dog, too! We were traveling from PA and ended up getting there later than anticipated. During the off season, the office is only open until midnight. We were afraid we would get there after 12, but the woman at the front desk said she'd wait for us! Luckily, we did arrive before midnight! We rented an 'efficiency' room that had one king bed, plus a full size. There was a small dining set and a kitchenette equipped with everything you need (microwave, coffee pots, complimentary coffee, refrigerator, pots/pans, dishware and even dish liquid! The room also had ample closet space, a vanity and was super, super clean! Each room also had its only little 'porch' area with two patio chairs, table, etc. Lots of towels, toiletries and extra blankets. The motel is older construction, but everything was maintained beautifully. Plus, the maid service \"Gin\" was great! You couldn't ask for a better place for the price and the service! Oh, and the location is ideal! Just a few short steps to the beach, plus the boardwalk is only 10 blocks away. There are lots of restaurants and nightclubs all within walking distance, yet its far enough away from the boardwalk/lower part of town where there tends to be a lot of the younger crowd, noise, etc. All in all, I would highly recommend the Barefoot Mailman! We'll definitely be staying again.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chestertown", "Title": "“very nice place”", "Author": "bigdirty1", "ReviewID": "UR44434939", "Content": "We have stayed in this hotel for 3 years now and we have never had a problem. it is a very friendly place and the rooms are nice. these people go out of their way to make you have a nice stay. i would recommend this hotel to everyone. they also allow pets which you don't find that to often. Take a chance and try it. Good for your budget with a family.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "maryland", "Title": "“OC gettaway! here we go!”", "Author": "rckwaterman", "ReviewID": "UR34835109", "Content": "The hotel was clean and staff were very friendly! The pool was very well maintained for being 30 years old. It was sparkling clear. The building is constructed with cement walls ceilings and floors so those days of listening to your neighbors are over in this Motel. The bed was comfortable so much so no one in our party woke up before 10am. Talk with the manager while you are there he is very informative and helpful. Visit the OC LIbrary for free movie rentals. There is a VCR DVD player in your unit. The kitchen area is dated and old but it all works so no complaints from me. The Bathroom may have some minor blemishes but the staff keeps it in good clean shape. The water pressure is fantastic and the hot water is HOT!! Oh yeh it is HOT! There is a table for playing games in your room. There is also a small front porch area that is not mentioned in the home page. It includes 2 chairs with cushions and a small plastic table. This looks on the pool area.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Maryland", "Title": "“Family & pet friendly”", "Author": "suzziq0000", "ReviewID": "UR34432737", "Content": "This was our 1st visit to the Barefoot Mailman. The staff goes out of their way to be friendly and accommodating. The rooms were clean and comfortable. Plenty of room to walk the dog and mingle with other guests also traveling with dogs. Great value!! Down home feeling......we will definitely be back!!!", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Northeast PA", "Title": "“Very Friendly and Clean!”", "Author": "sfer1010", "ReviewID": "UR33225934", "Content": "We recently stayed for a long weekend with our two dogs. I was sceptical about the cleanliness because it was pet friendly but the staff goes out of their way to ensure the rooms are clean with no pet odors. The staff was very friendly and helpful and the price was very good considering you are literally a short walk to the beach witha great view of the bay and sunset from our top floor room. The great thing is that it is all pet owners staying there so we didnt feel as though we were bothering anyon walking them around the hotel. If you cant tell by now I would highly recommend this hotel if your a pet lover!", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Maryland", "Title": "“Perfect for people and pets - doesn't get better than that”", "Author": "teamadMaryland", "ReviewID": "UR26692253", "Content": "This was our fist time staying at the Barefoot Mailman but it will not be our last - in fact we have already booked to go again. The price is great which in this economy is very important BUT even more important to us was the fact that we could take our dog and they did not care what he weighed - big plus when you have a 110 lb rottie :-) Rooms were spacious and clean and the staff were very friendly. Good location so getting to the beach and the boardwalk was easy. This is definitely going to be our 'local' from now on when we visit OC", "Date": "March 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "PA", "Title": "“Affordable, Pet friendly”", "Author": "klgonzo205", "ReviewID": "UR24587211", "Content": "Maybe not the cleanest of hotels....but what can you expect when one allows pets? The staff are extremely friendly with humans and animals! The hotel is affordable, very close to the beach, and provides plenty of ammenities. Also nice is that they only charge a minimal flat rate for pets...Most hotels charge per day, per pet which gets very expensive! I plan to vacation at this hotel for many years (and dogs) to come! Thank you to the Barefoot Mailman for catering to our canine friends! A note to pet owners.....Always carry a few cleaning supplies and clean up after your pets!", "Date": "February 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lake Ridge, Virginia", "Title": "“Very nice for the price”", "Author": "brian14leonard", "ReviewID": "UR24547701", "Content": "I agree with most of the reviews here--this is a great place to stay if you only care about the basics, especially if you want to go in the summer but can't do a full week's rental somewhere. The pool is small but nice, the room was clean and serviceable, and the location was very good.", "Date": "February 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh PA", "Title": "“The Best Hotel”", "Author": "cjzobi", "ReviewID": "UR17853013", "Content": "Very, very, clean and nice hotel to stay at with or without your pet. Rooms are very spacious, and clean. The staff are out of this world, and are very nice and helpful. Nice pool, very clean. It has a nice view of the bay and a short walk to the beach. We liked it because of our dog, the other guests were very nice as well. Good location in Ocean City. We are already talking about next year, we will definitely go back.", "Date": "July 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "md", "Title": "“great hotel for pets”", "Author": "dmww", "ReviewID": "UR16993937", "Content": "This is great hotel for people that have pets. The staff are very friendly and the rooms are very clean. Maid's are extra nice and helpful.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“I love this place!!!!!!!!!”", "Author": "lullabykisses13", "ReviewID": "UR16520637", "Content": "Ok so its def been a while since I stayed here...but it really made an impression. First of all, we got the absolute best room in the place. Top floor on the corner. We could see the bay and the ocean. It was so clean and we got to bring the dog! We could walk to the beach...and boardwalk if we wanted...but we just took the bus to the inlet. I went with my family so I didn't have to pay...but now that I'm grown and have to pay I can't quite afford it (I'm a full time student). The staff was so nice and our room was always clean. The bathroom was really clean and the water was fine which is always a plus. Hopefully I'll have enough money to stay here next year. If your on the fence about this place... jump down and book it!!!!! Wonderful!", "Date": "May 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Pittsfield, MA", "Title": "“Great hotel--pet friendly”", "Author": "scullyaz", "ReviewID": "UR14611334", "Content": "I stay here every year in March--great place and pet friendly. Clean rooms, polite service--and there is a dvd player in every room. Close to the beach--I recommend it!", "Date": "March 28, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Reading, Pa", "Title": "“Pet Friendly and Highly Recommended”", "Author": "pahomer", "ReviewID": "UR10049297", "Content": "Great Hotel and very friendly staff. Pet friendly and very clean. Would never know that pets were in room before you. Maid service was exceptional, staff courtious and will go back again with other family and friends with pets. Recomended to all.", "Date": "October 7, 2007"}], "HotelInfo": {"Name": "Barefoot Mailman", "HotelURL": "/ShowUserReviews-g41298-d619363-Reviews-Barefoot_Mailman-Ocean_City_Maryland.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">#16 35th Street - Oceanside</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "619363", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/62/24/62243c60c43ad2c4a240a46831875d131large.jpg"}}