{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tyler, Texas, USA", "Title": "“Ibis review”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR137179252", "Content": "Ibis was willing to change our reservation due to a change in our travel plans without charging extra. The hotel was clean, quiet and we slept great for the one night that we stayed. We were told that the coffee was complimentary, but we did have to pay for them in the end. It may have been a misunderstanding due to the Spanish/English language difference.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Raleigh, North Carolina, USA", "Title": "“Excellent value.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR136142653", "Content": "The staff were very friendly and helpful. There are restaurants nearby, within easy walking distance. Also a supermarket next door. Wish that it was closer to the airport and that the shuttle service ran 24 hrs a day.", "Date": "August 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seogwipo, South Korea", "Title": "“Good value for money”", "Author": "Been L", "ReviewID": "UR134966367", "Content": "We booked a triple room for 3 adults for EUR 56.00 through an online booking agency. When we got there late at night, around 11pm, a very cheerful receptionist told us that there were no triple room for 3 adults so to use 2 rooms and pay the excess room charge. Of course I gave a flat rifusal. I booked one triple room and I was going to check out at 7am next morning. Anyways, the receptionist reluctantly gave us one room, then we were guided to our room by a lady who doesn't speak a word in English. After 5 minutes, we found out we were not able to open the extra bed and called the reception to send someone to fix it. The lady from before came back with a bunch of keys.. didn't work. It took her almost 3 minutes to understand that we'd like to move to any other room and get in bed asap. She left our room saying to wait for a call from the reception..... went up and down several times to finally switch our room. Rooms are very small for 3 adults.. I told the hotel to edit their room information immediately on the booking agency. I find the price very good, but I can't help a thought that the receptionist kind of tested us so obviously. Breakfast was okay for a 2 star airport hotel.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Overall the Ibis has been a pleasant stay with friendly staff.”", "Author": "Highlandhogs", "ReviewID": "UR133736627", "Content": "One of the front desk staff isn't very friendly, but there are others that have made up for her. One guy has been very helpful and was even great about showing us the map of Madrid. Ibis is very near the airport and has a free shuttle. It's about a 10-15 min walk to the metro though and wifi is 5 euro. Very clean and nice, especially for a budget hotel.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“great room!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR133120962", "Content": "ive been there only one night. the room was very confortable and in 15 minutes I was at the airport with the shuttle made available from the hotel.", "Date": "June 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Great Value!”", "Author": "morphius909", "ReviewID": "UR132592371", "Content": "Stayed here one night before my very early morning trip to the Madrid Airport (think 4am LOL). Property is gdo knows where, took the cabbie 10 minutes to get there from the airport that evening. Check in was smooth, though the female check in agent wasn't too interested in servicing me. I got a room for 49 euros online (prepaid) and paid additional 5 euros for wifi. So total was 54 euros for a hotel room that was very clean, somewhat minimalistic modern and comfortable. I've stayed in IBIS before in London and Switzerland a few years back so I knew what to expect. Bathroom is very functional and clean, room has a small LCD tv, double bed and folddown bed as well. I was put on the 2nd floor and it was quiet. I ate dinner at the restaurant, for 14 Euros I had a big beer and fairly decent chicken meal. Service was good too. Overall, I recommend this hotel. It's clean, modern-ish, comfortable with a restaurant inhouse. Thanks Ibis!", "Date": "June 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bruxelles", "Title": "“Nice hotel, well located”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR130519897", "Content": "This is the perfect hotel for an one night stay near the airport. The free shuttle pick you up at the airport although the frequency might be a bit irregular (Had to wait around 40 minutes for it at 10PM). Room are simple with cheap furniture but quiet new. I had dinner at the restaurant and it was quiet good! They have nice variety of wine to offer. Breakfast was ok for the price paid. Also, there is a metro station not too far, around 20min walking.The only drawback was the price of the wifi...", "Date": "May 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brisbane", "Title": "“Very convenient to airport”", "Author": "RowerBrisbane", "ReviewID": "UR129140565", "Content": "This is a very good value for money hotel that is very close to the airport. Ideal for that early morning flight. Even better there is a courtesy coach to and from the hotel every 15 minutes for the airport You can also get the metro from the airport into Madrid in about 30-40 minutes. The room was spacious , well equipped and very clean. The snack bar and restrauant areopen most of the time enjoyed my stay there", "Date": "April 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Granada, Spain", "Title": "“Excellent hotel for Madrid Airport”", "Author": "MargaretGranada", "ReviewID": "UR126326318", "Content": "We stayed at the Ibis at both the start and end of our holiday. It is very conveniently located close to Madrid Airport and there is an efficient minibus service provided to and from the airport. Whilst the bedroom and bathroom are not large, they are immaculate and comfortable. The shower is large and the pressure extremely good. It is a \"no frills\" hotel, so there is only combined soap/shampoo provided - no hairdryer or shower cap etc. There is a small restaurant. We however opted to eat in one of the restaurants within walking distance of the hotel and the metro station is only a 10 minute walk away providing easy access into central Madrid. Wi-fi is also available at a cost of €5 per day and there is a good selection of television chanels in the bedrooms. Reception staff are efficient and helpful. This hotel represents excellent value for money at very reasonable rates.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good clean and functional.”", "Author": "Cliff T", "ReviewID": "UR125471771", "Content": "I was hesitant to stay here based on the previous reviews but the price and location was good. I am just staying here one night before my flight. The room is small but clean and very functional. I'm on the second floor. The floor is wood which I like because it has less chance for infestation. The bathroom is very good with a nice shower. The restaurant in the lobby was very good. I would stay here again.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palma de Mallorca, Spain", "Title": "“Extreme functionality and great location at a very reasonable price”", "Author": "Pinkmoon7", "ReviewID": "UR125174006", "Content": "I was travelling alone so I just wanted something extremely functional and practical to get to the airport. The hotel proved perfect on both scores. Breakfast starts very early in the morning, although I think until 6 or 6.30 it's just coffee and croissants, after this time it's a full continental buffet (excellent value at 6 euros when booked on-line). Rooms are comfortable, clean and functional. The shuttle bus comes every half an hour. I took it at 7.40 in the morning, and there was only one other person on it, despite being run in conjunction with two other hotels. So, even if you can't reserve a space, you shouldn't have a problem. There is the metro or a bus not very far away if needs be, although I don´t think you´ll need them. Check-in and out very quick. Overall, excellent set-up at a very reasonable price.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Moscow, Russia", "Title": "“Does its job as a sleepover hotel but not much more”", "Author": "Tessa_TA", "ReviewID": "UR124123045", "Content": "Stayed at the Ibis Aeropuerto in Barajas in January 2012. The hotel is very basic (as you would expect), but does its job for a sleepover. The Barajas metro station is a good kilometer or so away along the road past a fountain opposite the hotel. Reception staff claimed it was 500 meters away, but, having walked definitely more than 500 we finally came across a sign “300 m to the metro”. Not exactly doable with bags, so their airport shuttle (quick and timely) was very helpful. The center of Madrid is about 1.5 hrs (and 2 transfers) from Barajas on the metro, get ready to climb lots of stairs (tip, some transfer stations, like Nuevos Ministerios, actually have lifts, which saves a lot of time and energy). The neighborhood itself appeared quite grim at first sight, didn’t feel too comfortable walking back from the metro station at night. There might be a bus from the metro to the hotel, but I was not aware of it. On the positive side, there’s a supermarket in the same building, to the left of the hotel’s entrance (if facing the hotel). The triple room we had for two was so tiny we could hardly fit two big bags. I can’t possibly see three people fit in it. The room was poorly designed: you had to be left-handed to at least partially open and close the window, the coat rack was placed by the bedside in the far left corner of the room, so you had to walk the room fully dressed. Bathroom size was generous in proportion to the room size, however. Breakfast was mostly edible, though the soft cheese, which was good on the first day turned sour on the second, presumably, having sat in the warm room for too long as they serve from 4.30 am to noon. Wi-fi at EUR 5 per day is a rip-off in my view. There was a desktop computer, however, I am not sure how much it cost to use, if anything. Overall, I might consider this hotel for a solo trip but the rooms are definitely too small for two people with big bags.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "", "Title": "“the worst stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR123293183", "Content": "No free transfer after 23:00 as promised, the only way to get to the hotel later is taxi which cost 20 euro. No free WiFi. Far from metro. The worst thing is the staf! Very rude and their favorite frase: I can't help you. I think there are a lot of better hotels near the airport with better service.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Las Vegas, Nevada", "Title": "“Good pre-flight hotel. So-so service”", "Author": "alipg", "ReviewID": "UR123185917", "Content": "This is a good hotel to stay before a flight. It has an airport shuttle, it is a 10 min. walk from the metro, the rooms are basic, but modern, clean and comfortable, and the rates are good. It was very hard to find by car, though. Make sure you check your map really well, or use your GPS, as it is not visible from the freeway or any major street. There is a car-park behind the hotel, or you can park on the streets around it, but you'll probably have to drive around for a while, though, before you find a space. There are supposed to be a couple of spaces in front of the hotel for momentary guest parking, but they were permanently occupied while we were there, and the front desk clerks did absolutely nothing to remove these cars, eventhough we brought it to their attention. Overall, the front desk staff was less than friendly, bordering on rude. I sat in the lobby for a while, waiting for my husband to find a parking spot, so I witnessed the staff's interaction with several guests and they were less than willing to go out of their way to help anyone. We traveled around Spain for two weeks and sadly, Madrid was the only place where we encountered this less-than-friendly service. I would stay here again only for the convenience of the location and moderate rates.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“One of the least objectionable hotels near madrid airport”", "Author": "drushton", "ReviewID": "UR122380171", "Content": "I put a lot of effort into finding a good hotel near Madrid Airport and it was very difficult. Everything around the airport seems to be based on \"grab their money and get what you can. They won't be back\". My first was a real looser with a three hour wait for the hotel shuttle in the burning sun. I chose the Ibis on our second visit because, although not high quality, the Ibis chain does have some thought to giving a clean hotel with a fairly comfortable bed. The shuttle was late, but not as bad as that other hotel. The reception desk was quite indifferent and mechanical. However, the room was fairly good and certainly clean. When we wanted to visit a few sites in Madrid that Sunday we found no interest whatsoever from the front desk. They had no map that showed the hotel and Madrid on the same page. When I asked directions to Mercado San Miguel (one of the top of the top sites in Madrid) the girl on the desk said she had never heard of it. She backed that up by asking someone in the inside office who had lived in Madrid all her life. She confirmed that no such place existed. So we had to find it on our own. It did turn out to be a wonderful experience and probably the only thing we would find of any real interest in the city. For that reason I have chosen to show some photos of this market rather of the hotel. Please don't miss it. It's a bit of History that comes aliive. The only hotel that might be better from what we have been able to find out was the Hilton - if you could afford it.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Overall a good experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121660987", "Content": "This was my fifth stay in this hotel. Conveniently located for the airport, with the Metro just a 10 minute walk away, and also situated in the centre of Barajas - which has shops, restaurants, cafes and bars. Hotel clean and the staff reasonably helpful. You may have to wait sometimes for bar service and the beer we received was without gas, but aside from that we had a good stay. Finally, the free internet in the lobby is really useful!", "Date": "December 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Palo Alto CA", "Title": "“Great place to crash for over night lay over”", "Author": "BruderLustig", "ReviewID": "UR121645287", "Content": "came in late afternoon after 15 hrs flight from California. appreciated the free shuttle from Terminal 2 (5 min drive) small room but clean; efficient service; lots of restaurants in the neighborhood great value; like it.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "", "Title": "“Good value at Madrid Barajas”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121353667", "Content": "When traveling from the Madrid Barajas airport, I always have to get there the day before, in order to make my flight home the next day, because my flight leaves so early. This Ibis is evidently pretty new, and although Ibis does tend to stick to the basics, I was pleased that everything was shiny clean. The staff was efficient, with a single person doing a great deal (check-in, fetching wine for the bar from the dining room, etc.) I would definitely stay here again, when I needed to get to the airport for an early flight. It is quite close, and the airport pick-up and delivery is fast and free. If you want a glass of wine, though, best ask for a double. The servings are very, very small--3 sips is about it. My wine was very good, though--Rioja.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "", "Title": "“Staying for the 3d time at Ibis Madrid Aeropuerto”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121323803", "Content": "Hello! We stayed in the hotel for the third time. This time with my wife and daughter 2 years old. The room is pretty small an has space only for necessary activities. You've got even problem with placing of 2 travel suitcase on the floor and open them. You have only space 2 sq.m at the corridor and half meter around your bed. From the other hand the bed is pretty broad and suits for a spouse couple very good. A lot of space and a big warm blanket. The one who likes small pillows will be also satisfied with the quality of sleep conditions. There's also a separate bad for a child. The hotel does not charge for it and we really appreciated for such accommodation for our daughter. There's no fridge. There's a pretty big in comparison to the room a WC with a hair-drier and a shower. There's a small flat TV with about 20 channels. There's no free Wi-Fi but there's a computer with internet access for free near reception. A day with Wi-Fi costs 5 Euros, pretty expensive. The breakfast is very scant and does not cost 6,5 euros pro person. But you can get at the bar-cafe for 8 euros two good cups of coffee and 3 croissants. The underground station is within 10-15 minutes, depends of your walk speed. There's a free bus shuttle to all Terminals at the Barajas Airport and it takes only 10 minutes to get there. This really amazing and useful service. Also with a taxi you can get to the hotel from the airport for 13-15 Euros. At the same building on the ground floor is a very good supermarket with large variety of food and non-food goods. The market operates only from 9 to 21 and is closed on Sunday.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Ok”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121196843", "Content": "The restaurant and bar services weren´t good. The location is really good. It´s only five minutes distance from Barajas Airport. And that´s all I´d like to say right now. Enjoy your stay!! Hasta Luego!!!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "El Segundo, Ca", "Title": "“hotel near airport”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121081447", "Content": "Very good for first night into town or the last before leaving as is very close to airport.. breakfast starts very early. The front desk peope are good and speak decent english which helps when you are exhausted. Could not find the @ key on the public computer. Pretty bizaar as it is not where it is marked on keyboard. Ask for help instead of spending a great deal of time as we did with lots of people waiting to use it. WIFI costs 5 euros. Free at most hotels.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Beware: Taxi scam”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120688797", "Content": "PROS: 1. Clean and cheap. 2. Metro connection not too far away. 3. Big supermarket next door. CONS: 1. Dont book taxis via hotel reception: 3 minutes taxi ride to airport costs suddenly 16 euros 2. Check your invoice: IBIS card discounts are not automatically taken into account. 3. A-Club points will not be credited automatically.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Top Class Budget Hotel In a Great Location”", "Author": "TimTheGuest", "ReviewID": "UR120422943", "Content": "I stayed here for 4 nights as I was at a conference at Feria De Madrid. I was met y a free minibus to the hotel and greeted by friendly reception staff. The room was small but what you would expect from a €45 hotel. The room was very clean, desk area to work from, bright, airy and very quiet at night thanks to the two layers of double glazing. The shower room was spotless, very clean, really good shower. There is a decent bar and a very good restaurant in the hotel. I would like to thank Clement for his multi lingual service in the restaurant, he was very efficient. There is WiFi available in the room for €5 for 24 hours which is reasonable. The area of the hotel is ok, not much going on but it's very close to Barajas Metro station and 1 stop to Feria De Madrid so very good for me.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Ibis Madrid Aeropuerto”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120066379", "Content": "Good comfortable hotel, good value for money a bit far from city center - still not so difficult to reach city center by metro but you will have walk a bit Good comfortable hotel, good value for money a bit far from city center - still not so difficult to reach city center by metro but you will have walk abit", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Best shower ever !!!!!!!!!!!!!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119371266", "Content": "the greatest shower ever !!! very roomy , and also a very nice breakfast, fruit , juice for a fair price ... I only regreat the fact that i missed the shuttle from the airport , but it´s a great idea !!!!", "Date": "October 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "", "Title": "“Far from center.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119336780", "Content": "It was a little hard to find the hotel coming from metro station Barajas. It's not very difficult, but I had to ask a couple of people to find it. Unfortunately it was impossible to book a room with 2 separate beds...", "Date": "October 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sao Paulo, Brazil", "Title": "“Bad staff”", "Author": "MarcosGoffredo", "ReviewID": "UR119203316", "Content": "Nice hotel, with large rooms. Staff, instead, not nice. Rude people, and dont trust shuttle service to the hotel (not at time).", "Date": "October 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“One night stay in Ibis-Madrid Barajas”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119129660", "Content": "I stayed for one night at Ibis-Barajas since it was close to the airport and I was scheduled to catch a flight the next day morning. The service was bad. I asked for a bottle of water at 11:30 pm and I was asked to come down to the lobby and get it!! I would not recommend this hotel to anyone unless you are desperate to find a place to stay", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Madrid Business Trip”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119116678", "Content": "Great location from airport. Even better the bar was open late after arriving late from the UK. BEWARE of taking a taxi ride approx 2-3mins from the airport, we got stung 20 Euro's for this very short ride, not pleased, but hotel and staff were spot on.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lanciano, Italy", "Title": "“Good value for the money.”", "Author": "Anxanum", "ReviewID": "UR118439145", "Content": "As all Ibis (I am used to stay in all Accor Hotels) it provides you the same quality standard. In this case is particularily clean and cared (more than average of Ibis) and very well located to get a flight in the airport. They also provide free shuttle to the airport. Only negative point is the recepionists: are not particularily friendly and kind (I do not recall a smile), looks they are doing us a favour! No comment on breakfast as I did not have it.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice clean good air conditioned airport hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118076695", "Content": "Stayed here between 2 flights, quite well located - one can get there from the airport with the tube/Metro 8 and then 500m on foot and get back to the airport with a taxi for about 14EUR. I'd recommend it to someone who needs to stay in Madrid between 2 flights. The rooms are clean, roomy, air conditioned and quiet. The restaurant is not so great - but there are some bodegas/restaurants nearby - and the staff either doesn't speak English or are not that interested in helping you.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Satisfactory”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118030631", "Content": "I was impressed with the sleep and quality of the hotel. Good and comfortable bed, relaxing environment. But wifi internet should be freely available to the visitors after paying such much as I did (€125) a night.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Nice overnight stay”", "Author": "Aninkas", "ReviewID": "UR117982148", "Content": "Ibis aeropuerto is close to the metro station (cca 500m) and when take line 8 then 6 and then 1, you are in the center of Madrid. We stayed with an infant and there was no problem with the crib. Hotel room was clean with nice bathroom, but very small with no view. The breakfeast was good, but no eggs and no warm food, just cheese, ham and croissants (+ fruits and yoghurts). Staff could be more friendly, but still ok. There is free shuttle from/to airport, but you have to wait aprox. 30min to catch one.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great value, close to the airport, clean, good service”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR117236721", "Content": "Perfect for my needs at the time...was only in Madrid for a night and needed a place to sleep/eat. I was exhausted and it was a great place to relax. Room was very clean and spacious (and it was CHEAP), multilingual staff was helpful/service was excellent, free shuttle to and from the airport which is just a few minutes away, so there is no need to stay in an overpriced hotel in Madrid and then worry about transportation to and from the airport. There was a really attractive waiter in the restaurant and he was very sweet. The guy who drove the shuttle was very nice and helped me with my luggage. Overall a positive experience and I would totally stay there again.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“Great place for a stopover.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116258309", "Content": "This was our second time to use the Ibis at this location. The rooms are very modern and ideal for what we needed, a stopover on our way home. The airport shuttle was convenient with a pick-up and drop off service. We enjoyed the convenience and value of the breakfast buffet.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Airport Shuttle/Close to MAD T1-Great Price/Great Place”", "Author": "sherrylikethewine", "ReviewID": "UR115422709", "Content": "Found this hotel online when had to stay overnight in Madrid. Rooms are clean, modern, and food at hotel was just fine for the price. Had to pay reasonable flat charge for 24 hours of internet but it was available throughout the hotel and swift connection. Everyone at the hotel was relatively young, friendly, and helpful, and the shuttle runs to/from the Airport (it circuits all 4 terminals) every 1/2 hour or so. I recommend the IBIS Madrid Aeropuerto Barajas to anyone looking for a great deal on a modern hotel near MAD. The shuttle made it easy to get to/from and it's close enough to walk from hotel to MAD T1 next morning. Thanks for a great stay.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Clean and convenient”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115045561", "Content": "Close to the airport, free shuttle to and from it, clean rooms, attentive staff. Everything you need for a quick night rest while waiting for your flight. Breakfast for 6,50 euros is not bad, though don't expect a Spanish spread, more like a Howard Johnson at its best moment.", "Date": "July 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great value overnight stopover”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR114895163", "Content": "This was one of the easiest o/night stopover we have experienced easy shuttle transfers very close to airport no airprt noise and with all Ibis hotels features clean and functional simple good quality satisfying breakfast ala in all excellent value for money.", "Date": "June 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel near airport- nice \"dorm\" style chic rooms”", "Author": "Angel60615", "ReviewID": "UR111317334", "Content": "We ( two American women travelers) stayed here for a night to be near the airport for an early next-day flight. We were so pleased with the chic clean rooms. They are somewhat dormitory style in the decor; no Spanish crown moldings or anything. But the room suited our needs. The fast free Internet computer was a plus; you have to pay 7€ for the wifi code. The free airport shuttle was easy and runs every 20 mind like clockwork. A great choice for budget minded travelers who want a clean, modern room", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent airport hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR108322049", "Content": "I would like to recommend this hotel for anyone looking for a place to crash after a long flight.It is the best best airport hotel in Madrid for the price.Breakfast is also hearty.I would like to especially mention the very helpful and polite staff.Overall great value for money.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Good money for good hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR106856715", "Content": "Hotel is very well located from the airport and there is a free shuttle. Rooms are clean, but no tea facilities, but restaurant is quite good downstaires. Regarding the metro station - it's rather far 10 or 15 minutes by foot and no signs of metro -so do not forget a map or ask people - there they are very supportive;)) there is free wi-fi- so you got connection with the world. Isolation is very good. Good hotel for so little money!", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Ibis Madrid”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR105137675", "Content": "Good value for money located near the airport, as such perfect for real early morning flights out of Madrid. Did not have much time to see surrounding areas but there are several restaurants within the walking distance of the hotel.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Everything a Budget Airport Hotel Should Be”", "Author": "william2000", "ReviewID": "UR103555101", "Content": "My wife and I (we are in our mid 60s) stayed here for one night in early April at the end of eight weeks traveling through Spain and Portugal. This hotel is everything a budget airport hotel should be. First and foremost, the shuttle service to the terminals was reliable and prompt. We arrived at Terminal 4 in mid afternoon, and the Ibis van cycled through the hotel pick up area in about 15 minutes -- we did not have to call the hotel. Return to Terminal 1 the next day was equally easy. Check in was professional. Our room was quiet -- an overriding criteria for us; the room was well designed as are all Ibis rooms and the bathroom was surprisingly large and functional. Terrific shower. The immediate neighborhood offers many restaurants and food stores if you choose not to eat at the hotel. We paid the Internet rate of 49 euro which we booked ourselves on the Ibis web site. Why pay 3 or 4 times that for a night's sleep? The Ibis is a fine airport hotel, and it gets the job done at a terrific price.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cornwall", "Title": "“One Stop en route through Spain”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR102539575", "Content": "Finding hotel in maze of Madrid m-ways was not easy. Came off at wrong junction & so much new build around that satnav became totally confused. Access to underground garage is via steep ramp which is no good for low slung cars. Hotel itself was fine and restaurant good value.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Alicante", "Title": "“Not what we asked for, not we expected”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR90699002", "Content": "An IBIS is a low budget chain, we knew that but we asked specifically for an adjoining room for our disable son when we booked but there wasnt one, the bar was cold and the staffing v poor, check in was chaotic / the check out was worse. The restaurant was awful and the waitress even told us not to order something as it was \"not good\". I have stayed in many IBIS hotels since 1987 and this is the worst...by far", "Date": "December 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Good priced hotel rooms, close to airport”", "Author": "jenkeane", "ReviewID": "UR87241786", "Content": "Tis is about a 10-15min walk from the Barjas train station (which is a stop or two from the Madrid airport). I walked in off the street having been stranded by a cancelled flight late at night, and was happy just to find a room. Taxi’s were a bit difficult, they pretended not to understand where I wanted to go (either that, or they actually didn't understand) - so I ended up walking with my luggage. Nice décor, comfortable bed, several areas within room as well (eg. desk area, padded seating area). TV, clean bathroom. Would stay again.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Prague", "Title": "“Good value, but problems with connections”", "Author": "JUXPrague", "ReviewID": "UR76422316", "Content": "Spent 1 night there during a trip to Canaries, 2 adults and 3-year-old. The hotel is usual IBIS with all its pros and cons, this one being very clean, looked new. Breakfast ok, check-in/out fine, staff usual. The biggest issue is how to get there, although it is less then 1 km from the airport. There is no shuttle bus, no matter what they say on web pages. Either you can take a taxi (takes 3 mins), but the cab driver asks for 20 euros (and he was the fourth or fifth we asked to get us there) - funny when you see the meter says 5 euros. But I understand their point of view - they have to wait very long time in a queue at the airport and probably pay some fee too. The other possibility is to take the metro - you need to walk for some 10-15 mins (6-8 blocks) and then it is 1 or 2 stops to the airport.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Thieves operating in the Ibis Hotel !!!”", "Author": "Belosvecki", "ReviewID": "UR73975724", "Content": "Thieves operating in the Ibis Hotel !!! (the email I sent to Ibis hotel on 3 July 2010) Dear Madam/Sir I booked a room in the Ibis Madrid Aeropuerto Hotel on 09 June 2010 for one night. When I arrived in the hotel at around 22.05h, while signing papers at the reception, my small backpack being next my foot and next to the reception desk was stolen by a thief at 22.08h. I was devastated because the backpack contained my laptop (with many personal and working details) and some clothes. I started panicking, and run outside the hotel, but the thief had gone. The hotel staff called the police and the hotel manager to check video cameras. Two policemen arrived very soon, took my details in Spanish and left. Later the hotel assistant manager Mr Fracais Toubas arrived and we inspected cameras. I could not believe what I saw. The thief (or probably three thieves working as a team) get in the hotel and stood behind me. While I was signing the hotel entry papers, the thief calmly took my backpack in front of at least three cameras and gone. Everything was recorded by the cameras. Mr Fracais Toubas managed to calm me down a bit, and offered me free room for the night. But the manager explained to me that the hotel could not be held responsible for my stolen belongings, even at the hotel lobby. I usually look after my luggage when at the public places, but am more relaxed when in the hotel. But not in the hotel(s) any more. Later the English speaking police officer called, so I could give my version of what happened and could get the police report for the insurance purposes. But the emotional loss was much greater than the material one. Plus all my work and personal details saved in the laptop hard drive. As the police has not called me so far, I believe that they have not found anything. I am also surprised that the hotel Ibis does not have any security, because it seems that the area and the hotel are very often visited by thieves. From some other reports about this Ibis hotel it looks like I am not the first victim here. ____________________________ Director Eric Śešo of Ibis Madrid Aeropuerto Barajas responded the above email on 7 July 2010. He apologises for my unpleasant experience and promised to train the hotel staff to focus on their guest's security. And director also promised in his own words: “You can be assured that you will be received as a VIP guest and I would be pleased to meet you.” Of course, at this stage I do not intend to visit the Ibis Hotel unless I have managed to distance myself from unpleasant memories of that unfortunate event, and then I might like to accept his offer to be received as a VIP in the Ibis hotel and to meet him personally. Note: As of beginning of August 2010 the Madrid police has not called me so far and I do not expect that to happen.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "northern ireland", "Title": "“Good value and location, but beware the burglar!!!!!”", "Author": "Torchsong", "ReviewID": "UR67730510", "Content": "I stayed at this hotel in May 2010 for three nights. I was there for the UEFA Champions League Final. My three night stay was excellent value at €59 per room per night. Clean rooms and beds with good shower facilities. The downsides were not having tea or coffee making facilities in the room and only SKY News in English on television. On my third night, at 720pm, I heard a gentle knock on the room door. As I approached the door, it opened from the outside. A Spanish looking male seemed surprised that I was in the room. He clearly pretended that he had the wrong room as he spoke to me in broken but understandable English. I waited a few seconds and then opened the door again. I saw this man and his friend walking along the corridor, trying the door handles of the rooms, as they moved. I called after them and asked what they had wanted in my room. At this point, his English seemed to disappear. He pretended not to understand me. I went to the reception and advised the male receptionist that I had just had an attempted burglary in my room. I pointed the two males out to him, as they left the hotel via the front door. He did go after them and had a short chat with the one who had opened my room door. The duty manager was called and I was taken to the office to view security tapes. After a few minutes, we had a clear image of the man on the screen. The police were called and I was advised that they would be at the hotel the next day. This was of no use to me, as I was leaving the next morning. I was staying in room 126. The manager quickly advised that he would move me to a different room. He then moved me to room 124. Next door to the room I had just left. That seemed an odd choice. He also offered me the final night of my stay free of charge. The hotel is a short train ride from the airport. It is in a good area and aside from my burglary experience I would normally recommend it. The manager telephoned my room one hour later to advise that he had checked the records to see what time the room door had been opened. He had a record of my return to my room at 630pm but no record of the 'break in' at 720pm. So that means the burglar was able to open the door without there being any record of the opening. I contacted IBIS after I returned home. An email soon followed to advise the police were dealing with the matter. I will avoid Ibis hotels in future. Not only did this experience show a lack of security but also a lack of interest on their part.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "munich", "Title": "“great place nearby barajas airport”", "Author": "triwotan", "ReviewID": "UR61083578", "Content": "clean, modern place with several restaurants nearby. excellent to sleep over before take-off from barajas airport or to visit downtown madrid (metro in walking distance)", "Date": "April 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "5", "Location": "5", "Rooms": "1"}, "AuthorLocation": "São Paulo", "Title": "“You can´t phone & no ar conditionign”", "Author": "RosaTiritilli", "ReviewID": "UR48714382", "Content": "I need a hotel for a few hours before the flight of almost 16 hours to Brazil, I chose an Ibis, theoretically a standard hotel, clean and equal anywhere in the world. It really was an Ibis, but 2 services made me reflect a truly daily 50euros worth it: I couldn´t use a toll free card (that you can buy at newsstands) to call my family before the flight - to my astonishment discovered that at Ibis is impossible to toll free room calls, only calls paid to own Ibis. The receptionist informed me quite naturally at 10pm that if I want to use a toll free card I´ll need to find a bar with a payphone on the street?? This is service?? In addition the air conditioning in the fall can get hot, cool is not possible. Well this experience and disappointment with not being able to use a simple phone makes me wonder if the same fare or something a little more I can not have more respect for myself.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“THERE IS NO AIRPORT SHUTTLE”", "Author": "Redlaces", "ReviewID": "UR46776762", "Content": "The hotel is very modern and very clean and I would recommend this hotel except that THERE IS NO AIRPORT SHUTTLE. We were ripped off by taxi driver for 30 euros (totally my fault and certainly no reflection on the hotel) for a 10 minute cab ride. Be Warned!!! The subway is a ten minute walk from the hotel but the Madrid Airport is huge and once off the subway you have a 30 minute walk to terminal 3. My advice...pay a little more for a hotel with a shuttle...you will save in time, effort and even cash. There again, if you are driving or have other means of transportation it is a good hotel with a reasonable breakfast.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Czech republic", "Title": "“Basic, nice, clean hotel close to airport”", "Author": "Medvidek_11", "ReviewID": "UR46624267", "Content": "We had a late night arrival + an early morning flight so we picked up this hotel because of its position and we certainly do not regret it. Room was smaller but cozy and very clean. Beds were comfortable. Showers spotless. Hotel is quite near airport bud we didn't hear any noise from airplanes. Nearest subway station is about 10 min. walk from hotel. TV offered somewhat close to 12 channels (english/spanish). Breakfast was extra but was a pleasant surprise for us - reasonable and fresh variety of beverages and ingredients for decent price (5 euros). Open 24h with helpful staff. For the price 49 euros/night we got very good service. It's an airport hotel so I don't understand why people complain about it's distance to the city center. There's bus station and subway station close - it takes about 20 minutes by subway to get to the downtown. We we're very satisfied with our staying at Ibis.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Good place for an early start at Barajas”", "Author": "Kelly F", "ReviewID": "UR46465945", "Content": "I had an early morning flight, so chose to stay close to the airport instead of in the city. It took a bit of haggling to get the right metro ticket (It is 2 Euros if you are getting off at the airport, but only 1 Euro if you get off at Barajas station in between; the ticket handlers automatically assume you mean the airport if you ask for a ticket to Barajas, so be sure to tell them \"No airport, solamente Barajas\") I got directions to the hotel from the Metro agent at the station since there is no map there. Simply walk out of the station & turn right to walk along Avenida Logrono. You will pass a Burger King & a Best Western, as well as a hospital of some kind. When you see the sign for the Melia hotel, cross the street & then keep walking along Ave. Logrono until you come to an open area. The hotel will be on your left across the street. If you walk past the sign & by the Melia parking lot, you will have to walk back to the corner to cross at the light because by this point, Ave. Logrono is too big & too busy to cross on foot. The hotel was quiet & clean. I couldn't get any English channels on my TV, so I went to reception & asked about it. Because they couldn't fix the problem within 15 minutes, they gave me my room for free. I thought that was quite nice. I had a double bed & a nice sized room (for Europe) and a really nice bathroom with a large shower. There is internet access in the lobby, but for 5 Euro for 24 hours. There is a breakfast area & a bar, where I got a typical Spanish breakfast (cafe con leche & tostada) for 3 Euro & later a Coke for 2 Euro. Many guests hung out in the bar in the evening.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Nice staying at a Ibis hotel chain”", "Author": "guifgobato", "ReviewID": "UR31031900", "Content": "There is not so much or different to say about a Ibis Hotel. It´s useful and most of the time worth of a staying and they look to be the same all around the world; for this reason, it´s hard to be surprised by one. The Ibis Madrid Aeropuerto, close to Barajas International Airport, is not very well located as the aiport is almos outside the city and the journey from the hotel to downtown last around 25 minutes. At least is easily reached by the same subway line that leaves Barajas Airport to Madri´s downtown. The breakfast is good, the staff is ok and the room, clean and confortable. There are very few options of restaurants surrounding the hotel. its restaurant can work as an alternative if you are willing to eating something. The neighborhood is quite and seems to be a safe one. Be aware of not staying at this hotel if you feel like reaching the touristic places on foot. At the same trip this hotel was the second one I stayed in Madrid and unfortunately the first one (also from Accor hotel chain) was not available.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Recommended for those who needs to sleep a night in Madrid prior to flying”", "Author": "Beto_Rios", "ReviewID": "UR30482229", "Content": "We chose this hotel because we had our flight back home early next day and we wanted to be close to the airport. The room was mid-size (double), comfortable, modern. The breakfast was plenty and good. The hotel is about 600 mts away from the Barajas Metro Station, which was what we asked for. If you want to go the downtown Madrid it will take you around 45 mins by Metro to the Sol Station so consider this if you are planning to use this hotel as your base for Madrid. Going by taxi, it will cost you around 50 euros. The neighborhood is good even at night. They have a 24 hour bar service which is good to get there and relax.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Whitehorse", "Title": "“Great hotel close to airport”", "Author": "TheCat41", "ReviewID": "UR21899322", "Content": "We stayed one night at the ibis Aeropuerto before our (very) early flight out of Madrid. This is an airport type hotel, not much atmosphere etc. but it had all the features we were looking for. Our room was clean and very functional. The bed was comfortable and there was good lighting for reading.The room was \"soundproof\" a great feature when you are close to an airport and need to get a few hour sleep before a flight. There were non-smoking rooms available, something that shouldn't be taken for granted in Spain. This hotel is very well setup to serve those coming and going from the airport. Its open 24 hours a day and serves meals at almost all hours. Staff were friendly and helpful with special requests. The hotel is a few blocks from the Bajaras town metro stop and quite easy to find. Its about 40 minutes on the metro to get downtown.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Manchester UK", "Title": "“Ok for short stay but beware being bitten”", "Author": "halfwayinn", "ReviewID": "UR20413833", "Content": "Ideal for the IFEMA exhibition centre and airport, decent restaurant but limited menu, decent bar. No probs with the wake up call and taxi reservation. However I woke up to over 15 insect bites so questioned the cleanliness of this hotel, I wont be staying again.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Gainesville, FL", "Title": "“Decent Experience”", "Author": "flyinggator", "ReviewID": "UR16045260", "Content": "Overall, the hotel was fine. It was fairly convenient to the Barrabas Metro station (~5-10 min. walk). The area seemed safe and there were plenty of restaurants nearby. The hotel now offers a shuttle service to/from the airport for 7 euro/person. My only complaint is that on my second evening the electricity in my room went out. A circuit breaker flipped. The evening staff tried a few things, but couldn't figure out how to fix the problem. They unfortunately told me the hotel was completely booked so I couldn't move rooms, but did offer to move me to another hotel. It was already 11pm, so I decided against this, figuring that I really didn't need the lights in order to sleep. The evening was OK, but I struggled between keeping the window open to cool the room down, but wanting to keep it closed to keep the street noise out (the room was very quiet with the window closed). My disappointment followed the next morning. Having told the evening staff and the night shift worker about the power being out, they assured me they would fix it \"first thing in the morning\". After leaving in the morning and returning to the hotel around lunch, I thought for sure that the electricty would have been fixed. Nope! I inquired at the front desk, and it seemed like this was the first they had heard of the problem. There just didn't seem to be any follow up. After explaining the situation to the day staff, a front desk person came up to my room, jiggled a light above the bed and instantly the problem was fixed. What really annoyed me was that he told me that this problem had occured previously, and that they knew how to fix it. Unfortunately, this didn't get communicated to all of the staff. The remainder of the stay was fine. However, other than offering me some free drinks at the bar, they did not offer any refund, discount, or any other courtesy after what happened. It seemed they simply didn't really care. Oh well...", "Date": "May 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Above my expectations for an airport hotel, very clean, convient”", "Author": "DavidHaselhoff", "ReviewID": "UR13554370", "Content": "This hotel met our requirements for a quick overnight stay flying in and out of madrid. We didn't check in until 12:30 am, the room was a typical european hotel (minus the bidet), the shower was warm and our wake up call was prompt. The breakfast was extra, but we ate it since we were in pinch on time, it was fine but lacked the \"hearty\" foods such as bagels and big waffles which we american expected, but they had the european fare such as croissants and jamon. Getting to the hotel wasn't a problem, after reading the above reviews before we got there we expected to negotiate a price (we settled on 16 euros) leaving the hotel cabs were plentyful and the fare was 11 euros. I would stay here again, since for that price I could do much worse. Note: Taking the metro from Barajas to the airport is 2 euros a person (extra fare due to the airport stop) if you are heading to Terminal #1 (Delta, Continental, US Air) the metro stop is about a 10-12 minute walk through the airport, so keep that in mind.", "Date": "February 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Porto, Portugal", "Title": "“Nice room, bad staff”", "Author": "PortoExplorer", "ReviewID": "UR11948397", "Content": "Nice room for the price paid. Is a good hotel to pass the night between flights, 'cause it's a 600 mts from the Barajas Metro stop. However I didn't like the staff at reception, not kind or friendly. It seems that they were doing us a favour at Check-in. No breakfast included. We had to pay extra for it and isn't worth it, only helps not searching for cafés early morning.", "Date": "December 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Northville, Michigan", "Title": "“New hotel close to airport, its a shame it didn't have a shuttle bus...”", "Author": "Married_40_something", "ReviewID": "UR10083476", "Content": "This is a very new hotel, with a 24 hour bar area where I believe you can get snacks all night as well. We arrived at the hotel around 1:00 in the morning, after a 20 Euro taxi ride (which lasted like 5 minutes). Two different taxi drivers at the airport refused to drive us to this hotel, another wanted 25 Euros to drive us there. My husband finally negotiated the 20 Euro rate. I know others took a train to near the hotel, however, given the time of night, and the amount of our luggage, this wasn't an option for us. The hotel was modern, and perfectly OK for a very short overnight (which is I am sure what most of the patrons are). They have a deal with a local taxi company to bring people back to the airport, but we still paid 15 Euros. While we only paid a very affordable 49 Euro rate (w/o breakfast) for the room, you should consider staying somewhere with a free shuttle bus if you can get it for less than 84 Euros (the cost of our room and two taxi rides).", "Date": "October 15, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "South of England", "Title": "“More than up to the job of an overnight Airport stop”", "Author": "AntSouthofEngland", "ReviewID": "UR8132663", "Content": "We booked this because it was very close to the airport and we had to catch an early flight. We'd read on the forum that it was brand new, which also usually means clean and fresh. It was also inexpensive, which is what one expects of an Ibis. For the money, it was a pleasant surprise. Clean and fresh, with helpful (if a little overstretched) staff. The room was clean and comfortable for a one night stop. Furnishings were cheap, but well designed. The early morning call came on time. No airport shuttle, but they called a taxi for us and that, also, came on time. We'd done a lot of walking and were pretty tired when we arrived. We followed the instructions we'd read on the forum and got off the Metro the right stop (the middle of the three Airport stations). But surfacing from the station, we were a little confused. The address says Avenida General, but it's actually on signposts at this point as Avenida de Logrono, which becomes Avenida General. We'd already eaten as we thought the neighbourhood might not offer much in the way of bars and restaurants. In fact, there are a number of restaurants as it's a proper suburb. We can't answer for the food in the hotel, but the restaurant looked fine and the small bar was pleasant enough to sit in for a glass of wine and a few nibbles. But check out the deal on breakfast. Ours was included, but, as we had to leave earlier than breakfast started, we assumed we would have to skip it. Then we noticed a number of signs offering early breakfast. The lights were off in the restaurant in the morning, but the food was all laid out ready... which led to us incurring the wrath of the one desk staff when we attempted to pick up a bread roll. Overall, for the money, it was a good choice. I wouldn't pick it for a week, but it was more than up to the job of an overnight airport stop.", "Date": "July 17, 2007"}], "HotelInfo": {"Name": "Ibis Madrid Aeropuerto", "HotelURL": "/ShowUserReviews-g187514-d620357-Reviews-Ibis_Madrid_Aeropuerto-Madrid.html", "Price": "$63 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">49 Avenida General</span>, <span class=\"locality\"><span property=\"v:postal-code\">28042</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "620357", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2e/57/2e57763da7b26c668604f44275381fcd1large.jpg"}}