{"Reviews": [{"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yamba NSW", "Title": "“Excellent location, huge clean rooms, would stay again”", "Author": "travelmum3", "ReviewID": "UR128286380", "Content": "As a family of 5 we we booked 2 rooms and stayed for 5 nights. The hotel was situated in an excellent location, at the top of the Ramblas and a 2 minute walk to Catyluna Sqaure. The rooms were huge, one room had balcony and overlooked the beauiful street and the other room over looked the pool. The rooms were spotless and the beds quite comfortable. The reception staff were helpful when you could get their attention, a lot of people standing there busy talking to each other... Only negative aspects were poor internet and expensive breakfast. One room had no internet connection at all despite there being supposed free wifi. If wifi is important then avoid room 426.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Excellent stay”", "Author": "keen_traveller495", "ReviewID": "UR128040082", "Content": "We stayed at this hotel for 4 nights and didn't regret we chose this hotel. The location is central, right near the Ramblas. The room was clean, big and comfortable. Breakfast is good, especially coffee. They serve excellent coffee at the hotel. The reception was polite and quick in putting us into the room, however we had early check in. So I do recommend this hotel for a comfortable vacation or short escape in Barcelona.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "luxembourg", "Title": "“good location, excellent breakfast.. but the rest..”", "Author": "lyba", "ReviewID": "UR128032959", "Content": "good location, excellent breakfast, but the hotel you can forget.. small rooms, unpolite staff, realy no place i appreciated.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Great stay”", "Author": "reviewer186534", "ReviewID": "UR127822094", "Content": "My husband and I have just returned from a 3 night stay at Catalonia ramblas and would thoroughly recommend to anyone. The hotel is a 2 min walk from plaza catalunya which is a popular area in the city. We found the room to be very nice, only issue I had was a lack of power sockets and no mirror next to dressing table area. The spa was beautiful, would recommend anyone staying to find some time to visit it. Beautiful pool. Sauna and steam room. The bar was nice, reasonably priced. A great location for city break.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Wales UK", "Title": "“Excellent weekend break”", "Author": "RogerKaren", "ReviewID": "UR127555877", "Content": "Hotel staff very welcoming and warm, a quick efficient check-in. Location ideal for all sight seeing purposes. Breakfast buffet was superb with endless choice available. Made use of the hotel spa facilities which was included in the price, very enjoyable and made our weekend. Highly recommended, would book again without a second thought!!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex, England", "Title": "“Short Break To Catalonia Ramblas Barcelona, Spain”", "Author": "barranceshirley", "ReviewID": "UR127419014", "Content": "My husband & I stayed at the Catalonia Ramblas, Barcelona, Spain last month (March2012). It was a special occassion as we had just got married. When we booked the hotel it was requested we had a nice room as it was a special occassion. On arrival our room was small & not what we had expected, I was very upset. I went to reception and explained the situation to them, within 30 minutes we were moved to a wonderfull large room. The room had 2 balconies, a huge bed and so,so spacious. All the staff at the hotel were fantastic, so polite & friendly. The breakfast was so varied, there was something for everyone. The bar was well stocked & good cocktails. The spa & pools are brilliant too. This hotel is in a fantastic location, just off Ramblas which is where you would want to be. So easy to get there from the airport & once there everywhere is within easy reach. We enjoyed our stay so much at this hotel I would recommend it to anyone looking for a holiday to Barcelona. Thank you so much to all the staff at this hotel, you are great & made our stay there memorable. We will be back for another stay with you in the future.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“A great place to stay in Barcelona”", "Author": "JanSkjoy", "ReviewID": "UR127379002", "Content": "We just stayed at the hotel and must say it was a great pleasure. Although the staff in the reception was not excellent and not too friendly, this did not spoil our vacation. We stayed in a Junior Suite with private pool and enjoyed the stay immense. Afternoon in the pool with a cold beer or cava made the day perfect. Also perfect location for the Rambla, metro and tourist buses gave us a great starting point for all our days. We would also point out the service and friendliness of the guy serving breakfast in the bar. Very good quality and positive person. One tip to the hotel. Invest in toilet brushes for the rooms - honestly!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“extraordinary price quality relation. best restaurant in town!!”", "Author": "Federico H", "ReviewID": "UR127280846", "Content": "last saturday we went to Restaurant Pelai after a friend's recomendation and indeed, it was a gorgeous experience!! i totally recomend it. City center prime area, nice decoration, excellent Service, good wine celler, excellent food quality and the best is that the we were expecting much higher prices for that quality/service. To sum up: excellent !!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Very solid hotel one of the best I've stayed in in Europe”", "Author": "muadib1158", "ReviewID": "UR126913069", "Content": "All told I've probably spent 6 months in hotels across Europe. This is probably the nicest I've ever stayed in during all of that time. I will clarify that statement to say that I've stayed in some cheapo hotels and some nice business traveler hotels, but not \"luxury\" hotels. Clean, well staffed and a great location. I would definitely stay here again if I were traveling to Barcelona.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tiberias, Israel", "Title": "“Wide range from Excellent to just Awful”", "Author": "savtashira", "ReviewID": "UR126908295", "Content": "The hotel was an odd mixture of great - but really great and worse than awful. Catalonia Ramblas is a very modern and clean hotel. It's situation was perfect within walking distance to everything. The room was very very big and lovely big beds and parquet floors. We overlooked the pool so we never heard a hint of traffic. The beds were very big and easy to move. Breakfast was extensive with lots of fresh fruits, delicious pastries, good cappuccino etc etc. The dining room staff was very friendly and obliging. Free Wifi was welcomed change to usually high costs in hotels. But, unfortunately we had problems with the bath room. There was a very bad stench of sewer in the toilet. When I brought this to their attention on the first morning, they explained that when it rains in Barcelona, there is a sewer problem. OK, as we say \"[--] Happens\" Anyway we spent very little time in the room. There is also a large door between the toilette area and the bedroom, so the odor didn't permeate to our area at night. The other problem was the shower. There was no way we could adjust the water. Either it was scalding hot or freezing cold. All this without touching the faucettes. Showers were a nightmare. My room mate was in tears. They offered to change rooms, but when we checked, they were all the same problem with the water temperature. Usually, I am not the one to complain, but our experience in the hotel was definitely soured by the toilet and shower. We went to the manager and as compensation, they allowed us late check out free of charge and also didn't charge for the dinner we had one night. I must say they were very forth coming. Other small problems we had was the hairdryer. The covering always fell off, exposing the wires. The bed sagged, causing one to slip to the side. There was virtually no place to put clothes apart from the hanging closet. I had to remove the coffee/tea shelf and leave things there. But, I wouldn't go back without assurance that the problems I mentioned were fixed. When I read Trip advisor, this was a re-occurring comment by other travelers. The 4th floor was mentioned as problematic.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Clean, good location, recommended”", "Author": "marianneBL", "ReviewID": "UR126790265", "Content": "Spent 3 nights in the hotel. Clean, big room, great bathroom, great beds, Good free wifi. The location is perfect, very central in good area. Very easy to find and close to airport bus. Unfortunately, the gym and spa is opening very late and therefore I didn't try. Did not try breakfast/restaurant. Plenty of cafes and restaurants nearby. Did have problems with hot water but it was dealt with immediately.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Excellent location”", "Author": "nyreesummerof69", "ReviewID": "UR126680388", "Content": "Hotel was a little expensive, but I don't want it to seem negative. Location was brill very close to everything great bus shuttle service to and from airport. Breakfast was amazing great choice. Rooms were clean and a good size although a little noisy I wouldn't say they were sound proof, photos on website are a true reflection of the hotel. Staff at reception were helpful. Internet not good connection in some rooms but available in lobby area. Would stay here again.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Great Location”", "Author": "flynn_joe", "ReviewID": "UR126529218", "Content": "Just recently returned from a short break to Barcelona with friends. We stayed at this hotel following reviews on this site and we were not disappointed. The hotel is sited at the top of La Rambla by Placa da Catalunya, a very central spot, perfect for the tourist buses and for sightseeing. Our room was spotless, large and we loved the bathroom, which was huge. Our balcony looked down onto a typical Barcelona narrow street, very atmospheric. Breakfast was set in a large dining room, where you could choose something different every day and it was all tried by our party and all was very tasty! We did not try the spa or pool but they looked great and had it been August, very inviting. Bar area small but lovely with attentive waiters. We would certainly stay here again and would recommend it to everyone.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkhamsted, United Kingdom", "Title": "“Excellent hotel”", "Author": "Elaine R", "ReviewID": "UR126494424", "Content": "I stayed here a couple of weeks ago and it really exceeded my expectations, based on the price and location. The hotel was calm and quiet inside, despite being just off Ramblas, and the staff were extremely pleasant and helpful. My room was huge! It was also very quiet, clean, well stocked and the bed really comfortable - I had a great night's sleep. I would recommend it to anyone looking to stay in that part of Barcelona and will certainly be coming back myself. My colleagues were equally impressed.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very professional staff, perfect location, recently updated, somewhat loud.”", "Author": "Mowgliw", "ReviewID": "UR126452677", "Content": "I traveled to Barcelona for business and was very happy with my hotel choice. The staff was unfailingly professional and courteous at all times. The room was very comfortable with generous amenities (both a European and an enormous rain shower). The location was far enough away from the Ramblas to avoid most of the crowds, but close enough to stop by for a visit. Two very close subway stops were very convenient. A cash machine just outside allows one to get cash out and stores in the room safe without walking around. The one night that I ordered room service was quite tasty. The only complaint would be that folks in this area of Barcelona party all hours of the night and my room on the ground in the back overlooked a street that was traversed by singing drunks one evening at 3 am.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Do not stay here!!!!!”", "Author": "Oke79", "ReviewID": "UR126449652", "Content": "My partner and I stayed for 4 nights for a break before our baby is born..... What a mistake! The hotel is situated in a great location and the rooms are ok, that's where the positive's end. The staff are the most arrogant people we have ever come across and the most unhelpful people in the world. When we arrived our room was not ready so the lady at reception suggested we upgrade to a suite which includes lots of extra services for an additional 30 euros per night, so we did........... The extra services were..... A pair of paper slippers and an xxl dressing gown!!! This extra service would have infact cost us 120 euros! We then changed back to a standard double which was almost identicle, minus the slippers and dressing gown! The menu in the restaurant is fine if you enjoy the more extreme side of Spanish/French food but not for the fain hearted! The 'gym' is a joke! It's an old tred mill and 2 old bikes in a broom cupboard and the spa is shocking and dangerous! All in all this stay was way over priced and the hotel is no way near 4* standard especially the service. It is a shame as I'm sure run properly this could be a fantastic hotel. The hotel also does not really cater for its English speaking guests and the staff speak limited English which makes its hard to even complain or get your point across. Please,please, please do not get fooled by the look of the hotel as its is not worth the money.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Genoa, Italy", "Title": "“good hotel”", "Author": "stefania m", "ReviewID": "UR125851340", "Content": "location fantastic but no noisy, near the ramblas many bar and restaurants and good shops . the rooms are very big and contortable clean ,big beds , tv plasma with italian channel bathroom with boisery and separate shower . the breakfast isnt included but not expencive. hotel assistents, barman very polite and disponible. good rates, free wifi in each rooms", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Superb”", "Author": "adeelfrajput", "ReviewID": "UR125820582", "Content": "Easy to get to, safe, superb service, very clean, excellent price, free wi-fi, Location is superb, right in the centre of the city, 1 min walk to la rambles and catanya, did not have breakfast so cannot comment on that however not a bad thing to say about the hotel at all.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Amazing Service!!!!”", "Author": "Sohail M", "ReviewID": "UR125414421", "Content": "Amazing customer Sevice by all staff especially Leticia. Everyone was very helpful. We also got a complimentary upgrade. Overall great experience. We were there Dec 30 2012", "Date": "February 29, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Avoid this hotel”", "Author": "JW1023", "ReviewID": "UR125197332", "Content": "The check-in process took a long time. I think it took us 30 mins at least to get checked in. The staff, particularly a certain Dani, was not helpful at all. He was stationed at the reception. We needed to reconfirm a tour booking and we approached him to ask him if he could reconfirm the tour details for us. His reply was absurd, that he was not authorized to call and that we should call the tour company ourselves. Moreover, he said he could find the reference code to quote the tour operator. Um, well, the reference code is there on the voucher we had printed. Eventually, he did call the tour company and reconfirmed the booking.. But his customer service skills are clearly lacking. It appeared to me like he did not want the hassle of calling the tour company. The rooms LOOK nice and modern and hip, but the functionality needs repair. The aircon thermostat didn't work, for it was only set at 24 degrees. You couldnt change it. In the bathroom, the water pressure was weak. The shower thermostat was flaky, for sometimes it was too hot, then too cold. My wife almost got burnt a few times trying to regulate the temperature of the shower water. The shower tub drain needed de- logging because the tub also flooded when we took a shower. There was even one night when all the water in the bathroom was hot, and this happened when my wife was in the middle of taking a shower! She couldnt rinse herself because of the hot water. She almost burned her face trying to rinse the shampoo from her hair. We couldn't find the lukewarm temp of the water. The water in the sink was hot too, even when you set the thermostat to the max cold position. For the breakfast times, the restaurant opened at 730 am. This was not good for us since we had tours that started at 9, so we had to rush our eating so as not to be late for the tour. They should start breakfast times earlier, during weekends. Avoid this hotel at all costs. This hotel is superficial. It looks nice and all, but inside it, you'll find the cracks and flaws. Waste of money.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cork", "Title": "“Perfect location”", "Author": "gercumberton", "ReviewID": "UR124726228", "Content": "We travelled as a group of 9 females arriving at approx. 9:30 p.m. I had requested 3 twin rooms and 1 triple and was delighted that we got what we requested. The rooms were superior, hotel very quiet and clean. Breakfast was superb, we spent our first morning 1.5 hours enjoying the very spacious restaurant and very fresh varied foods available.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Port Elizabeth, South Africa", "Title": "“Well situated!”", "Author": "Salome P", "ReviewID": "UR124566770", "Content": "Stayed there for 2 nights. Lovely Hotel, lovely room, friendly staff, free internet. Close to everything. The only problem is that the rooms and corridors are not carpeted(marble and wood) so the noise from people talking and pulling their suitcases can be a little noisy. Otherwise it was a good experiece. If you are a 1st time visitor to Barcelona, be carefull of pickpockets! They stole our bag from under our feet in a Restaurant! Police were very helpful though.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“good hosting in catalonia ramblas”", "Author": "Barak D", "ReviewID": "UR123898165", "Content": "we stayed in this hotel in January this year for 4 nights - my wife, 2 children & me. We took the superior room, the room was big with 2 1.2 meter beds. there is a sofa as well but it is not to comfort. they gave us additional mattress but it wasn't comfortable. the shower is perfect - bath and a shower. the crue is very plesent. they have spa as well but we didn't use it.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rugby, United Kingdom", "Title": "“Would stay here again”", "Author": "Penelope745", "ReviewID": "UR123514710", "Content": "Visited Barcelona for a short break. Stayed in the Catalonia Ramblas for the one night. The room and its en-suite were very comfortable, clean and spacious. As we arrived late evening, we decided to eat in and what a superb meal we had, the food was delicious, the service very good and the price very reasonable. Breakfast was an extensive buffet, something for everyone. All staff were very pleasant and helpful. Would definitely stay here again if we revisit Barcelona.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location”", "Author": "Judith C", "ReviewID": "UR122271556", "Content": "Central location was a great spot. The Suite was lovely and highly recommend the Suite with a terrace - we had lovely mornings relaxing in the sun on the terrace. The restaurant served great food at a reasonably price. It was comfortable and easy going stay.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“A great hotel in the best location!”", "Author": "chaitov", "ReviewID": "UR122088852", "Content": "We had a very good experience in this hotel. We didn't expect such a comfortable, modern, totally renewed room. We enjoyed the space, the huge bed, the shower, the coffee table and the cute terrace to the street. You can't ask for a better location, near Placa Catalonya and the Las Ramblas. The most central Metro station is 3 minute walk from the hotel. The hotel was very clean and the service at the reception was excellent at all times. We took no breakfast, so I can't say anything about it. We stayed in the hotel during the winter, and were happy to find out there's a small spa, for free. Enjoyed the mini-pool / Jacuzzi and the Sauna. The rooms are equipped with a TV, mini-bar, electronic kettle (with coffee, tea, sugar, etc.) and an electronic safe.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Central location”", "Author": "Bob W", "ReviewID": "UR122081778", "Content": "Central and quite spot, nice spa and amazing staff. Very close to Ramblas and I pretty enjoyed the pool area where you can make a lot of friends. With respect to its quality and service, the price is fairly reasonable.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "oklahoma", "Title": "“Large rooms”", "Author": "Linworldtraveler", "ReviewID": "UR121992788", "Content": "Stayed in Barcelona for 3 days, wanted something central. Hotel is in the middle of everything. Can't fault it's location. Did have a few issues wtih housekeeping. Mold in shower and bath floors in the corners had dust and build up. Leak in ceiling by rain shower and under vanity. Someone had spilt something on the wall under the desk. It dried and was never cleaned up. Food tray in the hall for 3 days. Gym was open all the time only open when spa was open . Odd hours.On the up side. Breakfast was good. Superior room was large. Nice linens on bed. Mattress was firm. Lighting was good. Wish they had a mirror in the room, that way 2 people could get ready at the same time. I would call this a superor 3 star, not a 4.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pune, India", "Title": "“Good Hotel - Good location”", "Author": "mayankak", "ReviewID": "UR121794177", "Content": "We visited Barcelona on the 23rd November stayed there for 4 nights. The hotel is centrally located everything is close by and at walking distance. The hotel is good with a good spread of buffet breakfast, only the hotel needs to improve in the house keeping section. Unfortunately we had to change our room twice since the room on the 4 th floor in the wing facing the main street was smelling of sewage, we then moved onto the 1st floor, which was much better. But over all good stay and a recommended hotel.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Huddinge, Sweden", "Title": "“A good place to start your sightseeing!”", "Author": "Alebir", "ReviewID": "UR121542765", "Content": "The hotel was very good situated for sightseeing close to the Ramblas and the old City and lots of restaurants in every prize classes.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Was charged twice for the stay - 4 months later still waiting to get the money back”", "Author": "oceanemn", "ReviewID": "UR120654288", "Content": "1st thing i would like to say about this hotel is that at time of payment the reception staff told me that my card was not working and assured me the payment by card did not go through so I went to get some cash from a bank just outside the hotel and paid cash. When I got home I checked my bank account and realised the payment by credit card worked. Which meant I paid twice, once by card, once by cash. I have been in contact with the hotel for nearly four months who say that they know there is an issue and they are taking care of it but I still haven't been paid back. Appart from that, the rooms are nice and comfy (but a little nosy on the pool side - as there is bar), breakfast is expensive but good. It is nice to have a swimming pool but a little small and it was difficult to get a sunbed during the afternoon. For visiting very good location.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "perth, Australia", "Title": "“Great location”", "Author": "maxico", "ReviewID": "UR120516995", "Content": "Stayed here one night pre cruise. Last time we stayed at the Ramblas Hotel ( never again). Caught the aerobus from the airport to plaza Catalunya and a short walk to the hotel from there.The Catalonia Ramblas is a huge improvement on the last one we stayed in, although it should be for the price we paid.Check in was easy and the staff helpful and polite.Our room was large,modern and clean. We had a room at the rear and it was very quiet even though it was next to the lift.Wifi is free and works well although it is not suitable for skype. The hotel is in an excellent location and if you can get it for a good price it is good value", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bergen, Hordaland, Norway", "Title": "“Decent rooms, good breakfast and service”", "Author": "Trygve A", "ReviewID": "UR120352969", "Content": "I don't know the price my company paid for us staying there, but the service was good, the location excellent, the air-condition worked well (a little noisy, but I didn't mind), the breakfast was good, and it looked good. If anything, it is not so easy to orient in the hotel, as it seems to be made up of several refurnished buildings, in stead of one from the start. Overall though, I would definitely recommend this hotel (unless the price is too steep of course).", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“Perfect location, nice hotel!”", "Author": "Dashkina", "ReviewID": "UR120015862", "Content": "If you want to explore the city - this is a perfect place to stay. It is located minutes from Rambla Canaletes, Plaza Catalunia and Exiample, yet being quiet to ensure your good night sleep. The rooms are modern and nice, they could only be a bit more spacious and there are no drawers. Breakfast is great, nice variety, even an omelette station. I didn't get a chance to try their outside pool, but it looked very appealing.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Location, location, location!”", "Author": "rollonemptynest", "ReviewID": "UR119723165", "Content": "Recently had a 2 night stay in the Catalonia Ramblas prior to a cruise. You really could not ask for a better location. Located just a short few paces from Plaza Catalunya, Las Ramblas and the beautiful gothic quarter. The beautiful old facade of the old building belies the modern, comfortable interior. Breakfast was plentiful from the buffet and of excellent quality. Very friendly and welcoming front of house staff.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“Very good hotel, with some issues”", "Author": "wesz", "ReviewID": "UR119132505", "Content": "My overall opinion is that the hotel is good, well positioned, clean, popular, but I had some minor issues, which is not really acceptable in a 4* hotel. These were: 1. One morning I was surprised by a coakroach in the bathroom. Some pest control please. 2. The size of the TV is ridicoulus, if you have money for hardwood floors, white furnitures, and marble in the bathroom, why can't you invest into a 32inch TV? 3. The front desk staff is unorganized, they do their job, but there are some issues on the friendliness front. A smile coulc help a lot. 4. Lats evening I got a \"love\" letter from the management, asking me to approach the mighty front desk, because nobody can owe more than 600EUR at one time. Obviously I wasn't the only one naughty guy, some other victims were also standing there. The only issues I had were the following: We paid the room on that morning full, just stayed one more night, but it was paid as well. Guys, you got my Credit Card on file, why didn't you put an option on it, or charged it? Thats why you have it. Instead bother me, order me to the front desk and not even saying that you were sorry. Otherwise the hotel is clean, good bed, nice interior design, coffee / tea maker, but somehow that added value, or nice touch is missing. It's a management issue.", "Date": "October 10, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Athens", "Title": "“A very good choice, especially for its location”", "Author": "Athens_Traveler15", "ReviewID": "UR118108219", "Content": "I stayed at the Catalonia Ramblas only for one night on a business trip. The hotel was very descent, the rooms were well-furnished, quiet and spacious enough. The food was good and the staff was polite. Also, the business center and convention rooms were good, not the best you can find but reasonably good. The best thing about this hotel is its location. It is very close to the Las Ramblas avenue, which goes up and down the downtown area of Barcelona and can lead you to both the modern and the old (medieval) central part of the city. The hotel's location gives you the opportunity to do a quick site seeing tour (Gaudi buildings and the medieval part of the old city) and/or some good quality shopping, even if you only have a couple of hours to spend. Would definitely visit again.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Lancashire", "Title": "“Probably wont stay again”", "Author": "Jeannie55", "ReviewID": "UR117927678", "Content": "We were a party of 6 ladies and booked 3 twin rooms, we booked in March and made a specific request for twin rooms, on arrival we were given 3 rooms close together which was good, one room was as requested the other two were cramped and had double beds. We requested twin rooms and were told they only had one avaliable the hotel was full, eventually after insistance they found what they called an upgraded room, this was 2 floors up but was ok, although difficult to see what the upgrade had different. The rooms on the ground floor had very little natural light and were very dark. Our room had a bathroom opposite a seating area and the blind was so inadequate we could be seen sat on the toilet, and also in the shower, which was so basic directing the jet correctly was impossible, by rooms to the side of us. The pool are was small with a very poor outlook/surroundings,as usual witha city hotel, it was overtaken completely by a large rowdy crowd all the time we were there and the drinks were very expensive. The spa was closed. The hotel is contemporary if dark and very clean, the staff were very helpful, especially in the restaurant, and the location was great.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Aarhus, Denmark", "Title": "“Good experience”", "Author": "KristianR", "ReviewID": "UR117697381", "Content": "Nice and clean. Worked really well. Good rooms and a good breakfast. Very central. I recommend it.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“LOCATION!”", "Author": "InesTa", "ReviewID": "UR117578367", "Content": "We stayed here for 3 nights in July and we choose the hotel for its location, which is great indeed, and for the swimming pool, good at the end of a hot day... Unfortunately, the swimming pool was very small and very crowded. The room with extra bed is extremely small. Breakfast is good. The staff is ok.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“PERFECT, ENJOYED OUR STAY”", "Author": "Romioo", "ReviewID": "UR117315591", "Content": "After having hard time in the hotel our agent booked IN BARCELONA DOWNTOWN, we decided to move to this hotel. The employees at the reception welcomed us with a big smile that did not leave their faces until we left. \"EVA\" AT THE RECEPTION IS VERY HELPFUL AND PROFESSIONAL. A nice lady that guided us by herself to check the room before booking. THE room is fantastic and ABSOULETLY CONFORTAMBLE with a double glass window for a quite stay. SERVICE IS GREAT. JUST NEED TO ADD VARIETIES TO BREAKFAST.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London", "Title": "“A bit expensive, for what it is.”", "Author": "Pro89", "ReviewID": "UR116611193", "Content": "Booked this hotel because of its location and in that respect the hotel was pretty good. I paid for the standard room and after seeing the Junior Suite with pool, decided to upgrade by paying an extra 70 euros. The room was located on the new 7th floor, and there were no bell boys, so you had to carry your own luggage to your room. This was further complicated by the fact that the hotel lifts did not serve the floor. The room was pretty spacious and the wooden deck terrace and paddle pool was a nice touch. Aside from these external extras, everything else about the room was pretty much identical to a typical room. The beds were not particularly comfortable (too hard), but the rest of the furniture in the room was pretty good, especially the sofa and the 50 inch plasma television. The bathroom and its layout was excellent. There is a Jacuzzi bath tub and a separate rainfall shower room. The toilet was located in a separate part of the room. The shower water temperature kept fluctuating during my stay which was disappointing. The main problem I had with the suite was that the pool in the terrace was tiny, not heated and had no lighting. This is contradictory to the website photos, which clearly showed the pool having underwater lights. The seating area was very poorly lit, which meant it was virtually impossible to enjoy any of the outdoor facilities after dark, which is disappointing considering the extra money I paid for the privileges. The standard of English amongst the receptionists also fluctuated massively. Laura at the front desk was excellent, and really went out of her way to help me choose a good room, but a bloke I had the pleasure of speaking to, couldn’t actually speak English and kept apologising. I found this rather bizarre, as most guests, as like many other hotels in Barcelona tend to be occupied by English speaking guests. Despite being marketed as a luxury hotel, there was something very budget about it. I can’t quite put my finger on it, but I reckon it might be a combination of the so-so service, inconsistent hotel design (some floors were very modern and swanky, others were run down) and questionable maid service (a platter of rotten fruit was left outside my room by another guest for several days). Nonetheless, the Catalonia Ramblas has been one of the better hotels I have stayed at in Barcelona, and should they make their prices more competitive it would be very hard for me not to consider staying here on my next trip.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "northern england", "Title": "“good location”", "Author": "lucygemma", "ReviewID": "UR116485027", "Content": "hotel was in a great location short walk to metro and all attractions,the room was very clean ,no draw space,shower in room 441 was pretty bad no presssure and temps kept going too hot and too cold,not enough pressure to wash hair.the price we paid we thought breakfast should have been included..the swimming pool was very small and only 12 sunbeds which where taken by 9am quite disappointed with it .we did sleep well no problem with noise in all a good stay,thebeds where very hard but we slept well after a lot of walking and seeing such a beautiful city.", "Date": "August 9, 2011"}, {"Ratings": {"Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“A urban oasis in the most overcroweded street of the city”", "Author": "Xaviermartin", "ReviewID": "UR116102082", "Content": "We were surprised about finding a restaurant with an inside patio in one of the streets with the heaviest traffic and activity of the city. The service was outstanding and the food was also very good. It is not a cheap place, but we got a bonus of extra energy with the relaxing atmosphere of the place that accompanied the healthy grilled dishes we enjoyed. That helped us cope with the chaos outside the patio's door!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "", "Title": "“WORST COSTUMER SERVICE EVER”", "Author": "Lissethp", "ReviewID": "UR115631092", "Content": "Me, my husband and I stayed in Catalonia ramblas for a week and a half, when we left for the airport back to the states, the taxi driver left one of our suitcases in the hotel lobby, we didn’t realized about the suitcase till we arrived in Atlanta, from that point on i tried to get any help from the hotel to send me my suitcase, the first thing they said to me when i called them was, isn’t our responsibility to deal with it since you already checked out, from that point on,they will tell me they will find a shipping company to send it to me, but it never happened, after 2 weeks, i will call and they wouldn’t even talk to me anymore, we ended up contacting one of my husbands ex-co worker from Afghanistan that lives in Barcelona and begged him to help us out, he came to the hotel and picked up my bag.....We are still in shock on how they simply didn’t care about us, our situation and desperation to fix the problem. I WILL NEVER RECOMMEND THIS PLACE TO ANYONE!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Preston", "Title": "“AMAZING ROOM, WOULD RECOMMEND SUITE TO ANYONE.”", "Author": "jess_234_x", "ReviewID": "UR115520231", "Content": "Me and my partner stayed in this hotel for 6 nights, i booked a junior suite. From the pictures on the internet i did not have much high hopes for this and i was a little concerned. However upon our arrival, we had arrived before 2pm therefore we had to wait a couple of hours before the room was ready, but we didnt mind as we had a look around Barcelona down las ramblas. When we returned to the hotel to obtain our room keys, as promised we got them. We got the lift up to floor 5 where our room was, we were very surprised, the room was by far better than expected it was very clean, modern, comfy! The bathroom was great, the shower was massive. Our balcony with a splash pool on and lounger made our holiday it was perfect. I am not sure what any of the other rooms are like but i would definitely recommend the suites at this hotel. We did not experience any of the food at this hotel as we ate out. The was expensive however i do not feel as though i have been ripped off as we thoroughly enjoyed our stay at the hotel.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rhode Island", "Title": "“Lovely Hotel in a Central Setting”", "Author": "DaveEB310", "ReviewID": "UR115479809", "Content": "We had the opportunity to spend 2 days and nights at the HOTELES CATALONIA (Ramblas) in Barcelona during a recent trip. We stayed in the Superior Terrace Rooms. The Hotel was clean and spotless, friendly, and offered beautiful large rooms in a downtown Barcelona Central Setting. Because of its central location we were able to walk most anywhere while exploring the wonderful architecture, people, food and cafes, and historical and cultural sights of Barcelona, Spain. The Hotel is located less than a 5 minute walk to the top of Las Ramblas and a large Plaza. Additionally, there are dining and shopping experiences immediately upon exiting the hotel. The Staff is friendly and multi-lingual. I attempted to use my Spanish abilities many times, but the English is so well-spoken by staff that speaking their language is almost difficult. The Hotel offered Free Water in the Rooms, as well as more importantly, FREE WI-FI. Even the Marriott charges a crazy Euro sum for an hour up to 24 hours when you stay in their Elite part of the hotel, near the Airport. I recommend the Catalonia Ramblas highly and should I ever get back to Barcelona I know exactly where we will stay! The Showers in our room were large (but the water is HOT), and the products provided the room are ample for every need. The Toilet is separate is another closed off area making it convenient for couples or a pair sharing the room. BTW...we did use the very clean and kept pool, which is located on a terrace outside the hotel in the back (and warm due to the direct sun), just outside the inside bar. You can get drinks and food options at the pool, as well as get some access to nice lounge furniture and cooling mist sprayers. Surrounding the pool area are residential buildings and apartments really providing a taste that you're in Barcelona. I found it quite nice.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Do not stay here!”", "Author": "TravelbugSFCA2005", "ReviewID": "UR115430222", "Content": "We thought hotel had everything we wanted and we were willing to pay for a hotel that met all our needs. Well, we are paying quite high rates, in order to be close to everything, have a pool, good service, quite ... Well, here's what we got - outrageously high prices - check, good service - not at all (example: we showed up after hours of travel at 2:45 for a 2:00 check-in, room not ready for 2 more hours - zero help or accommodation), pool - check, but MUCH smaller than you expect from the photo, which was clearly taken with a distorting lens - maybe 10 Chairs fit around the pool - tiny and cold, Breakfast - ok, but NOT for 30 euro per person, quiet - NOPE - we were put in a room right off of the restaurant - we clearly stated we were coming with a 6 year old - loud until midnight and we could not open our window for safety reasons ... We were moved after the first night, which was good, but, of course a pain for us as we had to wait until the room was vacated that day and could not begin our adventures until the move.... But WORST of all ... The hotel seems to be a dorm and cafeteria for traveling student groups!!! They were up late - yelling in the halls, occupying all of the common spaces and dominating the breakfast room. We are unfortunately here for 6 nights (and will update if anything worsens or improves) - in my vast travel experience, when you book for 4+ or 5+ nights they usually offer discounts or free breakfast, etc... When I mentioned this upon arrival the staffer said 6 nights is nothing to us we have an entire group here for 22 nights and another just left - 22 nights also - huh? I queried - what kind of group is here 22 nights?? Students, he proudly told me, \"so 6 nights would not get you free breakfast\". I responded \"well, I'm sure we're paying more\". \"oh yes, much much more\"!!! Hmmmm.... Not the right thing to say to a (an over-paying) customer! Bottom line - if you want to subsidize a bunch of students and get to listen to them at night and hang with them all day stay here ... If that sounds repugnant to you, do not stay here!!!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Maynooth, Ireland", "Title": "“Beautiful hotel in a beautiful city”", "Author": "Monica0707", "ReviewID": "UR115274392", "Content": "Hotel was in a perfect location. Only about 3 mins walk to La Ramblas, close to metro and other tourist sites. Our spacious room was cleaned and toiletries topped up daily. Lovely swimming pool area for chilling and really nice spa (especially the jaccuzi). Had a ground floor room (not facing onto a street) with black out blinds so was not woken in the mornings. Also booked in advance so got a very good rate. Couldn't complain about this hotel at all.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth, WA", "Title": "“Great hotel in a great location”", "Author": "BabsPerth_WA", "ReviewID": "UR115041005", "Content": "My husband and I stayed at the Catalonia Ramblas and just loved it. We booked a Superior Room but were offered an upgrade to a Junior Suite which included buffet breakfast and late checkout for 55 euro extra. It was amazing. We had a huge, beautifully appointed room with our own sunroom, decking and pool. It was so lovely to relax after the hustle and bustle of Barcelona. The reception staff were so pleasant, the room was beautiful and was spotlessly clean and the location was perfect. We were only a short walk to all the action, close to the shops, but far enough away to be able to relax. I would highly recommend this hotel for anyone travelling to Barcelona.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Phila, PA", "Title": "“Very Nice hotel in great location...”", "Author": "luv2travel93", "ReviewID": "UR114187916", "Content": "Stayed for one night pre-cruise. About 25 minutes from the airport--we took a taxi to the hotel. I think it was 28Euros. Easy check-in. Rooms were clean, great bathrooms. Love the hardwood floors in the rooms. We had first floor rooms in the back which were very quiet. I would have liked a room on a higher floor--but we were only there for one night so it was fine. Loved the free WIFI. Nice pool/bar area between first and second floor. Included breakfast was very good. The location was perfect--1/2 block from Las Ramblas and Plaza Catalyuna. Easy Metro ride to Guell Park which is a must see! Our adult \"children\" did a \"Talking Car Tour\" on Sunday morning which they said is not to be missed. (you drive a little car around and it gives you directions and tells you about the sites you are seeing.) Overall, I was very pleased with our stay at this hotel.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Cockroach in the room”", "Author": "Namme", "ReviewID": "UR112427786", "Content": "Hotel has a great location and it was a nice place to stay although I met a cockroach in my room.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NC", "Title": "“Clean, comfortable, friendly”", "Author": "MnineM", "ReviewID": "UR110383041", "Content": "Good: Location - almost on Plaça de Catalunya. Easy walk to Metro stations, bus, la Rambla. Backside rooms are on a quiet street. Center rooms may overlook the pool deck. Desk service - very good. Prompt response to room service request (Maid forgot to re-supply shampoo and leave clean wine glasses). While waiting my turn, I though they handled 2 back-to-back rude check-ins tactfully. Bellman was always in the right place at the right time (curb pick-up/ drop, storage, and offered carts to self-service guests). Breakfast - Staff always picking-up and clearing tables promptly while serving coffee and ensuring no empty food trays. Chat with the eggs-to-order person as she is personable. Good variety of bread and pastries, mellons, juice and ham variations. Pool - raised area a few steps above a sun deck and bar. On the 1 + level, outdoors between two wings. Spa area has a good size jacuzzi with waterfall. Free wifi with good speed for large photo and video uploads. Room safe big enough for a netbook, an older type camera that looks like a film camera, and my travel gnome statue. Set your own digital number lock. Bathroom - For Europe the bathroom is hugh. Sink with counter and shelves; tub; side by side toilet and bidet; Separate stall with overhead rain shower and wand spray. Could put many people in the shower- more room than most European lifts. Warning: At check-in pay attention to your room number and its wing and level location, else the number and locations of elevators and stairways will be a maze of confusion. Bad: Rain shower stall leaked under its door. Get extra towels for the floor. If you do not put out the make-up-the-room door hanger, it may not be ready if you return for a siesta. Although there was more than one day's supply of soap and shampoo at check-in day, we had to ask for more shampoo for our last day. And, one day the glassware was not replaced. If you go only for the Barcelona beach, this is the wrong part of the city. But, if the beach is on your to-do list, you can get there by metro and walking through the pleasant and interesting Barceloneta area.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zug, Switzerland", "Title": "“will never recommend to anybody”", "Author": "solo025", "ReviewID": "UR109690807", "Content": "I will start with good points about this hotel: nice and spacious room, free Wi-Fi in the room, central location, nice outdoor swimming pool area, though swimming pool itself is very small and the view from there is on ugly buildings around. However when it comes to service, it's very very bad... we asked for urgent laundry and were promised to have our items back in 2 hours but get them at the end after 6 hours of waiting, when we tried to ask the status, reception was just telling us that people in laundry went for lunch and they can't help us. Hotel claims that it has spa however when we went there, there was a sign \"out of order\". when we asked on reception, they told us that this is a regular maintenance work, so it was just closed without any notice. In a bar they don't know how to prepare the drinks they have in a menu. Overall, it's not 4* hotel, even though they charge for that. there are much better hotels in Barcelona for the same price, i would recommend to look for another options.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“Great service, Great location”", "Author": "guysa", "ReviewID": "UR109611081", "Content": "We stayed 4 days and 3 nights in barcelona. From the very begining the staf was very helpful and made sure we get by. The room was very clean and big enough (the closet was not that big though). We didn't have a chance to test the pool but some couples that we met there seemed to enjoy it very much. Free Wifi in the room and lobby was very helpful. breakfest was fine , not enough vegtibles, but great orange juice.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“Great location, close to everything while far enough away to be quiet”", "Author": "EuroTrip2011", "ReviewID": "UR109556194", "Content": "Great hotel, loved the pool - great way to cool off at the end of the day. We were upgraded and had fabulous rooms with a private patio. The staff were great. The breakfast in the hotel was very expensive, internet was not free - my only two complaints.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“Just a great hotel”", "Author": "beejerusa", "ReviewID": "UR106921842", "Content": "Location, Location and Location We had a big room, a wonderful bathroom, the cleaning service was great. The staff is helpful and kind", "Date": "May 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Issaquah, Washington", "Title": "“Perfect hotel in Barcelona”", "Author": "Jarve-05", "ReviewID": "UR103952561", "Content": "We didn't originally book here; were upgraded upon arriving at Catalonia Plaza Cataluna due to their own overbooking. It was a pleasant surprise to be switched to such a terrific hotel. A very convenient location for walking to most of the major sights. The room itself was spacious, wonderfully decorated, comfortable, and quiet. Would definitely recommend to anyone.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Perfect location, lovely hotel!”", "Author": "Monkey080 Posted by an OctopusTravel traveler", "ReviewID": "UR102181756", "Content": "Wanted a modern hotel with spa and found most places expensive for just a weekend break. This hotel was worth the money, very modern, clean, with nice helpful staff. The spa was lovely, with everything you need after a day of site seeing. The rooms were very spacious and although the beds were pushed together, they weren't two singles, more like two doubles together. Breakfast had every option available. I'd say 5* hotel definitely. The location was perfect, right near Las Ramblas and two metros, also a short walk from the airport bus stop. I found that Octopus was the cheapest website for prices and we got breakfast included for a cheaper price than other sites. Very happy.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Catalonia Ramblas Hotel is One Of A Kind! The best Hotel in Barcelona!”", "Author": "abenishay1", "ReviewID": "UR101718747", "Content": "My wife and i stayed in the Catalonia Ramblas Hotel on the 13-17.03.11 and we were celebrate my wife 30 Birthday... The Catalonia Ramblas is in on word - Perfect!!! the Hotel Located on the Center of Barcelona (just 2 minutes by walking to the Placa Catalonia and the Ramblas Avenue). the hotel is look very nice out door and specially in door. the room is big, nice, warm, cozy, modern design with everything you need! the Breakfast was excellent with a very friendly staff! The most important thing on the Catalonia Ramblas Hotel and what makes him \"One of a kind\" is the amazing and friendly staff of the Hotel in generall!!! the staff at the the Reception (Mr.Joel, Ms.Laetitia, Ms.Anna and Mr.Markus) are very very friendly, warm people, they are smile all the time and allways want to help and assist you any way they can: Recommands for a good Resturants, Sites to visit, Flamenko Show, Pubs, Bars, Train / Metro time table, problem with the room or any other issue the guest may have... they are wonderfull people who smile all the time, they are most welcoming the guests and they give you the best feeling that you can get in order to make your stay plesent and fun as much as they can!!! For us they were amazing and they made our stay at the Hotel and the Vacation in Barcelona - Perfect!!! we will defenately will be back this Hotel again... However, I most to mentioned specially one of the Reception staff which was above evry one else - Mr.Joel Sanchez!!! From the very begining (before we even got to the Barcelona) Mr.Joel assist me in every way that he just could... He helped me to find and choose a very unique and good Resturant to celebarate my wife 30's Birthday and than he made the reservation for me at the resturant and he was very patient during all the prosess! when we were allready in the Hotel, Joel was magnificent and he assist us on evrything we wanted: the room, recommandations for a Resturants, Bars, Pubs, Site's to Visit, Train time table and many many other things! i can say now that Joel make our staying in Barcelona much much easier and plesent! Joel have a good heart, he is a very good person, patient, smart guy and trully want to help and assist you on every way that he can...For us - Joel is the Best Reception man / Hotel Staff that we have ever saw all over the world!!! We can only wish to our self in the future to bump into with many more Hotel Staff such as Mr.Joel Sanchez!!! Thank you Joel for all and for every thing you have done for us, you was unbelievable and amazing!!! We recommand on the Catalonia Ramblas Hotel in Barcelona with all of our heart - it is in 100% the best Hotel in Barcelona, just Perfect!!! The Catalonia Ramblas Hotel is definitely One Of A Kind!!! Bravo... Ami & Lilach Ben-Ishay.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, UK", "Title": "“Excellent location”", "Author": "bornsenile", "ReviewID": "UR99890806", "Content": "We paid a premium for the location for a short visit to Barcelona after their football world cup victory. As Gaudi fans on a tight timeline, we were happy with our choice as we go to see all the sights we had planned. The staff spoke good english and gave us some great tips on finding vegetarian food for my wife (always difficult in europe). The rooms were large and comfortable. Highly recommended.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rishon LeZiyyon, Israel", "Title": "“IT'S WONDERFULֱֱֱ”", "Author": "Natasha64", "ReviewID": "UR99147133", "Content": "We stayed at catalonia ramblas for 4 nights. The decor is modern and nice. The rooms are big and comfortable(the matress is too tough)with kettle,refregerator,safe and free WIFI. But above all: the location is just perfect- we seldom used the metro-we got everywhwere by foot or taxi. You are always in center of town and things to do, just getting out of the front door. The staff are helpful.We enjoyed it-I bet you will too.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“The hotel surprised positively in every parameter!”", "Author": "intertk", "ReviewID": "UR97627031", "Content": "My sister and I visited in Barcelona for 4 nights during 6-10/2/2011 with my sister's baby girl (5 months). We didn't know any hotel in that great city, so we made some \"homework\" by the intertnet and decided to go for Catalonia Ramblas, with hope that we chose well. The staff at the front desk were lovely, nice and really helpful. The room was pretty big and roomy. We asked for a baby cot in the room, and still we had enough space for us to fill free to move around... We asked for a quiet room and we got one that faces to the pool, and it did was very quiet and cozy. The two beds were wide and comfortable, and the kettle with the coffee/tea corner and the minibar were useful for us (we eat only Kosher food, so we needed it to storage our own food). The bathroom also was really big with tub and shower as well, large sink and even a little stool (for what? :)). The greatest thing about the bathroom is that it has it own entrance from the little corridor, and not directly from the room itself. We enjoyed the free WiFi as well. And the last-but-important thing: the location is fantastic!!! 2 minutes walking and you're in the center - Placa Catalonia and the Las Ramblas. We didn't try the breakfast or the spa, so we can't express an opinion about them. The bottom line: Catalonia Ramblas was the best choice we could have made!!!", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ringwood, United Kingdom", "Title": "“great staff, great location, shame about the internet”", "Author": "tonytone1", "ReviewID": "UR97061801", "Content": "4 nights on business for the Mobile Wrold Congress. Definately the most friendly and helpful staff of any hotel in Barcelona I've stayed in. Location very central and convenience for the Fira (3 stops on the metro) and Gaudi's catherdral (4 stops). Breakfasts were excellent too. Rooms lacked draw space (business hotel for 1-2 nights perhaps)? No ability to borrow/use an iron, only an ironing service which is no use when on a business trip. Biggest bug bear was the flakey internet service - essential for a business traveller. Oveall would still give this hotel 4 out of 5. Prices were sky high bur so are all hotels in Barcelona for this particular week.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great Hotel”", "Author": "AaronMandel", "ReviewID": "UR92348956", "Content": "This is a lovely hotel. The rooms are large and very comfortable. The location is just a few blocks off the Ramblas in one direction and several Gaudi buildings in another. The staff is outstanding, speak English and could not have been better. The restaurants are very good.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Angers, France", "Title": "“The BEST thing about Barcelona!”", "Author": "sralala", "ReviewID": "UR92135811", "Content": "I recently stayed in a Double Superior room at this wonderful hotel in Barcelona, and was truly impressed by the quality of the hotel and its superb personnel. From the moment we arrived, the staff made sure our stay was perfect. There were always at least one or two attendants at the front desk who spoke perfect English. The room was gigantic by European standards, and the difference in price between a standard Double and the Double Superior was nominal, and well worth it. The bathroom was huge, with a luxurious shower. The hotel's free wifi access was easy to use and worked very well. The location was absolutely perfect - surrounded by plenty of shops, restaurants and access points for the Metro, and yet just far enough (around the corner, literally a 2 minute walk) from Las Ramblas that we felt completely safe and secluded from the chaos. Every employee, from the front desk staff to the bartenders to the room service attendants to the housekeepers, was incredibly friendly and helpful. This hotel far exceeded my expectations for our stay, and I highly recommend it!", "Date": "January 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Darwin, Australia", "Title": "“A pleasant stay overall”", "Author": "Astroboy2011", "ReviewID": "UR91713148", "Content": "I use this site a lot and thought it was about time I posted something to help other travellers make decisions. My friend and I have been travelling Europe for 6 weeks and have been staying in many hotels. To be honest, this was a last minute booking - like when we arrived at the airport in Barcelona. I booked it online and we got the shuttle bus from the airport to Placa de Catalunya. The hotel is about 100 meteres from the bus stop and literally around the corner from Las Ramblas. I was suffering from a seriously bad man flu and was in no mood to be fussing around. Thankfully, we arrived and apart from the receptionist taking his time to get to us it was all plain sailing. The hotel was a bit cold, I tried to increase the heating by raising the thermostat, but it didn't seem to work. The bed was like sleeping on a rock. It was so hard I thought I would have pressure sores when I woke up. The decor was relatively new and tasteful (marble and wood). The room was small, but then again we managed without a problem and so I would say it was adequate. This is not a new building either and one should consider that older hotels, although renovated, generally tend to have smaller room sizes. I think we got value for money and the location is excellent. I would definitely recommend this place to a mate. Go for it!", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“the most friendly staff and best services ever”", "Author": "minty77", "ReviewID": "UR91500833", "Content": "I stayed at this hotel around october 2010. The people at the hotel were so friendly and the location is perfect near everything walking distance. They recommended excellent restaurant which was so greatly priced and awesome food. The room was super clean and the best of all, the staff were so friendly and the service was great. Everything was great about this hotel and I would recommend this hotel to anybody. One of the best hotels I stayed in barcelona. I stayed in hotel soho about a year ago and this hotel is far better than that hotel and the people make the whole difference. I loved our stay at this hotel. It is quite in the rooms and everything was perfect. They also give free wifi which I found very convenient. I would definitely stay at this hotel again.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great hotel and location”", "Author": "Cath-7", "ReviewID": "UR89174468", "Content": "What an ideal place to stay! Journey from Girona airport by bus to city centre was very easy...follow the crowd upstairs to taxi rank and trip to hotel cost about 10 euros...well worth it when arriving at night. Step out of the hotel, turn right, walk about 50 metres and you are at the top of Las Ramblas... with the metro and tour buses so close by you could not be staying anywhere more central! Metro is also very easy to use...air-conditioned and clean. The hotel and rooms were very comfortable and having a kettle to make tea and coffee was super! At night it was so quiet it was hard to believe we were only round the corner from Las Ramblas but you could not hear a thing! My husband and I celebrated our Silver Weddding Anniversary at the beginning of our stay and although I had mentioned it to the hotel before our arrival we were not expecting to be given a magnificent roof top terrace room for our special night. It was a lovely surprise! We would love to come back to Barcelona again and would definitely return to this hotel. Edgar at the reception desk was always happy to help with any questions or requests which made our stay even more enjoyable.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cork", "Title": "“poor service”", "Author": "girl014", "ReviewID": "UR86642839", "Content": "while this hotel is located in a great spot close to La Rambla, i was very disappointed with our stay there. the service of the staff from front desk was poor and they were in no way warm and welcoming. our credit card ended up being charged twice for out stay at the hotel. i have contacted them on numerous occasions and still no solution to our problem. i could not recommend this hotel to anyone.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Good Hotel in a great location”", "Author": "mijw", "ReviewID": "UR86533155", "Content": "We stayed in the Catalonia Ramblas from 3rd Nov to 6th Nov. This is a good hotel in a great location only a short walk to the famous Las Ramblas & the lively Placa de Catalunya. We had a double room which was spacious & comfortable. We also had a pool view. The breakfast was excellent. All staff were efficient & helpful. The only complaint we could make was that we could not open the bedroom window,however the air conditioning was good. Would have no hesitation in recommending this hotel.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kauai, Hawaii", "Title": "“GREAT location...maybe just a bit pricey”", "Author": "rbrb2010", "ReviewID": "UR86197235", "Content": "My husband and I spent 3 nights at the Catalonia Ramblas and we LOVED it! We upgraded to a superior room which had a small private balcony that we used A LOT. It was a bit expensive though. However, if you can afford it I would recommend the upgrade. The location was superb! Starbucks was right across the street and Ramblas was only a short and safe walk from the hotel. The train station was just down the block. One thing that we were disappointed in was that the hotel offered free wifi but we were unbale to log-on to thier system. Thank goodness for Starbucks across the street that had free wifi and we had no problem logging on there. The hotel also had a business center (2 computers and one printer). The printer was out-of-order the entire time we were there and you had to pay to use the outdated computers. So again, we were thankful for Starbucks right across the street. The rooms were spotless! We loved the wood floors and the shower was exceptionally large for European standards! It was very quiet and the bed was very comfortable. The staff was very helpful and spoke excellent english which was a blessing for us. They were most definitely professional in every sense of the word but just seemed to lack that \"personal\" feeling. However those were small things and if we ever go back to Barcelona (which I hope we do) we will save our $$ and stay at this hotel again.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great location and very good hotel, perhaps a bit expensive.”", "Author": "gilevi74", "ReviewID": "UR83283871", "Content": "My wife and I stayed at the hotel for 4 nights during the end of September until the beginning of October 2010. We enjoyed our stay at the hotel very much. The weather was great so the pool had sunbathers every day. We got in to Barcelona at 6:30AM and arrived at the hotel at 7AM, and the staff were very pleasant and allowed us to check in to the room at the early morning since the room was available, without any extra charge. We did not eat breakfast at the hotel, and at this great location we preferred to eat out as the food in Barcelona is great and we don't typically appreciate hotel food. The bed was enormous and springy. The bathroom and shower were large and very pleasant. The room was clean and the furniture comfortable. The hotel Wi-Fi was available free all over the hotel area, although you need to accept the terms of the service through the browser and put in the user and password every time you connect, which is not that convenient for the mobile phones - but as long as it is free we could hardly complain. The only flaw in the room was that the TV was very small. We paid ~230 Euro per night, mainly because the weekend prices were ~300 Euro per night, and this was excluding breakfast. As we wanted a great location and a 4 star hotel we were willing to pay the price and we enjoyed it very much. If you want a 4 star hotel at a great location this is the hotel for you. Gil", "Date": "October 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scarsdale", "Title": "“Fair To Midlin”", "Author": "Edgemont2", "ReviewID": "UR82247062", "Content": "Located on a busy street leading to Placa Catalunya, this hotel does an adequate job of shelter but no more. While the hotel room was acceptable and the bathroom was more than acceptable, the room lacked storage space, a waste basket and there were no tissues in the room. The desk staff was professional but lacked the warmth that better hotels foster. The exercise room consisted of a non-functioning treadmill and two stationary bikes. Two metro stations were within a two block radius and the Ramblas (for better or worse) was also two blocks away. Having stayed on this vacation in comparably priced first rate hotels in Madrid and Lisbon this hotel did not compare. While the hotel had free wi-fi, the business center computers were not free.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv & Ridgewood, NJ", "Title": "“Almost Perfect”", "Author": "ReichenbachManor", "ReviewID": "UR82144304", "Content": "Just returned from our first visit to beautiful Barcelona. The Catalonia Ramblas was a lovely hotel - well appointed, very clean and modern rooms. We stayed in a standard double room on the ground floor. I was pleasantly surprised by the fantastic shower, general cleanliness and size of the room. Not a drop of noise was heard from the street below, so quiet was the room. The bed was a king, but I must admit was terribly uncomfortable - hard as a rock. The only other fault I found with the room was the blanket - one of those uncovered, fuzzy, never-washed kinds. But I certainly would return to the hotel, and even request the same room. Breakfast was perfectly adequate with eggs cooked to order, and lot of fresh squeezed juice. My husband and I both visited the spa - I was disappointed to discover that both wet and dry saunas were \"broken,\" but got a lovely massage. Location is perfect - central, right next to the metro, within walking distance to the Gothic Quarter, the boqueria market, and the super-touristy Ramblas (avoid). I heartily recommend the Catalonia Ramblas.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "brooklyn NY", "Title": "“OK, just not for us”", "Author": "bklynbiker", "ReviewID": "UR81623665", "Content": "We were sent here by a sister property, which we had chosen with great care and research only to arrive and be told we had been 'rebooked.' They took pains to point out this property was a 4-star hotel. Needless to say we got one of their worst rooms, a low floor, no view, dark, and small (I checked the floor's room plan on the door..). It's a large, fairly impersonal hotel on a VERY busy city street, packed with roving youths, shoppers, workers and tourists. Just what we DIDN'T want. Worse, no in room filter coffee (instant only -- INSTANT?), NO place to store clothes apart from a closet with hangers (no wardrobe , dresser etc, or even shelves. Huh?), no iron (not an issue but this is supposed to be a 4-star). And the sad instant coffee wasn't even replenished after our first night. The pool /deck area was nice, the common areas OK but again, crowded with tourists and businesspeople attending conferences etc. Everyone raves about the location. If you want to be literally ON a busy thoroughfare, instead of a quiet street 'near' the central sites, then maybe it would be for you.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berikon", "Title": "“very peaceful stay”", "Author": "fidelina55", "ReviewID": "UR80437103", "Content": "We were at this hotel for a long weekend with our kids and had a great time. The location is amazing. In Barcelona parking is a hussle so if you are right in the center of the city is easier with kids to take the tram or walk a bit. The stuff was very friendly and everybody seems to love kids. You are very close to most of the tourist atractions from this point.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“No better hotel in Barcelona. Amazing!!”", "Author": "Matt89898", "ReviewID": "UR79148847", "Content": "For price, location, size of room, cleanliness you can't get any better. The location is superb right of the main street. The room was huge with a bathroom double the size of most bathrooms and all black and white marble. The pool at the hotel was great and the staff we so helpful with finding a restaurant and tourist information. Very helpful with storing bags and other queries. Very difficult to review as it was faultless. Amazing stay and super hotel.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Good Location”", "Author": "marcolet", "ReviewID": "UR77821146", "Content": "Just back from a 4 night stay in the Catalonia Ramblas hotel. Hotel is in a great location - just off Playa Catalyuna. Two metro station close by which gave easy access to all the sights. Room was a double room on the third floor - we had a balcony overlooking a side street which was nice and made the room more spacious. Spacious bathroom with separate shower and bath. Room a little \"tired\" but fine - flat screen tv, mini bar, tea and coffee making facilities. Breakfast was in the basement - room itself would not encourage you to hang around for too long. Breakfast was fine - fruit, juices, bread, some hot food and eggs done on request, yogurt - we were just after spending a few days elsewhere and had been spoiled with breakfast choice so maybe not fair to compare! Pool area was small but we always manager to get a lounger - there are only about 12/14. Pool is not really for swimming but is nice to cool off in - about 1 metre deep. Taxi from hotel to airport was €25. Hotel could not give a late check out but they kept our bags and allowed us to use the showers in the spa area. Hotel is not luxurious but it is fine and great location. The pool is also a great advantage and the fact we had a room with balcony. Plenty little bars around the hotel and places to eat. Just off reception computers available for internet use - coin operated - minimum use €2 Overall enjoyed our stay", "Date": "September 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reykjavik, Iceland", "Title": "“Two thumbs up!”", "Author": "Ice-traveller75", "ReviewID": "UR77816596", "Content": "I stayed at the Hotel Catalonia Ramblas for one week at the end of July 2010 with my family. This was actually my second time at the hotel in three years, since I also stayed there at the end of September 2008. To get straight to the point, I give this hotel two thumbs up! It is perfectly located (just a couple of minutes walk to the Catalonia Square and the Ramblas), it provides good service to its guest’s, the hotel has a small swimming pool and a sitting area in its backyard, the staff is helpful and friendly and cleanliness is in general good. Of course you can always find some minor items to criticise but in my case they might include items like that the area around the lobby bars need repainting and a handrail from the bar area to the first floors needs to be fastened. I will definitely stay at the hotel the next time I’m in Barcelona.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "iran", "Title": "“bad service!”", "Author": "feribeh", "ReviewID": "UR76504334", "Content": "the hotel is old, and the room facilities aren't good such as refrigerator,hair dryer, etc., but the room is spacious and clean. towels and sheets are old, there are not enough towels in the room, and the price of breakfast is unreasonable. after all the hotel actually doesn't look like a 4star hotel. although the location is very nice and good for shopping.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Fanstastic Hotel in Ideal Location!!”", "Author": "Matt022", "ReviewID": "UR75742783", "Content": "Having been to Barcelona twice before having stayed in the Duques de Bergara and Petit Palace Opera Gardens, this hotel is by far the best hotel that we have stayed in! It is very modern, spotlessly clean with staff that are very friendly and attentive! The location is perfect for all attractions with it be situated just north of the Ramblas and Catalunya Placa where the nearest metro station is. The rooms are excellent in size having booked a superior room with an excellent pool and sun bathing area also. Wouls highly recommend to anyone visiting Barcelona!", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Marino, CA", "Title": "“Convenient Hotel in the Las Ramblas Area”", "Author": "Tigerrose88", "ReviewID": "UR75191745", "Content": "This hotel is in a convenient location, short walk from Plaza Catalonia. Front desk staff friendly and helpful, gives you advise to be careful of the area since it is in the busy Las Ramblas area. Breakfast buffet good as well as the hotel restaurant downstairs. Hotel is clean and well maintained.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic location, friendly and helpful staff!”", "Author": "Kat Cruz", "ReviewID": "UR74105270", "Content": "Stayed for a few days in this hotel and found in fantastic. Great location, just off Placa Catalunya where the Aerobus (shuttle bus 5.05 euros) drops/picks up. Convenient for metro, although we had nice walks to Barceloneta beach, Las Ramblas and Gothic Quarter, restaurants, supermarkets etc. Stayed in room 338 which overlooked the street behind, wasn't too noisy, felt like a local. Room was spacious and clean. Bathroom was big for European standards, had bathtub and separate walk-in shower. Free wi-fi was a little slow, mini-bar, safe, reliable air conditioning, room cleaned everyday! The pool was an OK size, but perhaps needed a few more sun loungers. Check out is mid-day and as we were leaving late afternoon we were able to use their shower facilities in the spa. Would definitely return!!", "Date": "August 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Almaty, Kazakhstan", "Title": "“Belissimo!”", "Author": "Dilorom", "ReviewID": "UR70372278", "Content": "Very good hotel, especially location, it is really close to the main place in Barcelona - the street La Rambla, also it is easy to get to all parts of the city. We have enjoyed the trip and the service that hotel has provided for us, the most welcome person is receptionist Tamara, who is friendly and very polite. Highly reccommend this hotel.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Astana, Kazakhstan", "Title": "“Very good hotel :)”", "Author": "Toshenka", "ReviewID": "UR69890246", "Content": "Very nice service, especially receptionist Lady Tamara, she is very nice person, very helpful and friendly :) Location of hotel is perfect! and if you have some little misunderstandings, she will help you to solve them :)", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt am Main", "Title": "“Excellent hotel in the centre of Barcelona”", "Author": "oberone", "ReviewID": "UR69726756", "Content": "This hotel exceeded all our expectations. It is ideally located in Barcelona for exploring the city, with excellent links to public transport also. The hotel is very modern and clean with very large rooms (perfect for our small family). The staff were very friendly, helpful and multilingual. The pool area of the hotel, although small, was very nice. Dining facilities were also very good, with an excellent breakfast buffet and decent room service menu. The hotel also featured free WiFi access throughout (although I did not test it).", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Very good Location & good size rooms”", "Author": "Sheenab77", "ReviewID": "UR68293427", "Content": "Very good location & very convenient. We stayed there for 4 nights. The room was very good & large in size, not crammed like a regular europe room. The breakfast was a bit boring. Not too much variety, but ok to go with. The staff was very courteous & thank god they were english speaking.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Moderately Priced Gloom in a Great Location”", "Author": "Hampstead_Heath", "ReviewID": "UR63088579", "Content": "You might love or hate this hotel. It's located right in the midst of the tourist buzz of La Ramblas and Catalunya Square. It's fairly expensive but only half the price of top places like Casa Fuster and Hotel Arts. Its decor might be described as Soviet Style with a mixture of real and fake wood wherever you look. This gives a very depressing effect. The two restaurants are gloomier than a student canteen. The staff are reasonably friendly but seem depressed and unmotivated. Maybe the decor's got to them too. The breakfast was mediocre with cheap coffee. For our first day's breakfast they had a range of smoothies and one could also have smoothies made to order. The smoothies weren't offered on the three other days we were there though. There's an excellent bakery where you can get high quality, cheap filled baguettes, pastries, etc. just out the back of the hotel. There's also a decent Chinese supermarket for water, beer, etc. at the back of the hotel. Our bed was big and very comfortable. The air conditioning in one part of our suite worked excellently. In the other part its emitted such an awful noise that we had to turn it off. The shower was excellent. There was no bath though. The internet PCs were coin operated and kept going wrong. A real mixed bag.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“excellent hotel, location, staff, rooms, cleanliness and food 1st class”", "Author": "chocolatekiwiIreland", "ReviewID": "UR60090130", "Content": "a very pleasant stay thanks to the staff at the catalonia ramblas barcelona. the rooms were clean and big with modern decor. staff were friendly and had good english. breakfast buffet was a good start to the day. the location is within walking distance to most tourist areas. buses at catalonia square just around the corner. shops on same street. all round i would recommend and hope to stay again. thanks, murphys, ireland.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Southampton", "Title": "“Need to raise their game!”", "Author": "dg1036", "ReviewID": "UR56404511", "Content": "I payed 610 Euros to spend three days and nights at this hotel, but was completely disappointed. Although I was in Barcelona for work, I took my Girlfriend along and specifically chose this hotel for its spa and gym. Problems were. Limited opening times for the spa and when it was open, only half of it was working (No Jacuzzi). The Gym is a joke, despite the website, it is really a box room with a few pieces of old equipment. Oh well live and learn, but however--- Our room was small for the price (no balcony despite being promised) outdated decor with sliding doors (that jammed and covererd the tv) to store clothes. Smelly toilet and shower. Window that was difficult to open. Basic TV channels. The bar is nice with comfy seats, but expect to pay nearly 10 Euros for a gin and tonic. A bit overpriced really. The layout of the hotel is bizarre with a strange, exaggerated stroll down to the restaurant for breakfast. I payed in advance for breakfast, but wish I hadn't. A fair selection of food, but the hot food was limited and not very hot at all. The staff were friendly enough when need be, but coffee was to airline standard only I'm afraid! Over all cleanliness is limited (example of which, were the same crumbs were on the bar furniture from the night before). It took me a couple of days to work out, but this hotel is really only interested in big groups of people or large business conventions. We discovered that the more people checked into the hotel, the better the service overall. Things started to appear that were not there at the weekend like chocolates on the bed at night, fruit and water by the lifts, freshly made milkshakes at breakfast. All very nice, but too little too late. To top it all we asked the male receptionist for a nice area to walk and get somewhere to eat that evening. Took us through a very ethnic part of town. Girlfriend got her handbag snatched! (although this is very common, we have since found out, so be careful) Wrong info given me thinks! A different receptionist booked us a taxi for the airport, but expect the Taxi driver to charge an extra 10-12 euros for this privilege. The meter was already up to 6 euros before we got in and it magically ramped up another 6 when we arrived at the airport. He seemed to know all the staff at reception so this must be the accepted price at the hotel?? I would not recommend this hotel for value for money. If I had payed half the price I would still feel let down and disappointed. This is not a four star hotel!! Couples beware!", "Date": "February 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent hotel in great location”", "Author": "Lainey20Blue", "ReviewID": "UR56108236", "Content": "We spent a weekend in this hotel this February. The hotel is lovely and it is in an excellent location, just off Placa Catalunya within a 5 minute walk of the stop for the airport bus. We stayed in room 101 and it is a very large room with a terrace. The only slightly negative thing I would say is that the breakfast at Eur15 is overpriced.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Prague", "Title": "“simply perfect”", "Author": "elsal06", "ReviewID": "UR54479458", "Content": "Really really nice hotel... The rooms were really big. I was there with my colleagues and all the rooms were large... we liked the spa (it is even free of charge). The wi-fi is free as well but it works really slow. Breakfast was ok.. the best deal about this hotel are the staff people.. They are friendly and always able to help. The hotel itself has good position it is just few steps from the Ramblas and the underground at Pl. Catalunya and Pl. Universitad.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Amsterdam", "Title": "“Great location but some issues which need addressing”", "Author": "Beansley", "ReviewID": "UR54077539", "Content": "I have stayed at this hotel 3 times now for business. We choose this hotel for the excellent location and also for the layout, which is great for the small event we hold there. The hotel is very modern and is in a great location for the Ramblas and shopping areas. However this year I found the cleanliness quite poor. My tea and coffee service in the room was not cleared one day, and the tea, coffee and milk were not replenished. Also, I ordered room service one evening and the dirty plates etc were still standing outside of my room for the whole day and evening the next day (even though the cleaners had visited). I have to say the laundry service was very good though. It was great to know that we had free WiFi, however the service was terrible. We really needed internet access so it was very frustrating when we could not connect, even in the meeting rooms of the hotel. The hotel does have a \"business centre\" but it only has 2 pcs and a printer. One of the computers was not working during our stay, and also you have to pay to use these machines (minimum of €2 for 10 minutes). The breakfast buffet in the restaurant is very good and the food we had for lunch and dinner was pleasant, however we had a coupls of dietary requirements within our group which the hotel had difficulty in dealing with. The vegetarian alternatives were not good, even though we had informed the hotels days in advance that we had these requirements. I did notice someone else had mentioned the soap was not changed each day, and for me this is a good thing. I find it most annoying when hotels feel they have to give me a new bar of soap everyday as this is just a waste. I commend this hotel for not changing the soap everyday. All in all a pleasant hotel, but it needs to improve it's internet services / business centre if it wants to continue to attract business travellers. Also, cleaning and F&B service standards need to be raised.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "SP", "Title": "“great hotel, great location”", "Author": "MariannePG", "ReviewID": "UR52470040", "Content": "the fotos on this site are the real deal: it is a great hotel in a very nice location. About the price, i wouldn´t say it is the best, although it is fair.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Good hotel- excelent location”", "Author": "LondonBlackcat", "ReviewID": "UR50234013", "Content": "While visiting in Barcelona, we stayed in Catalonia Ramblas for 5 nights. Overall it was a pleasant experience. The room was very spacious and beautiful. The bed was comfy. It was also nice to have a small kettle and variety of teas. The staff was quite helpful and friendly with the exception of the night duty receptionist who was not very polite. In the fist night smoke alarms went off 3-4 times and it was disturbing, the night receptionist told us it was not the hotels fault, but guests' who smoke in the rooms and offered no help. Also the soaps were not renewed completely every day, but on some of the days. However excluding these minor details, it was lovely. The breakfasts were very good. Also the location as very comfortable and great both the public transport likns and for exploring the city by foot. We had a good stay and wouldn't hesitate to recommend the hotel", "Date": "November 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Amazing Hotel”", "Author": "bailyhowth", "ReviewID": "UR48358960", "Content": "This was a beautiful Hotel - stayed 2 nights at the end of March 2009. Got very good deal through 1800hotels.ie Hotel is just off Plaza de Catalunya so in a brillant location. Very comfortable hotel with beautiful tce and swimming pool area - would like to enjoy its facilities in the summer. Rooms were o/s - very very large and the bathroom was super. Staff were very helpful especially when we purchased some of their jewellery which was on display / sale...great idea for those who are only on short break and do not have time to shop for pressie for the GIRL.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "lenaman", "Title": "“Excellent hotel-great location”", "Author": "lenaman", "ReviewID": "UR48305668", "Content": "We stayed in the Catalonia Ramblas from 28/10 to 1/1/2009. Our stay in this hotel was really pleasant. The location is perfect, the staff very friendly and helpful, the rooms spacious, clean and comfortable, the breakfast a delight. I have only good things to say about this hotel. I would definately stay there again. If you can choose, ask for rooms 312, 313 or 314.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leicester", "Title": "“High quality, fair rate”", "Author": "Alec_Satow", "ReviewID": "UR48096500", "Content": "We arrived in Barcelona without a reservation. Following in my GPS the center direction I found myself in front of Hotel Catalunya Ramblas. I ask a room, they show me 2 rooms, I choose the best after a light negotiation about the price... The reception staff is very helpful, friendly... The hall is very roomy with a very cool design, up-to-date but not cold. The room is excellent, with a view on the pool! We didn't have breakfast, but I suppose it should be great!!!!", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Great hotel in the great city”", "Author": "LeeBr", "ReviewID": "UR47504327", "Content": "Great location (just 2 min walk from the Ramblas and 1 min from Cataluniya Plaza and the metro station), large and very nice room, huge bathroom, cofee/tee kit, mini bar, free safe, great breakfast, great team and service. Ask for the rooms from 1st flour and hyer (there are rooms also on the ground flour). Very nice SPA and a good restaurant. Free WiFi all over the hotel. Have a great stay in this great city!", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Netherlands", "Title": "“We made the good choice !!!”", "Author": "DutchTravelagent", "ReviewID": "UR45492887", "Content": "I was in Barcelona last weekend with a group of 150 people. Check-in was very smooth and quick, staff was very helpful, nice rooms, having a pool in central Barcelona was nice, breakfast was excellent.....there is just 1 thing that i found a tiny bit negative and that was bar prices. A beer for € 5,20 is plain expensive. But there were a few mini-supermarkets around, so... Great place to stay, excellent location.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Fantastic hotel as usual”", "Author": "Healthtravel", "ReviewID": "UR44876878", "Content": "If you are looking for a great hotel for business or leisure in Barcelona this is the one for you. The location is perfect, the rooms are well appointed and the service is extremely good. I use this hotel frequently and will continue to do so.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Somerset", "Title": "“Great Hotel in a great city”", "Author": "Logchopper", "ReviewID": "UR41678053", "Content": "Excellant location just off the Ramblas, close to two Metro stations and major bus routes. Good sized modern room in a well modernised hotel with plenty of comfortable spaces. Excellant outside terrance area with loungers and other furniture, small but excellant pool. Kettle tea, coffee in the room - not so easy to get your supplies replenished.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "surrey", "Title": "“thoroughly recommend”", "Author": "SurreyJune", "ReviewID": "UR40279101", "Content": "hotel is spacious and friendly. Stayed for long weekend and have nothing bad to say about it. Rooms were clean and well stocked, breakfast extensive to suit all tastes in a large and spacious dining room. not enough time to try the pool or spa but maybe next time, as i am sure there will be a next time. Perfectly placed for walking to Ramblas nightlight and ballet -and the square to catch a tour bus around the city. No need for taxis, is all on the doorstep. Walk through medieval city to marina and beach for fab restaurants.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "ireland", "Title": "“Excellent hotels for couples”", "Author": "barne99", "ReviewID": "UR38993365", "Content": "My wife and i spent 4 wondefull days in barcelona during august 2009. We stayed at the catalonia ramblas hotel wuich we found excellnt for many reasons. for more details use the: http://sites.google.com/site/barcelonatoursite/", "Date": "August 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Antrim, N Ireland", "Title": "“Clean, friendly staff & fantastic value”", "Author": "Trottersbar", "ReviewID": "UR38175400", "Content": "This was my first time in Barcelona & I was gobsmacked by the whole experience. This was in no small ways contributed to by the Hotel Catalonia Ramblas. A 30mins bus ride (4.25 euros) from the airport and a 150m walk and we were at the hotel. Situated just off the La Ramlas (about 150m from Plaza de Catalonia) this hotel is situated in an excellent location. We arrived at 11am, well before check in time, but were able get into our room immediately. The staff were fantastic, friendly and their English was perfect. The room we booked was a \"standard\" and were not expecting it to be anything like what we got. It was spacious and clean, with a mini bar that was not a total rip-off. The ensuite was again very spacious with a massive shower room. We did not have a view or a balcony, but when you are in Barcelona there is no time to be wasted looking out the window or sitting on a balcony, so we did not have a problem with this. The breakfast was as good, if not better, than any hotel I have ever stayed in. A great selection of fruits, cakes, hams, cheese, cereals etc.. as well as a hot breakfast of eggs, bacon, sausages, hash browns & toast. The hotel bar & the terrace bar were everything you needed. The swimming pool and terrace were heaven sent after a days sightseeing in 36C heat. We ate in the hotel restaurant (Pelai Restaurant) one night and it was beautiful and not too expensive. All in all this hotel is first class and I would recommend it to anyone.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Jersey", "Title": "“Great hotel and location!”", "Author": "zia8", "ReviewID": "UR38059821", "Content": "We recently spent 3 nights at Catalonia Ramblas, and we were very impressed. In fact, we thought the hotel was much nicer than the website made it look! The rooms were huge, the shower was amazing, and our room overlooked the pool. The pool was small but very refreshing and towels were provided!! The beds were a little hard, and that is the only negative thing I can say about the hotel. The breakfast was good as well, and had quite a few hot and cold choices. We found the staff to be very friendly and spoke English very well. Only about a block away from Ramblas, which was so fun and entertaining, always something going on there. Metro is only about a block away as well which was great and a cheaper way to get us to the train station for our next destination. Overall, a great stay!", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "North of Ireland", "Title": "“great hotel location and staff”", "Author": "practicaltourist", "ReviewID": "UR37861428", "Content": "This hotel was great with very helpful pleasant staff who all spoke english and helped us in any way they could. The service was very good the rooms are modern spacious and very clean. The breakfast is great with good variety and hot food available. The hotel is in a great location off the Ramblas and near metro and the airport bus stop 300 metres. The bus T1 or T2 costs 4 euro 25 and the last stop is close to the hotel, look for the EL triangle huge shop sign and go up that road the hotel is on the left. A T10 pass is cheaper for multiple trips and can be purchased from a machine in the metro station. The tube system is brilliant with trains air conditioned and very clean. Rooms have small safes and the mini bar is cheaper than the hotel bar.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "england bristol", "Title": "“perfect location, clean, modern and friendly”", "Author": "kazzaEnglandBristol", "ReviewID": "UR36724215", "Content": "Ive just returned from staying at this hotel, after choosing it from the trip advisor before i went. It was more than i expected. Great location a road away from the ramblas and eveything was with in walking distance, a little way if u want to go the beach but an enjoyable 30-40mins with lots to see along the way. The staff were very friendly spoke good english and were very helpful. I asked for a room high up as from previous reads on here i was concerned about the noise from the steet, we got a pool veiw with no street noise whats so ever. The room was really good size bigger than expected. Tea and coffee facilities, modern clean with a huge bed!! good shower to. Pretty perfect really only niggle was we had to pay extra to keep our room a few hrs extra and as we didnt get there till late on our arrival and was requested when booked i think this was abit mean!", "Date": "August 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Would be worth it if it were cleaner and the staff were friendlier”", "Author": "MizJames", "ReviewID": "UR36575654", "Content": "Overview: This hotel has very modern decoration (lots of marble tile everywhere) and felt a little cold to me, but my husband absolutely loved the way it looked, so if you like that sort of thing, this may be a good choice for you. The rooms along the back courtyard are very quiet, and the hotel is well-located. Pros: -Excellent location -Excellent breakfast buffet (lots of choices, everything fresh, lots of staff) -Excellent shower (large stall, lots of hot water, great water pressure) -Decent-sized rooms -Comfortable beds -Nice little pool (though very cloudy while we were there because of...???) -Nice little lounge area around the pool, plus a pool bar Cons: -The only channels in English are news, so if you like to watch T.V. you're out of luck. -If WiFi is important to you, be warned the service is spotty and slow. I had more luck picking up the signal of the Hotel Lleo a few doors down, and it was a faster connection too. -There are computers in the lobby, but you have to pay to use them! In a hotel this expensive I don't see why this should be so. Not to mention, they are absolutely filthy (Seriously. One of the screens looked as if it had been sneezed on and I saw it was not cleaned the whole time I was there.) One computer froze up while I was using it and the young woman at the desk seemed royally irritated with me because I wanted help instead of just using the other machine, which was her first suggestion. I tried to explain I had swiped my credit card and was paying for the time ticking away while I waited for someone to help. Finally, after the third person came over and shrugged, I said, \"Why don't you just please unplug it and plug it back in\" which they did. (I would've done it myself if I could've figured out where the outlet was.) That computer sat broken for the rest of the week I was there. -Staff not particularly friendly or helpful: I hate to base this on one or two staff in particular, but these were young women who worked the front desk most days we were there. I used to work in a hotel and know how difficult it can be, still... One young woman in particular seemed so constantly annoyed with anyone trying to speak Spanish (or even those of us asking politely for English) it made me reticent to approach the desk, Her demeanor changed considerably with anyone who spoke Catalan. I am not one to walk up and rudely demand things, and I personally feel that not speaking the local language puts me at a disadvantage, so I act accordingly. I'm not the type of guest who expects to be fawned over (years of past work in various service industry positions have made me far too empathetic to what the staff have to go through) but I do expect staff of a hotel this pricey to at least be civil, if not friendly. Not to mention, fully half or more of the guests spoke either Spanish or English, so it seems the staff should be prepared and not angry about it. I don't need hotel staff to be overly accommodating or to be my friend, just polite would do! -Cleanliness lacking: They say never look under a hotel bed, but I dropped something a few days into our stay, and when I bent down to look for it found fingernail clippings (which were not ours!) along the wall under the bed. YUCK. These had been under the bed the whole time, and indeed, stayed there the entire week. While the linens were changed daily, and sheets seemed spin 'n' span clean (thank god) the rest of the maid service was sorely lacking. During he first shower I took, as the steam fogged everything, I noticed soap scum up the walls and glass shower door. I also owned a small cleaning business once upon a time, and know if you merely wipe down the smooth tiles or glass doors with some regularity, you don't get that sort of buildup. The walls and shower door had obviously not been scrubbed in a while. Worse were the long, dark hairs that began to accumulate on the white tile bathroom floor. They weren't ours (I am a short-haired blond, my husband's head is shaved). I thought, \"Are those from the guests before us?\" Then as the days wore on and more accumulated, I thought they must be from the cleaning staff (or had they been on the unvacuumed floor and we tracked them in. Bleah.) The thing is, more were brought in, as the original hairs also remained. Obviously the floor was not given even given a cursory sweep during our whole visit. All I could think was if things this obvious were not attended to, how dirty was the rest of the room? The black tile floor? The sink? Ew. We just kept to the bathmats, and tried not to touch the shower walls. If the bed linen had given me any pause, we would've canceled the rest of the reservation and found something else, but as it was, it was easier to stay. The worst part was after a couple days interaction with the staff, I felt it was just easier not to mention the poor maid service, as I felt staff would certainly not be sympathetic, and probably nothing would change anyway. It really wasn't worth the trouble. Overall impression: This place would be an excellent value if the staff were just even the smallest bit warm and the rooms were cleaned properly. I don't want to give the impression it's a pit or anything, it's just...come on! Sweep the bathroom floor every third day for crying out loud! I'm pretty sure we won't be back. Note: We stayed at the Hotel Jazz on our last trip and found it clean, well located, reasonably priced, and the staff very helpful and friendly. The only reason we didn't stay there this time was that we were part of a conference and several friends were also staying at the Catalonia Ramblas. Also, the Jazz is right on top of a metro station and in some of the lower rooms you can hear and feel the trains as they pass. I was worried we might not get into a higher room, because I was booking so late. Next time I'll book early and book into the Jazz.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Good hotel, good location”", "Author": "francky88", "ReviewID": "UR35098416", "Content": "We stayed for two days with my wife at the hotel. It is well situaded, right in the heart of the city. You can walk to every place from here. Rooms are clean and quite big. People from the staff are friendly but i was surprised when i asked one of them to show me where the hotel is on the city map and he could not do it precisely. The beakfast is ok but sometimes you wait too long for coffee to come (and they don't like if you go take it by yourself:) I was suprised too that when i asked to borrow an iron and a table to iron my shirts. They told me they don't lend thoses things and that i should go to the store and buy one LOL Anyway we had a good time in this hotel and Barcelona is a great city. Franck", "Date": "July 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Great value & location”", "Author": "CathyBJohannesburg", "ReviewID": "UR33990384", "Content": "I've tried a number of hotels around Catalunya Square and this is the best value & location for me. Staff were exceptionally friendly and helpful, although the front desk is a little slow - I did arrive at the same time as another large group, though. Request a room facing the pool or the back street if possible as, like other hotels, the rooms facing the main road can be noisy. If you're there in summer you will not want to leave the pool area!", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great Location”", "Author": "MarigoldToronto", "ReviewID": "UR32675313", "Content": "Hotel was in a prime location, right at the top of Las Ramblas. Easy to walk to many things. Very chic rooms, clean lines. If your looking for cosy this isn't the hotel for you. Would stay again. Was about 35Euro's to the aiport from hotel for 4 people and lots of luggage.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "india", "Title": "“Good location”", "Author": "wosk", "ReviewID": "UR31834743", "Content": "In barcelona the best location for the hotel stay would be Ramblas street, but all the hotels on that street would be costly. This hotel is very very near to the ramblas street and also economical. The hotel, apart from good location, has good rooms and good service.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great hotell in central Barcelona!”", "Author": "Marten_Markstrom", "ReviewID": "UR31476348", "Content": "Me and my girlfriend had a lovely weekend at this hotel. The hotel is realy central, near Ramblas and . We got a room against the pool area (great to relax by the pool in the afternoon). The room was realy quiet, we could sleep with the windows open! Great large bed, and double doors to the hallway. The design of the room was realy modern and the breakfast was the best! We would recomend this hotel to oue friends...", "Date": "June 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manchester, UK", "Title": "“Great hotel in an excellent location”", "Author": "Patrick002", "ReviewID": "UR30528728", "Content": "Stayed at this hotel recently for 3 nights and had a great time. As mentioned in previous reviews, the location is excellent as you're only about 2 mins walk from La Ramblas and directly opposite a bus stop for the open-top tour buses. Our room was very spacious with a huge bed that was very comfortable. The cleanliness of the room and the hotel in general was excellent and the staff were all very friendly. Although we had an potential issue on the second day when they asked us to move to another hotel (I believe because they had over booked for the weekend) but once we explained that out trip was a birthday treat for me and we would prefer to stay, they very quickly agreed. The reception were understanding and professional when dealing with our situation. The hotel also has a reasonable sized outdoor pool that was great for unwinding after a day's sight-seeing. Would definitely recommend this hotel for both couples & families who want to have a central location for their stay.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "jerusalem", "Title": "“Good location, excellent hotel.”", "Author": "scooter010", "ReviewID": "UR28994423", "Content": "We stay in this hotel 4 nights, two adult and two children. The location is excellent, near Placa de Catalu?a, two Metro stations and in the top of La Rambles. The Staff was kindly, helpful and very efficient. The rooms are huge, modern and equipped well. We strongly recommend this hotel.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mobberley", "Title": "“Great hotel, fab rooms and lovely spa”", "Author": "Gordie12", "ReviewID": "UR27557388", "Content": "We payed £330 for 3 nights. Hotel in the middle of the action, room was huge with a great big bed, shower which would fit at least 4 in it (not that we did!) It rained on Thursday but we spent time in the spa and had it to ourselves which was great. Cleaners were a little eager but you can't complain at that, the rooms were spotless! Ask for room 313 as it was quiet and overlooked the pool", "Date": "April 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Grenoble", "Title": "“Looks nice but isn't 4* worthy”", "Author": "nymbusgirl", "ReviewID": "UR26397209", "Content": "We were kindly checked in early - we had just come to put our bags into storage but our room was ready which was great. The rooms are nice and the bed is fairly comfortable. It is also very clean. The temperature of the shower fluctuated from scalding hot to cold without touching the taps. And there is mold or green stains on the ceiling. They have been doing renovations one or two rooms over from ours all week - which included a lot of hammering and upon calling the front desk it seems they are knocking out old showers. --- why they put us on the same floor i have no idea?! They sounded really put out that I should complain.... For \"soundproofed\" rooms it was definitely disappointing. The rooftop pool has beautiful chairs and loungers next to it - that don't get sunlight! The cleaning staff are very determined to clean the room -- which is great until they knock quickly and open the door immediately. Once they just opened the door without knocking --- I was very concerned as I could have been getting dressed!!! Even with the do not disturb sign on the door they came in to try and clean the room.", "Date": "March 18, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“Good news - bad news”", "Author": "DaddyNewYork", "ReviewID": "UR26216422", "Content": "Bad news was when we checked in we were told the entire floor was flooded so they had no rooms [i am not sure i believed the front desk] Good news was they moved us down the street to the CATALONIA DUQUES DE BERGARA hotel and had a fantastic room and complimentary breakfast for the same price. It was a four **** hotel. The hotel was in a great location and we got an interior room so no view but very quiet. Also, the bus to the airport is across the square and only cost 4.75 euros each instead of 15 euros each plus a euro a bag for a taxi...", "Date": "March 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "piemonte", "Title": "“Great Hotel !!”", "Author": "sasaglo", "ReviewID": "UR25126479", "Content": "We stay in this hotel for only one night, two adult and one child; room exellence at fifht floor, no roumors. Breakfast expensive but favoulose....for one day is possible. In center of city and near the metro. Gloria", "Date": "February 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“Breakfast to die for”", "Author": "SwedeLisa", "ReviewID": "UR23945061", "Content": "I and my partner stayed at this hotel for Easter 2008. It is in a good location, on a side street at the top of Ramblas. So you get a little peace and quiet, but right next to the hustle and bustle. Walking distance to most things you would want to see, and there are a lot of nice bars in the quarters behind the hotel. Liked: The breakfast, the room and the location. Disliked: The restaurant, the unhelpful snotty staff and the big screen tv in the (very expensive) bar area. In total: Was I happy with it? Yes. Would I go back? If I got a good deal. Breakfast was truly fantastic. Different gorgeous breads and cheeses, yoghurts, cereals, cooked \"English breakfast\" buffet, great omelettes made to order, Spanish cake selection. It was a feast! And the breakfastroom itself is roomy, quite elegant and never felt crowded. And still- what I can recall best is grilling a piece of \"rustic\" bread in the toaster, putting on fresh tomatoes, and a little drizzle of olive oil. Hard to beat. The room was really nice. Very stylish- striking bold colourscheme, clean but also I suppose some would say smallish. Only a frosted glass door to the bathroom, which in our room was next to the bed. Again- very stylish, but not what you would want if you are on your first trip away with a romantic partner. The lobby area was also stylish and modern, with a bar. But the drinks were dear- and remember you can get lovely wine for next to nothing in any little bar only around the corner. And there was a huge flatscreen with sport on all the time, which totally ruined the classy and relaxing atmosphere. The staff were rather snotty, and could only be bothered to point in direction of the hallway with lifts to show us where our room was. Not very serviceminded. The restaurant at the back of the hotel was expensive, with bad tasting food (Surprising, considering the breakfasts were supreme.) and slow service. Do NOT try it. But do try the hotel itself.", "Date": "January 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rhode Island", "Title": "“Good place to stay”", "Author": "nancyr_ri", "ReviewID": "UR23733535", "Content": "This is a modern hotel in a great location near Placa de Cataluna and La Rambla. Staff were efficient and polite. It also includes a very good full breakfast as part of the cost of the room. I would definitely return!", "Date": "January 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Not worth it.”", "Author": "Gabriel08", "ReviewID": "UR22104290", "Content": "The concierge who helped us with our bags upon arriving did not help with our bags at the car and when he delivered them to the room had a grimace on the whole time. When we thanked him, he mumbled his response. Apparently unhappy about something. The room stunk of cigarettes even though it was a non-smoking room. The room was always hot even when we adjusted the thermometer. The bed was extremely uncomfortable. The very strong scent of cleaning products (to cover up cigar and cigarette odor?) was very irritating to our sinus allergies. In the lobby and hallways and room. No facial tissue or wash cloths in the room. The pool is set in a back courtyard, where people from their apartments can look down over you.", "Date": "November 23, 2008"}, {"Ratings": {"Service": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great Location, Brilliant Hotel”", "Author": "WhiteRose_AL", "ReviewID": "UR21972423", "Content": "Travelled as a couple for a short break in Barcelona. The hotel is in an excellent location, in the triangle at the top of Las Ramblas. The hotel is between Universitat and Place Catalunya Metro stops which get you to all the tourist sites in the City. We arrived late in the evening and check-in was quick and efficient. The hotel staff were very helpful and polite and expecting our arrival. I emailed the hotel which is part of the large Catalonia hotels group a day before travel to confirm the booking, they responded quickly with a reservation number. The hotel room was modern, very clean and standard to a 4* hotel. The rooms were cleaned daily with all the toiletries and towels replaced for fresh. The toiletries were a wide range and the bathroom also included a hairdryer. The room had no view as it was to the rear of the hotel but on the plus side it was extremely quiet, anyone who has been to Barcelona will tell you how noisy the city is on an evening. The hotel has a SPA with steam room and Sauna, this are all included in the booking price The hotel bar was relaxed and modern but very expensive; I am not one for eating in hotels so this was not a problem to us. There are hundreds of Tapas bars, restaurants and ice cream shops nearby. People will try to scare you with the possible dangers of Barcelona, more so to the south of Las Ramblas 'El Ravel'. We saw no such problems and the hotel is in a safe area next to all the tourist amenities, department stores and transport links. I booked through easytobook.com and got 4 nights for £290 which was a real bargain. If I could get the price again I would without doubt book the Catalonia Ramblas again. I would recommend this hotel to other travellers", "Date": "November 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York, New York", "Title": "“Hotel of Horror - The Worst Hotel in The World”", "Author": "Jetset7777", "ReviewID": "UR21912241", "Content": "This is truly the worst hotel experience I have ever endured. I travel frequently and reside at hotels globally, and have to say I have never been had such a horrific experience. Interestingly enough, I didn't have the time to check Trip Advisor before my trip, and if I had I would have read negative experiences which paralleled mine. The staff is abusive, negative, and misrepresented the price on the hotel room. Not just one staff member, many representing many different shifts. Carolina and Federico were just two of the staff members who truly RUINED what was the most amazing trip to Spain. Their behavior was almost sociopathic in their disdain for hotel guests and guest experience. A question regarding the rate of the room provoked Federico to threaten to call the police and report us to authorities over a 15 Euro difference. The hotel rate online as we booked was 90 Euros. He charged us 105 Euros. It wasn't the money, it was the principle, and the way we were treated was HORRIFIC. So, just for verification, we did pay the 105 Euros, but again, for us, it was about the principle, not the cash. I could go further into detail, but will tell you this was one of many abuses by the hotel staff that made our stay truly TERRIBLE. You can also read some of the other negative reviews on this website and find that they are all true. This is a terrible hotel, the worst staff, and the most horrific service I have every experienced. Please feel free to contact me for further verification or questions regarding this \"Horror of a Hotel.\" If you would prefer to be threatened, abused and experience terrible service, Hotel Catalonia Ramblas in Barcelona is the place to be. My advice... there are many nice hotels in Barcelona, and this isn't one of them, so book yourself somewhere else where the staff is friendly.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sutton Coldfield", "Title": "“SUPURB 4 DAY BREAK”", "Author": "beamoSuttonColdfield", "ReviewID": "UR21688498", "Content": "Booked this breakvia the Internet and used Travel Republic.Co.UK. The Hotel was suburb arrived via Ryan Air to Gerona,smooth transfer and room available on arrival at 11am The location is suburb just off the Las Ramblas and only 100 yards from the Square,Metro and Open Top Bus departure. The hotel was fantastic and the Spa facility very welcome after a day around the city. We stayed in room 115 on the first floor,still trying to work out the Hotel lift system!!!. We used a restaurant 100 yards from the hotel called L Oliva on 2 evenings,it was great quality and value 40 euros for 2 courses and a bottle of red(2 people). The best city I have visited and the hotel just made the break,breakfast was of a high standard and quality.", "Date": "November 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Recommended”", "Author": "kiwicmc", "ReviewID": "UR21469899", "Content": "I was somewhat apprehensive about staying here after reading some of the other reviews, but our experience at the Catalonia Ramblas was very positive. For starters, the location is just brilliant, right in the middle of everything, handy to the Metro and only 15 Euros by taxi from the airport. We were on the ground floor but at the back of the hotel - so no view, but the room was incredibly quiet and very dark when the curtains were pulled. Our room was very comfortable and VERY well equipped with lots of unusual but thoughtful touches like individual small reading lights (as well as bedside lamps), plugs in the sink (unusual in Europe), coffee and tea making equipment with a kettle to boil water (also unusual in Europe - and with a good assortment of herbal teas), free WIFI and even bathroom scales. The only thing I didn't particularly like was the funny long pillow, but that's not uncommon in Europe. Everything was very clean and worked fine - the air conditioning, the safe etc. The reception staff were a little offhand when we checked in but later I needed their assistance to make some phone calls in Spanish for me and Carolina on Reception was extremely helpful (including making a long distance call for me that I was never charged for). We arrived at 2pm (check in time) and had a 15 minute wait for our room to be ready - no big deal. There is a huge amount of seating in the lobby/bar area, as well as outside by the small pool on the second floor. We didn't use the pool as the water was not warm enough when we were there. I booked our stay via the www.wotif.com website and we paid only 138 Euro per night - a bargain for this room in this city. I'd definitely recommend the Catalonia Ramblas and I'd definitely stay there again.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Rude Service From a \"Four-Star\" Hotel Ruins a Trip”", "Author": "starlight06", "ReviewID": "UR19619565", "Content": "Although this hotel is sometimes called a \"four-star\" hotel, this was the worst hotel stay I have ever endured. The customer service ranged from lacking to actively insulting. After having to deal with (1) rude and unhelpful customer service, (2) a lost reservation, (3) broken air conditioning, and (4) a lying front desk attendant (even the reception manager admitted that the front desk attendant had lied to me), I would never recommend this hotel to anyone. *LOST RESERVATION* The first problem was that when I arrived at the end of a long trip from Valencia, I was told by the attendant at reception (Quentin) that he was unable to find my reservation. After about five minutes examining the list of reservations, I asked Quentin whether there was a problem with my reservation. I handed him my printout of my hotel reservation confirmation (I made the hotel reservation directly on the hotel website). Quentin curtly responded that there would be no problem, but for the fact that they did not have my reservation in the system. He then tried to send me to another hotel down the street. However, it was late at night at this point, and I was exhausted, so I asked Quentin if he could find a room for me. I had my reservation in hand, so it was clear that I was not in the wrong. After making a few phone calls to some other hotels, he finally assigned me to a room in the hotel. I asked Quentin how he was able to find another room. He snidely replied that he was only able to do so by taking a room away from a later-arriving customer, so he would have to deny them a room. I also explicitly confirmed with Quentin that the room he had assigned me to was the room that I had indeed contracted for. He responded, \"Yes, and this room is even superior to the other room.\" *BROKEN AIR CONDITIONING* When I arrived in my room, I was dismayed to discover that the air conditioning didn't appear to be working, even though I specifically booked the hotel because it said that it had air conditioning. After calling guest services, I was informed that I should turn on the air conditioning, and wait 15 minutes before calling them back. So I called - and was told that I would be called back in 15 more minutes. After waiting for far more than 15 minutes, and having received no call, I finally called back. And called. And called the front desk. And called. Until I finally got through - and when I spoke to Quentin at the front desk, he seemed totally unsurprised that the air conditioning wasn't working, and simply told me that there was nothing the hotel could do until the next day. Now, this was the middle of summer, and it was swelteringly hot in my room. I was forced to open the windows because it was incredibly hot. Even then, the room was still very hot, and because of the loud street noise consisting of rowdy partygoers that persisted until at least 5 am, I could not sleep at all that night. I had a full day planned the next day, and was exhausted all day because of my lack of sleep. *RUDE RECEPTION MANAGER* The next day, I spoke with Carola, the reception manager. When I calmly told her my story, and about how dismayed I felt at my treatment by Quentin, she interrupted my recounting of the incident at least 3 times, demanding, \"Are you done?\" She actually *ADMITTED* that Quentin had known about the broken air conditioning when he had assigned me to the room. And as for Quentin, she scornfully asked me, \"What do you want me to do - ask him to apologize to you because he knew that the air conditioning was broken?\" Well, Carola, I entered into a contract for a room with a/c - but your hotel breached that contract my giving me a hotel with NO a/c. Moreover, your hotel representative acted in bad faith by lying to me about the lack of a/c. I was so disturbed by Carola's accusatory attitude of denial that I asked to speak to her supervisor. *UNACCEPTABLE CUSTOMER SERVICE* Throughout this whole situation, I received no apologies from Carola or Quentin. It was only when I spoke directly with the director of the hotel that my concerns about shoddy customer service were even addressed. However, the director of the hotel still failed to make me feel like my concerns about shoddy customer service had been adequately addressed. He kept repeating that he had confidence in his staff, and he did not allay my concerns at having been treated poorly, despite NONE of the problems (lost reservation, broken a/c) having been my fault. Perhaps the hotel director's lax management skills has resulted in the unfortunate attitude with which the staff now treats the customers. I have never in my life complained about the customer service I received in a hotel - nor have I ever had to. Even in the smallest B&Bs I stayed in in Italy, I received service with a smile. I selected this hotel based on the positive Tripadvisor reviews as well as the hotel's proximity to Las Ramblas. However, I cannot in good conscience recommend that anyone else stay at this hotel, nor any of the other hotels in the Hoteles Catalonia group, in the future.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Delft, The Netherlands", "Title": "“Stylish, good location, friendly staff. This hotel is OK”", "Author": "Dutchman02", "ReviewID": "UR19551424", "Content": "We stayed here for 2 days for a Barcelona city break. When you first see the Hotel you might think it's quite small but once inside you'll think differently. The staff was nice and helpful and the hotel itself has a a stylish and luxury feel to it. Lot's of wood & marble panels. There is a bar lounge area inside (quite large for a hotel), and on the A-level there's a pool with bar as well. When you stay here make sure you know you way around. There are multiple levels and a second set of elevators that get you to some those. Our room (std. deluxe room) was okay although the bathroom door was located really close to the bed. but the rest of the room was spacious enough. Minibar, an in-room safe (big enough for a laptop), Flatscreen Tv, plenty of closet space are all present in the room. what i particularly liked was the double entree doors so most of the hallway sound is blocked. what I didn't like was that the beds came with a hard mattress. The hotel is located near the Catalonia Square (turn right outside the hotel) and La Rambla (the must-see boulevard) starts right there. all in 5 min radius. Opposite of the hotel is a bus stop for the red-route tourist bus which can take you to all the famous places in the city (get tickets/map at kiosk on Catalonia Square). We enjoyed our stay and we will come back and recommend to others.", "Date": "August 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "spongebob80", "Title": "“Loved almost every bit of this hotel”", "Author": "spongebob80", "ReviewID": "UR19456299", "Content": "When the taxi pulled up to the hotel, needless to say, it wasn't what I had expected. I was disappointed, but also surprised. I was surprised by the superb location of this 4* hotel. But disappointed, by the size on my first look. But once inside the hotel, I realised that, I had no reason to be disappointed, as the hotel from the outside, was very misleading, when infact, the hotel is really big! We checked in with no problems, even got a free upgrade. Happy days! The room was fabulous, virtually brand new, with all the mod-cons. Oo, I must mention the shower in our room, one of the best showers I've had in a hotel! Lovely and big, and clean. Perfecto! The location of the hotel couldnt be better, right next to the world famous Ramblas, yet, near enough away so that you dont get all of the hustle and bustle throughout the night. As I write this, I am sat in the hotel's reception/bar/t.v area waiting for our time to come before we can fly home. I will miss this hotel, as I think of all the hotels I've stayed in the world, this is one of the best. One thing I should mention, is the pick-pockets along the Ramblas, although that has nothing to do with the hotel, any one visiting the hotel or area should be aware that they need to bare in mind their security during their visit, might I suggest a bag that you can see and not carrying around lots of money or important travel documents The staff are friendly, and polite, and couldnt do anymore to help us. Another bonus, free wi-fi! The instructions said that we'd only be able to pick it up in this area on the first floor, but I have managed to pick up the signal in my room on the 3rd floor and at the other end of the hotel. To say that I am impressed with this hotel would be an understatement. I have already planned my return visit with some friends. Catalonia Ramblas, I'll be back!", "Date": "August 28, 2008"}, {"Ratings": {"Service": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jinxing", "Title": "“Bad bad bad”", "Author": "Jinxing", "ReviewID": "UR19275811", "Content": "This hotel verry bad ,pls do not stay. It Close to ramblas and Other things but service of customer Extremeley Poor. Terrible and cant recommend.", "Date": "August 23, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "N.Ireland", "Title": "“Recommend this hotel”", "Author": "Jill L", "ReviewID": "UR17953624", "Content": "We have just returned from a long weekend break in Barcelona. Despite initial problems with checking into the hotel, we would still strongly recommend it. The room was very comfortable and spacious. I think it is the most comfortable hotel bed ever! My only complaint would be that the rooms didnt seem to be cleaned until evening time, which was very inconvenient, given that this is the time we would have liked to be in the room before heading out for the evening. The buffet breakfast selection was second to none. Absolutely fantastic. The location of the hotel was ideal, very central but yet quiet at night when we wanted to sleep. No noise at all. Pool area was lovely and everything was spotlessly clean. We would definitely stay here again.", "Date": "July 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derby", "Title": "“Top Marks for the Ramblas”", "Author": "BindiDerby", "ReviewID": "UR17320427", "Content": "As with all holidays I was nervous in case I had got a bad hotel as it was a treat for me and a girlfriend for my 40th birthday, I need not have worried, It was fantastic. Yes the reception staff were not overly friendly but they were professional and quick. Hotel is half an hour from airport. Hotel and the room was very clean. Our room number was 239 and the room and bathroom were very spacious, the view is not great but we did not go there to sit in the room. The spa is to die for- again very clean. The pool on the roof is a great bonus the staff at the bar particularly one called Festus was a dab hand at the cocktails! The hotel restaurant is a must - top class meal, but you must book beforehand. You must have breakfast at this hotel, everything is so fresh and the choice is great. The location is cental, you leave the hotel and everything is on your doorstep, we were there for 5 days and did not use a cab. The harbour is a 20 minute walk. The designer shops LV, YSL etc are a 15 minute walk but if you are the kind not to venture too far this hotel is ideal. I would recommend that if you are coming here avoid paying the transfers as it is cheaper to get a cab yourself from the airport. I would defo class this as a 4 star and am planning to stay here again.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tampere, Finland", "Title": "“Very good location.”", "Author": "pet_so", "ReviewID": "UR16491619", "Content": "The hotel was a somewhat pleasant surprise. I had a spacious room with 2 queen beds, wooden floor, flat screen tv and a big bathroom with separate baththub and shower. The room was spotless and comfortable. The only complaint about the room is the difficulty of adjusting the temperature of the water from the (nice waterfall) shower. It was either very hot or too cold. No bottled water is provided free of charge in the room, but there are plenty of shops nearby to get all you need. The hotel had a small outdoor pool with a pool bar. I didn't try the spa services (sauna, jacuzzi, massage) Breakfast was comprehensive and beautifully laid out. No complaints. Service in the reception varied from standard polite service to somewhat rude and indifferent by one receptionist.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "5"}, "AuthorLocation": "Shropshire", "Title": "“Great Hotel, Fab Location”", "Author": "nipperShropshire", "ReviewID": "UR14984593", "Content": "My husband I stayed at this hotel in February 2008. The hotel is in a great location - really close to The Ramblas, bus routes and sights. Our room was spacious and beautifully laid out. The bathroom area was great. We stayed on a B&B basis - the breakfast was very good with lots of different things to choose from. You could also have bacon, eggs, etc cooked on a grill whilst you waited. I would recommend this hotel. The reception staff were very helpful. The only very minor downside we found was that we didn't have a good window in our room which meant there was very little natural daylight, however the plus side to this was that our room was located where there was no road or traffic noise. A great hotel, definitely worth a stay in a fab, vibrant city!", "Date": "April 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rishon", "Title": "“Wonderful hotel”", "Author": "O10", "ReviewID": "UR14134608", "Content": "I stayed one night with my kids and the room was clean and spacious, breakfast was wonderful", "Date": "March 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Excellent Hotel”", "Author": "billsinc", "ReviewID": "UR13725979", "Content": "We went to Barca for my wife's 50th birthday and, through Globespan booked this excellent hotel, accounting for the reviews on this site. Arrived, reception were excellent and helpful, porter took bags up to room. There are different shaped rooms in this hotel, we had a big and nicely shaped room. The room was clean, and the maids did a good job. Small balcony outside looked into narrow street. Easy to use safe in the room. Bathroom was roomy, bathrobes provided. Tea and coffee in room. Bed is very wide, I thought very comfortable, my wife thought a bit hard. LCD TV in room, three English speaking channels (BBC world, Sky News and CNN). Hotel recommended a brilliant restaurant to take my wife on her birthdaay (£80 for the two of us inc wine and drinks). Hotel ordered us a taxi on departure - €26.50 to airport inc supllement for bags. Breakfast is great and available up to 11.00am. lots of fruit, cakes, pastries and cooked eggs, omlettes ( with fillings), bacon - all cooked fresh on request. Location is perfect. 50-100m to the top of the Ramblas, Tour bus stop a couple of hundred meters away, though the North tour stops just on the corner across the road from the hotel. Metro stop less than 100m at Universtat. Airport bus only a few hundred meters away. Hard Rock Cafe on the square. Plenty close shopping. I'd stay here again, no hesitation. Barcelona is a great place, we were only there for 5 days, no where near enough time, could easily do a two week summer break in Barca.", "Date": "February 21, 2008"}], "HotelInfo": {"Name": "Catalonia Ramblas", "HotelURL": "/ShowUserReviews-g187497-d623246-Reviews-Catalonia_Ramblas-Barcelona_Catalonia.html", "Price": "$218 - $392*", "Address": "<div class=\"amenFloat\">", "HotelID": "623246", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/cf/9a/de/fachada-catalonia-ramblas.jpg"}}