{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Awesome hostel”", "Author": "travelingtark", "ReviewID": "UR128055530", "Content": "This hostel was an awesome place to stay. It was really clean, there was a great kitchen and common area, and the staff were all helpful and fun to hang out with. The rooms were spacious and clean, although I imagine they would get quite hot in the summer months. It was a really good place to meet other travelers, and the location was perfect. There are numerous sites within walking distance, and the hostel is just steps away from a metro station.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winchester, United Kingdom", "Title": "“Comfortable, Clean, Good location”", "Author": "EskiJ", "ReviewID": "UR123834544", "Content": "This is a relatively small hostel (4 bedrooms, 3 showers, 2 toilets) but perfectly formed. It is conceniently located 2-minutes from Passeig de Gracia metro station and a 10-minute walk from Placa de Catalunya. Around the corner from the hostel is Casa Batllo, a work by Antoni Gaudi and the 'hop-on, hop-off' tourist bus stops just outside this building. Although this is a lovely area, it is also filled withjexpensive designer shops; don't expect to pick up some locally-sourced gifts from nearby-you'll have to go further afield. The hostel itself is clean and tidy. The beds are generously large for a single, but they could benefit from fitting a bed-side light for each bed (during the night you have to risk waking up everyone sleeping in your room by turning on the main room light or risk fumbling around in the dark). The hostel would be able to accommodate people in wheelchairs but this would have to rely on someone opening the heavy external door and using two lifts to get to the first floor.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New york City", "Title": "“Wonderful Hostel”", "Author": "Dolbers", "ReviewID": "UR122472246", "Content": "I just wanted to express my gratitude for a wonderful group of individuals at the Sant Jordi Arago Hostel. The minute you walk in the door till the minute you leave for your next adventure, the staff and company are there to assist and provide a comfortable place to stay. The location is great and so is everything else. A special thank you to Gustavo and all others who make Sant Jordi such a great experience.. Hats off to you all!!! an a Happy New Year.. Peter J.Dolbey", "Date": "January 3, 2012"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Fun place but bed bugs”", "Author": "serra018", "ReviewID": "UR117548538", "Content": "Sant Jordi was definitely a fun hostel. Reminded me of a dorm room/ frat house. Lots to do, everyone was really friendly. Besides all the fun that went on there, there was one minor setback. The bed and sheets didnt seem to clean but we used them anyways, probably shouldnt have because we were attacked by bed bugs :/ Id definitely stay there again if this problem is taken care of.", "Date": "September 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice, quiet hostel”", "Author": "SomnioAmo", "ReviewID": "UR101149742", "Content": "This is quite a nice hostel in a nice building with good amenities and a personal touch. It is not a party hostel (like many I have been to) and it is quite a quiet place. They do, however, arrange bar/club outings each night with their sister hostels. Staff seems friendly and helpful, the area is nice, and the rooms are clean. There is free wifi, which worked great!", "Date": "March 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Loud & Rowdy.. Yet Great Location”", "Author": "GQ_Trippin", "ReviewID": "UR30418579", "Content": "Hostel- This place is small and very rowdy at night. A lot of young traveler’s stay here and it’s a party zone. We had rough nights sleep here because it was so loud outside. Room- Small bunks and cramped. Staff- Not so accommodating. Shower- Out in hallway and shared. Location- Great location; right next to Gaudi’s House Museum and walking distance to La Rambla. Underground metro is just a short block away. Attraction- We booked a bike tour with Fat Tire and it was completely worth it. A great way to see the city and learn a little bit of culture. Tip- The location is great and it’s reasonably price. Perhaps that’s enough to sacrifice a good nights sleep. What’s important to you?", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“The best atmosphere”", "Author": "steftravels", "ReviewID": "UR21294314", "Content": "We stayed here for 3 nights and absolutely loved it! The location is perfect, you're a 5-10 min walk from La Rambla and the metro station is a 2 minute walk. The best part of this hostel was the 'home' feeling that you get - it is a small hostel but the living area has a TV with DVDs as well as free internet. There are evening plans almost every night to meet up with other Sant Jordi hostel travellers and there's €2 breakfast served by Linda, who is the hardest-working, most welcoming hostel staffer ever!! Definitely recommend this place to stay - just be prepared for a smaller than usual hostel. This is def. the place for you if you're looking to meet other travellers and have a great time !", "Date": "October 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“Great Staff”", "Author": "Roadknight777", "ReviewID": "UR20257477", "Content": "This is a great hostel, with a great staff, and a great location. Located right in the heart of Barcelona in between the two biggest avenues. Can't get any better, enjoy Barcelona.", "Date": "September 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Diddylicious", "Title": "“Didn't live up the hype elsewhere...”", "Author": "Diddylicious", "ReviewID": "UR17160311", "Content": "Despite this hostel receiving considerably good feedback elsewhere online, we were actually somewhat disappointed with our experience. My partner and I booked a 6-bed mixed dorm, but were disappointed to be sleeping in a shoebox room that had hardly any room to move, no cooling, no ventilation and no secure storage spaces. Also of concern was the fact that there are only 2 showers and 2 toilets to cater for ALL the guests in the hostel. I would guess that the capacity is around 30-40 people which really isn't good enough. To compound matters, 1 toilet was continually blocked and the other didn't have a seat which was not appreciated by my girlfriend! My other gripe is the noise. The common living space is rather close to the dorms and can get quite noisy at all hours. Positives of the hostel were the free internet and social life. All in all, we expected more from such a well-regarded hostel. There are plenty of happy customers it would seem, so I hope their experiences were better than ours!", "Date": "June 23, 2008"}], "HotelInfo": {"Name": "Sant Jordi Arago Hostel", "HotelURL": "/ShowUserReviews-g187497-d626116-Reviews-Sant_Jordi_Arago_Hostel-Barcelona_Catalonia.html", "Price": "$37 - $44*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Arago 268, Principal 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">08009</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "626116", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/da/8d/da8dc1eff89baca47c004668c98c80271large.jpg"}}