{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunnyside, New York", "Title": "“Great Hotel!”", "Author": "Sabrina M", "ReviewID": "UR139655470", "Content": "My husband and I visited Ocean City Maryland and stayed at the Breakers the weekend of August 24, 2012. This was our first time visiting Ocean City and we were celebrating our first anniversary. Our room was beautiful; it was clean, renovated, had microwave and frig. The location of the Breakers Hotel was great because we were right on the boardwalk. Once you were on the boardwalk, you were in the middle of the 'boardwalk action'. The amusement park was nearby as well. My husband and I were especially happy with the location. The staff at the Breakers was excellent. Since this was our first time in Ocean City, we were not familiar with restaurants, activities, etc. The front desk staff helped us with our plans and really recommended some wonderful places; Bahama Mamas's for some crabs, Shannigan's for lunch, Fager's for dinner. On the night of our anniversary, after coming back from a great dinner/time at Fager's, the staff left us some delicious chocolate covered strawberries in our frig for our anniversary! We were touched by the thoughtfulness. Thank you Breakers for making our first anniversary great and memorable. Hope to see you next year!", "Date": "September 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "East Islip, New York", "Title": "“Great Room reasonable price”", "Author": "Judy L", "ReviewID": "UR139487715", "Content": "We had a wonderful time in Ocena CIty Maryland. Our room was beautiful, as the hotel has been recently renovated. Complete with Microwave, refrigerator and right on the boardwalk. Help was very courteous, room was clean. Would go back again without hesitation. THe only downside was the indoor pool but you are on a beautiful beach with lots to do!", "Date": "September 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salem, Ohio", "Title": "“great as always!”", "Author": "Christa H", "ReviewID": "UR139475202", "Content": "My husband and I just came back from a great vacation with my parents. We love staying at Breakers. We had an ocean front room ( suite) and the view is amazing! We have stayed here several times. We go to Ocean City every year and try to book this hotel every year because it is clean, the rooms have so much space and the location is perfect! The beds were very comfortable, nice sitting area, and they have a microwave and mini fridge and a sink. The bathroom is ok, nothing spectacular but nice enough. Would have been nice to have a full length mirror like a lot of hotels.You don't feel crowed at all in this suite. Although we have never stayed in a room other than the ocean front, I would imagine that all rooms would be nice here. It is located right above the dough roller resturant which is perfect when you get hungry late at night! YUM!!! Its not far from the amusment park and short walk to great resturants on the boardwalk. The staff was friendly at the desk . (which has not always been the case) But the last couple of years they have been great! They have strict rules here but that is what keeps it very nice and safe as well. ( such as for an example, you need a room key to get up to the floors) We enjoy it here and can't wait to go back again next year! They are pricy but again, we feel it is worth paying more because it is so nice and also clean. Some hotels on the boardwalk are not like that. You don't have to get ocean front room to save money. They have standard rooms which have a window ( it doesn't open though) that faces the side and looks at another building with no ocean view if you wanted. Over all, we would be sure to recommend this lovely hotel. If you do however want an ocean front room, they only have 9 rooms so you should book early. Go visit ocean city, so much to do!!!!!!", "Date": "September 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“starting to show wear and tear....”", "Author": "Dawn F", "ReviewID": "UR138555690", "Content": "After staying at this hotel several times in the past I think it's starting to show wear and tear. We stayed in a oceanfront room (as in the past) although this time it was on the third floor. Sitting on our balcony you saw the top of the canopy for the Dough Roller restaurant which was disgusting and dirty. Definately should be cleaned for guests staying on this floor. Carpet had several noticable tears and worn spots. Hole in bathroom wall. Vanity mirror didn't light. Our card for entry in the room stopped working twice during our three day stay and we had to go to the desk for them to reactivate. Also second day of our stay the maid service skipped our room and when we came back at 530pm we had to call down and asked for it to be cleaned. No explanation given on why it was skipped. I think for the price of these rooms ($369 per day) updates need to start happening soon. Don't think I would stay here again. Location is great but the price just isn't worth it any longer....", "Date": "August 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“good, not great...”", "Author": "LionKingMD", "ReviewID": "UR137943936", "Content": "We didn't know what to expect for a last minute booking to celebrate my birthday, but had read the great reviews of the Breakers Hotel, so we figured we would be pleased. Well...not totally. At check in we had requested an oceanview room on a high floor. When my fiancé' checked in, she was told we were on the third floor - the first level of rooms - not high at all! When she asked for a higher floor, she was told, there were no rooms on higher floors available and came to get me with the bags and the key to the 3rd floor room. We went up to the room, and found it to be so low that all you could see off the balcony were buildings. If you leaned way over the balcony you could see a small piece of the beach. Be warned! This is considered oceanview! Not the view I expected so I insisted we go back to the clerk and ask for another room. Miraculously, a room on a higher floor was found! So after looking at the room on the 5th floor, we changed rooms. Although, we still had to look over the balcony to see the ocean, it was a better view of the ocean. However, either way, you have to lean over the balcony to see the oceanview. You can also see part of the bay. After our first night, the hotel's hot water wasn't working throughout the hotel. We were told this was the first time that had ever happened and it was repaired by the following morning. The cold shower the first morning was not pleasant! BRRRR! The front desk workers were pleasant and apologetic for the problems we encountered. The room was clean, the air conditioner is self regulated (which is always a plus), and the room contains both a refrigerator and a microwave. We had to call the front desk twice, however- once, because housekeeping did not clean the tub, and second because there was no hotel information book in the room. Housekeeping came back immediately to take care of the matter and someone from the check-in desk came upstairs to bring us the book. Now to the good part...EXCELLENT location right on the board walk. A few doors down from Thrashers and 4 -5 blocks from the amusement park, you couldn't ask for a better location. Although we had a good, but not great couple of days, we would not stay here again. There are better hotels with more of an oceanview and comparable prices.", "Date": "August 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very clean, great location”", "Author": "Ajd720", "ReviewID": "UR137671324", "Content": "I was very happy with my stay at The Breakers. My husband and I booked the hotel last minute. Many of the hotels were booked. We payed a little more than we wanted to, but we were willing to pay more to get a clean hotel. We were very pleased. The decor was modern, the staff was very nice and friendly, the rooms were very clean, and the location was great. The Breakers is located right on the boardwalk. We had no problem finding a parking spot in their lot even though we checked in pretty late. They are big on security there. You need your room key to access the floors where your room is located and you have to call to be let in between the hours of 2-6 AM and they are very strict about guests. This is a good thing for some, but bad thing for others. Our only complaint is that we had trouble figuring out where we needed to go to check in as the front door is not very well marked. The other thing is make sure you are checked out by 11:00 because the room keys stop working at exactly 11:00 AM. However, I would definitely recommend this hotel!", "Date": "August 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "baltimore", "Title": "“Best in Ocean City”", "Author": "mje672", "ReviewID": "UR136936402", "Content": "This is our second time staying here and had another GREAT experience. Beautifully maintained hotel with all the amenities you could ask for. he beds are so comfortable and the linens are beautiful. The staff is wonderful. It is so clean. Will never stay any where else.", "Date": "August 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“Only the Best”", "Author": "Randler", "ReviewID": "UR136519050", "Content": "I must admit this was our 5th visit over the past 5 years, each for a weeks’ time. The staff is unbelievable (if I could wrap them up and take them home I would). They know the area, the best alternatives and are as helpful as you want them to be. They truly help make the stay enjoyable. The facility is clean as a whistle. The cleaning staff is excellent. The rooms are large and those that overlook the ocean make the vacation. Please trust me, you cannot go wrong selecting this hotel. We will be back next year for our next summer vacation", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“This place is the best!!!”", "Author": "RosanneM668", "ReviewID": "UR134235074", "Content": "This will be my second stay at the breakers and it definately won't be my last. The first thing I want to say is that you will not find a nicer, cleaner room in ocean city. The staff is unbelievably friendly. The rooms are very spacious. The beds are very comfortable. The bathroom has double bowel sinks and plenty of space for all of your things. I can't say enough good about this place and would definately recommend staying here if you like clean spacious well decorated rooms and a great location.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cascade, Maryland", "Title": "“Great place to stay”", "Author": "Michael d", "ReviewID": "UR132567602", "Content": "Have been to OC many times and tried many hotels. Since the Dough Roller is one of our favorite places to eat we thought we would try the hotel. Best move we ever made. This is one of the nicest hotels on this end of the boardwalk. The rooms were clean, the whole place was great. I don't understand why people complained about the staff because I thought they were very pleasant. My daughter got ill about 8 pm and the desk clerks called every urgent care center in the area to find the closest one open. They even asked the next day how she was. This was my first time staying here and will probably be the only one I will ever stay at. Thanks to all involved there for our terrific stay.", "Date": "June 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Second time as good as the first!”", "Author": "tasutt", "ReviewID": "UR132556094", "Content": "Second year staying at The Breakers..was as good as the first! Big chain hotels should look at how this place is run! Extremely clean, owners and staff are \"top shelf\"! The staff even remembered us from last year. It's a shame we could only stay a week....looking forward to next year. You may see people say negative things about this hotel....don't believe them!", "Date": "June 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bath, Pennsylvania", "Title": "“WOW....”", "Author": "emt4676", "ReviewID": "UR132463444", "Content": "We stayed here on Memorial Day weekend. From the time we walked in the door we were impressed. The desk staff was very friendly and went above and beyond with anything we needed. The room was very nice sized as was the bathroom. We left the room early every morning and got back around late morning and everything looked perfect. We will definitely be staying here again", "Date": "June 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Clean and Friendly Staff”", "Author": "valerie s", "ReviewID": "UR131902390", "Content": "Me and my husband stayed here on Mother's Day Weekend (5/2012) and was so glad we chose this hotel. I loved the security of the hotel, the clean rooms and the large king bed! The staff was very friendly and warm. The only draw back is the pool is indoors but when you have an ocean.... We will definetly be staying with Breakers each and every visit we make to OCM!", "Date": "June 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Will never come back”", "Author": "Dzell", "ReviewID": "UR131716929", "Content": "The only thing good about this place is the security. We already paid $500 for our room for 2days then they made us pay an extra $50 a day for our child, then the next day we got up around 11am walked on the board walk got back around 4 something to find out no one cleaned anything, no new sheets no new towels or wash cloths nothing so we went down to the front desk to get something to handle that only to find the people have to clean the rooms leave at 1pm. There customer service is horrible and I wouldn't suggest no one to stay here", "Date": "June 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“First Class”", "Author": "Doris3459", "ReviewID": "UR131702546", "Content": "My husband and I just spent 4 days at this hotel and from the time I made the reservations to the time we checked out, everything was first class. Darian at the front desk was such a gem. She was so kind to get my airshow tickets printed for me. This might not sound like such a big deal, but the web site that I purchased the tickets did not work on our computers but she made it happen. The other staff at this hotel were extremely kind and helpful. The hotel is very CLEAN, too. We will definitely stay at the Breakers again. Thanks to the Breakers staff for such a wonderful stay. Doris G", "Date": "June 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Extremely clean!!”", "Author": "malkhhussain", "ReviewID": "UR130939762", "Content": "We stayed over the Memorial Day weekend and it was wonderful. Extremely clean, rooms are huge, staff was awesome, we stayed on the same floor as the front desk and every time we passed the desk, they greeted us, day or night. The whole place is very spacious and comfortable and did I mention CLEAN!!. The only slight drawback would have to be the parking, its off-site, but that's the only thing I can find wrong. Otherwise, this place is a gem, I will definitely stay here again, and recommend it to everyone.", "Date": "May 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CMCH", "Title": "“Immaculate!”", "Author": "401Sher", "ReviewID": "UR127953153", "Content": "We stayed at the Breakers the weekend after Easter. The location can't be beat and the overall value was excellent. The room was very comfortable, updated and immaculate. The staff was friendly and helpful. We will return for sure.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newark, DE", "Title": "“Our first time but not our last!”", "Author": "Darlene L", "ReviewID": "UR127892671", "Content": "We went over \"spring break\". It was my husband and two kids (12 and 15 years old). I reserved an oceanfront suite. It was better than I expected - nicely decorated and CLEAN, CLEAN, CLEAN!!! Best hotel I stayed in OCMD. Will be going again. Suggestion: the sun in the morning on the oceanfront sutie deck is extremely bright, therefore recommend having a baseball cap to wear, in addition to sunglasses! Very secure facility and it was very quiet! Again, would highly recommend this hotel!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dillsburg, PA", "Title": "“watch out for owner”", "Author": "kali5205", "ReviewID": "UR123973757", "Content": "VERY RUDE!!!! Called at beginning of season to make reservations. talked to a lady that told me when i decide which room to take to call and she will put my name down. they officially don't enter the info until the following day. She would take my name and then i would be assured of getting a room and i would then call with my payment info the next day. She was very nice and accommodating, explaining all of the rooms, etc. 10 minutes later i called back and Julie (the owner) answered the phone and was rude from the start. i have never spoke with anyone this rude. As soon as i started to ask if they could put my name down for a room, she started yelling. i guess she was having a bad day and decided to take it out on me. She was yelling that i want a room and she was trying to enter info into the computer. That she was trying to work and all of these people were calling for rooms. Hello....that's why they are there. That's their business. i had to ask her if i could talk. She was ranting and raving. Unbelievable. My Husband was listening and couldn't believe it and refused to ever stay there again. We go to OC a couple of times a year and have stayed with them. Hoping this isn't a new owner. She will run it down if she continues to treat customers like that. The thing is that i didn't care if i needed to just call back tomorrow, that would have been fine. But she didn't give me a chance. She is a miserable person.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Martinsburg, West Virginia, United States", "Title": "“great experience want more”", "Author": "Steven S", "ReviewID": "UR119338236", "Content": "This by far was the best room i have ever stayed in at ocean city, md. The room was so clean, furnishings all new, beautiful view of the sunrise, the security having cameras on all levels and needing the room key to get to your floor on the elevator. This was a great experience and looking forward to going back with affordable rates. Just made for a perfect vacation.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Much better than we hoped for”", "Author": "shatstick", "ReviewID": "UR117994256", "Content": "We recently stayed at the Breakers hotel in OC, MD. Overall it was a pleasant surprise. Very clean, big room. Remodeld bath (in recent years) with higher end fixtures and a new bath tub. Crown molding throughout the room. It is clear that it was remodeled with care. Nicely done overall. Clean carpet, clean bedding, a safe, fridge, and spacious. The location was excellent for boardwalk and beach access. Service at the front desk was friendly. Overall this is a 5 rating. We carried low expectations into our stay because its Ocean City. If you do too this will far surpass what you hoped for.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Clean and Great Location-Ask About AC!”", "Author": "Chowess E", "ReviewID": "UR117334123", "Content": "Room and bathroom were spacious and clean, clean fridge, clean microwave, and maid service very prompt in the AM. Overall a very nice hotel, I would be happy to stay again and probably will. But we were in a room where the AC didn't work correctly. I didn't mind it because I'm always cold. Another family member was furious because he was hot and had trouble sleeping. The location is tops! The parking lot is a bit away and not clearly marked. I also don't like the fact that you can't take the stairways to the outside or an alarm will sound, but with children and all our beach junk it didn't matter so much. In general I hate elevators. Oh and one of the best parts- SMOKE FREE, YAHOO", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Washington DC, District of Columbia, USA", "Title": "“Great location with nice rooms.”", "Author": "apoc3", "ReviewID": "UR117179770", "Content": "We (two adults and one 2 year old) stayed for two nights this summer. We were very happy with our stay and would definitely return given the opportunity. The hotel is located on the boardwalk at 3rd street. They have their own parking spot located a block west of the hotel. We haven't stayed at OC before, but I've heard that parking with hotels can be a real hassle. At Breakers it was very pain free. They allow you to park temporarily at the hotel to unload your gear, then you can park your car in their lot and make the short walk back to the hotel. The hotel was very clean and the rooms were much more spacious than I expected. We didn't have an ocean view, but we made our reservation at short notice. We had a nice view of the neighbor hotel's pool though. Furnishings were adequate, though the beds were a little too firm for my tastes. Noise at night was a little louder than you might want, but it didn't keep anyone awake, so I can't complain. The hotel has a small pool which was very nice. The reading material says that its heated, but maybe the heater was on the fritz as it was ice cold. It was still nice to get in with our daughter at the end of the day (and when it rained). The hotel is located above a pizza restaurant (Dough Rollers, I think). The food is decent and the location is convenient if the weather is bad or you want to get a quick bite to eat. Access to and from the hotel is very nice. The beach is just outside the main door. We didn't have much interaction with the staff, but anyone we did interact with was very friendly and helpful.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "baltimore", "Title": "“The best hotel we have ever stayed at in OC”", "Author": "mje672", "ReviewID": "UR116281744", "Content": "The Breakers is by far the best hotel we have stayed at in OC. The room was huge for our family of 5 with a beautiful bathroom. Beds were super comfortable with lovely linens. Shower was great with lots of space in cabinets for your toiletries. Cleanest hotel ever. Bathrooms were immaculate. The staff was super friendly and could not have been more helpful. Parking was a pleasure. Small lot was close to hotel with lots of spots even for August. We had no trouble finding a spot. We definitely want to stay here in the future. Can't wait!!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Best hotel in Ocean City - by far!”", "Author": "THEROOKIEKC", "ReviewID": "UR116172351", "Content": "We stayed at the Breakers Hotel over Memorial Day weekend. We had read all the reviews on trip advisor and were a little worried based upon some of the reviews we read about the staff, etc. We arrived early (11am - check in is at 3pm)and though our room was not ready yet, we were given a parking pass so we could enjoy our day at the beach while our room was being serviced. The front desk was very nice and helpful, nothing like some of the previous reviews had stated. The rooms - FABULOUS! I am a neat freak and they totally passed my test. Everything is immaculate! The bathrooms were huge as was the room. We had an oceanfront suite with two queen beds and a pull out.. two tv's... We did not have any issue's with housekeeping at all, and in fact found them to be very accomodating. There is no room service, but they do have vending machines with snacks/soda's. Also, has a very nice indoor pool. This is a very clean and nice hotel. Perfect for those with families that want to get away from the late night partiers. And the location - perfect! Right on top of the Dough Roller. It doesn't get any better than this!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "White Plains, New York", "Title": "“Very nice, warm, and friendly”", "Author": "Wileych", "ReviewID": "UR116100952", "Content": "This hotel was fantastic. It was clean, comfortable, quiet, and nicely located. The hotel staff was also very warm, from the front desk to the gentleman taking care of the pool. A wonderful experience.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“Great Hotel, Mediocre Service”", "Author": "kgreenbe", "ReviewID": "UR115851302", "Content": "My boyfriend and I decided to stay at The Breakers Hotel with another couple in July of 2011. We had heard from a family friend that the hotel was one of the cleanest in Ocean City, and was right on the boardwalk. While the hotel was definitely pricey (almost $600 for two nights in a standard room), the boardwalk location and the cleanliness of the hotel could not be beat. However, we were disappointed to find that the staff was very rude, and treated us like we were an inconvenience to them. When we first arrived, the woman who checked us in proceeded to explain the rules about the foot washing station, and handed me the key. She then decided to grab the key out of my hand to replace it with another one! A few minutes later, we found some previous stains (although minor) on the carpet, and went to the lobby to inform the staff that it was not our doing to avoid a charge at the end of the trip. The woman at the desk pretty much ignored us, and treated our concern as if we were foolish and incompetent. Also, later that night we had called down to request a few extra pillows (there were only four pillows in the room, one for each person). The staff at the time told us that we should have had some extra ones in the closet, which we did not. Finally, an attendant came to the door and said that she had one extra pillow- the last one in the entire hotel. We found this to be a little unbelievable, which it was. The next day, I had walked by an open linen closet to see a stack of extra clean pillows! All in all, The Breakers is definitely a clean and convenient hotel. However, do not expect to be treated well, regardless of the high price you're paying.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Mastic Beach, New York", "Title": "“Find another hotel on boardwalk”", "Author": "48133Love2travel", "ReviewID": "UR115845125", "Content": "My husband and I go to OC every year and stay on the boardwalk at a different hotel. This hotel was the worst. Hotel management and employees are not helpful and rude! This is not a kid-friendly place. They have no outdoor pool and the small indoor pool is FREEZING! No room service and no ammenities. There are so many other great hotels on the boardwalk that you can stay out for the same price and get so much more including friendly staff.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Port Jefferson, New York", "Title": "“Rude Management and Employees”", "Author": "luv2travel0708", "ReviewID": "UR115715506", "Content": "This hotel is not accommodating at all. If you are in need of extra towels, shampoo or any other amenities they supply you will be given an attitude. For example, you will either have to go to the front desk to get them AND bring your dirty ones to them (towel for a towel type of thing). We did not feel comfortable in this hotel at all...almost like staying in a strangers house. Look for another hotel on the strip..they are all the same price and MUCH better! I will never stay here again.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "washington,dc", "Title": "“clean , great place to stay”", "Author": "roadrunner7826", "ReviewID": "UR115634899", "Content": "pros , 1 clean 2 updated bathrooms 3 on boarwalk LOCATION LOCATION CONS 1 no outdoor pool but its next to dough roller i know how can they put a pool but still ? 2 no room service no snack bar theres no restaurant for late night or bar in hotel 3 no entertainment this place is great for basic clean room very comfortable quiet hallways just indoor pool a lobby with a tv and bathroom nuthin else really and nice rooms my hubby and i like it again for location on beach and boardwalk can walk anywhere to bars ,beach ext....", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great Hotel will stay there again!”", "Author": "RosanneM668", "ReviewID": "UR114970556", "Content": "We stayed there the week before the 4th of July, and this is one of the cleanest and most comfortable hotels I have ever stayed at in Ocean City, MD. This hotel has one of the best bathrooms I have ever seen in a hotel. The bathroom had a double bowlsink and a great shower. It was better than any other hotel I ever stayed in. The hotel staff was every friendly and always a smile on there face. The only negative thing I can say is that the TV volume was very low and the balcony a little small but other than that its a great hotel and I would highly recommend it .", "Date": "July 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“AWESOME!!!!!”", "Author": "tasutt", "ReviewID": "UR114158526", "Content": "Not one negative thing to say!!! The cleanest hotel I have ever stayed in. The rooms were spacious and immaculate!!! The staff was friendly and helpful. What a pleasent stay, I can't wait to make my reservations for next year. This is the first review I have ever left just felt it was so great I wanted to share. Thanks again Breakers!!!! Oh and fantastic view and location was perfect!!!", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "White Haven, Pennsylvania", "Title": "“Very Nice”", "Author": "lulu1159", "ReviewID": "UR113295502", "Content": "This is the second time we stayed at The Breakers. This is the nicest, cleanest place we ever stayed. We even stayed at AAA Hotels which were nice but this place is nicer and much much cleaner. This is how all AAA hotels should be, but not all are this clean. Yhe rooms are very big. The beds are very comfortable. The work staff is very very nice. The women at the front desk, Barbara and Derian (not sure if i spelled her name correct) are very pleasant. And Peggy The Head Housekeeper is really nice to talk to. Also Cathrine and Leo whom she was training in housekeeping were very nice. We well definitely stay there again and again. KEEP UP THE GOOD WORK!!!!!!!!!!!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Lovely Hotel!”", "Author": "cgall18", "ReviewID": "UR97510350", "Content": "My husband and I and our 3 children stayed at the Breakers Hotel for the week this Summer. We had an Oceanfront Suite. The room was immaculate and beautifully decorated. The hotel was nice and quiet. Perfect hotel for families. The bathroom had lots of vanity space and cabinets and drawers under the double sink to store all of our toiletries. The beds were extremely comfortable and the ocean view was amazing. The management was very nice to us. If we ever get back to Ocean City, MD this is the only hotel I would stay at. It's clean, quiet and in the best location in Ocean City.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“The employee's are terrible!”", "Author": "speaksthetruth_10", "ReviewID": "UR84827734", "Content": "This is a beautiful hotel! However... although the signs don't tell you; don't use the stairs because all exits from the stairwell will set off an alarm, at that point the staff will angrily come out and tell you that you are stupid while they reset the alarm system. Second bit of advise; don't tip your room attendant because she is sure to help herself to your 6 year old's toothfairy money. How do you explain that to a child? Then when you complain to the manager she will do nothing because after all, you did like the hotel itself and she is sure you will return even if you were treated awfully.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Georges, DE", "Title": "“Fabulous!!!!!!”", "Author": "Norma054", "ReviewID": "UR84481631", "Content": "This was our third year and every year we are not disappointed. From the time we make our reservation in early February to the time we check out we are treated with such courteous personnel. Everyone is so nice. We have never had any complaints and everyone there will bend over backwards to make your stay enjoyable. The view from the ocean front suite is fabulous. We look forward to returning again next year!!!!!", "Date": "October 22, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "White Haven, Pennsylvania", "Title": "“WONDERFUL”", "Author": "lulu1159", "ReviewID": "UR71033478", "Content": "I would recommend The Breakers to everybody. The price was very good for these rooms. And these rooms were big and VERY VERY CLEAN. I felt very secure having the security cameras and having to use the room card on the elevator to get to my floor. The beds are very very comfortable. I like that it is smoke free and also that it is a very quiet place. We stayed in a room with no balcony or view but we were very pleased with our stay. The parking is a little odd but it was'nt that bad as some say. Everyone that works here are nice. Peggy, the room supervisor was really friendly. She was very nice to talk to. We will definitey stay there again. Keep up the good work!", "Date": "July 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“Great Place, Parking not so great”", "Author": "dottijo", "ReviewID": "UR56029736", "Content": "First time stay last year and will continue to stay there everytime. We did not encounter rudeness and the room & view were spectacular. Yes the price is a bit high but so are the trashy places that continue on down the boardwalk. The ONLY drawback to this hotel was the parking. Awful, Awful, awful. I would still recommend this hotel to anyone listening, lol! ALSO before I forget...the security is great...if you do not have a passcard the elevator will not take you up. I did not see one other comment about this. I liked the feeling. Plus the high speed internet, great!!", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Upscale, Family-Friendly Atmosphere”", "Author": "AutumnKat", "ReviewID": "UR49356018", "Content": "My family has stayed at The Breakers on several occasions and at different times of the season. We have never been dissapointed. The staff are always friendly and willing to chat. We travel with 5 people ranging in age from 3 to 70 and everyone had a great time. The location is superb! The atrium pool is relaxing. Having a guest laundry on premises is very helpful. The Hotel is quiet and very clean. The security at the downstairs elevator and the key access to the upper levels is comforting. I can not say enough about this hotel. If you are looking for a family friendly atmosphere without the loud party goers, then this is the hotel for you!", "Date": "November 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Horseheads, New York", "Title": "“very disappoineted”", "Author": "spunkkigurl", "ReviewID": "UR46797904", "Content": "Me and my boyfriend stayed at the breaker hotel in october of this year (2009). It was a suprise for my birthday. I have alway's wanted to stay at a hotel with a ocean view. I was very excited to get away for the weekend but to my suprise the hotel with the ocean view was actually to me a side ocean view, you should be able to open your balcony door and actually see the ocean in front of you, not open your door to look to your right in order to see a side view of the ocean. What a bummer.... The weather was crappy and most of the shops were closed for the season.. In other words don't visit the board walk in october it is a ghost town.. I hope to visit again next year but not stay at the breaker hotel. oh and yes the parking is also a hassle....", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kansas City, MO", "Title": "“Cleanest Hotel in OC”", "Author": "WardMoores", "ReviewID": "UR41201824", "Content": "I read every review of this hotel prior to booking my trip and bottom line, it did not dissapoint. I will note, as many preior reviewers have, the owner, Julie is her name I beleive, was a bit curt at first, but warmmed up and was actually very friendly, but initially, she was rude. I havd to add that the friendliness of the remaining staff overcompensated for her lack of congieniality. My daughter wiped out on a wave during our stay and had some pretty good scrapes on her thigh. The staff gave us bandages, gauze and all the fixins to mend her. they also continued to ask about her every day when they saw us. On to the rooms...I think these are the cleanest rooms in OC!!!!! We stayed in the Ocean Front Suite, yes it was the most expensive room there, and likely a bit overpriced conpared to some of the other hotels near by, but our room was spacious. Upon entering the suite, there is a sitting area with a couch w/ a pull out bed. The couch was not confortable, but we neve really used it. A table and four chairs are also in the sitting area. The bathrooms were spacious for a hotel. Not huge, but double sinks, which was nice with kiddos and lots of towles were left everyday, with quality soaps and toiletries. The sleeping area was also spacious and the beds were comfy. I do wish the comforters were a bit fluffier, as i am used to sleeping with a down comforter and the Breaker's were pretty thin. My other and last complaint, although minimal, is that becasue we had glass doors facing the boardwalk, we could hear some noise at night, if peopel were loud. Usually it was no big deal, but one night sone kids were outside beign extremely loud. Did I mention the view...fabulous. I highly recommend this hotel. We had friends stay at other older, nearby facilities and they were just old and smelly, cheaper, but not the caliber of The Breakers.", "Date": "September 12, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Rooms": "1", "Value": "1", "Location": "1"}, "AuthorLocation": "Maryland", "Title": "“Overrated and Unwelcoming”", "Author": "greenie19", "ReviewID": "UR38538441", "Content": "As I typically book my stays in the larger hotels north of the boardwalk, I will start by saying that it was by last-minute necessity that I booked a standard room at The Breakers. Upon arrival I could understand why at peak season, it was the only hotel with availability. Parking was a hassle and the intersections you must cross on foot to get to the hotel are very busy. The woman at the front desk was rude and did not offer any kind hospitality. It was clear that she did not trust anyone lodging in her hotel, as she explained the strict rules while begrudgingly handing over our room keys. Surely we were welcomed, but rather felt that she were doing us a favor by letting us stay there. The standard room (2 double beds, no view, no balcony) was nicely decorated but not very relaxing. After reading all the rules in the guest services handbook and seeing the warnings regarding particular fines (including a strict no-henna-tattoo policy) the place seemed like a don't-touch museum. As my friend said, there were rules on how to follow the rules. Yes the hotel is clean and the added security of key-access elevators was comforting, but I would not suggest this hotel to anyone I know. And, while I did not take children with me, I would advise families with children to look elsewhere. It is not a kid-friendly atmosphere and the rates could definitely get you a more enjoyable time at another hotel in Ocean City.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "altoona, pa", "Title": "“very clean good location, a little pricey”", "Author": "maxmyamason", "ReviewID": "UR36394833", "Content": "spent three nights here. there is not a cleaner hotel in OC. Not great for kids since there is no outdoor pool. Location is great. I would stay here again", "Date": "August 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Washington, Dc", "Title": "“Nice hotel but over rated”", "Author": "IIIIILoveMyLife", "ReviewID": "UR35526885", "Content": "Nice hotel but we paid way to much for the room we got. The room was really small and the view for the two double bed room was horrible. There was 1 window in the room and we didn't even get a view of the parking lot, not like that woluld have been better but instead we got a view of a grey concrete wall from the hotel next to door. There was only 1 very small indoor pool and no outdoor pool. Overall wasn't bad, but I think I could have got a whole lot more bang for my buck elsewhere.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "WV", "Title": "“Absolutely the BEST! You will not regret selecting this hotel.”", "Author": "ctriplett", "ReviewID": "UR33642370", "Content": "I have stayed in many different hotels in Ocean City over the past 35 years - and I have never seen a hotel which is both close to the boardwalk and pier, and yet incredibly clean and spacious - but, this one is! If you want to be near the boardwalk, and still feel great about your accomodations, then this is the place for you. Beautiful pool, exercise room, stylish room decor, comfortable beds, incredibly clean ,and virtually no noise! The staff was exceptionally friendly. I've read the previous reviews and have no idea what they are talking about, in regards to rudeness - the front desk manager and housekeeping went out of their way to be exceptionally helpful and friendly. Ask anyone who is familiar with Ocean City about how dirty, outdated (and dangerous) most hotels are near the boardwalk - but, not this one. Breakers is clean, spacious, modern, quiet, and secure. It sounds too good to be true, I know - but, trust me - if you stay at Breakers, you will NOT be dissapointed. My only concern is, everyone will find out this is the best hotel in O.C., and I will need to make room reservations years in advance! This is hands-down the absolute BEST, and I will not settle for any others, from now on. Try it, and you will be delighted.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“EXTREMELY RUDE”", "Author": "SL71Pennsylvania", "ReviewID": "UR32976178", "Content": "I will start off with the fact that it is an absolute shame that this place is owned/run by such a rude woman. The building itself is very nice, but as nice as it may be I will NEVER stay there again simply because the owner was so blatantly obnoxious. It was clear that by simply checking in we (my 60+ year old mother and our two family friends) were interrupting her. She was abrassive, and nasty about every single \"normal\" question we asked regarding our stay. At the time I had no idea that she was the owner. I found this out later when I complained to the lady that may have been a manager. That person told me that they were aware of how rude the owner is and that they were sending her to some kind of customer service classes. Clearly by reading the other reviews that never happened, or didn't work. With a Psychology background I would have to say that this person clearly has some issues and should be evaluated/medicated. Seriously do NOT take any chances, don't stay here, it is not worth the stress involved. That is what vacation is for to have fun and escape stress, not fight back the desire to choke someone. Again, such a shame, truly, especially for the poor people who have to put up with her on a daily basis. I can't even imagine!", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Fairfax, VA", "Title": "“Perfect for couples”", "Author": "jasoncarty720", "ReviewID": "UR30829692", "Content": "Booked a standard room for the wife and I at the last minute for Memorial Day weekend and could not be more happy about the entire stay. The location was perfect. Parking was easy and within a block of the hotel. The room was VERY spacious, clean, and well maintained. Service overall was excellent: desk staff was helpful and friendly and maid service was fast and thorough (plus left more than enough fresh towels every day). Mini fridge and microwave were a plus. Bathrooms were clean. Water pressure was very good. Walls were solid, never heard a sound from another room. Indoor pool was above average. Both it and the workout room were a little small, but more than enough for a quick swim or run. Overall I was very pleased and would stay here the next time I want to be on the boardwalk before anywhere else. It's perfect for couples or families. If you plan on packing 6 people in a 4 person room or looking for a place to get loud with people in your room, this isn't the place for you. The elevators require room keys and you can tell they monitor the halls with security cameras. If you are looking for a clean, spacious, newer facility to relax and enjoy the beach without having to experience the vacation with everyone on the floor with you, this is the place.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Nice little getaway!”", "Author": "Lainy0957", "ReviewID": "UR27478680", "Content": "My bf and I stayed at Breakers hotel for one night and a day for change of scenary. For those looking to stay right on the boardwalk with elegant accomadations this is the place for you. The location is perfect with regards to the boardwalk. The hotel all around is very very very clean! The staff was fine. The rooms are beautiful and clean! The mattresses are very comfortable and the sheets are so crisp,comfy and clean! Bathroom was immaculate with lovely tile and lots of towels. As for the \"cameras\", i did not see it as an issue at all. It made me feel safe and they weren't like everywhere, they were at places that were needed and good choice spots. Keep in mind you are on the boardwalk, where the majority of ocean city crime happens and crime does happen especially at night, so for a hotel to go out of there way with a few extra cameras made me feel like they \"care\". The pool is very nice with nice veiws. The dough roller is right there and stays open late so that is very accomodating. I really like that it is a no smoking hotel and they are very strict about that for those like myself who consider themselves allergic to smoke. I love how they have information on what to do on the boardwalk and at OC. I also loved how they had dinner menus for restaurants and info. I was sad to leave. We are thinking about returning for two nights after Easter and considering staying in the ocean front suites which we got to see and are very nice!!!!!! Parking is across the street and there are two handicapped spaces upfront at the building. Loading luggage and parking can become complicated especially during the afternoon and evening when boardwalk is really busy and your party is more then 3. All in All lovely elegant boutique hotel on the boardwalk! We will be returning shortly!", "Date": "April 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Elkridge, Maryland", "Title": "“Great hotel - Staff was great.”", "Author": "redhead76_8", "ReviewID": "UR20092886", "Content": "We arrived at the hotel around 2:35 and checked in right away! We had a Deluxe King Room. Beautiful, with a side balcony to see the Ocean! The staff was very pleasent! No problems all weekend.... We would return to this hotel later in the season! Great stay", "Date": "September 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "md", "Title": "“Rudest staff I ha|ve ever met...owner and manager”", "Author": "paddypud", "ReviewID": "UR20072270", "Content": "Just got back from Bike Week OC and I have to share the best example of how to be the worst owner ,manager and front desk personnel . If you want to be treated like a 5 yr even if you are over 40 this is the place for you. The response and attitude given when asked for clear instructions or directions to the parking was met with a complete and utter tirade on its not that hard and offered nothing other than that....remember you come up an elevator and are all turned around...The hotel itself would rate 5 if it wasn't for the 2 middle aged women who really do a first class act in bringing the entire place down....maybe it was the fact that it was coming to the end of season but I doubt it as having met a least 3 other guests that day who had the same pleasure we had in receiving the WORST/RUDEST service ever......at least they were good at something", "Date": "September 14, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Va", "Title": "“Only good thing about this place is its location”", "Author": "billdeanrocks", "ReviewID": "UR19708865", "Content": "Like my title says the only good thing about this hotel is its location. The rooms were very expensive for what we got, two twin beds. There are cameras everywhere, and they photocopied our drivers licence. Now dont get me wrong Im all for safety but the amount of cameras they have is kinda scary. The Major thing that got me was how rude the managament was towards use. All in all would never stay there again.", "Date": "September 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great stay! Definitely going back!!”", "Author": "wooilovepancakes", "ReviewID": "UR19346621", "Content": "Just came home from a weekend trip to OC and loved it! This was my family's first visit to OC and we agreed we wont stay anywhere else in the future. We arrived to OC around 12:30 in the afternoon and asked for early check-in, as others have mentioned they wouldnt budge and told us the standard check-in was 2:30 pm at the earliest but they gave us our parking pass so we could park for free and start having fun. We headed straight to the beach and enjoyed. The front desk staff were all lovely and very kind and helpful. Our room was big, very clean and had no odor of any kind. The fixtures in the bathroom are very sleek and modern and its huge. Plenty of sink counter/storage space. Shower stayed hot through my entire family bathing one after the other and everyone washing hair, etc. The room has microwave and fridge and a little counter, but we never used them. TV was big and nice table and chairs and dresser and lamps. Beds were very comfy and the pillows were awesome. We all slept very comfortably. I heard not a peep from ppl outside or other rooms nearby. The pool is nice, bigger than appears on the website. Proximity to the beach/boardwalk is awesome. We ate at the Dough Roller, right downstairs more than any other place. The pizza is spectacular, the breakfast is not. The hotel also gives guests a \"water key\" so you can access a faucet in the back of the facility to rinse off all the sand before heading upstairs...it helped a little. We just made it a point to leave all sandy towels,etc in the foyer and not drag it all into the room. Housekeeping was great too. They cleaned while we were out during the day and we came back to a spotless room. Breakers is great and worth the price! TIP: DO NOT EAT AT JONAH AND THE WHALE'S (26th and boardwalk). WE PAID $80 bill for family of 3 for HORRIBLE, COLD, OLD BUFFETT FOOD. It was our only regret of the whole trip.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Falls Church, Virginia", "Title": "“Great Stay at The Breakers”", "Author": "newtrackduq", "ReviewID": "UR18661726", "Content": "My girlfriends and I just enjoyed a great weekend at the Breaker Hotel. The room was very spacious, clean, and beautifully decorated. There was plenty of room for all of us to lounge comfortably and the 4 of us weren’t bumping into each other when getting ready for our nights out on the town. The location was great for going to the beach (because it was right on the boardwalk) but it was far from the Ocean City nightlife. (However it was a quick cab ride to Macky’s, Seacrets, and a 15 minute walk to Party Block). I don’t recommend taking the public shuttle… it was crowded, dirty, and took forever!!! It was a very quiet hotel which is good for family’s or people who don’t want to be near noisy partiers. We got great nights sleep in the comfy beds. The front desk staff was a bit harsh at check in, but they were helpful throughout our stay. We were even able to borrow a DVD player from the front desk at no additional charge. And we even got a second parking spot (we came in 2 cars) for no additional charge… which was really great!! Overall it was a great quality hotel and I would definitely recommend it.", "Date": "August 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Very nice, Very clean”", "Author": "Dacystravels", "ReviewID": "UR18118998", "Content": "For our first family trip to Ocean city we were very pleased. We got to the hotel early, our room wasn't ready until 3 standard. We hit the beach which was steps from the Hotel. When we got our family suite(stayedw-2 adults and 2yr and 5yr old) It was bigger then we expected. The Kids had plenty of room to stretch out in the living room area. Our only complaint was where our room was we heard Delivery trucks every morning and people throwing out trash in the dumpsters at night. Also, they don't have a outdoor pool only inside. I guess that's great with bad weather, but we had perfect sunny days. All and All the place was very clean with updated amenties Shower fixtures, even the toto toliet. I would recommened this place for families and get the family suite.", "Date": "July 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "PA", "Title": "“Well Maintained”", "Author": "Vacation4usPa", "ReviewID": "UR17065205", "Content": "My family and I just got back from a mini vacation at the Breakers Hotel. We stayed in a standard room, two double beds during the week. It was a little pricey, but considering it's peak season at the beach, that was expected. I read the other reviews and have to say that everyone mentioned the parking situation. Yes, it is not easy to find the entrance to the hotel and the parking is screwy. However, no one gave any advice, so to everyone that is thinking of going here, this is the advise. When you get to third street, turn and drive straight like you were headed to the beach. Look to your right. There is a 20 minute parking sign, park THERE! Then when you get out of your vehicle, the entrance to the lobby is straight behind you. When you go through the doors you can only hit to the second floor because you need a key card to access all other floors! If you remember this, the visit will not be as disappointing. The hotel is clean and well maintained. The housekeeping is friendly and staff is also friendly and helpful. The hotel is right above the Dough Roller that serves excellent breakfast in large portions. The access to the beach was great and an easy walk to all entertainment. Overall, it served its purpose well and we enjoyed our stay", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota, USA", "Title": "“Great place, great staff”", "Author": "mntiburon", "ReviewID": "UR16641837", "Content": "After staying here there is nowhere else I'd even consider in Ocean City. The location is great, being on 3rd and the boardwalk. We had an oceanfront suite, which gave us an incredible view of the ocean. It also gave us a view of the interesting people on the boardwalk, providing us hours of entertainment. The room was extremely clean, and the beds were among the most comfortable I've ever felt in a hotel. Staff was extremely helpful with restaurant tips, bus routes, etc. Be sure to take the bus that goes along Baltimore instead of the boardwalk tram. the bus is $2 for the day and comes every 5-10 minutes. Be sure to check out Seacrets on 42nd for good nightlife. They usually have live music on weekend, with every genre of music you can think of. Assateague Island just south of OC is nice if you want to get away from the crowds. Clean sandy beaches, wild horses, and most of all, quiet. And check out Dough Roller on the 1st level of the Breakers. Great food and excellent service!", "Date": "June 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bluemont, VA", "Title": "“Great with kids”", "Author": "kittikatkitty", "ReviewID": "UR14232615", "Content": "We have very small children and we had a wonderful time. It was the first time as a family on a mini vacation. I have a 3 year old son and a 10 month old girl. They don't have cribs but you can rent them and they are set up and ready in your room. I was concerned about our daughter not sleeping in a strange room and crib but to be honest the bathroom was so large we let her sleep in there and our 3 year old never woke her up. We had a standard room because the others were booked. We have already made plans to come back in 2008 and get an upgraded room. It is a great place and location. If you have kids it is great. I don't have any complaints it is the nicest place I have stayed.", "Date": "March 12, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "alexandria", "Title": "“Breakers Hotel/'an awesome hotel”", "Author": "jotay", "ReviewID": "UR10026717", "Content": "Stayed from Thur-Sun 9/27/9/30 in an oceanfront suite and it was great. Large room, furnished very nice, huge bathroom and great shower. Has to be the cleanest place I have ever rented in OC. The hotel and staff were very nice. Great location @ 3rd st and the boardwalk. I highly recommended it.", "Date": "October 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cumberland, MD", "Title": "“Honeymoon Stay”", "Author": "iamkorena", "ReviewID": "UR8706375", "Content": "Our honeymoon stay was perfect because of this hotel. I read all the reviews on this hotel on this website and I'm glad I did. We stayed in the oceanview king room and it was definitely what it advertised. The room was clean, the bedding was super comfortable, and the attention to little details made it a great place to sleep. The only difficult part of our stay was actually figuring out where to go in the hotel. It's a little hidden entrance and the parking is down the next street but we arrived at night so I definitely suggest arriving during the day. We pool was very nice as well....it was indoor and the room heated so very refreshing when we needed something other than salt water. I was worried about the noise level but we both slept the best we ever had in a hotel. The convience to the beginning of the boardwalk and food was perfect. I would definitely recommend this hotel and the price makes it even better!", "Date": "September 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Little Egg Harbor", "Title": "“Great Location / Great Hotel”", "Author": "cabkab00", "ReviewID": "UR8687213", "Content": "My husband and I stayed in the Oceanfront Suite and what a choice we made. The balcony was spacious and the view was wonderful. The room was very clean and big. The hotel itself was small, quaint & quiet. Thats the perfect spot for us. Location on the boardwalk was great. Parking was a little confusing when 1st got there to check in, but they have a lot a block away which was fine. Will definitely be back to visit at this hotel again. Actually thinking of bringing the whole family next time. Would recommend the Oceanfront Suite to anyone!!! Ocean City is a great family town", "Date": "September 10, 2007"}], "HotelInfo": {"Name": "The Breakers Hotel", "HotelURL": "/ShowUserReviews-g41298-d627004-Reviews-The_Breakers_Hotel-Ocean_City_Maryland.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3rd Street &amp; Boardwalk</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21843 </span></span> </span></span></address>", "HotelID": "627004", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/40/a1/the-breakers-hotel-thumbnail.jpg"}}