{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "seattle", "Title": "“Free Internet and friendly staff”", "Author": "BerneseMtDog", "ReviewID": "UR108334588", "Content": "I'm no expert on hotels in Hong Kong. My only other hotel was the Sky City Marriott which cost 50% more. If you're counting your nickles and dimes this hotel might be the place to stay. But, for me, I will probably spend more if I have to go to Hong Kong again. I did appreciate the staff and the free Internet. I didn't appreciate the lack of cleanliness. Not having stayed at other hotels in the same price range I can't say what it's standing is in comparison to other hotels in the same price range.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Reasonable & practical accommodations”", "Author": "arahbaby", "ReviewID": "UR72268349", "Content": "3 things I look for in a hotel: Location, Accommodations and Price. In paper, the hotel was a good choice. It's one station away from Central (Sheng Wan) and its near the Wholesale Market if you're into trying different local foods. However, it was a long walk going to the MTR station (around 20mins). It took us forever to find it on our first night. I thought by the 2nd night, we'll get the hang of it, but still we got lost and just took a taxi from the station. Same story on the 3rd night. Accommodations were fairly typical of any HK apartment/room. Very small but the space is maximized. The room was equipped with ref, blower, hot water and cups for coffee, complete set of toiletries, complimentary water bottle daily,TV with cable. I definitely got a good bargain per night because I only got it for less than US$40. If you're just looking for a place to sleep in, you can definitely bunk here. But not for those who prefer high quality service during vacations.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Malaysia", "Title": "“Small room without working desk but FREE Internet,Friendly Staff”", "Author": "icarolyap", "ReviewID": "UR67356281", "Content": "Very small room without working desk, I need to work with my laptop on the bed but FREE internet (Most of the hotels in HK dont give Free Internet)and local call.For price HKD400++ per night,don't expect much for the room.You have to carry the luggage to the room by yourself.Near to tram,easy to get taxi and buses.Many nice local food restaurant along the street .Not near to MTR.Must try the restaurant of the hotel,food is delicious.If you want to experience local living style in Hong Kong,this is a place near neighborhood.Not recommended for family with kids because room with not much space.Everything is small in the room,its about 120sqft.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "mumbai", "Title": "“Very Good hotel”", "Author": "ishanshah11", "ReviewID": "UR58917106", "Content": "this is just an amazing hotel. the best n a very economical place to stay in hongkong.. get the best fares online..", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Hong Kong / Columbus, OH", "Title": "“budget price, great service, all that you need”", "Author": "izuj", "ReviewID": "UR39736498", "Content": "I haven't stayed here yet but I'm doing some research on accommodations for my 6'4\" friend for budget living (two weeks) in HK. I've been searching all over the place for things within his budget during peak season (October has lots of fairs going on so hotels get packed and charge an arm, a leg and your neck cuz they can).. stopped by the place a random night after calling and asking about specials for bi-weekly rates. was greeted by a girl who kinda lacked the 'hi, welcome to bridal tea house' kinda attitude, but her supervisor was A LOT of help. they let me see a room, which, knowingly was small, but kinda old (think of a holiday inn on your average american random highway)... pretty clean.. but since i saw very nice pictures on their website, asked the supervisor about it... she helped me check other BTHes to see if they had any rooms, and whether the size of the rooms would work out.. Once you see the elevators (aka lifts in HK) you'll get an idea of the size of the rooms.. you've got all you need there though, and if you're planning on doing a lot of partying anyway, this'll be a good choice (cuz it's nice on the wallet). might not recommend shopping until the later end of your trip, as you might not have much space to place what you got in the room.. Location wise it's not too bad. as it mentions you've got lots of buses, minibuses, the tram and such to get to and from.. the area has a mix of old HK and new HK, so you've got your fair share of fast foods but also congee breakfast places too.. did see an old school grocery store though when i was there, that was pretty cool. Mind you i speak the language so it might have helped; they are willing to help as long as you tell them what you need, and also be understanding as it is a budget place.. i must say they did go out of their way to help me out though.. i also checked out the BTH in Aberdeen.. will be writing up a review shortly.. I'll be checking out the one in Ap Lei Chau tonight, so I could probably write up another one too. : )", "Date": "September 4, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Ok but not the greatest”", "Author": "mshk7890", "ReviewID": "UR22495736", "Content": "We stayed at the Bridal tea house at Hung Hom for 17 days btw Nov to Dec 2008. The room was spacious and adequately equipped with fridge and hairdryer. However we encountered a number of hassles during our stay. The sound proofing of the rooms suck which means you can basically hear everything that goes on in the next room or out in the hallway. A few idiots smoked in the hallway and in hotel rooms (apparently a common practice for the usual customers who stay in this hotel) and had to threaten to call the fire department because of the closed air circulation within the hotel rooms. The hotel has a policy to not change the cups/glasses in the room due to health and safety concerns for the cleaners. The rooms are reasonably clean although some sheets were stained. Front desk and kitchen staff are not the friendliest although some are ok. Great location, reasonable prices. Maybe the place for you if you choose to stay out of your hotel room for the most part of your trip.", "Date": "December 6, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Stayed Here Again - Still a good place”", "Author": "admybf", "ReviewID": "UR18007279", "Content": "Stayed here again (last here in May) and still highly recommend it. Good restaurant on main floor, rooms are small but adequate. Hotel rates are great (550 HKD), and the location is good. One block to trams, two blocks to airport express bus.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Good clean but cheap accommodation”", "Author": "mrbenn78", "ReviewID": "UR17484838", "Content": "We stayed here for three nights at the start of our trip to HK and China and were not disappointed. We were looking cheap accommodation that was clean and in a fairly central location and this place did all of these things. The room was very small and fairly basic, but we were expecting this so it was not a problem. The bed was comfy and while we could hear a fair amount of street noise, the windows did a reasonable job at keeping this to a minimum and I didn't find that it disturbed me too much. The hotel is a good 15-20 minute walk from a metro station, but very close to a tram stop and a stop for one of the airport bus routes. In summary, if you are looking for simple, clean accommodation at a reasonable price then based on our experience this place is well worth considering.", "Date": "July 3, 2008"}], "HotelInfo": {"Name": "Bridal Tea House Hotel (Western District)", "HotelURL": "/ShowUserReviews-g294217-d627798-Reviews-Bridal_Tea_House_Hotel_Western_District-Hong_Kong.html", "Price": "$85 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.385-387 Queen's Road West, Sai Ying Pun</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "627798", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/65/d0/bc/western-district-branch.jpg"}}