{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellevue, Washington, USA", "Title": "“Great hotel in Dubai”", "Author": "Jeanne J", "ReviewID": "UR123982365", "Content": "The XVA Hotel was perfect for us, in a newly rebuilt \"old town\" area, within walking distance of many attractions as well as convenient to the subway, and quietly serene and cool after a hot day of touring. Our room was off the second courtyard, beautifully decorated in a traditional-style building. Breakfast was served in the first courtyard and was delicious. The desk staff was extremely helpful in providing information and directions to subway, sights, and taxis. The hotel held our luggage on the last day and provided facilities for showers before we headed to the airport for a very late flight.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“The only hotel charme experience in Dubai!”", "Author": "aprivite", "ReviewID": "UR123722400", "Content": "We stayed 3 night in a deluxe suite, check in 22 Jan 2012.... simply perfect! It's also true that this is a charme hotel, so please Stupid people that rated very low this place .... Write on google Charme Hotel. Next time book a business Hotel or if you are so rich go to burj Al Arab!?!? XVA is located in the only and last old part of Dubai, very close to river and creek, but in a very quite spot. Breakfast is simple and fresh done. Staff smiling and polite. We stayed in room 1 but in general all the rooms are not so big due to the old building that was born hundreds year ago not to be an hotel. If you are a traveller book this Hotel, if you are a turist....", "Date": "January 28, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Not worth the money”", "Author": "Jeremy G", "ReviewID": "UR123200885", "Content": "Pretty expensive place for little value. The rooms are small and quirky, which is cool, but they WAY overcharge for it. For over $250 USD a night my first room had no hot water, then I changed rooms and the sink didn't have hot water. It was later fixed, but the staff was a little inexperienced and generally were not overly customer service orientated. When we checked in we were just taken to our room with no explanation of the hotel. For the prices they are charging, they need to get their act together. The neighborhood is cool, unique, and the hotel could be a very nice boutique hotel- but they need to drop their prices significantly. I don't recommend it unless you get the price down to about $150 USD.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Tranquility and great service”", "Author": "Jos689", "ReviewID": "UR122863782", "Content": "We arrived in Dubai very early in the morning and were lucky to find a parking lot just around the corner (on weekends, parking may be an issues, we felt). The hotel's location is perfect to discover Bur Dubai and Deira. We were pleasantly surprised that our room was already avalable ro check in. The room (deluxe) was located next to the courtyard which we first thought might be noisy at night, but it wasn't at all. The room was clean and well furnished. Breakfast was small but tasty, and the lemon mint juice just great. The highlight of our stay was a cruise on the Dubai Creek on a dhow owned by the hotel that we booked for celebrating a visiting friend's birthday. The cruise was perfectly arranged by the hotel staff, with dinner aboard including a birthday cake. It was just plain fun to cruise along with four people on a dhow that could easily accomodate 20 passengers. Thank you, Salim!", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris, France", "Title": "“Fantastic Cafe”", "Author": "mconcas", "ReviewID": "UR121845638", "Content": "I have been at the XVA Cafe, excellent! Best service ever, sumptuous eggplant burger and mint lemonade!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Traditional wind tower architecture - loved this hotel!”", "Author": "Ginnie H", "ReviewID": "UR121716543", "Content": "Read about XVA in LP and stayed for almost 2 weeks. Deluxe room was wonderful - well stocked, spotless and huge bathroom! Central courtyard and private patios were so peaceful. Location could not be beat - in Bastakia Quarter, close to Creek/abras, souq's, museum, restaurants, metro, airport and 24/7 supermarket for last minute needs. Everyone working here was super friendly and helpful in every way. I had vegetarian breakfast everyday and mojardara (rice and lentils with yogurt on the side) for lunch was delicious. Best mint lemonades in town. Would definitely stay here again. Do your research - no TV, no alcohol, no beach if you need those amenities. But, if you want to stay in the heart of the city, engage in some of the traditional culture/art/history and hear the call to prayer, I would highly recommend this hotel.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great place to be in!”", "Author": "mattSingapore", "ReviewID": "UR121702920", "Content": "Stayed 3 nights at XVA and I am impressed by the hospitality I got in this place. Quietly hidden in the Bastakia Quarter, this private and quiet place is definitely one of the best place to stay in Dubai. Staff here are friendly to recommend places to visit, helping out in getting to Metro stations and the right buses to the right destination, and not forgetting the awesome food that the XVA cafe serves. Will definitely go back again if I visit Dubai. MEMORABLE.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“Not the traditional Dubai hotel - was great”", "Author": "Janice B", "ReviewID": "UR121542175", "Content": "Lovely little B&B in the old town. Its not a serviced hotel with all the facilities but it is lovely if you like art and things that are just that little bit different. The staff are helpful if you ask but they don't intrude or bother you. The lady I spoke to rang my pre-booked taxi company for me and confirmed my pick up which was really helpful. It is a bit hard to find when you arrive but the hotel emailed me a map and the taxi driver found it using the map. Breakfast is quite basic but tasty and in chilled out surroundings. I would definitely stay there again -its not cheap but its not over the top expensive either. My room was nice, authentic doors and art on the walls. Would recommend this hotel but be aware that it is an art hotel and not the usual massive Dubia chain hotels.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hobart", "Title": "“Something different in Dubai”", "Author": "Robyn B", "ReviewID": "UR119542777", "Content": "I spent 2 nights of a Dubai stopover in Room 2 at the XVA. The hotel was recommended by a local and proved to be a unique property in a great location. Nearby were galleries, interesting shops, museums and of course the Creek. I woke each morning to the call to prayer from the 2 nearby mosques. Other reviewers are right - the staff are a real plus - always friendly and eager to please. I enjoyed the middle-eastern breakfast with real OJ and fresh fruit. With so few rooms I felt like the only guest. Indeed I only saw a few people in my wanderings along the maze of fascinating laneways surrounding this intriguing hotel.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuala Lumpur", "Title": "“A quiet corner of Dubai....”", "Author": "FennKualaLumpur", "ReviewID": "UR119071175", "Content": "There have been many positive reviews of this hotel, so there is little more I can add. I wanted to avoid the steel and glass, so for me this was a perfect location to break my journey for a couple of nights. The staff at the hotel were very helpful and room number 3, upstairs, was not large but adequate and comfortable. I loved the breakfast of freshly squeezed orange juice, fruit and yoghurt, pita bread with labneh, pancake or omelette and coffee. A lovely place to escape the heat of the day and wifi worked very well. I enjoyed walking around the Bastakiya area in the evening and happened upon a group of local gentlemen from Majlis Alareesh - Albastakiya and enjoyed a chat with them and a glass of tea. There are a couple of HIndu temples nearby, but are hard to find as they perforce have to be inconspicuous and are small. Am sure they are not enough for the large Hindu population working in Dubai, but all they are allowed. There was also a Sikh Gurdwara and another place within walking distance for Hare Krishna followers. Their day for prayers is Friday, as it is their day off from work. I would recommend this boutique hotel to anyone wanting peace and quiet. There is another small boutique hotel/restaurant, a few shops and restaurants, but most of the Bastakiya area seems deserted, but it could be due to the time of year.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Charming B&B style guesthouse”", "Author": "poh_11", "ReviewID": "UR118973263", "Content": "We stayed at the XVA for two nights - arriving at 2am and there was someone still up waiting to check us in. The room was just perfect and full of charm, just like the hotel itself. The breakfast was included but it was nothing to write home about! It was lovely waking to the call to prayer from the local mosques - something you just wouldn't get if you stayed in one of the hotels in the modern Dubai. I would certainly recommend this hotel to anyone who is interested in staying in a small B&B type hotel full of character.", "Date": "October 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Beijing, China", "Title": "“Quite a nice experience”", "Author": "Lila_Liu", "ReviewID": "UR117392625", "Content": "We stayed there for two nights and just loved it. The staff were so friendly and helpful, which is a big plus to the hotel. The hotel is just like the name, very artistic and unique. Location wise, it is one of the best if you wanna enjoy the old Dubai. Will definitely come back if I visit Dubai again.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Something really special”", "Author": "bluelionesse", "ReviewID": "UR116432235", "Content": "We live in the UAE and often stay at 4 and 5 star hotels, but we fancied a change for this weekend. We were absolutely delighted with this hotel, lots of character, and watching the light fade as we gazed from the rooftops at the windtowers was unforgettable. Would describe it as equivalent to a very upmarket b&b in a period building in our native Scotland. The room was small but perfectly formed, with some lovely coffee table books to leaf through. Location wise it was perfect, very near to the creek and the wonderful abras and ferries. Breakfast was freshly cooked and wonderful, staff were great too. Will definately go back!", "Date": "August 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Authentic”", "Author": "Hiiragi", "ReviewID": "UR116127947", "Content": "Great little art hotel in a building full of character, beautifully restored with some quirky modern art touches. Lovely staff, friendly, helpful and attentive without being obtrusive. Prefer location if you'd like to explore the old authentic parts of town and the arts quarter. Hope I can go back again!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Beijing, China", "Title": "“A great place for honeymoon couple”", "Author": "CHEEKY45", "ReviewID": "UR115961138", "Content": "The service was customised and I felt I was taken care with great care. I love the huge bathroom which the space made me feel like a princess walking in an ancient holiday palace.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Exotic old Dubai with excellent service”", "Author": "gypsy074", "ReviewID": "UR115839051", "Content": "This romantic, atmospheric boutique hotle is a gem. Three times in my five years living in Dubai my friends have sayed at this establishment. If you are looking for a change from the same glass constructions that comprise international hotels this reconstuction in the old quarter is for you. Five minutes walk through the souk to the abra and you are across the creek. Ten minutes in a taxi and you can be standing outside Dubai mall and the world's tallest building. Rooms are clean, service is excellent and the staff will do everything to ensure you explore and enjoy your stay. A little piece of old Arabia that comes highly recommended without the huge prices .", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Delightfully renovated old world traditional boutique residence”", "Author": "bruce019", "ReviewID": "UR115783444", "Content": "situated in old dubai, this small hotel is everything we expected a traditional arabic residence should lappear-rooms around a central courtyard, insulated from the city noise just outside the front entrance. A bit hard to find for first time visitors but worth the effort. Staff were very obliging and happy to accomodate early check-in requirement", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "St Kilda, Australia", "Title": "“Loved it -- but it ain’t for everyone.”", "Author": "SmilingKodiak", "ReviewID": "UR115746623", "Content": "We loved this place, but have to say it ain’t for everyone. The location is inspired, in the ancient part of the world’s newest city. I can see how it could be difficult to find, but if you follow the directions through the ancient maze (or check it out on Google Maps first), the rewards will be yours. The building itself is a warren within a maze. Our spacious quarters (Room 6, I think) were cobbled together from three rooms connected by four foot-high doors, booby-trapped with half-steps. Yet, somehow it worked, and we neither stubbed a toe nor bumped our heads. Best was that the hotel owns it own dhow, a comfortable spruced-up 12-metre barge. We got a private dinner and two-hour cruise (just the two of us) on Dubai Creek at sunset. Magic. And at about $125, a bargain. Drawbacks: the free wifi works only in the public areas, parts of which are not air conditioned, and can be unbearably hot. The staff was pleasant and helpful, 24 hours a day. It IS an art gallery, and the art adds to the experience. Like any artwork, it isn’t for everybody. But it is a great place for new perspective on the ancient Dubai.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "China", "Title": "“Bait and switch, ugly service experience”", "Author": "Moelstrom", "ReviewID": "UR108260880", "Content": "God I was bitter at my experience with this hotel. I was coming out of Afghanistan and seeing my wife for the first time in months, so wanted our first night in Dubai to be special. I researched the heck out of the hotels available and selected the xva based on it's charm and the lovely rooms shown on the website. Further research in lonely planet told me should get room number one. I booked, received my confirmation, and printed it out. Under \"room\" it listed \"room number one.\" So imagine my surprise when we arrived (and wre met by a charming and hard working Filipino steward) and we led to a shabby closet not big enough to turn around in. \"I think ther has been a mistake,\" I said, cheerfully extracting my printed confirmation. \"we are in room number one.\". The poor Filipino guy, looks at the confirmation, says, hmm, yes, so it seems. But unfortunately room number one is more expensive than the rate you paid. \"well, that makes sense,\" i said, \"as I booked online months ago and the rate available then was lower than the rack rate tonight.\" \"Yes, but I cannot give you room number one for that price,\" he said. \"this rate is the small room price.\". I pointed out that my confirmation from the hotel stated clearly, \"room number on, a spacious standard suite.\". In addition to not being room number one, the closet he had shown us to was in no way a suite. Maybe ten square meters. Maybe. My reaction, through gritted teeth, was to tell him to call his supervisor. This guy told me the website made a mistake! I pointed out that the website WAS HIS HOTEL'S OWN WEBSITE. The Filipino guy had me walk through on the HOTEL'S computer how I booked this room for this rate (about a hundred bucks less than the rack rate for room one.) we managed to repeat the results the and then. Let's note that I was at that point exhausted, frustrated, had traveled by helicopter, MRAP, (late) charter aircraft and then taxi for a total of 14 hours. I had totally disappointed my wife, and instead of enjoying be out of a war zone I was arguing with a hotel clerk. The Filipino guy told me that room one was infect empty, but the manager would not let us stay the since we had paid such a low rate. You can imagine how I felt about this. On the phone with the manager, he confirmed that if we paid a charge to top up what we had paid to the rack rate for room one, we could stay there. He said he did not understand why the website had given me that rate for that room, but the price was wrong so I should either pay more money or stay in the closet. It was late so we stayed in the closet. The next morning the manager showed up at the hotel. I told him of my great dissatisfaction and he was thoroughly unconcerned. He said that what i had been accommodated in was a \"standard suite\" and that the term \"suite\" was accurate since xva is a boutique hotel (!). He said that I was never promised room number one, and that the website had assigned that room in error, which was not the HOTEL'S fault. Room one sat empty during our stay. Elegant lobby, nice cafe I guess, but I have never been so rudely stiffed by a hotel in the last 20 years. I am still angry 3 months later and am comforted only by the fact that with this review,I might spare other traveler's my disappointment and victimization. A final point: even if your service experience were far more satisfying, there is no getting around the fact that the xva has one or two showcase rooms that feature prominently in their website, the lonely planet reviews, and the Conde Nast article. The rest of the rooms are tiny and inferior, and, as my experience shows, you have no protection from being shoehorned into one. Avoid this manipulative cave.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Lousy to stay, OK to visit”", "Author": "WaleedShaalan", "ReviewID": "UR107672171", "Content": "Room 7 they rent it as deluxe, it has no windows. Room 2 noisy ac, bathroom poorly ventilated and smells like urine, stale sheets and lots of bugs. The management arrogant and greedy, charged us for the extra night we booked and refused refund even though we cancelled and downgraded. The place used to be charming a few years ago, but now absolutely not worth it.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“How to feel like an individual in Dubai”", "Author": "DominiqueMelbourne", "ReviewID": "UR105171588", "Content": "This place was just perfect for us. We just didn't want to stay in one of the big glass towers that Dubai has become known for. For me they are impersonal. XVA is the ideal solution for anyone wanting to expereience a different side of Dubai. Not only does the hotel offer a point of difference but they also have a cache of individual experiences to recommend for the adventurous. We loved our private desert safari and only wished we had another night to take up the opportunity of the private dhow dinner cruise. The staff were fabulous and we were lucky to be given access to our room on our early morning arrival. Breakfast is more than you can eat and my only criticism is that I would have liked the room to be bigger (room 2) but it was great being upstairs and having the balcony to step out on to and relax with a book while swinging in the cane chair. I would not have swapped it for a bigger room downstairs.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Al Ain, United Arab Emirates", "Title": "“Peaceful retreat”", "Author": "mona-isabella", "ReviewID": "UR100486944", "Content": "This place was absolutely perfect for me & I was soooo happy to have found it. I would call it a guest house vs a boutique hotel. I came to relax & recharge my batteries, and also get a bit of a culture fix. Stayed in room #5, the Sweet Suite, which has apparently been much improved in the last couple of years. I found it filled with charming, quirky, funky art. The single bed had a decently thick & firm mattress......and I usually have back problems, but felt fine in the morning. I appreciated having art magazines & catalogs on the nightstand, as well as a CD/cassette player in the closet. Didn't miss TV, 'cause that's not my thing when traveling..... later saw that there are these cute little sitting rooms (majilis?) off the cafe courtyard, one of them had a TV. There was also a usable mini-fridge, half-filled with snacks & drinks for purchase. Also had a hot pot w/ complimentary coffe & tea. You do need to watch your head when walking through the low doorways, more difficult if you're over 6 ft tall. Staff was courteous, friendly, and professional. I called when I couldn't find the place, and a staff person walked over to meet me. I was nearby, but it seems like a maze of alleyways when you 1st get there. I loved waking up to the sounds of birds chirping outside my room with the sun streaming through the upper windows. XVA has a bit of a low key, rustic feel to it.......so if you're into luxury, pampering, or need fawning attention from staff, this is not the place for you. The breakfast was cooked up fresh when I was ready. Lovely presentation, fresh, healthy, and filling. decent coffee too. Jazz playing softly while I ate---perfect ambience. You can walk to the Dubai museum, the Basta Art Cafe, & the Dubai Creek in only a few minutes..... so it's a good location if you came without a car like I did. Yes the taxi drivers do seem to have a hard time finding it...... tell them to let you off in front of the Basta Art cafe, down the street from the Dubai Museum. Then walk down the alleys til you get there. I already booked another stay for my birthday.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "mid-Atlantic", "Title": "“Unusual and magical”", "Author": "rcepuch", "ReviewID": "UR98841421", "Content": "Combine an art gallery with a laid-back courtyard restaurant and add some comfy guestrooms on the second floor and you've got XVA, a fascinating place located in the quiet, artsy Bastakaiya neighborhood – near the Creek and the Dubai Museum, not far from the souqs, and close enough to the Grand Mosque that you can't miss the 5x daily calls to prayer (not that you'd want to; the sounds are mesmerizing). The staff seems a little stretched at times because they wear so many hats, but they get the job(s) done. It's a pleasure to sit on the balcony outside your room and surf the web using the free wi-fi. We took advantage of the hotel's offer to organize a dhow dinner cruise on the Creek and it was a superb experience. The dinner, prepared by the hotel, was very good and included a plate of hummus with a smiley face made from vegetables – a great touch. Rooms are very comfortable, but doors to bathrooms are extremely small and anyone over 5 feet tall will probably need to duck. Overall, a wonderful choice with plenty of personality. I'd go there again in a heartbeat.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Abu Dhabi", "Title": "“A Nice Change of Pace for Dubai”", "Author": "NGF34", "ReviewID": "UR98192132", "Content": "A real gem in the heart of old Dubai - definitely worth visiting for night and checking out the surrounding area. Walked around the Creek and felt like I was on holiday in India which added to the experience. A little pricey compared to other hotels in Dubai but you are paying for the experience and staying in a such a unique area of Dubai.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Unique surroundings, friendly staff, ideal location”", "Author": "Greg-of-Arabia", "ReviewID": "UR61172987", "Content": "My ex shared a room with my daughter and I shared a room with my son. Both 14, our twins enjoyed the rooms and so did my ex and I. The furnishing were excellent - and the presence of a tailor who is making a copy of one of the bedspreads for us - added to the unique benefits of this small hotel. The only real criticism of the accommodation was the lack of windows in Room #7. However, Room #1 (upstairs) was amazing! .The menu was vegetarian and quite limited. The omlettes were good, if a little small. The art that is a feature throughout the hotel was sometimes fascinating and sometimes 'challenging' - but overall it added to the quirky and interesting atmosphere that was all pervasive through the hotel. Nestled in the heart of the historical, restored Bastakiyah area of Dubai, this hotel represents excellent value for money and an ideal base for exploring the city - old and new.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Zealand", "Title": "“Oasis from the crowds”", "Author": "charlieNewZealand", "ReviewID": "UR57224591", "Content": "My stay at XVA was great. XVA is situated within walking distance of all the old town sites,and close to the creek . It was good being able to pop back to my cool room frequently during the day to cool off . I would throughly recommend XVA to travellers who don't enjoy the glass tower style of hotel and prefer something in a traditional style,with friendly helpful staff.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UAE", "Title": "“Unique”", "Author": "ttatlarge", "ReviewID": "UR55955047", "Content": "This place is wonderfully unique, and in a tiny area of Dubai that feels like a world apart from the craziness of excess elsewhere. Located upstairs from an art gallery, in a kind of open air terrace, there are several small guest rooms overlooking the gallery courtyard/cafe. It did feel a bit odd walking into a courtyard art gallery with suitcases, as there is no clear reception, but it's a relief after staying at other soulless chain hotels in the middle east. Don't expect swimming pools, hotel amenities, etc, you come here for the charm and uniqueness of the place. It is right next to what must be the loudest azzan (call to prayer) at 5.00am, so be prepared. Very cool place, and would highly recommend it to people looking for something a little different.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sussex", "Title": "“Fabulous place”", "Author": "JanetFSussex", "ReviewID": "UR53507379", "Content": "We stayed at this very unusual but lovely hotel in the old town of Dubai. It's very quirky! It is set around 2 courtyards and very Arabic. They have art exhibitions there so it's very interesting. The rooms are very clean but small although we had a little sitting area as well which helps and breakfast is taken in the courtyard. Very different but definately worth a stay.", "Date": "January 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Abu Dhabi", "Title": "“Underwhelming and poorly represented”", "Author": "sabudhab", "ReviewID": "UR27452152", "Content": "After a great personal recommendation from a friend and cross referencing on the XVA website and Conde Naste, I was so excited when I reserved at this chic artistic oasis in Dubai. The room in which we stayed is no where to be found on the website, was anything but chic, the bed was woefully uncomfortable, the decor included a dusty faded bouquet of artificial flowers, fleece blankets used to cover old furniture, an assortment of worn rag throw rugs, and thread bare towels. Was not at all what I had anticipated after such glowing reviews. Am not the kind of person to like to stay in mainstream hotels, but this experience makes them more tempting if just to know what to anticipate. Disappointed.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“more than ideal”", "Author": "phlbll", "ReviewID": "UR26040047", "Content": "I read through all the comments, and i was astounded!! Those who rated XVA anything under a 4 star obviously don't know how to appreciate quality, art, style and a little bit of something different from the conventional hotel. XVA is anything but your average hotel. The staff are courteous and the service is remarkable! The location, though not situated by the beach is in the historic area of Dubai and provides tourists and businessmen with somewhat of a retreat from the glaring tourism in Dubai. The cost of rooms is well worth the experience or even under priced.. which you will definitely never forget and will want to keep coming back, or never leave! My only complaint would be that the rooms be just slightly larger, but don't get me wrong it does not affect much... The food is exquisite and the owner gorgeous!! I recommend this gem to anyone, whenever and for whatever reason!", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bangkok", "Title": "“coolest place I have ever stayed!!!”", "Author": "lordkenyon", "ReviewID": "UR25980469", "Content": "Wow! I love the Arabic with a twist style of this place. The staff became my friends. Really wanted to stay longer but the place was fully booked. Advice, book ahead. Have lunch here if you can. You should check out the gallery and have dinner with a movie in the courtyard under the stars. I read about it in Wallpaper guide. Anyone who criticizes does not get it!!!!! BYOB", "Date": "March 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Zurich / Switzerland", "Title": "“Charming hostel/ bed and breakfast, but not a boutique hotel”", "Author": "maddog2000", "ReviewID": "UR22579265", "Content": "This is a very charming property, no questions asked. But by no means is this a boutique hotel, there is no reception or hotel staff - once the gallery/ cafe closes at 7pm (or for the weekend) guests are left to themselves. Do not expect the usual hotel amenities. The staff is very charming, but not terribly professional (e.g. we were checking out on a Friday when nobody is on site, so we had to settle our bill during breakfast on Thursday morning, before a first coffee...) The rooms are terribly small (we were in room 3 which according to a plan that was available was 10m2) and presented in charming but very home made style. Bath room is very basic, no shower curtain. The house complex consisting of the gallery, cafe and hotel is impressive and the location is great. However, there is no parking available (we were trying to find a parking space for almost an hour on a Thursday night at 11pm...). I was a bit surprised to find this hotel recommended in both the Luxe Guide and the Wallpaper City Guide - this is definitely not the type of hotel that you would normally expect to find in these guides. I have to say, the hotel did not really live up to my expectations, particularly with prices charged.", "Date": "December 9, 2008"}], "HotelInfo": {"Name": "XVA Hotel", "HotelURL": "/ShowUserReviews-g295424-d629175-Reviews-XVA_Hotel-Dubai.html", "Price": "$54 - $261*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Bastakiya</span> | <span class=\"extended-address\">P.O. Box 37304</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "629175", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/97/74/97745dce3942a410a49003f766999bff1large.jpg"}}