{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Compact, well equipped room in a great location”", "Author": "Mitch231", "ReviewID": "UR122117502", "Content": "This hotel is very close the Piazza San Marco and many of the main attractions. If you're not looking for The Ritz, but want a place that's clean, good value and well located, I'd recommend this hotel. My wife and I stayed at Locanda Antico Casin for three nights in late December 2011. The room we had was quite small, but the space was very well organised. It was essentially a bedroom with a small breakfast table, a large cupboard/wardrobe with an inset fridge, and a double bed. The main room also had a TV, skylight and aircon. The bathroom is tiny but modern and equipped with a hair dryer, a shower head with good water pressure and heated towel rails. The breakfasts were simple - coffee (you chose which style of coffee the morning before), juice, toasts, spreads, croissants etc. We could hear the couple in the room next to us talking and using the bathroom so our sleep quality could have been better.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“Nice, clean and in the middle of the historic center.”", "Author": "Charlie_q_PR", "ReviewID": "UR121451215", "Content": "If you stay there you are a few steps form the San Marcos Square. The staff is very friendly, specially the owners. I recomend these place, why to throw money in expensives hotel outside the center of the city? Belive me its worth the money. CQC Puero Rico", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Southbury CT", "Title": "“Great quiet location, but near vaporetto stop”", "Author": "teacher017", "ReviewID": "UR120335351", "Content": "This small hotel is located near the San Marco Vallaresso vaporetto stop in a quiet area. The host is helpful, but ill-advised us regarding a non-existing train strike, so we missed our scheduled train to Bologna. He allowed us to store luggage both before and after our one night stay. A small European breakfast is served in the room. We had an ensuite bathroom, but not all rooms did. Venice is expensive. The one night stay was $175.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashland, Oregon", "Title": "“Amazing location!”", "Author": "travelingbella", "ReviewID": "UR119150796", "Content": "My husband and I stayed here for 3 nights and would stay again! The location is unbelievable; it is tucked away on this quiet little street/alley less than a 1 minute walk from San Marco Piazza (St. Mark's). We were never bothered by any noise and always felt safe walking to/from our place and walking around. The bed was big and comfy (which had not been the case at our previous 3 places); plenty of room to hang clothes and unpack; we had room #2. The bathroom was spacious and clean and modern. As the website indicates, the front desk is only staffed until 1pm, but we did not have any issues with it. The staff were very friendly and helpful; spoke English. Breakfast is a typical Italian breakfast of croissant, toast, juice and you can request what kind of caffe you'd like. We supplemented with some yogurt and fruit that we bought at a market. This place really is a gem of a find in Venice! I still can't believe how wonderful the location was!", "Date": "October 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice place to stay in Venice”", "Author": "helenesmajl", "ReviewID": "UR117027939", "Content": "This hotel is quite hard to find but in a superb location just a block from San Marco Square. The rooms are compact but cleans and stylish. Not for the persons who have problems walking up stairs. Staff extremely helpful. It was a pleasure staying here.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good hotel, excellent location”", "Author": "steamy74", "ReviewID": "UR116337324", "Content": "We enjoyed our stay at the Locanda Antico Casin. It is in an excellent location, literally 100 yards from St Marks Square and therefore the prices are excellent in comparison to other accommodation options in the nearby area. The hotel was clean and beautifully decorated. The breakfast terrace was very nice and the staff were very friendly and helpful. Finding the hotel could be a problem if you haven't done your research, but if you check the directions and location in advance it shouldn't be too much of an issue. Also, the hotel does not have 24 hour staff coverage and you gain entry by entering a code into a keypad. Therefore if you are arriving late request the entry code before you leave to avoid any problems on arrival. We did not do this and had to phone the owner when we reached the hotel. It was not a big problem as the owner answered straight away and provided the code, but it is probably easier to get the code in advance. The only problem we had was the size of the room. It was basically a bed, a wardrobe and very little space in between. If only travelling with luggage for the weekend it would not be a problem, but as we were visiting Italy for 15 days we were a bit short of space. I understand that some of the other rooms are a bit larger, therefore maybe you could request one of these when booking (we were in room 3). However, we only spent a very small amount of time in the room so it was not a major issue. Afterall, who goes to Venice to spend time in their hotel room! On the whole it was a very good choice that I would recommend to other travellers.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "london", "Title": "“Great location and value for money”", "Author": "ccurran2000", "ReviewID": "UR115861255", "Content": "After booking this hotel we were concerned about the negative reviews of travellers having issues with bookings. We contacted the hotel and they promptly responded confirming our reservation and explaining the issue, which has now been fully resolved. The room was small (cheapest available) but adequate for weekend luggage and very clean. The bathroom was lovely, with a great shower with plenty of space. Sleep quality was good, not too noisy and comfortable bed. Breakfast was continental, usual breads and spreads with good coffee and juice. All staff were very attentive and friendly, happy to recommend places to see and eat and helped with the luggage. This is a great base for exploring Venice and is very reasonable but the staff made it extra special.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Modern, clean, excellent location”", "Author": "Nz_shez", "ReviewID": "UR114972444", "Content": "We loved this hotel. It was modern, clean, quiet and the location could not be topped, very close to St Marks square. We couldn't find the hotel so we called and a staff member came and met us and showed us to the hotel. Breakfast on the sunny deck was a treat (served at the time of your choosing). The staff were lovely and we stayed chatting after checking out for about half an hour! Our room had no view but we did not expect one for the price we had paid. It was the perfect base for exploring Venice. Highly recommended.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Seattle", "Title": "“DID NOT HONOR RESERVATION”", "Author": "EricInSeattle", "ReviewID": "UR114722074", "Content": "The same thing happend to me as the person from Montreal except that after receiving the email from the hotel, which asked me to cancel the reservation, I checked with Hotels.com and was told that the reservation was still valid. A few days before arriving, the hotel sent me an email confirming the reservation and giving me instructions on how to find the hotel. Upon arrival, we were told that we did not have a reservation despite having all of the paperwork, which showed otherwise. Although the hotel did help in finding another accomodation, it was a major hastle and put us in an entirely different area of Venice.", "Date": "June 24, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Montreal, Canada", "Title": "“Won't accept my reservation”", "Author": "Fantomg", "ReviewID": "UR104285367", "Content": "Over a month ago, I've made a reservation for June using expedia. It was quickly marked as \"confirmed\". However, a month after making the reservation, this hotel sent me an in incomprehensible email saying that due to \"interference Acker\", the reservation could not be made. So they asked me to cancel my reservation. Because of that, I had to make a reservation somewhere else over a month after I've made the original reservation and the prices are higher and most of the good hotels were already booked. What I think happened is that they notice that their hotel was popular at the given rate, so they claimed it was a hacker that lowered the prices so they could cancel some reservations and sell them at a higher price.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Loveland, Colorado", "Title": "“Clean, modern,GREAT location, friendly, caring staff, but rooms a bit small.”", "Author": "CAMcDonald", "ReviewID": "UR103673717", "Content": "We stayed for two nights - about 1-2 minutes off St Mark's Square, amazing location! Hotel very clean and upkept, however you must hike up two flights of very steep stairs to get to room. Quiet area, slept well. The furnishings are modern and in good condition, however the rooms are small, with limited space to put your things (we ended up keeping stuff in suitcases). Bathrooms while modern and having a GREAT shower, I would suggest bringing your own bathroom caddy as there is NO place to put anything down, and only 1 person can fit (barely) in bathroom at a time. Staff VERY friendly, although don't really speak English. Breakfast was typical Italian - carbs, carbs, carbs, wtih an Espresso, so would suggest hitting a local fruit market to stock up for breakfast. Bed was up in a loft, and my 6-ft husband had to duck to not hit his head, but the bed was very comfortable. We would consider staying here again, as long as not planning on hanging out in room, due to space limitiations. (Why would you be in your room in Venice, anyway?) :)", "Date": "April 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Your apartment in Venice”", "Author": "claudiopro", "ReviewID": "UR99029675", "Content": "I booked a room for two nights at the end of February back in November when I didn't know it would have been Carnevale. The rates were 110â‚¬ per night, definitely great value for money given the excellent location, two minutes walk from San Marco square, and the clean, quiet and comfortable rooms. Breakfast, pre-packed Italian puff pastry, coffe, jam, and a juice, is served at your room or on the terrazza at the second floor, which would be enjoyable on a warm and sunny day. There is nobody at the reception after 1pm, which leaves you alone for half the day, but you're given the keys and a code for the front door just in case. Check in must be before 8pm by arrangement, while check out is at 11am. The location is close to the Vaporetto stop San Marco (Vallaresso) served by routes 1 and 2, among the others. It would take you 20 minutes to get there by Vaporetto from Piazzale Roma or the train station. It's definitely a place I'd recommend to a friend, and I'd return to should I return to Venice.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomfield, New Jersey", "Title": "“Great location”", "Author": "ycart0616", "ReviewID": "UR81724114", "Content": "This tiny hotel is just a few minutes away from St Mark Square with a very reasonable price. The room has a decent decent size and the bathroom is very clean and quite modern. There is also wifi in the room but not very stable. You can have breakfast in the room or in the terrace. But the breakfast is pre-packed pastry as opposed to fresh croissant. There is no conceige service so you just feel like staying in a apartment which is fine for us. The staff would email you in advance to confirm your arrival time since there don't have staff 24 hours and offer to meet you and lead you to the location. We don't have phones in Italy and not sure if we could find the public phone to contact the staff, so we just gave them time of the arrival and ventured to find the location ourselves, which took a while but not too bad.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guaynabo, Puerto Rico", "Title": "“Unbelievable location”", "Author": "LilianaMaria", "ReviewID": "UR72653325", "Content": "This bed and breakfast is on a quiet street just behind St. Mark's Square (1 minute walking distance). Nice modern room with beautiful bathroom. Clean and decent size. The staff is very kind and helpful. The breakfast is served on a nice terrace, or in your room. Simple but filling (coffee, croissant, toast, hot chocolate, orange juice). Free Wifi. Would definitely stay there again. It's more like having your own apartment. They give you the key, and you can come and go as you like. Make sure to arrange your arrival with them, especially if it's after 1p.m. The staff is available only until 1p.m. However, Dario was kind enough to wait for us almost until 2p.m., since we had some trouble getting to the B&B from the airport.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hermosa Beach, California", "Title": "“excellent location, great room”", "Author": "hermosabeach22", "ReviewID": "UR70958551", "Content": "I researched many hotels in Venice and found this one with the help of tripadvisor. It was very moderately priced for the area. We stayed here for two nights in July and were very pleased. It is located very close to St. Mark's square but is off the main walkways so it is quiet. We emailed the hotel the day before we arrived to let them know when we'd be arriving and they sent someone to meet us and lead us to the hotel. It is very clean and has modern, sleek furnishings. The bed was nice and big especially compared to our previous hotel in Germany. They bathroom was very nice and decent sized. They have a flat screen tv and most importantly- air conditioning! It's true that they do not have someone there at the desk for most of the afternoon and evening, but we didn't need anything. We were given a restaurant recommendation upon check in. The women who served us breakfast (up on the terrace) were very nice. Overall we were very happy with our stay. Tip- for our gondola ride I asked to be taken on the smaller, side canals instead of the grand canal. It was amazing and very romantic, I highly recommend doing the same.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Seattle", "Title": "“Average Hotel Experience, Non-Intuitive Location and Service”", "Author": "E1Traveler", "ReviewID": "UR46591602", "Content": "My husband and I recently finished our honeymoon and we stayed two nights at this hotel. Overall, our experience was average for the following reasons: - We had a very difficult time locating the actual hotel. It is situated in a back alley-- and has no visible signage other than a tiny sticker, approximately 3 inches long, taped to a door that looks like it belongs to a vacated building. Our arrival time for check in-- was close to 2 pm. But the hotel does not provide reception service past 1pm!!! So we were left waiting outside, until someone finally picked up our call to let us in. - The hotel does not offer a true 'reception' or front desk service. The one man who could speak English was only at the desk for a portion of the mornings during our stay. So when we had a question or needed something, we had to struggle to communicate with only available staff member-- our cleaning lady who spoke no English whatsoever. - We were asked to pay our total hotel dues one day prior to our check out. And this request came from our cleaning lady! We were quite confused by this-- as it was clearly out of the norm of what we were accostomed to.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Auckland", "Title": "“An absolute gem”", "Author": "NZTourists", "ReviewID": "UR33288870", "Content": "We booked online at the rate of Euro 95.00 per night (!), & stayed 2 nights at this wonderful small hotel. As the website states, it truly is refined and contemporary. After spending 2 nights in the lovely La Venere hotel in Florence, we thought it would be hard to beat. However, this hotel was equally as good (apart from the breakfast). It was hard to believe that on our tight budget we had found such a stylish hotel in Venice. We took the #2 water taxi which has its last stop at San Marco where we got off, and phoned the hotel (there is a public phone next to the information office on the right hand side as you get off the ferry), and a few minutes later we were met by the friendly host and taken to the hotel. It was down a small alley, so typical of Venice. The interior design of the hotel was modern and stylish. We loved our room (#4 ?) on the floor above the reception. It was compact but bright and clean, the bed was comfortable, and the bathroom was modern. The airconditioning was quiet and efficient. Breakfast is brought to the room and was basic but adequate (pre-packaged croissant & biscuit) and we enjoyed it on the small deck. The hotel is just a few steps from San Marco, so you won't get lost as wherever you end up in Venice, you can just look for the signs pointing to San Marco. We enjoyed exploring Venice on foot from this handy base. For the price, we could not have wished for more (well perhaps tea/coffee making facilities & free internet). Thanks to all the tripadvisor members who recommended this charming and elegant hotel. It contributed to a memorable stay in Venice.", "Date": "June 27, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Budapest", "Title": "“You can't beat the location!”", "Author": "Torsika", "ReviewID": "UR31963888", "Content": "I can't say enough good things about its situation, which literally means 5 minutes' walk to San Marco (or even less!!!), however, the hidden, out-of-the-way alley looks pretty appalling at first sight, and then you get used to it... (part of Venice feeling, which I now adore). I loved its stylish furnishings, all the minimalist touches in an ancient building... (Breakfast is also provided in a minimalist style, if you know what I mean.) The owner (or son?) was really kind, because we arrived much later than we had agreed on and he was still waiting for us (as there is no permanent reception). All in all, it's a perfect choice if you don't mind not being pampered by a hotel staff all the time.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Love. Love. Love.”", "Author": "onlylucy", "ReviewID": "UR24685564", "Content": "My husband and I stayed here on the first leg of our honeymoon through Italy. I booked based on their website and Tripadvisor. As others have said- the owners adorable son picked us up from the ferry docks. Even though it was quite late at night. We are glad he did, since it was our first time in Venice and it's like a rabbit's warren! The rooms were clean and modern looking, the location is UNBELIEVABLE. Literally, 2 minutes walk to San Marco. Couldn't be in a better spot. I can't believe how little they charge given that. The \"breakfast\" that is included is bad though. Only the coffee was good. But honestly, who eats the breakfast that comes in the room in ITALY?! We would highly recommend this hotel and would stay there again if we venture back to Venice.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nice location”", "Author": "KapalApi", "ReviewID": "UR21483592", "Content": "WE've researched this place in trip advisor and booked them 2 weeks before heading this place. The boat rides in Venice are expensive. Its 6.5 Euro for one way trip or 14 euro for 12 hr. And since Venice is accessible by foot and it makes it important to get a good area so near to everywhere. Its nicely located doorsteps away from San Marco. Everything seems to be built around this place: shopping area, music performance at the piazza. But it is impt not to get too comfortable in this area but to walk and wander away to discover all other gems in this place. things also get cheaper when its out of this place. Rooms are just well spaced and nicely designed. Breakfast was a bit disappointing with just one coffee, one croissant and 2 small toast. one of the downside is no internet access (WiFi)", "Date": "November 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malta", "Title": "“Fantastic Location”", "Author": "Fanghorn", "ReviewID": "UR16336080", "Content": "This small hotel is located less than a minute from San Marco and about four from the Rialto. The owner met us in Piazza San Marco and showed us to the hotel. The rooms are a bit small but very clean and comfortable. The breakfast was generally OK but for the price of Euro 140 per day one would expect a bit more. There are a couple of flights of stairs and a lovely terrace where you can enjoy breakfast if the weather permits. Overall it's a great place and so favourable as location goes. It's located in a quiet alley but less than a minute from the buzz of San Marco. I would use this hotel again.", "Date": "May 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alabama", "Title": "“Perfect Stay in Venice”", "Author": "ojblues0801", "ReviewID": "UR11191867", "Content": "We absolutely enjoyed the quaint but modern Antico Casin, located just a few steps from St. Mark's Square. We were met by a concierge at the vaporetto stop, who led us to the hotel and made sure we had everything we needed. The decor was modern but elegant, the bed was comfortable, and the in-room breakfast was unexpected with fresh capuccino! We recommend this hotel to anyone; it is tucked away yet moments from the excitement of the city.", "Date": "December 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Nice small hotel with a reasonable rate close to St. Mark's”", "Author": "dhemmert", "ReviewID": "UR6063059", "Content": "We enjoyed our stay at this 5-room small hotel. They call themselves a B&B, but it really is more a small hotel. The accomodations are clean and pleasant with contemporary decore. There is a very nice terrace for guest use that overlooks a cool little venice neighborhood \"scene.\" My Dad couldn't get over the details of Italian craftsmanship and this hotel was no exception. The rooms are small, especially the bathroom. There is a very long flight of stairs up that makes it challenging with your luggage. We really like the location - very close to St. Mark's, yet on a quiet street. A little warning on the included breakfast - it's really a couple of cookies with a small cup of coffee. And if you ask for another cup, they will begrudgingly oblige. Overall, I found the staff is a bit indifferent, but not rude. I liked the maid best.", "Date": "November 6, 2006"}], "HotelInfo": {"Name": "Locanda Antico Casin", "HotelURL": "/ShowUserReviews-g187870-d630874-Reviews-Locanda_Antico_Casin-Venice_Veneto.html", "Price": "$145 - $314*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Corte Contarina</span> | <span class=\"extended-address\">San Marco</span>, <span class=\"locality\"><span property=\"v:postal-code\">30131</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "630874", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4f/6a/4f6aa39ec5023e60c220289ea1183bd31large.jpg"}}