{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“\"Super\" Super Bowl stay”", "Author": "Mickey108", "ReviewID": "UR124349732", "Content": "Enjoyed staying at the Candlewood Suites near the Airport. The room was spacious and clean. The bed was very comfortable. The pool and hot tub was crystal clear. The staff at the front desk were particularly helpful and super nice. My husband loved the warm cookies that were served in the lobby. There was a refrig, ice maker, stove and microwave in the room. The little store by the lobby had enough food choices that you could buy and heat up in your room and the prices were reasonable. Because of the Superbowl there was transportation available into the city. Otherwise the hotel is very close to the airport and a convenient car ride into the city. I'm not going to rate the hotel on value because for the super bowl everything was inflated and I have no way to compare! Indianapolis did a great job preparing the city to host the super bowl.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“I like this hotel”", "Author": "Chunyang", "ReviewID": "UR119499710", "Content": "It is quite near the Indianapolis airport so would be a excellent choice for those who want to catch up with airplane. The kitchen area is great!", "Date": "October 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Carthage, Missouri", "Title": "“Loved this place.”", "Author": "jlks1107", "ReviewID": "UR117239743", "Content": "I was very pleased with my stay at this Candlewood. The staff were always friendly, smiling, and very helpful. Every day my daughter and I stopped at the front desk to ask for directions to our destination and we always received great directions. They don't offer daily housekeeping (which is about the only thing I wasn't happy with), however, they will give you clean towels any time you ask. Their outdoor pool was lovely and well-kept. If I ever plan to spend time in Indianapolis again I will definitely stay here.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Nice, clean and friendly”", "Author": "Champurbresident", "ReviewID": "UR108143308", "Content": "I stayed at this hotel for one night earlier this week (I was in Indy for work), and I was very happy with the whole experience. The suite was spacious and clean, the staff very professional and helpful. It took me about 15-20 minutes to drive downtown for my meeting at 8 am. I wanted to avoid the pricier downtown hotels, and it was well worth it. Free parking and Internet were also a bonus you dont always get downtown. Communal areas (elevators, some hallways) need some updates but a very good impression overall.", "Date": "May 13, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Fountain, Colorado", "Title": "“There are better choices nearby”", "Author": "DeeLepp", "ReviewID": "UR76171520", "Content": "There was no breakfast and the Denny's across the street was horrible. There was no shuttle service from the airport. We had to wait an hour at the airport for their \"taxi\" to get us.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Very nice”", "Author": "ColoradoInus", "ReviewID": "UR74117304", "Content": "My husband and I stayed at this hotel with our 2 dogs while on a road trip to Ohio. The room was clean and there was a nice dog walking area. The staff was very nice and the pantry had plenty of items to buy if you needed a snack.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Colorado", "Title": "“Very good - Verify Arrangements”", "Author": "Madwolf", "ReviewID": "UR57089399", "Content": "I coordinated a 12 person tour group on travel through Indiana this week and stayed two nights in the Candlewood Suites Airport Hotel. First they said they had a shuttle... they actually don't and use a local taxi companay, which only allows two people per taxi. The front desk could not get the number rooms rented accurate, fortunately the night manager was able to straighten the booking out. Lastly, although the rooms are very nice, un plug the refrigerator their very noisy. madwolf", "Date": "February 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Virginia Beach VA", "Title": "“Nice Amenities”", "Author": "debbiesky", "ReviewID": "UR48773987", "Content": "I do a lot of traveling, and prefer suites with kitchens. This hotel was very clean, roomy and the staff is friendly and helpful. I arrived on a Sunday and checked out on Thursday, so no maid service, however, you may get fresh towels daily from the front desk. They have a \"pantry\" to purchase food items, toiletries,,,,,and I found the prices to be very inexpensive. Free laundry and beautiful gym. Last hotel I stayed, I spent $8 on two loads of laundry.... I will be staying at Candlewood again, every chance I get.", "Date": "November 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pensacola", "Title": "“Great Hotel!”", "Author": "Oceanfem", "ReviewID": "UR21711961", "Content": "Stayed here while waiting for our house to close. Great staff exceptionally friendly with great attitude at any hour. Room was very clean, in fact the whole hotel is very clean. FREE laundry facilities and good gym. Pantry was always stocked with yummy snacks and food. Close to airport and freeway yet not noisy at all. Nice grounds to walk dogs and very pet friendly. You also get over 70 cable channels WOW! Definite great hotel!!", "Date": "November 10, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Illinois", "Title": "“kind staff, great room”", "Author": "jayareil", "ReviewID": "UR21640894", "Content": "I had never heard of Candlewood Suites before, but suddenly needed a room in the middle of the night when my other hotel arrangements didn't work out. I was extremely upset when I arrived. The desk clerk was very nice to me, and gave me an upgrade for no extra charge. The suite was comfortable and homey. There was a nice-looking pool and gym area, though I didn't have the opportunity to use them. Everything was clean and in great condition. I will look for this chain when I travel in the future.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“5 Star Fabulous (And pet friendly too!)”", "Author": "PhysicianEndorsed", "ReviewID": "UR18077651", "Content": "Wow, what a pleasant surprise to find such a clean well appointed room right off I 70. Clean room, comfortable mattress, and pet friendly too! A perfect stay. Warning, there is a Denny's in the immediate area, but no other restaurant choices.", "Date": "July 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Great stay!”", "Author": "erin327", "ReviewID": "UR18046901", "Content": "This is a great place to stay near the airport. They offer long term parking for the time you are away. The room was wonderful. It was very clean. There was a partial kitchen, and awesome TV, a dvd player, internet acces, a comfy bed, and a work desk. The hotel also offered dvd's to borrow in the room. We'd have liked to have stayed here longer!", "Date": "July 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springboro, Ohio", "Title": "“Excellent stay a an affordable location”", "Author": "lushou", "ReviewID": "UR17137884", "Content": "This hotel was $70 for a Saturday night. This was the cheapest in the area of the Indy airport. However, this was an EXCELLENT hotel at which to stay. You would be well served to stay at this hotel any time. The staff was extremely friendly and helpful. The pool & hot tub were clean and fun. The room (standard suite) had hardwood floors when you first walk in. Also, a full size fridge, dish washer, 2 burner stove, microwave and all the dishes you could need. Also, every room has a flat panel tv (32 inch I believe) and a DVD player. DVDs are also rentable for free at the front desk. A+", "Date": "June 22, 2008"}], "HotelInfo": {"Name": "Candlewood Suites Indianapolis Airport", "HotelURL": "/ShowUserReviews-g37209-d631597-Reviews-Candlewood_Suites_Indianapolis_Airport-Indianapolis_Indiana.html", "Price": "$91 - $168*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5250 W Bradbury St</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46241</span></span> </span> </span> </address>", "HotelID": "631597", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/54/11/54115e0d5dd735539af3282520f623771large.jpg"}}