{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chatham", "Title": "“great hotel and location.”", "Author": "Dave E", "ReviewID": "UR128266097", "Content": "we stayed in this hotel at the begining of april,it is in a great location 5 min walk from the ramblas,easy access to the metro and the start of the city tour bus trips.We found the hotel very clean and the staff very friendly and helpful.We had booked tickets for a game at the nou camp and the staff were very helpful in giving us directions to the ground and also helping getting tickets to the nou camp experience which is well worth a visit for any football supporter.We didn't have breakfast in the hotel,and we didn't have any trouble finding somewhere to eat first thing in the morning.There is a very nice bakery on the corner which you can get coffee,cake and baguette if you want.There are loads of restaurant's around the hotel making this the ideal location for a long weekend or a short break away.The room we stayed in was a family room which had double bed and two single beds for the children,it had a very large bathroom which had shower and whirlpool bath if needed all of which were cleaned daily.The hotel and staff gave us a great base for a great week away.The city itself is beautiful with lots of places to visit including sagrada familia,and picasso's museum.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Luton", "Title": "“Fabulous Location”", "Author": "AngLuton", "ReviewID": "UR127349160", "Content": "Stayed here for 3 nights at the beginning of April, with husband and 2 children. The location of this hotel is excellent and only took us about 5/10 mins to walk to the main square and La Ramblas. We had a family room at the back of the hotel and had no outside noise whatsoever. Room was spacious with a lovely bathroom, free safe and free laptop which came in very handy. Hotel staff were friendly and helpful and happy to store our cases adnd bags for a few hours after we had checked out at no extra charge. We didn't have breakfast at the hotel as it was very expensive (10 euros person), but found a large variety of restaurants/cafes very near to the hotel serving pastries, coffee, toast, etc etc which were much cheaper. I would say that although well designed with some very quirky touches, the rooms could use a bit of an update, but this is a very minor grumble and we would happily stay here again in the future. Word of advice for anyone who hasn't visited Barcelona before - don't eat or drink on La Ramblas, as it is VERY expensive. Do a bit of research before you travel and look for restaurants and bars down the side streets where you'll pay alot less!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great central location”", "Author": "Helen G", "ReviewID": "UR127116775", "Content": "We stayed in a junior suite at the end of March 1012. Unfortunately our stay coincided with the strikes and riots that happened for one day/night so we were unable to leave the hotel that evening. It was a shame not to head out, but the hotel room was spacious and because we had treated ourselves to a stay in a suite, we had a lovely private outdoor terrace with hot tub. We had to order room service that evening (as most restaurants were shut due to the general strike) and the food took nearly an hour and a half to arrive and was very disappointing when it did turn up. We actually sent back the sandwiches as they were totally dried up. We put the bad food down to it being an extraordinary evening where probably most guests were ordering in. The hotel is in a fabulous location, just around the corner from Las Ramblas and a few blocks down to the Placa Catalunya. We also walked to the Sagrada Familia on our first day (due to the blockades of the central roads) which took about 40 minutes but was a nice stroll. The hotel itself was fine, not the fanciest place I've ever stayed, but definitely not the worst. It felt like a fancy designer had designed the hotel, but the finish was looking a bit tired and in need of a refresh. We had the breakfast which was your standard pastries, cereal, toast, fruit and some cooked food. It was OK. Whilst the room was clean, we were very disappointed to find a used condom left by the side of the hot tub on our second night. Obviously it really put us off and rather ruined the romance of having your own private hot tub! Hotel staff need to check for this in the future as it's probably the thing that most sticks in my mind about the stay - for all the wrong reasons! All rooms have a laptop which is a nice touch and we also got wifi codes so we could access the internet on smart phones etc. There is a safe in the room and toiletries, hairdryer etc in the bathroom. All in all we had a good stay and the location is super. Staff were helpful and happy to arrange taxis etc.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Patras, Greece", "Title": "“Charming boutique hotel! Great Location”", "Author": "MariannaDayio", "ReviewID": "UR126667269", "Content": "We stayed there for the New Year's Eve celebrations. The room was clean, the service excellent. We did not attend breakfast so I cannot comment on that. Just outside the hotel there is a small plaza with charming cafes. The Hotel is in a very good location just a short 5-10 minute walk from Las Ramblas and 5 minutes from the nearest metro station. On the 31st Dec. we found in our room complimentary small champagne and grapes (Spanish custom), which was a nice touch! We were so pleased with the hotel, so in our upcoming trip to Madrid we booked from the same chain (Petit Hotel Mayor)", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great hotel”", "Author": "Janetski069", "ReviewID": "UR126508614", "Content": "We were there the first week oh March, 2012. The hotel is cozy, safe and clean. The hotel staffs are very helpful. It is conveniently located near some of the famous attractions of Barcelona. Walking distance to Casa Battlo, Placa Catalunya, Barcelona Cathedral and Las Ramblas. I would definitely recommend this very nice hotel. The only thing is that their breakfast is a little pricey. You can find great breakfast Paninis, pastries, donuts and cappuccinos just across the street. There are restaurants around the place.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“Outstanding hotel”", "Author": "gill10031962", "ReviewID": "UR126109444", "Content": "Excellent location,walking distance to all main attractions,very clean room had everything you could wish for including free wi fi and laptop,breakfast loads of choice staff very helpful would definitely stop here again.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“Great room with terrace and jacuzzi!”", "Author": "Joanna_Koltan", "ReviewID": "UR125254825", "Content": "We travelled to BCN for my hsubands aniversary and decided to book this hotel due to terrace with jacuzzi, it was really pretty, with great view and relaxing. The room needs some renovation but it is nicely decorated and the bathroom was ok. If you look for a romantic stay the hotel is perfect. We walked to the hotel from the metro station, its close to everywhere. The staff is nice and helpful, free wi fi and a computer in the room.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“will not stay again”", "Author": "aktan76", "ReviewID": "UR124872855", "Content": "if you do not ask an outside room, you will have a room with window inside the ventilation shaft. rooms are very noisy, you can hear each step of the people in the next room", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Overall good, but room for improvement”", "Author": "kiwiB", "ReviewID": "UR124706156", "Content": "The location can't be faulted, it's only a couple minutes walk from Placa de Catalunya where you can get dropped off by bus from the airport for around €5. Nearby are lots of nice restaurants, bars, and cafes so we didn't do breakfast at the hotel as it would have cost €10 (down from €16 when booking) if you arranged this upon checking in. We liked the decor of the rooms, the beds were comfy and there were nice and interesting design touches. The laptop was handy but they also have free wi-fi, although this was slightly annoying as you have to keep on logging in with a code as it didn't stay connected on my iphone. The shower was amazing, it's one of those Vinchy style ones that has a setting where the jets shoot out water horizontally like a back massage. There is a little room for improvement I feel: - There was a lot of dust on horizontal surfaces when we arrived, and this wasn't cleaned the whole time of our 3 night stay. - Bathroom doors are glass and semi transparent. Also they don't block any noise! - Not enough towels, especially as the narrow bowl shape of the sink means that water is spashed all over the counter everytime you use the water. - Some of the furniture like the desk chair is looking tired and grubby and should have been replaced. Overall these are small", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Nice hotel, great location, enjoyable stay”", "Author": "DiablesRouge", "ReviewID": "UR122219872", "Content": "Stayed the week before Christmas. Excellent position, one block from the shops of Passeig de Gracia & a couple of minutes from Placa Catalunya & Las Ramblas. Plenty of nice restaurants & cafes close by, suitable for any budget. Ample sized room for our family of three, however there could have been a little more wardrobe space. Complimentary laptop & wi-fi were provided in the room, which was useful. Sufficient room in mini fridge to put a few drinks of your own, if needed. Nice bathroom with rain shower & jet bath. Comfortable beds. Air conditioning was a bit noisy and didn't cool the room that much, luckily the weather was nice enough for us to leave a window open. We didn't use the restaurant or gym so cannot comment. I found the staff polite, and they dealt with the few requests we had, quickly. Overall a very nice & enjoyable stay.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“High tech... in what decade?”", "Author": "MooandJu", "ReviewID": "UR121517311", "Content": "It claims its a 'high tech' hotel and as such the interior design tries to imply that. Although, the technology is showing the signs of age and is anything but 'high tech'. Very little functioned well or at all in our balcony suite... lighting, air conditioning, awning, outdoor speakers, ipod dock etc... And the bedroom itself, had the strangest assortment of furniture and colours that I have not sen since the eighties. Because of the rain on that particular day. We asked if we could change suites to one of the interior ones, without balconies. The staff, did indeed help us with this request. Although, we were surprised to find that the windows in this room had been screwed shut for child safety reasons. And so, we returned to our original room. Overall, I was disappointed with room, given the price and the location. I will, maybe return to this hotel when its had a re-fit and then once again it possibly it can say its 'high tech'.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Teaneck, New Jersey", "Title": "“PERFECT Location, Nice room, Average service...”", "Author": "Carol426", "ReviewID": "UR121037882", "Content": "Petit Palace Museum Hotel was centrally located and easily accessible to reach different locations throughout Barcelona. Unfortunately when we arrived, all the rooms were occupied and we were told that we would not be able to check in for another three hours. After arriving on a red-eye flight on a Sunday when most things are shut down, this was a little inconvenient- but we ended up catching a Bus-Turistic tour to occupy some of our time. When we returned, we had to wait in the lobby nearly an hour and a half before we could sleep in our room. The room was stylish, and the mattress was nice and firm. The bathroom door was nice, but would be nicer if you couldn't hear everything, even when the door was shut. We stayed out much of our trip (6 nights/ 7 days) sightseeing, shopping, and eating of course. We visited Avinguda Diagonal, Paseig de Gracia, Placa de Cataluyna to name a few. We attempted to order a late evening snack, but the kitchen had already closed. Most of the food on the menu was a bit pricey. Overall, the room was decent quality with fun decor.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Granada, Spain", "Title": "“Great hotel, Great Location..... Poor Service”", "Author": "sarahjbh", "ReviewID": "UR120906385", "Content": "We staying here for the weekend as we were visiting the boat show in Barcelona. The hotel is cool and the location is great, but for a 4 star hotel in a big city and in a prime location we were really disappointed with the service overall. We arrived after 11 pm to find our room was so small that we couldn´t walk around the bed and the bunk beds for the children were fine except the top bunk which was high, had no form of guard or side bar.... they changed our room but only after the receptionist phoned the manager at home, to one that was 3 times the size.... and 4 doors down on the same floor... so I don´t understand why we didn´t get that in the first place. There is no room service or bar service after 11pm. On a positive note, the breakfast was great, the receptionist in the afternoon was really friendly and helpful, free wifi and laptops in reception. The room we had was quiet and we slept really well. Overall I wouldn´t recommend this hotel to anyone as there are plenty of others to try in the same area.... It seems that maybe there is a lack of staff and therefore a lack of service in certain areas.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location, great shower but everything else is BAD - definitely NOT a 4-star hotel”", "Author": "Lally_Atlanta", "ReviewID": "UR120790676", "Content": "Pros: - great location. you're closer to Passeig de Gracia and not in the midst of the touristy area.... which means, better restaurants, better shopping and being able to be around locals - shower was awesome - great hair dryer -- it's the real one!! Cons: - dirty rooms... somebody left behind used socks in our room. obviously the room was not cleaned well - really tiny rooms.... i don't mind small rooms and i have no expectations of big rooms in Europe. But this one was pretty bad, We had the double room. Everytime one of us needed to sit in front of the desk to use the computer, there was nowhere anyone could walk through. - thin sheets... no duvet, and the sheets were cheap hospital bed sheets - very hard beds with thin mattresses - slow internet..... - no business center... if you need to print something, you'd have to email it to the front desk clerk and s/he'll print it for you. - no umbrella you could borrow if it rains - Ikea like furniture that are good to look at but provides little to no function. I wanted to like this hotel because of the great location but i can't.... it's way overpriced and today i'm staying in another hotel with waay better facilities. For perspective, i'm a savvy traveller. I plan my own trips and don't use travel agencies.... so I researched and chose with great care when i picked this hotel..... that's why i'm very disappointed. Would not recommend.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ruiselede", "Title": "“Nice stay in good hotel”", "Author": "Gilles V", "ReviewID": "UR120712157", "Content": "We stayed here during 3 nights in the weekend. Arrived at fridaymorning and we found our hotel very fast. It's really nearby the Plaza Catalunya. We had the room on top op the hotel. It was very nice and clean. Big room and a nice bathroom, a lot of space to put your stuff in. The breakfast was large but on sunday morning there was a not always enough. I think on sundays one people extra from te staff would solve this problem. If we go back to Barcelona , what we will do , i will certainly go back to this hotel.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hull, Canada", "Title": "“Perfect Palce”", "Author": "Nick I", "ReviewID": "UR120198995", "Content": "Superbly situated in the centre of the city a short walk from all transport facilities. Staff were very efficient and extremely helpful. The room was spacious with excellent shower facilities, a very comfortable bed and the laptop with fast broadband was a really nice touch. We stayed late October midweek and enjoyed every moment. One minor point, the breakfast was fine but the staff found it difficult to cope with unexpected busy times, though they were polite and helpful. Would definately stay again.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "bolderslev", "Title": "“Nice stay”", "Author": "dieselranja", "ReviewID": "UR120158622", "Content": "What a nice place. The staff was very helpful and friendly, and did recommend Us many good places to go. The location was good and the rooms was really big and clean. So recommendable to everyone. We had a family room with space for four and it even had a spa bath. The only minus for us is that breakfast was not included in the price.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“High tech - modern deco - loved it”", "Author": "blue_monkey_dip", "ReviewID": "UR120133050", "Content": "Any hotel that comes with an iPod dock is worthy of at least a star for effort. But this was just one of the many nice touches of this hotel, which indeed lives up to its high-tech name. Fantastic spacious room with a massive shower area and a big desk. Sparkling clean and situated in a Greta position within Barcelona. Will definitely I go again next time I'm in Barca.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location and comfortable rooms”", "Author": "Elcoronel", "ReviewID": "UR119695828", "Content": "I have stayed here twice in 2011, travelling alone to visit friends in Barcelona. It is not a cheap hotel but has a modern feel and I think that the staff are very helpful. The breakfast is good and you can eat as much as you like. The enormous shower is wonderful and I love having a laptop in the room. The hotel is near all the attractions of Barcelona and very convenient. Any little moans? One or two. The laptops use Linux which will not load some internet banking sites (mine included!); they are also a bit ancient nowadays and need to be updated. I could not view pdf files either as the software was not installed - bad for people like me who wanted to do some work there. The sink in the bathroom is just a large bowl - trendy but utterly useless as a washbasin. But really, this is a nice hotel, comfortable, clean and incredibly well-located.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Fantastic location and loved the decor!”", "Author": "YorkshireTiddles", "ReviewID": "UR119633939", "Content": "Really great area of Barceona. The underground is just a short stroll away and you're right in the heart of the city. Despite being so central, the hotel feels peaceful and thankfully doesn't suffer from street noise at night. The decor is really modern and clean, although you may find it a bit dark after coming in from the Barcelona sun! We never tried the restaurant and the breakfast seemed a little expensive, so we opted to eat out instead. There's a fantastic bakery on the street corner, which we ended up visiting every morning for breakfast. The location is a great area to have a wander with a coffee and pastry and there are some great tapas restaurants, so I wouldn't recommend the hotel for dining in. The only downside is the sauna area. After walking around the city all day, we were looking forward to popping to the sauna before getting ready for the evening. We searched for ages before finding it in a well hidden cupboard! The lights were switched off, as was the sauna so I get the impression it's not particularly well used... we quickly escaped back to our room! If you're hoping for full relaxation, there's also no bath in the room, just a shower (but a pretty amazing jet shower!!). Really a great hotel (and we're fussy!), would definitely return.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent location & quality”", "Author": "SandAAli", "ReviewID": "UR119630690", "Content": "I have never ever left a review on any hotels, however I felt obliged to. It took me weeks to decide on a hotel with so much choice in the city. I am so glad I picked this hotel, the location was super and situated close enough to La Ramblas but far away enough not to be affected by the noise. For those of you who might find it helpful turn right and right again and keep walking straight and you get to the hustle of Ramblas. We only found out the last day there are a few nice shops and restaurants if you turn right out of the hotel and left (something bit different). Going back to the hotel, the room was a great size with funky decor. The free lap top was so helpful and genuis. Some days it felt like we were the only guests as it was so peaceful. We were really dissapointed with the welcome on reception and we werent given any information about the hotel / locality, apart from the questions we asked. I gave the staff the benefit of the doubt and thought it was possibly due to the language barrier but actually my Fiance pointed out I dont think that's the case, as we over heard some guests being greeted. Had the staff been welcoming and friendly it would have been a 100% rating. The rooms were cleaned every day and spotless. Hotel had a mix of families, couples and business visitors. If you like to stay in modern, boutique hotels then you'd love this place. We would go back for sure!", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“A bit cramped for 3 adults and a toddler but otherwise very good”", "Author": "MissFussySydney", "ReviewID": "UR119283503", "Content": "Great location close to Placa Cataluna, Las Ramblas and the Bari Gottic. We stayed in a triple room - it was a bit cramped for us (3 adults and a toddler) as we needed a cot in addition to the bunks and king bed that were already in the room - but would be ok for 2 adults and 2 young children. Good value and would definitely stay again.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wiesbaden", "Title": "“Location is strategicallyperfect”", "Author": "UncleBill34", "ReviewID": "UR118450946", "Content": "Close walking distance (~ 5 minutes) to the old city as well as the \"infamous\" Ramblas, but far enough away not to be pestered by the hustle and the noise. Plenty of excellent restaurants and tapas bars in the vicinity for all pockets. The room was decent sized, looking out over the back courtyard, the bathroom was great, super shower and whirlpool + free Internet in the room The TV programmes were more than limited, but who goes to Barcelona to watch telly. Service was more than friendly, breakfast was ample too. Certainly stay there agin when visiting Barcelona.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springboro, Ohio", "Title": "“Perfect location, excellent value”", "Author": "Elizabeth R", "ReviewID": "UR118431234", "Content": "I am a picky traveler and I was worried about this hotel given the price was so low, but I trusted trip advisor and it was PERFECTO! The location is great, walking distance from many great sites. The rooms were modern. Our room had bunk beds and a king bed (we were traveling with kids) and it was very large. I have been to Barcelona before and stayed at the W Hotel (also lovely) but for the money, I would choose this over the W for sure. What are you waiting for? Now one thing you should know (so that you have the proper expectations) is that they really only have 1-2 people at the front desk and they also operate as consierge, bell person etc so if you need prompt services you will find them a bit slow. They were friendly too.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Agoura Hills, California", "Title": "“Great location”", "Author": "LBrownie", "ReviewID": "UR116525436", "Content": "And free WiFi... Can't ask for more... Especially at this price.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "NJ", "Title": "“Very nice, would go back again”", "Author": "Phillies2008champs", "ReviewID": "UR116390639", "Content": "We stayed at this hotel for one night prior to a cruise. It cost about 25 euro to get to via cab from BCN airport. Overall, it was a great place to stay. Very clean, comfortable and in a great, safe neighborhood. There were tons of places to eat within walking distance as well as many places to shop. La Rambla is about a 5-10 minute walk away. The rooms have a laptop computer in them with free internet access, which was nice. My only complaint was the breakfast which consisted of some eggs, bread, meat and fruit which cost ~$25 (US) per person. I thought it was a joke when I got the check. Next time I'll just get something from one of the many restaurants nearby. Overall, I really liked this hotel and would definitely stay there again..I just would never get their breakfast.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "UK", "Title": "“Great location”", "Author": "lilactaxi", "ReviewID": "UR116240335", "Content": "I stayed in the hotel with my sister and 10 year old nephew for a 4 day break. The hotel room was a good size with plenty of space for the 3 of us. It had a wonderful shower which was really appreciated at the end of a days sight- seeing in the sunshine. The hotel is in a great location, a short stroll to the Ramblas and to the bus, metro and tour bus connections. I would definitely recommend the Petit Palace museum", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dom Rep", "Title": "“Excelent Choice, 3rd time in three years and will keep coming !!!”", "Author": "MaryDomRep", "ReviewID": "UR115984657", "Content": "Besides being just 2 blocks from Paseo de la Gracia and 3 block from Paseo de Las Ramblas, location is not the only thing great about this Hotel; its also staff, great rooms, modern design, laptops and internet free in your room and a great breakfast. Also great for families as it has rooms for up to 6 people, 2 adults with kids !!! Make your reservations with lots of time as it might be totally booked !!!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Summit, New Jersey", "Title": "“Beautiful hotel with great service”", "Author": "scarfdoggy", "ReviewID": "UR115630887", "Content": "We throughly enjoyed our stay at this hotel. We ran into some unexpected travel complications and they hotel was wonderful in understanding our situation and working with us. We had a triple and found the room to be large and elegant feeling -- much like the lobby. The larger than normal safes in the room were appreciated for those with laptops and the breakfast - included in the cost of the room -- had both hot and cold breakfast foods. While this hotel may not be in the thick of the La Rambla action, we found it to be close enough to walk to it but liked being able to get away from it when we wanted. We were able to walk to it with our luggage from Plaza Catalunya and enjoyed the hotel being close to a number of restaurants. We recommend this as a delightful place to stay.", "Date": "July 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location and clean. Rooms a bit dark.”", "Author": "Jimsworld", "ReviewID": "UR115534522", "Content": "The hotel is clean and in a great location. The rooms each have a laptop which is great. On the downside the rooms are a bit dark without too much natural light. The staff are a bit shy.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Columbus, Ohio", "Title": "“an ok choice”", "Author": "e_onthego", "ReviewID": "UR115120119", "Content": "Stayed here for 4 nights post-cruise. Above all else, it really does have a great location. It's close to everything, including the metro, local trains and airport bus. The things I liked were the in-room computer; large room size; large shower with \"tower\" of spray choices; and the extra set of windows on the outside to completely block all noise from the street. I wasn't very fond of the dark room and the poor in room lighting - not nealry enough; odd shaped sink; the mysterious large empty space in the room - looks like there should be a couch or oversize chair, or something; and a safe that requires a credit card swipe (still free) rather than a PIN. Probably the thing that gave the unwelcoming feeling was the ultra dark lobby and a front desk staff that never even looked up from the computer or paperwork as guests came and went. I did not try the restaurant, but did stop daily at the pastry shop across the street. There is also a Pans next door for a quick bite or breakfast. So, overall, if location is most important, it's fine, but I would certainly suggest checking out other options.", "Date": "July 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“great location, not friendly staff, hotel not the cleanest..”", "Author": "nilufery", "ReviewID": "UR110584670", "Content": "this hotel was the only unpleasant part of our lovely stay in barcelona. We booked in advance looking for good location and spacious rooms and kindly requested that in our booking. However when we arrived to the hotel we were given the smallest room with the smallest window facing absolutely nowhere. When we requested a change we were told it was possible the next day at 12.00. So we unpacked and packed again, went for a brunch the other day only to find out at 3 pm our luggages were still sitting at our old room. Staff was incredibly unfriendly. Rooms were not the cleanest and beds were not comfortable at all. (when we exchanged rooms they gave us two singles but we were so bothered to ask for a change again).. the only positives were a laptop, hairdryer that actually dries your hair and an ipod dock.. if you are only looking for technology& location, then its great, but then again there are so many hotels around the area.. i wouldnt recommend this hotel to ones who are looking for friendly, helpful staff, cleanliness and comfort..", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nice room but didn't like bathroom”", "Author": "Dritan", "ReviewID": "UR109316434", "Content": "Our family of four stayed in one of the family rooms. The room was very spacious and have lovely patio doors. We also received a complimentary bottle of water and truffles in the evening. Have to say the staff were all lovely and very helpful. My main quibble was with the plumbing. It took a long time for the sink to drain and some of the fitings didn't seem very secure There is a lovely whirpool bath but it was extremely difficult to get safely in and out of. The glass shower barrier came over half way along the bath and was immovable. There was no handle to help you to climb in or out and twice I almost slipped getting out of the bath. I think it would be fine if you are tall but being 5ft didn't help. My mother didn't even bother to try. Perhaps a hand rail would be an improvement.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Great location, over rated and overpriced”", "Author": "Ozmod", "ReviewID": "UR109159267", "Content": "Stayed there for 4 nights and was really underwhelmed by everything about it. First of all we were shown to a water damaged room that stank of wet carpet and possibly last occupants tears. After some standoff with the staff we were given a different room. Moving about the room is impossible as the beds( not double but two singles put next to each other) and tv stand left a gap of 5 cm between them. Beds weren't joint together and being on wheels always slid apart. Renovations in rooms were never completed as you can see dodgy work carried out and just covered up with sticky tape... Basically if location is ur main priority, go for it I'd opt something else. At €200 a night this hotel advertises itself as 4*. I'd say it's a 3* which is worth half of what it charges. Think twice", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Asia", "Title": "“High Tech Comfort in Barcelona”", "Author": "ThetravellingG0urmet", "ReviewID": "UR102825678", "Content": "MY first visit to Barcelona, the city of Gaudi, the renowned Spanish architect went off to a good start at the Airport where immigration and baggage claim was efficient. From Terminal 1, I took the complimentary green bus to Terminal 2. There, just outside the entrance, a convenient A2 bus cost only 5.30 Euros to bring me right to the city center near the Universitat de Barcelona in about 30 minutes. From the bus stop, it was a short stroll to the 4 star plus Hotel Petit Palace Museum at 250 C/Deputacio. I really recommend this high tech and modern hotel when you visit Barcelona. The staff are very helpful and friendly with a cool reception that looks like a studio of modern art. My cheery room was very well equipped with multi-coloured psychedelic furniture, and they even loan you a Dell laptop computer with complimentary internet access. As a bonus, the bathtub has a jacuzzi to soak away your jet lag, plus there is also an exercise bicycle provided for you to work out. I always find a good work out burns calories and fights jet lay at the same time. They also have a Sauna and small Gym in the basement. Yummy Desayunos (Breakfast) Breakfast buffet is served from 7am to 10.30am. The spread from cereals to fruit juices, yoghurt, Jamon (ham), Chorizo sausage, scrambled eggs , pastries, tarte tatin, pain au chocolate, tomato flatbread which you make yourself and fresh fruit is excellent! There is even Cava, Spain's answer to champagne for breakfast! The location of this hotel is very good. Nearby are many small restaurants and Tapas bars. Some cater to the Barcelona University students so they are not expensive. I had lunch during my stay at the Piscolabis Tapas Restaurant near the hotel. Adrian, the Manager made me welcome and in next to no time, I was feasting on L’Escala Anchovy & Bonito Montadito, ueber-crispy paper thin Tomato bread, potato Croquettes that looked like cute bolsters stuffed with Iberian Acorn Ham and Burrito filled with diced chicken, guacomole and melted cheese. Very tasty and satisfying! From the hotel it is just a short walk to the Placa de Catalunya which is the heart of Barcelona. Here you will see splendid fountains and greedy pigeons plus lots of people both locals as well tourists. From the Placa de c Catalunya it only took 10 minutes to walk to La Rambla. This famous pedestrian shopping center boasts many traditional stalls selling Spanish Turron (nougat) with almonds and hazelnuts, flowers, souvenirs, waffles with chocolate sauce and ice cream! There are also many street performers dressed in outlandish costumes that stand so still they appear to be sculptures…until they suddenly move! From La Rambla, I ambled over to the renowned and very historic gothic Catedral de Barcelona.The history and culture of this city impressed me greatly. I also dropped in on the surreal Salvador Dali Museum. Pillow Fight! One evening, making my way back to the Hotel Petit Palace Museum, I arrived at the Placa de Catalunya. The clock struck 6pm and suddenly hordes of laughing teenagers and even older people started attacking each other with all manner of pillows until the feathers flew like clouds of snow flakes! It was very boisterous and good natured as the pillow fighters shrieked and squeeled with happy laughter. Your trip whether for business or pleasure always goes well when you stay in a good hotel! Enjoy!", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wish I had spent ever night in Barcelona here”", "Author": "wavingdave", "ReviewID": "UR99150991", "Content": "I love this hotel. The location is wonderful. The staff are genuinely nice and helpful. (And I am not the sort of person who ever really needs the services of reception etc that much, but they were just nice people.) And there's a laptop in the room and wifi - wonderful. I would go back here again and again. And then you can nip over the road to Ramblas 31 for your coffee in the morning.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good hotel, but personal - not friendly.”", "Author": "vkovr", "ReviewID": "UR98766670", "Content": "In October 2010 we lived with our family in Barcelona Petit Palace Museum Hotel. Located in City Centre. Near Passezh de Gracia, where are many shops and cafes, metro and buses. Within a radius of a kilometer or two - a lot of attractions. Located in mod building of the last century. In the lobby - piano bar. Anywhere - Internet access. The hotel has 3 bikes - which are free of charge. But they are in terrible condition. The rooms are comfortable and clean. Stuff – is not too friendly.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stuttgart", "Title": "“Design without function”", "Author": "robnsus", "ReviewID": "UR94409560", "Content": "Room and hotel were trendy in design but failed to follow through with function. Definitely NOT four star. Bathroom was horrible design, no privacy with glass door to bathroom, only half glass covering to shower and leaked horribly soaking the whole room everytime, sink was impossible to wash face in.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sunderland", "Title": "“Fantastic Stay - Great Location - Great Staff (Made my stag weekend perfect)”", "Author": "bigbazwaller", "ReviewID": "UR94354138", "Content": "Just got back from a weekend stay at the Petit Palace Museum. Myself and 24 friends stayed at the hotel and had a fantastic time. The staff were excellent and helpful - Rooms were spacious and comfortable. Also the bathrooms are superb and clean. Hotel is located about 5 minutes walk to La Ramble so if was perfect for us being on a stag weekend! Would defo go back to this hotel - Thank you for the stay! Cheers", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“ANYONE WHO DIDN&#39;T LIKE THIS HOTEL IS TOO HARD TO PLEASE”", "Author": "GJKnox", "ReviewID": "UR89218730", "Content": "We are seniors who are seasoned travellers and this is our 3rd stay in Barcelona. We usually stay 5 star but we liked the Tripadvisor reviews on this hotel so this is where we booked for 3 nights and we thought is was great value and inexpensive. We had a street facing room and ther was no noise at all ...maybe it was all the drinks with tapas?? We loved the rooms and the laptop. The shower was fabulous. When we checked in we were offered a special deal on breakfast which we took. We had a hot breakfast and there was pleanty of everything, no wait for coffee. There was a very attractive young blond receptionst who checked us in and I am sorry I did not get her name because she was always very helpful at all times with directions and providing advice. The young man on the evening shift sent us to a great tapas bar which was packed with locals, (I think it was called TAPAS 24. We had a memorable evening. This hotel is in a great location just a few minutes walk from everything. We highly recommend this hotel and will be staying there again next year. Judith and George, Brisbane, Australia", "Date": "December 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice but a few irritants”", "Author": "CAtraveler2k", "ReviewID": "UR89043848", "Content": "Good location. Ok bed (for Spain...most beds seem hard as rocks). If you are sensitive to sound don't get a window on the street as the folks on the street seem to be loud most nights. The breakfast is decent, except you have to wait to be served coffee or tea, which is highly annoying. I was always half done with breakfast before someone came out to ask if we want coffee. The day we left there was no hot water, which is extremely annoying. I notified them at 7am. At 7:30 they said it was fixed. By 10am when we left there was still no hot water. Since I could not take a shower, I went down to get coffee. As usual, even though food is out, no one is there to serve coffee. I went back to the front desk to ask if they could ring the person, and then I was served coffee from a grouchy person. Perhaps they think that being served coffee is better, but I find it extremely annoying that I can't get a cup of coffee on my own.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Nice hotel, quite expensive though”", "Author": "frosw", "ReviewID": "UR87377346", "Content": "We really enjoyed our stay at that hotel, eventhough it was kinda expensive... We payed 123 euros per night, breakfast excluded. We had breakfast only one day, it was nice, but too expensive, I think 16 euros per person, especially when you already pay that much money for the room... The staff was kind, especially the guy at the reception, the room was very clean and they replaced all the bath products every day!! The location was really good, just 700-800 meters from plaza Catalunya, which is ideal.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great room and location”", "Author": "Clownfish88", "ReviewID": "UR85493158", "Content": "In July 2010, my family of 4 stayed for 1 night at the BCN Petit Palace Museum after our 12 day Med cruise. It was an enjoyable stay....and here's why: - Queen size bed for us and bunk beds for the kids ... very hard to find rooms in Europe that will accomodate 4 individuals - Huge room with a dining area - Beautiful bathroom - glass door was a little different - Free WiFi service in room with a laptop available in room for use - Loved the modern decor - Great location - walking distance to Plaza Catalunya & La Ramblas - Close to local restaurants - walking distance to great tapas bars; very good bakery across the street (perfect for an inexpensive breakfast) - Great price since we didn't need to book 2 rooms", "Date": "October 31, 2010"}, {"Ratings": {"Overall": "2.0", "Service": "1"}, "AuthorLocation": "New York", "Title": "“Bad Service”", "Author": "EaseIntoItaly", "ReviewID": "UR84453451", "Content": "MY clients traveled to the Hotel Petit Palace Museum Hotel in Barcelona for a three night stay and were told upon arrival that they were not confirmed for the first evening of their stay. My clients arrived with a confirmation for three nights. They were put up in another hotel for Saturday night, and moved to the Petit Palace Museum Hotel for Sunday and Monday nights. Not good service in my opinion. New York Travel Service Owner", "Date": "October 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Nice place, perhaps a little overrated”", "Author": "groovy_j", "ReviewID": "UR81644904", "Content": "This hotel is stylish and romantic. The location is medium but the old town is still within walking distance. Value for money is perhaps not the best but we still enjoyed staying there.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Good but some little problems for a 4-Stars Hotel”", "Author": "French-Doctor", "ReviewID": "UR81009406", "Content": "This hotel is good and I am sure you will be happy to go there. Especially because the location is perfect in the city centre (The ramblas is very closed, the metro is not very far and you can be on the Catalonia Place in 5 min). Moreover, you can enjoy a design and modern decoration in your room and the hotel hall, but also in the corridors and the breakfast room. You can have free wifi in your room (you also have a PC laptop in your room. It works well but I did not use it because I had mine). Effectively, I also found a rather cold staff (and always behind the desk) but they are very kind and helpful. Of note, the breakfast is made with high-quality products. There are however some little things that should not be encountered in a 4-stars hotel : your clock-radio allows you to listen your Ipod but does not charge it. Mostly, the room is quite of cold atmosphere and very dark : the light is not sufficient and all electric lights are mandatory all the day. There is no coffee or tea-maker in the room and, mostly, the bathroom is not a 4-stars hotel bathroom. OK, the shower is very modern but the basin is low and lays on a wooden plank which is very cheap and not convenient. Nothing dramatic anyways but I would rather place this hotel in a good 3-stars category.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Fantastic location, good location & rooms”", "Author": "chicagodono", "ReviewID": "UR73078213", "Content": "Fantastic location, close to Plaza Catalunya and shopping/restaurant areas and within 10 minute walk of Ramblas and other tourist areas, but far enough away from the tourist areas that you don't have to worry about the pickpockets and late night crowd. The staff was helpful. Plenty of restaurants close by for cheaper breakfast than in hotel. Room was modern and clean. Free laptop access and free in-room safe were great, many hotels in area charged for safe acccess. Glass door to bathroom not very private and doesn't close all the way, but fine for us. Our room was very quiet. Would definitely stay again.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Excellent hotel, Fabulous location !”", "Author": "CJ70", "ReviewID": "UR71107318", "Content": "Excellent hotel with a fabulous location. If you are visiting Barcelona for the first time, this is the hotel to be in. The staff was really helpful and the hotel was newly renovated with best quality in offer. Highly recommended! p/s...Just a footnote to mention that do be careful with your handbags while roaming the streets in Barcelona touristic areas. We got mugged the first day of our stay in a street called La Rambla. These people operate smoothly and professionally and managed to whisk away our entire camera bag. The hotel staff were very helpful in this situation with their advise!", "Date": "July 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“lovely, modern hotel”", "Author": "carolb1988", "ReviewID": "UR69338014", "Content": "very cool. very modern, hip. close to la rambla and sagrada familia. close to many shopping areas for shoes, clothes, foods. beach front was not as close as i originally planned. walking from the hotel to the beach in flip flops or sandals will definetely make your feet hurt. it was remarkably quiet in our room. cool bathroom and decor, but completely NOT functional. basin too small, counter too low, wasteful shower, not private for bathroom \"breaks\" and chairs in room were not even sit-able. bed was very comfy", "Date": "July 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stockholm", "Title": "“smal rooms but cozy”", "Author": "Kian19", "ReviewID": "UR69305933", "Content": "good location but the staff are not very helpful. The location is quiet good if you like to hang around the La Rambla. alot of trafic outside makes the room quiet noisy.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Great hotel esp with young children”", "Author": "byf6915", "ReviewID": "UR69012895", "Content": "Stayed for 3 nights and got the family room: queen bed with two bunk beds. The beds were comfortable, room was quiet and it was great to have a laptop with free wifi in the room. The middle portion of our bathroom door was frosted so that provided enough privacy. Lots of restaurants around the hotel. We tried a different bakery everyday :) I would definitely stay here again.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "northumberland", "Title": "“Perfect”", "Author": "carlyjo87", "ReviewID": "UR67557264", "Content": "Me and my partner stayed here for a night before our cruise and a night after our cruise. It is a fantastic hotel, really modern and has brilliant facilities. The rooms were amazing, very modern and high quality. The bed was really comfortable, and the shower was the best i have ever seen and used. The free use of the laptop was a nice touch too. On our 2nd night we were upgraded to the junior suite (room 405) , the room had the same great facilities but also had a hot tub which was very romantic. The location of the hotel was also perfect. You literally walked out the hotel, turned right round the corner and there was a street full of cafes, restaurants and bars. I can recommend the El rocco restaurant, really good food and resonable prices. So if you book room only there are plenty of places to eat out for breakfast. Also, it is only about 5 mins walk from Las Ramblas so really easy to get around. I really enjoyed my stay here and will definately be going back,", "Date": "June 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Smart hotel, good area, would stay again”", "Author": "dottyday", "ReviewID": "UR67104094", "Content": "Nice funky hotel in a really good location. Beds are comfortable, shower was impressive and the free wi-fi was a nice touch although a little slow. Ask for a balcony room, they are on the front of the hotel but not noisy and it is nice to open the doors and look out. We didn't do breakfast and were glad, our friends did it on the first day and were not impressed. Instead go across the road to the cafe on the corner, they do fantastic freshly squeezed orange juice and coffee and the most amazing pastries, savoury and sweet. It is used by the locals and we went there every day.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "roma", "Title": "“design hotel, da raccomandare”", "Author": "carmenRM", "ReviewID": "UR66219400", "Content": "we stayed in this nice, modern hotel for 3 nights; the family room is the one showed among the hotel pictures; it is quite confortable, beds are ok, no noise at all as it was on the retro-side. Bad news for the Batrhroom: no privacy at all, as it doesn't have keys and the door is made of glass! furthermore, they do not refill the water in the Mini bar; otherwise, excellent position and fantastic cake shops for our breakfast just a few steps aside.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Orlando, Florida", "Title": "“Barcelona is for shopping and great food!”", "Author": "mjane1999", "ReviewID": "UR65184329", "Content": "We stayed at the Petite Palace for 2 nights after doing a cruise. I did lots of researching on the internet for a close location to the La Ramblas area within our price range. By their desription it sounds like you can walk to it. By the photos it looked really beautiful and it is. My aunt and cousin travelling with us made reservations at the Petit Palace Opera Garden by mistake and found this out at check in. So they grabbed a cab and checked in over there. Petite Palace was away from things and you have to take taxis to see anything. We walked back to it from the Las Ramblas one of the days and it was a trek. Not recommended for and 82 year as was my Mom. We were not happy to find out that it was not as close as they let you believe. We booked a triple room and it was tiny. There were 3 twin beds basically all in a row pushed together. And they were not comfortable either. The colors in the room were whites and greys sort of dark and dreary. The lighting was terrible!! The bathroom had a nice big shower with lots of shower heads if you had the time to figure them all out we did not. We had a view of the street but basically it was a high end shopping district which isn't what we were into at the time. Front desk service was ok, nobody gave us a warm welcome. Very business like and no smiles. When we visited our travelling companions at the Petit Palace Opera Garden having to get there by taxi. We were dropped off say midway down the La Ramblas area to their hotel. We were so envious when we saw where it was. Their mistake turned into a blessing in disguise. They were in a much better location than we were right in the heart of La Ramblas! And they paid about the same price as oursl. The Petit Palace Opera Garden sat right in the alley 2 stores away from the main drag of La Ramblas. But when I say alley it was an alley/street filled with all of these great shops and restaraunts galore right at the doorstep that ran into all of these other great streets They were endless! The rooms at their hotel were big and bright and light with whites and yellows. A big difference in feel and more comfortable looking. The hotel was very unique. So my review on Petite Palace don't do it. Stay at Petit Palace Opera Garden instead you will be very pleased. (But beware!!! my Aunt staying had her purse pickpocketed down that same alley way. But not blaming the hotel at all for this at all. They warn you about it and it happened to us. My aunt was carrying a backpack and we were down the alley shopping and my Mom saw her purse was open and her things were falling out. So she looked and her wallet and passport were gone. So don't carry your passport while out either. But her only reason for carrying it was they just checked in and rushed out to see the great shops and forgot to take it out before leaving the hotel. LUCKILY after having to go file a police report after getting back somebody found her passport in front of one of the shops. It really was a MIRACLE that somebody found it that quick and that she was able to fly home the next day. So please take this to heart and believe it really does happen.)", "Date": "May 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Middelburg", "Title": "“Perfect stay in Barcelona”", "Author": "eric61", "ReviewID": "UR63567127", "Content": "A Perfect hotel on the Diputacion in Barcelona. We spend here 4 days with teenage children in a Family room. A large double bed with two large single beds mounted at the wall. and surprisingly an extra room with a large table an four chairs with balcony view A modern designed bathroom, quite luxureous, through the hotel you have a wifi internet connection, every room has his own laptop, and in the lobby you have three laptops with free internet acces. We booked this hotel for its familyrooms a his excelent location in the centre of Barcelona , quite close to the underground, walking distance to the plaza del Catalunya for bus trips and walking distance to the Ramblas and Bari gotic ( the Old city ) every point of interest is close by or very easily found by transportation. A hotel that is a part of High tech hoteles, I would really recommend this hotel to everyone. The breakfast buffet was for continetal breakfast as well for a spanisch breakfast . It has two bicycles who can be used for its customers. Whenever you search for a good and clean hotel affortable, Choose this one", "Date": "May 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Windsor, United Kingdom", "Title": "“Ummm - could have been better.”", "Author": "cang30", "ReviewID": "UR63395787", "Content": "Customer service in this hotel is non-existant. On check in, it is 'here's you key, the list isover there', no one to carry your bags or take you to your room. Breakfast - too expensive, poor, no staff, so you are waiting ages for a cup of coffee. Very trendy and contempory - yes. Comfortable - ish. The one saving grace of our trip was that we had a suite with a terrace and hot-tub. This was superb and was very welcome after a day of walking. Would we go back? No. Laptops in the rooms with free internet was good though. Also, those people who say it is a great location obviously like walking, because it is at least a 15 minute walk until you get into the heart of La Rambla. There are better hotels in Barcelona and even with a discounted rate, this was expensive.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“GREAT HOTEL”", "Author": "HonestlyLeicester", "ReviewID": "UR62410142", "Content": "Don't hesitate to use this hotel. Great location and if you book with booking.com you will find some great rates. Lovely modern hotel. Wouldn't bother with the breakfast in the hotel, some great cafes around and about the immediate vicinity.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stylish hotel in a great location”", "Author": "mattreid", "ReviewID": "UR62398252", "Content": "Like the other Petit Palace hotels in which I've stayed, the style is very contemporary and the lobby, rooms and especially bathrooms are very tastefully and functionally designed. We stayed for 3 nights over the Easter weekend, and were very comfortable in the hotel, despite having to switch rooms after the first night due to a mistake with our booking. I've never stayed before in a hotel with an exercise bike in the room! The hotel is located conveniently a short walk from Passeig de Gracia and Placa de Catalunya, and we were able to walk to most of the places that we wanted to visit. For more distant sites (e.g. the Nou Camp!), there are Metro stations and bus stops within a couple of minutes walk. The only negative comment I'd make about the hotel is that there are not enough staff during the breakfast period - at times we had to wait longer than we'd expect for a clean table and coffee/tea.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plattsburgh, NY USA", "Title": "“Perfect location, wonderful accommodations!”", "Author": "Familyof5travels", "ReviewID": "UR61752642", "Content": "My family of 5 (myself, husband, 10 year old son, 8 year old son, and 3 year old daughter) had considerable trouble finding accommodations in Barcelona that would house us all in one room. The Petit Palace Museum, located in the Eixample district, was a perfect fit in more ways than one. The room we stayed in was 111, and had a king sized bed and bunk beds, also a nice sized dinning room with windows that opened out to the courtyard. The hotel was just so nicely located, just off the Passeig de Gracia and a few blocks from the Placa de Cataluyna and La Rambla. The best shopping is surrounding this hotel.Just a block or so up is a metro station, which is the only way to travel in Barcelona-it is safe, super quick, and takes you everywhere you want to go. Having said that, we did do the Barcelona city tour on the bus turistic, taking both the red and green lines all over the city, which was really fun for the kids and gave us a better feel for where things were in the city-plus we got to see things we really didn't have time to get out and explore on our 6 night stay. We did stop mid day on the tour at Parc Guell, totally worth going to, kids loved it and so did we, plus gorgeous views of the city. The hotel was very helpful in telling us how to find things, they recommended the best Tapas places and had yummy Cava at the bar almost nightly. We loved it in Barcelona, and we couldn't have had as great a time if hadn't had the respite of a really great hotel that fit the needs of our big family.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Excellent Location / Excellent Value”", "Author": "drleb", "ReviewID": "UR59702303", "Content": "We stayed for a four day trip to Barcelona. Location was perfect for getting all over the city either on foot or public transport. Rooms were large and well furnished (stayed in a family room). Did not eat the breakfast, it was rather expensive, but all around the hotel were nice Tapas restaurants open for breakfast, so nothing was lost. Overall a great hotel. If you are looking for a luxury accommodation, it did fall short though, as it could use a bit more finishing on the quality.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "orlando florida", "Title": "“Perfect Location, nice hotel”", "Author": "searchinggreatfood", "ReviewID": "UR59040283", "Content": "Traveling with children ages 11 and 15. Hotel is perfectly situated. one building off the Rambla catalunya (a wide boulevard, with a pedestrian area in the middle, lined with outdoor cafes, benches and trees. This is in the Eixample neighborhood, just north of the touristy area. About 3 blocks from metro stations. We took the RENFE from the airport to Passeig de Gracia station and walked to the hotel. (about 70 cents each person from the airport - buy T10 metro pass). you can easily walk to Guadi's Casa Battlo, Plaza Catalunya The hotel's web site pictures are just what the rooms look like. We spent 4 nights there, 2 nights in girona and then the last night again at the Petit Palace. Family room is large has king bed, and bunk beds, each bunk has a mini tv in the wall, large tv in the room, AND a lap top (free). Nice to have internet acess in the room. Also laptops in the lobby. Room was ready for us when we arrived (about 10:00 am). Staff is very professional, helpful and spoke english. Across the street is pastry/coffee shop \"Rambla 31\", with aromas that beckon you in. Cerveceria Catalana within walking distance, go early to avoid wait, a VERY fun tapas experience", "Date": "March 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond BC", "Title": "“a great place”", "Author": "jeanrenee", "ReviewID": "UR58566731", "Content": "We have been in this hotel for four days. We will be staying for an additonnal 10 days. This hotel is marvelous and first rate. It is situated in a great part of town, very close to the famous Rambla. Great restaurants and shopping nearby. The lobby is modern and trendy. The staff is pleasant and very accommodating. Our room is spacious and luxurious. with our own portable computer My only complaint is the little cubicle they call a training room. Over all I would rate this 4 star hotel very highly.", "Date": "March 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sweden", "Title": "“A modern 4-star hotel with perfect location”", "Author": "DaraU", "ReviewID": "UR52434116", "Content": "Me and my boyfriend stayed at the Petit Palace Museum during New Year's Eve 2009. We got upgraded to a junior suite for free, meaning that you stay in the highest floor with a rooftop terrace and an outdoor jacuzzi. The room itself has a very modern decor and is nice, but a bit on the small side. There is a laptop computer, which is very easy to use and the internet works excellent. There is also a flatscreen TV. We really liked the interior design, it's modern and you feel a bit like you live in a designer hotel. What doesn't make this hotel/room 5-stars is the fact that if something isn't perfect or has been worn out, it won't be replaced. For example the hip chair in our room had \"dirty\" fabric and the wallpaper was coming off in one corner of the room. If you're not picky like me though, you won't even notice (I'm sure my boyfriend didn't) and it does not make the stay less nice. The outdoor terrace is amazing. It is actually larger than the room itself and has nice sunbeds, cool lights and a beautiful jacuzzi which was heated to a nice temperature. I would definitely want the same room if I returned. There is even a palmtree plant. The toilet is very nice and modern. The shower area is very large and it has a hip shower. I suppose the fact that there is a glass door as a door would be bothering if you don't you know the person you share your room with. The staff isn't unfriendly at all, but on the other doesn't go out of their way to make your stay perfect. While we were there we got some cava, grapes (a Spanish tradition) and sweets for free which was very nice though. This is not meant to be a complaint, but if you value personal service a lot, I'm not sure this hotel is for you. The location is perfect, just a few minutes away from Passeig de Gracia and Placa Catalunya. Also it is much more quiet than those streets so it was perfect for us! If you want you can borrow bikes for free from the hotel and ride your bicycle around town. I definitely recommend staying at this hotel, but I think it's best suited for people who appreciate modern interior design, internet availability and are a bit self-going!", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ankara", "Title": "“Stylish and cool Petit Palace Museum”", "Author": "Capital06", "ReviewID": "UR50624058", "Content": "We were in Barcelona 26-30 Nov. for our holiday and stayed at Petit Palace Museum. These are the pros; 1-Peaceful, clean and comfort room, convenient bath, graceful service, cool and stylish lobby. 2-Free bicycle for exploring charming Barcelona. 3-Good locatıon, very close to presented Tapas Restaurant like Farga, Ciudad Comtal, La Tramoia, and close to cheerful Rambla and luxury Passeig de Gracia. Walking distance to sea side and all the historical places. 4-And the best ever; high speed laptop in the room. More over 3 laptops at the lobby. You can plan your daily trip from the laptops. Now these are the cons; 1-No slippers in the room, no city maps. 2-Transperant bath doors. 3-A little bit noisy air condition. This hotel is available for short accommodation.", "Date": "December 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Atlanta", "Title": "“Good location and service”", "Author": "ssettless", "ReviewID": "UR48146006", "Content": "The staff was very accomodative and friendly. Hotel was great. We enjoyed our stay tremendously. The computers in the room were very useful. The family room is FANTASTIC - there are 4 TVs, laptop with printer, double hydro massage bathtub with harem-like curtains and a dining table. The hotel is a 10 minute walk from the center of the city.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“High Tech Hotel with great location”", "Author": "maryefinucan", "ReviewID": "UR46194178", "Content": "Laptop in the room -- very cool. Had a junior suite for three of us. Huge room by European standards. Perfect location -- close to \"the action\", but quiet neighborhood. Walking distance to Las Ramblas, Sagrada Familia, and other Gaudi sights. Excellent restaurants close by. For those who aren't used to Spanish coffee (like us), there's a Starbucks a block away. Staff not the friendliest, but very competent.", "Date": "October 8, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“A bit disappointing - good location, nice lobby but too expensive”", "Author": "LondonSev", "ReviewID": "UR46071041", "Content": "I guess the hotel didn't fully meet my expectations having read all the glorious reviews. The room was small for a family of 4, there was no view whatsoever and when I first went into the bathroom found a couple of unknown bugs running around. The breakfast was average and expensive. WIFI is free which is nice, the lobby is also quite enjoyable and the location is of course fantastic. All in all, not sure I would splash that much money again.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Wonderful boutique hotel, perfect location”", "Author": "7Bluefield", "ReviewID": "UR45363964", "Content": "We had a fantastic junior suite with huge deck complete with jacuzzi and sun chairs. The room was very modern, with great bathroom and shower. The free use of laptop and internet in the room was an added bonus. The location was within blocks of the Las Ramblas and the Plaza Catalunia, great restaurants, shopping and metro. It is off of the main street, so it was also quiet in the evenings. We didn't have breakfast at the hotel, but just across the street was the most amazing coffee and pastry shop that we went to every morning. Also great was the small convenient store next to it.", "Date": "September 29, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "3", "Value": "2", "Location": "5"}, "AuthorLocation": "Kelowna, Canada", "Title": "“Good location, clean room”", "Author": "thomasl_no", "ReviewID": "UR44915443", "Content": "Location was very good. Walking distance to very nice shopping, sights (markets, la rambla, old city etc.) and restaurants. Located on a smaller street, so no problem with noice. Room was clean, small (but not too bad) with a comfortable bed. Laptop with internet connection, mini bar. We had a small balcony as well, overlooking Street Diputacion. Stay away from the break fast. 15 € = way to expensive. Cross the street to La Rambla 31 instead. Locals seems to like it too. Cortado, pastries or baguetts in a bussy but fun cafè kicks off the day in a better way than the breakfast room in the basement of the hotel. Staff was OK, but didn't but in any effort for you to feel welcome. They seem a litle bit amateur, and should all get some training in guest service. In my opinion this should take a way a star in their 4 star hotel class. I would go back to this hotel for a weekend stay. The location is good and the room was clean.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tamworth, United Kingdom", "Title": "“A moment of luxury and comfort in a busy city”", "Author": "bradnsj", "ReviewID": "UR44149062", "Content": "splash out on a room with terrace & hot tub. Enjoy the really comprehensive breakfast. Only downside was the poor choice of English speaking TV. There was only CNN in American. Why not take BBn World Service?", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "West Midlands", "Title": "“Fantastic hotel... brilliant location.”", "Author": "MissVPlum", "ReviewID": "UR40052184", "Content": "Visited this hotel in Jan 09 and had a brilliant time! The hotel is gorgeous and so close to the centre of Barcelona. The reception staff were really friendly. The rooms we're so comfortable with everything you could need for a city break. Even a laptop with internet connection. And yes there was a glass bathroom door but isn't as bad as it sounds. The bathroom was lovely in particular the shower! So relaxing! Would definately recommend this hotel and would love to go back again sometime!", "Date": "September 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great hotel and location”", "Author": "abounatom", "ReviewID": "UR40031118", "Content": "We stayed here for three nights after a Mediterranean Cruise. The hotel staff was friendly and the hotel is just a five minute walk from Plaza Catalunya and the top of Las Ramblas. It is in a safe and nice neighborhood with lots of restaurants and cafes. It is a modern chic type hotel (similar in style to a W Hotel) with free wi-fi and internet access. The showers were great with lots of jets and the rooms have laptops in them free of charge. We are a family of four and those rooms were especially good as the additional beds are bunk-beds each with a little TV. The kids loved that.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Large US City", "Title": "“TINY rooms, no wifi in room, poor a/c, stay away”", "Author": "SeasonedTrvlr", "ReviewID": "UR38444196", "Content": "Ok I got fooled into staying here from the other reviews, but what I missed in retrospect was taking a look at the other's profiles. This would be a great hotel for 2 23 year olds on a budget looking for something cool - but to someone a little older with taste this hotel is horrible. Poor a/c Sheets are made of sandpaper Mattress is from 1975 Service is indifferent Room is TINY. Walls are thin, you will hear all of your neighbors. Lighting in room is quite poor - a lot of industrial grade flourescent lights?? Location just ok. This is really a 3-star hotel, if that's what you're looking for then yes you will be happy.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Vancouver", "Title": "“Cool rooms, good location, helpful staff....”", "Author": "ap200", "ReviewID": "UR38410155", "Content": "We stayed three nights at this hotel in mid-Aug 2009. ROOMS Very comfortable. Well kept and clean. Decent size. This is a new, well kept hotel so we were very happy with the rooms. Upon check-in, we had an issue with a leaky shower. They changed our room the next day. The staff were helpful, responsive and diligent while dealing with the issue. We were impressed. All rooms come with a laptop and free high speed internet. STAFF As noted above, they were all helpful and polite. We were happy with the service. LOCATION Two blocks from Placa Catulunya and three blocks from the Ramblas. Basically a great location. OTHER COMMENTS Paid approx. 40 EUR to take a taxi to the airport. The airport bus is also available and leaves from Placa Catulunya (in front of El Corte Ingles). Room service is not available around the clock. We called for coffee around 11am and were told that it was not available. Not a big deal since there is a 'Pans' coffee shop literally 10 meters away. OVERALL Clean, comfortable, well kept rooms... we were happy and would stay here again.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Stylish Hotel, Great Location”", "Author": "muffaletta", "ReviewID": "UR36557625", "Content": "Stayed for 3 nights at the end of July with a last minute booking. Good location near to Placa Catalunya so easy to get the Aerobus from the airport a a walk of 2 blocks to the hotel. Open areas and rooms are stylish and the facilities in the room are very good without being over the top. The laptop in the room was a real help after we had a our wallet stolen to help get the credit cards stopped (beware - theft is a big problem in Barcelona). Whilst having style it does lack atmosphere - small bar in the foyer unused so if you want a late night in the hotel bar this might not be the place for you. But if you want a stylish hotel, good service and close to restaurants and within walking distance of the main sights then this is a good choice", "Date": "August 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice hotel, great locations, too expensive & I got a dodgy room”", "Author": "PaulyOnHerOwn", "ReviewID": "UR36006718", "Content": "All is said in the title. The price was too high, the advertising & promo pics a bit too generous, and while it may look lovely, there were plenty of damaged items, broken fixtures etc in my room. The toilet leaked, was not adequately repaired, and when moved to a new room, we saw the early signs of the same problem coming... the toilet was rickety, the fixtures barely secured to the walls, the best was pretty averge... The laptop with internet in each room was a nice touch, as was the ipod dock. Still... I won't pay that sort of money for this type of hotel again. I tried 3 or 4 different hotels in Barecelona that I preferred, a couple of which cost MUCH less.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Modern Minimalist in Great Location”", "Author": "sfmikeyo", "ReviewID": "UR35423892", "Content": "Very nice boutique hotel just around the corner from Las Ramblas. Very clean, great service...not a lot of frills, but everything we needed for a wonderful stay. Rooms come equipped with laptops and free wifi. Be sure to check out the free bicycle rentals offered by the hotel...terrific way to explore Barcelona.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Malta", "Title": "“Still great - second time around - nice to see consistency”", "Author": "dcassar", "ReviewID": "UR34613534", "Content": "This is the second time I stayed at this hotel after a great vacation with my wife in Feb. 09. I am not going to repeat everything from my first review - but this hotel is truly a gem with a great location. The staff is always friendly, the accomodation and services superb and the location is second to none. Apart from that there is a great coffe shop just across the street.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Gatos, California", "Title": "“Charming room, excellent location, great service”", "Author": "esarkissian", "ReviewID": "UR31328315", "Content": "My girlfriend and I stayed at the Petit Palace in May 2009 with a mutual friend. We were quite pleased with our room in almost all aspects - cute decor, ultra modern bathroom & shower, and great location. The view was decent, but could have been a bit better. They placed our friend's bed in a separate cubby by the window, separated from us by a partial wall - perfect for privacy and comfort. The staff was excellent! Very friendly and accomodating, especially the bearded guy (didn't get his name). We went to him quite a few times for recommendations on tapas restaurants, bars, sights and such. We were constantly pulling out our map for him to mark. The laptop in the room with free Internet was a nice touch as well.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "notts", "Title": "“good hotel, great location”", "Author": "nottspalace", "ReviewID": "UR31104403", "Content": "This is a really good hotel. Whilst the hotel itself is great, it's main attribute is it's location. The room was fine, whilst probably only just being \"4 star\". For example, we asked for a double bed and made sure by e mailing the hotel directly a week before and got their confirmation that we would have a double bed (it was our 10th wed ann after all !!) but when we arrived we found 2 twin beds pushed together. However, when you have seen around the city, you soon realise the main gift this hotel has is it's location. I cannot see how you could possibly get a better one. Barca itself is fantastic. If i could give 3 bits of advice for staying in Barca it would be 1) stay in Eixample - it's a great part of the city being central and really nice. 2) Don't get too excited about La Rambla - it's good but there are plenty of other places in the city. 3) Get the 2 day tourist bus ticket - can't do the city any better. Overall, a fantastic place. We loved it", "Date": "May 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Preston", "Title": "“Fantastic Stay at Petit Palace Museum”", "Author": "Joanne1988", "ReviewID": "UR27740145", "Content": "My boyfriend and I enjoyed a great 3 night stay at the Petit Palace Museum at the end of March for my 21st birthday. The hotel was one of the nicest and best value for money that I have stayed in, and we loved the modern room with the chic decor and extras such as the laptop with free internet connection, the ipod dock, the flat screen tv and the hydro-massage shower. There was also a free safe in the room which just required you to swipe any magnetic card other than the room card to activate it. The room was also very comfortable and clean, with daily maid service. The only fault was that we were allocated in a room where the whole bathroom was modified with disabled rails, meaning we didn't have the normal bathroom units as shown in the hotel photos and had a very low sink. We didn't see this as a big problem considering all of the plus points of the room. Aside from the rooms, the hotel was in a fantastic location, with 3 metro stops within very close walking distance, and Playa Catalunya only a 5 minute walk away. This was very convenient for getting the Aerobus to and from the airport at roughly $7.50 return, which ran every 10 minutes or so. The area itself was very modern with lots of boutique shops and good restaurants. Las Ramblas was roughly a 10 minute walk away, several of Gaudi's attractions such as Parc Guell were within walking distance and everything else was easily accessible on the metro. Overall it was a great stay and we would recommend this hotel to anyone staying in Barcelona. Unfortunately we weren't blessed with the best of weather on our trip, with it raining for one of the days, therefore I would be tempted at some point to return to Barcelona in the middle of Summer and would stay at this hotel again.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Posh Essex girl", "Title": "“Fab hotel”", "Author": "auntytoe", "ReviewID": "UR27635808", "Content": "My husband and I stayed here from 3rd-6th April 2009. I thoroughly recommend it. I had read some mixed reviews on tripadvisor so was slightly worried but it was great. Our room was like a Manhattan loft apartment. Not in terms of size (it was a decent size though) but in terms of decor. There was an exposed brick wall, timber frames and trendy art work. Bizarrely there was an exercise bike in the room that needless to say we didn't use but there was a computer with free internet access and an iPod dock. Large king size bed (not two beds put together). We didn't do breakfast as it seemed too expensive but we recommend a little bakery/cafe over the road called La Rambla 31. The hotel staff were very friendly. We got a bus from the airport to Placa Catalunya and walked 3 or 4 blocks - is fine if you don't have too much luggage. This is much cheaper than getting a taxi. The buses arrrive every 6 mins so it really is the best way from the aiport - check out the getting there and away section for Barcelona for more info. P.S. I preferred staying here in the L'Eixample area rather than the narrow streets of Gothic Quarter off la Rambla. You can walk there but it was nice coming back to wide streets, posh shops and a seemingly breath of fresh air.", "Date": "April 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Munchenjuerg", "Title": "“High Tech truly fantastic.”", "Author": "Munchenjuerg", "ReviewID": "UR26369339", "Content": "This hotel seems to be getting some mixed reviews, but my impression was very positive. This is a trendy, boutique hotel. While the rooms were small, they are well designed and very comfortable. The solid, heavy windows blocked out any traffic noise from outside, and I didn't hear any noise from other rooms or the hall, but I also didn't see many other guests. The large, LCD screen TV, Ipod stock, laptop with high speed connection, all included in the room rate. Some of the technology is a little on the new and untested side. The bed was amazing and I do not lie when I say that I had yet best sleep ever when stayed in hotels. Bathroom was very modern. Excellent water pressure from a ceiling mounted showerhead, handheld one and the hydro massage on a wall. Bathroom door is only frosted glass, so anyone that needs to feel privacy from their roommate may not like this. They provide some nice extras like toothbrush (which I forgot home) body lotion and after shave. The lounge area looked cozy and inviting, the music was good and the waitress in bar made some very tasty cocktails. I have to say that they could really use some pianist to play the piano some evening to make it more crosier atmosphere. I didn't need to interact too much with the front desk, but they were very nice on check-in and checkout and always said hello when I came or left. The guy in reception during a night time remembered my name and greeted me by my name every time I passed and was very attentive with suggestions what to do and where to go. It felt like being home and same time nice gesture to be acknowledged. I wish all the hotel staff could be like that. I got a good rate (€149), and think it was well worth the price.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ioannina, Greece", "Title": "“Excellent Hotel! - We will sure come back!”", "Author": "Costas_K", "ReviewID": "UR25183597", "Content": "We have been to Petit Palace Museum in late January for 7 days. It was by far the best hotel that we have ever stayed in! First of all, it is located in a terrific place, the centre of Barcelona - just 3 minutes from Plaza Catalunya and the Metro Station. Athough it is in the centre and there is a road just outside the hotel, the rooms are very well soundproofed. We never listened to any noises from the street or cars. The rooms are very well decorated - both classic style with modern details - spacious and with many extras like the Laptop with free internet access, the LCD TV and of course the great bathroom with Hydromasage shower. Also the room was very very clean. The staff was very helpful and they answered to us immediately to every question about where to go. They also were talking very fluently the English language (something that can't be found easily in Barcelona). The only thing that we didn' try was the breakfast. We didn't book a room with breakfast because it seemed a bit expensive, so we can't make a comment about it. But that's not a problem since there are many shops just around the corner with excellent food. We will sure come back to Petit Palace Museum the next time that we will return to Barcelona!", "Date": "February 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "london", "Title": "“Great location but hotel was disappointing”", "Author": "Cherie39", "ReviewID": "UR24882093", "Content": "I booked a citybreak to Barcelona as a valentines present for my boyfriend and I had booked a superior double at the hotel, but on arrival we were given a family room (a double and 2 bunk beds), so not exactly romantic. In the end we were moved to another room which had twin beds and there was very limited space to move around the room. We were told the hotel was fully booked so this was all they could offer, even though we had confirmation we had booked a superior double. Whilst the hotel is in a great location I would not stay here again, it lacks any atmosphere.", "Date": "February 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“The best in Barcelona”", "Author": "grete62", "ReviewID": "UR23725931", "Content": "Being back now from our Christmas/New year trip to Barcelona, I thought I would like to share my comments. Barcelona has always been my favourite Spanish city and every time I go there it has something new to offer. This time the most memorable and newest experience was our hotel. Petit palace Museum is worth every single penny and even more when to take to consideration that the hotel front desk staff will do almost anything for you just to make your stay memorable. I fell in love with this hotel and the staff from the moment we checked in. The hotel has been opened just a year or so and it gives you kind a atmosphere you don't find elsewhere in Barcelona. its funky, stylish, minimal chic, classy , modern, comfortable and just wonderful. The rooms have been styled with a guest comfort in mind and the room amenities are just everything you could wish for. The beds are comfortable, big and the linen is soft. The Plasma TV, the laptop, The Ipod centre and alarm centre, and the most amazing is bathroom. I was not bothered with the frosty class door, as I believe it is just more lightening from usual claustrofhobic small bathrooms. We had room service also and the service was quick and the food hot and very tasteful. Also a plus to the hotel is to remember their clients on New Years Eve with complimentary Champagne and grapes ( Spanish tradition to have to eat 12 grapes on midnight) The common areas all clean, end spacious, with extra internet point located in lobby. The stylish lobby bar and the cellar restaurant where you could have your breakfast every morning. I would also like to mention the front desk staff who were helpful and helped us with shopping advice, tourist advice, with restaurant bookings and taxis. The guy ( I believe from Scandinavia) who was working during a night kept us entertained with amazing stories every evening and made us feel like we were home and not in hotel. Even to serve us 2am morning a cup of tea and give us opinions and suggestions for the day planning it was very nice of him. Sorry but I can not remember your name to thank you personally. And personal thank you to Maria, our angel who took care of us on mornings with her charming Spanish/English and warm smile. I would recommend that hotel to anyone who wants to have personal warm service and attention with offered stylish comfort.", "Date": "January 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent Stay at Petit Palace Museum”", "Author": "screen00", "ReviewID": "UR23076812", "Content": "Stayed here for Christmas. Excellent location, blocks away from everything you want to see. Simple to get to/from BCN, take the Blue bus from the airport to Plaza Catalunya (last stop) and walk about two blocks up and over (will take you 5-10 min). Buy the return ticket for about 7 Euros from the driver. The ticket machine at the airport bus stop requires exact change so just buy from driver (like everyone else). If you need to get oriented at the bus stop just ask the driver. We also had a map. So simple and cheaper than a taxi. Also there are Metro stops right around the corner. Room was not as big as those shown in some of the pictures. Probably a little bit bigger than the avg Euro hotel room but well planned. High ceilings. Clean and comfortable. Bathroom was nice and shower was excellent. Walk-in shower! No need to pole vault into the tub here as you do with most showers in Europe. Excellent water pressure and temperature. Other reviews suggest this may have been a problem in the past. In my travels, I have experienced a variance in water pressure/temp depending on when I shower and try to avoid peak shower times (as you would in a private home). I did notice that on the water on/off, is like a kitchen faucet, left/right=temp, out/up controls the pressure. I just mention it as my husband didn't know at first how to control the pressure. There's a frosted decal on the glass bathroom door now (or was in our room) for privacy. Looks like they responded to feedback. Thought that the snakeskin pattern tile in the bathroom was a neat ode to Gaudi as well as the picture on the bathroom door decal. Loved having a laptop with internet access in the room. Even with our guidebooks we found ourselves looking stuff up at the last minute. A-plus addition to the hotel experience. Didn't eat at the hotel but they did have room service and a restaurant. There's a little space in the mini-fridge for your water etc. Didn't use the phone. Didn't ask for help, but the front desk staff seemed happy and helpful and spoke English, and were patient with our poor Spanish. Cleaning staff was very nice and did a great job. Ordered a wake-up call which came at the proper time. They did have a clock/radio with alarm but I unplugged as the buttons are somewhat lit and the light bothered me. Strange how sensitive to light I can be when everything is dark. There were other people staying at the hotel but we never heard our neighbors. They either have excellent sound proofing or spaced us out considerably. I saw people in the lobby and on the elevator and even on our floor but didn't hear anyone within the room. Room was a bit warm (even after we monkeyed with temp control), we opened the window. You hear the occasional street noise or noise from people on the terraces but nothing that kept me up (I'm a light sleeper). Bed was clean and comfortable. On the firm side. Linens are very good quality, soft. Extra pillow in the cupboard/closet. No luggage rack. There's room on top of the cupboard for luggage but no collapsible luggage rack to put your bag on while unpacking. We used the chair to pack/unpack. No coffee/tea tray in room but Starbucks was open on Christmas morning! Excellent place to stay. We're fairly picky. We will stay here again and will checkout the other High Tech Hotels. Can't say enough nice things about our stay. You get full value and beyond for your money. Don't write reviews but felt compelled to do so about this place. Last 2 hotels we stayed in and liked: Sofitel St James in London, Hotel de Vendome in Paris. Also, on Christmas lots of restaurants around were open this year.", "Date": "December 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cleveleys, Lancashire", "Title": "“Very Nice hotel”", "Author": "levearne", "ReviewID": "UR22513604", "Content": "We enjoyed our stay at the hotel, it was as described on the website but perhaps the bedroom could have been bigger. We requested and got a balcony, which had views over the main street. The room was warm despite the freezing temperatures outside. We did not use the restaurant or had breakfast so we cannot comment on the food. Whilst the hotel was nice, we had a very poor experience at the El Raco restaurant around the corner, the staff spoke no English even though the menu was in English, the crepe starter was cold and our well done steak was raw. The chef stormed out and the waitress then turned our steak into charcoal. Avoid at all costs....", "Date": "December 7, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Birmingham", "Title": "“Funky boutique hotel”", "Author": "Staceyu1507", "ReviewID": "UR22465136", "Content": "We stayed in Petit Palace Museum for our first wedding anniversary at the end of November. My partner had been to Barcelona before and stayed at Barcelona Central which he absolutely raved about. However I really liked the look of this hotel on the website and the reviews were fantastic so we decided to give it a try. I am so glad - this hotel was exactly what I'd had in mind when I intially started looking at Barcelona. The entrance to the hotel is stunning with a wonderful grand piano in the foyer. The reception staff greeted us with warm smiles as we checked in which was a great start as hotel's like this sometimes can be a bit 'standoffish'. The room was lovely. The style of the room is very funky and ultra modern. I was particularly impressed by both this modern sleek style as well as the size of the room. We had a separate dressing area which was wonderfully luxurious for a city centre hotel. The bathroom was to die for. A large enough shower to fit in a whole rugby team - wonderful!! I can not say enough about this hotel. If you are looking for a good value, modern boutique in good location to all barcelona's amenities you must stay here.", "Date": "December 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Boutique”", "Author": "Chris-Doug", "ReviewID": "UR22366242", "Content": "The hotel sits just 50 meters from the main drag “La Ramblas”. The façade belies what lies inside. This hotel retains all the elegant architecture of the city but has been sensitively renovated to deliver a tasteful and exciting hotel experience. From the moment that you check in you realize that whoever designed the décor of this place was on a mission to do something just a little bit different whilst still catering to a clientele with many different tastes. The rooms are clean and medium sized but delivers an ambience and style that is absolutely modern Spain. The lighting and use of different surfaces and textures all combine to create a spectacular room that is a delight to be in. The bathroom is just good fun and again although relatively small has everything that is required. The shower has inspired us to renovate our beach house using the same fittings. All rooms come with a Lap top computer hooked up to the net and that is included in the room charge. Large screen TV, a comfortable king size bed, no traffic noise, courteous staff, it all just worked. Our room overlooked the street near La Ramblas and it’s ever changing moods, so each day and evening as we sought another adventure was just down the street. Our experience was positive and we would not hesitate going back to this hotel again.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lincolnshire", "Title": "“What a beautiful hotel !!!!!!”", "Author": "Sambanini", "ReviewID": "UR21380876", "Content": "We had looked at all the hotel website's and reviewers' photos, and hoped it would be as good as it looked....and it was better! A beautiful, funky, chic hotel, with free laptop and internet access in the room, mini bar, safe (controlled by resident's credit card rather than the room card - a lot safer!) en suite bathroom with huge hydroshower, and our own balcony (ideal for coffee and croissants for breakfast watching the world go by)! Twin beds as booked, very comfortable. Room was cleaned daily. Only 2 blocks walk from the main square (Placa Catalunya) and La Ramblas (with well known coffee shop on the way!) Would recommend to anyone wishing to stay in an unforgettable hotel, close to the centre of Barcelona!", "Date": "October 29, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Boutique palace”", "Author": "smile4lisa", "ReviewID": "UR20675174", "Content": "The name caught my attention!! Petit palace museum..how cute and boutique-e i thought! Right at the top of the La Rambla (the main touristy street of Barca) a taxi ride costs about 23euros from Barca Airport. Hotel pictures on the website did not disappoint me and were absolutely accurate! Very chic interior and classy i would say! Paid for a high-tech room which was cool, had a plasma TV, funky IPOD stereo/charger/AMAZING HYDROSHOWER (!!!) and a great balcony view of the busy street. Room was spacious, tho i would highly recommend having a full length mirror in the room, also we booked for a king sized bed...it turned out to be 2 singles put together and the beds parted if you tried to sleep in the middle!! (not ideal for honeymooners!..and not funny if you fell down between the 2 beds in the middle of the night)..also to mention, laptop with free webacess was useful for searching all the opening times of tourist places to go the day before! Didn't go for the breakfast...15Euros per person was a bit steep! Bad points about the hotel: banging/drilling work was done one early morning! not good! Room Card sometimes failed to work...had to keep getting it re-activated! Staff was great help, didn't involve them too much during the stay becuase we was out and about most of the time, but if you do get a cheap deal on this hotel, defo go for it, you won't ever stay in another hotel like this!!", "Date": "October 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Amazing!!”", "Author": "tladder", "ReviewID": "UR20227471", "Content": "Booked through lastminute.com in August, flew from Manchester, two days before we left! We're both nineteen. We absolutely loved the hotel, perfect location just above Placa de Catelyuna and Las Ramblas. It should be a 5* hotel..rooms are huge..gorgeous..laptop with free internet, lcd tv and mini bar in room..can't stress how perfect this hotel is! Great staff and we would recommend hiring the free bikes to explore Barcelona in a different way! We would return tomorrow if we could!!", "Date": "September 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“Penthouse with yacuzzi!”", "Author": "MBS_08", "ReviewID": "UR19140005", "Content": "We booked our trip at Lastminute.se and were positively suprised (read: chocked!!) to found out that we got the penthouse with a 50 m2 terrace and outdoor yacuzzi!! What a stay... We started every night with champagne & wine in the water under the open sky. Do I need to mention that the location of the hotel was the best possible with two blocks to Casa Batlló (Gaudi), close to the beach, clubs and placa de Catalunya etc. Cool design of the interiour, nice staff and lots of extras.", "Date": "August 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "adorable08", "Title": "“Really liked this hotel”", "Author": "adorable08", "ReviewID": "UR18786144", "Content": "Date: August 4th 2008 The staff at the Hotel were helpful, we had a 22 month old with us whom needed his milk bottles washing everyday & they provided us with warm milk when needed. If we asked, they would give information on sight seeing but options on different travel method was not offered. Theres aircon in the room, the balcony was not very big to enjoy a sit down, food & drink was very expensive in the hotel, my cup of tea was 10euros. The hydro shower was lovely but the shower tray was very slippery for our baby! There was not alot of room from the beds end to the desk where the laptop & tv is set & because the bedframe has sharp edges, it is pretty dangerous for baby. I read a review here on not being able to find the DVD, CD player, well i've worked it out for you, its all in the laptop! :-) There were only 3 english channels, so there was not much to watch, the news was a repeat. Its location is great for shopping & places to eat.", "Date": "August 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kuwait", "Title": "“really nice”", "Author": "badbad", "ReviewID": "UR18355228", "Content": "This hotel was a real surprise for me. Much more than expected from a 4* hotel. I booked a double room + a child and it was huge in size. The room design is very modern and stylish. All rooms are equipped with laptops with free internet and a gacuzi!. They even had free bicycle renting. The location is great,10 min walk to the ramblas, 2 min walk to the shopping street and the metro station. Restaurants are just next doors. Very friendly and experienced staff, they can help with all your tourist questions. The hotel is very child friendly. The breakfast was good. The only complain is that the bathroom had liitle privacy; the door is transparent and unlockable. Should be ok if you don’t have kids. I recommend this hotel for all.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "rochdale", "Title": "“ideal hotel for sightseeing and comfort”", "Author": "go4val", "ReviewID": "UR17896823", "Content": "stayed at this hotel from 30th june for 4 days. on arrival the receptionist was welcoming and informative. the hotel is ideally situated for all the sights of barcelona. the rooms are comfortable, and the bathroom was to die for. after a long day sightseeing, the power shower was heaven and so ivigorating. We stayed on a B & B basis, breakfast consisted of cereals, fruit juices, hot and cold selection, toast and jams, and tea or coffee, enough to set you up for a days sightseeing. We found the tourist bus an ideal way of seeing all the sights, you can buy a day or a 2 day ticket, you have commentry on the bus, and you can get on and off at all the attractions you wish to. The buses are very frequent (every 10 min or so ) There is so much to see and do in Barcelona, we are definately going back, and this hotel is an ideal base, being only 5 to 10 min walk from the ramblas.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Nice Hotel - Great Location”", "Author": "dreaminofnextholiday", "ReviewID": "UR17318575", "Content": "Stayed at this hotel for a few days in June. Nice hotel - very modern room and bathroom with excellent shower. Room had a small balcony also. We overlooked the street, but this wasn't a problem as it was quiet. We did not eat at the hotel as prices were quite steep, but the location was excellent and only a short walk to restaurants and Las Ramblas. The staff on reception spoke very good English and were helpful. The hotel had a bar area, but there was never anyone in it during our stay, so we didn't use it. Barcelona is a lovely city and we would return. The tour buses that cover various routes are a good option for sightseeing - and you can get on and off the bus whenever you like as the ticket is valid for the whole day. There are also two metro stations within a few minutes walk of the hotel. Overall - great city and great hotel - would return.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Lovely but not good value!”", "Author": "MissRandom", "ReviewID": "UR16225991", "Content": "Generally a nice hotel in a great location but not value for money. It was on average in total £140 per night, not including breakfast. We chose not to have breakfast there as it was 15euro each. The bed was hard and the pillows even harder. The shower was brilliant, as was the location. Staff are friendly but just don't seem to go the extra mile for you. Free internet access via a laptop in the room but no coffee/tea making facilities. Not a great nights sleep due to the comfort of the bed. If you're after a great location and an awesome shower then go for it. If value for money and comfort is what you're after, look elsewhere.", "Date": "May 20, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "maudelynn85", "Title": "“'petit palace' is no palace”", "Author": "maudelynn85", "ReviewID": "UR16179594", "Content": "much of the staff was terribly rude, many of the \"features\" were not what they were advertised, for instance the \"high tech\" features turned into my having to ask for passwords for my internet usage on my personal computer three times. Go elsewhere. This was a buisiness/tourist stay for me, if I had to do it again I would stay in a warmer, more friendly place. The architect had fun designing the place but it isn't like friendly Barcelona at all, and it isn't even comfortable.", "Date": "May 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“A very pleasant surprise”", "Author": "Tania_Madrid", "ReviewID": "UR15988214", "Content": "The hotel was a surprise from the very beginning: great location, next to La Rambla De Cataluña, great design, big open lobby, polite receptionist, great corridor design, big beautiful room (for a single traveler), huge bed. The staff was helpful and very nice, you could even play a piano in the reception (almost like everything's allowed). Very modern design, but comforting at the same time (some of High Tech chain is a little too modern). Great room, very beautiful, huge bed. Big bathroom with jacuzzi bath, equipped with champoo and bath gel, and also a comb, dryer, etc. I did not hear any neighbors, drilling, or whatever I read in other reviews. Absolutely quiet. This hotel is ideal for single travelers, however I imagine it can be good for any business travelers and tourists, for travelers with pets, for couples and honeymooners. Minuses: small wardrobe, the balcony door did not close and nobody cared, neither me, although I informed the reception. Pluses: everything else. I reserved it on the hotel website, paying in total in advance (it was the best price on internet), and I paid 155 euros per night.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Boutique you won't regret”", "Author": "spunge411", "ReviewID": "UR15070064", "Content": "Stayed here in a quad room last week. The decor was as beautiful, in the lobby as it was on each floor and rooms. The staff was helpful, from arranging for a van to pick us up from the airport, reccomendations,...etc. A special thanks to Oscar, Christina, Maria, and Marco. they endured frequent emails from me, and always answered questions in detail. The location is at the top os Las Ramblas, which is really perfect and you can really walk anywhere from here...and the are 2 train stations we used within 5 mins walking distance, they are CATALUNYA and PASSEIG DE GRACIA. All shopping is close by too. We didn't use the hotel breakfast, there are about 5 places for coffee and pastries/eggs within 1 min walk and one block to the left of the hotel is a bar, that never seemed to close :) And if you want to walk a maximum of 5 mins for a great breakfast in a local setting, there is the world famous La Boqueria.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London,UK", "Title": "“Fantastic place!”", "Author": "loony44", "ReviewID": "UR13825393", "Content": "I stayed at this hotel last week with my husband, daughter (5) and son (3). I am really fussy when it comes to hotels and holidays and research like crazy. This hotel did not fail to impress! We decided to take a taxi from El Prat airport to the hotel and it took 15 minutes and cost €14 (this was at lunchtime). The taxi pulled up and we were 'wow!'. The hotel is very stylish. Reception staff were very friendly and checked us in quickly and efficiently. We went to our room and it was enormous! We had a family room so had a double bed plus bunkbeds. The kids loved the bunk beds as they had their own little tv sets with cartoons. Our room had 2 large wardrobes, a minibar, safe (free), large TV and laptop with free fast internet access. The bathroom was also very big and had a stylish handbasin, hairdryer, toilet and large bath with hydroshower. The water was piping hot and very powerful and was an absolute joy. There was a step to help people get in and out of the bath and plenty of places to put your soap and shower gel. The breakfast would have cost us €16 per person per day but we found a lovely Spanish cafe just 1 minute away (La Tramoia) where we ate and it only cost a TOTAL of €14 ( we had juice, coffee, toast and croissants for 4 people). The hotel is in a great location - only 2 blocks from Placa Catalunya and the top of La Rambla. It took only 5 minutes to walk here. The Placa Catalunya is where the tourist bus starts and we took a 2 day ticket on this and used this as our transport in Barcelona. It took us everywhere we wanted to go and we just got off and on at each place. The kids loved it, too, especially sitting upstairs on the opentop and enjoying the warm sunshine. I would recommend this hotel to anyone. It was stylish, quiet, great location, friendly helpful staff. The negative points that people have mentioned in previous reviews have all been taken care of by the hotel ( I presume they read this and take note?). The water was hot and powerful, there was a step and rail to get in shower/bath, the elevator didn't creak, the lobby was all one level so no little bits to trip over. Will definitely be staying here if we ever return to Barcelona!", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Luxembourg", "Title": "“I will be back”", "Author": "eischen", "ReviewID": "UR13605796", "Content": "Have been here for one night and it has been very good. The room has been outstanding. Clearly above average. Large. All amenities available. Including WiFi for free. Contrary to other contributions I found the staff very kind and helpfull. Always a smile. And that helps sometimes a lot. The Lobby was Ok and very design. Breakfast buffet was sufficient and all you could wish for. Location is pefect. Close to Placa de Cataluna and at some distance of the other purely touristic places. A good starting point. Will defenitely go back. This is a chain hotel. Have also gone to BCN Hotel which was less amazing. Saw one in the old town with same style which I might try next time.", "Date": "February 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kansas", "Title": "“Undiscovered Gem!”", "Author": "visitar", "ReviewID": "UR12336594", "Content": "This hotel was a wonderful surprise for my family and me. We booked a room there because we could put all 4 members of my family (two adults, two teens) in one family room. This is really hard to find in Spain without resorting to renting an apartment. When we arrived, we were so pleased to find out that they had upgraded us to a junior suite upon discovering that it was my husband's birthday on our check-in date. Our room had a 6-person hot tub and a huge, walk-in shower. The hotel was sleek and had a trendy boutique feel. We had plenty of room to spread out and wished we were staying longer instead of leaving for Madrid the next day. The hotel is located in a nice part of town, but is not near Las Ramblas, if that is what you are looking for. It was fairly quiet. When our son did something (!) to the toilet and caused it to run constantly, they sent up a maintenance person and had it fixed within the hour. The front desk personnel were friendly, welcoming and helpful. I would absolutely recommend this hotel to any traveller. Great value for the price - and a fun, funky place!", "Date": "January 4, 2008"}], "HotelInfo": {"Name": "Petit Palace Museum Hotel", "HotelURL": "/ShowUserReviews-g187497-d633625-Reviews-Petit_Palace_Museum_Hotel-Barcelona_Catalonia.html", "Price": "$157 - $338*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Diputacion 250</span>, <span class=\"locality\"><span property=\"v:postal-code\">08007</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "633625", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0e/b5/0eb52ec7e864475867a4926aac85160b3large.jpg"}}