{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Georgia", "Title": "“Excellence”", "Author": "Jamie S", "ReviewID": "UR139736551", "Content": "My Family and I have been Coming to Daytona Beach for many years and out of all of the hotels we have stayed in, The Nautilus Inn is by far the best hotel there is.This hotel is clean and comfortable and the staff beats any other hotel by a mile. They are welcoming, hospitable, and friendlier than any staff i have ever encountered. Anyone who goes to Daytona Beach needs to look into this homey paradise because they will not be disappointed.", "Date": "September 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Fantastic!”", "Author": "Allison M", "ReviewID": "UR139696454", "Content": "Loved this place and wish we could have stayed longer! The room was clean, updated, great and the people were friendly! The view and proximity to the ocean could not have been better! Will definitely stay here if ever in the area again!", "Date": "September 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Florida, United States", "Title": "“Great Experience”", "Author": "Archie S", "ReviewID": "UR139315284", "Content": "From the time we checked in until we checked out, our experience was great. We stayed in room 401 which overlooked the beach. WOW great view. We want to especially thank Daniel, Mary, Rick and Jessie. You were all superb in your jobs. Great place to stay for vacation.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houlton,ME", "Title": "“Clean and comfortable”", "Author": "TeoChasse", "ReviewID": "UR139175473", "Content": "We visited this hotel in June 2012 after reading favorable reviews on it. Although its interior is dated, it is well maintained and clean hotel, beautiful pool area, quet and comfortable rooms ;their staff works hard at maintaining a good hygiene inside the rooms and in the surrounding areas-special Thanks to Sonia,you did an excellent job,you were very kind and helpful. My problem with this hotel is that the hotel management is clearly catering to certain groups of old age Canadian retirees ,therefore I had the overall feeling that we are not staying at a hotel, but that we are staying complementary at an old age home. We felt somewhat exluded and generally not being paid much attention to, unlike their permanent Canadian old age contingent-unacceptable, considering that we are all paying the same price! I would highly recommend the Management to pay more attention to their \"solo traveller\" guests, because at the end of the day we all give the hotel the same business so there should not be any separation of the guest categories.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Will come back and stay again!!”", "Author": "Sweetshorty1465", "ReviewID": "UR138560502", "Content": "We are a family of 5. We did call a head just a few hrs before we may it to Daytona to get a room. They had a great room for us! Over looking the ocean was amazing worth every penny. It's amazing to watch the sun come up from your room/balcony :) the people were so friendly and helpful. The rooms are so nice. It's kinda packed in for the happy hr. did not stay for that. Will stay here again...", "Date": "August 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "philadelphia", "Title": "“Very nice stay.”", "Author": "travelmom21", "ReviewID": "UR138452032", "Content": "Nice view of the ocean, the pool and pool area are very nice. The hot tub is too small, and more than four people would be very uncomfortable. The rooms are nice and clean, should upgrade the linens and pillows. Nice kitchen. Staff seemed very pleasent. OK location, quiet, however not in walking distance to restaurants.", "Date": "August 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great hotel. Great beach.”", "Author": "Ann53449", "ReviewID": "UR138038509", "Content": "My husband and I stayed here August 10th and 11th. We loved this hotel. It's on a quiet part of the beach. You get a free continental breakfast served in a large room with lots of tables ( the room never felt crowded) and a beautiful view of the garden patio and the ocean beyond. A free happy hour,with alcoholic and non-alcoholic drinks,was held at 5pm.On the 11th there was live music playing at happy hour and after happy hour. A board just outside of the breakfast room listed activities held during the day. The hotel was spotless and the staff was friendly. Next time in Daytona we will stay here.", "Date": "August 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "apollo beach, florida", "Title": "“They do it right”", "Author": "sharon h", "ReviewID": "UR137993251", "Content": "If I don't get this right this time...I'm going to have to give up...this is my third time trying to get this to go through...this won't be nearly as good as the first or second writing, lol...but wanted to express my view. The hotel was great...the staff was excellent.. Rick at the front desk was soooo funny. Virginia remembered my name (Gee, like a little Ritz!) and seemed to remember when we checked them out in May. We were impressed, we made the reservation on the spot. The Pool area has adequate conversation areas with padded couches and chairs, tables/umbrellas and ample lounge chairs plus nice palms and plants .The kitchens are updated with granite countertop and rooms have great views. Happy hour was ,a blast with a live singing artist wooing people to sing and dance. Thank you Natilus Inn for a great weekend... sharonh", "Date": "August 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami", "Title": "“Beautiful Ocean View”", "Author": "Cawowyn", "ReviewID": "UR137582921", "Content": "Every room in this hotel has a view of the ocean. Some rooms look directly on the beach and others have a view of the beach to the north or south. No matter what room you will still have a beautiful view with a balcony. Rooms contain a small kitchen including a stove, microwave, full size refrigerator, coffee pot, toaster, etc. The room also includes a table with two chairs and two comfortable chairs with a reading lamp. Beds were comfortable and Genevieve did a great job of cleaning. Every day there is a one hour managers reception with alcoholic and non-alcoholic drinks served. Sex on the Beach seemed to be the favorite. Also every morning there is a continental breakfast including home made muffins. The hotel is right on the beach with a huge brick covered pool/patio area with plenty of tables and chairs to sit out and enjoy the view. The staff (especially Sheila) make you feel right at home and are there to help with anything you need. They always had great recommendations for local restaurants including directions.", "Date": "August 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lakeland, Florida", "Title": "“Great experience”", "Author": "Rudy C", "ReviewID": "UR136988323", "Content": "We spent the weekend celebrating my wife's birthday and she thoroughly enjoyed it. The hotel staff was very friendly and helpful. They really went of of their way to make us feel welcome. We wished we would have stayed longer. We will definitely be back!", "Date": "August 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Best in Daytona Beach for the Money.”", "Author": "John T", "ReviewID": "UR136439514", "Content": "We booked at the Nautilus Inn on a Friday night with out any advance notice because the so called Resort that I was booked at was so sub- standard that I would not let my dog sleep there. The Nautilus staff worked very hard to insure that I and my family were not left out on the street. The front desk staff was very courteous. Upon check-in, we were made to feel that we were the most important guest in the hotel. Recommendations given from staff area were right on target. We stayed in room 603 the first night and enjoyed our stay so much we stayed another night in room 701. Both rooms were very clean and more than spacious. We found that both rooms had been recently renovated. Both rooms had kitchens which allowed us to eat in. Both rooms had great views of the Ocean and pool area. Loved That…. On the web, this hotel was represented as being a very clean and up to date. I was happy to find that this was in fact the case. (Resort Standard) Couldn't stay at a better place for the money……!!” We will be back......", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "White River Junction, Vermont, United States", "Title": "“Couldn't stay at a better place!!”", "Author": "Jeanette L", "ReviewID": "UR136334704", "Content": "We checked in and we feel like we found a gem! We were in room 1002, we were on the top floor with an ocean front room! The room was very clean and pretty spacious for a family of four! We were given some recommendations for dinner/lunch- they were outstanding. The pool was refreshing, the staff were friendly and helpful! We WILL for sure go back!!", "Date": "August 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auburn", "Title": "“Great Beach Location, Great Staff”", "Author": "KentAuburn", "ReviewID": "UR135982224", "Content": "Recently stayed at Nautilus Inn for a 5 day visit while our son was getting married in Daytona. We booked several rooms at NI through the recommendation of Tripadvisor and were very happy. All of our guest loved the hotel. Recently renovated. Rooms had kitchen which allowed guest to eat in if they chose. All rooms had great views, the Ocean View was as good as the Ocean Front views. The only improvement I would recommend to NI is to have queen size beds instead of full size beds, the rooms are large enough to handle queens. The beach front location was perfect. The beach is VERY good for all ages, but if you have young kids, this beach is perfect. Depending on the tides and the surf, there is a very long area of shallow water for young kids to play in before the water gets deep. If you are into skim boarding, this beach is perfect at select tide times. All of the staff was very friendly and helpful. We had a great visit.", "Date": "August 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Green Cove Springs, Florida, United States", "Title": "“Home Away From Home”", "Author": "Kathy M", "ReviewID": "UR135848645", "Content": "We only live 90 minutes away, but we consider the Nautilus Inn to be our home away from home. The staff is the friendliest and most accommodating to our needs as we are happy to return several times each year. We've never stayed at a better \"home\" while visiting Daytona. Thanks to Rick & other super staff members for making each visit outstanding!", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Location”", "Author": "Cmcon81", "ReviewID": "UR135840075", "Content": "We were pleasantly surprised, while the decor is a little outdated, the hotel is a older but very well maintained and clean. The staff were wonderful! Our room was very clean, with a balcony and a beautiful view of the ocean. We even had a kitchen in our room with new appliances! You can't beat what you get for the price. We wished we could spend more time here and were sad to go home.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new port richey", "Title": "“Dont look anyplace else, this is the BEST!”", "Author": "NewPortRicheyJoye", "ReviewID": "UR135727112", "Content": "Thank you Virginia, glad you got to see your new grandchild, Rich, Mary and Sue. We love coming to the Nautilus, it is better than a 5 star!!!!! Dont change a thing! See you again for sure! Joy & Ray Dunn", "Date": "July 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Back Again”", "Author": "Rev_Dennis", "ReviewID": "UR135682518", "Content": "This is a place you will return to again and again. Very clean and well managed. Right on the beach. Well kept grounds and pool. Older clientele = good. Nice and quiet place. Usually occupied by groups of Canadians.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ocala", "Title": "“Mrs,Carpenter”", "Author": "marcia p", "ReviewID": "UR135631247", "Content": "My husbaqnd and I came down for my 39th birthday, we rally enjoyed our stay, Mrs, Virgina is a sweet lady, great hospitatily. rooms was clean and nice also all the staff was very nice. we came down from ocala, and it was late around 12;30am and I was very tired, the staff thatbwas there that night was also sweet, they made accurate time, made sure they try to satisfie every need that we had, the pool was very nice aslo the breakfast,the lobby area was nice and cozy, you didnt feel uncomfortable while been there, it just was alot of great staff even housekeepin, I am looking forward to coming back and staying with my children also, therefore I personally thank you for everything.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kissimmee", "Title": "“Beautiful, clean & well worth the $$!!”", "Author": "Monica A", "ReviewID": "UR135628762", "Content": "Celebrating my son's 21st birthday, we wanted to stay somewhere nice, ocean front... so we drove up & down Atlantic Ave where there were hundreds of inns at ridiculous prices for what they were offering but as soon as I stepped foot into Nautilus, I knew that was it. They offered me the same rate as the DIVE motel next door, really?? Friendly staff, beautiful & elegant, clean rooms with everything I needed including a FULL kitchen with appliances. The view from the 8th floor was breathtaking. Beautiful complimentary breakfast dining room & free happy hour with kareoke night. Large patio by the pool & easy gated access to the sandy beach. It was about a mile from the boardwalk where we had dinner & drinks. It was an amazing experience. I will definately be back!", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Macon, Georgia", "Title": "“Amazing Hotel and Staff!!!!”", "Author": "Toya C", "ReviewID": "UR135211738", "Content": "My husband, my daughter and I recently visited this hotel for my 30th birthday, and it was amazing. After being very disappointed in a hotel that we had booked down the street (over the internet, big mistake) we began looking for a place that he and I both would be comfortable staying in. From the moment we entered this hotel we were greated by some of the friendliest people you would ever want to meet. Virginia was simply amazing and accomadated us with everything that we needed. She made sure we had a great room and she even helped my husband to plan my entire birthday celebration. I have never known anyone to take the time out to make a stranger really feel special, but she did and I will forever be greatful for the wonderful memory she helped to create. She not only got us set up in the hotel, but she made reservations at a very nice resturant for us, ordered a complimentary dessert, had champagne sent to the room, and made sure that upon our return I had cake and ballons already in the room. My husband later told me how big of a help she was in planning the surprise. My heart was truely overwhelmed. In addition to the hospitatlity of the staff, Rick included was great. He too made this vacation, one that we will forever remember. I was feeling really frustrated before we found this place, but these guys made EVERYTHING great. From my family to the Nautilus Inn staff we say thank you, and hope to see you guys again soon. (VERY CLEAN, COMFORTABLE ROOMS, GREAT VIEW, AND WONDERFUL STAFF) I will be recommending this place to all my family and friends.", "Date": "July 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dayotna beach", "Title": "“Delightful Stay at Daytona Beach”", "Author": "jim r", "ReviewID": "UR134900916", "Content": "Motel employees were friendly. Rooms were clean and neat and kept that way. Price was excellent. The refurbishing of outside court yard makes a wonderful place to relax and enjoy the beach view. Rick was fabulous, as always. I am really sad he is leaving. Daniel was very pleasant to work with. Just a great experience all the way around.", "Date": "July 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Clean & friendly hotel!”", "Author": "mk_anders", "ReviewID": "UR134809033", "Content": "The hotel is very classy. They have nice furniture an great decorations. The staff is very friendly an were a pleasure to be around. I highly recommend this hotel to anyone looking for a worry free place to stay in Daytona.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Clean and excellent service!!”", "Author": "Slick_Chick17", "ReviewID": "UR134528250", "Content": "We had another great weekend at the Nautilus Inn. The rooms were spotless, as always, and the remodeling is a plus! The staff is extra friendly. We became good friends with Sue on the 10th floor, and always speak with Desmond. Desmond is every where, assisting everyone. We were sad to hear that Rick is leaving. He makes a mean drink at happy hour. :) I always think twice before writing my review- I don't want everyone to know how great the Nautilus is- rooms will fill up! :) Really- you can't beat the staff. They do an excellent job and ensure your stay is great.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Indiana, United States", "Title": "“GREAT STAY”", "Author": "Tony F", "ReviewID": "UR134067888", "Content": "We stayed here the last week of June 2012. The hotel staff was superior (everyone from the front desk team to the maintenance team). They were extremely friendly and helpful. The hotel was clean and updated. The pool and hot tub were a hit with our children. We had an excellent ocean front room.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ormond Beach, Florida", "Title": "“One of the Nicest Hotels I've ever stayed at”", "Author": "Jane524", "ReviewID": "UR133197355", "Content": "This hotel is absolutely super in every way. Virginia, the front desk person, couldn't have been nicer and showed us the room before we booked it. Genevive, the cleaning lady, did a superb job of keeping the rooms spotless and, in fact, the whole hotel was \"white glove\" clean. Our room overlooked the ocean with a terrace where you could sit and enjoy the breeze. The free cocktail hour was such a nice touch, which I haven't seen in any but one other hotel. The pool deck, the beach front, the hot tub and even the continental breakfast were all great. I would recommend anybody to stay at this hotel. You won't be disappointed and that's a promise.", "Date": "July 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Amazing view for great price”", "Author": "karrmichael", "ReviewID": "UR132925793", "Content": "The front desk upgraded us to an oceanfront view, and that alone was worth the price. Every room has a kitchenette which is convenient. Decor is a little outdated but fair enough. Would return to this hotel.", "Date": "June 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plant City, Florida", "Title": "“Best Deal in Daytona Beach!!!!”", "Author": "Judy B", "ReviewID": "UR132890750", "Content": "Extra clean rooms, great location on beach. Staff extra friendly and helpful. Free continental breakfast and happy hour in afternoon. Good rates, I could go on and on. My family has been visiting this hotel for over 15 years and better today than ever. Rooms and pool area have been updated and are beautiful.", "Date": "June 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jasper, Alabama", "Title": "“\"Home Sweet Home\"”", "Author": "Martha_K2229", "ReviewID": "UR132561590", "Content": "This was a wonderful place to stay. Everyone was so nice and helpful. The rooms are a little outdated but they were very clean. We enjoyed the pool and loved the hot tub. They served drinks in the evening and it was nice that you could get them without alcohol. We are not big breakfast eaters so the breakfast they had was good for us. Loved the muffins. If you eat a big breakfast you might should plan on going out. If you like staying at a quite place this is it. I can't say enough about all of the workers. It didn't matter who we were dealing with they all made you feel welcome. I have stayed at a different hotel in Daytona and said that is where I would go back to. Well now I have changed my mind. This is where I will call home at Daytona.", "Date": "June 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oshawa", "Title": "“Great Hotel”", "Author": "BJ2005", "ReviewID": "UR128610690", "Content": "Just returned from 2 weeks at the Nautilus Inn in Daytona Beach . The hotel is very clean and right on the beach Lovely pool deck with heated pool and a hot tub . Staff very friendly and helpful . Breakfast each morning and Happy Hour each afternoon . Nice relaxing place to stay .", "Date": "April 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oakdale, New York", "Title": "“great hotel nice and quiet”", "Author": "ssklgaming18", "ReviewID": "UR127499115", "Content": "this is one of the most best hotels i stayed at. It had a balcony over looking the beach it was nice and calm the front desk staff was helpful and helped with nearby restaurants for food. The breakfast was good and the pool and spa were really calm. Overall this was a great stay at Daytona beach.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Douglas, Georgia", "Title": "“Oceanviews & resort feel with great price!”", "Author": "Rlburch", "ReviewID": "UR127310467", "Content": "This is a Canadian owned hotel that primarily hosts large groups of senior citizens from Canada for extended vacations. My family and I were a minority by being in our late 30's and mid 40's and people of color in this hotel. When we arrived on Atlantic Blvd., we called and were asked if we were 25 and up because this hotel is not for the spring break crowd. We were relieved to hear that because we were hoping for a restful stay. The staff was very friendly. Lobby is dated but very clean. Kind of smelled like an assisted living home to me but our room didn't smell. We were given a 10th floor room and the view was spectacular! We were surprised to see granite countertops in the updated full kitchen and in bathroom. Toilets were top of the line! Bathroom was pretty small. Bedding and decor was dated but everything was clean. Wish there was a screen on balcony to hear the waves while sleeping. If your balcony door is slightly open, the staff knows because there is a sensor that alerts them. This feature prevents mold & mildew in the hotel. There are daily activities like water aerobics, bingo, shopping trips, karaoke, etc., that the seniors seemed to enjoy. Especially the happy hour! No snacks are served during happy hour. The patio, pool and spa area was so relaxing. You didn't have to worry about kids doing cannonballs into the pool. They are very strict about spring breakers. My daughter and I were actually stopped by the activities director to make sure that we had the wristbands on! Don't worry, Nautilus, a spring breaker wouldn't be caught dead in this place! This place is for their grandparents. Overall, Nautilus Inn fit the bill for us because we needed the great view and peace and quiet.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Nautilus is the perfect get-away place especially for older, more relaxed customers.”", "Author": "Charleefox", "ReviewID": "UR126744029", "Content": "We have neen regular customers for five years. The staff are like family: the good kind, you really want to see! We have so much fun at the hotel, largely in part of the wonderful and fun staff. Happy hour is fun and breakfaat is great. The pool is always immaculate - and so are the rooms. My husband proposed to me there and I learned how to surf there! Daytona is great!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kelowna, Canada", "Title": "“Great staff....they were booked and we went on a wait list and they called us....”", "Author": "c0mpassi0nate", "ReviewID": "UR125623352", "Content": "Great staff welcomed us to a quiet area of Daytona beach. The hotel is located overlooking the water. There is a pool that is easily accessible through a walkway. The rooms are bright and cheery with updated kitchen units that are very clean. Staff and are very friendly giving us great service for all the day we stayed. There is breakfast and happy hour if one wishes to participate. A great bus service is offered - trips to restaurants and shopping excursions. We were younger than most of the other friendly guests but would recommend if you are looking for a quiet place to enjoy the beach....this is it! We did travel by cab to restaurants outside of this area as there is minimal shopping or restaurant choices.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barrie, Canada", "Title": "“Awesome!”", "Author": "Sarah G", "ReviewID": "UR125422768", "Content": "My family and I have been coming here for three years. The rooms are very spacious, especially when you have two teens, and VERY clean. We really like the renovations, the full kitchen is great if you want to save a few dollars. The staff treats you as if you are family and Melissa always has alot of activities and something different everyday..FUN,FUN,FUN!!!!!! Can't wait for next year!!!", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rensselaerville", "Title": "“Friendliest hotel I've been to in years !!!”", "Author": "Susan B", "ReviewID": "UR125243974", "Content": "We arrived at the Nautilus Inn by accident. We were scheduled to stay at a hotel just a few doors down the street, but found it unacceptable. We left and checked in at the Nautilus Inn-what a warm welcome we received. The staff here (Rick & Mary especially) are just out of sight and SO very accommodating. They really aim to please and will make your stay worthwhile. Nice clean rooms with kitchen units-BEAUTIFUL views of the ocean, activities galore (cards, bingo, entertainment, free happy hours, etc.etc.) and beautiful heated outside pool area. Just what we needed to get rid of our winter blues !!! Sue from NY", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterborough, Canada", "Title": "“Wonderful”", "Author": "Jon J", "ReviewID": "UR123088832", "Content": "We where there in Dec. 2011 for two weeks. very nice place to visit. It is clean and the staff is very helpful. They did a great job on the patio. Enjoyed the Sand Dollar Room every day. Ray and his team should be very proud.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit", "Title": "“Excellent basics”", "Author": "kirbytravel", "ReviewID": "UR121556772", "Content": "The Nautilus Inn is an excellent hotel with few ammenities. If you looking for a base to sleep you can do no better. The price avgs $100 and the whole property is clean and friendly. Free parking and on the beach. The ammenities are what this property lacks. No store, no food (other than free continental bkfst), no bar. The hotel is popular with and owned by a senior citizen travel company and has built their business plan to cater to them. Card Night, Wal-Mart and Winn-Dixie excursions are some of the daily activities posted in the lobby.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Nice place to stay”", "Author": "burkehouse", "ReviewID": "UR121103520", "Content": "My husband, my mother, and I stayed here for a night on our road-trip through Florida. We arrived in early evening and walked into the hotel to see a large gathering of retired folks listening to accordion music. My husband and I are in our mid-thirties and are pretty sure we were the youngest people at the hotel. I think they had a tour group of older people, and that is why there were so many of them. But hey, they were all quiet and didn't party the night away. :) From check-in to check-out the staff was wonderful. We were in a room that had been recently remodeled and it was fabulous. The only bad part about it was that the bathroom fan was extremely loud and didn't seem to do much. After showering it was like a sauna in the bathroom. There was even a kitchen in our room -which we were not expecting. The pool area was great and just steps down to the beach. Our balcony had a great view and we watched the sun rise and sun set right from our room. Breakfast was great, I think the muffins were home-made. Again, the breakfast room was dominated by older people discussing things I would rather not hear loudly. We learned all about one lady's issues in the bathroom and another lady's medications. Obviously the hotel has nothing to do with that, but you might want to check to see if they have a tour bus coming in.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Don't go anywhere else”", "Author": "Marcia A", "ReviewID": "UR119720246", "Content": "The Nautilus Inn was fabulous. We went to another hotel first and were completely disappointed. I thought our mini vacation was ruined until we checked in at the Nautilus. Rick at the front desk was great! He showed us the room before we paid. Everyone was friendly. The Room was very nice and very clean. Anytime we go to Daytona we will be staying at the Nautilus Inn!!", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washingtonville, New York", "Title": "“Great Place”", "Author": "JoeyMetro", "ReviewID": "UR119141438", "Content": "Found this place after arriving in Daytona Beach and realizing I made a booking at another location that was absolutely terrible.the staff at Nautilus is extremely friendly, the lobby was up to date and clean, and there was plenty of parking. The room had a excellent view of the ocean, was roomy, and also very clean. The crowd was a little older so it is a quiet hotel but everyone was very friendly. I would absolutely stay there again.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Everything you read is true”", "Author": "Ali_Patty", "ReviewID": "UR118808989", "Content": "In a rare showing, this hotel meets all the marks and lives up to its reputation. The only thing bad I have to say is that I wish I could have stayed longer. You can tell the staff prides themselves on being helpful, friendly and attentive. The facility itself is beautiful, having recently undergone renovations and the onsite amenities are top notch. Any view is going to be a good one from your balcony. There is a continental breakfast in the morning in an area the has a poolside and beach side view AND a complimentary happy hour in the same room in the evening. There are activities going on through out the day, water aerobics, 'Casino night' and karaoke to name a few. Two thumbs way up and four stars from this reviewer.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Long Valley, New Jersey", "Title": "“Very Good, Clean Hotel”", "Author": "jolv", "ReviewID": "UR118759465", "Content": "My family (two adults, 1 teenager) stayed at this inn for four nights to attend the Coke Zero 400 at Daytona International Speedway. If possible, stay in an ocean front, end room which has two additional sets of windows. We stayed in Room 701, an oceanfront deluxe efficiency with full kitchen amenities, a private oceanfront balcony, very small television, 2 full beds and a living area with queen sofa sleeper. The room was very spacious. The inn is right on the beach and the property has an outdoor pool and hot tub with plenty of lounge chairs and tables. The shuffleboard court was a big hit with my son. If this hotel made a few changes, it could earn an excellent rating: - Housekeeping needs to pay attention to details. When my son, pulled out the sofa bed, the linens were used and full of cookie crumbs. To their credit, a staff member came up immediately and changed the linens. The rest of the room, the common areas and the pool area were very clean. -The inn claims to be recently renovated, but the décor in our room was very dated. It looked like grandma’s house. -The free continental breakfast needs improvement – more choices, hot items and fresh fruit would be nice. -The inn needs more than one computer. Every time we wanted to use it, there was a wait. -A $235.13 room charge each night during race weekend was way too pricey. A reviewer mentioned that the inn was located in a less than desirable area. All of the Daytona beachfront looks a little seedy. But we liked this area much better than the boardwalk/condo area; we never had a problem and we were out and about every day. This property is a great place to stay and an easy 10 minute drive to the track.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Best Kept Secret”", "Author": "lrlntad", "ReviewID": "UR118694400", "Content": "We enjoyed our trip in Daytpna staying in this cozy hotel. The staff are very pleasant and helpful.There is always trips and events to keep you moving. Dinner here.. shopping there..movies.. bingo...aerobic exercise..and of course shopping. There is a Cocktail hour everyday in the afternoon. Their breakfast is enough to keep you full that you will skip lunch. When we got there, we were warmly welcome by the owner herself. She was ready to show us around the hotel. She asked us if we are ready to jump in the water, she was handing us beach towels. I will highly recommend this to any one.. travelling yourself, couples, or families.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wellborn, FL", "Title": "“We LOVE the Nautilus Inn”", "Author": "FloridaGirl333", "ReviewID": "UR116582389", "Content": "We go to the Daytona Beach area several times a year, and our first choice for a hotel is always the Nautilus Inn. It is VERY clean, the employees are very friendly and helpful. We prefer to stay in one of the beach front rooms and enjoy sitting on the balcony in the late afternoon. They offer a small breakfast every morning which is good for what it is.....muffins, toast, cereal, juice, coffee, etc.....I can't think of any negatives....It's all good!!!", "Date": "August 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect place, perfect stay”", "Author": "10acmel", "ReviewID": "UR116279458", "Content": "Just spent a week at this clean, well-run hotel, and I can't give enough kudos. All the reviews are true; this place is wonderful. The staff--friendly & attentive. Very clean. Maid service is daily & thorough. The pool & grounds are cleaned extensively each morning, and I always saw a maintenance man on site A great place for families--definitely nicer clientele than where we stayed last year. Free continental breakfast each morning. Not a buffet, but more than adequate My only complaint: a recycling bin for all the cans & bottles would be nice. Believe the hype; it's all true!!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“space shuttle”", "Author": "georgiaman10", "ReviewID": "UR115977031", "Content": "Booked this hotel for the space shuttle launching at the Cape. We booked based on its tripadvisor rating and we were happy we did. we upgraded to their ocean front room and we had a beautiful view from the 5th floor. The front desk suggested a couple of local seafood restaurants which were great. Next time we go to Daytona Beach we will stay at the Nautilus Inn", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Inverness, FL", "Title": "“great place to stay!”", "Author": "bchlover46", "ReviewID": "UR115751623", "Content": "Very clean hotel with friendly staff. Rick is wonderful. Will definately be back!", "Date": "July 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best Hotel in Daytona Beach!”", "Author": "jennaw21", "ReviewID": "UR115462231", "Content": "we have been staying at the Nautilus for the past several years, and each year we love it even more! From the time you check in until the moment you leave to go home you are always treated like you are the most important guest! You can always count on Rick, Shelia, and Bob to help you with any needs you have 24 hours a day! This is also the cleanest hotel we have ever stayed at! From the rooms to the pools everything was spotless! I also love the breakfast (especially the muffins). On most nights during the week you have entertainment during happy hour. From professional singers to those of us that wish we were during karaoke something is always there to keep you entertained. If you ever get bored just go find rick he will always make you laugh! I recommend this place to anyone who is going to be in the area! We are already looking forward to next year!", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brentwood, TN", "Title": "“So clean and friendly”", "Author": "Momof4_11", "ReviewID": "UR114690653", "Content": "We just returned home from our second stay at Nautilus Inn and we can't say enough great things about Nautilus Inn. This hotel is the cleanest place inside and outside we have ever stayed. Rick with his friendly personality, Rose and Sheila all so willing to help in any way made us feel so special as we checked in. All of the staff from the front desk to maintenance are friendly, helpful and courteous. We would not hesitate to recommend Nautilus Inn to anyone.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florida", "Title": "“Our favorite place at the beach”", "Author": "Slick_Chick17", "ReviewID": "UR114655657", "Content": "This is our go too place at the beach. We have visited several times and take friends and family there for a treat. We recently went for Father's Day Weekend. As usual, the staff was friendly-they even know our names and family members. We had a blast at the Happy Hour with the music and our host Rick & Mary. We missed Sheila, but we had the Sheila Special. Everything is clean, clean, clean. We the guest services staff are outstanding, helpful and just plan friendly. LOVE the Nautilus Inn. We will be back-already have the next reservation set!", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“great place, amazing staff”", "Author": "MistyPoteet", "ReviewID": "UR114577881", "Content": "My husband, nine year old daughter, and I stayed at the Nautilus Inn for a couple of days before heading to Disney for a week. The Hotel was very clean and nicely furnished. The service from the staff was amazing and they all had smiles on their faces. If you have any questions about the best local places to dine or best places to visit while there ask Rick at the front desk! He was so funny and informative, a true pleasure to have met him. I would recommend this Hotel to anyone looking to have a great vacation. Misty, Kiya & Josh Poteet", "Date": "June 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The nicest people I've met in the hotel business ever.....”", "Author": "kshirley68", "ReviewID": "UR114362657", "Content": "My family and I stayed here on June 17 2011.The beds were new,we hated to leave Rick&Heather were so helpful.We will be staying in this hotel again when in the area.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mayo, Florida", "Title": "“Great time as usual”", "Author": "mmccray", "ReviewID": "UR114079241", "Content": "The Nautilus Inn is always a great place to stay. The hotel is always comfortable, clean and pleasant. We have been coming for years and are always pleased. Rick is always friendly as well as Sheila and Mary. THanks for a great stay! Marion and Bobby McCray", "Date": "June 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The cleanest hotel that I have ever stayed at.”", "Author": "maghin51", "ReviewID": "UR113701785", "Content": "We had an amazing stay at the Nautilus Inn. All of the employees were extremely helpful and friendly. From the front desk to the housekeepers, all of my questions and concerns were answered. The Nautilus Inn is definitely the hotel I will be staying at on future visits to Daytona Beach.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“we loved it and we well be back”", "Author": "salehalmtrouk", "ReviewID": "UR111357128", "Content": "clean hotel ,nice stuff members ,amazing room view ,good breakfast ,wonderful beach ,we had nice Experience .", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Live Oak, Florida", "Title": "“This is a great place to stay in Daytona”", "Author": "pokey1985", "ReviewID": "UR110735335", "Content": "We live in Florida and have went to Daytona Beach numerous times. This is the first time we have stayed at the Nautilus Inn and it was a great hotel. It is very secure, the rooms were clean, the beds were comfortable, even the hallways smelled clean. They had gave excellent service. The pool was clean and it is right on the beach. The one small thing I didn't like was the chairs by the pool. They were liked together so you couldnt move them towards the sun. However, that is a small inconvenience compared to everything else that was fabulous. I will be staying here again.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ocala, Fl", "Title": "“The BEST”", "Author": "hkjennings", "ReviewID": "UR109771811", "Content": "We highly recommed Nautilus Inn for anyone who enjoys a very clean hotel, great staff, Everything we read on the tripadvisor from previous vacationers was all true. There is nothing negative to be said. Sorry it took 20 plus years to find the best place to stay. The people go above and beyond to make sure your stay is enjoyable. We will be back!!!!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Savannah, Georgia", "Title": "“A+++++ Hotel”", "Author": "BachCam", "ReviewID": "UR106581064", "Content": "Extremely clean. Quiet. Great location. Wonderful staff. Will definitely stay at the Nautilus again.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raritan, New Jersey", "Title": "“We had a very nice relaxing vacation with teenagers.”", "Author": "daytona111", "ReviewID": "UR105328286", "Content": "This is our 6th time visiting Nautilus! Previous visits were over night before & exitng the hectic world of Disney. This time, we stayed a week, just beach and pool. Most guests are bused in from Canada on a regular weekly basis. They have always been a delightful group of people. All are retired. The staff have always been so helpful and very friendly. Not a big hotel at all, you will run into the same people. It's a friendly crowd. Rick, Rose & Desmond.....are much fun and always have a smile on! This is a very clean hotel! It is an amazing feeling to know that, when you go to sleep you don't have to worry about anything crawling around or in your mouth. Seriously, think about it! If you are a mouth breather...then this is your kinda place! Beds are very comfortable, spacious bathroom, could use some more shelving, small frig, stove top and micro with all kitchen supplies to make meals. Balcony from every room has view of ocean, there are 9 floors, I recommend 4th floor and above for total view of ocean. I felt very safe for my three teenagers for them to walk freely around the hotel and back and forth from the beach. WIFI access at pool, hot coffee served all day long, I made ice coffees. Continental breakfast provided, breads, cakes, cereals, hard boiled eggs & fruits, nothing extragent, but enough. There's also a diner across the street in walking distance & Winne Dixie. A public computer in foyer, happy hour free drinks and heated pool with jacuzzi, that was excellent! The pool water was very clean and area well kept, amble chairs and umbrellas provided on deck, towels provided. Beach offers chair & umbrella rentals. Bring bikes for the beach, rentals are outrageous. Bring a kite! Six golf courses less than 10 miles. Found ourselves going over to the mainland for dinners and lunches. As for local restaurants, we found nothing clean enough for us to eat at. Visit the Hilton in downtown Daytona, you will find nice restaurants there. We know Nautilus Inn to be a safe environment for me and my family, it is above excellence in cleanliness!, above excellence in courteous staff. You know Daytona, you know what it attracts !....this Inn is an exception and I highly recommend this place for you to get a restful nights sleep. We most certainly will come again.....Maria Schwerdtfeger", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Nice Hotel”", "Author": "TCJF", "ReviewID": "UR103102014", "Content": "My husband and I stayed five nights in April 2011, after having a bad experience on our first night at another hotel. The hotel caters to older travelers that are bused in from Canada (lots of them) and they have organized activities for them. We had a room with a kitchenette (full size refrigerator and stove) and a balcony with a side view of the ocean. The room was very clean and everything was in good condition. The continental breakfast is just okay -- very basic. We tried the happy hour one day but to be honest it consists of cheap wine and weak drinks, so we didn't go back. My husband and I are in our mid-fifties and the geriatric crowd was a lovely bunch of people, but sometimes it grew a little tiresome to be around the crowds of them and their organized activities. In addition to the nice rooms this hotel is QUIET at night so you don't need to worry about being next to a party animal, which we were concerned about initially in visiting Daytona Beach at spring break time. The staff at the Nautilus are very helpful and friendly. There was always an abundance of parking spots since most of the travelers were bused in. I think it's a great place to stay if you don't mind being around the geriatric crowd. I'd definitely consider staying there again.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“Great Oceanfront Hotel! 8)”", "Author": "cjl80", "ReviewID": "UR102957775", "Content": "Great Hotel! Friendly staff, all you have to do is ask and they'll take care of you! Nice heated pool & hot tub. The nights we stayed the hotel had a tour bus with senior citizens from Canada. They were all wonderful! We were the youngest guest there and it was very nice. My daughter & her friend interacted very well and learned some interesting things from them. We decided to say another night, but at a different hotel (because it was a little cheaper) WOW! The girls liked the Nautilus Inn way better then the other hotel and wanted to go back! It was great, i would reccomend to anyone. Great location, fantastic view of The World's Greatest Beach!", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Port Richey, Florida", "Title": "“Just like home!!”", "Author": "ssheila1950", "ReviewID": "UR100741478", "Content": "We have been staying here for years and find this the most cleanest hotel on the beach. and the staff are just wonderful, breakfast and happy hour is great, the food is fresh and we never have a complaint. , it's like home sweet home to us , we would never consider anywhere else. We love Rich and Sheila and all the others whom we have dealt with on our wonderful stay. Sheila and Joe Gallina and Family", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Audubon, New Jersey", "Title": "“A great find”", "Author": "happytraveler08204", "ReviewID": "UR100391747", "Content": "What a great place. Clean, clean clean. Beautiful views of the ocean, and a staff that will have you smiling. The free happy hour doesn't hurt either. Didn't have a chance to get in the beautiful heated pool this time, the air was a little chilly .", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great Place Overall - Only Minor Complaint”", "Author": "aandmvideos", "ReviewID": "UR94193178", "Content": "Rick & Rose at the front desk ROCKED. Rick was so funny one would think he was auditioning to be on Last Comic Standing. Only 4 stars for the room because they only had what looked to be a 19 or 20 inch TV in the room which really took away from the beauty of the room. Also, only 4 stars for service because we put in a wake up call for 10am and NO ONE ever called. Aside from that, it was a great stay. Awesome ocean front view with private balcony and the price CANNOT BE BEAT.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oak Hill, West Virginia", "Title": "“GREAT ROOMS, GREAT RATES!!!”", "Author": "MommaD2", "ReviewID": "UR90499810", "Content": "The hotel staff was excellent. Everyone seemed truly happy that we chose to stay there. We had an oceanfront room that looked out onto one of the most beautiful beaches in the world. Our room was equipped with full size appliances including stove, oven, microwave and refrigerator. Everything you could ask for for a very nice stay.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Havana, Florida", "Title": "“I wouldn't stay anywhere else!”", "Author": "Lorrie9497", "ReviewID": "UR89038909", "Content": "My husband and I stumbled upon the Nautilus several years ago and I would never consider staying anywhere else. The staff is welcoming and very friendly. Rick is the absolute best and one of the most wonderful people that I have ever met. He gets to know the guests and makes everyone feel special. Mary, Angela and the rest of the staff are also great and a lot of fun. Seeing familiar faces each time we visit gives me a feeling of \"home\". The friends that I have made there have forever changed my life and I am truly grateful.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St Augustine, Fl", "Title": "“A bargain on the beach”", "Author": "BluesBoy28", "ReviewID": "UR86875155", "Content": "Oceanfront corner room for less than $100 a night? Unheard of right? Not here. Really nice room with a corner balcony that overlooked the ocean and the city. The staff is very friendly and helpful. As far as I know it's not part of a chain, but it's clean, spacious comfort. It's a bit away from \"the action\" but there's no doubt we'll stay there again. Very nice experience.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bell", "Title": "“Wonderful stay”", "Author": "rcsjs1", "ReviewID": "UR86093165", "Content": "The staff greeted us as if they were truly happy we were there. Rick & Calvin at the front desk were very helpful with all our needs. Susan at breakfast was friendly to all the visitors. The rooms were clean and the staff very helpful. Really enjoyed our stay, will stay again.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maidsville, West Virginia", "Title": "“I will recommed this hotel to everybody, very nice”", "Author": "corey138", "ReviewID": "UR78065387", "Content": "This was a very clean hotel, the view was great. The front desk staff was so nice! My family and I loved it!! I will definately recommed this to everyone I know. The price was also reasonable, even the pool area was nice and clean, there wasn't even any sand on the deck, good job!! We definately will be back, now I know where to stay!! Thanks alot!! Crystal Frum", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“A hidden treasure of a hotel with spectacular ocean views.”", "Author": "floridafan145", "ReviewID": "UR77530437", "Content": "My husband and I stumbled on this hotel by accident and we will definitely be returning if we are ever back in Daytona. From the moment we walked in and were greeted by Rick, who was the most welcoming person we encountered on our four week trip to the States, we felt like we had come to stay with family. Rick, the front desk manager, should be getting paid double as he was the one who made us want to stay here. He was friendly, funny, informative and extremely entertaining, while all the time remaining professional. The room itself was spotless and the amenities were an added bonus. The manager's cocktail hour helped us make friends with others staying in the hotel. The pool was crystal clear and overlooked the ocean. The breakfast was adequate and set us up for the drive to Orlando. We would recommend this hotel to anyone.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent Room and Service!”", "Author": "hcooper713", "ReviewID": "UR77097594", "Content": "Social Class of other guests was outstanding. We were greeted with dignity and respect by staff and other guests. Will seek the same professional and courtesous staff and guests next summer. We have spent many summers on the beach since the mid 70s but this was the best ever. hc and bc Atlanta, Georgia", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best in daytona. Stayed at many and best...”", "Author": "Kentrio", "ReviewID": "UR77009697", "Content": "Best in daytona. Stayed at many and best so far.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Spring Hill, Florida", "Title": "“Clean”", "Author": "gamiller", "ReviewID": "UR76814220", "Content": "This is a very clean place. The only downside I could see would be for families with small children. The age group of most of their client are more likely to be senior citizen from Canada. This hotel retired hosts Denure tours and the majority of rooms will be filled with retired Canadians. The beach area is quiet and most of the action is further north.The continental breakfast was better than most ( at least in Daytona) This is a quality place and is worth paying a few bucks more for.. The staff is accommodating. Rick at the front desk is both accommodating and genial..", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“Wonderfull stay and CLEAN CLEAN CLEAN hotel”", "Author": "lasorciere08", "ReviewID": "UR75150749", "Content": "this is not a brand new hotel BUT this is by far the cleanest hotel i have ever stayed at , i had reservations at the plaza resort spa and i arrived a day earlier to my reservation at 1 am so i asked to visit a room there and uppon coming in the room a big bug on the floor and a uge coakroach next to the bed so i canceled my reservation at the plaza (remember the plaza is suppose to be a resort )......then driving around at 1:30 am we found this slogan \"not happy check us out\" , well the staff at NAUTILUS INN is extremly friendly ,(Rose welcomed us at 1:30 am ) the hotel and rooms are extremly clean smell nice too (i have apsma and usually have problems everywhere i stay because of dust) but not at this place.....you have free continental breakfast too .....the hotel is calm alot of senior citizen stay there so very quiet hotel , the rooms have full size fridge , full size oven , microwave , the ac are very very cold ,bathroom is small but who cares your not staying in the bathroom right ... even the returning guest there are very friendly and helpfull , their is a free bus everyday going to some specific places each day (mall , flea markets , restaurants etc) , the pool is clean and the beach what can i say clean warm sea water , (it is not located on the public part of the beach so not crowded)...i will defenatly stay there again when i go backto daytona on vacation.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Umatilla, Florida", "Title": "“The most friendly, clean & comfortable hotel ever.”", "Author": "smd31313", "ReviewID": "UR74447149", "Content": "My husband and I have stayed at this hotel three times and I couldn't possibly say anything bad about their services. The front desk clerks are very perfessional and courteous. Angela was a great help everytime I have reserved a room. I would definatley recommend this hotel to anyone who would ask for a great hotel.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chattanooga, Tennessee", "Title": "“Warm & Welcoming”", "Author": "WLW_10", "ReviewID": "UR74296296", "Content": "We have stayed at The Nautilus Inn since early 90's and never have we been dissappointed in any way. The staff is very warm and friendly and Mary (manager) is the greatest, she makes friends with everyone and truly cares about making it the very best experience possible. Continental breakfasts are especially nice with much variety. The only thing I would have changed in our visit would have to be the fact that our room had no iron/ironing board. You have to go to 4th floor to the vending/laundry area to do your ironing. We wished we'd carried our own iron or purchased one upon arrival. All in all, it's still the best for value and absolutely the very... very cleanest you will find in Daytona and parking is FREE!", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashville, Ohio", "Title": "“The Nautilus is the only place we will stay at Daytona Beach”", "Author": "rcampbell31", "ReviewID": "UR73623372", "Content": "We have been visiting the Nautilus for many years. The Nautilus has never disappointed us. The rooms are always well maintained and clean. The employees are always welcoming from the front desk to the maintenance crew around the grounds. The continental breakfast is well managed and the happy hour in the evening is always relaxing. Mary, Rick, Sheila and the crew at the Nautilus can't be beat!", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lakeland, Florida", "Title": "“Fabulous, Friendly and Fun!”", "Author": "glotk", "ReviewID": "UR73298101", "Content": "We just returned from a four day stay at the Nautilus Inn. We vacationed with our two children, brother, sister-in-law and their two children. Our children range in age from 10-13. We arrived to the hotel early expecting to spend a few hours on the beach before check in. Our rooms were ready and we were able to get settled before heading out to the beach. Our room had a full kitchen and fabulous view of the beach and the city. I was a little hesitant about this room as it is an ocean view. I was assured by Sheila P that this was a wonderful view and provided both views of the ocean and the city at night. This was indeed the case. The pool deck was clean and spacious and the access to the beach was very quick. This is our third stay at the hotel and will be our only destination when coming to Daytona beach. On all of our stays we have used Sheila P to arrange our stay and she has been very accomodating and helpful in planning our stay. We highly recommend this hotel. R and K from Lakeland", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "gallion, Alabama, USA", "Title": "“The best”", "Author": "jknight472000", "ReviewID": "UR73201629", "Content": "i would highly recommend this place to stay...they were more than accomadating...after long trip down there we were exhausted...they got us in our room before check in time...we were allowed to use the hotels ammenities while we waited...the place was clean and the ppl were very nice and treated us like we were part of their family...the pool and hot tub was awesome...access to the beach was easily accessible...great location to stores and resturants and other attractions...the website does not do the hotel justice...the pictures are exactly what the place is like...honestly check the reviews on here before u book a hotel because we checked out several and when we got down there we found out most were not what we thought...we book this hotel based mostly on reviews from this website and we were very very pleased with everything about this place...five star place to us...the price was great...do stay here...if it is a vacation with the family or just couples retreat it is great for anyone...loved it loved it loved it...words cant describe how satisfied we were...we have been married 12 yrs never had honeymoon or vacation alone and we have four children and would not stay anywhere else but here the next time we go down there...it was like a condo...", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Southern Hospitatility @ it's finest”", "Author": "warrior49", "ReviewID": "UR72617160", "Content": "We have stayed many places on the strip over the years, but this has to be the cleanest and friendliest place we ever stayed. Desmond the maintenance guy was very helpful and kind and the front desk staff was very pleasant and accommodating. I would recommend this hotel to any one. I call it Daytona Beach hidden Gem nothing extravagant but the greatest value for your money on the beach.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Very nice stay and beautiful view of ocean...we loved it”", "Author": "ppalomino", "ReviewID": "UR69621240", "Content": "Had a great stay, nice, clean hotel. Great...Would go back there again....", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gainesville, Ga", "Title": "“Best Hotel in Daytona”", "Author": "allison1887", "ReviewID": "UR68928729", "Content": "We just returned from our stay at the Nautilus Inn and we were so happy with our choice. Not only are the rooms clean, but the grounds and the rest of the hotel are spotless. The continental breakfast was very nice every morning and in the afternoon they had some sort of activity planned. The beach in front of the hotel was never crowded neither was the pool. I would recommend this hotel to anyone!", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Memorial Day/ Anniversary Weekend”", "Author": "Slick_Chick17", "ReviewID": "UR67601469", "Content": "We love the Nautilus Inn. This hotel has the most courteous, customer friendly staff around. They always go the extra mile. The rooms are exceptionally clean. We travel to the beach at least once a weekend, and the Nautilus Inn has become our new beach home. We have stayed almost every hotel on the strip, and this one is CLEAN, CLEAN, CLEAN- just as they advertise. We will not be disappointed.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Treated like Family”", "Author": "EarlandPatty", "ReviewID": "UR66329911", "Content": "We saw their sign out front...\"Unhappy?? - Come take a look at us\". From the moment we were received by Rick at the front desk we knew it was the right place for us. The hotel was very clean, friendly and located right on the beach. Looking forward to staying there again!", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa", "Title": "“Cleanest hotel I've ever seen!”", "Author": "JSN24", "ReviewID": "UR59170195", "Content": "This hotel is by far the cleanest hotel I've ever stayed in. I never knew what a hotel SHOULD smell like until I stayed here. There is no musty smell that you get at every other hotel. The staff is so nice and helpful. There is a free happy hour every night and a continental breakfast every morning. They also have various activities planned throughout the week, or you can just grab a game or puzzle out of the sand dollar room and do that whenever you want. There is no way you'd ever find a hotel as clean and nice as this one for the price you pay either! I was so impressed by this hotel and we will definitely be back to stay again sometime soon! I'll never be able to settle for a musty smelling room again!", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ottawa", "Title": "“Mostly a good experience.”", "Author": "CdnTravellerOttawa", "ReviewID": "UR58338110", "Content": "We stayed at this hotel for two nights while waiting for a rental home in Orlando. It is clean and has good access to the beach and comfortable beds. The continental breakfast is very limited. The hotel is located in a less than desirable area of Daytona Beach. There seemed to be a large population of seniors enjoying the hotel with a lot of scheduled activities for day and evening. For us, not seniors, it proved a convenient stopover for a couple of nights, but not a destination.", "Date": "March 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Knoxville, TN", "Title": "“Fabulous”", "Author": "brimoa1", "ReviewID": "UR56695159", "Content": "I highly recommend this hotel. It is affordable, comfortable and accommodating. I will stay here again.", "Date": "February 21, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "new hampshire", "Title": "“Excellent Accomodations”", "Author": "sunshine2go", "ReviewID": "UR47721796", "Content": "if you are looking for a very clean oceanfront hotel, this is it. The room we booked was oceanfront and it was. we watched dolphins in the morning and night from the balcony. The staff is great and the grounds very clean. Enjoyed the 5pm cocktail reception and karoke as well as the continental breakfast in the am. There are a lot of places on the beach but many looked rundown and from some of the reviews of them I can now see why. You won't be be disappointed with this place.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Macon, GA", "Title": "“Absolutely Fantastic”", "Author": "Grandestboys", "ReviewID": "UR38172620", "Content": "Without a doubt, the stay at the Nautilus was excellent. We will definitely stay here anytime we return to Daytona. The service was above excellent, and the staff was great! What a pleasant stay with no problems. We had several family members, now living in different states that came over for a surprise visit. All of our family members were treated wth such kindness, and the front desk staff was excited to help them pull off the \"surprise\"! It was a blast! Thanks to all of you at the Nautilus! We will see you as often as possible.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Place - Will Return Next Year, if not before!”", "Author": "shee51264", "ReviewID": "UR37966043", "Content": "The Nautilus is fantastic! The entire staff was very friendly, especially Rick, at the front desk! This place is extremely clean. We stayed in an oceanfront room that had two double beds, a sofabed and a kitchen with a full size refrigerator, stove, oven, microwave and sink. Our room was so spacious that the rest of our group (about 30 of them) ate dinner in our room one night. The free breakfast every morning was great and the happy hour in the afternoons was alot of fun! The grounds are kept immaculate. The pool is very nice and the beach is gorgeous! I can't really even think of anything negative to say about this place. We will definitely go back!", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City", "Title": "“Great family oriented place”", "Author": "arsenio15", "ReviewID": "UR37930057", "Content": "This is my first time in Daytona beach, I was first attracted by the price and also some reviews I saw on Trip Advisor although I was expecting much but to my surprise it was much better than my wife and I anticipated. The kids had a great time with the Sand buckets they were given upon arrival by a really friendly Front Desk attendant. The continental breakfast was great and so was the Happy hour. I wish I had booked it for longer than two days which I am planning for next time. Great Location close to everything and most of all great for the money Keep it up.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "tampa", "Title": "“Great Place to Stay”", "Author": "33618", "ReviewID": "UR36511979", "Content": "My sister and I decided to do a family weeked with our teenage grandchildren. One 13 and one 18, what a great weekend. My family requested the deluxe ocean front and an ocean front for my sister, the staff was so helpful, they arranged for us to be beside each other on the 4th floor. The Hotel was spotless and the freindliness of all who work there was fantastic. We live in Tampa, love the beach and now have found a new home on the Atlantic. Can't say enough about this place and how clean it is. I would like to extend a \"Thank you\" to the staff for making our weekend so nice.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "toroto", "Title": "“Love the place”", "Author": "sweetsour100", "ReviewID": "UR27126182", "Content": "It is a amazing hotel, we've been there 4 years in a row. The staff are nice, kinda and loving, there is always something to do. The pool is nice, and you have fast and quick access to the BEACH! I am a kid and i g wiht my family every year, and i really enjoy it alot!", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Outstanding!!!!”", "Author": "Rev_Dennis", "ReviewID": "UR23822455", "Content": "This place is GREAT! So many of the hotels/motels on the strip are just unacceptable. I left one of those and luckily came upon this hotel. The girl Heather at the front desk is friendly and helpful. The staff goes out of their way to make your stay pleasant. I will be back. I highly recommend this place. Very clean and directly on the beach. I am fussy. This place is nice.", "Date": "January 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“best hotel in Daytona!”", "Author": "natjaceli", "ReviewID": "UR8081959", "Content": "High Praise for the Nautilus! My family has been using this hotel for the past 10 years. On the first visit (with extended family) we were staying somewhere else...and were not happy. We moved to the Nautilus and have made it our annual stop! Rooms: very clean and recently updated. NIce size, all come with some size kitchen. Every room has either an ocean front or side view. And the Side views are all just as nice. (only con is they do not have suites) Pool: maintained well. Has 1 pool and 1 hottub. nice pool deck. They provide a continental breakfast and also have a 5o'clock happy hour. This hotel is mainly used by Canadian Tour Groups. This is one of the attractions for our family. Their are many families but also quite a few seniors. I have 3 kids under 10. The room is just the right size and they love the pool. We make this our annual stop after Disney each year. Its a nice quite place to really relax befor the vacation is over. The staff is very friendly and alway egar to help. Even if you are staying some where else....stop by there and take a peek for your next trip!", "Date": "July 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milledgeville Georgia", "Title": "“A nice clean hotel on the beach ”", "Author": "DAWGTRIP", "ReviewID": "UR8078371", "Content": "This is a nice well taken care of beachfront motel with good service and great location. The staff was very helpful and friendly. The maids did a excellant job of cleaning and taking care of us. Breakfast was good but nothing to brag about. The pool was nice and we felt safe staying here.", "Date": "July 8, 2007"}], "HotelInfo": {"Name": "Nautilus Inn", "HotelURL": "/ShowUserReviews-g34172-d634305-Reviews-Nautilus_Inn-Daytona_Beach_Florida.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1515 S Atlantic Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "634305", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/90/57/0d/filename-img-1798-jpg.jpg"}}