{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“An absolute must.”", "Author": "Conocoe", "ReviewID": "UR128254659", "Content": "The guy that welcomed us was wonderful, and gave us restaurant recommendations (as well as where to go for the best gelato in Italy) and how to plan out our activities in Rome. (By the way, all of his restaurant recommendations were excellent.) He was super helpful and was also very attentive to all of our needs. He upgraded us to the best room without additional charges and we all enjoyed our stay very much. I would recommend this place to everyone!!", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Plymouth or Manchester", "Title": "“An OK hotel/hostel, just avoid during summer!”", "Author": "robbo1000", "ReviewID": "UR127952805", "Content": "I stayed at the Lodi for two nights in September 2011. Whereas temperatures in the UK are falling to around 20C by day in September, in Rome it was still more than 20C at night! Having paid next to nothing in September I wasn't expecting much. I didn't get it either! The staff were wonderful in helping us explore Rome, however, the rooms were far too hot at night despite fans. Air-con is a must in Rome April-October! The location is a bit out but Tuscolana station is nearby (downhill there, uphill back, mind!) which links to Termini in a few minutes (services are quite frequent and mainly punctual) or Trastevere in the other direction (again, a fairly frequent and mainly punctual service) I would stay at the Lodi again if the price were VERY low and it wasn't so hot, but next time when in Rome I shall likely save up to afford somewhere a bit nicer. Hostels aren't really my thing anyhow and the hotel in which I had stayed prior to this represented far better value for money", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkeley, California", "Title": "“Lovely Lodi!”", "Author": "Scousepeasant", "ReviewID": "UR127676757", "Content": "We just stayed here 1 night to do some sightseeing as I was attending a conference in Rome & my office had booked me into a more upmarket hotel near Cavour metro from the next day, but we had a lovely experience here & wished we could stat longer. On arrival (at about midday) we were allowed to check into our room & were offered a free drink which we enjoyed in the sunny garden. The friendly owners gave us great advice on sites & also a map showing places to eat in the local area. We wandered to the nearby Via Pigneto and sipped red wine & enjoyed nice food & great atmosphere away from the bustle of central Rome. Next day after a continental breakfast we packed & checked out. But the owners offered us another drink so we sat in the sunny garden again & sipped coffee (again on the house). Lodi is a hard place to leave. On arriving at our 4 star hotel the busy receptionist took quite a few minutes to even acknowledge our presence. And this place costs over twice what we paid for Lodi. Lodi is a little out of the centre but no great distance. For the price, great service & peaceful location, it's worth the longer distance. I highly recommend this place & would go back like a shot.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kaiserslautern, Germany", "Title": "“Delightful Place”", "Author": "Elizabeth S", "ReviewID": "UR126333462", "Content": "I can't say enough good things about Hotel Lodi! I had a very enjoyable week long stay there. The staff were very friendly and informative, always willing to help with anything. The breakfast was great and I really enjoyed the peaceful garden! very clean as well. It was a little out of the way, but after a few days I really enjoyed being out of the hustle and bustle and in a quiet more authentic neighborhood.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Lovely”", "Author": "cvmerritt", "ReviewID": "UR125172417", "Content": "Hotel Lodi was a pleasant surprise. Although it is a little far from central Rome on foot, the staff make up for it. Very very hospitable, informative and friendly, the staff at Hotel Lodi made my stay memorable! I would recommend this to anyone looking for a nice place to stay out of the hustle and bustle!", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Hard to find”", "Author": "keef1988", "ReviewID": "UR124401626", "Content": "Good location, not too far from the city and was very quiet. Nice art / graffiti all around. Very hard to find, the sign is the size of a business card. Great staff, brought us ice cold water at check-in after a very long, hot walk. Also helped plan things to do Excellent breakfast too... let us take some to-go when we checked-out at 5am Rooms were average, people were friendly. Didn't have to pay till check-out", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“Good staff. Room was clean but not what we paid for”", "Author": "Unknown66", "ReviewID": "UR123916960", "Content": "Clean room, good staff. but we got a double room and it was very small and the shower was tiny you could barely get in the door.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Hotel Lodi for value and nearby food recommendations”", "Author": "lindab34", "ReviewID": "UR123152038", "Content": "Hotel Lodi has very friendly and committed staff and good knowledge of excellent local neighbourhood eating places, ranging from family hosterias to cheap good pizza and bars. Wifi included, bus or metro easy to main sites. If you have a car, parking in streets easy. Common room too small but garden beautiful. No kitchen but can use fridge. We would stay again next time for sure.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "istanbul", "Title": "“Best place to stay in Rome - Roma'da kalmak için en iyi yer - Il miglior ostello a Roma”", "Author": "ozgur_a89", "ReviewID": "UR121470039", "Content": "I found Hostel Lodi on internet by chance. I had no idea about the place before actually going there for the first time. I was going to stay in Rome for 6 months but I had no place to stay in the beginning so I started my journey in this wonderful place. It's not just a hostel. Right now I feel like I have a second home in Rome. As soon as you enter from the door you start to get the feeling that you know the people working there for quite some time. And once you get to know them you feel like you've been friends with them for ages. The thing that especially made me even more fond of this hostel was the consciousness of the staff about the security, cleanliness and comfort of the people staying there. I would definitely recommend this hostel to anyone who wishes to stay in a cosy clean hostel with full of wonderful people. Bu Hosteli internette tamamen tesadüf eseri buldum ve daha önceden hiçbir fikrim yoktu bu hostel ile ya da herhangi bir hostel ile ilgili. 6 aylık Erasmus serüvenime de bu hostelde başlamış oldum böylece ve hala hiç tereddüt etmeden iyiki de öyle olmuş diyorum. Gerçekten her anlamda son derece güzel bir hostel. çalışanların güvenlik huzur ve temizlik konusundaki özenleri de ayrıca dikkate alınması gereken bir konu diye düşünüyorum. Kısacası bu hosteli Roma'da güzel bir zaman geçirmek yeni insanlar tanımak ve ömürleri boyunca unutamayacakları anılar yaşamak isteyen herkese tavsiye ederim. il miglior posto a Rome se cerchi qualcosa piena di vita e le gente piena di energia. Era la prima volta a Rome per me quando ero li. e devo dire che loro hanna fatto il mio semestre di Erasmus ancora piu indimenticabile. le stanze sono comodissimo e il quartiere e' tranquillo. non e lontano dal centro e' c'e' sempre qualcuno da cui potete prendere aiuta. posso consigliare questo ostello senza dubbio!!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Cheerful and cheap!”", "Author": "naughtytory", "ReviewID": "UR121435216", "Content": "I cannot praise the friendly helpful and generous staff enough, they were wonderful. We shared a triple room with an ensuite. Plenty of space and nice and clean. This is not luxury but for the price is fully functional and very hospitable. We were offered drinks on arrival and hadn't booked breakfast but were offered the first day on the house, simple tasty pastries, fresh juice and gorgeous coffee, and we were late for it but this was still not a problem for the great staff. There are a couple of computers to use at your leisure and free wifi. The house keeping attended to our room everyday when we left and did it not hassle us before we went anywhere just snuck in no matter how late we went out. It is a good 10 minute walk from the nearest metro but once there the staff will give you a map with all the bus routes from just outside the hotel which will take you all over the city or to the nearest metro so don't let the initial walk put you off. Each room has a tv but if you are in Rome I am guessing it is mainly to soak up the city and not sit in your room, in which case this hotel really is suitable for families ( I could not get a reasonably priced hotel for 3 anywhere else) or couples, certainly friends and solo travellers.Great value and great little find.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not central but well worth it!”", "Author": "CPG74", "ReviewID": "UR121156889", "Content": "I spent 4 days at Hotel/Hostel Lodi and if I go back to Rome, I will definitely stay there again. I stayed on my own in a double room with my own bathroom and the room, bedding and bathroom were very clean and cleaned every day. It is out of the centre but not far to the metro and as I am a walker it is a great walk into the centre. It is also nice to go to locals markets/shops. There are also great local restaurants where you do not get fleeced like you do in the touristy city eateries. I spent my birthday there and the owners had put a bottle of wine, and a bunch of flowers in my room to wish me well - a lovely touch you would most probably not get in other establishments. The staff are very friendly and will go out of their way to help you. A great stay!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Lovely”", "Author": "Toastaloha1955", "ReviewID": "UR120551220", "Content": "Hotel Lodi is located in a peaceful area of Rome, San Giovanni / Porta Maggiore. I liked it so much that I returned for a second stay. It's a small home enviroment away from home. The owners and staff are very helpful and friendly. Breakfast is yummy and a great way to start your day.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Loughborough, United Kingdom", "Title": "“A great exciting hostel in our journey!!!”", "Author": "uk_cinker", "ReviewID": "UR120412061", "Content": "You can never miss this great hostel when you visit Rome! I was traveling with my three other friends for 16 days and Rome was one of our last stops. Everyone was tired when we got there. We spent a bit long time to find this hostel. Maybe a blinking sign would be helpful? Anyway, we finally got the hostel. It was ordinary from the door...I have to say. But we were specially welcomed by the beautiful staff Sara. She was so nice and talkative. I bet you will like her...oh....even love her. Other staff are all great. I bet there are the warmest hostel staff we met during the 16 days. She warmly tell us where we can find the nice Italian restaurants for 30mins....and also print the maps for us! She is always ready to help you. Of course, you can also find other staff are great. Environment and Rooms This location is perfect compared the all-graffitied city centre, also quite and maybe safe, except a bit far from the centre. But you can still get the centre in 30mins. The hostel itself is great. It has a garden. All of us like it. You can enjoy your breakfast or rest there. The downside is the seats are limited. But still you can stand in the garden, enjoy the sunshine or rains! The rooms are good. We booked a shared private room for four people. We slept well for three nights! Breakfast and food This hostel is supplied with nice breakfast. Two soft breads, one big bottle of juice and a pot of coffee (which you can choose from coco or other coffee drinks). The food is tasty and enough to fill your stomach. You need to prepare the lunch and supper yourself as it didn't supply any supper! I will definitely recommend this nice hostel to everyone who would like to visit Rome! Hope you enjoy your trip! Teng", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Truly Superb Service”", "Author": "sudhirnair", "ReviewID": "UR120194936", "Content": "The feel of staying in this place is that of immense warmth from all the staff.I have stayed in many places mostly much more expensive but never have I met staff who are so helpful whether it be general guidance around Rome or a good restaurant or shopping.I would definitely come back when I am in Rome next.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great, great, great place to stay! ”", "Author": "Meeksi", "ReviewID": "UR120089171", "Content": "The staff at Lodi hotel are amazing! Their personal touch made us feel so at home! Upon arrival we were offered coffee and juice and something to eat in the lovely garden while waiting for our rooms to be finished.  It didn't stop there - they were always at hand with a smile and a wealth of information to make Rome enjoyable for you! Be it for a full day sightseeing, a leisurely afternoon stroll or something to eat! They also excel at all the usual things - an amazing breakfast (pastries, real coffee and real fruit juice!), very comfortable beds, down duvets, a common area that includes a lovely garden setting, and they are an easy walk from the Colosseum! We have been traveling for 10 months and it has our favourite place by far! Thank you Michele for making our time in Rome so special and enjoyable! You will definitely see us again!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "QC", "Title": "“Great Service!”", "Author": "TiffRoseK", "ReviewID": "UR119627078", "Content": "After how many failed attempts to get a right hostel in Europe, this was one of my first great finds! The staff were very friendly and helped us find the great spots and also the best routes. The location might first turn you off since it wasn't even situated in the map they gave us (wasn't in the city center) but traveling by bus around is also quite fun! This hotel was situated just right where you could see modern and traditional Rome and it was a great comparison. The rooms in the hotel were okay and breakfast was delicious! Great Italian breakfast was served at the back with the garden. The hotel might not be big but they really had good rooms. One of the best service-oriented hostels I've been! I'd really stay here again :)", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "salvador", "Title": "“We really loved Hotel Lodi!”", "Author": "liumarianetti", "ReviewID": "UR119050142", "Content": "Speaking practically: the rooms are all right, the localization is fine too, the breakfast is nice... Everything makes Hotel Lodi a very nice place for being during your trip. But, we have to make an especial comment upon the way we are receptioned; so warmfully and caring, that after Hotel Lodi, every other Hotel in Italy were, simply, not good enough! Thank you, specially, Michelle and Claudio!!!! Ok, ok, the only thing we would point as not so good, is the stairs, for those who may have problems with locomotion, but, even those, were almost impercebtible comparing to the other advantages of Hotel Lodi. Vorremo tornare presto!!!!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Victoria, Canada", "Title": "“Fantastic”", "Author": "c w", "ReviewID": "UR118960835", "Content": "This is not to be missed, if you truly want to run into genuine, well educated, well travelled, patient, friendly people stay here! My husband and I spent our honey moon in a shared dorm room, and loved every moment of our stay in Rome. The staff at hotel Lodi are a joy to be around, not to mention very positive. This is refreshing after a long journey. Not to mention there are fruit trees growing in the patio area that were hand planted and cared for. If your heart and mind are open you will fully appreciate its character. Blessings from Canada!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fitzroy, Australia", "Title": "“Lovely time at an affordable price - Recommended for couples wanting a romantic relaxing stay!”", "Author": "Anne H", "ReviewID": "UR118725540", "Content": "Besides the beautiful garden which breakfast is served in, the staff make this place. They are hospitable, friendly, fun, amusing and so helpful. Recommended local quality cheap authentic restaurants. Recommended places around Rome. A comfortable bed, beautiful garden view, clean room, delicious breakfast, and a coffee on arrival. I really couldn't recommend this enough to couples wanting a relaxing break away. Wifi, TV, ensuite, big room, and a really relaxed atmosphere. You can't ask for more. A delight to stay there!", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ticks the right boxes”", "Author": "clarkbardsley", "ReviewID": "UR117557853", "Content": "Friendly Staff - tick Garden for drinks, breakfast and coffee - tick Good local bars and restaurants - tick Proximity to the main sights - not so much, 15 min walk to nearest metro station", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Ithaca, New York", "Title": "“Great Hostel”", "Author": "akaluski", "ReviewID": "UR116190675", "Content": "This hostel was extremely accommodating and comfortable. The rooms were wonderful as was the hostel atmosphere. The staff was extremely friendly and helpful. THe location was also perfect. You have the ability to walk to the Colosseum and ancient city but there is also a metro 15 minutes (walking) away.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“A very pleasant stay”", "Author": "smiliekiwi", "ReviewID": "UR115597662", "Content": "room smallish and no AC but that's the only negatives!! GREAT staff, and breakfast out side is a must!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Florence, Italy", "Title": "“We loved every second of this stay”", "Author": "kwalking13", "ReviewID": "UR115016909", "Content": "We found it initially really difficult to find the hotel but once we got there, the staff was nice enough to provide refreshments and sit and go through the city maps with us. Marius was especially amazing and made sure that everyone had a great time and really went out of his way to make sure that we had fun (can't gush enough). The breakfast was lovely every morning and it was only a short 10 minute walk to the metro san giovanni to catch the a line to any major site in Rome. The staff will walk you through the bus stops and sights to see initially so its really easy to get around. Will definitely recommend this place to anyone looking to have a great time and really get the vibe and feel of rome. My triple room was really clean (cleaned every day actually) and even in the middle of summer, it was fine without AC. My only suggestion is that many rooms are right next to the common siiting area outside so if you are looking for a quiet peaceful trip, it can sometimes get loud. But I would without a doubt return again.", "Date": "July 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lugano, Switzerland", "Title": "“Fantastic hotel off the beaten path”", "Author": "sinclairsolutions", "ReviewID": "UR101704006", "Content": "We had a blast at this hotel; the staff is awesome and everyone we met was really friendly. Our rooms were clean and well-kept, the TV had a ton of channels, and there was free Wi-Fi internet! A breakfast of fresh croissants and coffee/tea and orange juice was served every morning, free of charge. The only issue I had was that the hotel had an AmEx sticker on their wall, but when we tried to pay with AmEx, we were informed that they didn't accept credit cards at all. On the morning we checked out, we had to run to find an ATM so that we didn't miss our train. The staff was very apologetic about the whole affair, though. The hotel is pretty far from the typical tourist destinations in Rome, but we were able to walk to the Colosseum in around half an hour, and there are a few metro stations within a 15 minute walk to get to some of the further sites. The neighborhood around Hotel Lodi is adorable and residential, it didn't feel unsafe in the slightest, and there's lots to do and see very close to the hotel. In one direction, the hotel staff told us about a fantastic restaurant about a minute away. In the other, down Via La Spezia, there were shops and grocery stores, a Chinese food restaurant, and lots of pastry shops, pizzerias and cafes. We explored a lot of the area around the Rei di Roma station; there's an adorable little park surrounded on all sides by shops and cafes. Awesome location, awesome staff, great hotel. I'd definitely return!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "wigan", "Title": "“fantastic”", "Author": "juliehayes", "ReviewID": "UR99910367", "Content": "lovely hotel, friendly staff who cant do enough for you, about a ten minute walk to station, although bus stop is just round the corner if your feeling lazy. would definatley stay here again.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dornbirn, Austria", "Title": "“Impressive Service”", "Author": "pscherzer", "ReviewID": "UR94730260", "Content": "My Stay there was fabolous! nice Rooms, nice Common Room, nice Terasse and Garden... the Service offered ba the Staff was amazing. when i arrived i had to wait a little cause there were 2 more costumers. i was served espresso and could wwit outside in the garden with some very nice orange trees! everything worked perfect there. got a nice room and many recommandations from the staff cause Rome is to big to see everything in 2 days.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cairns", "Title": "“Very friendly staff - a home away from home”", "Author": "06thomar", "ReviewID": "UR93696207", "Content": "A very enjoyable stay - super friendly staff, free internet, and free delicious breakfast in the morning! We met many other backpackers in the dining room, and the place had a garden that would be very nice in the warmer months.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "bergamo", "Title": "“Good price for Rome”", "Author": "licahil", "ReviewID": "UR86531526", "Content": "Decent hotel if you don’t want to spend too much on accommodation and be in the Rome center.Te rooms are of course very basic but clean it’s a little bit noisy but so were in others hotels in center of Rome.The staff is very friendly and accommodating and also they serve a breakfast. I would stay here again.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London", "Title": "“Friendly and well informed staff”", "Author": "javed00", "ReviewID": "UR85859788", "Content": "Staff are freindly ,knowledgeable and provide good information about how to tour rome. The reception is well stocked with maps and guides to Rome. The rooms are Ok with the ones towards the front noisy with traffic and early morning refuse collection. We stayed there 5 nights in one triple bed and one double bedroom and the bedsheets were only changed once. The basin had luke warm water and in one room the shower hot water wasn't working properly. The air vents in the bathroom weren't working and none of the issues were rectified upto the time we left. There is a out door market near by with a supermaket which sells reasonably priced goods. The hotel is about a 1.4 km from the metro and the nearer ones shown on google are still being constructed. There is no off road parking and finding space to park is difficult.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Can't recommend highly enough! Book immediately!”", "Author": "BMD3", "ReviewID": "UR84547760", "Content": "From start to finish, the quality of service provided by Hotel Lodi Roma was second to none. A seasoned traveller, I have stayed in several establishments but none have offered such an excellent level of customer care. Prior to arriving we received e-mail clearly outlining how to find the hotel and on arrival, we were greeted with coffee and croissants - a very welcome touch as we arrived into Rome very early in the morning! Cristiano took the time to go through a map of Rome, pointing out highlights and explaining the city's transport system. Throughout our stay nothing was too much trouble for any of the hotel's staff. A bottle opener and glasses arrived as if by magic and the delightful breakfast was served with a smile in the pretty garden attached to the hotel. The free internet access was very useful and the staff willingly printed out our vouchers for the Vatican despite it being half two in the morning! A perfect location set just outside the busy city centre, it's a real opportunity to live as the locals do and transport into Rome is easy and very accessible. I really can't recommend this hotel highly enough!", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Good basic accommodation, but noisy”", "Author": "markoboston", "ReviewID": "UR81097842", "Content": "This hotel offers relatively low rates in overpriced Rome, but it has some significant downsides. Here are the pluses: It is relatively affordable. The rooms are reasonably clean and comfortable, if small and quite Spartan. But you don't come to Rome to spend time in your room. The staff are extremely friendly and helpful. The hotel offers nice Italian breakfasts and internet access (not wifi, but actual computers, so you don't need a laptop.) Now for the negatives: The hotel faces a rather noisy street. The rooms don't have air conditioning, so if you don't want to dissolve in a pool of sweat on summer nights, you need to keep your window open. The street appears to be a side street on the map, but it is apparently part of a secret Roman shortcut between neighbhorhoods because it carries frequent traffic, including a lot of loud motorcycles and Vespas, well into the early morning hours. You have about a three-hour respite, and then the garbage truck arrives, followed by morning rush hour traffic. According to management, all double rooms face the street, so if you are traveling with a partner during the warmer months and are not used to loud street noise at night, this would not be the best place to get much sleep. Also, the hotel is a bit out of the way. It is a good 15-20 minute walk to the nearest Metro station, though there are a couple of convenient bus lines closer by. But almost none of the main sites are walkable. The silver lining to this is that you will experience a real Roman neighborhood that is not overrun by tourists. But be prepared for a hike to central Rome.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“An absolute pleasure”", "Author": "carloalberto1982", "ReviewID": "UR70353702", "Content": "Great location, decent rooms, and most importantly, excellent staff. Extremely friendly and helpful!", "Date": "July 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sankt Petersburg", "Title": "“Extremely nice staff”", "Author": "wahrheitssucher", "ReviewID": "UR67889892", "Content": "Stayed here just for 2 nights, which is too short for discovering Rome. The staff was extremely helpful in directing me around the city so I could plan my time efficiently. The location is very pleasant - quiet residencial neighberhood. Convenient public transportation to center and within walking distance. The breakfast of 2 croissants, glass of juice and cup of coffee was pretty good. The Internet access in lobby is free.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Eindhoven, The Netherlands", "Title": "“Nice and pleasant, the way it should be and more than that”", "Author": "franssuijkerbuijk", "ReviewID": "UR65365574", "Content": "The best things in life you cannot buy, they are free but seldomly met. The gentle people of Lodi Hotel make the difference between a positive experience and something which you will remember for the rest of your life. We cannot think of our stay in Lodi without getting a nostalgic smile on our face and soft eyes reflecting how pleasant a holiday can be.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "worthing", "Title": "“This place oozes warmth”", "Author": "WorthingChelley", "ReviewID": "UR65046066", "Content": "9 of us booked a trip to Rome for my 40th birthday. We are a mixture of ages, from 10 to 68, on a very limited budget, and the Hotel Lodi fit the bill of being cheap but near the centre of Rome. The hotel is about a 10 minute walk to San Giovani station which takes you only 3 stops to the central Termini station. We even walked one day to the Colleseum, with 2 senior citizens and we made it in about 30 minutes. The Hotel staff are what really make this hotel a winner. They are warm, freindly, helpful and thoughtful. for example, realising we would not have had a chance to organise a cake for my birthday, they brought one for me...and candles, to take to the restaurant. And it was a handmade delicious cake from a bakers, not from the supermarket. The hotel is part hostel, and I think this gives it a relaxed feeling. They had no issues with us making our own hot drinks in the kitchen, or using the lovely internet room to eat a chinese take away. The rooms are not 4 star but they are not bad. We did not have a private toilet as we thought, just a bidet, but that has its advantages when you are in a couple..lol. The beds are really really comfy, and they are spotlessly clean. My only gripe would be the noise of traffic if you have a double room at the front, but with some earplugs, or in our case tissue in the ears, we slept through it in the end. The back rooms, the quadruple and the triple, had no noise issues. This hotel is cheap, clean, friendly and in a great location. There is a handy spar a few minutes walk away from which we bought several lovely pack lunches, takeaway pizzas, handly little bakers, ice cream shops and restaurants nearby. Because these are not in the centre of Rome, they are more reasonably priced. I highly recommend the Hotel Lodi. It has a lovely garden where you can sit and have tea, and as I said before, the staff are wonderful! As for Rome, or Roma as I like to call it now...well it is better than I ever imagined. A spectacular city which I will come back to again. This was a 40th birthday to remember!!!", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cluj-Napoca", "Title": "“Worth it”", "Author": "Ionut_M", "ReviewID": "UR59162919", "Content": "Awesome garden, great staff, good beds, good location, lousy windows.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belgium", "Title": "“Cheap, friendly, welcoming, nice people,...”", "Author": "LauWra065", "ReviewID": "UR55188490", "Content": "A very nice cosy hotel, very good service. You get lots of information about Rome and how you will get anywhere. They are always ready to solve your questions A lovely garden At night a wonderfull atmosphere, you feel very welcoming I really would recommend it Very good for young travellers", "Date": "February 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Edmonton", "Title": "“I wouldn't bother staying anywhere else”", "Author": "danlenz", "ReviewID": "UR51914814", "Content": "By far the friendliness hostel I stayed in, helpful beyond my expectations.", "Date": "December 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "'Straya", "Title": "“Friendly, easy, cheap, clean and fun. Go to Lodi.”", "Author": "splayt", "ReviewID": "UR51893789", "Content": "Rocking up at Lodi is like coming home to everything you wish your family was. There's your mum, Antonelle, to get you a hot drink as soon as you walk in the frosted glass door, show you to your rooms and offer you advice on what to do and what not to do in Rome - but just as happy to sit back and let you go if you'd rather go your own way and have your own kind of fun. There's your cool cousins, professional but friendly, ready to come sit down for a quiet one the common area when it's 2 in the morning and nobody's checking in. And of course there's the other travellers, your brothers and sisters, there to cook with you, go to dinner, have a drink or a smoke out the back or just sit around and chat. On arrival, one of the staff will go through a map of Roma with you, show you the best way to get to where you want to go, point out the landmarks and suggest the best time and way to get there given your itinerary and budget. Everything at Lodi is clean, from the kitchen to the bunks, and the included breakfast is simple but definitely sufficient. If you're after a hard drinking, screaming party hostel Lodi may not be for you - but for a few quiet drinks with some good people, a comfortable bed and a good kitchen, free internet access and great staff and a great base to explore Rome, there's no place like Lodi.", "Date": "December 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Amazing people and great garden”", "Author": "toragunath", "ReviewID": "UR50510742", "Content": "a really nice place to stay!!! and the staff are amazing and wonderfully friendly. they make you feel at home. and it is very accessible to major parts of rome. a home in rome :)", "Date": "December 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Frankfurt", "Title": "“best backyard barbecue”", "Author": "kyr82", "ReviewID": "UR50414690", "Content": "perfetto!! great backyard ideal for easy afternoons, clean with friendly southern mood.", "Date": "December 1, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Fabulous!”", "Author": "CorinneL4", "ReviewID": "UR49515557", "Content": "We met up with friends and we all stayed herewith kids ranging 6 to 13. The rooms were comfortable with clean renovated bathrooms. The windows lookedout over Rome and we watched a manificent thunder storm on our firstevening. There is a back garden where we spent time every day have coffee or drinks and wine - planning or retelling our day. Bus and train take you quickly into the cities many sights. The staff are helpful and friendly. Small shared kitchen was helpful for keeping things cold and preparing snacks. A lot of young travellers/backpackers stay here as well. Nearby to delis, coffee, local restaurants, try La Villetta but book ahead or get ther eearly it is very popular wit the locals. Definately would go back!", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "brisbane", "Title": "“more of a hostel than a hotel”", "Author": "tandjadventures", "ReviewID": "UR48391106", "Content": "the staff are excellent in terms of friendliness, knowledge & service. the location is ok however if you are looking for something central where you can walk to all the major attractions then this is not the place. it is very clean, very basic and wonderful for the budget traveller.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“If you visit Rome, stay at Lodi for hospitality and comfort”", "Author": "SAGail", "ReviewID": "UR47406161", "Content": "My stay at the Lodi Hotel (also called the Hotello di Roma) was for 2 nights. The staff is INCREDIBLE! They advise on everything you need to know from 'have to see' places to restaurants and how to get to them. They help with any problem you may have and make you feel completely comfortable. The hotel is comfortable and clean. It is in a quiet area and is very secure. It is a little out of the hustle and bustle of the city, but public transportation is close and easily accessed. The breakfast at the Lodi is simple and delicious. The staff serve it in a delightful garden. I was there for 1 night with my disabled daughter (who was very happy there) and a friend and 1 night just with the friend. The Lodi accomodated this change in accomodation with no fuss, making it as easy for me as possible. I would HIGHLY recommend this hotel.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Seattle", "Title": "“Stay here!”", "Author": "WanderingTanguera", "ReviewID": "UR46983405", "Content": "My friend and I arrived here slightly frazzled with our backpacks and other luggage. The staff took one look at our sweaty faces and immediately brought water to help us cool off. Then they showed us to our room and told us to come check in once we'd had a chance to relax and cool off. Then they showed us how to see Rome without getting lost or stressed out (it worked!). What a welcome! The beds are nice and breakfast is wonderful, but it's the care and friendliness by the staff here that made our stay here wonderful. They even let us hang out in the hostel for an evening (and well into the morning) after we checked out because we had a 6am flight to catch and had no where to go. They were very helpful in helping us get to the airport at that hour as well. The hotel is a bit out of the way, but in a way it's nice to get out of really touristy areas and see a slice of how the Romans really live. I highly recommend Hotel Lodi!", "Date": "October 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Italy", "Title": "“Charming Hotel”", "Author": "billy-it", "ReviewID": "UR45865892", "Content": "This charming hotel made my trip to Rome wonderful. The staff is beyound helpful and make you feel welcome. The day we arrived it was hot in Rome and when i showed up they brought out some ice water and let me cool off. The hotel has been booked on bookhotelsinRome.com. Really good value for your money!", "Date": "October 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Not the best location but it's safe and clean”", "Author": "sasandtim", "ReviewID": "UR45438303", "Content": "We spent three nights at Hotel Lodi in a 6 bed dorm and were fairly pleased with it... PROS: Clean Safe Kitchen onsite though the burner took a long time to heat up Wonderful breakfast including fresh croissants and proper coffees (yum!) Free wi-fi and computers with internet CONS: Location is a bit out of town though it's accessible by bus/metro Our room was near the reception and our window opened to the garden so we could hear a lot of noise (though we could close the window and use the fan which helped) There was only 1 bathroom was on our floor which meant that we had a to wait a couple of times (though we didn't have to wait too long). We had a problem there with lack or information/misinformation from some of the staff but the owner was very forthcoming in sorting it out for us...", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“The warmest welcome”", "Author": "MrsHSY", "ReviewID": "UR37054350", "Content": "By far the warmest welcome we have ever encountered from a hotel. From start to finish the staff gave a perfect lesson in how to make guests feel at home on holiday. Their advice on where to go/ what to do ensured that first timers to Rome, like ourselves got the most out of our city break. The hotel is good value for money - rooms are not plush (but are what you'd expect for the price) clean, beds comfortable. It's tucked away in a residential district but with access to good transport links. The highlight was the lovely garden (photos don't do it justice) where breakfast is served. To sit under the shade of a tree, sipping a latte and being served fresh croissants and cereal was a perfect start to the day.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Will definitely return!”", "Author": "LimaCBJ09", "ReviewID": "UR35120829", "Content": "This was by far the most pleasant hostel I have been too. All the staff is truly committed to helping you and doing whatever it takes to make you happy. Rooms are cleaned daily, bathrooms were nice, staff was great. The hostess greeted us and basically showed us the easiest and most efficient way to see the city in three days. I felt very safe here and I will definitely return. Not to mention a refreshing little breakfast every morning, and free usage of the computers. A++", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Best hotel/hostel I have EVER stayed in”", "Author": "Traveler90Canada", "ReviewID": "UR34405267", "Content": "I am a very experienced traveller, and found this hotel on the internet a month before i came. I sent in a reservation and when I got there everything was already taken care of. We arrived very late (about 2am) and the man at the front desk was very nice and took the time to sit us down and show us a map of rome, and where the closest bus stations and metros were. The hotel is only a 20-30 minute walk to the colleseum, and if you are a big walker (we were!) you could walk the Colleseum, Trevi Fountatin and spanish steps all in one day. If walking isnt your idea of a great day, there are busses that take you directly to the Colleseum, and from there you can take a metro around the whole city. Since it is not directly in the center of the city, it is fairly queit and the garden is a very nice place to relax after a busy day. The hotel also had amazing breakfasts which was already included in the cost of the room (croissants & bread with jam and butter, cereal, Hot chocolate, Cappucino, juice), and had clean rooms. If i ever visit rome again this is where ill be staying, and i would highly recommend it to anyone visiting rome.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tempe, Arizona", "Title": "“The best place I stayed in Europe”", "Author": "Ligeia_ppgl", "ReviewID": "UR34183707", "Content": "I have no words to describe how nice this place and the people running are. The place was super cozy and nice. Of course clean and in a good location. Very nice breakfast, and the best atmosphere. But the best is the people who runs it. They made us feel part of their family as well. Gave us the best tips, helps us with our travel, and were always on top of things. I truly hope one day I get to go back, and visit them again. I have the best memories of this place.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bury, Manchester, England", "Title": "“Treated Like Family”", "Author": "goldterry", "ReviewID": "UR33397125", "Content": "I arrived as a back packer expecting a bunk in a six bedded room to use as base for my tour of Rome, When I arrived Fabio the manager greeted me with a glass of iced water booked me in then sat me down with a map of Rome and explained the best way to tour the city in the 3 days I was there, The session was so helpful then I was shown around the hostel. There is a lovely Garden area at the back of the property where I had breakfast and chilled with other travellers to the early hours exchanging tales and meeting new people. Marios would somtimes sit with us of an evening and was marvelous company with many tales of his experience of life. The room was clean an comfortable, The bathroom was was of a good standard and was always clean, The kitchen was again clean and was available for sandwiches and microwave cooking, Italian breakfast was included in the price, Coffee, Orange Juice and a Croissant I could get use to that and enjoyed it. The ladies Mirella, Antonella were just as helpful and the local Restaurant I was reccomended was excellent, Two computers were available for free internet access There was vending machine for water and other soft drinks just what you need I was made to feel at home by everyone and felt like a member of the family. I had a wonderful stay in Rome but Fabio, Antonella, Marios and Mirella made it special I highly reccomend this hostel. The accomodation is maybe 7-10 mins walk from San Giovani Metro station. But you can get an 81 bus to the station at the top of the street.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "california", "Title": "“Quiet hotel where the staff makes you feel like family.”", "Author": "charlesinca", "ReviewID": "UR32763071", "Content": "This charming hotel and hostel made my trip to rome wonderful The staff is beyound helpful and make you feel welcome. The day i arrived it was very hot in rome and when i showed up they brought out some ice water and let me cool off before showing me around. Every morning they serve breakfast in the garden which is really pretty. Since it is just outside the center of rome i had birds waking me up instead of vespas. The Line A metro is walking distance and buses to the major tourist sites are about a block away. The brother and sister that own it are not only super nice but a wealth of knowledge. There is a common room with 2 computers that are connected to the internet which are free for everyone staying. If you have a laptop or iphone there is wireless to use also. There are many resturants and, bars and shops near by as well as a market down the street. Other then graffitti (which is everywhere in the city) it is a very charming neighborhood. I felt safe walking home from the metro after dark. The people i met at the hotel where all very nice. My experience was very pleasant. The next time i come to rome i will be staying at hotel lodi.", "Date": "June 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "United Kingdom", "Title": "“Like staying with family..”", "Author": "BackPackHoneyMoon", "ReviewID": "UR32301442", "Content": "My husband and I left Hotel Lodi feeling like we were leaving our family. From the moment we arrived, and the lovely Antonella sat us down, told us where we should go, what we should see, how we should get there, we felt right at home. Every morning we had breakfast brought to us by the gorgeous Mariella in the beautiful garden out the back. The second day Fabrizio, Mariella and the other staff were having pasta and invited us to have some, sending us away into the garden with a glass of wine and bread to go with it. The free internet was a real god send and nothing is too much trouble from the staff. When we return (and we will return) it will probably in the cooler months as the weather was quite hot, and having the window open to the noisy street was not conducive to sleep. The location is great, with plenty of buses near by. We found the buses somewhat unreliable though (it's Italy!) and mostly took the metro which is about a 15 minute walk away. If you're the sort of person who prefers genuine warmth and friendship over hilton-esque decor, stay here. You'll love it, they'll love you, it will be grand!", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Finland", "Title": "“Nice hotel with a lovely garden”", "Author": "ThumbelinaFinland", "ReviewID": "UR32189805", "Content": "Basic 2 star hotel.Room was ok,not too clean with dust and hair on the bathroom floor..Bed was vey comfortable.Lovely garden where you can enjoy your breakfast.Our window was towards the garden so we could hear all the talking and laughing from there.One night we woke up because of the noise but otherwise it was quiet and peaceful. We were told that it takes 6-7 minutes to walk to the nearest metro station and it is 900m far away.Well,for us it took almost 20 min to get there,and it really felt more than 900m...But there is a bus 81 you can take from the hotel area to metro station,so it's not that bad. The staff is very friendly.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“All in all, we had a very good exeperience at Hotel Lodi.”", "Author": "MikeandHeidi392", "ReviewID": "UR31840430", "Content": "Our family of four stayed at Hotel Lodi for four nights this past May. I originally chose this hotel because of the good reviews it received on Trip Advisor, and because it was less expensive than other hotels I considered. I realized it was a little further away from the center of Rome than most other hotels, but I did not think I would mind that (and I didn’t), and also the cost savings seemed to justify it. I must confess that our first impression of the hotel/hostel was not favorable, but as time passed, we grew to appreciate and enjoy Hotel Lodi, its staff, and the neighborhood. First, the week we stayed in Rome, it was unusually hot. We arrived at Termini at midmorning, took the metro to the San Giovanni station, exited the station, and then attempted to walk to the hotel by using the directions from the website which said to follow Via La Spezia from the station to the hotel. The only problem is that construction on Via La Spezia at the station hides the street from view. After walking around lost for several minutes, we finally found our way to Hotel Lodi, but it took us 45 minutes to make what should be a 10 to 15 minute trip. Also, the neighborhood is what I would describe as “working class” with graffiti painted everywhere (And I mean everywhere. We came to find out that this is very common all over Rome and to us, a real shame.) When we finally arrived at the hotel, hot and tired from our trip, and not overly impressed with the neighborhood, we discovered that the hotel was not air conditioned. In May, this would not normally be a concern, but again, it was unusually hot that week. Not a good start. We put our bags in our three-bed, four-person room with private bath and immediately headed out to see the city, this time catching the bus at the stop on La Spezia back to the metro station at San Giovanni. When we returned to the hotel later that evening, we had difficulty sleeping because we were not used to the street noise, which while not horrible, even the sound of one motorcycle every 10 minutes was enough to keep us awake (remember, no air conditioning, so the windows had to be left open). But, the sun rose in the morning, and a new day began. We had breakfast in the picturesque little garden, and were served by a charming young lady. Breakfast consisted of juice, coffee, and a basket of croissants and white bread, with butter and jam. We began to get to know our two gracious hosts, Toni and Fabrizio. They could not have been nicer or more helpful during our stay. They really made an effort to ensure their guests were taken care of. Toni recommended a restaurant, La Viletta, right around the corner from the hotel for dinner. La Viletta turned out to be one of our favorite restaurants during our two week vacation in Italy (we ate there twice). In fact, we agreed that it was probably our most authentic Italian dining experience. Back to the hotel…our room was clean, and two computers with free internet service were available to the guests as was a refrigerator in the kitchen. We also grew to like the neighborhood. One morning we strolled from the hotel to a clothing street market (our best shopping experience in Italy) that Toni recommended. The market was located across from the metro station at San Giovanni. Along the way, we visited a neighborhood food market located on a side street from La Spezzia. Very Italian. Also, I think one of the good things about staying away from the center of Rome is that you get to experience how normal Romans live, and you also are not subject to all of the thieves and pick-pocketers that frequent the busy tourist areas of the city. So, all in all we had a very good experience at Hotel Lodi. The only reason that might cause us to not return, at least in the summer time, is the lack of air conditioning. But, if that is not important to you, I would think you would thoroughly enjoy Hotel Lodi and its wonderful staff.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Poland", "Title": "“sleep zen wake up a touirst - great place to chill after day of sightseeing”", "Author": "pjupju", "ReviewID": "UR30944751", "Content": "1) it is not and in a center and it is a great PLUS! First of all that all in all you have to buy Roma Pass you will not be able to see everything on foot, and living in a termini district is pretty dangerous(!) full of thieves and muggers. If you want to sleep safe choose this hostel 2) you have tasty breakfast (sweet in French style) included 3) there is a charming atmosphere, you can sit in the garden and talk, socialize with other travelers 4) stuff is nice and easy-going, always ready to help you and arrange interesting trips 5) you have internet access, for all Facebook victims 6) it is CLEAN! What is very important, beds are made every day and you get fresh towels 7) there is a brilliant restaurant in the neighborhood called Risorante La Viletta, where locals do used to eat, for 30-40 EUR you have great dinner for two people 8) Peacefully - it is not a hostel for hardcore party lover 9) book - go - enjoy!", "Date": "May 27, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Poole, UK", "Title": "“Clean, welcoming, friendly, quality breakfast, good value for money”", "Author": "AstrogastroPoole_UK", "ReviewID": "UR30597089", "Content": "If you are looking for a cheap, quality, clean hotel in Rome look no further than the Lodi. Don't be put off if you think that it's a hostel, although it does accomodate travellers, it is suitable for couples and families looking for quality budget accommodation too. The staff are so friendly and VERY helpful, taking into consideration your time in Rome and helping you plan how to get the most out of your trip, if you wish. The breakfast is excellent and served in the beautiful garden. Bread baked that day, a selection of jams and spreads plus, juice, mega fresh croissants and delicous latte coffee (or cappucino), just right to set you up for the day. The hotel is not in the city center but it is easily accessed by the train network. The nearest station is about ten minutes walk away. When we stayed last week, it was a bit difficult to find due to the ongoing building works near the station, so I would recommend that you take a map, however once you have done the journey once, it is very easy to get your whereabouts. 3 day train/bus tickets are available from nearby Tobacconists or the station at a bargain €11. The hotel is situated in a very nice area and it is safe. We found a very cool bar where you can have a drink on the terrace and a truly Italian bite to eat. It is called Goodfellows but is only signed in Italian (Quei Bravi Ragazzi), It is next to a chinese restaurant and opposite a park just around the corner from the Lodi. It is full of locals and the staff are great (even though we spoke pathetic Italian!!). Beppe and the owner Davide made us feel very welcome. They serve little snacks free of charge along with drinks (cool!). As the bar is located in a local neighbourhood, it is excellent vaue for money!!. I would recommend the Hotel Lodi to anyone travelling to Rome, try and get the same quality of accommodation and friendly staff for the same price in London!!!!.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Norwich", "Title": "“One of the best places I have stayed during my travels around Europe”", "Author": "TravellingMarvin", "ReviewID": "UR29700489", "Content": "After a long day getting to Rome, the welcome and vibe at the hotel/hostel was fantastic... Fantastic staff with excellent local knowledge that will allow you to see and do as much or as little as you want in Roma. After a day or so, you really feel part of the family. Most of the time a hostel is place to crash on your travells, but this is one of those rare gems that stands out and makes you want to travel back - just to stay there.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Manchester", "Title": "“Hotel Lodi - A disguse behind the smile - NOT WHAT IT SEEMS NO GO”", "Author": "Olivier22", "ReviewID": "UR28967306", "Content": "We stayed at Hotel Lodi just after the easter period when we got there we were straight away given a warm welcome, and dont get me wrong the service and also the helpfulness of one member of staff was great, however when you go to a hotel it's not the person at the desk you want to be best. We were put in a room, which looked dated, old and dirty, the worst thing was that the bathroom was a joke there was an open shower which when you turned on covered the whole of the bathroom with water, so you couldn't go back in, it still had dried out by morning. So the next morning we decided we'd leave but when we got to the desk the guy basically blackmailed us he said either i changed your room or you pay £350 to leave basically, he also said yes i know we gave you the terrible room and it wasn't good but we have to let all our rooms! So we went to the new refurbished room, that wasn't refurbished and still didn't look like the internet photo. However the shower was better. On a more serious note Hotel Lodi is a fire hazard as there are no doors on the stairs and there are no emergency exits, this means that the stairs going up the miidle act as a chimey. The fire exstinguster was hidden behind a curtain and the doors would last 5 minutes in a fire and were not secure in case of a break in, the hotel was shambles and is very far out you have to get a bus and a metro!!! ridculous, do not go here or you'll have a nightmare, it is a disguse covered up by the staff's smiles and helpfulness.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, BC, Canada", "Title": "“Best value for the money”", "Author": "bonaek", "ReviewID": "UR28440516", "Content": "The Hotel is close to several bus lines, yet in a quiet neighbourhood. The 4 bed private room was simple, spacious and very clean. The staff is helpful and friendly, Fabrizio is the best host. He speaks a few languages. We loved our breakfast in the garden. We will come back again.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Toulouse, France", "Title": "“Average Hostel with nice garden”", "Author": "CafePop", "ReviewID": "UR28372386", "Content": "The Lodi Roma is an average hostel for people who want to spend just a few days in Rome. The rooms are average and for a hostel OK. The sanitary facilities are satisfying. The hostel is a bit far away from the center. But if you catch Bus Line 81 you'll get in 30 minutes to the Vatican. So it's not that bad. For going to Roma Termini you'll take bus 105 (5 minutes). Apart of this, the taxis fares are comparably low in Rome. The Lodi has a gorgeous garden where you can take a nice breakfast with an incredible good capuccino (for free). Internet is free, too.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "New Zealand", "Title": "“Pretty good, but more of a hostel than a hotel”", "Author": "OptomAbroad", "ReviewID": "UR28328248", "Content": "The Hotel Lodi has great staff, they go out of their way to help you to see Rome. The Hotel itself is cross between a hostel and a Hotel. Our room had a full ensuite, but not all the rooms do. It's about a 15 min walk to the Metro station, but only a couple of minutes to several bus stops incuding 105 to the central train station. It was reasonably quiet at night when we were there, and is in a residential area. There is a small supermarket nearby but I'd recommend this place to any travellers who are looking for a quiet-ish place on the edge of the central area of Rome and something better than a hostel.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“very family friendly”", "Author": "cloudsLondon", "ReviewID": "UR27684184", "Content": "we stayed - 2 adults and 3 children (aged 10, 8 and 5) in the quad room very comfortably. Youngest child was free. Room was very clean and everything worked. Very little nighttime noise. Staff are just as Trip advisor says - warm and welcoming and full of good local advice. We had 2 excellent family meals within 5 minutes walking - 50 euro for the family this is perfect, no frills B&B garden was a bonus (with recycling facility) war", "Date": "April 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Osan, South Korea", "Title": "“A pleasant suprise!”", "Author": "JML0810", "ReviewID": "UR27631633", "Content": "This was a great hotel in pricey Rome. Many hotels in Rome are very exspensive and if they are not exspensive there is usually a bad reason as to why. I would wonderfully suprised by my stay at Hotel Lodi. It was great, great breakfast, room and service! I would recommend this hotel to a friend and will be bringing my family back here again this fall!", "Date": "April 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Excellent value for money!”", "Author": "PinkPandaLondon", "ReviewID": "UR27193707", "Content": "No frills rooms made more comfortable by incredibly friendly staff, and a great garden too! Toni and Fabro are efficient, and can be relied upon for suggestions and advice on where to go and what to do. Would return, most certainly, when in need of another Roman escape (soon, I hope)!", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "glasgow", "Title": "“Thank you to the friendly staff, they made the stay worthwhile”", "Author": "masondx", "ReviewID": "UR26377588", "Content": "Friendly and helpful staff made us feel genuinely welcome. Lovely gardens out the back. Only gripe was we couldn't get the window closed so we got woken up early with the traffic. The service makes the place though.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bucuresti, Romania", "Title": "“a lot of value”", "Author": "panther2089", "ReviewID": "UR25682694", "Content": "Hotel Lodi it's a great place to stay while u visit rome. I stayed there only 3 days but I was impressed and I would return there anytime. The best of all it's the staff; it's very friendly and helpfull. They took care of us, gave us maps, instructions and all we needed. The hotel is clean has a very nice garden where u can make also a barbecue. With all of that at a very cheap price I think it has a lot of value and can't wait to be back.", "Date": "March 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "trondheim", "Title": "“Most service minded staff ever!”", "Author": "Atlepatle", "ReviewID": "UR23998136", "Content": "My girlfriend and i first had a booking another place, but that place was overbooked, so they sent us to hotel Lodi. After talking to the guy working there (Fabrizio) for a few minutes, i was convinced that this was a great place to stay. He told us everything we needed to know about where to go, how to get there and also he makes the best coffee! We were supposed to spend a romantic new years eve in rome, and we did, but not as planned, we were actually sleeping when we were supposed to kiss at the spanish steps, that must indicate quite well that the rooms there are quite comfortable. Theres a computer room there, with internet for thoose who dosent travel with their lap tops, and also wifi for those who does. Not only is Fabrizio a great guy, there were three other awesome persons there; Antoniella, Marius and this other girl, i think her name is Mirella or something. I have never before visited a place were the entire staff have been som kind, helpful and caretaking, and if (most likely when) im going back to rome, theres no doupt that Hotel Lodi is the place for me to stay. I loved the place, and i will always remember the great staff there!", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Amazing service!!”", "Author": "AnilChandra", "ReviewID": "UR23244886", "Content": "We stayed at Hotel Lodi for 2 nights, from new years eve '08 and we had an absolutely wonderful time. It's in a quiet neighbourhood a few mins away from central rome but conveniently accessible by public transport. Most of all, however, it was the people working there (Fabrizzio, Antonia and the guy doing nightshift... we unfortunately didn't get his name) that made our stay most memorable. It truly was a home away from home for us. We have travelled a lot around Europe, but our experience here has been unparalleled!", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "elsloo", "Title": "“Lodi Knows Their Job!”", "Author": "mozartElsloo", "ReviewID": "UR21145311", "Content": "Terrific familyhotel in an authentic building, excellent quality and good price. Hospitality and Information outstanding. Good connections with town centre (bus and metro). Good breakfast in hotel and neighborhood. Excellent: service, hygiene, quiet citygardens with fruit trees and pergola, internet and drinks and snacks. Fine rooms with good beds, tv and complete bathroom. Also bathroom on floor. Staff/owners of hotel know how to run their business, building up to good quality-standards for the last 8 years. Possibility for babybed. Next time no doubt: Holiday in Roma, staying in Lodi! One remark but not necessary for us: No wheelchairfacilities.", "Date": "October 23, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Karelian Vagabond", "Title": "“Hotel Lodi Rules!!!”", "Author": "KareliaVagabond", "ReviewID": "UR20386715", "Content": "One of the best hotels I've stayed in yet. The location is great. Easy to get to any place you want. The staff is fantastic. So friendly, helpful, kind, hospitable. I felt myself like home, safe and welcomed. I recommend anyone who wants to see Rome in a short time with good advise what to see and where to go stay down there.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Like homecoming”", "Author": "Indiana_u", "ReviewID": "UR19373900", "Content": "I had been too busy to plan for my three-day trip between August 10 and August 13, 2008 in Rome before taking off from my home country. That's why I was so anxious to catch up the travelling materials on my flight to Rome. Yet it turned out to be not much helpful....It's fortunate that I had reserved a bed in Hotel Lodi in which I could not only take refuge and recess, but thanks to the hospitality of everyone in Hotel Lodi, particularly Fabrizio, I also got a good hint in exploring all fascinations within the city in perfect timing...including taking a boat trip along Fiume Tevere, which was so much fun. Besides, I've made a lot of friends who were interesting people attracted by the easy atmosphere of Hotel Lodi from all around the world. I will definitely settle in the hotel again for my next visit in Rome.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "belgium", "Title": "“Molto bene”", "Author": "matten", "ReviewID": "UR19005101", "Content": "We (Debbie and Matthias) liked Albergo Lodi a lot. Nice garden and very friendly staff! Thanks Antonella, Fabrizio, Ali and the others!", "Date": "August 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Good location, price and unbeatable hospitallity!”", "Author": "Anna_von_M", "ReviewID": "UR18839703", "Content": "Having read the reviews about Hotel Lodi on tripadvisor, I decided to stay there during my visit to Rome at the beginning of August. Many people have already commented on excellent hospitality the manager and his staff are offering to their guests. I completely agree with those comments: nothing is too much trouble and their laid back but efficient attitude is very welcoming. The room I had was the one with shared facilities which was fine. The bed wasn't as comfortable as I had hoped for (foam mattress) but it was fine for 4 nights. If you get the room overlooking the road, bring your ear-plugs as it can be quite noisy at night (cars, motorbikes...). The road itself is not that busy but it can certaintly be very noisy. The garden is charming and I found it particularly nice to have my breakfasts there. One more thing: you can use internet free of charge for as long as you like - a big bonus when you are hiding away from the afternoon heat.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Istanbul", "Title": "“Hotel Lodi is the best in Rome!”", "Author": "lborges", "ReviewID": "UR18093626", "Content": "This hostel is the best one I've ever seen. The staff is so kind and funny. I had so many precious memories in that hostel. I had really great time. The whole staff helped me every time I need! I felt like at home! Rooms are very clean & safe. I left all my important documents (passport, credit cards, plane tickets etc.) at the room while sightseeing fantastic atmosphere of Rome. Bathrooms are clean , internet is free of charge! Also there's a kitchen and a garden. Location may not be the best but bus stop, supermarket and metro station are just 3-5 minutes walking away. It's the best in Rome. Hostels around Termini Station isn't safe enough, so many homelesses and dangerous people walking around Termini.. Also It's too noisy to sleep. There is no way to stay another hotel in Rome... Thanks to Hotel Lodi!", "Date": "July 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shreveport", "Title": "“Awesome hospitality”", "Author": "brei26", "ReviewID": "UR17374440", "Content": "The ratings i saw for the place were really good, but it still exceeded my expectations. My room was great, very clean, air conditioned, very comfortable, and had a good bathroom. The thing i liked the most is that it was extremely secure, i left my passport, credit card, and all my other important things in my room my entire stay and i never worried about it. Everyone who works there is extremely friendly and always trying to help u. Right when i got there they gave me a little something to eat and drink and sat me down with a map, explaining how to get around everywhere and the best places to see. My trip would not be nearly as good as it was without their advise and hospitality.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bristol", "Title": "“felt like home”", "Author": "minky733206", "ReviewID": "UR17061167", "Content": "the hotel lodi was fantastic. the staff couldnt have been more helpful. they couldnt do enough for you and nothing was too much trouble. one evening me and the group i was traveling with decided to have a bbq. we went to the shop to get provisions and by the time we had got back they had cut the grass for us, arranged the tables for extra space. cleaned and had lit the bbq for us. when you first arrive the give you a map and write on it directions and the easiest ways to get around, where the local bus stops are, this made getting around rome so easy and it was much appreciated. there is a lovely garden at the back of the hostel which is always busy with people from all around the world and the whole experience at hotel lodi was relaxing and just felt like a second home by the end of our stay. i recomend this hotel to anyone staing in rome, whether it is for 1 night or 1 week. the friendlyness of this staff, the clean hostel and short distance from the bus stops and metros made my stay an experience i will never forget and would not hesitate to stay there again.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Lucky we stayed at Lodi....”", "Author": "Vega28", "ReviewID": "UR16968892", "Content": "I can't say enough how Fabrizio and his staff surpassed our expectations when we first arrived at Hotel Lodi the first day in Rome. They were several of the friendliest and most pleasant people I have ever met at any time and place. It set a great first impression for me as it was my first time in Italy. Definitely recommend this place to stay for anyone visiting Rome. Fabrizio and his staff were always there for us, suggested how to plan an efficient day touring to maximize our timeframe, helped us with pretty much everything and even suggested wonderful restaurants to eat which we did and they were fantastic! Can't thank him enough.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Liverpool UK", "Title": "“Laid Back Hospitality.”", "Author": "jeremiahLiverpoolUK", "ReviewID": "UR15555134", "Content": "The Lodi is a 2 star hotel offering a 5 star service. Nothing is too much trouble for Ali and Fabrizio and the rest of the staff. Small means better as far as I'm concerned. No strict breakfast times. You get breakfast when you get up, not at a time to suit the hotel. Big bonus! 81 bus takes you to all of the Roman sites ( and sights) and terminates at St Peter's. No pretentious lobby, but a beautiful relaxing garden. You can also bring back a bottle of wine and food if you desire. If you want somewhere clean and secure at a decent price - look no further.", "Date": "May 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maine", "Title": "“Hotel Lodi if fantastic”", "Author": "Downeast_Traveler", "ReviewID": "UR15207085", "Content": "What a delightful stay we had at the Hotel Lodi in Rome! It is conveniently located on a major bus line or a short taxi ride away from the center of town. The building is a grand old one with high ceilings, stone floors, a quiet garden, glass doors--a delightful and cheery place to spend time. The rooms are in the process of being remodeled but are quite adequate, attractive and clean even pre-remodel. But the best part of your stay at the Hotel Lodi will be the attention paid to you by the staff. The Manager, Fabrizio Gregori is gracious, efficient and friendly and so are his staff. At check-in we were given a folder containing a voucher we had had faxed to the hotel in advance, a local map, bus directions, a printed out email from a friend with meeting times, arrangements for parking our rental car--everything we needed. And, the computers in the breakfast room with internet access were new and quick. Treat yourself to a stay at Hotel Lodi. It is not only an excellent value for money hotel. It is a quiet treasure in the heart of Rome. We would go back in a heartbeat.", "Date": "April 21, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Berlin", "Title": "“amazing hotel with a private atmosphere!”", "Author": "jela23", "ReviewID": "UR14360053", "Content": "we payed a little and got the most! the best place to be in rome! staff is just awesome and really doing everything to make a stay as most enjoyable as possible! we will come back, for sure! thanxxx for everything fabre!!! the three germans... :-)", "Date": "March 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Towson, Maryland", "Title": "“Reeked of smoke!”", "Author": "Leonje", "ReviewID": "UR14064922", "Content": "Maybe things have changed since I stayed at Hotel Lodi, but my boyfriend and I did not enjoy our stay at all. The staff was accomodating, but that hardly made up for the many faults with the hotel itself. Our room so reeked of cigarette smoke that after only one night in the room, the clothes in my luggage smelled too. The window would not close. Perhaps in the summer this would not be a big deal, but in the middle of January, we froze all night long. There were hairs in the sheets. For some odd reason, our bathroom had a sink and a shower, but no toilet. Perhaps if I had stayed in one of the 10€ hostel rooms, all of this would have been acceptable. However, having paid considerably more for an ensuite double, it was inexcusable.", "Date": "March 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Great stay”", "Author": "RaRa-Fox", "ReviewID": "UR13225720", "Content": "As I had to go to Rome for a few days for administration purposes, I searched the internet for a recommended place to stay and came upon Hotel Lodi. The hotel was easy to locate and from the moment I arrived, the staff were ready to answer all my questions and made me feel very welcome. I would highly recommend this hotel to any Roman visitors. The price of a bed for the quality of service is absolutely fantastic - and an otherwise uninteresting stay, was made really rather enjoyable thanks to a great stay at Hotel Lodi!", "Date": "February 3, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "elcamino20", "Title": "“The Real Rome”", "Author": "elcamino20", "ReviewID": "UR12886287", "Content": "Rome can be a daunting travel destination as a lone outsider. Having the staff as a resource at the Hotel Lodi was invaluable to me as a woman travelling alone in an unfamiliar city. I immediately relaxed when I walked in the door and was greeted with an offer of grapefruit juice from the backyard tree. My room (a shared dorm) was clean, comfortable and fresh, and there was a large (clean!!) bathroom. I also appreciated the closet-like lockers available for free use (hard to find such spacious storage in any hostel). Another plus was the free internet provided for guest use in the relaxing lobby, attached to a garden, which was the perfect place to mix and mingle with other guests. Not only were the facilities excellent, the staff was also an amazing, friendly resource for me. I was welcomed with smiles and kind words, something that I had felt lacking in other parts of Rome. They take care to ensure that all guests are safe, happy, and comfortable, and are also extremely conversational and friendly. Overall, I thoroughly enjoyed Rome, and this was only because I chose the perfect place to stay. Thank you those at Hotel Lodi for your kindness, I will never forget you! Sophie T. USA", "Date": "January 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“A fab experience”", "Author": "CamilleDublin", "ReviewID": "UR12638742", "Content": "I have to say thank you to the Hotel Lodi for helping to make my 2 night stay at the hotel so enjoyable. A big thanks to Ali for making me feel very welcome when I arrived. Before I arrived at the hotel, Ali sent me a detailed email explaining how to get from the train station to the hotel even marking out which stop I should get off at. Upon my arrival, Ali gave me a good explanation about the city of Rome and also told me which buses, metro, etc., I should take. Even in the morning, he was still very kind. I also appreciated Ali making me a “LOVELY” cup of tea on the Friday night and for suggesting that I leave my luggage in the reception area on the Saturday when I was leaving. As it was raining for most of the day, I was truly grateful. Ali has a very kind personality; nothing seems to be too much trouble for him. My room was very cosy and was fine for me although the traffic noise did disturb my sleep a little but all in all for the price I paid, it was super value for money. It is a bit outside of Rome but it's only about 10-15 minutes on the bus which stops at the Colesseum and also by the Via del Corso (the main shopping thoroghfare of Rome) - near the Trevi Fountain. The free use of the internet was lovely and I enjoyed meeting the young people in the meeting room and hearing about their travels around Europe. Breakfast was included; if a bit of cereal could be added to it, that would be great for me otherwise it was really nice. I would also like to thank Fabrizio for fixing my TV and for also leaving me some beautiful flowers in my room. As I explained to Ali, I did think of taking the flowers with me on the flight to remind me of the hotel but I was worried that they might get spoilt so I thought that it might be nice to leave them for the next resident to enjoy. After Ali paying me such a wonderful compliment about my age and personality, I will just have to return to the hotel. I walked around Rome with a big smile on my face all day. Ali, you are a real credit to your country and to your own family. I hope your studies go well. Fabrizio and Ali deserve the hotel/hostel to succeed because they are making such an effort to make things go well for all of your clientele. If you stay at Hotel Lodi, you have to appreciate that there will also be backpackers staying there also so please be aware of that fact. It didn't bother me because I enjoyed chatting to them. Also, thanks very much to Mariella for the breakfast and for cleaning my room so well. All that remains for me is to say “farewell” for now and hope to see you all in the near future.", "Date": "January 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "denver,colorado", "Title": "“Great Staff!!!”", "Author": "fhnkeeper03", "ReviewID": "UR11919727", "Content": "I stayed at Hotel Lodi for 6 days and it was a great 6 days. The staff was amazing. Ali and Fabrizzo were the nicest and most helpful people I met on my trip. Next time I am in Rome, you can bet that im staying at Hotel Lodi!!!", "Date": "December 23, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kent", "Title": "“Hotel Lodi”", "Author": "01bienias", "ReviewID": "UR10823178", "Content": "Hotel Lodi far exceeded my expectations. The welcome we recieved including a quick overview of rome and the things one can expect to do was so helpful and greatly appreciated. The room was lovely and there was a phone, tv and en suite bathroom and each room was cleaned every day. Breakfast was croissant and bread with jam etc and was such good value. The area the hotel is in is very good, close to a metro station but a little out of the centre so you can escape the hustle and bustle. The staff there were absolutely great, so helpful and welcoming so that I felt at home and was really sad to leave them! I would recommend this hotel to anyone who wants to explore rome and feel confortable and at home. I really loved my stay!", "Date": "November 14, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "California", "Title": "“Wonderful Staff!”", "Author": "Emmils", "ReviewID": "UR10076832", "Content": "The best thing about Hotel Lodi, as we experienced it, was its friendly and hardworking staff. The place is kept clean, it is close to public transportation and is the perfect place to come back to after spending all day touring Rome. But what really makes this place special is how devoted the staff is to making their guests feel at home. This was reflected to us our first night when we were invited to dinner by other guests just after our arrival. The next morning, as we sat out in the back garden, the staff laid out a map before us, as well as two cappuccini, and explained in detail how we could best see the major sites (as Rome can be quite overwhelming). We stayed in the hostel at the Hotel Lodi and found that the kitchen there had everything we needed. The whole place is quite homey (again we emphasize the staff's role in making it so), but seeing as the only lounging area is in the outside garden we don't recommend staying there all day long. (But because there's so much to do in Rome, we didn't find this a problem whatsoever.) We hope you enjoy your stay as much as we did!", "Date": "October 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Marabella,Trinidad", "Title": "“Loved the hotel Lodi”", "Author": "trinimauri", "ReviewID": "UR10066586", "Content": "The first great thing about the Hotel Lodi is the people .The Owner and teh Staff are friendly and helpful.My friend and I were coming into the Ciampino Airport after 12 midnight and appaently all buses stop after 23:00.We arranged with Ali via email( which was answered within minutes) to have a taxi waiting for us at the airport.However it was not there and when we called to complain he was suffiently upset and annoyed.Witin minutes another taxi was there. The rooms are comfortable ,clean and spacious. The garden where you have breakfast is beautiful...fruits ,flowers and singing birds....what more can you ask for. If you go downstairs to use the internet you are usually offered a glass of wine or a cappacino. Ali and the others give you perfect directions to all of the sights and alternative methods of getting back to the hotel .It is not in the centre of Rome but literally a bus ride away from the main station termini. We only stayed for 3days but wished we could stay for more.My next visit to Rome will definitly include a stay at Lodi", "Date": "October 11, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Toronto", "Title": "“So so hotel”", "Author": "expat247", "ReviewID": "UR10063140", "Content": "I booked this hotel based on the reviews offered by other tripadvisor reviewers but i have to say it was somewhat misleading. the staff is very helpful and very accomodating but that did not make up for washrooms on 2 levels that baths that did were clogged, our toilet did not have a seat, no separation between the shower floor and toilet in a tiny washroom, and peeling paint. on the plus side it was somewhat easily accessible. it is about 20min bus ride to the station followed by 10-15min subway ride to downtown Rome. The owner was accomodating to our reasonable complaints and I believe they are in the middle of renovations so it should be better for the next visitors in coming months. Keep in mind though that this is a budget hotel so dont expect to be blown away by anything.", "Date": "October 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "uk", "Title": "“Perfect balance”", "Author": "djrm", "ReviewID": "UR10011411", "Content": "Our family decided to be a little adventurous and try this hostel for our 3 day trip to Rome. It was a quarter of the price of anything else we looked at and loved the idea of all being in the same room (there were 6 of us, 3 adults, 2 teenagers and a 12 year old) and are we glad we did? OH YES! We knew exactly what we were expecting thanks to the reviews here so nothing came as a surprise, in fact, it exceeded our expectations. The room was a comfortable size, clean, bunk beds, standard upright fan and plenty of cupboard space. We had no problem with noise (we didn’t hear any) and everyone slept well. There are shared bathrooms but they always seemed to be available when we wanted them. There is a kitchen available for you to use and also they allow you to use their refrigerator which is very handy! Shops/Bar/Restaurant and bus stops are all a very short walk away and getting into the centre of Rome is easy peasy! Finally the staff here are FANTASTIC!!! Anything you wanted to know, they were always happy to help, First class. In summary, we saved an absolute fortune in staying at Hotel Lodi and got exactly what we had hoped for, a great place to stay. It is not the Ritz in looks but the service you just can’t fault. We would happily stay again.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Quiet Location, Humble Appearance but Great Service”", "Author": "LodiSingapore", "ReviewID": "UR8850574", "Content": "I spent a whole week at Hotel Lodi, located in a quiet corner near Piazza Lodi. One would be immediately overwhelmed by the great service from the hotel staff, and particularly the boss Mr. Fabrizio. He would make sure that all details of your stay have been well taken care of, sometimes surprise you with a delicious Italian BBQ lunch. But one should be aware of the fact that this is out of the package of your stay, and simply reflective of their great service standard. The hotel is open 24hours a day. The rooms are typical of an old Roman house, but clean and quiet at night. Internet access is provided in the room and in the hotel lobby. On your arrival Mr. Fabrizio would speak no stop for 30 min on travel tips in Rome. If you find it hard to remember all the tips, just hop onto Bus 81 which brings you to Colosseo, Piazza Venezia and Piazza Navona and Vatican city. It is far more convenient than taking the underground train. But of course, Mr. Fabrizio would later tell you that he has mentioned all the tips. There is also a supermarket nearby, alongside a few snack bars. Overall, it is highly recommended that Hotel Lodi be your stay of choice in Rome. Enjoy your stay, a humble pie from Singapore", "Date": "September 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Kiel", "Title": "“freezing”", "Author": "KielParaglider", "ReviewID": "UR8840685", "Content": "The stuff was very friendly. But that was necessary in deed to compensate a lot of faults. The first problem was that our first night was not in hotel but in the house next to the hotel because they overbooked the hotel. The room and the bathroom was not clean. In the refrigerator there was mould. We had no warm water at all neither in the first house nor in the hotel itself. Whoa!!! Furthermore the mattress was not the best. As you lay in bed there was a hole from that you had to \"climb out\".", "Date": "September 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ljubljana", "Title": "“Great place to stay”", "Author": "Senca2007", "ReviewID": "UR8756327", "Content": "Have been there In Aug. If you don't care about the comfort and you are not looking for classy place, this place is right for you. True, it is not placed in the center of Rome, but the Metro and Bus station are in the neighborhood. So, to make some extra steps won't kill you. :)) Not in the center, but safe enough, which I find most important! The stuff is nice, always there to help, they will serve you the best \"caffe con cuore\". :) Back to Rome? Yes. To Lodi? Definitely!", "Date": "September 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "World Traveler", "Title": "“Great Staff, wonderful place”", "Author": "mbbmbb", "ReviewID": "UR8536768", "Content": "I stayed in the Hotel Lodi this past July, and cannot say enough good things about the people there. Everyone went out of their way to make sure I had the best possible stay in Rome, from great tips on things to do, to making sure I made my final train out of Rome. The beautiful courtyard is the perfect place for breakfast and hanging out with fellow travelers after a long day. The quiet location makes for a good sleep, and it's very convenient to grocery, laundry, and the bus to all the tourist attractions. I highly, highly reccomend this hotel.", "Date": "August 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“A great place to stay in Rome”", "Author": "Ginger16", "ReviewID": "UR8513119", "Content": "Hotel Lodi is an excellent place to stay: clean, safe, cozy - it should be all you need to feel great. The staff is very friendly and they really try to meet your needs and to make you feel comfortable. Next time in Rome, I will return to Hotel Lodi also.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "international", "Title": "“enjoy Rome in Lodi”", "Author": "dracu", "ReviewID": "UR8503383", "Content": "if you want to enjoy and have a great and good time traveling to rome for sure you would be very happy if u choose Lodi.Great ambient ,great staff and ....everything makes you enjoy Rome and you feel at home.", "Date": "August 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Gives rome that extra somthing....”", "Author": "idaeva", "ReviewID": "UR8442488", "Content": "If you expect a luxurious hotel with spa, pool and palm waving greek gods and godesses Hotel Lodi is deffinetly not your spot. - But if you instead are looking for a cosy, lowprice hotel with amazing and helpful staff this is the place to go. If you´ve got a problem they will solve it: if you say jump, they say how high! We loved it. It is a great place to meet new friends and we deffinetly recomend it!", "Date": "August 17, 2007"}], "HotelInfo": {"Name": "Hotel Lodi", "HotelURL": "/ShowUserReviews-g187791-d635107-Reviews-Hotel_Lodi-Rome_Lazio.html", "Price": "$78 - $394*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Oristano 14</span>, <span class=\"locality\"><span property=\"v:postal-code\">00182</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "635107", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/54/87/548746f8bd2644cfd5a99159405e85a32large.jpg"}}