{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Affordable luxury”", "Author": "LukeUK_12", "ReviewID": "UR128518503", "Content": "Hotel Berlin is situated in an excellent location within close walking distance to Berlin Zoo, Tiergarten and other major attractions.The hotel is large and grand, very modern and very clean. The hotel bar was reasonably priced and also the room service. I would recommend this hotel for anyone looking to experience Berlin staying at a top hotel at a bargain price.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Comfortable hotel but..”", "Author": "PRGirlLondon", "ReviewID": "UR128058687", "Content": "I stayed for three nights in Hotel Berlin on business. The rooms are a good size and the beds are comfortable. The breakfast was a typcial range of hot and cold food. A couple of points to note: - be warned that the bathroom has a narrow window (with clear glass) that goes looks in the the bedroom from the shower (and right opposite the toilet) - okay if you're not sharing a room - the 'free' wi-fi is very low speed. You can upgrade to high speed wi-fi for 30 mins free (or pay for 24hrs - i think about €15). To do this you need to ring for a PIN number. There was no answer when I rang - if you need something doing, you will probably need to go to reception to ask. I rang the customer care number a couple of times, but didn't get an answer The team on reception were helpful with queries.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“The hotel surprised me...in a good way!”", "Author": "travelexpert001", "ReviewID": "UR128057355", "Content": "Hotel was great better than the images on their website. I was in a newly refurbished room on the second floor and would definitely return. It was modern, spacious, great shower and big screen tv. The staff were very hospitable and I was able to get an early check in and 1 hour extension on check out. Breakfast buffet was huge with chef on hand to make omelettes!", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Istanbul", "Title": "“Beautiful hotel with great hospitality”", "Author": "JustAddWater", "ReviewID": "UR127972543", "Content": "We have stayed in Berlin - Berlin hotel for 3 nights in April. The hotel is very conveniently located, has huge rooms (We stayed at 523), very clean, very knowledgeable and friendly staff. From Tegel airport you have to take 2 buses X9 to Zoo garten and 100 to Lützowplatz and the whole trip takes about 30 minutes. Every attraction in the city is within 2-5 stops of buses 100, 200 and MP3. You can reach Brandenburg Gate, Checkpoit Charlie and other sites within minutes. The hotel has free wifi which is a huge plus, the Julius restaurant in the ground floor has a limited menu but the selections and the wines that accompany the dishes are delicious. The waitresses and chef are very very attentive and professional. The check in and check out procedures are handled easily. The prices are very reasonable and the breakfast buffet is definitely worth to try. I would recommend this hotel to people who want quality and that extra touch of hospitality in Berlin.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newcastle", "Title": "“lovely hotel, but a good walk to tourist attractions”", "Author": "gnttours", "ReviewID": "UR127718287", "Content": "Reception staff great, we arrived in berlin 6 hours before check in started, our bags were put in a left luggage room, perfect. When we got to our room it was great, comfortable, clean, lovely. Pillows a bit strange, they are big square, also we were in a queen sized bed but it had 2 single quilts on it again a bit strange but very comfortable. If you are going to berlin to sightsee this hotel is a good 40 to 50 minutes walk to the brandenburg gate and reichstag however there are some lovely little cheaper bars on the walk back. The tourist bus also stops right outside and it is only a 5 minute walk to the nearest underground station. Didnt eat in the hotel but the bar is pleasant, very modern and slightly more expensive than the bars outside.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Fantastic rooms”", "Author": "MaliciousD", "ReviewID": "UR127486643", "Content": "My girlfriend and I stayed at this hotel for 4 nights during easter. We took advantage of their spring offer, which offered 35% off 3 nights. The rooms were excellent. Very, very spacious with everything you need, including coffee making facilities, a fridge, etc. Comfortable bed and our room had a balcony. Rooms were cleaned daily. The staff at the hotel were very nice and helpful. I asked for directions a few times and they gave me a travel plan and maps. I did not eat at the hotel, so I cannot review their breakfast and food. Location is nice, pretty quiet area with busses right outside. You can walk to Brandenburger Tor (the walk is about 30 minutes, the bus around 10 min). It is not to far from the airport. We paid 16 euro for a taxi, but there are also busses. Negative points: No free wireless at rooms. I had to pay 16 euro for 24 hours. Overall, I can warmly recommend this hotel. For what you're paying, this is a great hotel, in my opinion. When I am going to Berlin again, which is definitely are, because it is a great city, I am going to stay at this hotel.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kristiansand, Norway", "Title": "“A BARGAIN”", "Author": "Torbjorn42", "ReviewID": "UR127364171", "Content": "Efficient check in/out. Very clean, quiet and cosy room. When booking, try to get breakfast included. Excellent variety of food and beverages. Very good location. Frendly and helpfull staff. All taxidrivers knew the hotel. Much better than expected.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Just perfect”", "Author": "Pavlou_Pers", "ReviewID": "UR127282453", "Content": "I stayed at the hotel for 3 nights and it was a wonderful experience. The hotel is very clean and cosy. From the reception to the rooms, you could feel the modern style. The breakfast is perfect with great variety.There was even a juice machine for making fresh juice. The pancakes were fresh and very delicious. Mini packed nutella was also available. Dinner was fine as well. The elavator was working only with the room card for safety reasons. The location is very convenient. The hotel is in workig distance from KADEWE and famous shopping street. If i ever visit Berlin again, i would visit the hotel again without any hesitation. Very well organized and run hotel.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kaarina, Finland", "Title": "“Newly renovated business-hotel with good location”", "Author": "Northerntraveller73", "ReviewID": "UR127107520", "Content": "Stayed here for few nights while in conferens at Berlin. I was pleacently surprised from their newly renovated business-wing rooms: good size, excellent bathroom (showers are also for big guys like me :-) and very modern decoration with good sleaping quality. Room I stayed was just renovated and there was little paint/glue smell on the rooms and they really did have problems with aircon in the rooms but I guess that will be ok when they learn how to reset the system? I was attending to a conference with 500 people and they really managed to fit us in and also to provide good eating experience for all - not an easy task... Breakfast especially was very good with freshly squezed orange-juice, good bacon and croissants +++ Not all rooms are yet finished and the outer core of hotel needs renovation so there is still some work to do. All in all good hotel-experience with short walking distance to KaDeWe and Ku'dam", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "N. Ireland", "Title": "“Wonderful Experience”", "Author": "NIrelandrosie", "ReviewID": "UR127080666", "Content": "I stayed in this hotel as part of a conference with over 500 delegates. Everything was so well run & just seemed to happen effortlessly. The buffet for breakfast & dinner was fabulous. The rooms were nice, clean & quiet. Staff were so friendly.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cape Town", "Title": "“Very Happy with this hotel”", "Author": "travelbabe40", "ReviewID": "UR126904370", "Content": "I stayed at Hotel Berlin-Berlin for 8 nights recently and was very happy. iI did a lot of research before I booked so I did request a room on the quiet side of the hotel but my request for a double or queen was not met, I had 2 single beds. However, the room was very comfortable, spacious, the bathroom was lovely, cleanliness very good. I did not indulge in the breakfast rather choosing the quick breakfast which was a very good choice and value for money. I found the bar staff to be excellent as well as the staff on guest relations. The deli- counter I thought was very overpriced espcially for a dried out cheese sandwich. It is not as close to restaurants and shopping as I had hoped rather a 1.4 km walk but other than that it is a great choice when staying in Berlin.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good standard in the heart of Berlin”", "Author": "soyporteno", "ReviewID": "UR126568845", "Content": "Excellent location and good standard. Rooms are quite nice and very modern. The staff is ok. It is more a business hotel then a place, where couples or individual persons stay. You may not fall in love with the place but you wont have serious complaints either. The restaurant is not that convincing. You find better and cheaper food in the nearby restaurants.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“will go back”", "Author": "maura192", "ReviewID": "UR126452564", "Content": "just back today 21st march stayed for 6 nights an excellent hotel good location lovely hotel excellent staff. First time in berlin and have had a lovely experience with the city and hotel", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“Excellent Hotel”", "Author": "Julie C", "ReviewID": "UR126145811", "Content": "We stayed for 3 nights on the 10th March 12. What a lovely hotel. The staff are friendly and speak great English. Our room was big with a flat screen tv which have all the English channels such as BBC and ITV, which was a bonus after a long day out and about. There were also tea and coffee making facilities, another bonus, as well as a fridge. The beds were lovely and comfortable and everywhere in the hotel was spotlessly clean. Breakfast was great and there was everything you could want to eat. The only down side was the price of the drinks at the bar, I paid over 6 euro for one glass of wine, very overpriced. The bonus of the fridge in the room helped as you could buy drinks from the supermarket and keep them in your room. The location was great, just two stops on the u-bahn from Zoo on the U2 red line. You could walk to Zoo in about 15 minutes. Once there you can get to anywhere in the city. All in all I could highly recommend this hotel. We only paid around £150 for 3 nights with breakfast and we got this deal on hotels4u.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Greece Crete", "Title": "“Value for money hotel”", "Author": "kougis", "ReviewID": "UR125999634", "Content": "Perfect location. Perfect breakfast. Clean and large rooms. Good price.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Has a long way to go...”", "Author": "ewaldbiemans", "ReviewID": "UR125921410", "Content": "A lot better then in the past Lots of room for improvement. The hotel has come a long way in the last years as renovations are ongoing. My room had a problem with the bathroom drain and continuous sewer smell emanating from the drain. The bed is as hard as a rock and the breakfast quality is not what it was. I hear that some of the rooms were recently renovated and will try to stay in one of the new rooms next time Wifi continues to be a major complication – kicking you off and logging on is continuous….", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“ELEGANCE With A FREE UPGRADE”", "Author": "El G", "ReviewID": "UR125529472", "Content": "OVERVIEW: Hotel Berlin offers an unbeatable nightly rate considering its elegant accommodation. The rooms are clean, spacious and had a good view of the city. We initially reserved a standard room, surprisingly, due to un-availability and current renovation at the time; we were upgraded to a suite. HB is geared primarily for business and corporate functions alike. Fortunately for us, there was no major conference during our stay. The staff (although most of them have “poker face”), are all professionals and courteous with business like attitude. We left Hotel Berlin with a lasting positive impression; therefore, without a doubt we would definitely stay there again. Hopefully, we’ll receive another FREE UPGRADE. TRAVEL DATES: September-2009 LOCATION: Centrally located; Plenty of restaurant and shopping opportunities within the city square; Close to public transportation. Close to a public park which is perfect for leisure walk. POSITIVE NOTES: Elegant accommodation; Unbeatable Price; Centrally located; Professional staff; Clean and spacious rooms; NEGATIVE NOTES: Our room was a little walk from the elevator. AMENITIES: AC; Free Wi-Fi; Flat Screen TV; In-room Safe; Hairdryer; Clock/Radio; Business Center; On-site Restaurant; NIGHTLY RATE: $130+ booked via Travelocity DISCOUNT ACCEPTED: None NOTES: Please click the green “YES” button below if you find this review helpful. Thank you!", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“HOTEL BERLIN - BERLIN”", "Author": "Lyn1990", "ReviewID": "UR124798718", "Content": "Very good hotel - central to most areas. Friendly good service - I would stay there again.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bolu, Turkey", "Title": "“Hotel with a potential, yet need to improve”", "Author": "Tamer H", "ReviewID": "UR124708865", "Content": "I have stayed here during a business trip as it was few steps away from the meeting spot. The price was good for a five star hotel. (It was during Berlinale - peak time !) My room was spacious, but there was no wardrobe, no bench for putting the luggage. I had to keep the clothes ın the luggage laying on the carpet. Probably they will provide more facilities in future; because I felt that the renovation is continueing. I was woken up by the drilling and hammering; luckily at a reasonable hour. I think this will not continue forever, so should not frighten potential customers. The WLAN was free of charge, but this was a gift of the booking agency; so choose it wisely and ask at the reception first. The breakfast is extremely overpriced, still you can have a croissant and coffee for few euros at the hotel. If I come to Berlin for the same meeting I will probably look for a room here; the listed negative issues may then be resolved.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3"}, "AuthorLocation": "Berlin, Germany", "Title": "“******WARNING : NOT IN MITTE AT ALL!!!!!!!!”", "Author": "Alex P", "ReviewID": "UR124639996", "Content": "Dear All, I choose this hotel because it looked interesting and especially, it said the location was in the MITTE district, this means City Center. Unfortunately, upon my arrival from the airport, when I asked the cab driver about the Mitte, he just laughed, saying it was PERIPHERY, not Mitte at all. I was in town to attend the Film Festival (Berlinale), which actually took place in the MITTE, and I spent most of my time in a Taxi to reach the different venues. Furthermore, I managed to spend more on Taxis over 3 days, than on food, drinks and shopping combined!!!! Also, this place is for CONFERENCES and BUSINESS. If you are looking for a couples place, something personal, or with a Berlin Feel, AVOID AVOID AVOID this monster.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Huge hotel”", "Author": "OlgaandJan", "ReviewID": "UR124491303", "Content": "If you like anonymity, this is the place to be. Almost 700 rooms on 7 floors. It is massive, overcrowded place. Reception is very modern and efficient. The brekfast place is very big, with more buffets to get everybody through. Breakfast is good. For dinner we had to wait for 1 1/2 hour before the food came. that was a waste of time. The room is ok (size), but the bed not. Cushion is to soft, and there are two duvets on the queen size bed. My duvet was falling all the time when I turn in my sleep. It was in Eastern Europe in the past that I had beds like this. I cannot remember in my traveling the last 10 years that I had a bed like this. I did not sleep well for two nights due to this problem. The wifi was good, announced as costing € 19,- per day, but is was free. Very good. I made a mistake with the parking garage and was set by the concierge at my place. He asked why did you not listen to me when I gave you instructions, but I tried to tell him that I did not had any contact with teh concierge.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Customer service - not here”", "Author": "ChilternFlyer", "ReviewID": "UR124364200", "Content": "As a seasoned business traveller I found this hotel's attention to detail sadly lacking. Stuff goes wrong anywhere - its how you put it right that counts. Be warned if it goes wrong there is no follow through - shame because fundamentally it could be a good package apart from tiny beds.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Marlborough, United Kingdom", "Title": "“For Business Only”", "Author": "Peter084", "ReviewID": "UR124103936", "Content": "This hotel exists for one purpose only - to serve Business people in need of a fully functioning Business hotel. It does that job quite well. Reception is spacious and well manned meaning queues were fast moving. The rooms are clean, tidy and come with (limited) desk space and free wifi. Bathrooms are fine although the shower is not powered and as such is a disappointment. TV channels include a good selection of UK channels - a home from home. The breakfast room is big but still manages to feel overly full as the self service food area is tightly packed. The bar area is poor - too small and it is sometimes hard to get served. It is also in direct line with the Hotel's front door so the minus 16 temperatures outside made the bar very cold. Having stayed a few time in Berlin I would say there are better Business hotels than this.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“comfortable stay”", "Author": "Tab2Tab", "ReviewID": "UR123452462", "Content": "Me and a pal stayed at this hotel the week in between Xmas and New Year. It's in a good location close to Underground etc. and buses. The room was comfortable and the bathroom was a good size with a great shower. The staff were helpful and multi-lingual, so no problems for us as we speak no German. We did the breakfast (as an extra) one morning, but thought it a little pricey at €21, after all, there is only so much you can eat at breakfast. I would stay again as I plan to visit Berlin again in the summer.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Super location”", "Author": "jensbo", "ReviewID": "UR123202868", "Content": "Very central location close to the Tiergarten. Bus 100 stops close to the hotel and the U-Bahn is within short walking distance making Hotel Berlin, Berlin an excellent point of departure for the exploration of Berlin. The room was good, the breakfast buffet excellent and the WiFi worked well. All in all value for money. Restaurant Locher accross the square is a good venue for a delicious dinner and the original Cafe Einstein is close by.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Decent stay in Berlin”", "Author": "smiah79", "ReviewID": "UR123008166", "Content": "Great stay at Hotel Berlin. Decent location with easy access to most places. We were on a \"lads\" holiday but this is more of a business hotel with most guests being reps and sales people by the looks of things with a few tourists thrown in. The staff are very courteous and helpful. The rooms are a little basic, but then again this is not a 5 star hotel and it suited our needs on this trip. The hotel recepetion is very modern and brightly coloured. The gym and sauna are is very good and we spent a fair of time here. The buffet breakfast was very good and hand plenty ot offer. Overall its a good hotel in a safe area which is good value for money too. Definitley worth considering.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "naperville, IL", "Title": "“A Nice Hotel in a Great Area”", "Author": "jsmartinez", "ReviewID": "UR122382042", "Content": "We spent a week at the Hotel Berlin, Berlin, and it proved to be a great choice. The hotel is modern and attractive with reasonable rates. The rooms had been recently renovated and are quite attractive and comfortable. The only reason I would not award it 5 stars is that it was rather too warm at night. You can open the windows--which we did--but then the noise from the busy street is too loud. If I could have cooled off the room without opening the windows it would have been perfect. The staff was attentive and friendly, and the location is a short walk from the Nollendorf U-Bahn and near many reasonably priced restaurants. Highly recommended.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canterbury, England", "Title": "“Good hotel overall”", "Author": "KezzaKKC", "ReviewID": "UR122265510", "Content": "Booked this hotel for a 3 night budget break over Christmas. Pros Good, friendly staff. Reasonable sized room. Comfortable beds. Good selection of channels on TV. Well priced. Easily accessed from the airport (Tegel) and close to a metro station. Cons Duvets a little too small for the beds as they easily slid off during the night. No anti-slip mat for the bath so when using the shower and trying to climb out you have to be careful not to slip and hurt yourself. It's a very large hotel covering an entire block and our room on the 5th floor was probably about as far from the main elevators as it was possible to be. For some strange reason there seems to be a typical German efficiency in the allocation of drink ingredients in the room! On discovering that there were only three teabags (one Indian/British style, one Peppermint and one Fruit) I asked reception for more 'traditional' teabags, and was given a handful of extra bags. However, when the room was cleaned during the day, and the stock replenished, I was amused to discover that the extra teabags had been taken away and we were once again left with just three (one of each)!! Breakfast is very expensive (21 Euro). There's a reasonable range of items to choose from with overall good quality. We discovered that there was an egg station AFTER we had eaten - it's hidden away in a corner of the restaurant and you won't discover it if you're seated in a certain area. Overall it's a good hotel at 55 Euros per night for the room.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "romania", "Title": "“Very good hotel in former west Berlin”", "Author": "ggabi", "ReviewID": "UR122043706", "Content": "This old hotel is well prepared for the future! Excellent rooms, not so big but with everything you would expect in a good quality hotel! Excellent restaurants, not very far from public transportation, nice neighborhood with many parks,good business center. Better than expected!", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Second Time Staying Here - Simply Love It”", "Author": "Ger W", "ReviewID": "UR121878126", "Content": "Once again we stayed in the Hotel Berlin, Berlin at the start of December (previously stayed here May 2010). We brought our extended family with us and everyone thought the best thing about our trip was the hotel! We purchased a classic room in January for our trip in December, directly through the hotel. As the hotel is undergoing renovation, we were given a Business Room instead of the Classic Room (fantastic rooms currently undergoing renovation to Premium Rooms - they came with a comfortable sitting area). All I can say is that the rooms in this hotel are so big and comfortable, it doesnt matter what kind of room you get. I wouldnt consider staying anywhere else in Berlin. In the past I have stayed in various Berlin hotels including the Kempinski on Ku'damm, the Artotel and Centrovital in Spandau, but this hotel is the best. Firstly as a business class hotel you get a level of attention you wouldnt get elsewhere. Check in is so quick and efficient, reception staff are so helpful. Room service is fantastic and the household staff are friendly and welcoming. The rooms are surprisingly big, spacious and comfortable (order harder pillows though if necessary - traditionally in Europe pillows are soft). The furnishings and decoration are modern, clean and well maintained. Plenty of storage in the large wardrobe for cases etc. Great sized bathroom with a fantastic shower, showergels etc. And English TV! Always a plus. Breakfast is expensive but there are plenty of great restaurants and cafes nearby for food. Cafe Einstein being my favourite. The bar serves lovely food (Berlin Burger highly recommended!) and cocktails. Nice and atmospheric in the evening after a long day shopping at the Christmas Markets : ) As its a business hotel, conferences are held in the conference room across from the bar. But this isnt a problem. It seems the conferences finish early evening leaving guests of the hotel free to lounge in the bar. The location is perfect. The bus 100 is right outside the hotel and goes directly from the Zoo to Alexanderplatz. The tour buses also stop here! Witttenburg Platz and Nollendorfplatz U bahn are a short stroll away. KaDeWe is about a five minute walk. Its ideally located in the centre and so easy to get to and from the hotel. There is also a taxi rank across the road from the hotel. The current renovations had no impact on our stay whatsoever, and I believe they will be finished in March 2012. I am staying here again in January 2012 for our 6th visit to Berlin and will hopefully get to see the new rooms on our 7th visit sometime in the near future!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“Good value and spacious room”", "Author": "topcat1972", "ReviewID": "UR121850548", "Content": "We visited Berlin as part of our honeymoon and we were not disappointed. The hotel was in a very good location and the room was excellent. Taxi's were readily available outside if necessary and the ubahn was a 5 minute walk away. The hotel had a huge lobby with takeaway food available. There was no wifi in the rooms only in the lobby area. We didnt experience the restaurant for breakfast so cannot comment. There is a lovely department store Ka de We not far away and it has a great gourmet floor which is a must visit. This was my first experience of Berlin and the hotel was a great addition.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "england", "Title": "“good hotel in a lovely city”", "Author": "anastasiaEngland", "ReviewID": "UR121422099", "Content": "This hotel is fairly well located. Very near the Zoo Train Station, and the very nice department store KA de WE. We had a business room, which was fairly spacious, nice bed, (if you like hard pillows, you need to ask for them) tea and coffee facilities, which comes incredibly handy when you come back from walking the city on a cold day. Bathroom very clean. Very good shower, towels slightly small, and not very many, and a bottle of shampoo, soap and body wash all in one. We did not try the breakfast or any other meal in the hotel. There is a very good italian restaurant Valentino very near the hotel. All in all a good hotel at a very reasonable price. Our checking in was the quickest we had that I can remember. We were the only ones arriving but I have waited for ages in other hotels with nobody around. The receptionist was friendly and very efficient. I must point out that the room had a lot of noise from constant traffic. If the noise bothers you, take a room indoors not facing the street.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adana, Turkey", "Title": "“Great But Extras Were Expensive”", "Author": "LilRedFoxx", "ReviewID": "UR121108615", "Content": "We stayed at the hotel for 4 nights on vacation. The staff was very courteous and helpful throughout our stay. Our room was very nice, simply and tastefully decorated roomy and quiet. We were on the fourth floor and could only hear traffic when we left the window open. There was a tiny fridge instead of a mini-bar and it worked out better for us. You can purchase drinks and snacks at the front counter as needed. The hotel was very busy, but not overwhelming. The location was great---there were restaurants and cafes and grocery stores very close, and the Europa Center was well within walking distance. Plenty of shopping is nearby. Cabs are always out front if you don't feel like walking. The only downside to this hotel is that they charge for wi-fi, and breakfast was NOT included in our booking. We paid 20 Euro pp for breakfast! I've stayed at 5-star hotels that wouldn't dream of charging for breakfast...especially at that rate. However, the breakfast was good. Wi-fi was expensive as well, but the speed was fine. We will stay here again when we visit Berlin, but we'll make sure to go out for breakfast and to skip the wi-fi.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Third stay, always good”", "Author": "jtontravels", "ReviewID": "UR120816711", "Content": "Smart, clean straightforward hotel. Great value. Should offer free WiFi though.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great stay, good all round hotel”", "Author": "pkonline84", "ReviewID": "UR120523160", "Content": "Stayed at the Hotel Berlin, Berlin for 4 nights. Rooms were larger than expected, had all the basics, we're clean, although had some initial problems which were very quickly sorted after a call to reception. Staff always very polite and helpful. Tv had a number of English language channels. Breakfast was included in out room and was superb - very large range of foods, in a lovely, light setting. I would recommend this hotel for a short stay in Berlin and would happily return.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sudbury, Canada", "Title": "“Good, not great.”", "Author": "Jesse G", "ReviewID": "UR120384897", "Content": "First of all, the staff are very friendly and the location is more than acceptable. The cosmopolitan look of the hotel and the lively hotel bar scene each evening was enjoyable as well, my only concern is that the room we stayed in seemed as though it might be part of a different hotel. The furniture in the \"classic\" room was rather dated, the in-room amenities were sparse and the beds were not the most comfortable I have ever slept in. However, it was clean and secure, no question. Next time I would spend a little more and upgrade to another type of room, because the more modern areas of the hotel seemed in great shape with tasteful decor. The \"classic\" room is still perfect for anyone travelling on a budget, and it's great that the hotel offers such an option for those frugal travelers. It simply wasn't the sort of room I'm used to, so next time I return I will make a point to book something a little higher up the line. Still, overall, a good stay and can't say enough about the helpful staff.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Amazing hotel”", "Author": "DavidePiras", "ReviewID": "UR120346142", "Content": "This is by far the best hotel I've ever been, people so friendly and helpful, breakfast a bit expensive but worth every single penny with such selection of cold and warm food and a cook ready to prepare you wonderful omelettes. next time we go to Berlin we definitely go to this hotel again, the sauna and fitness room are available for free for all guests and are perfectly kept and organized.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Very good value in Berlin”", "Author": "Dew's", "ReviewID": "UR120292350", "Content": "I have stayed at this hotel several times this year (2011), all on business trips. It's been good value for money - especially for a city centre hotel in a European capital, and every room I have stayed in has been in very good condition. The service at reception is swift and efficient, the beds are comfortable, the bathrooms very clean. The rooms do not have over-priced minibars - instead, you can purchase items at reception at a more reasonable cost. There is free WiFi in room. The corridors are carpeted and it is quite hard to hear people moving around outside the rooms. Breakfast is very comprehensive, and service is attentive without being oppressive. My only complaint is that the hotel tends to assume I wish to pay in GB pounds without asking, which is a nuisance as my company expects Euros in continental Europe!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Nice hotel with retro touch”", "Author": "Damascene48", "ReviewID": "UR120198464", "Content": "Although I asked for a large double bed and was provided with atwin beded room, the staff were applogotic and sent me the housekeeping staff to join the two beds. The hotel theme is as its name suggests, the city of Berlin, with many pictures of the city adorning the rooms and hallways. The breakfast is full of choices both typical German cooked breakfast as well as a wide variety of options for the more continental pronged folks like myself. Howev I found the price quite high at Euros 21! The other drawback is that the hotel provided wifi connection at a charge Euros 9.95 per day!", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Taunton, United Kingdom", "Title": "“Excellent service and location, we will be back in 2012.”", "Author": "SheldonCole", "ReviewID": "UR120175105", "Content": "Stayed here 3 nights from 21 October with our 3 children aged 14, 12 and 7. Arrived 11pm, check in was friendly and quick. We had booked 2 double rooms, and were given room numbers 518 and 523 which were fine and one of which featured a readily made up bed which we needed for our third child. I had an excellent Currywurst, pommes frites and large beer at the bar. It was Handy that you could buy sandwiches, crisps, snacks and drinks by Reception. The hotel was clean and the staff friendly and efficient. On the day we left we were allowed to leave our luggage at the hotel all day at no charge. When we picked it up in the evening they called for a taxi for us and loaded the luggage into it for us. Many of the staff speak English. All in all, we were very pleased with the hotel and it is well located being close to the Zoo and KDW. Berlin itself is an amazing, historic city with so much to see and do. The German people we met were all friendly and polite. We shall return to Berlin for another break in 2012, and will stay at the Hotel Berlin again. Sheldon & Becky Cole, Taunton, England.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Value for your Money”", "Author": "WalterTrump", "ReviewID": "UR120166896", "Content": "At £60 per night room only, good value for money. Centrally located between Tiergarten & Kurfurstendamm. Ideally located for bus/underground transport. Spacious clean rooms, well maintained with nice bar area. Check in/out fast & efficient. Did not use restaurant. WARNING breakfast is steep at 21 euros per head. Couple of negatives, outside traffic noise is loud, particularly at night. Pillows were awful, too soft, make sure you request additional firm pillows. Overall goood value for money.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“The Best Hotel in Berlin for the money”", "Author": "Chris P", "ReviewID": "UR119701645", "Content": "Ideally located (along the route of the famous Berlin City route 100 bus, which is virtually running all day every day, every 5 minutes frequency). Stunning quality hotel, smart modern decor and the friendliest welcome possible. Rooms are all tremendously clean and extremely well kept. Staff are ueber-helpful and even suggested a sightseeing tour that we ensure we saw the main attractions during our stay. We were with a small baby and the stay could not have been better. I stay in many hotels every year on business and for leisure and this is truly one of the best. Do not hesitate - I recommend unreservedly - for business or pleasure, the perfect base when in Berlin.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Espoo, Finland", "Title": "“Nice comfortable stay.”", "Author": "RadixLecti", "ReviewID": "UR119363554", "Content": "I've been staying in Berlin Berlin three different times. Hotel is good value for the money in good location. Only downsides are quite expensive breakfast and wifi.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fribourg, Switzerland", "Title": "“Gross, freundlich, gut”", "Author": "AnnalenaP", "ReviewID": "UR119265347", "Content": "Hotel Berlin Berlin is a good place to stay on your Berlin travel. It`s located o.k., after a 3 minute walk you reach the Metro which connects you in no-time with the most important sights of the city. The rooms are big and nice, although ours smelled like cigars - even though it was a non-smoker room. The staff was really friendly and always happy to help. Our room wasn`t exceptionally clean which is a shame for a 4 star accommodation!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "london", "Title": "“Quite good!”", "Author": "loveknot", "ReviewID": "UR119230169", "Content": "Stayed for one night on a business trip. Really big and busy hotel, very conference and bus tour oriented. Gave me the wrong room twice, second time walked into a room and an airline pilot was getting changed....woops! Receptionists seem stressed so the friendly factor isn't entirely fitting for Berlin which is usually super friendly and warm (personality...not the weather!!). Room was ok, bit smelly......a musky smell which is offputting. Toiletries in the bathroom limited and if you need anything else it's 1Eur50 per item. Good nights sleep. Try and work out the room entertainment system......good luck! No bathrobes/minibar was empty. Great location though and they recommended me a great little German restaurant nearby where they serve an excellent schnitzel at a great price. Breakfast was good, again the place is so busy the staff seem overworked, you keep having to ask for things like tea constantly. Would recommend it for a short stay at a very reasonable 100 EUR per evening. Stayed in more luxurious places in Berlin but this place would certainly do.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Any hotel, Anywhere.. but good”", "Author": "zungazung", "ReviewID": "UR119133420", "Content": "This hotel could be any hotel, any place in the world, which is both advantageous and not. You know what you'll get and it provides it well, with pleasant and attentive staff. Clean, safe location, fine in a small city although tourist highlights are probably not on the doorstep - depends what you consider to be a highlight though! But also means the hotel is a refuge after a day out and about. Food was eminently missable, so we did. I thought it provided an excellent base for a stay.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Good business hotel in excellent location”", "Author": "will in sf", "ReviewID": "UR118629901", "Content": "We stayed five nights at this hotel. It is a new hotel, very modern inside. Most of the guests seemed to be businessmen; we could tell by walking through the lobby that there was an appliance convention in town. The room was big enough for two, had adequate storage, and a comfortable bed. The room was quiet even though it was on the street side of the building. What we liked most was the location and access to public transportation. The double-decker number 100 bus stops in front of the hotel and can take you through the Tiergraten, past the Reichstag and down Unten den Linden. The U-Bahn stop -- Nollendorfplatz -- is 200 meters from the hotel; three different lines pass through this stop. The desk staff, of course, spoke English -- most of the time better than mine. They were friendly, helpful, and efficient. There is a nice bar/patio in the court yard.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Large clean modern hotel in Berlin”", "Author": "Koalakaye", "ReviewID": "UR118479379", "Content": "This is a fairly modern hotel in Berlin. It is close to the train station so makes it an easy trip into town or to other sites around Berlin. My room was very large and clean. It had a little coffee table and chairs and a small bar fridge to keep your cold stuff in. The hotel has a bar down stairs which is handy after a long day sight seeing! The hotel is very large and the breakfast rooms are huge. There are several smaller buffets which have cereal, sausages, eggs, fruit, toast, tea and coffee, dried fruit and nuts. Not a bad selection.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "hyderabad", "Title": "“Colorful Hotel with good rooms.”", "Author": "modernmarcopolo", "ReviewID": "UR118330717", "Content": "I stayed here for two nights in August . Must say that the stay was very comfortable and enjoyable. The highlight of this hotel is the colorful lobby and dining area. Breakfast is very good and has two well laid out buffets , to avoid over crowding. Rooms are very large and have a separate sitting area. The service at the concierge desk was very poor . The guy had very little knowledge about the local must see attractions. The hotel is very popular with tour operators , you should avoid this place if you dislike large touristy groups ! I had to wait for my room for almost one hour at check in.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Elverum, Norway", "Title": "“Nice, modern, roomy and clean, but expensive internet..”", "Author": "espangen", "ReviewID": "UR117965852", "Content": "Stayed here for 4 days in July 2011. The hotel is modern, clean, the lobby area is roomy and nice, the room was a nice one too. Definitely of the better. Staff was friendly and helpful, both to me speaking german and other people in our group only speaking english. I have one thing to complain about: You get 30 minutes free internet per room, then you have to pay an outrageous price. This is in 2011 ridiculous, as you get free unlimited internet even at a €10/night hostel. We ended up bringing our laptops around the corner to a café having free wi-fi. Not a big issue, but when paying that much for a 4-star hotel, I don't expect to pay anything for internet access. Parking in the hotel parking lot is expensive too, many times more expensive than a normal street parking in the adjacent streets.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“we loved it and well be back”", "Author": "daliasiani", "ReviewID": "UR117478499", "Content": "very good location,near ka de we.near buses.good rome.very good breakfast.nice yard.friendly stuff", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Very good location.”", "Author": "trimithiotis", "ReviewID": "UR117436261", "Content": "All services provided are excellent. All the places of the Hotel were very clean. The buffet breakfast was rich. Roomy lounge and Bar.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good buffet breakfast and good rooms”", "Author": "thcthchk", "ReviewID": "UR117087189", "Content": "My wife and I went for a 3 night city break to Berlin. We have been to other EUropean cities such as Paris, Lille, Brussels, Amsterdam etc, and this was the best hotel we have ever stayed in. In the other cities, we have stayed in small rooms with no service or breakfast. Hotel Berlin was nothing as such - the room was spacious and properly designed, with comfortable bed, lots of corridor space, and a clean and elegant toilet. It is not a 5-star hotel, and was not decorated in a luxurious manner, but it was simply comfortable and clean. The buffet breakfast, included in the room price, was great - they kept the buffet filled up till the last minute. There were bacon, local sausages, waffle & pancakes, juices, museli, fresh pineapple and watermelon. We had breakfast and siply skipped lunch. The service was excellent. The gym came with a sauna, all included in the room price, and it was a properly fitted out gym (unlike other 4-star hotels we have been, which simply converted a small room into a 'gym' with 2 treadmills and a water dispenser). THe sauna was very good and we loved it. All in all, a very good hotel which made our weekend break a pleasant one", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Basel, Switzerland", "Title": "“Up and down opinion”", "Author": "notkeepingmum", "ReviewID": "UR117047035", "Content": "Pros: A great rate with hotels.com of 210 euros for 3 nights for two people. Reception very impressive in decor, nice style, bar and outside \"beach\" were great with a nice buzz and atmostphere. Close to Kadewe and the open top bus tour, metro etc. On arrival the room we took was clean. Cons : Reception staff rude and unhelpful Room upgrade we paid for was dubious Tried to book us into a room with double bed after we requested two singles, then insisted a normal room on their website was actually an executive suite we had paid for. Breakfast not included in the price Noisy main road outside our room. Cleaner didn't keep up standards during our stay. Also, i had bought my friend some chocolates, of which some disappeared and the foil was left on the floor by the wastepaper bin in the bathroom!!! Tea and coffee not refilled unless we called down and requested it - and it took 70 odd minutes for this to happen. Mixed feelings, i would only recommend if you got a really good rate.", "Date": "August 21, 2011"}, {"Ratings": {"Overall": "3.0", "Service": "3"}, "AuthorLocation": "Madrid, Spain", "Title": "“Personal is very unfriendly”", "Author": "LAVAC", "ReviewID": "UR116965871", "Content": "In the most of the cases they answered like they were doing a fovour to me. They told the things one time and if I didn't understand they were indifferent. They didn't inform me about important points during the check-in, they didn't try to translate what they were saying etcetera. I will not back to this hotel anymore.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "glasgow", "Title": "“enjoyed the Berlin experience”", "Author": "silvertigress", "ReviewID": "UR116951289", "Content": "This hotel was one of the first to be built after the war according to our tour guide as we passed it on our open top bus tour on the second day. It is a large hotel well located a 10 minute walk from the zoo. The hotel itself is modern, clean and spacious. one tip I would give you is not to use the phone to call home. a 12 minute call to Scotland cost me 15.60 euros, far better off calling from a phone box!!!! getting to the hotel. we came from schoenfield airport . we bought the ABC welcome card at the airport, but you could have got it at the train station from one of the red machines. please please follow this advice though!!! only stamp/validate the ticket ( in the wee red boxes on the platform) once just on your first journey. you don't need to stamp it again for any further journeys. we did and got thrown off the train coming back from a day trip and charged a 40 euro fine because we thought we had to stamp it every journey. on arriving at the station we followed the advice from other reviewers but could not find the express train mentioned. So we ended up going to platform three and getting the train to Dessau. We got off at zoo and then we were lost!!! if you want to walk to the hotel when you come out of the station and you can see the zoo in front of you turn right and just and walk to the top of the street. then turn left and keep walking straight down that road. or when you get to infront of the zoo ( you will see the elephant gate) cross the road and get on the number 100. this is a great bus service and stops at all the main sites such as the Reichstag, Brandenburg gate etc but even better than that it stops at Lutoplatz just in front of the hotel. the next stop comes up on the display well in advance, just remember to press the stop button!! in the end we ended up getting a taxi to the hotel which cost 5 euro 60 cents. Even although we had paid in full in advance (and so didn't bring our credit card) we were charged a deposit of 50 euros per night which would be returned to us upon checkout. This is something you really need to know if you are a traveller on a budget like we were and have booked and paid in full in advance. we stayed on the 5th floor. There was very little noise. The rooms were clean and spacious and decorated in a modern style. The mattresses were very squishy yet comfortable. you only get one large rather squishy square shaped pillow, we didn't ask for more but I assume you could have. We has a safe in our room which we could programme which was free of charge and the TV has a number of English speaking channels, BBC, ITV etc which are also complimentary. best of all was the wee fridge in the room. it enabled us to nip across to netto just up the street and buy some breakfast essentials as we didn't opt for breakfast at the hotel. Diet coke aka coke light is very expensive in Berlin! I got one from the kiosk at hotel reception and was charged 3 euros for the pleasure. However This was actually comparable in cost to plenty of other shops we saw in Berlin, even bottled water was on the expensive side compared to other countries in Europe I have visited. we nearly died one night when we went to the Irish bar and got charged 13 euros 20 for 1 bulmers and 1 gin and bitter lemon!!! it was quite hot and humid when we were there and doing a lot of walking about cold drinks were needed regularly! The customer service team were great at the hotel and nothing was a problem for them. The receptionists spoke English and were helpful giving us a map to help us get around. when we left to get back to the airport we got the bus from the stop on the square outside the front entrance no. 100 bus to freidrichstrasse and then we went to that station and caught the airport express from platform one. May I strongly recommend to anyone travelling to Berlin for a few days to visit Sachsenhausen in the town of oranienberg. It was something I felt I simply had to see. we took the number 100 bus to friedrichstrasse. got off walked up the street to friedrichstrasse station and got the s1 s-bahn train to oranienberg. then we did the 20 minute walk ( well signposted- or you can get the bus) to Sachsenhausen. you will need to leave I.D as a deposit for an audioguide (3 euros) and a map (0.50 cents) but you get this back when leaving. Also you have to make a reservation to visit the pergammon museum which I was disapointed by as I the didn't get to see it. Reichstag too has to be booked three days in advance. Berlin was a great city to visit and we happened to be there for the 50th anniversary commemoration of the building of the wall. This hotel I would definatley recommend as a good base to explore Berlin.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Perfect hotel to get the most out of Berlin”", "Author": "Adam Y", "ReviewID": "UR116868782", "Content": "Cannot recommend this hotel enough. The staff were extremely helpful and informative. The hotel itself is gorgeous, we got bumped up to a better room when we arrived and it was beautiful. Big beds, big bathroom, desk and table. The entertainment system is built into the TV with masses of channels and loads of UK channels. We ate in the bar and had room service once, food is good and moderately priced. The hotel is a short walk to a well connected underground station, get a day pass and you can travel anywhere across the city quickly and cheaply. There are a few nice places to eat very close to the hotel, just wander around and you will find plenty.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“It could have been good but there were too many buts..”", "Author": "Haim_1", "ReviewID": "UR116867534", "Content": "Let's start with the good things. The hotel is very clean and breakfest is very good and at a high quality. Now to what should be even more interesting, the bottom line is that I will never stay at this hotel again and I reccomand all couples to avoid it. When we arrived at the hotel at about 11:00 (after a sleepless night) we recieved a room (1516) that was suposed to be as we booked, double bed none-smoking. We were notofied that we got a 2 levels upgarade from classic to business room. BUT when we entered the room we discovered a twin bed. I went down to the front desk and the lady said that this is what they have at the moment and if we like she will move us to another room (1526) with a king-size double bed. She pronissed that House keeping will attend to it immidiatly, but it will take some time to clean. We went out for almost 3 hours. We came back at 14:30 BUT the room was not ready for us. We waited 20 monutes more got the key went into the room BUT it was a twin bed, once again. It was too much for us and after a while the lady in the front desk said that any booking is just a guest wish BUT they do not promise to fulfil it. I thanked her for giving us a room and not a sleeping bag in the garage and decided I'm not going to fight it any more. I didn't want to destroy my entier vacation for being mad at an idiot at reception. The room shot have been a high level (businees at a 4 star hotel) BUT the room amenties were limited to empty fidge that used to be a mini-bar, safe, TV, Air-conditioner, coffe making corner, and two soap dispencers in the bath room (they calim shampoo and soap is the same). BUT no shower cap, no shampoo, no hair conditionaer. They provide 4 towels (hands and shower) BUT the two larger ones are significantly smaller than what I know from many other hotels. Now to the upgrade - it must have been a joke and the joke is on me. The business room is much smaller than the clasic (look at the hotel web site) 24m2 instead of 36m2 and with a higher standard funitures.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“So much more than I expected...”", "Author": "clintonuws", "ReviewID": "UR116723303", "Content": "Ok... I see how some might judge this as a very \"typical hotel\" like any standard Hilton or similar. It is a very large hotel and seems to be used by a lot of tour groups and airlines for their staff for overnights. But... booking on a travel website, I only paid $77/night. Hotel is nice, clean, has a small gym, has saunas (didn't use that). It is right on the 100 bus line and about 3 blocks from one of the gay neighborhoods (but if you weren't gay, you'd never know). I booked the classic room and am pretty sure they upgraded me into a renovated room. It was so large that there was tons of room for all of our luggage (4 large bags). Only slight concern was that the tub is large and very smooth. Everytime I stepped out, I thought how easy it would be to slip and fall (and I'm a 42yo male). Hotel offers umbrellas for use for free when it rains.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Service": "4"}, "AuthorLocation": "expats", "Title": "“Not quite four star”", "Author": "qcentury", "ReviewID": "UR116482232", "Content": "The hotel lists itself as a four-star property, and first appearances go along with this. The central areas, lobby, and hotel bar are all very light and modern. But our room seemed stuffy and dated. Not terrible. But not a four star room, either. The main bed was just barely comfortable and the pull-out sofa bed was bad news indeed. Our kids tolerated it, but I would absolutely not ask an adult to sleep there. On the positive side, the staff were helpful and friendly, especially given they were handling a huge resident conference, and the location is very good - just steps away from a Number 100 bus stop, which takes a tourist just about anywhere she might want to go!", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Big but inspiring”", "Author": "Poul H", "ReviewID": "UR116266991", "Content": "Hotel Berlin Berlin is a rather big hotel, and if you pay the low rates you get the rooms in the end of the long corridors. However, dont fear that - the corridors are nicely decorated and even the rooms ain the end have the same high standard as any other og the rooms. The rooms have a good size - over avarage actually. It is very clean, and very nicely decorated and furnised. One big + is the welness/fitness center in the basement - it is really awsome. I think the hotel is properly quite expensive if you book directly, but because of the size you can often find cheap rooms on external hotel booking websites. This hotel location is exellent close to Nollendorf Platz with all the nice bars and restaurants.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Renfrewshire, Scotland", "Title": "“Nice modern hotel - I would return and recommend it to anyone visiting Berlin.”", "Author": "purplerose239", "ReviewID": "UR116216660", "Content": "The Hotel Berlin, Berlin is a huge, modern, hotel. My partner and I had a pleasant stay there and would be happy to return again someday. Location: The location is very good. It is situated about a 5-10 minute walk from the U Bahn and there are local bus services nearby. There are shops and restaurants within a short walking distance. The area feels safe when walking around at night. Staff: Professional, approachable and happy to help with any requests. Every staff member we dealt with was able to speak English. Room: I paid for a classic room but was given a superior room which was nice. The bed was comfortable but the pillows were too soft for my liking. We had a double bed but single duvets but it was fine that way. There was a TV, small refrigerator, 2 bedside tables, a phone, 2 chairs, a small table, a large mirrored wardrobe with coat hangers, shelves and a safe inside. It had carpeted flooring. The room was a good size and was well decorated. Inside the information booklet in the room it mentions complimentary internet for use in rooms and this was the case sometimes but other times we attempted to log on and it was asking we pay 15.95. So sometimes it worked, sometimes it didn't. We didn't require it very much to query it but I'm not sure what was going on with the Internet. Bathroom: The bathroom had tiled walls and floors with a bath/shower, a sink and a toilet. There is a large wall mirror and an attached magnifying mirror on the wall. There was a hairdryer in the bathroom and shaving sockets. The hotel provides a bottle of shampoo/soap/body wash combo on the wall in the shower and at the sink. Two hand towels and two bath towels were provided. The bathroom was very clean and the water was always hot when required with good water pressure in the shower. Restaurant: We did not use the hotel restaurant for breakfast or dinner. To be fair, I think asking for 21 euro per person is excessive, it doesn't matter how big and varied the breakfast is said to be; one can only eat so much in the morning! We couldn't justify 42 euro per day for our breakfast and instead it is possible to store milk in the refrigerator for cereal bought from a nearby store or visit a nearby cafe or pick up a pastry for 1 euro in the U Bahn station before heading out for the day. Similarly, the restaurant seemed expensive and this was off putting. In saying that, the restaurant menu did look nice and if you can afford it then feel free to ignore this bit. However, I would recommend the hotel bar meals which are slightly cheaper if you don't feel like leaving the hotel for dinner. Bar: The hotel bar serves drinks, meals and snacks. The staff were friendly. They have a good cocktail menu. Drinks are a little expensive but being a hotel bar that's probably to be expected. The bar was a nice place to sit for the evening when it was pouring with rain outside. When it is sunny there is an outdoor area which is nice to sit in when having a drink. The food was tasty here too. I cannot fault the services I used and overall I enjoyed my stay at the Hotel Berlin, Berlin and would be happy to return here in the future.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Excellent value”", "Author": "Ayr753", "ReviewID": "UR116098853", "Content": "Excellent value and very good rooms. Free wireless internet and very clean. Well served by the 100 bus into the Unter den linden and the 200 bus to the Ku'dam. The U-bahn is only a 5 minute walk.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Volos, Greece", "Title": "“A very good choice for a trip in Berlin”", "Author": "serserou", "ReviewID": "UR115952022", "Content": "I stayed there 4 nights with my spouse during a cold but romantic German winter. The hotel is huge as it covers an entire city block! The decoration to the public places is contemporary and at the rooms too. There is a renovated wing of the hotel but we didn’t saw it as we placed at the old one that was maybe medium but not bad at all. The breakfast at this hotel was by far the most various we’ve ever seen, even with a chef preparing live custom-made omelets. The hotel is not very close to the major sightseeing of Berlin but there is convenient connection through the nearby metro station. There are also some bars and restaurants in the surrounding area, pretty convenient for us. What I liked most in that hotel (besides the Guinness record breakfast) was the saunas in the health centre (that guests visit for free), essential for us after our walking tours in the cold city!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Israel", "Title": "“The hotel was very good, excellent location”", "Author": "zmirianc", "ReviewID": "UR115906774", "Content": "We took a business room without breakfast, the room was wonderful.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Grahamstown, South Africa", "Title": "“Good location, nice service”", "Author": "Chaim28", "ReviewID": "UR115901766", "Content": "The Hotel Berlin is in a good location, more or less in the middle of Berlin. I liked the German breakfast a lot, especially the coffee was very good. The staff were friendly and helpful. Room was clean and well sized. Bathtub and shower and quality amenities. Watch out for weekend specials.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“nice hotel centrally located bar very busy with conference business”", "Author": "Billybombshells", "ReviewID": "UR115648002", "Content": "Theres a Charge for WIFI use the computer located in lobby, also if breakfast is not included eat at a cafe locally for 5-10 euro as opposed to over 20 in hotel", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Very nice hotel, highly recommended!”", "Author": "dave1888", "ReviewID": "UR115525666", "Content": "We booked this hotel for 5 nights after the mostly positive reviews on tripadvisor. First impressions of the hotel were wonderful, the receptionist spoke very good English after realising our German wasnt too great! We paid for the most basic double room and as such were not expecting an awful lot for the price, but to our surprise the room was great! Very clean, flat screen TV, coffee table and furniture, and the fridge was a bonus too. The bathroom was fantastic too. I`m not sure if the balcony was designed for anything else other than housing an air conditioning unit, but it was pretty filthy and the door stayed firmly closed. We sadly did not use the fantastic looking eating facilities at the hotel, 21euro for breakfast was simply too expensive, and we much preferred to be out discovering the many Berlin eateries for lunch. The dining area did look wonderfully modern and the bar was pretty well stocked. The main appeal of this hotel was the location, it is very central but still a quiet enough area to go for late afternoon walks to Tiergarten, or the walk the other direction to the bustling Nollendorfplatz. The famous 100 bus stops less than a 1 minute walk from the hotel too. Public transport to every corner of Berlin is very easily reached from the hotel. The area felt very safe at night, though there were more than a few hookers in the area on our way back from the U-bahn each night, but hey, what city doesnt. Walking around the area at night felt very safe and relaxing, especially on a warm summer night! We checked out and got the U-bahn and S-bahn to Schonefeld airport in about 35 minutes, dont waste money on taxis in Berlin the public transport is superb! We would go back to this hotel in an instant as it was superb value for money!", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Not the best but certainly not the worst”", "Author": "AussieLawyer29", "ReviewID": "UR114174016", "Content": "I found this place after doing a search on Trip Advisor. It's within close proximity to well known sights and shopping. I am not so sure the hotel is 4 stars but it was quite reasonable. I was driving in Berlin and it was quite difficult for my GPS to pick up the location. The room was large and clean with a separate sofa and large television. The Kind Size bed was very comfortable. The bathroom wasn't large but then again it was not tiny. It is perfect if travelling solo or with a friend. I only had one night here. We ate in the restaurant downstairs. There was very little food to select from on the menu and the wine list was minimalistic (maybe $8-12 per glass) and even then it wasn't great. Service was so - so! Germans were not so friendly unless of course you head into the centre of Berlin and do some shopping. Here you will find most European brands but quite expensive.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Stow, Massachusetts", "Title": "“Clean, good value, good location”", "Author": "GlobeStomper", "ReviewID": "UR114059994", "Content": "The Hotel Berlin is in a good location and offers good value for the money. The staff were polite, but did not necessarily go out of their way to help. Our room was clean and overall the hotel worked well for our trip.", "Date": "June 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“Would probably stay here again”", "Author": "MindyG1981", "ReviewID": "UR110035743", "Content": "Nice hotel, Okay location - not too close to subway though. Nothing much in surrounding area. Overall good experience at this hotel but may or may not stay here again.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Madianh, Saudi Arabai", "Title": "“I'll come back to this hotel”", "Author": "koko_waki", "ReviewID": "UR109973705", "Content": "Hotel Berlin was highly recommended by my brother who stayed twice at the hotel. Actually, the location and the services are very good. The breakfast is various and very good quality. The rooms are very clean & very modern, and there are a number of Arabic tv channels. The only thing I didn't like was the business room to which I was upgraded the day I arrived. An upgrade means a better place and a higher level, but for r me, the superior room is a much better choice than the business room which was not up to my expectations. To sum up, the hotel is an excellent choice for visitors of Berlin.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“The price, location, cleanliness cannot be beat!”", "Author": "SMHDumbo", "ReviewID": "UR108805351", "Content": "I stayed at the nice, clean, modern Hotel Berlin for two nights in early May 2011 with my Mum; we had separate rooms on the 6th floor, facing the courtyard. Both rooms were very quiet, spacious, modern and clean. The hotel itself is a 5-7 minute walk from the U Bahn station Nollendorfplatz, which is very handy, as the Berlin U/S Bahn system is excellent (cheap, clean & frequent service). Also, it’s a 15-20 minute walk to Kurfurstendam, KaDeWe and the main shopping area. If you’re a “walker” you can get to almost anywhere in Berlin from Hotel Berlin, we found it very conveniently located! The service was hit and miss, but overall good. My Mum requested a different type of pillows and duvet for the second night (allergies) and the cleaners supplied these with no fuss. The guy helping us with the internet went out of his way to help us delete our browsing history. The reception staff weren’t super friendly, but I suppose at a 700-room hotel that’s to be expected. With two notable exceptions, they were all polite and reasonably helpful. I was shocked, however, when on check out I asked whether they had deducted anything from my credit card (we had paid in advance and I had read reviews on here saying you should be vigilant) and they said no and that they would “release” the sum the had “reserved” the same day. I asked for clarification and somehow they reserve a sum on your credit card for extras etc, but they don’t ask you for permission to do that in advance. When I pointed out that asking in advance would probably be a good thing, the man in reception just stared blankly at me. I was so gobsmacked I didn’t even ask how much they had reserved. I have never before encountered this at a hotel (and I have travelled a fair bit) and found it very strange and quite discomforting. In the end, Hotel Berlin did not deduct anything from my credit card, though. They do charge you for every little extra (breakfast, internet …), but as long as you’re aware of that, I reckon it’s alright, given the price, location, cleanliness & location of the hotel. Breakfast was €21 and we just could not bring ourselves to pay that, so we brought in some brekkie and stored yoghurt in the fridge in the room. All in all, I would strongly recommend it, but I do wish they would ask before “reserving” any sums. :) Liked the most: the location and the clean rooms. Liked the least: “reserving” a sum on my credit card and not telling me!", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location and friendly staff”", "Author": "NaomiBu", "ReviewID": "UR106783389", "Content": "Just a 2 minute walk from the nearest U-Bahn and with a good number of restaurants and small eateries in the area, make this hotel a great base point for any stay in Berlin. Only down side is breakfast is not included in the cost of the room. To avail of Breakfast it is €21 for the buffet. So can't comment on the food at this as did not eat there. Did avail of room service on the first night, good food promptly served. Mini bar is empty in your room with all drinks and snacks available at the front desk. For me this was perfect - it meant no high mini bar costs and I could use the fridge for the drinks & snacks I bought in the local shops. Overall great rooms, friendly staff and great location.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "LONDON", "Title": "“Great value for money”", "Author": "focus63", "ReviewID": "UR101894655", "Content": "Contemporary and comfortable hotel that I would recommend to anyone traveling to Berlin. The bar is modern, vibrant with multitude of colours which creates a fantastic atmosphere in the evening, yet refreshing and welcoming during the day, ideal for work or meetings. Breakfast is amazing even though it sounds pricy at first.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Modern clean...just slightly outside city centre.”", "Author": "RLJlovestravelling", "ReviewID": "UR99965471", "Content": "Good hotel. Clean & well equipped rooms. Breakfast nice & most staff helPful & friendly bar a few receptionists. Would return to this hotel if visiting Berlin again.", "Date": "March 13, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Very pleasant and nice, nothing special”", "Author": "Neko71", "ReviewID": "UR94253207", "Content": "Title says it all. Hotel staff was courteous and the accommodations nice.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Norfolk", "Title": "“Very pleasant”", "Author": "rmdbfn", "ReviewID": "UR91752679", "Content": "Highly recommended. We stayed in a classic room which was very spacious, hotel staff were helpful, rooms were clean, secure basement parking, breakfast is substantial but is costly if you don't purchase it alongside your room booking. Hotel is in an ideal location for exploring both east and west Berlin. We would definitely return here.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good hotel at a good price”", "Author": "ImAlwaysOnHoliday", "ReviewID": "UR90379816", "Content": "We chose this hotel because of the price. It seemed modern, recently renovated, good transport links, and most importantly... breakfast included. When we arrived, we went to our room, but it was two single beds joined together, and a bit dingy. We phoned down to reception to ask for a proper double room, and were offered the opportunity to upgrade our room for €10 euros more per night. We did this and were glas we did, since the room we then got was recently refurbed, and very nice. There is a bus station right outside the hotel, which is straight to either Alexander Platz or Zoo Gardens. The bus is really easy to use, since there is a little flashing board which tells you which station is coming up, and it is also announced. There is also a Metro station roudn the corner, so that was really convenient. The reception staff are excellent at telling you which buses to catch and where to change to help you plan out your day. Also if anyone is going for a weekend in November or December, you can buy a single ticket which will work all day on the transport system. No need for a travel card. Also, don't forget to validate tickets as there are plain clothed police officers around. So back to the hotel - breakfast was a large selection which was nice. The staff at Breakfast were a bit abrupt but I think that's just their way. Big buffet selection, you can have your eggs freshly made. There were cereals, breads, continental meats, cakes, cooked breakfast, fruits, yogurts, all different coffees and teas (e.g. lattes, hot chocolate etc). Maid service was good too. Room always looked very nice. When booking here, obviously be aware that you aren't right in the centre, so you will have to use the public transport. That said, if you don't mind being on the bus for 5-10 minutes to get somewhere, then its not a problem at all. Very reasonable hotel, for an even more reasonable price. Just make sure you get put in a newly renovated room.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bermuda", "Title": "“Nice Hotel with Terrific Breakfast”", "Author": "morfish", "ReviewID": "UR87898933", "Content": "We arrived early (11.30am) after a long flight and our standard room wasn't ready. We were able to upgrade to a superior room for 10 euros per night and were able to access the room immediately. The room was clean, modern and attractive and included a flat-screen TV. The open plan bar in the lobby area was very nice. Dinner in the Julius Restaurant was quite good. The buffet breakfast was terrific with a very wide selection that should suit everyone. There isn't much in the immediate area of the hotel but the shopping district of Kurfurstendamm is within easy walking distance for a wide selection of shops, restaurants and bars. Also, the hop-on-hop-off tourist buses all stop across the street from the hotel, making it a very convenient location for easy access to sightseeing trips. Internet was only available free for 30 minutes per day, otherwise it cost 15 euros per 24 hours access. The only other negative was the maid failed to refil the liquid soap dispenser and the tissues. We enjoyed our stay and would certainly stay here again.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Moreton-in-Marsh, United Kingdom", "Title": "“Return to an old favourite”", "Author": "Tosca1962", "ReviewID": "UR87620280", "Content": "I have stayed here on a number of occasions. The hotel always seems to be evolving and has undergone quite a revamp since my last visit. There is a choice of rooms. I chose a \"Classic\". Rooms are fresh, clean and spacious. I particularly loved the fact that there were so many mirrors in the room....floor-to-ceiling double-fronted sliding wardrobe doors, half a wall in the bathroom and a full-length mirror by the door. Great for when you're getting ready to go out! There's a good size seating area and a desk and chair with a flat-screen TV incorporating a good choice of channels. There's also a free-standing air conditioning unit and tea/coffee making facility. The minibar, however, no longer exists as the hotel now has a \"grab & go\" section in reception where you can purchase drinks and snacks to take to your room. The lobby / bar area is now much brighter than before and all the staff greet you as you walk around the hotel. Check-in and check-out was simple and if you arrive too early for initial check-in (3pm) they will gladly store your bag for you if you want to go off exploring without having to lug your suitcase around with you. There is a taxi rank outside the hotel, but a majority of the sights are within easy walking distance in any direction. Taxi to/from the airport will set you back around Euro 25-35.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Worcester, England", "Title": "“Lovely hotel, quiet area but convenient bus route”", "Author": "laura_blonde", "ReviewID": "UR87203323", "Content": "Hotel was very clean, staff very helpful and in a nice location. One convenient and frequent bus into all the sights, but far enough away to be out of the bustle. Very much enjoyed our stay - only disadvantage was the very expensive internet. (For those of you who have iPass, it doesn't work in the hotel).", "Date": "November 15, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“welcoming, clean and friendly”", "Author": "RefreshinglyFrank", "ReviewID": "UR87001638", "Content": "This was my second weeklong stay in Berlin Berlin and this year was much better than I rember last year. The showers were hot and strong, there was a daily fruit and water delivery, the gym was perfectly clean and well maintained. Housekeeping was a little variable day to day, but generally excellent. The front desk staff and management were helpful and the bus staff always seemed happy and helpful. I like that they have removed the standard mini-bar contents (available in the lobby) but kept the fridge in the room. I love the breakfast at this hotel, and since I am usually attending a conference, it's nice to have the ability to have a healthy and hearty meal to start the day, since I never know when I may get my next one. The location is central, but not too convenient to any one area, but in Berlin the location is always a bit of a compromise for one thing or another you might want to do.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Norway", "Title": "“Big hotel, away from attractions...”", "Author": "TheChadi", "ReviewID": "UR86913738", "Content": "The hotel is very clean, has very pleasant staff and has modern rooms all over. Getting from the lobby to my room is like walking around the whole block, that's how big it was! It isn't something you really appreciate when you are in a hurry but I can understand that's the way it is. The hotel is no close to any attractions and the closest public transportation metro (u-bahn) is a mere 5 minutes walk from the hotel. From there you can get to just about anywhere you want within the city. Overall, the hotel is very good.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Excellent hotel, with client-friendly staff, nicely appointed rooms and outstanding breakfast to make your stay special”", "Author": "ahermosilla", "ReviewID": "UR83432725", "Content": "A very nice hotel for both business and leisure. The staff were very friendly and made us feel at home from the beginning. Breakfast was outstanding. A good location to move about the city. Can only be recommended highly for its superb value-for-money.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Top Hotel in Top Location with overpriced Internet”", "Author": "OskarMadison", "ReviewID": "UR83056562", "Content": "The Hotel's location is perfect. Situated across from a small park and surrounded by mostly residential buildings it is in a quite area. In front of it is a taxi stand or you can walk in 5 minutes to either subway station Nollendorfplatz or Wittenbergplatz where the famous KA DE WE shop is located. Check in was a breeze with plenty of personnel around and in less than 5 minutes we were in our spacious room We stayed in a junior suite which is spacious enough to have guests if you don't want to meet in the Hotel Bar. The sofa bed comes in handy if you travel with kids, which we did at a previous stay. The bathroom is large, well lit and separate from the toilet which, along with a hand basin, is in a separate room. Nice. The bathtub is great if you like baths, but, because of its sculpted and uneven bottom not ideal for showers. Be careful not to slip! Our only real complaint is the fact that the hotel no longer offers free internet. On our previous stay I maintained contact with my company and friends via wireless internet. This service is now only available for 15.95 Euro per day. It is coupled with some TV channel package for which I have no use, because I'm not in Berlin to seek TV entertainment. I hope they will have changed that policy before I plan my next trip to that great city because I don't want to look for another first class hotel that doesn't charge me for something that ought to be offered for free.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Zurich", "Title": "“Good for Business Trip of a few days”", "Author": "Bul", "ReviewID": "UR80934675", "Content": "during a business Trip I expect very simple things: good breakfast, spacious bar for talks, central location , helpfull speedy personal , a quiet room and fair price. All of these were ok except for smelly room and very high Room rate. Next Time i will try another hotel.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Good hospitality,great service and kindness,EXCELLENT BREAKFAST!!! :-)”", "Author": "fantkorakla", "ReviewID": "UR80716237", "Content": "A hotel near to sights,basic places and easy to find!I'm satisfied,I'll be there soon again!!!Maybe in Christamas,but it's for sure!I'll never forget the elegance,hospitality,great staff and service!I strongly recommend it...", "Date": "September 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“Good hotel for a city break in berlin”", "Author": "RJ777", "ReviewID": "UR80475006", "Content": "I booked this hotel through an easyjet package, with flight and hotel included, so got a good rate for the hotel. We stayed at hotel Berlin for 6 nights. On Arrival the staff were friendly, and we were allowed to check in as 12:00 even though check in isnt usually until 15:00. The foyer was always very busy when we went through so didnt really ask the staff many questions, but on the couple of occasions we dealt with them they were pleasent and spoke english well. I cannot comment on the breakfast facilities (as we didnt book breakfast with the hotel), or the gym/sauna facilities-as I didnt use these. Location: Was about 5 mins walk away from a underground station, where you can get to all the main stations! I didnt use the busses but there is a bus stop outside too. If you dont mind a walk it wasnt far to walk from the hotel to brandenburg gate etc, that took about half an hour through the Tiergarten. There is a few restuarants around the area, a Steak restuarant and an Italian, which are withing about 10mins walk. Not that many bars though. Our room was at the back of the hotel looking over the car park so wasnt too noisy. The Room: We had a double standard room, it was very spacious with a sofa, table and 2 chairs, there was a nice bathroom and the shower was powerful. There was also a small fridge (we kept beer and orange juice in it), and a nice flatscreen TV - my only complaint would be that only ITV was working out of the UK channels, not BBC1 and BBC2, even though they show on there. The rooms were tidied daily and the coffee restocked. Overall I liked the location of the hotel even though it isnt in the most lively location - if you want to be in the midst of all the nightlife then this hotel probably isnt for you - but this wasnt a problem due to the transport links near the hotel, which were very good. I liked the room it was a good size and kept very clean.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frankfurt", "Title": "“good location, nice room, great breakfast”", "Author": "arnsch", "ReviewID": "UR79762313", "Content": "This hotel is huge ! With this comes a great level of efficiency and service. Located in walking distance to a subway station and next to a bus stop (convenient line 100 which passes by lots of sightseeing points), the hotel occupies a whole bock. It's easy to get lost in the hotel due to the size. The room as very clean, flatscreen TV, nice bathroom. Even though the room faced a buisy street, noice was okay on the 6th floor. Breakfast was very good with lots of choice, hot&warm, German rolls and fresh orange juice. Only negative point: no swimming pool.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Austin, Texas", "Title": "“Just OK”", "Author": "Njoytravl", "ReviewID": "UR73049634", "Content": "Hotel Berlin Berlin was OK, but not one of my favorite of the 5 hotels we stayed in across Europe. It was big and impersonal, although the desk staff was helpful. The wait staff at the bar in the evenings was polite, but overly busy. The wi-fi cost money per day (sorry, can't remember how much, maybe about $10-12 American dollars per day). The rooms were OK and clean enough. About a block from the hotel there were prostitutes walking the street in the evenings.", "Date": "July 30, 2010"}, {"Ratings": {"Overall": "2.0", "Value": "1"}, "AuthorLocation": "Ottawa, Canada", "Title": "“careful... or they'll rip you off”", "Author": "disneyfan13", "ReviewID": "UR72188581", "Content": "Okay, the hotel itself is not bad and in a good neighborhood -- close to shopping in the Western core. But, the staff is another question all together... I found the restaurant and front desk staff to be unhelpful and rude. Then, when I was checking out (at 6 a.m.) they tried to charge me for two days of internet access at 16 euros a day. I explained that I only used the internet once and after a long discussion (which started with the guy at the desk calling me a liar), they agreed to only charge me for one day's use. Then, of course, when I got home and checked my amex statement they had gone ahead and charged my account separately for a second day. Weasels just wanted to be rid of me but had no intent of rectifying this situation. I've heard others complain about similar things happening there.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good solid 4+ star hotel”", "Author": "franichc", "ReviewID": "UR71889294", "Content": "This hotel had everything you would expect out of a 4 star hotel. Some of the features were worthy of a 5 star. All staff had great english and were very polite. The breakfast (although pricey) was very good. The room itself was again what you would expect out of this level of hotel. The lobby and bar area are very nice and was a nice place to sit and have a drink. The location is a little out of the centre but still close enough not to be a nuisance so I think you get a good price on the back of this. This hotel is a perfect example of a 4+ star hotel. cheers chris", "Date": "July 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bangalore", "Title": "“Okay Hotel, Could be better”", "Author": "ruddi91", "ReviewID": "UR68952113", "Content": "Clean, Not much value for Money thogh flexible, ZERO frills", "Date": "June 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great value, clean, modern, good location”", "Author": "aj_sw9", "ReviewID": "UR68718677", "Content": "We stayed for 3 nights over the busy Berlin Pride (CSD) weekend. Despite a full house - they have nearly 500 rooms - the hotel never felt crowded or chaotic. The rooms were very clean and well finished. The service in the bar was a little slow, but that seemed to be common just about everywhere we went in Berlin making me think it was us, not them, who are impatient! The saunas and fitness area in the basement were immaculate. The hotel is a 4-5 minute walk from Nollendorf Platz U-Bahn and about 5-10 mins walk from the Ku'damm shopping strip. The wifi charges are a bit extreme (€15.95 for 24 hours) but you get 30 mins free to trial the service when you first log in. Oh, and the hop-on-hop-off tourist bus stops right out the front too.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Limerick, Ireland", "Title": "“Highly Recommend”", "Author": "TrOm_10", "ReviewID": "UR67763621", "Content": "Hotel was lovely and clean. Staff have excellent english and very helpful. Breakfast while expensive was excelelnt - all you can eat buffet, with great selection of food. Hotel is also near Underground and bus service. Very easy to get into central Berlin and visit tourist attractions.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Luxembourg", "Title": "“excellent value if you are looking for a comfortable & functional place”", "Author": "steven888", "ReviewID": "UR65371180", "Content": "Its not an exciting hotel but seriously good value for money. booked a junior suite which was fantasic considering the 110 euro price tag. everything super clean and decently decorated. staff is very helpful and nice.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Chicago", "Title": "“great hotel and atmosphere, a bit out of the way”", "Author": "fgcheng", "ReviewID": "UR65334105", "Content": "We really enjoyed our stay at Hotel Berlin Berlin. The lobby is quite modern and impressive, and the rooms are very comfortable. We needed a third bed, and they were very accommodating with this request. The bathrooms are great and the room decor pleasant. There is not much of a view from the rooms. It is located in a quieter part of the city, which could become problematic if you are walking home late at night. Otherwise, it is accessible to public transportation.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lille", "Title": "“great hotel”", "Author": "SebNY", "ReviewID": "UR59437277", "Content": "The hotel is very modern in the lobby and restaurant. Our room was large and very clean. The beds were comfy also. The rooms were decorated in a 80s style in blue and rose, but it didn't bother me that much because it was clean and large and also quiet!!! The breakfast was delicious. It was a huge american -style buffet and they even had someone making made-to-order omlettes. Everyone was very friendly within the hotel as well. We would definitely reccommed this hotel and go back again.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Large business hotel - good for business but nothing else”", "Author": "ViaggiaBene", "ReviewID": "UR58830248", "Content": "I stayed at Berlin Berlin for 4 nights with a group of collagues. It is a very large and modern business / conference hotel with good facilities, a very good breakfast, a smallish gym and great conference space. The decor is vaguely 70ish with some truly tacky and awful details, service is good but impersonal as per any other hotel of this size and rooms are good sized but with very poor room amenities (for a four stars). Hotel location is good for business, not that good for sightseeing or nightlife as it is in a mostly business, modern and soulless area of the city. It was good for us as we were on a very busy business trip but I would not stay there on leisure (especially at those prices)", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "high wycombe bucks", "Title": "“Spacious room and very friedly staff”", "Author": "MJBHighWycombeBucks", "ReviewID": "UR58571716", "Content": "The recommendations for this hotel were not misplaced. We've just returned from an excellent stay in a classic room there which was at least twice as large as any we've stayed in before.It was quiet and nicely furnished. The staff couldn't have been more helpful, for example they advised us not to buy the highly advertised Berlin Card but instead, as there four of us, to take a Klein Gruppenkarte which at e 16.10 for up to five people gives unlimited travel for a day in zones ab&c.They told us where to eat eg Wirtshaus zum Lowenstein near Zoologisches Garten Bahnhof or Zum Nussbaum, a real German Stube in the Nikolai Viertel a short walk down from Alexander Platz. They also stored our luggage safely on our final day till we had to catch the 19.41 train to the airport. Just outside the hotel there's a bus stop for the 100 which takes you to all the key places. It may be a large hotel but we rated it highly.", "Date": "March 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Awesome hotel, clinic like cleanliness, Friendly and helpful staff +15Euro per day for Internet sucks”", "Author": "ribmate", "ReviewID": "UR57239117", "Content": "Breakfast was awesome, Staff friendly and helpful, located close to Einstein Cafe its awesome too, train station two blocks away, cabs out front 24 hours a day, easy walk to the main shopping attractions and Wilhelm Church, Foosball table in lobby, Bar quiet and calm, gym top notch, Rooms are small (typical euro) but extremely adequate, $18E cab from Airport, $8E to Sony center and Berlin wall - seriously I with 25 plus years hospitality and hotel management experience thought it was one of my better hotel stays. Only downside was 15Euro a day for internet - there were Computers in lobby and you could pay to use them.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A very comforable and efficient hotel”", "Author": "London_Dirk", "ReviewID": "UR56141955", "Content": "We enjoyed a short break at the Berlin Berlin. The hotel is located a short distance from the U-Bahn at Nollendorf Platz and there is a No100 bus that takes into the town centre and all the sights. The staff were all very friendly and spoke perfect English. Our room was larger than expected and had English TV. The breakfast was superb and catered for all tastes. I would not hesitate in booking this hotel again.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“Definitely a Berlin, Berlin experience”", "Author": "yaph02", "ReviewID": "UR52904488", "Content": "Hotel Berlin, Berlin has a good location - with the metro station a 5 minute walk and a bus service 100 connecting you to the main attraction sites such as Unten den Linden, the Brandenburg Gate, Reichstag several 100m away from its' main entrance. While walking to the metro station, you come across many restaurants, cafes as well as supermarkets which is pretty neat as well. My partner and I had an early flight and arrived early, and the staff was willing to check us in early with no hassle. Staff service was always professional and efficient here! My only complaint would be that breakfast - at 19 euros - was rather costly.", "Date": "January 8, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Comfortable break in pleasant square”", "Author": "johnrath", "ReviewID": "UR52321204", "Content": "I enjoyed a comfortable stay here and also benefited from a good rate I obtained. The hotel is in a pleasant location, perhaps 20 minutes walk from Zoo station, but as I found out later in a heavy rainstorm, links directly by bus with Unter den Linden and other useful destinations. My twin musts of gym and internet access were met OK, although internet was on the expensive side. There's quite a classy bar nearby in Lutzowplatz, again slightly expensive, but cheaper places can be found in the direction of the Zoo and Ku'damm. (I can manage a 2-litre glass of beer fairly comfortably and economically!) TheEnglish TV channels were appreciated after I had experienced a day full of culture, physical effort, and eating and drinking. The staff were friendly and spoke excellent English, but things could get very hectic in reception.", "Date": "January 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Ston Easton", "Title": "“Comfortable!”", "Author": "Suegozza", "ReviewID": "UR51518466", "Content": "We stayed here for a weekend of sightseeing and Christmas markets. The hotel is in a good location and not far from the U bahn. The hotel is huge but there were plenty of staff on reception so checking in and out was fairly quick. The room was very comfortable with tea and coffee making facilities Our only word of warning about this hotel would be about the bar prices! Overall very good value for money", "Date": "December 19, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Belfast", "Title": "“Not the ideal honeymoon choice!”", "Author": "Evil_villain", "ReviewID": "UR51001563", "Content": "My new husband and I chose this hotel as a \"minimoon\" destination, choosing to postpone our proper honeymoon until the summer. The room we had cost £280 for 4 nights and the rating given online was 4* plus. We thought we were getting a fabulous deal! The hotel lobby is decorated in what I would call \"70s chic\" but to me it was very tacky! The room was the smallest hotel room I have ever stayed in and although we booked a double room we had 2 single beds pushed together. There was no safe in the room, no minibar, no complimentary toiletries and although the hotel literature said they had a linen service every other day the bed linen was not changed in our room the whole time we were there! Also the hotel corridors stank of stale smoke and we had problems sleeping because there were pigeons nesting on our balcony! That said, the location of the hotel is amazing! It was very near one of the biggest Christmas markets and within walking distance to all the major sites, transport links and the tourist bus stops right outside! Also the buffet breakfast was absolutely fantastic with a large selection of tastes catered for. The staff in the hotel were among the friendliest and most helpful I have ever come across and had the rooms been to a better standard this would have been a fantastic hotel!", "Date": "December 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Paris", "Title": "“good location but cheap services in-room”", "Author": "darthone", "ReviewID": "UR49820547", "Content": "Hotel is pretty well located, a taxi station stands near the hotel and you can reach the U2 subway line in 5 min. I stayed 3 nights for business from nov 19th to nov 22th 2009 in a superior room and unfortunaltely we got a lot of troubles : > Shower was broken alternatively cold and hot every 10 seconds > 95% of the french TV channels were freezing all the time > Room window was stuck, it was impossible to open it and get fresh air (problem was fixed during day 2) > Internet Wi-Fi Access was broken since day 2 and never fixed up We asked twice for a room change or a discount without any success. I hope these remarks will help improving the quality of service Cheers Jonathan", "Date": "November 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Good, but...”", "Author": "love2travelDallas_TX", "ReviewID": "UR49573540", "Content": "The hotel was nice, however the location could be better. There aren't a lot of places directly around the hotel to eat/drink. However, the rooms were clean and large. It is a very busy hotel - lots of conventions etc. going on. The breakfast buffet is incredibly expensive, which is odd, as in Europe breakfast is usually included.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Redmond, WA", "Title": "“Rude Front Desk, Uncomfortable Beds”", "Author": "mrsmaryallen", "ReviewID": "UR49573447", "Content": "After travelling all day with a 1.5 year old, we arrived at the Hotel Berlin. It is a funky hotel - lets just saw if there was a flamingo roaming around, it wouldnt be out of place. We went to the front desk at 11:30am and asked to check in early. The woman assisting us turned to a man (manager?) and asked in German if we could check in early as there were rooms available. He said 'no - I already let a few other people check in early and these people should check in on time.' They obviously didnt think that we could understand and they would not budge. We finally offered to pay an extra night or upgrade the room because the thought of spending 4 hours more with our daughter and no where to decompress was too much to imagine! Our 'upgraded room' was small but I expected it would be since we were in Europe. The problem was there was no storage space or drawers. We had a bunch of bags since we were working for 1 week and vacationing for a week and a half afterward. The beds were two twin beds pushed together. Again, I expected this but the beds kept splitting apart. Finally, I was with a group that got free breakfast. I registered through a different system but was with the same group that rented hundreds of rooms for a week. When I asked about possibly having them remove my breakfast charges given that I was with the group, they said no. I understand I registered through a different system, but clearly it wouldnt have been a big deal since they were letting people in free all week just for wearing the company shirt or being with someone wearing a company shirt. I do want to note that the breakfast was great. Not sure it was worth 19 Euros, but it may have been :) If this were 100E a night and included breakfast, then it would be worth it. Otherwise, I'd recommend staying closer to the Zoologicher Garten as that was a very central location.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Medellín, Colombia", "Title": "“Good Hotel, the worst Internet Connection!”", "Author": "ColombiaJuanSe", "ReviewID": "UR48935893", "Content": "This hotel is really good overall! Being a four star, I consider it quite good for its price and the spacious rooms they offer. I's say its location is extremely convenient (Bus 100 across the park in fron of the hotel, which takes you everywhere), very nice room features, international standards, good variety of TV options, Spa and Gym, Sauna, Good restaurant, delicious breakfast (though not included in the rate), EXCELLET FOR CONGRESS or business trips, BUT... The room's intenet connection is a total shame! Since I spent most of the time at a congress at the Intercontinental Hotel nearby, I only used the internet connection a few times at night. The first days, I didn't bother trying it, since it didn't work properly (very poor signal in the room). Unfortunately, the last night I stayed there, when I really needed the Internet to work, it's signal was almost none. I had to work in the small hallway in front of the elevators (there's a sofa there) but it was very uncomfortable. Their staff didn't help at all and told me I had to wait till next morning. The only good thing was they didn't charge for it (Obviously!) but if you need internet, check before going if this issue has been solved! Otherwise, great location and value for its rates!", "Date": "November 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Thessaloniki", "Title": "“Excellent Service”", "Author": "spanougakis", "ReviewID": "UR47595692", "Content": "Highly recommended, very close to the city center, next to metro and bus station. Free wireless internet in the room.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Idaho Falls, Idaho", "Title": "“Phenomenal Service”", "Author": "Souperher0", "ReviewID": "UR46788878", "Content": "This hostel was excellent. The location is just off the train, so it's easy to get around. Moreover, there are plenty of great bakeries and a grocery store nearby. The neighborhood, while not great, isn't bad. The hotel itself was wonderful. We stayed in a private room, and it was large and clean. The staff was the best, though. They were always helpful and answered any of our questions. More than that, they helped us with a map and information upon arrival, knew taxi amounts, etc. It was the best place for service--like in house travel agents. Breakfast was great and hotel has internet.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Great introduction to Berlin for the first time”", "Author": "Venezia41", "ReviewID": "UR46623307", "Content": "I apologise for my late comments re my stay at the Hotel Berlin, Berlin for 3 nights, 29 to 31 January this year, due to my whole life changing after being retrenched when I returned to work after my vacation. Hotel Berlin is situated in an easily accessible area about one-third the bus journey to/ from Bahnhof Zoologischer/Alexanderplatz. It is a large hotel, surrounding a ‘block’ with a very large “internal open area” for a ‘Winter Garden” and various other administrative and/or functional sections of the hotel. I was allocated an upper floor room overlooking that area’, which provided lots of day light, most needed in February. The room was large and well decorated with a lounge area plus a ‘huge’ closet, minibar and the usual 4-star hotel inclusions. My dinner in the hotel for the first two nights was excellent and a very personable maitre‘d assisted me re wine selection. The buffet breakfast (incl. in the room rate) was “stunning” and consisted of a wide range of juices, cereals, fruits, breads, cold selections (meats and cheeses) as well as hot, i.e. scrambled egg, bacon, tomatoes, etc. The selection of ‘anything and everything’ was amazing. I loved every ‘mouth-watering’ moment! My last night at Hotel Berlin, I ate at an Italian Restaurant, “Sorriso Ristorante”, close by the hotel at 76 Kurfurstenstrasse, which was perfect and made even more so by a delightful waiter. The restaurant is a very comfortable, atmospheric Italian gastronomical experience. I loved every mouthful of my main course of Vitello Romani followed by “Dolci” with my waiter suggesting I have ‘half & half’ of my two favourite sweets. My whole meal was a ‘magical” experience and one I will never forget. I recommend this hotel in relation to its very helpful staff, its access to good transport connections, i.e. bus to/from the airport and proximity to Zoologischer Bahnhoff for S and U Bahn as well as Charlottenburg, etc.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Topeka, KS", "Title": "“Nice updated hotel near the heart of Berlin”", "Author": "martyoz", "ReviewID": "UR45740335", "Content": "Our room was very clean and modern. The hotel provides a full array of amenities and would be a great business hotel, though we were on a pleasure trip. They had a nice gym setup. The only drawback was the small lobby, which was jammed with business conference attendees the days we were there. We were located only 2 blocks or so from a metro stop, so getting around was a breeze. The opposite direction the Tiergarten is a 15 minute walk, and a variety of dining opportunities were available within a 6 block walk to the west. Not much happening in the immediate surrounding blocks, but it appeared construction is underway on some new businesses. We got a breakfast buffet with the room rate. It was a great value! One shortcoming was the \"American breakfast,\" advertised as including scrambled eggs and sausage. In fact, the \"scrambled eggs\" were a custard-like concoction and the ground sausage tasted like saute'd liverwurst. Still, the German and Continental offerings were great, and the breakfast added a lot of value to our room.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Wonderful hotel, great location.”", "Author": "taylorjames", "ReviewID": "UR39774464", "Content": "Anyone who wants to spoil themselves without breaking the bank, should stay in Hotel Berlin. Myself and my wife stayed here for three days in September 2009 and were bowled over by the huge, spotless room, the great food and the price. The staff care centre caters for your every need and all staff were friendly and helpful, and you are a two minute walk away from bus stops that will bring you to all parts of this great city. The rooms have air conditioning, are soundproofed and the beds are extremely comfortable. This was the first hotel built in Berlin after the end of the second world war and has been totally renovated to fully deserve its four star rating. We will visit Berlin again and will definitely stay in this great hotel.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "san diego", "Title": "“Hotel Berlin - Not for anyone over 40”", "Author": "jujuberry", "ReviewID": "UR39685666", "Content": "Stayed here several years ago. At the time an older, cosy, friendly hotel with a pub and reasonably priced food and drink. Since then the old hotel has been apparently torn down and replaced with a 'faux chic' design. Rooms are large and well appointed. No central heating or cooling. The halls are oppressively warm. Bathroom fittings are already falling apart (cheap), carpet stained, etc. Staff are just this side of surly. Average guest age appears to be thirty or less. If you are not German, expect to be treated less than cordially. Restaurant is extremely expensive with limited choices. Staff are not friendly. I will never stay here again.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "leicester", "Title": "“Absolutely brilliant hotel- couldn't have asked for better”", "Author": "LeicesterLouise", "ReviewID": "UR38522019", "Content": "My boyfriend and I went to berlin as a pre-christmas break, as we had been told that the markets were some of the best in europe. We chose this hotel on a whim as it was the cheapest, and we agreed that we didn't mind roughing it! However, our room was absolutely huge and the bathroom was a good size as well. I have already recommended this hotel to my parents, who are going to book this hotel for their christmas break this year. All of the staff are really friendly and when I came back in a fit of excitement becuase he had just proposed they offered us a celebratory drink on the house! I really don't have a bad word to say about this hotel. Even the bar prices were quite reasonable (especially when compared to our capital city!) Definately stay here, its a bargain and central to everything (took us 10+ mins to walk to all the tourist attractions) also, the local taxis are SO cheap so if you don't want to walk step outside the hotel and there is a taxi rank right outside.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Aberdeen", "Title": "“Funky hotel - good base.”", "Author": "Gill46Aberdeen", "ReviewID": "UR37455736", "Content": "We stayed in this hotel for 3 nights in July. We had read reviews saying reception staff weren't always very friendly and, although we woudn't entirely agree with this, they definately didn't go out of there way to do more than they had to But, they helped us where we needed it and were always efficient. The bar and waiting staff, however, couldn't have been nicer. The hotel itself is within a reasonable 10 or 15 minute walk of most things and we found it to be a good base. The hotel has some amazing design features inside, and was very young and modern. Rooms were big enough (although there only seem to be twin beds, and not doubles) and the buffet breakfast is great and kept us going all day. The gym was particulary good and modern for a hotel gym. Overall, I would recommend this hotel and would stay there again if we were in Berlin in the future.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“We'll be coming back!”", "Author": "ingeborgv", "ReviewID": "UR36671070", "Content": "Enjoyed a six night stay at Hotel Berlin, Berlin. Nice location in a not too busy neighborhood, within walking distance both to Potsdamer Platz/Brandenburger Tor and the sights of West Berlin (KaDeWe, Kurfurstendamm etc.) Nice, large room which the staff kept spotless throughout our stay. Friendly, English speaking staff, good drinks in the lobby bar (though pricier than most of Germany). Great deals on rooms during off-season. We'll be coming back!", "Date": "August 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Nice hotel with good location”", "Author": "EBlakstad", "ReviewID": "UR36656210", "Content": "A large hotel with a good atmosphere, mixed business and leisure. Nice room. Great breakfast with a large variety. Large and nice fitness center and spa. Bus stop within 100 meters and U-bahn within 12 minutes. Walking distance to the shopping street Kurfurstendam. Outdoor parking somewhat expensive: 20 euro per night.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Funkmasterflex", "Title": "“Perfect location, great hotel”", "Author": "Funkmasterflex", "ReviewID": "UR36145540", "Content": "Got this hotel at a bargain price on expedia. Was a bit aprehensive about what it would be like because I got such a good deal. The hotel was fantastic, room was spacious, very clean and like a previous reviewer said its 20 minuetes walk from all the top attractions, It couldnt be in a more central and better location. Try the cocktail lounge Bar am Lutzowplatz a minutes walk from the hotel entrance they do a brilliant \"watermellon Man\" voted Berlins best cocktail bar twice", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rossendale", "Title": "“Just what I wanted”", "Author": "Gerasimo", "ReviewID": "UR34985857", "Content": "I stayed here early December 2007 with my wife for 4 weekday nights. It was better than I expected. Our room was a good size with a mini bar and a lounge area. It was cleaned every day. The breakfast was a buffet, and it was excellent. Really set me up for the damp cold sightseeing I was about to do. The bar was very friendly, and the staff would always bid us to sit down whilst they brought our drinks to us. We ate in the restaurant once, and the food was really good. I had a steak, cooked to my exact specification. The restaurant price was a bit steep though. The restaurant manageress was really nice, and took good care of us. The location for us was good too. We meant to do some walking, and I completed an ambition, to walk through Tiergarten, down Strasse des 17 Juni and on to the Brandenburg Gate and on to Unter den Linden, taking in the Russian Memorial and the Reichstag. There were some nice restaurants local to the hotel. Just round the corner, there is a lovely Italian restaurant, and I swear I bumped into Gerhard Shroeder in there. He does live in Berlin I'm told. There was a good chinese nearby too. The U-Bahn was only five minutes from the hotel. If you go to Berlin, then get yourself a 72 hour pass for the transport network. You can use the U-Bahn, S-Bahn and buses for 72 hours once you have validated the ticket. I think there are two levels, one for the city centre and one that takes in all of Berlin and Potsdam too. Potsdam definetly worth a visit. If you fly into Schönefeld, the taxi into Berlin can be expensive. The train is much cheaper and very easy to use. The train does a big curved route through parts of the old East Germany. It was an interesting trip. The main stop is Alexanderplatz. Once in Berlin centre, you can easily get an U-Bahn close to most places or just get a local taxi. We visited Charlottenberg Palace, near Spandau. It's a piece of renovation, but really well done. All the artefacts have been gathered from other palaces that were destroyed beyond renovation in 1945. In early December, they have a good Christmas Market outside the main gates. Hotel Berlin was a good choice for us, and if the manager is reading this, then a freebie would be very much appreciated. I have no problem recommending this hotel to anyone. The price for us was good too.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Athens", "Title": "“Nice hotel with a very rich breakfast i”", "Author": "Persefon", "ReviewID": "UR34719959", "Content": "The Hotel is situated in a good location but by foot it takes too time to go to the main sights, I suggest the taxi for you transportation. The Hotel is very big (one block!) . The rooms are very clean and the bathroom is spacious, but they DON'T have DOUBLE beds, so I don't suggest it if you are a couple. It's main advantage is his rich breakfast buffet with fruits, cakes, croissants,eggs, wurstel etc.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“excellent hotel bad front desk”", "Author": "jimmythefish_9", "ReviewID": "UR34533410", "Content": "we booked the hotel through booking.com and specifically asked for a double bed plus there was an offer for a larger room about 40sq.m When we arrived we got a room with two twin beds and a normal room. once we complained the front desk manager insisted that we were wrong and were very rude to us. once they found out the mistake was theirs they never changed us room or even give us a compensation. the front desk people continued to be rude all through our stay and very unhelpful.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“A good bet at any price, a great deal if under $100 USD”", "Author": "jgb10011", "ReviewID": "UR34218881", "Content": "b Berlin, Berlin is a very large business hotel (700+ rooms) that appears to cater to large higher end tour groups and business meetings. With the exception a swimming pool, the hotel offers all the amenities one would expect for such a large modern hotel. The standard rooms were HUGE not just by European standards, but by any standard. The classic double included two twin beds moved together to form a queen size space (typical practice in Germany) with new higher end linens, nights stands, separate sitting area with full sofa, coffee table, and sitting chairs, a desk and chair, small flat panel TV with BBC and CNN available, and FREE WiFi throughout the hotel (a rare and valuable amenity in large business class hotels). A very large closet with wide full length mirrored doors was opposite the ample size full bath. The front desk was staffed by friendly, always helpful professionals all of whom spoke flawless English (other language-speaking staff were also available) and adjacent to the front desk was a 24 hour \"grab and go\" snack cooler with tasty sandwiches, chicken wraps, and beverages available for purchase at a fair price 24 hours a day. The oversized lobbies included a bar which also offered food most of the day. A full restaurant serving food at three mealtimes is also available. (I only ate breakfast there once and will comment on that later, so I cannot evaluate the quality or value of other meals.) An impressive (for a hotel) modern gym was available 24x7 free of charge for guests in the lower level. Also in the lower level was an outoor/indoor relaxation lounge with its own tranquility waterfall, and two dry saunas which were operational from about 6 to 10PM and during other hours by request. Local phone calls were fairly priced at about 0.8 Euros. The location was perfect for me as I like to walk and be central to everything but not right in the middle of anything. In 15-20 minutes I could walk to the heart of the K'damm, the middle of Tiergarten, the zoo and aquarium, and the Shoneberg nightlife - in perhaps 20-30 minutes be at the Reichstag and Brandenberg gate. U-bahn and S-bahn stations are a good 10-15 minute walk. That said, those who want to have a plethora of restaurant choices and tourist attractions just outside the door might be disappointed in what I have read elsewhere has been described as a rather \"bland\" location. My ONLY criticism of the hotel and my stay there is the very expensive price (19 Euros / $28 USD) for the breakfast buffet. Yes, it was plentiful and presented a variety of hot and cold selections, but the level of pricing is more appropriate for a full scale Sunday brunch, not a breakfast. Fortunately, there are other choices nearby. (E.g., the nearby Holiday Inn Express even advertises outside its door \"Paying too much for breakfast at your hotel? Enjoy ours for 7.95 Euros.\" Granted it offered only a simple cold buffet, but for 11 Euros difference, it was fine. Simple coffee, juice, and bread breakfasts were available elsewhere nearby for about 4 to 5 Euros. This hotel is a GREAT VALUE if you can get a room at a good rate $90 USD or less, and a little more if breakfast is include, and a fair value in the $100-$120 range. Once the rooms sell for over $130 you probably can find better values elsewhere. But at any price, unless you're expecting Ritz Carlton luxury, the Hotel Berlin, Berlin is a good bet.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“A great place to stay in the heart of Berlin”", "Author": "whylee", "ReviewID": "UR33997401", "Content": "The breakfast was fantastic, the rooms were a decent size and very comfortable. I would recommend staying at this hotel whilst in Berlin.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boston MA", "Title": "“Excellent value - nice rooms”", "Author": "BostonTraveler62", "ReviewID": "UR33094719", "Content": "My superior double room was modern, spacious, and very well-equipped. Hairdryer, iron, refrigerator, A/C, Free Wi-Fi, big European tub plus shower. Hot water, tea and cream in the room but bring your own instant coffee! I stayed there more than once and only one room had a safe. Rooms faced the inner courtyard and were very quiet. Only negatives were the very long walk from reception to the rooms and having to change elevators to get to the sixth floor. Also the breakfast is not included and I found it ridiculously expensive at EU 20 per person. Convenient parking, pay lot and underground garage right there, EU 20 per day. I found the service so-so, lots of very young people at the desk and they are not very customer-friendly. But I paid about EU 80 per night and think this is a great value for a really nice room and a good location (although you have to take a bus to the U-Bahn Zoo Station.) Very convenient if you are driving though. Short walk to Kurfurstendamm. Lots of cafes and restaurants around the hotel.", "Date": "June 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dundee, Scotland", "Title": "“Clean and functional”", "Author": "Auldbuff", "ReviewID": "UR31845562", "Content": "Stayed with my wife for a week. Booked 'Standard' rooms through third party agency to cut costs. Room was very spacious and clean.Staff on the reception were efficient. Although this is a 700 room hotel we heard very little noise from other guests. Would certainly stay again!!", "Date": "June 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Great value for money”", "Author": "EazyK", "ReviewID": "UR31758856", "Content": "This is a good hotel with nice and clean rooms. Good beds and a clean, large bathing room. The metro station to all good places in Berlin is at a 5 minute walk. Very good price/quality, but a disadvantage is that you have to pay for all extras. For instance, razor blades are not included in the price but will cost you more. We had a small discussion with the staff during our stay (about paying for the breakfast), but this was solved to our satisfaction.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "new york", "Title": "“Nice Hotel, Horrible Customer Service and overcharges left and right”", "Author": "motormachine", "ReviewID": "UR31479108", "Content": "i stayed here for 8 days. the junior suite was perfect for my needs. i used the free WIFI which was slow, but was nice to have. the gym is nice and clean. after checking out and getting home, they started billing my credit card for things i didnt order and also charged me 120 euros for the 64k free WIFI. ive been trying to get them to correct the mistake, but they have been very stubborn and refused. i would recommend not giving them a credit card, or else you will find mystery charges after checking out. ive heard this from others online as well, and for this reason will not be returned here ever again.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hove", "Title": "“Ok, but poor customer service”", "Author": "Pebrighton", "ReviewID": "UR30608427", "Content": "I liked the hotel but I found a number of issues frustrating. Reception staff were rude and unhelpful. They had a real attitude about them. The lifts didn't link to all floors. Breakfast very expensive. And the location not good - close to no-where. The free wi - fi was down over the weekend we stayed. Way too many TV channels - in the hundreds, it was silly. Oh and taxi drivers outside woudn't always take you if you weren't going to the airport. The rooms though were excellent, clean and nice. Hotel was funky but very much for the conference trade. I wouldn't recommend due to the rude reception staff. Shame othewise it would have been worth the money.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Fantastic service, great hotel”", "Author": "Michelle L", "ReviewID": "UR29827287", "Content": "We had a lovely stay at this hotel. The man who first helped us at front desk, unfortunately I can't remember his name, was so polite and funny! He made us feel so welcome from our first minute. The rooms are good, normal size with a nice big bed. The pillows are those square flat ones that some European hotels have and are a bit uncomfortable however I requested two extra pillows and they brought them straight up to our room and the problem was solved. They supplied us with a map and marked out all the main spots to see which was great. The service at the bar is fantastic and it is lovely to sit out in the courtyard in the sun enjoying a nice cold beer. I would definitely recommend this hotel and if we return to Berlin i will stay there again.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "uk", "Title": "“funky”", "Author": "jaimie_es", "ReviewID": "UR28962086", "Content": "Hotel Berlin, Berlin – funky Huge 700 room hotel, recently renovated, a short hop to the Ku’damm and within reasonable walking distance to the Potsdammerplatz. For those too lazy to walk, Wittenberg and Nollendorfplatz underground train stations are almost around the corner, while taxis are available right opposite the main entrance to the building. There is also a car park at the back of the property. We got a superior room, very funky. Spacious, bright and airy. Comfortable beds. Shame the pillows were so miserably flat. In room facilities included tea & coffee making facilities, and HDTV with an endless list of national and international channels, plus a wide range of music and games. The bathroom was small but well appointed. No fancy toiletries, though, just soap dispensers, rather disappointingly for a 4 star hotel. The breakfast buffet was excellent. There was everything we could ever wish for, and more. Top quality. Lovely carrot cake. For those into healthier diets, lots and lots of fruit. Mind you, in such a big hotel, you will need to get up early in the morning if you want to have your breakfast in peace and quiet, or be prepared to have a busy, noisy start to your day. Would we return? Yes.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Nice Hotel”", "Author": "tilz1", "ReviewID": "UR28674309", "Content": "Stayed on Business, was perfectly fine for 4 nights, the hotel is big and clean. I had a room off the road which I guess helps, the gym is nice and modern mostly machines and only a few free weights. Can walk to the Europa Center etc in about 10 mins so good location for shopping, located only 5 or so stops from the ICC aswell if you are working there. U station is about 5/10 mins walk away so overall a good hotel", "Date": "April 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Italy", "Title": "“Huge, clean, modern and nice”", "Author": "Ale_ita_83", "ReviewID": "UR28534882", "Content": "This hotel is very big, the rooms are definitely comfy and absolutely clean. A professional staff is ready to welcome you. Me and my partner had booked a double room and actually found two separate beds, so if you'd like to have a queen bed make sure you clarify that before reserving. The price didn't include any meal but it was reasonable. The (buffet) breakfast they serve is awesome but expensive (19 euros per person, if that's not included in your package and you want to give it a try). Convenient location, at a 5 minute walking distance from the nearest subway stop.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "heiny90", "Title": "“you will not be disappointed”", "Author": "heiny90", "ReviewID": "UR24023721", "Content": "I was taking my family to a good area of Berlin in Januar so we picked this area. I wanted to show the childs the sights of Berlin and we also wanted to go shopping. I'd never been to Berlin but we wanted to use the Kurfurstendamm. This is within walking distance. The price was good for the room and the staff was more than friendly. Just a shame about the weather. snow is fine for a while until the whole family has been walking around in it for two days!", "Date": "January 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Christmas Markets”", "Author": "Petherbridge", "ReviewID": "UR23458110", "Content": "My partner and I went here for a romantic weekend away for the Christmas Markets. We arrived at the hotel and was welcomed with friendly staff and the hotel done up all Christmassy. We checked in quickly and went straight up to the room, it was big modern and clean. The hotel itself was big and spacious and the staff all throughout was so friendly and helpful. The bar was so relaxing and a place we sent many hours in the evening chilling out. The drinks were a bit expensive but that’s what you will pay for drinking in a bar. We ate in the restaurant which again wasn’t that expensive and the food was lovely. The hotel was close to all the markets it was a case of getting one bus which takes 10 minutes to get takes you pass all the Christmas Markets (which we were blown away by) The hotel is right bang in the middle of all the places you need to visit while in Berlin. The public transport out in Berlin is just excellent. I can not express how much I loved this hotel and Berlin and its people but I will say it is the best hotel I have ever been too and would defiantly come back here again when we come back next Christmas.", "Date": "January 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“A great city hotel at an amazing price”", "Author": "RebekahB", "ReviewID": "UR22435551", "Content": "The hotel was part of a bargain buy from Travelzoo for a 4 night package with flights. Some of the previous reviews were mixed, especially about the location and size of rooms and the hotel's love affair with conferences. Actually, the hotel is in a decent location, 15 minutes from the Zoological Gardens on foot and 5 minutes from a very central and convenient tube station (the city is massive, so location is really by the by). The room we had was a neutral but modern mini suite with everything I'd expect from a 4*. In fact, it was a really good standard. There were a couple of conferences on but our treatment wasn't marginalised by it at all. In fact, the bar was great for people watching on those evenings. The staff were courteous, spoke great English and gave us a late checkout. My only gripe was that we were only given one teabag or cappuccino sachet between us which seems a little stingy. For everything else, if you get a good deal, go for it. This is a decent hotel by anyone's standards. Oh and Berlin is the most incredible city.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montevideo", "Title": "“Excellent Hotel.”", "Author": "EdyeGold", "ReviewID": "UR22421313", "Content": "I have a weekend trip with my daughter to Berlin. The hotel is really big, with a nice lobby and the check in was very efficient . The room and the bathroom extremely clean and very confortable , and new flat TV. No noise from outside . Especial attention to the breakfast, is one of the best I have ever had. All that you can imagin is there. Location is really good, there is a bus number 100, stops in front of the hotel that goes to the most important points of view. You have to buy a daily ABC ticket for euros 6.20 and you can go up and down all the times you want from buses, underground and trains. Berlin is a very nice city.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Not Amazing”", "Author": "Qtcups", "ReviewID": "UR21519275", "Content": "Our flight from Toronto arrived in Berlin approx. 9:30 AM and we got to the hotel a little after 10:00 AM. We were told that we couldn't check in until after 3:00 PM--which wasn't the problem--but we felt that the hotel could have offered us complimentary refreshments of some sort since we had been travelling for 17 hours. All they offered us was a place to store our luggage while we walked the streets of Berlin for 5 hours until our room was ready. The room we got was OK except for the fact that the answering system on the phone did not work. We only found that out after we realized friends had attempted to make plans with us by leaving us a voicemail message that we didn't realize was waiting for us on our phone. The hotel apparantly was experiencing phone problems that they didn't bother to let us know about. Also, what irritated me the most about Hotel Berlin was the fact that there was always a business conference taking place in the hotel. The lobby constantly had a large flow of people and lots of commotion going on. The hotel is mid-level at best in terms of accommodation and ambience.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“A refreshing change”", "Author": "Mohikaner", "ReviewID": "UR21368660", "Content": "After a slew of samey samey hotels Hotel Berlin offers a change in pace and character. First impressions? The bold colour and quirky furnishings are visually refreshing and the service is great. Breakfast time was a bit of a challenge - October seems to be a time popular for conferences ~ between 8 and 9 the buffet area was a bit daunting with the masses slamming food before meetings start. Still, the conference facilities are excellent, free WIFI available all over with decent speeds. Use Ubahn stations nearby (Nollendorfplatz is slightly nearer than Wittembergplatz) for easy city access, with very frequent trains. Supermarkets, bars, restaurants all within walking distance as well as the Siegessäule, zoo and KaDeWe.", "Date": "October 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York", "Title": "“Excellent hotel”", "Author": "KnowlesGirl", "ReviewID": "UR20980386", "Content": "I stayed here for 5 nights with my partner on our first trip to Berlin. The staff were very friendly and spoke English. We booked via lastminute.com and got a really good deal. The location is excellent, just 5 mins down the road from a main train station which is great to catch a train to anywhere in the city and the area itself has loads of cool cafes and bars. We stayed in a Classic room which was cosy and big. We were surprised that instead of a double bed, we had 2 single beds pushed together however we enquired about this and were told that was normal (?!). It didn't dampen the stay as the beds and big duvets and pillows were really comfy. We didn't have breakfast at the hotel but we did sample the bar (open till 2) and that was really nice. Would definitely return here.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "England", "Title": "“Above Average”", "Author": "Ben-Michelle", "ReviewID": "UR20000995", "Content": "Booked this hotel after reading many reviews on TA and finding a good rate on expedia. Overall the hotel is good - above average in the circa 50GBP a night bracket, my wife and I stayed for four nights in Sept. Location - The hotel is located in west berlin, there is a u-bahn station about 5 mins walk away, which has direct access to Alexanderplatz in about 15 mins. The location is the problem with this hotel as the majority of the tourist attractions are in east berlin/mitte. However, access isn't so bad and you are close to KaWeDe, berlin zoo and the Tiergarten. For a prime location go for the Hilton, Adlon or Westin Grand. Hotel - The hotel has a fairly busy roads on two sides, although within the hotel you didn't notice the noise. First impression are very good, bright, airy, marble floors, uniformed staff etc. this is a smart hotel, the reception staff all spoke english and check-in was a breeze. We had booked a superior room which was very nice, a good size, nice bathroom with tub and shower, bed was a little on the firm side, but like the rest of the hotel is was spotless and looked as if it had been recently refurbished. Whilst staying there we noticed several aircrews checking in, which is normally a good sign. Overall the hotel is good quality and is fine for a long weekend/short break if you are happy being slightly away from the centre. Tip - There is an resturant / bar a few mins walk from the hotel called the 1885 restaurant - ask reception for directions. The resturant owner speaks good english, and the food is excellent.", "Date": "September 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haifa", "Title": "“Excellent choice”", "Author": "fistuk", "ReviewID": "UR19825922", "Content": "We stayed in Hotel Berlin for 6 nights from August 8th. We had an excellent last minute package deal (flight and accommodation) and we picked the hotel out of 30 other choices based on Tripadvisor reviews, which we found very usefull. We arrived to the hotel in the early morning hours, and stowed our luggage in the storage room until 3 PM when we checked in. From our experience we recommend to referesh and change clothes in the spacious and clean WC near the reception before leaving the hotel. We had more than 7 hours before check in. We got a room on the 5th. floor facing the hotel inwards, preferably because we usually sleep with open windows. The room was very large and clean. The beds including the roll-away couch which my daughter slept on where comfortable. In the room was a seperate air conditioning unit which we found not so covenient (most of the hotel rooms are equipped with a built-in unit), but it was mobile so we oriented it to throw air aside. Breakfast is really suberb, highly rich buffet, everything is fresh and tasty, try to avoid the rush hour of 0800-0830 AM. The hotel is very clean in the room and in all the public areas. The staff is very helpfull, although not so cordial. Location is excellent, you can walk to the central places, or take bus # 100 which is very frequent. The only issue we had was ironing, that is not available in the room and there are no ironing facilities except in charge service.", "Date": "September 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bowral, Australia", "Title": "“4 stars? Maybe 3”", "Author": "Bowral", "ReviewID": "UR19745080", "Content": "We stayed at the Hotel Berlin twice, once at the beginning of a tour and again at the end of the tour. The room we had on the first occasion was roomy, clean and quite comfortable. The room we were given on our return was so small that we were unable to open our suitcases unless we put one on the bed. Whilst the room was clean and had a small balcony, it was too small to be comfortable and we were glad that we were only staying 2 nights. There is a restaurant (which didn't seem to be open when we were there) and a bar/cafe where meals can be ordered and eaten in the open courtyard. Breakfast was good with an excellent range of food which should please just about everyone. The hotel is located close to the main shopping area (Kurfurstendamm) and a pleasant walk through the Tiergarten to the Brandenburg Gate and Unter Den Linden. I would happily stay at the hotel again but would ensure that we had a larger room. I question whether it is really a 4 star hotel taking into account other 4 star hotels I have used in Europe.", "Date": "September 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "christinecatherine", "Title": "“great hotel”", "Author": "christinecatherine", "ReviewID": "UR19021732", "Content": "Stayed here last week and the hotel offered us great value for money. Location is great, very central and a metro station is close by, rooms were spacious and nicely decorated and staff friendly. Would definately stay here again if visiting Berlin.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Good hotel, poor location”", "Author": "UKChris82", "ReviewID": "UR19008382", "Content": "Whilst the hotel boasts all the usual facilities (minus a pool) that you'd expect from a hotel of this standard, the location is poor for what is described as a centrally located hotel.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Nice stay”", "Author": "atleti73", "ReviewID": "UR18819922", "Content": "I took my girlfriend to Berlin to celebrate my birthday. We stayed 4 nights in this hotel and I must say the hotel is really nice, the room we stayed was big and comfortable and the service staff were quite friendly. This is a large hotel but you really feel looked after. The bar has a nice atmosphere, shame the rain spoilt my beer in the garden....", "Date": "August 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sutton Coldfield, United Kingdom", "Title": "“Excellent Hotel - Highly Recommended”", "Author": "fireman999", "ReviewID": "UR18502891", "Content": "I booked this hotel because of its location, price and comments by other travellers and was not disappointed in any way. My wife and I were due to stay there earlier in the year but had to cancel on the day due to our flight being cancelled. I had expected to be charged for at least one night but the very professional reservations staff understood the situation and issued a cancellation number without any financial penalty. We have recently returned from our 5 day trip and without any doubt this was one of the best run hotels that we have ever stayed in - all of the staff without exception were very professional, polite and understanding. The room and public areas were very well maintained, clean and comfortable. The food was wonderful with plenty of choice and very well presented. Anyone that has read my previous reviews will note that I always inspect the fire safety precautions when I visit hotels and I am pleased to say that these were all of the highest standard and I certainly had no worries here and would recommend it to anyone. When we returned home I even had an email hoping that I had enjoyed my break and had returned home safely. Many hotels, particularly in the UK, could learn a lot from this hotel and for those visitors that have not yet visited Berlin I can also recommend the city which is extremely interesting, safe and pleasant.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Derbyshire", "Title": "“Great hotel”", "Author": "Potto22", "ReviewID": "UR18247758", "Content": "Stayed for two nights in July. The hotel was spotlessly clean throughout. The reception, bar and restaurant staff all appeared to speak very good English, much better than London hotels I have recently stayed in. Our room was large with a balcony, overlooking other parts of the hotel. We were not asked if we wanted a non smoking room and consequently there was a smell of smoke in the room. We didn’t notice any noise from with in or outside the hotel. The hotel is well placed in the centre of Berlin only minutes walk from the Tiergarten. We arrived at Tegel Airport on a Friday afternoon, traffic was very heavy but the taxi fare was still less then 20 Euros. Because time was short we ate in the hotel restaurant both evenings. The meals including wine were expensive but good quality and the service was excellent. Bar food was also available. There was an extensive choice of good quality food available at breakfast. We would definitely stay at this hotel again.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zagreb", "Title": "“Good location”", "Author": "Alen_T", "ReviewID": "UR18015967", "Content": "Nice hotel near Tiergarten, good location. I expected more modern rooms. Breakfast was great!", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent”", "Author": "BrendanB", "ReviewID": "UR17407430", "Content": "I was delighted with the Hotel Berlin. My wife, daughter and I stayed in what the call a \"classic\" room ie the smallest size but at 30 square metres it was excellent, There was loads of room and it was very clean with loads of storage space. The lobby, check in and bar are excellent with first class check in. My only complaint was that there was no safe in the room although I had no reason to be concerned. The location is excellent 15mins walk to the Sony Centre whcih we used as a focal point and 10mins to the shopping area. The main tourist sights and shopping areas are in different directions. Berlin itself was great and I would recommend it for a city break - we were there 3 nights and I was sorry we didnt book a day or two longer. We got a taxi from Scohodale airport it was handy and cost 35 euro. There is an excellent resturant outside the hotel (200 m to the right opposite the green) its expensive a meal for 3 with 2 half crafts of wine 180 euro but the food was excellent. The Sony centre has a selection of 4/5 resturants the Ozzie one is the best and do try the kanagroo steak. And do take a bus tour its a great way to get your bearings of the city and main sites So if you booked this hotel you will be pleased", "Date": "July 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bournemouth", "Title": "“Great Hotel, Great City”", "Author": "Nickyahill", "ReviewID": "UR17004060", "Content": "Have just returned from a 4 day break in Berlin and am buzzing with the delights of the city. The hotel was better than expected, i used trip advisor to choose so had read reviews but you can never be too sure, it was very business like but still leisure tourist friendly. The room was very clean and comfortable and it's location was central to all the main parts of Berlin as the public transport system is second to none. Buy an all day ticket for 6E 20. and travel anywhere in Berlin all day, the buses are every 2 mins right across the street from the hotel. We didn't try the restaurant in the hotel so can't comment on the food other that a quick snack from room service one night which was very nice. Berlin itself is facinating i totally recommend The Insider walking tour which is run by English tour guides, we would return just to take another of their tours.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Stockholm", "Title": "“Ok for a great rate!”", "Author": "JeppePaBerget", "ReviewID": "UR16787432", "Content": "I just got back from the great city of Berlin, me and my mates stayed for 3 nights at Hotel Berlin, Berlin. At first the hotel makes a great first impression with a nice looking lobby and bar, pleasant and efficient staff, when you get to the rooms though you do get a bit dissapointed, though our rooms were nice in size it does not even look half as good as the lobby and also house keeping was not really on point, plenty of small but so important details were overlooked. For the rate that we paid, approx, 150€ per night i was suprised that the rooms were so big, our rooms both had a sofa and 2 chairs, considering the rates i must say that if only housekeeping had been on point i would have rated the overall stay much higher. But when the first thing you find when you walk in the room is a used plaster, and even though they have big dispensers of soap you run out, all our empty soda & beer bottles were left in the room, the bathroom in one of our rooms smelled of urine, its just too much to not be bothered about.", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta", "Title": "“Special Treatment at the Hotel Berlin”", "Author": "asocsop1", "ReviewID": "UR16336768", "Content": "I stayed at the Hotel Berlin as part of a group trip where we were singing with the Berlin Philharmonic. We didn't know what to expect since it was booked through a group agent. The outside of the hotel is not as pleasing as the inside. The rooms were comfortable, spacious and well kept. The reason for my review is the \"special treatment\" by the housekeeping staff. While I was in Berlin, my husband sent me flowers for our 3rd wedding anniversary. I had his card on the nightstand while we left the room. We came back later in the day and found our room elaborately decorated and setup for an \"anniversary room\". There was champagne, mixed nuts, apples, yellow roses on the pillows, rose petals on the bed, swan shaped towels, chocolates, slippers and robes and, the best part, flashing pink hearts!! This is NO joke. See the pictures in this review. We called and asked who did this since there was no note. The front desk said they saw it was a wedding anniversary and it was complimentary. My roommate (another girl) and I had a great time and laughed. We also enjoyed the champagne with some other friends. :) The best part was that the housekeeping staff took it upon themselves to do this for \"us\". We gave them a good tip and will always remember our \"anniversary room.\" I would stay there again if I had the choice next time. Too bad my husband wasn't there with me! Sincerely, Kara", "Date": "May 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "bacooper76", "Title": "“Good place to stay for a reasonable price”", "Author": "bacooper76", "ReviewID": "UR16318329", "Content": "I stayed here recently with a large group, and was pleased with the hotel over all. The front desk staff were pleasant answered questions, exchanged money and at one point tried to help us find an adapter. The room was very spacious and comfortable although I will say coming fromt the states it was a little odd not to have a bathcloth as part of your bathroom linens, just something to remember if your staying here. Some friends stayed in the newer part of the hotel and I have to say that our room in the older part of the hotel was much more comfortable and bright with two little balconies. I was not impressed by any of the food that the hotel offered, room service breakfast or the bar. You can find better in all regards near by for a lot less. We walked a good bit the area is nice and quiet. The closest U-Bahn stop is just a couple of blocks from the hotel and a very easy walk, just be mindful of the bike lane, we were nearly killed a couple of times. :D The area felt safe and we walked around day and night four women with out any problems at all. We did however see a couple of prostitutes on the corner at the backside of the hotel 4 out of the 6 nights we were there, not that they caused any trouble but they were there. The little pub on the corner across from the rear of the hotel has good German food and beer and a nice outdoor patio. The tiny Cafe Rosen right next door has good MilcheKaffe in the morning along with a nice pastry for a very reasonable price. We really enjoyed our stay even if we were a few U-Bahn stops from the tourist sites, it was nice and relaxing and the staff was helpful.", "Date": "May 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Göteborg", "Title": "“Very nice - but not a design hotel”", "Author": "Travelling_Swede", "ReviewID": "UR15647562", "Content": "My husband and I went on a romantic weekend to Berlin and decided to stay at Hotel Berlin. We were very happy with this decision. Being parents with small children we usually are wakened a couple of times a night. Here we had a few nights of wonderful sleep - we really appreciated that the room was very soundproof. Though the hotel is big, and was heavily booked when we stayed there, we did not hear a sound from outside. I also loved the state of the room. It was spacious and seemed recently renovated. The bathroom was spotlessly clean. Breakfast was rich in variety, my only complaint beacause of the booking situation the breakfast room was quite crowded. If you're looking for a reasonably priced hotel in a good location - this is a very good choice. However, the funky photos on the hotel website made us believe that this was some kind of design hotel. This is not the case, the lobby is quite quirky but the rest of the hotel is traditional. Not a problem for us, but if you want to stay in a design hotel you should go somewhere else.", "Date": "May 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tauranga, New Zealand", "Title": "“Hotel Berlin, great but smokey”", "Author": "mantonandkylie", "ReviewID": "UR14098966", "Content": "When we walked into the hotel we were stunned. Being on a young people's coach tour we weren't expecting great accommodation. Hotel Berlin was fantastic. The only downfall was that our room smelled strongly of smoke. But you get that problem all over Europe.", "Date": "March 6, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Scotland", "Title": "“Good enough”", "Author": "ScotlandGlasgow", "ReviewID": "UR13468291", "Content": "Decent four star hotel. Smart looking from the inside. Very spacious room. Staff friendly enough. Location good (10/15 minutes from Zoo train station but probably better to get the 100 bus which stops right outside the hotel). Definitely buy a Welcome Card for unlimited public transport and discounts on most museums. Berlin itself is amazing! Enjoy!", "Date": "February 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Central Scotland", "Title": "“I'd recommend this hotel”", "Author": "Ellie11", "ReviewID": "UR13002049", "Content": "We travelled to Hotel Berlin in a large group and everything about the hotel perfectly fitted our needs. One mistake was to walk from the main station to the hotel, should have taken a taxi as the walk - in the snow - was too far for some of us. The hotel is large with nicely decorated public areas and helpful staff. The hotel bar is a great meeting place but not cheap. The walk to the underground is direct and takes around 10 minutes but the whole of Berlin is then at your disposal. The staff at reception recommended a nearby restaurant for our last evening and it was a fantastic find. There's a fab cocktail bar (Bar am Lutzowplatz?) across the square from the hotel and they do a half price offer most nights - well worth a visit! Our room was in the main wing and while it was huge, it wasn't particularly modern. We had a great sitting area and the room was cosy throughout our stay even though the temperatures outside were well below freezing. Bathroom was nice, view was a concrete block but in all the room met all our requirements. One of our party stayed in the new wing and they had a modernised room with flat screen tv and much more modern furnishings. Breakfast was an expensive addition but extremely tasty, I'd advise trying to get a package that includes breakfast.", "Date": "January 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Great Hotel”", "Author": "Scotsguy5", "ReviewID": "UR12330621", "Content": "We booked this hotel after seeing it on Octopus so we were not sure what to expect and had seen mixed reviews on trip advisor. When we arrived the receptionist informed us that we had cancelled the booking - which we had not. There was no problem though, she simply found us a room and arranged for the third bed to be brought up although we didn't need it as the room had a great bed settee. Our expereince was very good. the location was great fro Ku'dam - shopping. Bars were close by that we were interested in. Transport links were great - the directions on the hotel website were very accurate. Previous comments read mentioned that it was close to the gay district - it was (ish) Prostitutes were alos mentioned and they were evident at night close by but they were only there looking for kerb crawlers and they did not bother anyone walking around the district The hotel was very clean and the staff very attentive and friendly - they could not be faulted. They gave us infromation when we needed and our luggage was looked after for us on the day we checked out. The room was spacious - only thing lacking was a kettle - coffee from the bar was not great and quite pricey. We only had breakfast booked for the last day and that was enough - there was masses of food and we could not have eaten a lot in the morning so it would have been a waste but it was nice on the last morning as we had a long day ahead. The only down side of the locationis that there is not much around inthe way of getting a coffee or something in the morning - I am always first up and like to go a wander but there was nothing very near. Overall though i would rate this hotel very highly and would recommend it for any type of trip - romantic, business, short break, family...", "Date": "January 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Very clean and well presented”", "Author": "BarryMip", "ReviewID": "UR11611190", "Content": "Initially on checking in, we were booked into a dirty room. Not the best start. We returned to reception where they duly apologised and changed our room. The room was just as we expected. Very clean, comfortable bed, superb bathroom and excellent value for money. The lobby and lift area was very clean and had a constant buzz around the place. Ideally situated island bar with plenty of space to find to sit. Breakfast was superb with a wide variety of world breakfasts on offer. My only gripe was that being an Englishman I couldn't find any breakfast tea amongst the other flavours they had. Location was ideal being only a short walking distance to the local under/overground station. The tiergarten was only a 15 min walk also, as was the popular area of West Berlin which was abundant with restaurants and shops. Excellent value for money and would stay here again if returning to this wonderful city.", "Date": "December 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "zurich", "Title": "“Nice hotel”", "Author": "nico_ch", "ReviewID": "UR10825464", "Content": "The inside doesn't look like the outside. Seems the hotel has been refurbished not too long ago, the interior design is nice. The room and bathroom are modern and clean. We didn't have to wait long to check-in/out, but given the size of the hotel I would except some queues during peak hours. The restaurant serves good food but pricey (for Berlin) and the service was very chaotic (they kept forgetting our orders and mixing them). The hotel provides free wifi Internet access, always a bonus point.", "Date": "November 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Good Location”", "Author": "Amydol", "ReviewID": "UR10760803", "Content": "We stayed at the Hotel Berlin at the beginning and again at the end of our tour, Sept-Oct. '07. It is a large hotel. The lobby and restaurants are very nice. Our room was small but decorated nicely and the bathroom was well equiped. It only had liquid soap in the shower, no toiletries. There was a grocery store nearby and several nice restaurants. It was in a good location for walking. We would stay here again .", "Date": "November 11, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Alberta", "Title": "“Was OK”", "Author": "Jinxalberta", "ReviewID": "UR10650339", "Content": "We stayed here for 3 nights Oct 14th to 17th. The outside looks terrible, like a warehouse, but the inside is fine. The rooms here are huge and bathrooms as well. The only complaint we had were the pillows, or excuse for pillows. The breakfast buffet that was included was fantastic, everything was there.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Nice, clean and confortable Hotel”", "Author": "wen_kel", "ReviewID": "UR10006064", "Content": "My partner and I stayed at this hotel for 3 nights in Aug. We booked our stay through Expedia and got a great deal although we had to pay in advance. The room was very nice and the free Wi Fi was great for sending emails after a day of sire seeing. We found the Hotel was a little expensive for meals so we ate out most nights. We found a grocery store that was 5 mins away by foot so we bought food to make lunch. We did see the tourist buses arrive which made the reception very busy. But this wasn't really an issue for us. We were driving through Europe and had a car, parking at he hotel was 17 Euros a day (very expensive) but because we got a great deal on the room it worked out OK. If we travel again we would would consider staying here again.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Convenient, Central, Comfortable hotel in Berlin”", "Author": "lawn_wood", "ReviewID": "UR8826222", "Content": "We stayed in the Hotel Berlin, Berlin for a week in July 2007. We had chosen it from a search on the Internet and were well pleased with its location, facilities and service. The hotel has WiFi access throughout and was very useful to us during our stay there, in fact, it was one of the reasons the hotel was short-listed in the begining. The Breakfast Dining Room was opened from 6.30 am until 10.30 am. There was a very comprehensive spread of food supplied for Breakfast with at least three Fruit Juices alone. There were plentiful supplies topped up very regularly by the efficient staff. The bed-room was as described with all the facilities necessary to make your stay comfortable. TV, Tea/Coffee making facilities, Bath & Shower complete with Shampoos etc. The only thing that was not functioning was the internal Safe but we were offered the use of the Hotel Safety Deposit Boxes at the Reception for any valuables, etc. The hotel is located on the Bus 100 Route and was convenient and central from that point of view. It is a short stroll to visit KaDeWe Department Store in one direction and Tiergarten in the opposite way. Zoogarten area is also within walking distance from where you can get a bus, etc to almost anywhere in Berlin or Germany indeed.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dunfermline", "Title": "“Nice, but caters more for conferences”", "Author": "Steve6696", "ReviewID": "UR8823832", "Content": "Decent hotel very well placed for the 100 bus. Our room was an upgrade apparently but still quite small. When we were there it was full of conferences who monopolised the staff to a greater extent. We did have a few questions with regard to bike tours, restaurants etc but they really werent interested in helping. Maybe just got them on a bad day. We got a cheap deal through lastminute.com secret hotels site so cant complain. I can thoroughly recommend the Cafe Einstein round the corner (right out of the front of the hotel, right again, first left, 50 yards on the left) for a cheap and very filling brunch. Old building, charming waiters, lovely atmosphere. The fat tire bike tour which we eventually found was excellent.", "Date": "September 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hertfordshire, England", "Title": "“Friendly staff, reasonable location & fairly cheap”", "Author": "ad_herts", "ReviewID": "UR8715368", "Content": "The hotel is centrally located near to the main shopping area of Berlin - the Kurfurstendamm. The nearest U-Bhf stop is called Nollendorfplatz which is only a short walk from the hotel. Also nearby is the Tiergarten, a large park area in the middle of the city. The staff were very friendly and particularly helpful re. providing maps etc. of Berlin. The main clientele appears to be business people and there were several functions held in the lobby throughout our stay. The hotel is well maintained and very modern throughout. There was a flat-screen television in the room with one English channel and an excellent en-suite. Also a safe and big wardrobe. The bed was a bit firm but the room was of a high standard. We had a 'standard business room' which provided everything we needed. We booked our trip through Expedia (3 nights for price of 2) although breakfast was not included. Breakfast costs 14€ each. There is however a quick-breakfast option available at the bar (a croissant and coffee). A good option is to eat in the restaurant at KaDeWe (department store), open from 10am weekdays and 9.30 on Saturday. We found the immediate area to be somewhat lacking in restaurants/bars. Although we didn't encounter any problems, the surrounding streets appeared to be frequented by 'working girls' at night! The public transport in Berlin is excellent and as most places are a short tube ride away. Walking to Brandenburg Gate via the Tiergarten took perhaps 35 minutes. This would be a good base for a shopping trip, as well as for sightseeing. There are more centrally located hotels, but the prices rise accordingly. Tip - get a 'Welcome Card'. This gives you 48 or 72 hours free public transport (U-Bhf and S-Bhf trains) and substantial discount to many attractions and museums. Don't forget to validate your ticket in the machine on the platform the first time you use it!", "Date": "September 14, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice room, free WiFi”", "Author": "Malte74", "ReviewID": "UR8537623", "Content": "Booked a double room for two nights through lastminute.com (top secret hotel) for 150 Euro (without breakfast). We were very happy with our stay, nice room, free wifi. Good location, short walk to U-bahn, some nice bars and restaurants nearby. Try \"Bar am Lutzowplatz\" for great drinks. Didn´t try the hotel restaurant or bar, seemed a bit pricey. Overall a very nice weekend in Berlin!", "Date": "August 29, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ottawa", "Title": "“Overpriced and Poor Location”", "Author": "Mila016", "ReviewID": "UR8507205", "Content": "I stayed at Hotel Berlin for three nights (August 16-19th, 2007). I had great expectations for this hotel since the reviews were pretty good. I was disappointed for the following reasons: 1-the nearest u-bahn station was a good walk away 2-there was nothing around the hotel (no grocery stores, no entertainment). The hotel seems to be situated in a business district. 3-the hotel overcharged for everything, knowing that tourists would pay since there were no services available nearby. For example, breakfast was 17 euro per person..., 2 euro to get a pair of socks washed... 4-the minute it got dark outside, prostitutes lined up on the street of the hotel, one block away. 5-unfriendly and rude customer service. The attendant cleaning the room in the morning was the nicest person I encountered at the hotel. Overall, I feel I paid too much for what I got. I value location over almost everything else, and I felt the hotel was very poorly located. I would not go back.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "San Sebastian", "Title": "“Disappointed: 3 star quality in a 4 star skin”", "Author": "markfour", "ReviewID": "UR8502595", "Content": "This hotel tries for a trendy boutique surface, but underneath the gloss are a number of problems. First, there are not enough people at the front desk. A tour bus arrived right before we did, and there were thirty people waiting to register, and only two people on the desk, with no queuing system so some people elbowed their way to the front of the line, raising the frustration level. Later in our stay, there was always a wait at reception. Other problems: the air conditioning has an automatic shutoff, and only one setting--on or off. So at night, you have to get up and turn it on again every few hours. The water in the shower can go from hot to cold in a split second, and never stays the same temperature for very long. The fitness center consists of: a treadmill, a stationery bicycle, some dumbbells and a second rate universal gym. And the restaurant was spotty. The main course was a lowlight (overcooked fish), the desserts were excellent. Another problem was the location. It sounds great: the middle of Berlin. But to quote Gertrude Stein, there's no there there. There are low rise office buildings, but no shops or restaurants in the immediate vicinity. Lutzowplatz, the square the hotel borders on is overgrown with weeds. There are some nice stores and cafes past the subway station, about five blocks away. On the other side of the coin, our maid was very responsive when we put out the sign for cleaning. The reception area staff were friendly, helpful and fluent in English (once you waited in line to speak with them). The wireless internet was free, and worked without any problems.", "Date": "August 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Luton, United Kingdom", "Title": "“Good hotel, deserves 4*s”", "Author": "Gandhiji", "ReviewID": "UR8497983", "Content": "The hotel Berlin in Berlin is truly a 4 star hotel. If I come back to Berlin, I would be more than happy to stay there again. The best was the full hearty hot and cold buffet breakfast. If you eat well, you could even skip lunch! The hot breakfast included scrambled eggs, boiled eggs, sausages, bacon, and cheesy tomatoes. The double room was spacious, but in comparison the single room was a bit on the small side. Only some of the rooms have a balcony. You can have a choice of smoking or non-smoking rooms. The inward facing rooms overlook the hotel garden, and the outside facing rooms overlook either the car park or the main road. The hotel and rooms were very clean and tidy. The location of the hotel was good but not right in the centre. Outside the hotel is a bus stop which has fast frequent services to the west and east of the city. The nearest underground station is about 10 minutes walk away. Public transport is cheap and reliable. There are not many shops near the hotel. Do not use the currency exchange service at the hotel, unless you have to. The rate is very poor. There is no swimming pool at the hotel. The hotel bar is good but full of smokers. Read my review about Berlin for information about sightseeing and transport in Berlin. Enjoy the hotel and holiday. We did!", "Date": "August 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "gerrybee", "Title": "“a disaster”", "Author": "gerrybee", "ReviewID": "UR8404002", "Content": "Arrived at the reception with a party of 12 to find that the reservations had not been processed and our rooms were not ready ,this was at 1400 were then told to come back in four hours..not good so far .On returning to the hotel to be told the reception did not know if the rooms were ready. this was a lie we kew this because a member of our party is involved with the hotel industry and he spotted the unprocessed checkin documents on the reception desk..! we had to wait another two hours befor we were even told what was going on. reception was a mess. when the manager was asked for the receptionist was sent out and was very rude and unhelpful in the mater. While we all found the staff in general very nice and helpful. reception and management was arrogant and rude i could not recomend this hotel as a good place to stay in berlin. In my opinion this hotel did not give me the four star experience i had paid for and left berlin very dissapointed.", "Date": "August 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel”", "Author": "jtriefen", "ReviewID": "UR8398207", "Content": "Great location, excellent price, nice facilities, very clean and friendly staff. The rooms are a bit small, but the bathroom was plently big. I highly recommend this hotel!", "Date": "August 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Great Hotel”", "Author": "tadgh1975", "ReviewID": "UR7986626", "Content": "My boyfriend and I stayed here for a long weekend in May. We booked through the Ryan Air website and got a very good deal. We found the hotel was to a high standard. It was quite busy when we were there catering for conferences. Our room was very big and quiet and it was very clean and looked like it had been done up not so long ago. The location is ideal for sight seeing in the city and there is an excellent bar literally across from the hotel in Lutzowplatz that is ideal for cocktails and in staggering distance of the hotel. We didn't eat at the hotel but tried the restaurant Lochner in Lutzowplatz which was very nice and the staff were very attentive and helpful. Was a bit apprehensive with regard to whether I would enjoy Berlin but I would definitely recommend this hotel and the city, lots to do and the people are friendly.", "Date": "June 25, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent Location”", "Author": "cow_manx", "ReviewID": "UR7957792", "Content": "This is a great hotel, wonderfully located in downtown Berlin within walking distance of the Hard Rock Café and several other attractions. It's very high end, ironically reminds me of the Hotel Vancouver back home. The on-site dining had a limited selection and I found the cuisine to be a bit lacking. The room numbering and elevator system seemed overly complex and we got lost a couple times looking for our room. In the end though it was a wonderful facility, I would definitely stay again.", "Date": "June 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Hotel!”", "Author": "timh65", "ReviewID": "UR7194955", "Content": "This hotel is known as Hotel Berlin-Berlin. Good size clean rooms. Nice bar and helpful staff.", "Date": "March 20, 2007"}], "HotelInfo": {"Name": "Hotel Berlin, Berlin", "HotelURL": "/ShowUserReviews-g187323-d638834-Reviews-Hotel_Berlin_Berlin-Berlin.html", "Price": "$96 - $278*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Luetzowplatz 17</span>, <span class=\"locality\"><span property=\"v:postal-code\">10785</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "638834", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/65/9f/659fb01753704880e97a3173f8e124e85large.jpg"}}