{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Good hotel in good location”", "Author": "Liz_nz", "ReviewID": "UR124898861", "Content": "I stayed at the Eresin Taksim from Sunday 12th to Friday 17th February. The hotel is well positioned in a good area and surrounded by various restaurants and a major shopping street. Close by are shops where you can buy snacks and drinks to take back to your room if you want. The staff all spoke good English (if that's important for you) and were always polite and ready to help. At check in I was given an upgrade to Premium and the room was clean and well appointed, I had absolutely no complaints. I was on the 2nd floor but didn't notice any noise from other rooms or from the street below. I ate breakfast each day on the top floor restaurant that has a magnificent view over Istanbul, and also at the hotel restaurant which serves good Turkish food. They made every effort to accommodate my requests (e.g. can I have chicken and chips!) despite the fact they were not on the menu! Room service was good with meals taking around 20 mins to arrive. The food was good and I found the cost for room service to be outstanding. I had some difficulties connecting to the internet from my room but a brief phone call to reception quickly got me the help I needed. Well done Eresin Taksim, I will definitely stay again.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Palma de Mallorca, Spain", "Title": "“Correct hotel, well situated and clean”", "Author": "jemrec", "ReviewID": "UR124881870", "Content": "I have been two times in this hotel in 2011. The best of this hotel is its location, near Taksim square. The room had a correct size, and it was always clean. The service was good, with a very professional staff. I didn't like the breakfast (very poor), but the restaruant has a very good views of all Istanbul. The Wifi connection is expensive and very, very slow, so for my job it was a problem. Finally, don't ask them any touristic map of Istanbul, because they will give you just a any useful map with just some streets.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“Almost perfect!”", "Author": "SouAthens", "ReviewID": "UR124003287", "Content": "Great location, modern decorated, facilities in the room, delicious breakfast. Not enough lighting and soundproofing.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic”", "Author": "Adrian186338", "ReviewID": "UR123662577", "Content": "We are visiting Istanbul for the first time and the staff at the hotel were superb. The location and the views from the breakfast room are spectacular.No doubt we are coming back again !", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Volos, Greece", "Title": "“perfect lobby area , quiet rooms , cosy swimming pool area”", "Author": "Kyriaki", "ReviewID": "UR121415523", "Content": "My partners and me stayed at the Eresin Taksim hotel for seven nights . We had a triple room , but during two first nights we were given a double bedroom plus a sofa , rather inconvenient solution for mid age ladies . On Monday , we were given a more spacious room , that was really triple , it was acceptable for our needs , though it had a tiny closet , I suppose for the needs for one person. Anyway , here stop the dark side of the moon !! The advantages are : walking distance to Istiklal Caddesi , sumptuous breakfast at the 11th floor , roof garden overlooking beautiful Istanbul.Lobby area , was very convenient , with Chersterfield type chairs and free Wi - fi internet ( internet was free only at the lobby area , at rooms it costs 15 euros per 24 hours , very expensive ,I suppose ).At the lobby ,there was a separate , very well air conditioned , area for poor smokers !!very fair !! Reception staff helpful .", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“Hard times in Istanbul”", "Author": "fairwindstraveler", "ReviewID": "UR120844043", "Content": "The location of the hotel is wonderful. The lobby is spacious. And after that things slide downhill. The rooms are small and the beds are really, really hard! The breakfast buffet was good but we were there for 5 nights and it never varied. Internet was ridiculously expensive although free in the lobby. I likely would not stay here again.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Madison, WI", "Title": "“Location is Wonderful”", "Author": "hcry", "ReviewID": "UR120748029", "Content": "But this is not a 4 star hotel. The rooms are very small and hot, the beds are very hard and the pillows are dreadful. You can guess that the nights were not restful. I would not return to his hotel.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good hotel in the centre of Taksim”", "Author": "Traveller300163", "ReviewID": "UR118339316", "Content": "This is a modern, clean and straight forward hotel in the centre of Taksim with good access to all thhistoric sites in Istanbul and just 200m away from the airport shuttle terminal. Highlights of the hotel are the view from the breakfast room in the 10th floor, the small but clean spa area and generally the always helpful and friendly staff. Negative points would be the slow and narrow elevators, the lack of free WiFi in the rooms and the fact that you have to get your coffee each time yourself from the breakfast buffet in the morning (they really could send someone around...).", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Athens", "Title": "“Would stay again any time”", "Author": "VickyZo", "ReviewID": "UR116307198", "Content": "Very nice in all aspects. Room was a bit small but very cosy, new decoration, everything very clean. Breakfast pretty good and all personell very kind and helpful. Excellent location. I can't think of anything bad!", "Date": "August 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Saudi Arabia", "Title": "“Fair cost, well located, excellent service”", "Author": "hoberlander", "ReviewID": "UR110751144", "Content": "A MAGIC CITY!!, incredible mix of religions and cultures, a lot and long of history in one place. A lot to learn about history but so fun bargaining while shopping. Not that cheap!. Friendly local people. Take good running shoes to make the long day walking more comfortable.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New jersey", "Title": "“Best Value”", "Author": "zimmermanmk", "ReviewID": "UR108771846", "Content": "What a deal. This is my second time in Turkey and Istanbul was my first stop. The hotel was simply excellent value. Superior location, quality accomodation standards and friendly staff. The hotel district is fun turistic place with lots of shops and cafes and restraunts. And we took a sighseeing tour and saw all the historical sites such as Topkapi and the famous mosques of Istanbul. The covered bazar was amazing. Perhaps the rooms were a little small but considering the fact that we spent time only for sleeping at night, this was a great value in Istanbul.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Home from home”", "Author": "Adrian186338", "ReviewID": "UR92548227", "Content": "Fantastic location and the hotel has just been done up with amazing views from the top floor where you can have breakfast .The staff are friendly and courteous and no doubt I will be back with my customers. Adrian", "Date": "January 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York, New York", "Title": "“Avoid this hotel”", "Author": "DocTravel", "ReviewID": "UR24629612", "Content": "My husband and I stayed for 3 nights. Our first two nights were in room 112. The small room had no closet or drawers, so the suitcases had to be open in the middle of the floor. There was also no light, so we kept stepping on our stuff because in the evening when there was no daylight, you really couldn't see with the extraordinary low light in the room. We asked for a lamp, they said they didn't have any, so they changed our room. The staff at the hotel, except for Mr. Yasar, were nice and helpful. I made it clear that my husband could not tolerate a room with cigarette smoke due to asthma, and I was told we were moving to a nonsmoking room, room 214. When we briefly entered the room during the day, the porter commented on the smell in the room, and opened the window. We left immediately to go out after bringing our luggage to the room. We returned to the room that evening . The room had a smoky/chemical smell in it. We tried to air it out repeatedly. My husband's asthma became increasingly bad, and by 1am, he couldn't breath and moved to the hallway. The front desk staff noticed him in the hall, and invited him to sleep in the lobby. They did not offer another room, though there may not have been one available. He spent a few hours on the couch in the lobby, and then people came in smoking. He moved to the breakfast room until about 3:30am. Then we went back to the lobby, which was still too smoky, and the porter at the front desk, trying to be helpful, suggested a conference room. Around 4 or so in the morning, my husband was on the floor of the conference room trying to sleep; they brought him a blanket. Needless to say, it was a terrible night. I went to the lobby to discuss the situation with a manager. Mr Yasar said he was the manager, and another staff member had a questioning look on their face, so I tried to clarify this with him. When discussing the terrible night we had, Mr. Yasar just kept insisting it was a nonsmoking room. That is really not relevant when the room smells so terribly. I don't care if it was supposed to be nonsmoking, clearly someone smoked quite a lot in there. Anyway, he said he couldn't give any credit to our credit card because we paid in advance. We paid over $600 for three nights. Then he proceeded to collect the 2 days of internet payment. It is difficult to describe the condescending tone he took with me. He refused to give me any direct contact information to speak with a manager. He was terribly rude. He did take my contact information to give to a manager, but I never heard from anyone. Soon after, we were in the lobby leaving, and my husband politely said \"thank you\" to the desk staff, and instead of apologizing to him for the terrible night he had, Mr. Yasar asked me \"can you tell me compliments you have for us.\" Compliments? I spent most of the night awake worrying that we were going to end up at the hospital due to my husband's inability to breathe, and he wants compliments? My husband was still coughing, and he wants compliments? I would have given the hotel a higher rating if not for the terrible service of the upper staff. The porters were quite nice and trying to be helpful. After my stay, I never heard from anyone. I emailed the hotel twice. Then I contacted Best Western. The hotel still didn't respond to me, but did lie to Best Western saying that they offered us a suite repeated, but we refused! Saying my husband CHOSE TO SLEEP ON THE FLOOR OF A CONFERENCE ROOM!! They also lied and said that the lobby was nonsmoking and just not big enough to satisfy my husband! This makes no sense! I am so infuriated by them! Lying about us and being so rude in person.", "Date": "February 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuwait", "Title": "“Nice Hotel and Great Location”", "Author": "Ali04", "ReviewID": "UR23303566", "Content": "For a family with children this hotel is a good option. we asked for a two big rooms, since there is some small rooms in the hotel. In general the room was clean, nice as a 4 star hotel. the location is great, one of the best in istanbul. But if am going to istanbul without children, I prefer to stay in other hotel more romantic for a couple.", "Date": "January 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Russia", "Title": "“Great first time in Istanbul”", "Author": "Citoyenne", "ReviewID": "UR14684974", "Content": "It was truly an unforgettable long week-end in Istanbul. Perfect first time visit I would say. Special surprise - upgrade to a big suite with jacuzzi bath instead of standard room, which was initially prepaid via our agent. Quick tranfer from the airport (no traffic due to late hour) - and here were are ,right close to Taksim. Smooth check in, great sleep on a king bed. We enjoyed both the hotel and the surroundings - full breakfast included in the rate - served in the top floor restarant with a magnificent view on the city, quick and accurate room service and housekeeping. Tiny streets leading to the square - variety of cafes, small shops accompanied by the smell of traditional turkish delights. Three days were not enough to discover the city - so we decided to be back in summer months. Same hotel of course - great value for money and perfect not only for leisure in the heart of the city, but business as well. My sincere thanks to all the team! Irina Russia", "Date": "March 31, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Karachi", "Title": "“Better options in town”", "Author": "harris92", "ReviewID": "UR8256513", "Content": "Am currently staying in this 4 star eresin hotel or so its called. I have been booked for 5 nights here through a website i found on the net. The management was kind enough to arrange for an early checkin for my family as we arrived at the hotel, as requested a day prior to our arrival. However the building certainly sprung up some disorientation as two hotels are stuffed into one building - the eresin taxim premier and the eresin best western taxim - something which had never even been hinted to potential guests pre-arrival. The hotel lacks sophistication and automatic lighting in the hallways just add to the plain and character-less hallways. I had been booked into 1 twin and 1 double room on the 10th floor - which i believe was the highest. However the size of the room was a disgrace to the hotel - just enough to fit in a bed and an open cupboard. After an hour of complaining and checking out about 5 rooms across the entire hotel we managed to get two twin rooms on the 5th floor - which were about double the size of the first two on the 10th floor. The impression I got was that the managment were trying to get away with giving the small rooms out, unless the guests complained to which they would slowly introduce rooms of larger sizes. As I had booked the superior or deluxe rooms, they came with lcd philips about 30-35\" tv's and a dvd player which as far as I can see right now in both rooms has not even been connected the either tv. Their are a mere 23 channels offered inhouse - cnn,bbc and cnbc being the only three being in english. Therefore there is absoloutley no point in having such good class televisions. The sight of repairmen working on the chandelier in the main lobby was absoloutly revolting at noon, a time when the space is meant to be most used. The reception does help in explaining sights to see nearby but aren't keen on it and easily slip away to have a chat with their collieuges whilst talking to guests - disrespectful. Breakfast here is till 10:30, a desent time yet lacks the variety expected in even the smallest 4 star hotel. Housekeeping was dissapointing - bathroom floor still wet after cleaning and shampoo's and soaps missing on many days. Room floor not cleaned or sweeped at all during my stay and glasses not replaced. DISGUISTING STANDARDS The location of the hotel is the only major positive feature possesed by this hotel. It is in walking distance from the famous taxim square and taxi, bus and metro stops. The district is warm and seems safe as women are seen to be travelling alone and I myself was out in taksim square and the hotel area with my family late at night - around midnight without any appearant problems at all. It is a 3 star service standard hotel with useless lcd tv's in their best rooms. Dissapointing for its potential.", "Date": "July 30, 2007"}], "HotelInfo": {"Name": "Eresin Taxim Premier", "HotelURL": "/ShowUserReviews-g293974-d643067-Reviews-Eresin_Taxim_Premier-Istanbul.html", "Price": "$160 - $427*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Topcu Cad. No:16</span> | <span class=\"extended-address\">Taksim</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34437</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "643067", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f4/89/f489b7095949fe839d53593e7eb6fce13large.jpg"}}