{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Could be better”", "Author": "gerrybrow", "ReviewID": "UR127540208", "Content": "Very good location,I had a single room at the rear of the hotel which was clean and tidy,but very basic,the view from the window was of air con units etc but still good value, out all day doing what a tourist should do, so did not spend a lot of time in the room.Night club noise until 4.30 every night when i asked the receptionist he did agree there was a night club at the rear of the hotel (strange as no one else has reported this)the breakfast was very poor old bread no cold milk and no bowles for the cereal, with a little more effort it could be a good deal better.this is a budget hotel and its location is what makes it ,be very careful of the pick pockets thou not in this hotel but in barcelona itself ,i thought i had seen it all but barcelona takes the number one spot.you have been warned..", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“Perfect location,directly on Rambla”", "Author": "Tudor_10", "ReviewID": "UR121320794", "Content": "The main advantage of the hotel Fornos is position and price convenient for the area.Is ideally located for visiting the famous La Rambla, 30 m from the Market Reial,Palau de Guell 50m, to 400m from La Seu Cathedral, near KFC Mc'Donalds, 3 min.from metro station Liceu, the Boqueria Market and the Carefour, the max. 10min from the sea and Port Vell or Catalonia Square. The rooms are spacious with windows to La Rambla or to small inner courtyard. Noise in both tipe of rooms. Features very good compared to the number of stars: new furniture, simple, including a desk in the room, flat screen TV, safe, air conditioning, ceiling fan. Large bathroom with soap, shampoo, shower gel replaced daily. Note 10 for cleaning. Changing the bedding and bath supplies like cleaning: daily. Free Wifi near reception, where there are computers. There is room for luggage. Staff at reception: most are helpful. Asian receptionist not. Price: 60 euro / single, 90 euro / room. double (in July). Hotel indicated for people who want accommodation in \"core\" of the action and close to most tourist attractions in Barcelona (on foot). Contraindicated wishing for rest and quiet.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Johannesburg", "Title": "“Location location location”", "Author": "irmaSA", "ReviewID": "UR119402522", "Content": "Hotel Fornos is really not fancy or romantic - but it's clean, the staff are friendly and helpful and the location is GREAT! The balcony doors and curtains block out all light and most of the noise and we had no problem sleeping through the city sounds. La Rambla really stays awake until 6am. We spent a lot of time sitting on our little balcony watching all the action below. Jess, the lady at reception was super helpful with sight seeing advice and even looked after our luggage after checking out.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not bad value, on the Rambla”", "Author": "james S", "ReviewID": "UR118410562", "Content": "this is a budget hotel but reasonable value. Good size room and toilet, somewhat basic but air con worked and it was clean. its next to the Plaza Real, there is a restaurant there where everybody was in line for with their guides but not one other restaurant had a line. curious..... not near the gay area, you need to be in Example", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Basic but good”", "Author": "pattdf", "ReviewID": "UR114698972", "Content": "The single room is quite small but has all it's needed for a short stay, it was very clean and in a very good location for walking to many turistic atractions.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“We loved it and we'll be back!”", "Author": "Estaes", "ReviewID": "UR114334327", "Content": "No one listen - wonderful hotel! Right on the Rambla! Clean, comfortable room, all new (well, or so it seemed to me). From the balcony - beautiful view of the Rambla! Ask for rooms that are on the top floor! When, after the trip, we were back in Barcelona, we had already booked another hotel - neutral - so that there is, to compare with. Fornos - the best hotel, we are so sorry that once again did not stop there, but it was too late. When we again in Barcelona - only Fornos!", "Date": "June 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alkmaar, The Netherlands", "Title": "“Great value”", "Author": "LudoNL", "ReviewID": "UR91686295", "Content": "Great value for money. Cheap, clean and excatly what you need in Barcelona. Situation is ideal, right on La Rambla. But once you close the balcony doors, you hear nothing. The staff were friendly and helpfull.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Extraordinary Hotel , Good value for money , Perfect localization”", "Author": "Malanese", "ReviewID": "UR89658926", "Content": "Hotel Fornos is located on La Rambla - main touristic street in Barcelona. Hotel is very clean ,rooms are simple with small bathroom and small TV. Main merit of this Hotel is localization.You have very close to all atracions (except Sagrada Familia).Ideal place for young people who traveling for fun and nightlife. Hotel is very cheap (50 Euro / room), Staff is very friendly and helpful.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perpignan, France", "Title": "“A good cheap place to stay on las ramblas, Barcelona.”", "Author": "dgcourriel", "ReviewID": "UR63888292", "Content": "If you are not going to be in the hotel all day but just at night to sleep, then this is the hotel for you. It's a 2-star hotel but it's cheap, clean, has internet/WiFi and is situated right on the Plaça Reial, next to las ramblas. the hotel is about a 5-7 minute walk to either the Metro station Liceu or the Metro station Drassanes. At this particular spot you are surrounded by bars, restaurants and the Gothic District (Barri Gotic) of Barcelona, close to many of the city's main tourist attractions. Once here, you hardly ever need a taxi or a car! Another advantage is, you can walk 12-15 minutes to the Plaça Catalunya to take the Aerobus to go to the airport. This hotel is perfect for those who are looking for a budget-hotel or who are just going to use the room to sleep and put the luggage down. It has no air-con, so in the summer the room will be hot, even with the fan on. The room is small but clean, they change the towels and soaps daily. But because you are on the Plaça Reial, you will hear some noise when you sleep in your room, but hey it's a 2-star hotel, so that's ok! Only thing to be careful is that the reception desk does not like it when you take your room key outside the hotel, so always leave your key at the desk when you go outside the hotel. Security wise, the hotel is safe. Payment can be done by credit-card or cash. It has it's own online reservation on the internet, but you could also reserve your room via the online reservation that is on the Turisme Barcelona's website.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Sydney", "Title": "“Please do not make the same mistake we did.. - do not stay here!!!”", "Author": "SydneyCooza", "ReviewID": "UR38737416", "Content": "Our first mistake was arriving in Barcelona and not having pre-booked accommodation, we walked down Las Ramblas and stumbled across the Hotel Fornos, just set back from the road and in a great location. This was the only good thing about this hotel. The man at the desk was rude, didn't give a toss about our requests, the internet didn't work (and again the guy behind the desk just shrugged his shoulders), the room was foul, the fans in the room didn't work and the bathroom was not safe to wash in for fear of catching something. Please read the other reviews on this place and draw your own conclusions. It's rare that I write on here but when something is this bad, you don't want others to make the same mistake....", "Date": "August 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Bristol", "Title": "“Never ever stay in this hotel!”", "Author": "BristolMusafir", "ReviewID": "UR33929688", "Content": "The location is good, but the rooms and the staff not. I havent booked the room in this hotel in advance, just came there and was glad that they had free rooms, as all other hotels were full. Now I understand why this hotel had a lot of free rooms. The shower was not working properly, they hadent provided me with the breakfast as it was agreed when I was checking in and officer told me the the price of 60 euro include breakfast. But the most awful thing was to receive a phone call from the officer at 4.30 am who asked me whether I was going to prolong my stay for tomorrow. Never ever stay in this hotel!!!!!!!!", "Date": "July 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, value; Not for everyone”", "Author": "voyagerparlermanger", "ReviewID": "UR29249282", "Content": "Hotel Fornos is located right on La Rambla, which is perfect-- not too far from subway stops, shopping and the port. You're right in the heart of a main street, where it's super busy and no one seems to sleep-- at all. I was in Barcelona the same time everyone from Manchester, England seemed to be as well, watching the futbol match, so it was super loud with the partyers on La Rambla--and every other nook in downtown Barcelona, no matter what time of day or night. The hotel room is small-- for a single, after all-- but it was clean and served its purpose. It's a no frills place-- ideal for college students and backpackers. NOT for the high maintenance! It's value for being on La Rambla was great, too. The hotel smelled like cigarettes that have permeated through the walls for years, so I often propped the door to the balcony open to let in fresh air. If noise and cigarettes don't bother you, than this is a good place.", "Date": "May 3, 2009"}], "HotelInfo": {"Name": "Hotel Fornos", "HotelURL": "/ShowUserReviews-g187497-d643456-Reviews-Hotel_Fornos-Barcelona_Catalonia.html", "Price": "$86 - $182*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">La Rambla 44</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002 </span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "643456", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/81/6c/hotel-fornos-thumbnail.jpg"}}