{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Kame Hall Suites”", "Author": "Jimmy__81186600", "ReviewID": "UR127261955", "Content": "We stayed in the Kame Hall apartments for 3 nights. The apartments are a good size and very comfortable and clean. The apartments are very close to all the major attractions in Rome. All in all we were delighted with our stay in Kame Hall.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Perfecto”", "Author": "Handyman79", "ReviewID": "UR126034255", "Content": "We stayed in Kame Hall for 3 nights on a short sightseeing trip. Kame Hall is 4 individual serviced apartments and a communal area on the first floor and Kame Hall is styled in a modern fashion which was very much to my taste. Room was large and very clean by Rome standards and bathroom was massive (great shower). Apartment situated just off a beautiful Square with a Turtle Fountain. There was a small fridge in the room with yogurts and pastries, there was also and excellent espresso machine in the lounge area. TV in the room, Italian sky, but you wont be watching much TV in Roma. You just use a key code to get and and out of Kame Hall and then use an individual key card for your room inside. Location of Kame Hall is really excellent, 5 minutes from Pantheon, 10 from Piazza Navona, 15 Minutes to Trevi Fountain & Spanish Steps, 20 minutes to Coliseum and Palatine Hill and 25 minutes to the Vatican - all walking distances, especially on a lovely spring day! Owner Simone was extremely helpful and booked taxis for me and my partner to and from the airport and also gave us a map of Roma and advised us on where to go. He gave us his contact number and told us to call him any time we needed assistance. Overall I would highly recommend this B&B for the no fuss traveller, in my opinion you get a lot more for your money than staying in a traditional \"hotel\" in Rome.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Crawley, United Kingdom", "Title": "“Modern, spacious and clean rooms in the middle of Rome”", "Author": "aroundtheworld57", "ReviewID": "UR125398501", "Content": "Is a clean place that has good sized rooms and bathrooms with easy access to the city of Rome. From here you can reach all the major attractions by foot. It is not a traditional B&B in that there are four rooms with their individual bathrooms on this floor dedicated to Kame Hall with a little unmanned reception desk. It is therefore important to let them know when you arrive and that you have a mobile phone on you from which you can initially call the host in order to let you in. The rooms are clean, modern, spacious and have everything you need for a long weekend to explore the city. Although not particularly Italian they offer you breakfast in the morning. There is a little fridge in your room and a coffeemaker in the hallway to get you started for the day. However, I’d recommend saving your appetite for one of the many coffee places you will pass while exploring Rome. What was nice and useful was to have free wifi in the hallway and we had excellent restaurant recommendations when we checked in. The only downside I found was that I had a special diet request in advance and was told that they would not be able to cater for a gluten free diet – something that is usually no problem on my travels.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Crowthorne, United Kingdom", "Title": "“Clean simple and central”", "Author": "Caley838", "ReviewID": "UR118784921", "Content": "The rooms and bathrooms are nicely furnished. For a traveller that doesn't require assistance and just wants to explore the city you couldn't ask for anything more. They should forget about supplying breakfast as it's just pre packaged pastries and you'd rather go out for sure! but other than that can't complain. Only note to make if you are staying here is the address as taxi drivers do not know of it yet and it's not on their emails that they send to you in confirmation so make sure you write it down before you go!", "Date": "September 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent hotel, we highly recommend this hotel”", "Author": "einats10", "ReviewID": "UR114726172", "Content": "The room is big enough, the bathroom is very big. The room style is very modern and the location is fantastic. It's near the Jewish getto, near piazza Navona, near Pantehon, near Campio de Fiori. Also very close to the nice Neighbourhood \"Trastevere\" , just cross the bridge. We took bus for the Vatican ( altough you can walk also to the Vatican). There a lot of bus stations nearby you can use if you don;t want to walk. The owner Vittorio is very nice, he welcomed us and provided a map and explanations. And showed us where is its store so we can come and ask questions if needed. There is free Wifi in the hotel. The breakfast is available in the refrigerator ( milk, cornflakes, cheese, yogurts, etc' which is good enough to start your day. I really recommend this B&B.", "Date": "June 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Surrey, England", "Title": "“Fantastic place”", "Author": "surreynano", "ReviewID": "UR103449211", "Content": "On a beautiful square in a very convenient location. Rooms were modern and well appointed. The brothers who run the place were very helpful. This is not a hotel, more like serviced apartments, so ideal if you are a low-maintenance traveller. Breakfast was functional not luxurious, but why not go to one of the excellent local delis the night before to pick up some local produce? I would have no hesitation returning or recommending.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Perfect location, genuinely personal service, great value”", "Author": "Alistero", "ReviewID": "UR98434505", "Content": "Hard-working brothers Vittorio and Simone offer a truly personalised service to their guests, everyone is treated as an individual and given a warm Roman welcome. The B&B apartments are in an excellent location, in the unique atmosphere of the old Ghetto, off the main tourist drag, but arguably represent the most strategically positioned accommodation in the centre of Rome. Within a 10 minute walk you have Piazza Navona, Campo de' Fiori, the Roman Forum, Trastevere and the Pantheon. Rooms are clean and in good condition. We have already returned following our first stay and have two more booked. Kame Hall is the sister accommodation to Little Queen.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great room, great location, highly recommend Kame Hall”", "Author": "d0ran", "ReviewID": "UR90536344", "Content": "Just returned from a weekend in Rome when we stayed in Kame Hall. Contrary to other reviews, its very easy to find as its just off Piazza Mattei which all the taxi drivers knew. Kame Hall comprises 4 rooms with a communal self service breakfast and coffee area (open all day). Our room was very big, as was the bathroom with a great shower. The room could have been in Brooklyn NY as it the decor was very modern so if you're after baroque style Rome antiquities this isnt for you. The 4 rooms are also at the top of a flight of stairs which was no problem for us. It was spotless, really lovely and really big rooms. Fridge and tv in room also. Comfort and style-wise, its on a par with a 3* hotel room so all you miss is hotel reception / concierge / lobby areas. Vittoria the owner was very helpful. We had his phone number at all times and his shop is only 2 minutes around the corner. He recommended a great restaurant to eat in - Solo Margherita - just around the corner (no name above the door, and no menus, just daily specials). The location was great and we only used a taxi to get to and from Campiano aiport. Otherwise we walked everywhere and took in all the main sites. Kame Hall is located close to the Jewish quarter so Sola Margherita was one of the best dining experiences we ever had. On our last day, we ate in Nonna Betta, also in the Jewish quarter and very highly rated by Tripadvisor (!) and it was the worst meal we had. We crossed the bridge to the bohemian left bank and enjoyed a fantastic value meal full of italians there on a Sat night. Another night, we ate in Pain et Vin, literally on the corner across from Kame Hall. The only downside was the breakfast as it was all packaged, supermarket food. We didnt bother with it on the second day. However for price, value, size of room etc, I would definitely recommend Kame Hall. All in all,", "Date": "December 23, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Minneapolis", "Title": "“Lovely location, comfortable beds, newly updated, sleep to the sounds of the fountain”", "Author": "jules1116", "ReviewID": "UR86172640", "Content": "My daughter and I really enjoyed this B & B. Very clean, comfortable, loved the Jewish Ghetto area. This area is not primarily Jewish but it's characater is still built around the Great Synogogue and only Jewish school in Rome and small pedestrian cobblestone road with Jewish stores and kosher restaurants/bakeries. The bakery/deli is outstanding for takeout sandwiches, pizzas. It's now an artsy district very close to the beautiful Pantheon area and in walking distance to many sites and near the bus. I agree to take a cab from airport. Staying near the bus terminal is not nearly as nice and not in walking distance to main sights. Towels, be sure to keep them separate because they do not change them every day and they may fold them and put them all together. Nice owners, do their best to be helpful. Don't expect travel literature in B & B's or hotels in Italy, come prepared, HAVE A CELL PHONE. Must make reservations at many of the good restaurants all over Italy or you'll be stuck eating mediocre food for tourists. Also, many cities you have to call for a cab, flagging them down is not acceptable.. DO YOUR RESEARCH on restaurants or ask people when you get there. Bring a book of Italian phrases. MANY people DO NOT speak English. Have a cheat-sheet. It's fun to try and connect with people. After leaving Rome, do not consider renting a car UNLESS you order and get confirmation in advance that you will have a GPS. GPS is usually pretty great there. If you don't have one, you can deal with a map the size of the inside of the car and good luck to ya.... HAVE FUN!! You can't go wrong in Italy no matter what you do...", "Date": "November 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great central location. Would stay again!!”", "Author": "TravelCouple92", "ReviewID": "UR83666160", "Content": "Stay with spouse in early October for 3 nights. Close to all the sights & price was good. It was a little inconvenient that the Wi-Fi was not working; i had to stand outside the owners' store to use their wi-fi but at least they were nice enough to offer...Great restaurant recommendations by Vittorio & they handled our transfer from airport very smoothly....room was very modern & roomy & we would definitely recommend staying here.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bologna", "Title": "“A very nice place, but quite expersive”", "Author": "M M", "ReviewID": "UR79523983", "Content": "I stayed at the Kame Hall with my wife both in April and in July 2010. The place consist in 4 rooms and the reception. It is not really an hotel, but a B&B without breakfast... so it is just a place where you can sleep. The rooms are big and well furnished with many comfort (TV, phone, ADSL) and it seems that they have been recently renovated. Bathrooms are really great with shower and bathtub. The position is probably one of the best in the city, close to many bus-stops, but you can reach, in a few, most of the attraction of the centre even by foot . The price for a double: 120-200 € according to the season.", "Date": "September 14, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Sydney", "Title": "“Scam alert, do NOT stay at Kame Hall”", "Author": "MsMandMrG", "ReviewID": "UR46330603", "Content": "My boyfriend and I had made a reservation to stay here approx three months prior to travelling. One month before our departure, we called the staff at Kame Hall to confirm our reservation and were led to believe that everything was in order. Upon arrival in Rome (after a very long flight from Sydney) we were told that there was a 'problem' with our room. What the problem was exactly was never made clear as we were not able to see the room or get a true understanding of the situation. The female staff member informed us that we would need to stay elsewhere for one night and that she had made reservations at a nearby hotel. She walked us approx two blocks to a hostel that could only be described as a slummy dive (I would estimate around 50 - 80 euro a night) and told us that we could probably move back tomorrow. By this time my boyfriend and I were annnoyed and suspicious. We had read previous reviews on Tripadvisor of other people that this had happened to at Kame Hall (I believe that these have now been archived) though given our precautions, thought it would be fine. It is usually common practise in such situations for the hotel to arrange accomodation at a much better hotel when they have double booked (they never indicated that they had but it was obvious that that was the case) or have a large unspecified 'problem' with the room. Kame Hall had instead put us into a slum in the hope that we would swallow it and they would make a few extra $$ on the side. By the time this was apparent, it was 5pm on a Saturday night in the middle of summer when the G8 was on. My partner and I ended up walking out, with nowhere to stay, and finding another hotel a few blocks away that was more than we had budgeted but at least was honest. The entire situation had been both awful and a clear manipulation. Since returning home we have lodged a complaint with Rome's new tourist police in the hope that other people will not have to suffer the same fate. Do NOT stay at KAME HALL or if you do, plan to get fleeced.", "Date": "October 8, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "quesochica", "Title": "“Great centrally located small hotel for the independent traveler”", "Author": "quesochica", "ReviewID": "UR37998978", "Content": "Pros: Fantastic location. Very walkable to Campo di Fiori, Piazza Navona, Pantheon and to the Forum. And it's 1 block from a major intersection for many bus routes. Our room was great. It was large, nicely appointed and also had a small table and chairs which allowed us to have a nice wine & cheese dinner in one evening. The bathroom was so big I thought it was some sort of testament to the classic roman bath. And the price is right as this part of town is expensive. Cons: there are no services available. We saw the lady in charge of finances for only a moment. And the guy who is there to clean the rooms and check you in was always very polite but doesn't perform typical front desk duties such as train reservations. So, if you are an independent traveler and able to manage your own itinerary and get yourself around, then by all means stay at Kame Hall and use the $$ you save to go out for some nice dinners.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Erwitte, Germany", "Title": "“Perfect for the independent traveler...”", "Author": "Schnap", "ReviewID": "UR22449271", "Content": "Stayed in the Leonardo Suite for 3 nights at the beginning of October and it was close to perfect. Kame Hall is more of a 4 room very modernly, cleanly designed bed and breakfast than a hotel...and for 200 EUROS/Night an absolute steal in Rome, which I doubt will stay that way should more people discover this secret gem. As stated in other reviews the \"front desk\" is not always occupied so if you are looking for concierge, etc. not for you - although they do give you a cell phone you can call anytime. But for those looking for a clean, bigger than average, comfortably (and we are very picky) bedded room with all the necessities: safe, hair dryer, toiletries, plasma tv (mostly Italian TV - which didn't bother, we were in Rome, not there to watch tv), tea and coffee maker, big closet with hangers, table and chairs for breakfast...and in our suite, marble bathroom with a jacuzzi for your Rome-walk worn feet with a fantastic larger headed modern shower, double sinks, bidet - - this is the place for you ! Yes there is no phone in the room but do people really use phones in hotels anymore - at those inflated prices ?? Rent a cell phone at the aiport ! Breakfast was Italian and lovely - brought to your room at the time you picked by writing that time on the laid out schedule in the front hall the night before - café (espresso) to kick you awake, jam filled croissants - warm, bread, orange juice, coffee, tea, coffee, tea....continental. But the best....the location. Down the street from Largo Argentina in the middle of the Ghetto, a few blocks Teatro Marcello, Forum, nightlife Campo di Fiori -you can virtually walk everywhere although with all the motorinos and cars Rome is not my favorite walking city. Old, ergo often no sidewalks on smaller streets. Yes, Vatican is a march but we are walkers so not a problem for us. For those that need a computer, you can use the unit at the front desk with no problem.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Love the modern simplicity of Kame Hall!”", "Author": "jennb_AZ", "ReviewID": "UR22262295", "Content": "We loved everything about the Kame Hall! It's a tiny place.....just 4 rooms and everything is so nice. The bed is COMFORTABLE and has lots of fluffy pillows! This is one of the first comfy beds I've had in Italy! The shower is awesome - it closes fully (which isn't always the case in Europe) and has great water pressure. It even has the large circular head from the ceilling that pours water straight down....very contemporary and very nice. It was great to take a nice hot shower after a chilly day in Rome! The rooms and decor are great and include a plasma TV and satellite. Again, clean and simple. The hotel is well designed and I can tell someone put a lot of thought into it. Now...the location.....it's also great! We took a cab to Vatican City but walked everywhere else. If you are looking for a clean, beautiful, nice, reasonable hotel in a great location in Rome, then look no further!", "Date": "November 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manassas Virginia", "Title": "“Roman Oasis”", "Author": "AnnManassasVirginia", "ReviewID": "UR14656854", "Content": "What a wonderful surprise! Don't be alarmed by the unimpressive entrance! Once we found The Kame (very difficult), and saw our room, it was worth the effort after a long flight. We had a rental car and they have a parking lot off site that costs @25.00 (euros daily).The hotel is very central and walking distance to all the sights. It is also next-door to several cafes for a quick latte or glass of wine. Our room was extremely clean and modern. The small staff, very friendly and helpful. Can't beat the price in a very expensive city...I would definately stay there again. Street noise (mostly the scooters) could be an issue for \"light sleepers\" but Rome is a \"busy\" city. Also, any people with disabilities might find the long stairs to the rooms and reception a problem (no elevator). I have already recommended The Kame to friends visiting next month...it is a very convenient, clean and inexpensive little hotel.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "plymouth ma", "Title": "“Kame Hall - boutique residence, lovely, and amazing location”", "Author": "plimoth1620", "ReviewID": "UR10131272", "Content": "We are from Plymouth MA, USA, We have spent a week at Kame Hall, I'm in the room now writing this review before I pack to head to Florence for another week. Kame Hall has been a wonderful place to stay in Rome; Its not really a hotel but rather a boutique residence tucked away on a small piazza right in the middle of everything. The Roman Forum is perhaps a 5 minute walk at best. 10 minutes or less to the Pantheon, and there are ruins at the end of the alley. Though I didn't come to rome to hang out in my room, , , opening the windows and watching the activity in the piazza has been great fun. Other things to note: the queen bed is excellent, the bath is elegant, the room overall is about the size of any modern hotel, and the breakfasts are fine. Roma, perchè ho atteso così lungamente per vederlo? Gazie to the staff and Emanuela, Richard & Connie", "Date": "October 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Westport, Connecticut", "Title": "“Modern haven in an ancient city”", "Author": "Sue&Jim", "ReviewID": "UR7952447", "Content": "We stayed at Kame Hall for 2 nights before leaving Rome. It is well situated and somewhat reasonable. Upon arriving, the gentleman proceeded to offer us a smaller room than we had reserved. After questioning this, we were wisked to the correct room - The Leonardo- a suite with a jacuzzi, giant showerhead, double sinks and fabulous marble appointments. Understand the following and you will enjoy your stay: The entrance from the narrow street takes you up a flight of stairs to a small \"lobby\" which consists of a front desk, small counter and minimallist furniture. It's new, modern and spotless, with touches of antique beams and stonework. There appear to be 4 guest rooms and there is minimal interaction with any staff. Breakfast is room service only, provided you complete your request and leave it on the desk the night before. We discovered this by accident. The flat screen TV is useless unless you understand Italian and there is no telephone in room.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Undiscovered & great Rome B&B”", "Author": "SFreeth", "ReviewID": "UR7634622", "Content": "Rooms were swank, clean, convenient & good value in this apartment-concept B&B. 4 double rooms sit on 2nd floor of this hotel, access provided by door card key that also functions on outside door so we felt very self-sufficient in a smaller guest house. Reading earlier review for the same weekend, I arrived completely off schedule & the polite man looking after the place was easily ready for me--the credit card machine issue resolved by time i left as we had no problems. Location is a few minutes walk to Pantheon and Campo dei Fiori so truly convenient. Rome is extremely walkable city so guess it didnt matter too much but was nice to be in the heart of it. Only drawback was breakfast wasn't anything great... could order what you wanted but i would have preferred sitting in a nice cafe. For the moment, rates are extremely reasonable vs other options in the city--go while you can b/c i'm guessing the rates will go up. i paid 130 euro per night for 1 person in a double room... guessing i got a bit cheaper rate than the 180 b/c it was majorly last minute, either way its great.", "Date": "May 17, 2007"}], "HotelInfo": {"Name": "Kame Hall", "HotelURL": "/ShowUserReviews-g187791-d646545-Reviews-Kame_Hall-Rome_Lazio.html", "Price": "$145 - $211*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Paganica 9</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "646545", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/30/37/3037a6358c31aed1be179fada5448b691large.jpg"}}