{"Reviews": [{"Content": "Awesome! I'm new to TripAdvisor so this review is based on my experience 12 months ago in November 2007. But I have to put in a good word for this hotel, Taman Rahasia in Penestenan Kaja near Ubud, Bali.My partner and I stayed here for a week and were treated amazingly. The staff is small and extremely friendly. The room was very large with a four poster canopy bed, sitting area, fridge and large freestanding cabinet / closet. The bathroom was out back and was literally outside. It was also very large and had nice tropical plants around the edges and a very high wall for privacy. The room service items were delicious and inexpensive and the breakfast was tasty every day. We met the manager, an American woman, who was really friendly and gave us good information. The hotel is perfectly situated about a 25 minute walk outside of Ubud. There are a couple of small restaurants on the path between the hotel and the Tjampuhan steps that we pretty much ate at every night. Again, this review is based on my experience a year ago. Hopefully the place has only gotten better. I HIGHLY recommend it and would be happy to share other information about it to anyone.", "Date": "Dec 29, 2008", "ReviewID": "UR806081291", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "JayBos"}, {"Content": "Return to Paradise in Ubud This is my second visit to this particular Ubud property and I have to say that the second visit just confirmed my opinion that Taman Rahasia is a gem of a property. I have stayed in many of the 5 star Ubud properties - Waka, Como, Maya, Pita Maha, Allila etc - and while these properties are wonderful - value for money you cannot beat Taman Rahasia - particularly if you don't need all the 5 star fancy trimmings of phones, room service, internet connectivity etc.The staff are attentive and hospitable. The massages are very good - particularly now that Tamana Rahasia has opened set up one of the rooms for spa treatments. The simple food menu is excellent and well prepared.The location of the property just outside of Ubud is also great - you are just a five minute taxi ride away from the action of central Ubud should you so desire while being able to peacefully explore the quirky backstreets of the local village with its galleries and craft shops.If you wish to walk to Ubud then a stroll through the paddy fields to the main road is just the ticket.The hotel grounds are truely encapsulated by the name Taman Rahasia - secret garden.", "Date": "Sep 17, 2008", "ReviewID": "UR416749687", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Karuna_7"}, {"Content": "Loved the location, the secret pathways, the bathroom, the staff       Secret Paradise", "Date": "May 13, 2008", "ReviewID": "UR331346169", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Norn"}, {"Content": "Paradise found If you are looking for a quiet slice of paradise, this is it!We stayed at Taman Rahasia for 7 days during a 2 week holiday in Bali. Having been to Bali several times, Ubud is our favourite place to return to for the beautiful countryside and cultural pursuits. You can day trip to almost anywhere in Bali from here.Taman Rahasia is hidden away in the little village of Penastanan, just west of Ubud central, in a coconut and bamboo grove. There are only 7 rooms, so it feels like a private villa. Rooms are spacious and well furnished - we had a Deluxe room with king-sized four-poster bed and outdoor bathroom, terrace and daybed, for $US100 per night.The discrete and professional staff welcome you warmly, even when you arrive after midnight, as we did. Nothing is too much trouble to organise - drivers, laundry, special dietary needs.We also took advantage of other activities available here - a one day cooking school, with a visit to Ubud food markets and hands-on cooking in the pavillion in the garden was a highlight - and of course the delights of the Day Spa. A relaxing, professional massage is about $US12.Just outside the back door of Taman Rahasia is rural Bali at its best - watch women threshing rice, duck farmers herding flocks of ducklings, and fields being planted with rice as you walk through the paddy fields to (almost) local restaurants such as Indus, Mosiac, and Murnis. The Neka Art Museum is in the area as well and is worth a visit.A truly memorable place! We'll be back.", "Date": "Jul 16, 2007", "ReviewID": "UR465356889", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "barbrajayne"}, {"Content": "a little gem       room", "Date": "Jun 6, 2007", "ReviewID": "UR149777823", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "gonggirl"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d647532-r23084013-Taman_Rahasia-Ubud_Bali.html", "HotelID": "647532", "Price": "$122"}}