{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“At the heart of Barcelona”", "Author": "Marielisediane", "ReviewID": "UR127656293", "Content": "I went to Barcelona alone in May 2010. I wanted a place to stay close to everything (or at least, the most of it). Hotel Condal is surely in the heart of things to see. A few steps from Las Ramblas, in the old Barcelona. I loved this place. I could walk to every place I wanted to go except Montjuic and La Sagrada Familia. The people at the counter are discreet and friendly. The room I had was very clean. Just be prepared to be awaken at 3 in the morning by people come back from partying if your room is on the side of the street. But I liked waking up in the morning and opening the windows and seing the street coming to life. If I go back to Barcelona, I will choose this place one more!", "Date": "April 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good price but next time I prefer to book some where else.”", "Author": "Muhammad K Posted by an Easytobook.com traveler", "ReviewID": "UR124486032", "Content": "I stayed in hotel condel for three nights with my girlfriend. Room was clean and tidy. Television was very small and volum was not enough. Hotel location is very perfect. Man on reception not helpfull, if you ask them for any attrection places or if you want to go some where. They will tell you go on La Lambla street and ask from there as there are so many tourist information. I stayed in feb it as bit cold night time , but my room heating was not good enough and I reported to reception as well but they didnt do any thing.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frederiksberg, Denmark", "Title": "“Clean and affordable”", "Author": "Sara R", "ReviewID": "UR123842648", "Content": "Hotel Condal is situated in the fantastic quarter Barrí Gothic and right by La Rambla. The rooms are very clean and basic (and somewhat small), but with a bathtub. Very nice with no fuss to it! On the down side the staff is not super friendly, but with a good guide book you will figure out everything you need on your own. Highly recommended if you don't have endless funds to spend on your hotel.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barcelona, Catalonia, Spain", "Title": "“Great location, good value”", "Author": "Lilsapito_12", "ReviewID": "UR122599228", "Content": "Safe and great libation, perfect for single traveller or couples. Free wifi connection. Lots of restaurants and stores in the area, close to subway stations and famous central market. Walking distance to the aquarium and beach", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gloucester, United Kingdom", "Title": "“average a good description”", "Author": "dingerrosie", "ReviewID": "UR121056868", "Content": "Situated in the main area of barcelona,, plenty of bars and eating places. on a tourist area called the rambles. if you are ok with noise, or are planning to stay out late, very late, then you should be ok. rooms very basic, only soap and towels provided.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Albertslund", "Title": "“Excellent location in Barcelona”", "Author": "kareca", "ReviewID": "UR118679739", "Content": "Hotel Condal has an excellent location in Barcelona, just in the middle of the gotic area. Easy to find and just a short walking distance from Placa de Catalunya, which is the end station of the airport bus. From Catalunya you walk down La Rambla to Metro station Liceu, where you find C. de la Boqueria. From La Rambla you can see the Hotel. The Hotel is a 2** hotel with friendly reception desk keeping the room keys. The room were clean and supported with new towels every day. The twin room had two chairs and a small desk, air condition, bath and shower. We found the beds a little bit hard to sleep on. Elevator to 5th floor at the hotel. Ask for a room at backyard, which reduces the noice from the Travel Bar close to the hotel. At the ground floor there are a cafeteria where you can buy items for breakfast. Cafeteria room is uncomfortable, so suggest to find a small cafe for breakfast, which is very easy. End of September is a very good period with an excellent temperature 25 celcius.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Saratoga Springs, New York", "Title": "“Location is all it has to offer”", "Author": "adam_burnett", "ReviewID": "UR118445307", "Content": "Great location near La Rambla, but the rooms and bathrooms are pretty terrible. Given the great location, the price is in-line with the quality so it's a sacrifice for sure.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Service": "3"}, "AuthorLocation": "Alexandria", "Title": "“What a dump!”", "Author": "MikeAlex", "ReviewID": "UR116071928", "Content": "I am not a hotel snob when I travel. I just want a clean room and a comfortable place to sleep. What I got was a semi-clean room with bed bugs. When I complained, I was moved to a different room. There didn't seem to be a problem with this room, but it's only a matter of time. Also, if you do decide to stay here, be warned that it's on a noisy street and that hostels surround it. Bring ear plugs! I was glad that I did. Do NO stay here.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "2"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Basic, clean and adequate for travellers”", "Author": "lec1trs", "ReviewID": "UR114835481", "Content": "We stayed here as a large group of males and found the hotel more than adequate for our needs. It is very basic but clean and serves the needs of those going to Barcelona on a budget or travelling. It's location near La Rambla is excellent, however care should be taken after 2am due to pickpockets etc (this is the same across Barca). I would recommend this hotel for thos eon a budget but those looking for a cheap luxury hotel in Barcelona should avoid. Fulfilled expactations.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London", "Title": "“Good for the price paid”", "Author": "Skygirl81", "ReviewID": "UR112562170", "Content": "We were a set of friends and not all of us had a lot of money to spend and so we were looking for a centrally located hotel in Barcelona that was reasonably priced. The Condal prooved just perfect for what we were after. The hotel is definately \"economy\" in standard, but was clean and our bathrooms were in a reasonable standard. The location is just perfect, as you can walk everywhere. Barcelona city center has, however, as most European city centers its share of beggers, vagrants and muggings, but the area is not worse than most areas of Barcelona. If you want to stay in the middle of a city in Europe one has to accept that there are some undesirable people around the place. We all enjoed our stay in Barcelona and we will choose The Condal again - should I not find a rich husband or something !", "Date": "June 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Mountain View, California", "Title": "“Skip this NO ammenity High Cost Hotel”", "Author": "TLVDB", "ReviewID": "UR108388758", "Content": "The only benefit of staying at the Hotel Condal was the location. It is in the middle of everything down an alley off La Ramblas. It was recommended by a friend and I she told me ahead of time that it was only the basics. However, it provided less that even the bare bones. No Shampoo, no hair dryer. The only thing provided was soap. It felt like a really old hospital room. The front desk was not very helpful when asked about places to eat, etc. The bed and sheets were uncomfortable (hard and scratchy). The hotel name felt like it was spray painted on the towels as they were so scratchy in that area. The worst was that my brother arrived from the US (we were going on a cruise that day) 50 minutes before checkout time. The front desk would not allow him to go in my room for that 50 minutes while I finished up packing. They said it would be a charge for another person. After a big argument, he came up anyway and in the end they did not charge me. However, for $181 Euros for 2 nights, this hotel was a big disappointment. The room was clean and that is very important to me (the biggest factor for me) but the price was way off for the room and lack of amenities.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Clean but dodgey location!”", "Author": "kjonesy88", "ReviewID": "UR104701925", "Content": "My friend and I (both female aged 22) stayed at this hotel for 4 nights. It was in an ideal location in relation to La Ramblas, the main street, however, it is situated just off the street down an alley way. On our way home from a night out (around 5am) we were grabbed in the alley by 2 men who tried to drag us down a smaller alley. This was extremely scary and put us off going out at night. However, we did go out again (just wore flat shoes so we could run) and the rest of our stay was fine. The hotel was clean and just what we needed. Ideal for cost but would stay some place not near any alleys next time!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Egypt", "Title": "“Good Value for money”", "Author": "N0uchie", "ReviewID": "UR101724284", "Content": "Condal is a typical \"okay\" hotel, rooms are clean, but it is in the heart of la ramblas so it might get noisy on Saturday nights where u can hear all of the shouting of the bars outside the hotel. Receptionist are very unfriendly and spoke little english. it's a good value for your money and basically u get what u pay for. nothing more maybe a tiny little less.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manacor, Spain", "Title": "“Great Location”", "Author": "galah2001", "ReviewID": "UR100618018", "Content": "I stayed May 2010 for 2 nights in the hotel. Loved it. good price, clean room, bathroom did not smell. had a front room the the small street, no problem when windows closed. somehow the additional shutters malfunctioned after I (yes it was me - and I told rezeption) pushed them up by hand. and... besides one can not beat this location for the price. For all who don't know: BCN is a very, very noisy city. I dare to stay there twice a year, and will do in the future.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent for what we needed”", "Author": "travellingvoyageur", "ReviewID": "UR99663360", "Content": "My friend and I stayed at this hotel during our week's holiday in Barcelona in September 2010. We're both 21 and our holiday consisted of daytime sightseeing and night-time partying. For us, this hotel was absolutely fantastic. It was perfectly located in the centre of Barcelona, literally 2min walk from a busy metro stop. Coming home by taxi after a long time out wasn't that expensive, thanks to the location. Now this is really a no-thrills hotel, although perfectly clean and tidy, the room is basic...beds, bath, safe and tv is basically what you get - but you're in barcelona...there's no reason to be in the hotel room other than sleeping. That said, it did have free wifi which proved to be really helpful for checking out details about cultural activities like museums/tours etc as well as clubs/nightlife. The service desk was generally pretty helpful. There were three different people working there we encountered, 2 of which were fantastic, one just very moody, but still helpful when you asked questions. If you are a family or someone that enjoys luxury and staying in the hotel room a lot, maybe look at other options. If you are looking for a clean, simple, easily accessed place to stay, I would definitely recommend this.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“No way next time!”", "Author": "TSKManchester", "ReviewID": "UR91829959", "Content": "Close your eyes and follow the smell of wee, and you arrive at the 1950' style Condal from The Rambla! I am less sensitive, but my other half, who shared with our friend to avoid my snoring, was like a bear with a slapped bottom for the whole stay, due to a near total lack of sleep. We are city people. Sure you expect some noise in an area like that, but it is the on and off shouting in the middle of the night, in the street, ( one seemed to involve a very loud guy, his girlfriend and lots of banging against a shop shutter. We hope it was not her head! ) and what is it with the bin men and collecting all the bottles at 3am? I know they operate at night in hot climates, but it is winter. The guys on reception were quite friendly. One did send a chap up to mend the shower head and we were offered another room, at the back, for the last night. We were told it is just noisy out there! We stayed in a place, for less than 15 Pounds a night in Istanbul recently, that could give this place a run for its money. It needs to be taken in hand and given a good make over, as the location IS great for all the sights. Rooms are a good size, but the beds tiny and the bed covers and general decoration remind me of East Germany in the 1980's. I know I am only sleeping there, apart from an hours snooze before dinner, but I do not want to spend time in a slightly larger than average monk's cell, thank you! Sad to see the young African girls selling themselves on the street corner nearby, but they did not bother us as such. I got a good enough price online, but we are not going to return! Give it a wide birth.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "zpeck@cox.net", "Title": "“\"PeeYou!\" Stinky”", "Author": "Tiayolanda", "ReviewID": "UR86110955", "Content": "The front desk service and the location for this hotel are so wonderful that I hate to be so negative. But the room we stayed in had a terrible odor coming from the bathroom. It was as though the toilet was not vented properly! Disgusting smell that required we sleep with the window open to the noise below. The room appeared clean but the floors always looked dirty. I came in once and they were still wet from mopping but still looked dirty. The bathroom was very old and I don't think any amount of scrubbing would remedy the situation. Also the room had a tv that was unwatchable...too much static. All in all almost unpleasant stay. Darn because the desk clerks were sooooo very helpful about everything else.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "La Jolla, California", "Title": "“great location”", "Author": "ElleLaJolla", "ReviewID": "UR86093202", "Content": "You can't beat the location of Hotel Condal. It is in the middle of Barri Gotic, less than a minute's walk from Las Ramblas and the Liceu Metro stop, and a 5 minute stroll to La Boqueria. The front desk people are very friendly and efficient, and speak English, although some better than others. What can I say about the room? I would say it compares to Motel 6 in the US. It is an old hotel and in need of some renovation. The 3rd floor room looked out on the Carrer de la Boqueria, so it was very noisy until very late at night. There were automatic metal blinds that did cut down on the noise, but it made the room stuffy.The (twin) beds were quite comfortable, and with earplugs in, sleeping was not half bad. Don't bother with the TV. It had a lot of static and was not worth watching. Besides, there are many interesting sights waiting to be seen outside the room. During the time I was there the room had a distinct raw sewage odor that came from a wall vent inside the shower. I had to keep the bathroom door closed, and even then it was discernible. Although I saw them cleaning the room and floors thoroughly every day with desinfectants, there were some unappealing stains on the bathroom floor. The towels were old and rather threatbare, and it would have been nice if they could have had a bath mat to step on after getting out of the shower. The hotel provides tiny pieces of soap, but you have to bring your own shampoo. I would recommend this hotel to my younger friends who are budget conscious and just need a place to sleep. If you are older and pickier (as my travel companion was), you might consider going a bit more upscale.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“Was everything I expected”", "Author": "machofairy", "ReviewID": "UR85070249", "Content": "I picked this hotel having read all the reviews extensively. Hence I know it would be noisy at night but it was also in a prime location... in the middle of La Rambla, less than 100m from Liceu metro station, on the green line, which is the direct line to most of the places we wanted to visit. The reception was friendly and helpful and fluent in English, whoever was manning the desk. They also have a left luggage area, although it is not secured. They have a dining area but I have never seen it open. I guess, why use it when there are so man eateries just yards away. It is not far from the La Boqueria market where we got our daily rations of fruits and juices for breakfast. Carrfour express was also nearby where we got our crossaints. Thats breakfast sorted! The air con was not working - I dont know if it was deliberate or not, but as it was October,we just had to open the patio doors to let in the cool air. This door led to a narrow balcony which I only went out to once as I did not feel safe on it 5 floors up. At least I was not worried about thieves climbing in at that height! Cleanliness was perfect. Mattress and shower was fine too. TV was only a 14in CRT but at least it had 2 English news channels .. better than some other hotels I have been to with no English channels. Another reason I picked this hotel was the free wifi. Tested the speed and it hovers at around 20kbyte p/s. Sometimes it does slow down and you have to disconnect and reconnect the wifi to continue surfing. However it was functional for webbrowsing. On the safety issue, I had a young kid with me and it was ok. There were prostitutes hanging on the La Rambla corner at midnight but they never bothered us. However, it would be best for kids not to be out past 10pm where shops start closing and some of the side streets off the Ramblas gets a bit deserted. Still I would definitely return here as I had realistic expectations which was met.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“OUCH!”", "Author": "astra_traveler", "ReviewID": "UR83984147", "Content": "Based on the spacious lobby and location, I had high hopes for Hotel Condal. I was sadly disappointed upon seeing the room. In fact I should have left. The room was depressing and small. The bed was a complete nightmare. My boyfriend and I got no sleep that night. Even considering the cheap price and good location I would not ever recommend this hotel to anyone.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Sleepness Night”", "Author": "ED46", "ReviewID": "UR80564298", "Content": "I was attending a conference in Barcelona, so stayed here with my husband for one night. Fantastic location, just off the middle of La Rambla. Easy walking distance to the Gothic area, Placa Catalunya etc. The service was friendly and helpful. The rooms very basic, but clean. Shower hot and powerful. The bed was small and hard- not comfortable. The air conditioning didn't work. Our room faced onto the street, which was very noisy with shop shutters and people all night, thus a sleepless night! The hotel DOES NOT HAVE hairdryers or irons- not great if you're on a business trip!", "Date": "September 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sintra, Portugal", "Title": "“worthwhile”", "Author": "underblue", "ReviewID": "UR79963486", "Content": "If you are prepared to skip the luxuries once in while, for a hotel that has a central location, comfortable bed and a good price, so that the more money in your pocket is spent on the pleasures of Barcelona then this is a worthwhile bet. Some tips, rent a bike for the day, take breakfast in the bar in the square behind the hotel, and indulge yourself in the miriade of tapas bars.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“good choice”", "Author": "nic47", "ReviewID": "UR77080736", "Content": "stayed at hotel condal for 3 nights. the hotel is very clean and in good condition. had a double room, which had a bathroom, air conditioning and small balcony. the hotel is in a perfect location for tourists as it is just of la rambla and easy access to metro and shops. i didnt have breakfast in hotel but plenty of cafes near by. i would use this hotel again as it is a good base for exploring the city. the hotel is basic but thats all you need as there is so much to explore on your door step! there is a 24 hour reception which is great for security. I would note that the street is noisy at night but i didnt find this a problem, as it is to be expected in such a busy city.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Greeley, Colorado", "Title": "“Met Expectations”", "Author": "jone7967", "ReviewID": "UR71252250", "Content": "Hotel Condal is in a great location which was one of the main reasons we chose it. It is right off La Rambla, close to a metro stop - it was perfect. The hotel was kept clean and it felt very safe. There was always someone sitting at the front desk who would greet us as we walked in. The staff were all very friendly and helpful as well. As for the reviews that say it is noisy - well, it is! However, if you are expecting that, it's not a big deal. This hotel is perfect if you are wanting to be out and explore the city, and just need a place to sleep at night. If you are wanting to do more relaxing at the hotel, this is not the place for you - the bed wasn't super comfortable (but felt great after a day of walking all over Barcelona!) and the room was quite small. Definitely a good choice though - I'd recommend this to anyone wanting the experience of staying on La Rambla in the center of the action!!", "Date": "July 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Birmingham", "Title": "“Great location and Value”", "Author": "SirRogue58", "ReviewID": "UR54493571", "Content": "We were so lucky to find this hotel on the internet. We were originally looking for a cheap city break and 1st looked at Travelodge in Barcelona but decide it was too far out and too expensive. We were so lucky that we searched again and found the Hotel Condal. We had originally booked a double but were informed that there was a problem with the 1st night and that only a twin was available (room 405) but we could change the following day but we said that a twin was ok for the 3 nights. The room was all we needed for our short stay. The wardrobe was small but adequate and had a free safe. Satellite TV was what we expected a couple of music channels (Spanish and German) 2 News Channels (BBC World and CNN) the rest were a mixture of Spanish German and French. So don’t go expecting spending an evening in watching TV. There is no coffee/tea making facilities in the room so bring your own travel kettle and cups (no fridge, so maybe long life milk is an option). Also there is no hairdryer. But if you know these things in advance you can always bring your own. The maid came in everyday with fresh towels and did our beds. The hotel website says you can have a la carte breakfast….. I think something happened in the translation as all you could buy was coffee/tea/fruit juice and croissants/toast/pastries for breakfast. - 2 coffees 4 rounds toast with butter and marmalade was about 7 euro. The location of the hotel is great. The street the hotel is located on, is pedestrianised and is midway along las Ramblas, (the walk to las Ramblas is about 1 min). A few doors away from the hotel is the Tapas Gaudi where you can get a cooked breakfast with coffee & fruit juice for a reasonable price. But beware of restaurants in the las Ramblas area that do not display the prices of their drinks. A ½ litre glass of coke can cost 6 euros and ½ litre glass of sangria can cost 9 euro. Even though the food prices seem reasonable watch out for the drinks. There are fast food outlets around such as KFC and McDonalds/Burger King but Pans where you can buy filled baguette meals are good value. There is also the market on Ramblas near the hotel where you can buy fresh food. One place we were really pleased to find for a mid afternoon snack was by la Sagrada Família. Near the stop of the blue bus tour is a corner café where you can buy coffee and croissant for 1.20 euro (I think it’s where workmen from the church go). Palau de la Música is a place we missed seeing as you needed to book in advance and as we had booked the 2 day hop on and off bus tours we could not guarentee getting back in time. If you enjoy seeing the sights you can take a hop on and off bus tour which has 2 routes. It costs 23 euro for 1 day or 29 euro for 2 days Over all this was a very enjoyable trip, only spoiled by the cost of drinks.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Pennsylvannia", "Title": "“Wonderful experience!!!!!”", "Author": "Rose117", "ReviewID": "UR54019274", "Content": "Clean, friendly and in the heart of Barcelona's famous Las Ramblas. You will like it. My sister and I felt very safe and secure at this hotel. We orginally booked with Holtel Barbara thru Travelocity, that was a prostitute infested dangerous hotel to avoid at all costs.. Hotel Condal was clean and safe and I will go there again.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "San Diego, Ca", "Title": "“Great Location and Decent Rooms”", "Author": "globale", "ReviewID": "UR46820889", "Content": "Considering we managed to book this hotel last minute, and for a great price (just over 100 EUR I believe) I cant complain about much. First of all the location is unbeatable. Right of Las Ramblas close to the Bocqueria, halway between Placa Catalunya and Port Olimpic, and in the heart of all the shopping. Right between 2 metro stops, which meant we were connected to EVERYTHING at anytime. Plenty of restaurants in the area and bars. This only bothered us on the first night since we were exhausted having arrived from Ibiza (go figure) and wanted a good sleep, although there was loads of screaming and yelling coming from outside. After that, it was usually quiet at around 2 am (and this is Barcelona, why would you go to bed before that??) The hotel looks directly onto another building, I believe a hostel, and it actually was a great way to meet people! Staff was amazing. Very friendly and helpful and patient with us no matter what time we came in. There was also free wifi internet in the lobby which was fast and useful. Theres also a bunch of internet locations around the corner which was nice too. We had to extend our stay an extra night, but the hotel was fully booked, so they offered to move us to their sister location, a ocuple of steps down, but called up the day we were meant to check out, and said we could stay and even keep our room. The rooms are, at the end of the day, 2 star. Nothing extravagant at all. Extremely basic and small. Bathroom was relatively clean. Toiletries basic - shampoo and soup. And they brought extra towels upon request. Bare floor. AC was fine, except for the last night, when I think the whole hotel suffered. That was an absolute disaster. FYI the windows need to be CLOSED for the AC to work. Most hotels in spain have that system installed. Beds I have to say though were INCREDIBLE uncomfortable! Very hard and springy and horrible. And they made noises all ngiht whenever anybody shifted just a bit. That too me was the biggest disaster. So overall would recc. based on service and location, but defiently not extravagant or luxury. Extremely basic but worthwhile, and this coming from someone who enjoys 5* on a regular basis.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Princeton, NJ", "Title": "“Great Clean, Safe Hotel”", "Author": "mj1010", "ReviewID": "UR45768243", "Content": "I stayed with my girlfriends for one night prior to a cruise. We were looking for a reasonably priced, clean, safe hotel in a great location. We found it in the Hotel Condal. It is right off Las Rambles and close to many great restaurants. It's the perfect place for one or two nights as the rooms are very basic. I would definitely recommend it to others.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Famalicao portugal", "Title": "“ideal location”", "Author": "Ricardo056", "ReviewID": "UR35376879", "Content": "We have been in this hotel twice, and we will be bat there for sure. Very well lacated, 30 mt from la rambla, near La boqueria market. Very clean and confortable for a 2 stars hotel. Ideal for a friends trip.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "são paulo", "Title": "“I recommend: best location, clean and good price”", "Author": "helena25saopaulo", "ReviewID": "UR30400299", "Content": "I decided to rate this hotel because I stayed there for 5 nights last year, in May (2008). The location is pretty good as it is located in a street that across Las Ramblas (it's 1 or 2 blocks from Las Ramblas) and just 3 minutes walking from the tube. The rooms are clean, the breakfast is simple but ok and the location is very, very good (the most important, I guess). The staff is very friendly and the price is very good! I strongly recommend this hotel!", "Date": "May 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Louis, MO", "Title": "“Great Experience with the Condal”", "Author": "Bigperm86", "ReviewID": "UR24034565", "Content": "booked throuogh easytobook.com, stayed here for three nights. Hotel Location is excellent, right off Las Ramblas, and only about 3 minutes from the Metro stop. Hotel lobby small but nice, feels very secure. Room was good, as was bathroom. The Metro system in Barcelona is very easy to understand, and we bought a 10 ticket pass and used it to see the whole city. Taxi's are also inexpensive, so we used those(to get to Parc Guell for example), but then we walked back to the Metro and took that. The hotel was excellent, great value, great location, friendly and helpful staff. Would definitely stay again.", "Date": "January 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sofia", "Title": "“excellent value for money”", "Author": "VaIeria", "ReviewID": "UR21655987", "Content": "We were pleasantly surprised by the helpful and friendly staff, cleanliness and excellent location of the Condal. The bathrooms are spacious enough, the rooms are decently furnished. The one and only downside is the street noise which lasts until around 2 am, but one gets used to it after the second night. On overall, a wonderful option for people on a tighter budget who wish to stay at the very heart of Barcelona. I wouldn't hesitate to book there again.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“Great Value For Money”", "Author": "moonaldo", "ReviewID": "UR18595332", "Content": "If you are looking for a cheap place to stay without slumming it in a hostal, then you could not ask for a better place to stay. Very secure, friendly, relaxing, clean, and enjoyable. I went there on my stag. As this place looks pretty swish from the website, this place deters the less (shall we say) sophisticated of stag groups, so you won't be having sleepless nights from football chants. ps. Barcelona is AMAZING, and check out a club called Catwalk.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "adelaide", "Title": "“Fantastic Location. Cheap but noisy!”", "Author": "AdelaideKitty", "ReviewID": "UR17088055", "Content": "Once I eventually found the place (directions on the website were useless) the location was unbeatable, just off La Ramblas and the Liceu Metro, even Placa Catalunya was an easy walk, but with the advantage of it's location came the disadvantage of the noise. My room faced the narrow street (so the noise just bounced off the walls), and even with the windows shut and the motorised aluminium shutters down, it was LOUD. The bar a few doors down the road didn't help, especially when the Football was on! Even the church bells in the morning (which normally I would find charming) was enough to drive my sleep deprived mind to murderous thoughts, at least until I had my coffee. Breakfast wasn't included in my rate, but the hotel's small cafe downstairs served coffee and sweet breads. I never ate there, prefering instead to pay over the top tourist prices for the privilege of enjoying my breakfast on La Ramblas, so can't comment on the food! Hint, shop around for your coffee! One place cost €3.95 when the cafe next door to it was only €1.80 which is waaaaay more reasonable! The room itself was small, but well laid out and clean (except the yellowing bed spread with a multitude of stains ewwww!) The bed was ok, but not great as it was a bit too firm and I could feel the springs in places. The bathroom was clean and efficient but the towels were a bit small and rough. The shower was good with good water pressure Overall I would recommend the hotel to those who have earplugs and those who considered location important but are on a tight budget.", "Date": "June 20, 2008"}], "HotelInfo": {"Name": "Hotel Condal", "HotelURL": "/ShowUserReviews-g187497-d648030-Reviews-Hotel_Condal-Barcelona_Catalonia.html", "Price": "$100 - $249*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Boqueria, 23</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "648030", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/02/de/02de157bcf58ca405748ecea8c3e5b9c6large.jpg"}}