{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pretoria, South Africa", "Title": "“simply awesome”", "Author": "Werner_inSA", "ReviewID": "UR128499294", "Content": "This hotel is a definite recommendation if you want to experience Venice. I thought I was living in a movie and found it difficult to leave. From french champagne breakfast to high tea we had a ball. The staff is very friendly and assist in every manner. Thank you for the memories.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“High standards in every aspect”", "Author": "Oldcolonial", "ReviewID": "UR128158248", "Content": "Having scoured the internet for a long time trying to choose a hotel in Venice and doing as much research as possible to avoid being disappointed I am pleased to say upon arrival the Ca Sagredo lived up to expectations. My wife and I recently had the pleasure of staying here for 5 nights and were delighted with both the hotel and location as nothing is that far away and the vaporetto stop is virtually outside the hotel. We received a warm welcome from the reception team and had a lovely room 406 on the 4th floor with views over the rooftops of Venice, the room was of a very good size and well furnished, it was also extremely clean and everything was well maintained. The breakfast was very good and the staff were excellent and could not do enough for you, a glass or two of prosecco before heading out in the morning was a great way to start the day, the reception team were also very helpful recommending things to do, places to see and restaurants and taking the time to mark everything on the essential maps as it is very easy to get lost in Venice. There is absolutely nothing negative to say about this hotel and we would stay again, I would recommend it to anyone that enjoys luxury, refined and elegant service and some of the most helpful and friendly staff you will ever meet. I also recommend taking the speedboat from the airport directly to the hotel, it really is the only way to arrive and worth the cost. Hope to be back again next year.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Inverness, United Kingdom", "Title": "“Just go - Venice is a must!”", "Author": "Holidaymaker186543", "ReviewID": "UR127995614", "Content": "Beautiful hotel, there is absolutely nothing negative to say about Venice or Ca'Sagredo Hotel. Both are outstanding. We shall most definitely return. Venice is maybe a bit tired around the edges but she is beautiful and so are the people there.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Thailand", "Title": "“Great location, original Venice residence”", "Author": "Hamu_ham", "ReviewID": "UR127966328", "Content": "The hotel is a former palace of rich family, it is well maintained and keep all the original decorations. Although it feel a little gloomy (old foors, cupboard, chandelier), the hotel really reflects the real Venice palace in 16-17centuries.The rooms are spacious(by venice standard) and free Wifi. The hotel is convenient located on Grad canal. The vaporetto stop is next to the hotel (Ca d'Oro), the cross-canal gondola is in front of the hotel (0.5 euro fee), and water taxi can park directly at the hotel entrance. At the back of the hotel we can find McDonald's, supermarket within 2mins walk. And we can walk 5-7 mins to Riato bridge. The only comment is breakfast choice is not so extensive, mainly continental style with pastries, yogurt, fruits, and juices. It would be perfect if you could add more hot dishes.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Basel, Switzerland", "Title": "“Outstanding place in the beautiful Venice”", "Author": "Sard-eller", "ReviewID": "UR127656855", "Content": "We spent a couple of days in Ca' Sagredo. The normal double room was unbelievably luxurious. Big, beautifully decorated and with a fantastic bathroom. TV in the bathroom should become a must for 5***** hotels!!!", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Busan, South Korea", "Title": "“Lovely Honeymoon”", "Author": "Brett C", "ReviewID": "UR127384991", "Content": "We stayed here for a few nights on our honeymoon last April and it was unbelievable. I booked well out in advance and got a great deal on a junior suite through expedia and emailed them to explain it was my honeymoon and they bent over backwards to make sure our stay there was memorable. They upgraded our room to a stunning, just massive suite, that felt like staying in a museum. We were supposed to stay in the suite for two nights and then move to a less expensive room the third, but when we asked about it they just said it was easier for everyone if we stayed in the historic suite - we didn't argue.They also provided a small bottle of Prosecco and a few chocolates upon check that included a note from the manager congratulating us and wishing us a pleasant stay. Top to bottom a fantastic place that handled everything well from a water taxi to the airport to making our Honeymoon just that much more special. That said, it's a luxury hotel so things like breakfast and other extraneous services aren't bargains, but just staying in a beautiful/historic place like this makes it all worth while. Bathroom was beautiful and well equipped, the bed was pretty comfortable - but the furnishing and general ambiance of the hotel was out of this world. We'll definitely be back.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“spectacular palace with incredible suites and warm service”", "Author": "Gemstone4ever", "ReviewID": "UR127200562", "Content": "I have just returned from a 4 night stay at this wonderful hotel to celebrate my 40th birthday. Unfortunately my partner is unwell so there was a change of plan and I took a friend instead. It wasn't the romantic trip planned but was still fabulous and truly memorable. Our historic suite (204) was gigantic and exquisite. The service was friendly and efficient. The location of the hotel is perfect. The restaurant - food and service - was first class. This is a very special place. (if you go, check out La Cantina just down the road. Brilliant - don't be put off by the lack of menu or price list. Just go with flow.)", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Perfect Location and Historic Hotel”", "Author": "KJBKKKHK", "ReviewID": "UR127051326", "Content": "We enjoyed staying at this hotel for many reasons. The building itself is right on the canal. With great room views. It is very historic hotel with neat stairways and lighting. Our room was very beautiful and bed was comfy- we would know...we got food poisoning (from another place) and had to spend almost our entire vaca in the room. The staff helped us so much by bringing gatorade and chicken soup up to us. They also offer to send a MD up but I am a nurse so we decided not to have the consult. The hotel lounge was a bit pricey but had amazing service.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whitby, United Kingdom", "Title": "“5 star plus plus”", "Author": "Julie P", "ReviewID": "UR126603711", "Content": "Wow how fabulous , we were upgraded to the most fantastic suite with complimentary prosseco and chocolates Dinner to die for !! overlooking the grand canal Attentive waiters served all our meals I am a hotelier and have travelled to 5 star hotels throughout the world This is the most beautiful place ever ! location perfect , staff were so very professional and friendly ,spotless rooms and the building really is a stunning palace we were celebrating our anniversary and really wish we had honeymooned here The breakfast was excellent with classical music playing Location is right next to the ca ' doro vaporetta stop to use the public water bus the tragetto Close to the Rialto Bridge but just away from the hustle and bustle We will be back very soon Thankyou very very much.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“great place and great location”", "Author": "velmciti", "ReviewID": "UR126572526", "Content": "we booked 2 months in advance and got a great rate. the hotel is next to rialto and ca doro, so arriving and leaving by ship is no problem. staff is friendly, rooms are large, bathrooms are new and large. breakfast is for italian standards sensationell, stafff is friendly. so all in all for that price, that location, a star hotel in venice is really a great pick.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen", "Title": "“Excellent Weekend at Ca'Sagredo”", "Author": "t1curt", "ReviewID": "UR126437197", "Content": "My Wife and I stayed at the Ca'Sagredo Hotel on the first weekend in March for 3 Nights after arriving via water taxi we found the staff very friendly and helpful at check in. We were staying in a Junior Suite which was well worth the little extra for the space and comfort it provided, large bathroom, sitting area and bedroom and complimentry Prosecco and Chocolates on arrival. Breakfast was in a Grand Room on the 3rd floor which was beautiful and the food was a nice variety and the staff were friendly and accomodating. We never eat lunch or dinner at the hotel as we were always out exploring Venice but when we returned in the evening we had cocktails in the bar and these were of excellent quality and the Bar Man was very friendly. This hotel is also in a great lcoation for exploring and has lovely views of the Grand Canal. I would recommend this hotel as it is very peaceful when inside but it is right next to the hussle of Venice when you are outside.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bognor Regis", "Title": "“An ideal hotel for Venice”", "Author": "dfall", "ReviewID": "UR126339207", "Content": "The hotel is situated on the Grand Canal close to Ca d'Oro water bus stop which is only a few stops from the main Bus Station and Railway Station. It also backs onto the Strada Nova shopping street. The hotel has beautiful decor. Reception staff speak english and are very helpful. Breakfast is very acceptable again with helpful staff and you can have Prosecco with breakfast if you wish. It is also possible to have drinks or a meal on the terrace overlooking the Grand Canal and whilst prices are not cheap they do reflect the 5 star hotel rating and location. Our twin bedded room was excellent with a large modern marble faced bathroom and the TV provided programmes in many languages including english. There was free wifi but server speeds were slow. It is certainly a hotel to seriously consider and we will use it again when we return to Venice.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“An incredible hotel!”", "Author": "Chris B", "ReviewID": "UR125268972", "Content": "In 2008 My Wife & I had our wedding reception at Ca Sagredo, which was the best experience of our lives. Everything was perfect on our wedding day - The building, the staff, the service, everything! Roll on to Feb 2012 and we have returned to Ca Sagredo for the first time since our wedding. We were greeted warmly by reception who welcomed us back, and kindly upgraded us to a room with a view of the grand canal - instantly putting a huge smile on our faces. The room itself was amazing, words can barely describe the feeling of waking up and opening the curtains to see the site of the grand canal & bell tower out of the window - it was absolutely incredible. We had food in the alcova restaurant on our first evening and the food & service was impeccable. We weren't feeling overly hungry so we skipped a starter and went for mains only - despite this, we were sent some complimentary appetisers from the chef...again, a huge smile was created! The food was exceptional. The service was great. The whole atmosphere of the restaurant is wonderful - Its very small, so it feels very intimate and it allows the waiting staff to really do a great job of looking after the guests. Obviously after our wedding day Ca Sagredo holds a special place in our hearts, but it is warming to know that 4 years on we were treated equally as special.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“An amazing palazzo in the heart of Venice”", "Author": "1723287", "ReviewID": "UR124945661", "Content": "We stayed there during Carnaval, in February 2012. It was one of the memorible and perfect places we ever stayed, which provide all the necessary backgrounds for being in this anmazing city) The palace of the hotel is just a masterpiece, built in 15 centuty and carefully preserved by its owners. Some halls of the hotels really could be museums with its amazing sculptures, mosaics and painting ceiling. We had stumning big room, overlooking the Grand Canal, consist of amazing bedroom with antique furniture and small cabinet with a balcony. Breakfast was really good, the stuff was friendly, so we`ve received the attitude and emotions we were expected.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“A wonderful stay. Thank you so much.”", "Author": "TuRoLondon", "ReviewID": "UR123168473", "Content": "We are just back from another fantastic stay at the Ca' Sagredo. Thank you to all the staff who made this such a special experience. The hotel is magical, very service minded, friendlly and clean. Superb huge beds and verybeautifully decorated. \"Great breakfast as well. We have stayed in other five star hotels, but this one really deserves its rating !! We cannot wait to return.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“Good location but not a 5 star hotel - a great disappointment!”", "Author": "Arabella1", "ReviewID": "UR122989136", "Content": "We stayed here in the summer in a smallish, heavily furnished, room with a view of the Grand Canal. The smallish high windows were heavily curtained with shutters that partly obscured the light so the room was gloomy and you had to stand on tiptoe to get much of a view. This was a special trip for a special birthday and the hotel had been recommended by a friend influential in the travel trade so we had high expectations. Enough said. This hotel disappointed from start to finish. Our arrival was dealt with curtly. The front desk was generally poor, apart from one excellent girl,.There were odd incidents of porters/management being not just ineffectual but comically ill-mannered - more Fawlty Towers than 5 star! Food took hours in the dining room and then the order was wrong. Waiters, though pleasant, served across you. Breakfast was inadequate - juice not freshly squeezed and eggs, eg omelettes, only cooked freshly for you if you paid a large supplement. The 'music room' next door had piped musak. What about Vivaldi or other classical Venetian composers? The manager, who was unavailable throughout our stay, despite our requests, failed to address our concerns even afterwards yet thought she had done so. There were many niggles. Bathroom was small with poor ventilation - the mirror was frequently steamed up.. Airconditioning control was inadequate as apparently centrally controlled. We asked for a blanket as we were cold but were asleep by the time it arrived. Storage and wardrobe space were totally inadequate - ok for one briefly perhaps, but for two for a few days?? I could go on ad infinitum. This was a disappointing stay made bearable only because we had our own access to a private club on the Grand Canal where a genuine welcome and warm, civilised service was available in abundance. The contrast could not have been greater.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Gatos, CA", "Title": "“Love it!”", "Author": "natalyaca", "ReviewID": "UR122935905", "Content": "Traveling for 2 weeks between Rome , Florence and Venice. Venice was my favorite stop in Italy! What a great choice, Ca'Sagredo hotel! We stayed in Jr suite. Room was very large! Even so we did not had a view of the canal, I love everything about our room! Great breakfast too! Would love yo stay there again if I ever get back to Venice :)", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“A real living palace - and with excellent service from attentive staff”", "Author": "irw69", "ReviewID": "UR122925160", "Content": "I wanted to book something special for my wife's 40th birthday and had high expectations of our trip. This normally leads to disappointment - but not in this case. The hotel, staff and our room led to a really fantastic weekend. Much is made on trip advisor of the hotel being an ancient monument and it is - but you were made to feel at home in its amazing public rooms, where magazines, newspapers and complimentary drinks made it clear that you were welcome to stay and enjoy the rooms. On arrival, reception was more efficient than welcoming, but we were seen to our room by a very friendly, jovial porter. Our room was on the third floor and was a comfortable size (rooms on the 1st and 2nd floor were bigger) but we were more than happy with ours - and with a great (side) view of the Rialoto market and Grand Canal. The room was immaculately clean and very comfortable (including the bed's mattress - even though our double was made up of two singles). The room was a little warm and we couldn't work out how to use the heating / air conditioning - but given this was winter, it didn't matter. Also, can't believe that others have complained about no English TV - BBC world news, CNN and Sky News are all freely available ... and if you really want to watch English TV rather than enjoy Venice you must be mad! Breakfast was excellent - with a wide range of options included (including standard English, continental) and being Italy, you even had Proseco freely available to go with your meal. The staff were extremely attentive and helpful - but remained unobtrusive. We seem to spend an age enjoying our breakfasts with numerous fresh pots of tea and coffee being offered. Could not fault the service, the quality of the food or the lovely room in which it is served in the slightest. Having found found some fantastic little restaurants not too far from the hotel, reception made the reservations for us. Each evening we had a drink in the hotel bar, where they weren't cheap, but it was a great way to start the evening (again with very attentive, helpful, unobtrusive staff) - and a lovely range of canapes were provided and replenished. So in summary - a fantastic real palace to enjoy, with excellent service provided by friendly, helpful and attentive staff. Wouldn't dream of going anywhere else in Venice.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Worth it!!”", "Author": "padser", "ReviewID": "UR122638622", "Content": "Hotel staff are very friendly and helpful. It's in a great location and we got a lovely room for our two nights. We went elsewhere for eating and drinking out so can't comment on the food. Would stay again.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Wonderful stay - Venice is always beautiful even in winter!”", "Author": "FrenchParis", "ReviewID": "UR122399193", "Content": "After a rather bumpy flight over the Alps, we landed in Venice aiport, picked up a water taxi and 20 minutes later arrived at Ca Sagrado hotel. This was our first stay and a very nice experience. We were lucky enough to be upgraded to one of the historical suites, the Stucco suite, and spent 4 lovely days there. Breakfast offer was very good, and we also had lunch at the Alcova restaurant. Staying in such a historical place was magic. Location was very good too, close to major sights in Venice. We enjoyed an excellent service throughout our stay with dedicated staff, so we can only recommend this hotel for those who wish to splurge while in Venice. Reception staff was extremely helpful upon departure when we realized that one of our suitcases was broken: scissors and reinforced scotch tape helped us to solve the matter until we were back to Paris!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "coventry", "Title": "“beautiful but!!!”", "Author": "leighsha", "ReviewID": "UR122241012", "Content": "Just come back from the sagredo after reading all the wonderful reviews we just had to go it is true it is a beautiful hotel, but it lacks ambiance and is so quiet especially at breakfast you dare'nt speak to loud the price of everything in the hotel was extortionate 7 euro ,s for a coke,10 euro for a boiled egg,15 euros for a bowl of soup and the breakfast was not all that sausages were as small as my little finger and the bread was a very small triangle and be quick as by time i got up to get an orange juice the whole lot was cold well it was served on a cold plate to begin with !!! our room was really hot too as the air conditioning didn't work, we stayed for Christmas but decided not to eat at the hotel that evening as the breakfast left allot to be desired then we didnt want to chance paying 80 euro s per head for it to realise it wasn't nice, so all in all beautiful hotel great location but very expensive and like a quiet library .inside .ps forgot to mention its 25 euro,s a day to watch english telly enjoy !!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MB", "Title": "“Gorgeous and a fabulous location”", "Author": "sisinbc", "ReviewID": "UR122008510", "Content": "We arrived at Ca Sagredo by water taxi. In the interior, we found a combination of a museum and an art gallery; gorgeous murals, paintings, architecture, and staff who obviously are proud of their surroundings. As we were early, so we enjoyed a glass of wine on the terrace - reasonable prices and great location. To the left was a gondola station; to the right was a vaporetti stop; across the river was the market; and everywhere we looked was a panoramic photograph waiting to happen. When our room was ready, we were taken to Room 204, the Sala di Sebastiano Ricci (now called the Historical Grand Suite). The whole ceiling was a stuccoed masterpiece; antique furniture/fabrics/decor and Murano glass replicated the ambiance of the 17th century. The modern bathroom appeared to be recently renovated and provided us with the luxurious amenities one finds in any five star hotel. Windows that opened allowed us views over Campo Santa Sofia as well as side views of the Grand Canal and the gondola station. After spending many hours walking the districts in Venice, we concluded that the Ca Sagredo location on the Grand Canal was perfect for us. The Piazza San Marco, in the heart of the tourist area, was always congested and filled with tourists and tour groups. Piazzale Roma, the area that includes conventional transportation (roads and rails), was also extremely busy. The Ca Sagredoâ€™s central location between Piazza San Marco and Piazzale Roma was much quieter yet, within a couple of minutes, we were in the shopping area on the way to the Rialto Bridge. There were many trattorias and other eateries for when we wanted to leave the hotel. We had a fabulous chefâ€™s choice dinner created by Chef Klostermaier at the Ca Sagredo Lâ€™Alcova restaurant. We would definitely book the hotel again. Fabulous!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Staying in a Palace”", "Author": "RonCanuck", "ReviewID": "UR121912271", "Content": "We had 3 nights in this palace and it was really a once in a lifetime experience. This converted palace is in a wonderful location directly on the Grand Canal within easy walking distance of the major tourist sites and within 100 yards of a water taxi stop. The hotel was the former palace of the Sagredo family and the history of many of the large suites is provided. We booked a normal room but our suite was the largest and most magnificent of the hundreds of hotels we have stayed at during the last 25 years. The hotel (palace) seems like it has less than 10 rooms so the service from check-in to check-out is friendly and excellent. A lovely breakfast buffet was provided, including a glass of proseco if desired. The fitness room was decent having a few aerobic machines including bike, treadmill and elliptical - all having wonderful views of the grand canal while working out. Our booking was made with Luxurylink.com and during the off season which made the rate paid seem like a bargain for such a unique experience.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Life in The Museum”", "Author": "D1MV", "ReviewID": "UR121359324", "Content": "This hotel has a very pleasant ambience. It's like you travel in time, back in some XVII century. Do visit this hotel as it looks like it won't sand for a long time. Yes, it is quite sad as we noticed a few serious crackings in one of the biggest and most beautiful halls of this hotel.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sheffield", "Title": "“Utterly superb Venetian weekend”", "Author": "haem67", "ReviewID": "UR121163137", "Content": "Just back from from a truly wonderful weekend break in true Venetian luxury. We were upgraded without even asking to room with a splendid view of the Canal. Champagne and chocolates to welcome us and a lovely room overall. Breakfast was ample for Europe... Even had Prosecco included. Had dinner in the restaurant on our first night; food and service cannot be faulted. Convenient vapporetto stop. Helpful friendly staff. Will definitely go back and would recommend.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Marvelous Stay”", "Author": "Lo W", "ReviewID": "UR121094988", "Content": "Ca'Segrado is a lovely stay in Venice. It is a luxury boutique hotel, that really gives the feel for Venetian life in prior centuries. Our room was spacious and very elegant. It is a bit off the touristy area, which is actually good because there are some decent restaurants nearby... about a 8-10 minute walk to Rialto Bridge and 20 minute walk to Piazza San Marco. Would absolutely stay again.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Love it!”", "Author": "Cassie1314", "ReviewID": "UR121000875", "Content": "We enjoyed our stay there very much! It was very well located. The room was super spacious! A great hotel if you love something with a historical touch. The dinner we had at the hotel was fantastic! Best mussels we had in Venice!", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Luxurious Palace stay in Venice”", "Author": "TravlChick", "ReviewID": "UR120967455", "Content": "My partner and I stayed at Ca Sagredo in August 2011. We had a junior suite that was absolutely phenomenal. The breakfast rooms are beautiful in their own right - beautiful murals and elegance and a good European breakfast. The staff is knowledgeable and aims to please. The bathroom of the suite was large and well appointed with plenty of towels and good toiletries. The location of Ca Sagredo is convenient - right on the Grand Canal and very near Rialto bridge. It is easiest to take the Traghetto that is right outside the door of the hotel if you want to go across the canal, rather than wind your way through the Rialto bridge. All in all this was a lovely place to stay in a good location without being too close to the throngs of people at St Marks. This is not a budget place to stay, however, but is a beautiful palacial experience. One note - it advertises that is has an exercise room, but when I inquired, the staff indicated that it was \"just an old bike in a room downstairs\" and they didn't even want to show it to me. They encouraged me to go on the \"organized jogging event each morning\". They apparently have someone that takes groups each morning on a run through the city.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing Hotel”", "Author": "Val and Lu S", "ReviewID": "UR120775988", "Content": "Stayed 6 nights at the Ca'Sagredo celebrating our 40th wedding anniversary. The suite was amazing with a fantastic view. The staff were excellent, very helpful and always pleasant.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newport Beach, California", "Title": "“Beautiful Hotel”", "Author": "Tracy Z", "ReviewID": "UR120547481", "Content": "This hotel was beautiful right on the canal. The room was very large and was elegantly furnished. The breakfast buffet was fabulous too. It was a little bit out of the way...but worth it!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Absolute, Amazing Beautiful Hotel”", "Author": "mulberry08", "ReviewID": "UR120299882", "Content": "We stayed here in August when we returned from a Med cruise on the Seabourn Quest. This Hotel was totally amazing we loved every minute of being there. The staff were exceptional and the food fantastic. We decided to let the chief feed us (choose the menu) one night and he produced the most amazing meal. It was fantastic. We ate on the veranda on the main Canal it was the most special experience. Unlike the other 5* hotels you were actually on the waters edge. Watching the world go by. It was not the most expensive Hotel but I think the best. The food and drink was not that expensive. Had a nice bottle of champagne in my room on my Birthday! Thank you everyone! We are definitely going to return. Venice - Did not smell at all! Was not expensive and was not that crowded (no different to shopping on a Saturday) do not believe any negative rumours until you go there yourself! Totally amazing place!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bryanston, South-Africa", "Title": "“Great 5 Star is Venice”", "Author": "STR001", "ReviewID": "UR120258723", "Content": "We arrived on 2 November by water taxi at 09h00 and were greeted at the taxi by the hotel staff. Check in was very quick and we were immediately shown to our room even though it was just after 09h00 in the morning. The suite (room 202) is situated on the second floor â€“The Library Suite. You enter this room from the main â€œHallâ€�. This suite is situated in the old library and has a double volume ceiling with a magnificent Murano class chandelier. The room is filled with antique furniture and has a beautiful view on the Grand Canal. There is a guest cloakroom in the entrance hall and the bathroom is situated on the same level as the upper part of the library â€“ this was great for us, but people with a walking disability or not willing to climb stairs, should book one of the other suites. Having stayed in Venice before we really think this is the best location to stay at. The Traghetto crossing to the Rialto Market is right at the front of the door and the Ca' d'Oro Vaporetto stop is just round the corner. Walking to St Markâ€™s square is about 15 minutes. This area is also much quieter and not so overrun by tourists, but by no means quiet. There are also great restaurants nearby. We had drinks and canapÃ©s on the hotel deck overlooking the canal every evening before we went out for dinner. The service here was top notch! Breakfast was more than adequate and GREAT for Europe. We arranged for a late checkout at 17h00 (at time of booking), which also was not a problem and wonderfully handled. The hotel organized our taxis to and from the airport â€“ I would recommend this, as it removes any hassles getting to and from the airport. No extra charges were levied by the hotel for booking the water taxi on our behalf. We loved our spectacular room; the service was great and the location unmatched. What we did not like, was leaving this wonderful establishment.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plano, Texas", "Title": "“Ca'Sagredo: Outstanding Hotel and Restaurant”", "Author": "CorpGypsy", "ReviewID": "UR120046186", "Content": "Booked a partial deluxe canal view room on Otel.com for a 2 night stay in mid-October. Our room had a beautiful side view of the canal and the gondola stop. While at first we were concerned about noise being above the main entry, the soundproofing of the room was excellent. The larger-than-expected room was beautifully furnished with a very comfortable king bed, a sofa, side chairs and a desk. Wall coverings and fabrics were very high end. Reception was formal, friendly and cordial. We had a very early morning departure and the night manager made sure we had coffee and breakfast at 5:00 am. The real surprise was their terrace and restaurant, L'Alcova. We had our two light lunches on the terrace and were spellbound by the views of the canal, the oustanding service by GianPaolo and his team and the quality of the food. Dinner at their formal restaurant was the highlight of our stay. There are only six tables looking out on the Grand Canal. The food, presentation and service was our best in Europe. It's expensive, but worth the price! We can't wait to return.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cheshire", "Title": "“Beautiful Venice Hotel”", "Author": "valeriecheshire", "ReviewID": "UR120029597", "Content": "What an amazing hotel! A real re-furbished Venetian palace it certainly took you back in time. to be able to stand on the balcony right on the Grand Canal was truly a delight. A lovely buffet breakfast served in the ballroom accompanied by Italian classical music certainly added to the ambience. A great location and great restaraunt recommendations from the helpful reception staff all added to a great stay.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westlake Village, California", "Title": "“Hot in Venice”", "Author": "PMB4", "ReviewID": "UR119564159", "Content": "Sept 23-28 was a hot time to be in Venice, but the air conditioning and everything else was in great working order at Ca' Segredo! We had that familiar exciting feeling of seeing the Grand Canal from the train station and then having our water taxi pull up to the private dock at the hotel. We were whisked away to room #104 - a deluxe jr suite with full Grand Canal views. It was beautifully appointed with a couch, 2 chairs, a large desk and chair and 3 windows on the Canal. I could open the windows and watch the traffic on the Canal and the Gondoliers unpack their gondolas every morning because they had parked them underneath the hotel windows. We loved that our room was low and close to the water. The staff was wonderful; we loved the music at breakfast every morning; their advice for restaurants in walking distance was spot on and we cannot wait to go back.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Isle of Islay", "Title": "“Absolutely excellent!”", "Author": "Malcolm O", "ReviewID": "UR119003461", "Content": "We've just stayed for four nights in what has to be one of the finest, friendliest and most amazing hotels, and not just in Venice. First off, there was the marbled pillared entrance hall, the fantastic marble main staircase, the public rooms with paintings on ceilings and walls, and the general ambience of living in a former palace. The staff, whether on reception, in the restaurant or the porters or the chambermaids, were without exception friendly and helpful. We had two evening meals - candlelit on the terrace overlooking the Grand Canal - with wonderful food and wine - the recommendations of local wines that I asked for were spot on to accompany our meal. Our room, with its own small terrace, was very well appointed and comfortable. If we return to Venice, this will be our hotel of choice. It is brilliantly situated on the Grand Canal, with a vaporetto stop close by, and a traghetto by the entrance which takes you across the Grand Canal in a gondola for 50 cents. As a base for seeing all the sights of Venice it could not be bettered. Following a recommendation already made on TripAdvisor, we ate at the exceptionally good fish restaurant a couple of hundred metres away - al Fontego dei Pecaori - and had fantastic fresh fish bought from the fish market (on the other side of the Grand Canal from the hotel and well worth visiting) just that morning.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kula, Hawaii, United States", "Title": "“Best service, and location in Venice!”", "Author": "Randy B", "ReviewID": "UR118825196", "Content": "I spent a total of seven nights in CaÊ» Sagredo Hotel, in the heart of Venice. The staff was fabulous! The location was perfect! Next to the front door, is the water-taxi gondola which will bring you to the incredible Rialto Market for less than a dollar. I even went shopping at the market accompanied by the great Chef Josef Klostermeier, who helped me select the perfect seafood, which he prepared for my dinner with friends that same evening. This was an ideal \"first extended visit\" for me, to Venice. Top tier all the way.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not a 5 star”", "Author": "OlgaM M", "ReviewID": "UR118662265", "Content": "Casagredo was our first stop on our honeymoon, and the most appalling holiday experience up to date. At arrival, there was no one at the entrance, and we had to carry the bags ourselves into hotel lobby. Once checked in we found out that there is no room service after 11, and thus no tea or coffee is available at all after the journey. Our room though very nice and luxurious (we had a junior suit) was unbelievably cold. With me being a little sick we asked to increase the temperature (which was 18 degrees at the time!), but we were told that no heating was available at that time of the year. We did ask a couple of times as I was shivering in bed, but to no avail. Next morning they changed the room, and did switch the underfloor heating, but no apology or discount was offered. When we said that we were extremely disappointed with service, we were told that all we said was a lie! I was so upset I wrote my comments down in the comment book in the lobby, which was shamelessly taken away 2 min later. After this our room was stuffy hot, but we never complained as it was just too tiring to argue with them. On the last night we asked for some tea ~11, only to be told that tea is still available, but we need to go down and bring to the room ourselves. Overall, incredibly disappointed, would never return, and would very much advise against staying at casagredo- it doesn't deserve the 5 stars it's got and the very expensive bill.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New England", "Title": "“A Not-So-Hidden Gem in Venice”", "Author": "NH_Guy", "ReviewID": "UR118568730", "Content": "We stayed three nights in a King Room overlooking the Grand Canal. The room was quite spacious and comfortable, and the restoration of this 15th century residence was done tastefully and well. To complement this beautiful property, the service was timely and professional, and the food (we had an \"American\" breakfast every morning) was nicely prepared. The strongest pro: the location is a quick turn off of the tourist throngs and is right next to a convenient gondola crossing. Seriously, the noise level went down 90% when you turned toward the hotel entrance. The strongest con: the claustrophobic elevator with a mind of its own, which established a new reason to take the stairs. Great place, all around.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Palace living right on the Grand Canal”", "Author": "Roni4451", "ReviewID": "UR118361718", "Content": "Loved this boutique hotel from the moment we walked in. The hotel retains the main historic rooms and eating breakfast with opera in the background is a treat and one feels like a visitor from another era. Our suite was very large and quiet, with wonderful bathroom amenities. Our favorite meals in Venice were in the hotels' beautiful L'Alcova restaurant, where we had a lunch, aperitifs and dinner. We were superbly served in the restaurant by a seasoned waiter ( Jean Paul?) who's gracious service really enhanced our meals on the lovely outdoor terrace. Our only regret is that the hotel did not seem to do all that it could in order to retrieve our baggage from Milan, and we waited 3 full days without luggage, and no one seemed particularly helpful , useful or even interested in helping us retrieve it or offer help with making us comfortable without our luggage.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Nr Frome", "Title": "“Excellent position and beautiful hotel”", "Author": "BraddyNrFrome", "ReviewID": "UR118307387", "Content": "This is an excellent hotel - well positioned on the Grand Canal in Venice. The receptionist / consierge was superb, very friendly and helpful. The whole staff were knowledgeable and very friendly. The building itself was stunning with some superb art works ont he ceilings and walls. The restaurant was excellent food although a little expensive Â£100 per head before wine but a great setting on the terrace overlooking the grand canal. Take a canal or street view room otherwise you'll end up viewing another wall or window. The only disappointment was the breakfast, would have hoped that for a five star hotel it could have been prepared for you - not a buffet that had stood for a while - bread and croissants not that fresh - no freshly cooked eggs - Otherwise excellent.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Limassol, Cyprus", "Title": "“Feel like royalty! Be treated like a queen!”", "Author": "sylvager", "ReviewID": "UR118102507", "Content": "We stayed in the Ca Segredo at the end of a Seabourn cruise and, on arrival, found an Australian couple whom we had met on board had also chosen it. All of us loved this magnificent hotel. We took a water taxi from the port on arrival and another to the airport and it was well worth it for the convenience. Our suite was on the first floor overlooking the Grand Canal and it was spacious, beautifully furnished and well-serviced every day. It was a little noisy but worth it for the views and the ambience. Staff at Reception were helpful, provided excellent maps and advice on how to get where we wanted to go. We were pleased with breakfast, having expected a continental one, but there was a good selection and the staff were very friendly.The sublime music played during breakfast created a wonderful atmosphere. To stay in a Palazzo with its Grand Ballroom, Music Room and sweeping staircase was a memorable experience. The location is perfect as the Rialto Bridge and St Mark's Square are within easy walking distance and there is a gondola ferry service to the other side of the Canal (don't miss the early morning Rialto Market), in addition to the private jetty and public water transport just outside. The hotel restaurant is beautiful and we also loved nearby Osteria Ae Sconte close to the Rialto Bridge. It is difficult to find on your first visit but ask for the Canaletto Hotel which is beside it. If we go back to Venice we will certainly stay again in Ca Sagredo.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Grandeur in Venice”", "Author": "MichaelChew", "ReviewID": "UR117904581", "Content": "We stayed in the Ca 'Sagredo in Venice for 3 days as part of a family holiday, returning to London on the Venice Simplon Orient Express. Not easy to get to the hotel by public water taxi as one then needs to find one's way via the windy roads to the hotel. Much better to go by private water taxi as this stops just at the hotel pier.The hotel is a grand and beautiful building converted from a previous large stately home, right in the centre of Venice near the Rialto bridge. My brother's family had the room with a roof terrace, providing fantastic views of Venice. Our room had a verandah. Great hotel restaurant right by the canal, where one can have a leisurely meal watching the gondolas go by. Very friendly staff", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Great Location”", "Author": "Sightseer67", "ReviewID": "UR117875647", "Content": "At the end of August my husband and I spent five days in Venice staying at the Caâ€™Sagredo Hotel. We loved everything about this hotel: a beautiful Venetian Palazzo in a great location and friendly, helpful staff. It is great value for money as it is located on the Grand Canal, right next door to the Caâ€™dâ€™Oro Museum and it is an excellent base from which to explore Venice and, best of all, you can avoid the day trippers in St Markâ€™s Square. The breakfast service we found to be on a par with our experience of other good hotels elsewhere in Italy in that, fresh coffee/tea is brought to your table and you help yourself to a range of food from a buffet table: juice, fresh fruit, cereal, scrambled/boiled eggs, bacon, sausage, cold meats and cheese. The Rialto Markets are directly across the Canal and can be reached by a shared gondola (Traghetto). Even on the hottest August days there wasnâ€™t s whiff of fish - a complaint made in another review. Our first floor room, which had a side canal view (overlooking the Traghetto landing point) was quiet, spacious, furnished to a high standard with a large modern bathroom which had a second television (but only one English language tv news channel). Throughout our stay we found all the staff to be pleasant, helpful and knowledgeable. We intend to return to Venice next year and will definitely be staying at the Caâ€™Sagredo - but not in August (never, ever go to Venice in August). NOTE: we can confirm another reviewerâ€™s observation that it is only a ten minute walk from the waterbus stop Fondamenta Nove to the hotel. Cost from Airport 15 euros (25 euros return) compared to 100+ euros by water taxi. The most direct route: 1. alight at Ft Nove turn right and then turn left into Calle Marco Foscarini 2. walk to end and turn right into Fondamenta S. Caterina 3. at end turn left, crossing over the bridge and walk to end, crossing a second bridge. 4. at end turn left and with a few steps you are in a small open area facing into Strada Nove. 5. turn left in Strada Nove and in one minute you reach Caâ€™Sagredo in the Campo Santa Sofia.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Newark, United Kingdom", "Title": "“Impressive surroundings, lovely room but some problems”", "Author": "Kate11853", "ReviewID": "UR117528025", "Content": "This is a beautiful and impressive building and our room, although in effect in the roof space, was lovely - - - cool, spacious, very clean and beautifully serviced by the housekeeping staff. There was a minor problem with the TV service, which was limited. You can choose an English language option from the main menu, but this only gave us access to a couple of news channels, both of which were CNN based, and to a Eurosport channel where the commentary was in German. We asked at Reception why we could not access the Sky News option on this menu and the receptionist said he would investigate this for us whilst we were out for the day. When we returned, we could still not access this service but we received no feedback from the receptionist as to why. We explored other options, perhaps thinking we would watch a film (whilst resting during a very hot day) from the 'Blockbusters' menu, but the 14 euros to be charged for a film like 'Gladiator' ( c.10 years old?) put us off! There was also a significant charge if you wanted to listen to any music from the main menu. There was good free wi-fi access, though. The other problem was the breakfast service, which we found to be only average. On our last morning, we had a very early one as we had to catch a train at 8.30 am. Everything was available and ready at 7.00 am but the scrambled egg I had was cold, as was the bacon and sausage chosen by my husband. This made us question when the food had actually been prepared, as we were the first people down to eat that day. The basic breakfast cost was included in our 'package' but we saw from the a la carte breakfast menu that other nice choices were available, such as omelette, porridge, or even fried eggs - for which you would need to pay at least 10 euros!! The waitresses were lovely, though, and very friendly, whereas the reception staff, although always professional, tended to be rather 'cool'. Charges for services other than those previously paid for at the time of booking are excessive, we felt. We paid 26 euros for 1 small snack from the mini-bar, 1 cup of coffee and 1 small bourbon from the main bar. The location of the hotel is lovely and its architecture and the pervading sense of history are awe-inspiring. However, I doubt that we would return, as value for money is significant for us.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington, DC, USA", "Title": "“Best Hotel we have ever stayed at”", "Author": "Blue1231", "ReviewID": "UR117443885", "Content": "There were 14 of us on a family trip. The Hotel is breath-takingly beautiful, and is in a superb location at the Ca d'Oro Watertaxi stop. The staff is wonderful, and the service never ended.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Beautiful”", "Author": "Dubson", "ReviewID": "UR117323745", "Content": "We stayed 3 nights from July 12th. The hotel is even more beautiful than as seen on its website. A former Dogo (Duke) palace, it is an architectural and art jewel. The two rooms were accordingly elegantly furnished. The location, close to the Ca' D'Oro, is so much preferable to San Marco; it is far from mass tourism, and the nearby main street is full with fine shops and restaurants. Our reservation included a market shopping and cuisine class with the excellent chef Josef Klostermaier, a great event for our two boys.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Leeds", "Title": "“Will stay in our memory for ever!!!”", "Author": "garrylt6", "ReviewID": "UR117104086", "Content": "We stayed here in August for our Honeymoon. The hotel upgraded us, gave us complementry cocktails and canopies and provided us with anything we asked. Beyond doubt this is a five star hotel. Different to the 5 dtar hotels I've frequented in England, Dubai, Australia etc as its not ultra modern or sleek. It is like a museum, full of antiques and characters that sets itself apart from all the other modern 5 star hotels around the world (don't get me wrong, I like ultra modern sleek hotels). I reccomend you google this hotel to appreciate its history and what it has to offer. From famous painting, the hall of the falling giants, the ball room, even our hotel room was a piece of art work. Location is right on the grand canal with beautiful views. About 25 minute walk to st Marks square but far away enough to avoid the tourist trap bars and restaurants. In summary, if you appreciate what the hotel is, like us, you will have a memorable stay that will be remembered for the rest of your days, you'll remember when and where you were when you stayed in this hotel due to its individuality and character. I would certainly reccomend but probably not visit for a while as venice is expensive but justified spending sily amounts as I was on my honey moon! regards Garry", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Beautiful Hotel,a great choice for anyone visiting Venice”", "Author": "McVeighs", "ReviewID": "UR116723703", "Content": "My husband and I and two friends stayed at the Ca'Sagredo for three nights at the end of March.A beautiful hotel within a walking distance from St. Marks Square but far enough away from the crowds.There were plenty of restaurants near the hotel.Lovely breakfast.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "CHICAGO, IL", "Title": "“BEAUTIFUL BUT...”", "Author": "mbutterfly1977", "ReviewID": "UR116540051", "Content": "I loved the hotel from the moment I saw its interior online. We decided to stay there to give it a try last time we went to Venice. I loved its interiors. We got the most incredible, presidential suit with huge room and the view on Grand Canal = interior worth the price. I loved everything - breakfasts, service etc however the floor in the room was made of something that during the winters makes the room very cold at nights and we were not able to control the thermostat (only concierge had an access to it). Besides that I could not understand how such an expensive hotel did not provide us with the free access to the Internet (Europe is so behind with it). Other than that I loved the hotel but we are not enough impressed to come back there. We decided to try other since there are so plenty of beautiful hotels in this gorgeous city.", "Date": "August 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Such a shame the staff let this beautiful palace down”", "Author": "RichelleAnne", "ReviewID": "UR116454142", "Content": "First impressions of the hotel were wonderful. As were we treated off the water taxi and led into the salon. The first problem started when I wouldn't let the front desk staff take my passport. They wanted to take in from me and return in latter to the room. As a seasoned traveller I will never leave my passport with anyone. I politely told the front desk staff that I would rather he photocopy it right now and give in back to me. I was very abruptly told that it's not policy but he would hold up everyone and the process 'for my unreasonable demands'. Latter that night we had tickets to the opera. We discovered that my husbands suit and my gown were horribly crushed I called gown to housekeeping for an iron. I was told that being a palace we were not allowed to plug and appliances in but he would sort it out for him. Happy with the response the clothes were collected and returned latter ironed. It wasn't until checkout that we discovered a â‚¬100 bill on checkout for pressing. I was appalled and told the manager so. He informed my husband that we had obviously spent little time in Europe because all pressing was charged. My problem is no one ever told us we would be charged. That same night my husband got very sick. On calling down to the front desk for assistance we had a language problem. I went down to find someone that could help me. Visibly upset I was told to try back in the morning when someone was on that spoke English. I find this very strange in a five star hotel. I was left wandering the streets of Venice looking for a chemist. There are much better hotels in Venice. It is such a shame because the rooms were incredible.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "West Vancouver", "Title": "“Hidden Gem in Venice”", "Author": "BASLJM", "ReviewID": "UR116434700", "Content": "We stayed at the Ca Segredo Hotel in Venice for 4 nights in June 2011. This was part of a nine-week European trip where we stayed in 12 hotels (primarily 5 star). We almost always stay in a Four Seasons Hotel when available and our review should be assessed in this light. The Ca Segrado is a beautiful little hotel located about a 10-15 minute walk from both the train station and St. Mark's Square. It is a former Noble House with large rooms and bathrooms. The room is furnished with beautiful period pieces of high quality and that are also surprisingly functional. The air conditioning was quiet and efficient. The shower and bathtub were combined but it was large and easy to use. The hotel has a fantastic little bar looking directly onto the canal. While the drinks are expensive, they provide excellent snacks. The head waiter is charming. It is a fantastic place to have a drink (or two!) before heading out to dinner. The breakfasts at the hotel were among the best that we had in Europe and are provided in a beautiful room with exceptionally high ceilings. Unlike most other holels, scrambled and hard boiled eggs were included. The staff are friendly and helpful, and come close to levels provided by the Four Seasons Hotels. In short, the Ca Segrado is a great place to stay and, given the relatively few reviews on TA, is a hidden gem in Venice. Some tips: 1. There is an excellent gelato store located about 2 blocks from the hotel. It is called \"Grom\". From the side entrance, walk back to the main street and turn left. it is about 2-3 blocks away on the right side of the road. The gelato is made fresh daily on the premises. 2. There are two really good restaurants close by. The first is Trattoria Ca d'Oro, located at Calle Ca d'Oro 3912, about 2 blocks from the hotel (and not too far from Grom's). It is a small family restaurant with a limited menu but excellent. Dinner for three was about 75 euros (excellent value)! The other is Fiaschetteria Toscana, located at San Giovanni Grisitomo 5719, about a 10 minute walk from the hotel on the main walking street just past the Rialto Bridge. All food was good but ask the waiter for his recommendation. Price was about 200 euros for 3 people. Reservations for both restaurants are a must. 3. From the train station, the water taxi to the hotel took 10 minutes and cost 50 euros 4. Laundry is very expensive. There is a coin laundromat on Ruga Giuffa, very close to S. Maria Formosa. It was about 10 minutes from the hotel and 5 minutes from St. Mark's Square. 5. Do the gondola early, before 9:30 am. After that, there are far too many on the water and the charm of the ride is lost by the very crowded waterways. We paid 80 euros for a 40 minute ride. Prices seem to be pretty standard. 6. While the Rialto Bridge is about a 5 minute walk from the hotel, you can cross the canal using a \"gondola ferry\" right in front of the Ca Segregado Hotel. Cost is only 0.5 euro per person and takes about 2 minutes. There is a fantastic open-air food market right across from the hotel.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Amazing Hotel, Romantic, Clean, Friendly, Conveninent spot!”", "Author": "WorldTravelersHNM", "ReviewID": "UR116220909", "Content": "Can't recommend a better hotel.. honeymoon trip started in Venice, and was the best hotel we stayed at in all of Italy. Deluxe is a huge size room, with large bathroom, very luxurious and worth the price, rest assured. Staff was extremely helpful and friendly. Water taxis right around the corner, and gondola rides right outside the hotel. Perfect stay! The view wasn't the best from our hotel room, but from the top of hotel was nice.. decent breakfast also. But overall, extremely comfortable and slept like a baby, A Must Stay!!!", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“Friendly staff/ excellent food/”", "Author": "Goss5", "ReviewID": "UR116076890", "Content": "Great location close to Rialto Bridge , but remarkably quiet. Traghetti stop outside hotel, cheap Gondola ride across Grand Canal to the produce market. Vaporetti stop very close to hotel brilliant for getting around Venice, buy a three day pass and save the legs!.Hotel staff helpful ,great hotel. Would avoid Venice in late July due to crowds", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leighton Buzzard, United Kingdom", "Title": "“Amazing hotel and Experience!!”", "Author": "mills2108", "ReviewID": "UR115839819", "Content": "Myself and my partner visited this hotel about a year ago as a surprise I booked a weekend in Venice and after some research I decided to book the Caâ€™Sagredo. I must say we certainly werenâ€™t disappointed, it is a beautiful hotel and the staff were extremely helpful and courteous. This is where I proposed to my partner and the hotel organised the gondola ride for me and took care of all the details. It was decided that we would return to Venice to get married and what better than to stay at the caâ€™sagrado again. After contacting them about this they were extremely helpful in helping us organise everything as we wanted to hold the reception at the hotel also. From the start all the way through they were fantastic!! Upon arrival which was quite late at night, we were shown to our room number 316. When we entered we were both overwhelmed with the room it was absolutely beautiful and they couldnâ€™t have picked a better room for us. All throughout our stay the management and staff including Elisabeth who dealt with everything for us were amazing and the attention to detail and the service we received was second to none! NOTHING was too much trouble. We was even able to taste the food from the menu we had chosen which we did the day after arriving for lunchâ€¦.the food was out of this world, the chef came and spoke to us about it and discussed the ingredients etc. On the day of the wedding 4th July the housekeeper arrived early to tidy the room (which they done about twice a day without delay or asking) to then allow the photographer to take pictures. The hotel organised all our transport etc and gondolas for the day also. Upon returning from the ceremony at the Palazzo Cavalli our guests were treated to canapÃ©s and champagne. Again the service from the staff was second to none with us receiving a glass and a greeting from the manager. After this we went to the music room for the meal where the tables were decorated beautifully and the food was served with some background music. All throughout the meal the waiters were extremely attentive, filling glasses etc etc and the food was amazing, all the guests commented on the food. We also had children who had the adult menu but wanted to change to the childrenâ€™s menu on the day and even this was no problem and was done without fuss. After the meal etc and when myself and my bride returned to the hotel there was a complimentary bottle of champagne waiting for us. During our stay the staff even took the time out to explain the history of the hotel and show us around various parts which the gentlemen did because he had an interest which you could tell, this again was a lovely touch. The day after our wedding we had to check out as we had booked the final 2 days at another 5star luxury hotel, and to be honest we wish we could of stayed at the Caâ€™Sagredo (we even asked them before we left if we could) All in all an AMAZING experience and the staff were all amazing, kind and friendly who always had a smile, where nothing was too much trouble and the service we received was not forced or fake if you know what I mean. A HUGE thank you to all the staff at the Caâ€™Sagredo from Mr and Mrs Mills room 316. Ps WE WILL DEFINITELY BE BACK!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kent, UK", "Title": "“Great place to stay for sightseeing in Venice with a touch of class”", "Author": "UKtraveller073", "ReviewID": "UR115769610", "Content": "This is a beautiful palace on the Grand Canal. We arrived by water taxi from the station - definately the best way to arrive as the taxi takes you to the front door. Our room had beautiful views over the Grand Canal and was nicely furnished. The staff were all very helpful and nothing was too much bother for them. The breakfast was good - a wide selection of cold and hot food. You need to reserve to get a table on the terrace for dinner. We ate inside - food was OK?good but a bit pricey. Some portions were small and even the waitress suggested we avoided one dessert as it was small - wish I'd taken her advice!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Venice, Italy", "Title": "“Lovely Tiepolo ceilings, but over-rated and often unhelpful”", "Author": "Polonius45", "ReviewID": "UR115456908", "Content": "My partner and I stayed at the Ca' Sagredo for 4 nights in July. The hotel is in a good location, overlooking the Grand Canal, by the Ca' d'Oro, and has some wonderful Tiepolo ceilings, but apart from that it was a great disappointment. When we arrived by water-taxi and were taken to the reception desk, instead of the expected \"Welcome to the Ca' Segredo, Mr...?\", the attendant barked \"Do you have a reservation?\" The service was uninspiring, and in some instances positively rude (a door was slammed in our faces by a passing porter). The food in the restaurant was good but, although there were only a few other diners, it took well over an hour for us to get our first course. We could not change the air conditioning in our room, and were surprised to be told that it was centrally controlled. A polite email to the manager received a reply that failed to deal with my main criticisms. If you want a true 5 star hotel in Venice, I would suggest many others.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Wonderful stay!”", "Author": "Calypso007", "ReviewID": "UR115224525", "Content": "I stayed at this hotel just a week ago with my family and we were absolutely charmed from the start. We arrived by water taxi and got off right at the hotel's own launch. The staff was knowledgeable and friendly, in particular I must mention Signor Gianpolo, whom we met in the restaurant and who was very helpful and entertaining. The rooms are spacious and light and we enjoyed sitting in our windows and watching the square below where people drifted around all day and where gondola's ferried us across to the Rialto market. There is internet available, though I was not able to make use of it. There is no mini-bar, but we didn't miss it at all. There is a very small fitness room I used once, but I heard they will be building a larger one in the near future. The breakfast buffet is vast offering everything you might want and held in the beautiful second floor of this restored palazzo. All in all, I felt it offered a welcome respite for our weary feet after days of treking around the city and we left feeling we would love to come back in the very near future!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Broken A/C - But a First Class Hotel”", "Author": "BuonaNotteRoma", "ReviewID": "UR115018457", "Content": "I recently stayed for four nights at the Ca Sagredo with my wife and two daughters (ages 15 and 12). This being our first trip to Venice and expecting warmer June climes I wanted a classic hotel in a top notch location (on the Grand Canal) with modern amenities (i.e. A/C). I knew in advance that prices in Venice this time of year would be exorbitant at any hotel â€“ so I just want â€˜all inâ€™ and booked the 5*L Ca Sagredo, beautifully situated across from the Rialto Market on the Grand Canal. We reserved one double room with a canal view and one double room without. The hotel service, location and appearance all live up to my expectations of a 5*L hotel. The Ca Sagredo has an intimate and Venetian dÃ©corâ€¦with a beautiful marble lobby and staircase. The staff is very attentive and helpful, assisting us with: terminal-to-hotel transfer instructions, dry cleaning/laundry, general advice about Venice and even recommending a tour of the Rialto Market with the hotelâ€™s Executive Chef. Weâ€™re an English speaking family that attempts to engage in the local tongue during our stayâ€¦and the staff remained helpful and patient with (humored by?) our attempts to speak Italian. We arrived via train at the St. Lucia Terminal and took the water taxi (cost: 50 Euros) to the hotelâ€¦the other option is walking or taking the Vaporetto to the Ca Dâ€™oro Stop (right next door to the hotel..which BTW is a MUST-SEE museum). We really liked the hotelâ€™s location, as it was a little bit off the main walking routes and largest tourist-masses on Venice. We are walking-tourists so it fit our mode-of-operation perfectly. The hotel is about: 15 minutes walk from St. Markâ€™s Square, 5 minutes from Rialto Bridge, 15 minutes from the Ghetto and about 30 minutes from the Gallerie del Academia. The rooms were beautifully appointed, beds were comfortable andâ€¦one of the air conditioners worked as needed. Unfortunately, and the staff didn't acknowledge there was truly a problem, the A/C in our kids room wasnâ€™t working properly for the entire stay. The front desk was cooperative and tried restarting the system several times but the A/C wouldnâ€™t kick in. The room cooled down a bit at night, but for the 5*L and the priceâ€¦I expected a more proactive response to the problem. The A/C issue notwithstanding, I would return in a heartbeat to the Ca Sagredoâ€¦it is a first class hotel in a beautiful location. I just would make sure that if I was in Room 107, the air conditioner was working.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "bolton", "Title": "“fabulous hotel in great location”", "Author": "sharon4101", "ReviewID": "UR114781773", "Content": "Just returned from a 3 night stay at this wonderful hotel and already planning to return to it! The staff are brilliant, the rooms are really nice and spacious. We ate on the terrace overlooking the Grand Canal and the chef came out and spoke to us personally about our meal! Breakfast is served in the most amazing surroundings and maybe could have had a wide choice of hot food? The hotel is very well placed for the water buses and has a private dock also. I have been to Venice many times and never returned to the same hotel - but I will return to this hotel and book a junior suite next time for a canal view. I cant recommend this hotel enough!", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Scotland", "Title": "“Fantastic location and hotel”", "Author": "feebib", "ReviewID": "UR113084742", "Content": "We recently spent 4 nights at this hotel. It is in a very good location for the water bus. Rooms are stunning and whole atmosphere very Venetian. The original library of the palazzo has even been converted to a bedroom. We had dinner one evening on the terrace which was excellent. Staff there and also Laura at reception all excellente !", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles, Ca", "Title": "“Beautiful, hotel on the Grand Canal”", "Author": "traveledfar", "ReviewID": "UR112972909", "Content": "We had a lovely suite on the overlooking the grand hotel. Breakfast was good in magnificent surroundings. The restaurant created the best mussels I have ever eaten. I ate them for dinner and then again for lunch a couple of days later. Restaurant is also very lovely overlooking the canal. Very convenient to take water taxi from their dock.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Palace overlooking Canal Grande”", "Author": "lynrod", "ReviewID": "UR110244466", "Content": "Booked the Hotel as part of a package with a trip on the Orient Express. We were shown to a Junior Suite instead of double we booked- two lounge areas, vast double bed, dressing room and spacious bathroom. No tea/ coffee facilities only drawback. Breakfast is hot and cold buffet served in a Palace with opera music as background. Close to Rialto bridge, waterbus stop and easy walking distance to train station.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Gem of Venice”", "Author": "rplacido", "ReviewID": "UR109543710", "Content": "Our stay at Ca Sagredo was one of the highlights to our vacation in Italy. The staff did a fantastic job of making our stay extremely comfortable from arranging restaurant reservations, water taxi rides, glass shopping trip to Murano, 4 hour private guide (Silvia) - they are hospitable, friendly, and a pleasure to interact with. By far the most amazing experience was the private cooking class by Chef Klostermaier. A four course meal prepared side by side with the chef and enjoyed in his kitchen. Each meal was delicious as only fresh ingredients were used which we happened to select while shopping with the chef in the market earlier in the day. The rooms are spacious with lavish appointments and the location of the hotel makes convenient to walk almost anywhere. I highly recommend and only hope to return.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Windsor, United Kingdom", "Title": "“\"It couldn't have be any better\".”", "Author": "jonels", "ReviewID": "UR109046693", "Content": "My wife and I spent a short week here. Everything was so perfect. The splendour of the hotel (it's got to be seen to be believed) and its staff and setting. Grand Canal, gondolas, piazza's, Italian ice cream, restaurants, shopping etc, all on your doorstep, but quietly. We will be returning.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“Ca'Sagredo Luxury”", "Author": "pip45", "ReviewID": "UR108624317", "Content": "We stayed at Ca'sagredo for 3 nights in a Junior suite. We chose to arrive in style so took the private water taxi from Marco polo directly to the terrace of the hotel on the Grand Canal. From the moment we arrived the staff we efficient, ploite and very informative. Our suite was unfortunately at the back of the hotel and not overlooking the canal, a pity but not a deal breaker. The rooms in the hotel are beautiful and breakfast was taken in the adjoining room to the large music room, there was always a good selection of food on offer. The terrace was perfect for dinner or drinks as it looks over the Grand canal towards the Rialto market on the far bank. One morning we went with the chef to the market where he was buying the food for lunch and dinner. The great thing about the hotels location is that you are way from the tourist trap of St Mark's but within easy access if you so wish. fantastic and memorable stay.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tenerife", "Title": "“Wonderful Stay!!!!”", "Author": "N1C", "ReviewID": "UR108279776", "Content": "Had a wonderful 5 night stay in a junior suite. The hotel is beautiful and the staff are excellent. The hotel is in a great location away from the hustle and bustle of St Marks but whithin easy reach of everything. As the previous reviewer mentions the hotel has its own landing dock. The Gondolas are just out side, you can of course do the gondola ride but also for 0.50â‚¬ (if you cant be botherd to walk) you can get to the Rialto across the Grand Canal where there are some lovely canal side resturants. The Ca d Oro water bus stop is also just by the hotel which is very convenient. Would not hesitate to come back.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, United Kingdom", "Title": "“Magnificent splendour”", "Author": "GarethC3", "ReviewID": "UR108085274", "Content": "We booked this hotel through Citalia and when we arrived we were upgraded to a canal view suite. A fabulous room, very comfortable bed and a view straight out on to the Grand Canal that was to die for. Staff were wonderful and one of them took time out to show us the amazing frescos. The building used to belong to the 100th Doge. Breakfast was excellent and we always took time to walk through to the ballroom/music room with our coffee after breakfast to soak up the wonderful ambience and baroque music that was played through a decent sound system. Location was very convenient for the water bus or if your are not bothered about the cost of taxis, the hotel has it own jetty. It is also right next to a gondola hire point. St Mark's Square is only approx 10 minutes walk, the only problem being to resist the delicious icecream that is available en route. This was a holiday to remember and made so much more special by being able to stay in this superb hotel.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Excellent location and great service”", "Author": "TheKiwiWanderers", "ReviewID": "UR106986156", "Content": "We stayed at Ca' Sagredo over the Easter Break. Its location provided us with the much needed break from the activity of Venice. While only a couple of minutes away from Rialto Bridge, we elected to use the gondola crossing next to the hotel. This made for a quick and authentic crossing to the other side of the Grand Canal while sparing us the congestion of the Rialto Bridge. The staff was attentive, the suite was spacious and well appointed, and the generously sized bathroom was impeccably clean. We had a lovely view of the Venice rooftops with a sideways glimpse of the Grand Canal. The stucco details and frescoes of the suite made for a most unique experience. In fact this cared for 14th century palazzo is a testament to the skill of Venetian artisans. The only criticism of the suite was caused by the poor quality of insulation of the connecting door between us and the room next door . Sadly our neighbours suffered from jet lag and their conversation, while conducted in a moderate tone, was clearly audible to us well into the small hours of the morning. No such insulation issue existed where a wall separated the suite from another room. Free wifi was provided however the signal from the suite was very weak and often unavailable. In itself this was not a major problem as it allowed us to enjoy the 2nd floor museum like spaces while using the internet. The breakfast buffet was well appointed with a large variety of quality products and very good service. Overall, Ca' Sagredo provided us with a wonderful and memorable experience and am happy to recommend to any traveller in search of an authentic Venetian experience with first class modern amenities and service.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“A lovely place to stay on Honeymoon”", "Author": "MrsWard88", "ReviewID": "UR106391826", "Content": "We stayed at Ca Sagredo with the final part of our Honeymoon. It's in a wonderful location, very central to everything. It's a beautiful hotel, very romantic setting with stunning rooms on floor two (breakfast floor). The staff are extremely helpful and very welcoming. Breakfast was great, plenty of variety. Rooms where clean and the bathroom is spacey. Would definitely recommend.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Funchal, Portugal", "Title": "“Just perfect”", "Author": "Juan_Eduardo_Andrade", "ReviewID": "UR106324269", "Content": "Well...one of the best hotel i ever stayed. The location is fantastic (just 5 minutes walking to the Rialto bridge), and there is also a vaporeto stop near the hotel. When we arrived at the hotel we saw it was special. We were welcome by the staff right away and the young girl that was at the reception show us the hotel (that looks like a palazzo) and tell us a about the history of the 13th century hotel. The rooms are great and the restaurant is also good. If possible ask for a room with a Grand Canal view! it's worth it it was simply fantastic. Next time i will stay in this same hotel, no dout! A piece of history, wonderful!", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SÃ£o JosÃ© dos Campos", "Title": "“Really amazing!”", "Author": "crushzwei", "ReviewID": "UR105515310", "Content": "We stayed there for 2 nights last week (April 20 and 21). Staff was very kind, friendly. Room was very comfortable and the hotel really looks like a palazzo! Breakfast was very good, but not excellent as in other hotels which I stayed at before.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn", "Title": "“AMAZING”", "Author": "tzvitas", "ReviewID": "UR103202942", "Content": "Our stay in Venice over the weekend was enhanced dramatically with staying at this hotel. Everything is perfect and beautiful. The staff is great and friendly! Very comfortable rooms. Just wonderful", "Date": "April 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "suffolk", "Title": "“Lovely...but”", "Author": "reynards2", "ReviewID": "UR102662551", "Content": "Booked via Citalia who upgraded from classic to prestige..room was fabulous, although very noisy, lovely bathroom, lounge area and bedroom, but NO coffee facilities! which surprised me in view of the cost. Breakfast was disappointing, basic standard choices, and if you went down at 930am most of the bacon and eggs had been eaten! with no replacement. This hotel is in a central location which is excellent, the staff are helpful, BUT prices are high for coffee or drinks, so make sure you look outside of the hotel. Would I stay again, No as I believe within the area there are other hotels which for the same cost would offer more.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orsay France", "Title": "“Wonderful honeymoon - Many thanks to the staff”", "Author": "Shamce", "ReviewID": "UR102015703", "Content": "Just like a dream in an italian Palazzio ! Couldn't be better. We just loved it. Everything was perfect to us (rooms, breakfast, diner, location, service, cocktails, decoration ...). We would propably be back for next trip in Venise. It was my 3rd time in Venise, but this time it was just magical ! I strongly recomend it for all the lovers ;-).", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“Top class hotel, excellent service, prime location”", "Author": "ilovetotravelIreland", "ReviewID": "UR101848520", "Content": "I stayed in Ca'Sagredo 22 to 25 March with my husband and parents-in-law who are both in their late 70's. The service from arrival to departure was excellent, staff were attentive, they knew who we were when we arrived, the remembered our names and our room numbers without asking, they smiled! Breakfast was of a very good standard with a selection of fresh fruit, youghurts and breads, cereals, juices and cooked eggs, sausages and bacon - and wonderful Italian coffee. Our rooms were out of this world - we received a complimentary upgrade to junior suites through Citalia travel agents and they were HUGE! An entrance hall, dressing room and bathroom in one direction, and then down a small set of steps a living room and giant bedroom with murals and painted ceilings. The rooms were clean and beautifully decorated with sumptuous curtains and bed linen - and such comfortable beds! We had requested a twin room for the parents which was confirmed by email in advance and duly provided. The staff also provided us with advice on several options on how to get to the airport and ordered our taxis for us. Nothing was any trouble for them. Location is just opposite the open air markets on the Grand Canal, a ten minute stroll to the Rialto Bridge and about another ten minutes on to St Marks Square. It was expensive, but everywhere in Venice is, however I would say it was good value for money and we loved every minute of our stay.", "Date": "March 28, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "hallwoodh", "Title": "“First Impressions...”", "Author": "hallwoodh", "ReviewID": "UR99271986", "Content": "After all the good TA reviews I had high hopes for our stay at this hotel. BUT. We emailed them twice before our arrival as we had spent rather a lot of money on a premier junior suite for a special occasion so we wanted some idea of room size/view etc. Both emails went unanswered. When we arrive you have to heave yourself and your cases through some pretty hefty doors - no sign of the doorman until it was time to take our cases up to our room and earn himself a couple of euros. Reception is quite heavily manned (about six of them), although we did find ourselves ignored as when we checked in only one other man was checking in but no one acknowledged us, same on check out. No word of thanks or goodbye or have a nice trip or did you have a nice stay etc etc A young girl showed us to our room and literally walked in said \"lights' and walked out again, we turned round expecting her to show us the rest of the room but she had disappeared. The rooms are quite nice, our view wasn't. Breakfast was mediocre, just a regular continental breakfast. Very few TV channels in English (OK I know you're not there to watch telly but every other nationality seemed to be catered for). Local calls are not included so we had charges for ringing a couple of restaurants. All this for Â£350 a night! Sorry I have to say we expected a lot more, its a small hotel so a more personal touch would have been appreciated. On a positive note, we were in Venice for the 'Carnevale' which is good fun.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Phenomenal”", "Author": "LukeHeath", "ReviewID": "UR98757546", "Content": "Absolutely amazing hotel, spent our anniversary there and was greeted with champagne and chocolates, it was an amazing hotel and great service, staff were extremely helpful with everything. Book through Citalia and it's great price. Went during Carnivale and cannot recommend Venice more, we're a Young couple and had a great time.. Cannot recommend it more!!", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Meriden, Connecticut", "Title": "“WONDERFUL”", "Author": "Cottage02", "ReviewID": "UR98038690", "Content": "I wonder where the gentleman was staying.......we spent four nights Feb. 15-18th at this lovely hotel. Perfectly placed in the middle of the canal, we found the staff to be helpful without being intrusive. Breakfast was ample and presented with lovely linens and china. Bruna made sure that each guest was welcomed and totally cared for each morning. We had a view of the marketplace across the canal and a lovely Venetian restaurant within a few steps of the hotel. Evening turndown included a cloth on the floor next of each bedside. We were welcomed with a chocolate and fruit plate as well as a personalized note. Additionally, it was very special to find this hotel listed as one of the Secrets of Venice, in the book of the same name. We celebrated our 42nd wedding anniversary here and look forward to returning soon.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "England", "Title": "“Terrible.”", "Author": "Master_Doubtfire", "ReviewID": "UR97242032", "Content": "I'm actually quite shocked this hotel has managed to land 5 stars. It's a three at best. The food in the hotel restaurant is below average and very expensive. I'm surprised this hotel has so many positive reviews, because it really has nothing going for it.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“Fantastic hotel great location”", "Author": "Mog321", "ReviewID": "UR95598589", "Content": "With the hotel being only a short walk from the Rialto...but far enough away to be able to relax without the hustle of the main tourists it was everything we had hoped for. Staff were really friendly, hotel room was of the highest standard. All in all would definitely recommend it.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bergen County, NJ", "Title": "“The most amazing hotel we have ever stayed at.”", "Author": "678", "ReviewID": "UR95415318", "Content": "This is the most amazing hotel. Our room was spectacular and looked right out onto the canal. The daily breakfast was delicious -- love those chocolate croissants! The hotel is historical as well as functional and is in excellent condition. It was a palace and the location was away from the noise of the Rialto and St. Mark's area. From our window, we would watch the comings and goings of the fishmarket which was across the canal. There was a vaporretto stop right next door. The on site restaurant was wonderful as well. The staff was so helpful with restaurant recommendations, etc. I cannot recommend this hotel highly enough -- it's a splurge but have your travel agent look for prepaid deals which brings the price down significantly (and then buy travel insurance which is less expensive than I imagined) . Have your own Venetian palace for a little while!", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cornwall uk", "Title": "“Excellence”", "Author": "RichardCornwallUK", "ReviewID": "UR94392085", "Content": "Chose this hotel for a birthday weekend away, it lived up 100 % to expectations and fully deserves its 5 star rating. Partcular thanks to the porter and ladies on the front desk who provided unsurpassed service levels. Perfect location , great breakfast and on the Grand Canal it is somewhere I would strongly recommend", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "atlanta, ga", "Title": "“The most beautiful hotel and experience we had in Italy”", "Author": "3badboysAtlanta", "ReviewID": "UR92690623", "Content": "This was our first trip to Venice, at the end of trip that included Rome, Spoletto, and Florence. Our travel planner initally selected a bed and breakfast for us, but we wanted the experience of a palazzo, and she chose Ca' Sagredo. It was exceptionally expensive because we had two rooms, but worth every penny. It is in a quiet location on the Grand Canal. We had a waterfront room, directly across from the fish market, while our boys' room faced the street. Our room was extremely large and well appointed. The breakfast area was off a large ballroom and had many selections. We did not eat dinner in the restaurant, preferring to sample those along our walking path. The hotel has its own dock for private transfers and there is a vapperetto directly next to it. The water taxi stop is located only a few blocks away. The hotel itself is remarkable, particularly the architecture and painting. It would be a lovely place for a special holiday. While much of this was lost on my teenagers, whose main delight was that they could get ESPN in English on the TV, it was the highlight of my trip to Italy. If you are looking for something inexpensive, there are many other choices. But if you want something special, this is it.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Although expensive, probably the best value for luxury waterfront”", "Author": "mwbush80", "ReviewID": "UR90482002", "Content": "My fiance and I stayed here for a few nights last New Years. I agree with the last reviewer about feeling like James Bond. I felt like James Bond most of the time I stayed at the hotel, except when I wore jeans and sneakers out at night and had to slip past the hotel guests who were enjoying the formal NYE celebration. First and foremost, the hotel is beautiful. It is so old, yet lovingly restored that it just makes you happy to be there. The frescos and large format paintings that line the walls and adorn the ceilings are truly breathtaking. It's like the hotel is built out of 18th century masterpieces. The hotel staff was most helpful. They organized a last minute Secret Itineraries tour through the Palazzo Ducale for us. They gave us really concise directions through the city, and they even had a complimentary tour of the Rialto Market with the hotel's chef. The daily breakfast was delicious and included in the price. The price was the highest I have ever paid for a hotel room, but our room was on the Grand Canal and had views all the way to Piazza San Marco. I did my homework before spending so much money on a hotel room and was confident that I would have paid almost twice as much for a similar room in one of the more notable luxury hotels. I also doubt that staying at one of the other luxury hotels would have resulted in such a romantic stay. As such, I feel like Ca Sagredo is a tremendous value for ultra high end luxury. I recommend this hotel to everyone who wants to splurge yet feel like you are getting the best deal in Venice. Also, the hotel had the most beautiful glass fixtures and glass items for sale that we saw in all of Venice.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wakefield, West Yorks", "Title": "“Magical Palazzo experience”", "Author": "Buster2004", "ReviewID": "UR89912999", "Content": "I took my wife to Venice for her 40th birthday, and from the moment we stepped on the taxi-boat from the airport, feeling like James Bond, we had a wonderful time. The water-taxi arrived at the Ca'Sagredo's own jetty, and entered the beautiful interior of the hotel. We were given the room on the first floor at the top of the stairs (with a window in the wall!). Beautiful room with separate sitting area where the hotel had placed the flowers and champagne I had ordered for my wife. Bathroom was huge and very well appointed. We ate out on the first evening, but ate in the hotel restaurant on the Saturday night - the food was a very high standard (although I could have done with more!) and the service was excellent. Breakfast on both mornings was in a lovely old room on an upper floor, and was plentiful and high quality. The hotel arranged out water-taxi to the airport, stored our luggage on the final day, and in fact could not have been more helpful. It is in a fabulous position on the grand canal, a great base for exploring all parts of the City on foot or in conjunction with the river boats/gondolas. Overall, a fabulous weekend, not a cheap option by any means, but extremely memorable for a very special occasion. We will definitely return.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A wonderful Venice location”", "Author": "justaroadie", "ReviewID": "UR89068258", "Content": "November is traditionally rainy in Venice, but we were very lucky with the weather. The hotel in Venice (Ca Sagredo) was really great. The staff was friendly and helpful. The room we had was quite large with a partial water view, dressing room/closet and a big bathroom. Breakfast was included in our booking and it was lovely. The hotel was on the water and right on a main walking street not far from the Rialto bridge. It was also convenient for one of the water taxi stops. If you go to Venice, I would highly recommend this place.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Amazing place to stay”", "Author": "divabohemia", "ReviewID": "UR88861884", "Content": "It was a great stay, the stuff was incredibly friendly and location was just perfect!", "Date": "December 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect wedding anniversary celebration”", "Author": "MaryandGiovanni", "ReviewID": "UR88165312", "Content": "We stayed 4 nights in November to celebrate our 25th wedding anniversary and Ca' Sagredo exceeded our expectations. We have a small hotel ourselves so we know a thing or two about the business. The building is fantastic, a gem, and staff are really courteous, polite but not too stuffy. We had dinner at the restaurant the first night and the food was delicious and the service impeccable. The chef came to greet us which is a nice touch in these times of impersonal service. The whole hotel was very clean with a very good chambermaid service (clean towels twice a day). I am always very grumpy in the morning but the lively and happy waitress who served us breakfast in the morning \"infecrted\" me with her good humour! Thank you. We had a room on the Grand Canal and the vaporetto stop just outside our window was a very romantic lullaby, not certainly a disturbing noise.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "poole dorset", "Title": "“A memorable experience”", "Author": "mdd37", "ReviewID": "UR84783096", "Content": "Ca' Sagredo hotel exceeded our expectations. A stunning building , very friendly and helpful staff and exceptional standards of housekeeping all helped to make this a memorable holiday base. A quiet location next to the grand canal but very convenient for sightseeing and restaurants. Being english we would request tea making facilities next time we visit! We look forward to staying again.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“bellissimo”", "Author": "HG188", "ReviewID": "UR84574377", "Content": "I travel often and for me, this is certainly is one of the finest hotels in the world. I visited Venice and stayed here for a few days with my parents. From the moment we arrived a warm welcom ..until our 5 am departure .. with cappuccinos in hand .. the staff was fantastic! A beautiful property, this gracious and comfortable 16th century palace, tastefully renovated was a marvelous experience. Wonderful large rooms, a spectacular view from some .. quiet and immaculate. I will never stay anyplace else in Venice!!!", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A gem of a baby palazzo on the Grand Canal - our new favourite”", "Author": "Fiordiligi_10", "ReviewID": "UR83517723", "Content": "We have been visiting Venice for over 20 years and have stayed everywhere from the Gritti to the latest modern boutique B&B but in Ca'Sagredo, which was recommended to us by friends who are Venetian regulars, we have found the perfect hotel for our visits to Venice. The hotel is a little pink palace on the Grand Canal. It has only 42 rooms (small by Venetian standards) and not only is it beautifully decorated but it contains some astonishing painted ceilings by renowned artists such as Tiepolo and other original art works. The ballroom is breathtaking. The staff were extremely friendly and helpful, the rooms gorgeous and the beds divinely comfortable. If you want a very special stay in Venice then this is the place for you. Prices are very good for such quality in a very expensive city!", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Fantastic Stay!”", "Author": "eklektra", "ReviewID": "UR83183619", "Content": "It was my second trip to Venice and this time we opted to stay away from San Marco Square. We decided on the Ca Sagredo and were very happy with our choice. It is a 15 minute walk to San Marco or a few picturesque vaporetto stops away. Breakfast was good and the staff was friendly and accommodating. Don't look for pancakes and waffles or anything heavy that we like here, but there is plenty to fill you up. We got a bit confused navigating around the hotel. It's not that big there are just a few different ways to get around, but we laughed at every wrong turn. The place is easy to find. Take the vaporetto to Ca D'oro, walk down the alley, turn right, walk to the first small square where the charming gentleman is painting and it is the last door on the right or glide up in a taxi water taxi. There are a number of restaurants nearby in all price ranges. We enjoyed Vini da Gigio (sp?) and could resist posing in front of McDonalds. First timers may want to stay closer to the action. If that is not important to you I definitely recommend it. Pros: - location - decor - very friendly staff -close to vaporetto stop cons: - location - not as close to San Marco square as other hotels. If that is important than you may not enjoy it.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Greatly disappointed and certainly not 5 star service”", "Author": "happyvespagirl", "ReviewID": "UR82999961", "Content": "Terribly overpriced. This is more of a 3 star hotel with 2 star service. Not worth it period. If you like rude service and being robbed then stay here. First the room we were given was not what we paid for (was to be a junior premier suite) priced at over $500. we were given a room with a view of the AC unit ducts. and barely enough room to move around in. Ask the concierge to call a restaurant da fiore for a reservation and he tells us they are booked and recommends another up the road. well not trusting the Italian- i called myself from cell 5 min later and got a table. Ask them for timetable and how to get to airport early in am and they had no clue so at 130 am i had to run outside and look at water taxi schedule and use my internet data plan to get timetables for bus. Of course you can take a water taxi (private-their recommendation) for $100 euros but beware the concierge wanted to charge me $120-and note you will have to walk 8 min to get to airport. There are many nice hotels in venice this is not one of them and would only choose as last resort ie: all else under water. AND BTW no rooms have a view of the canal.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Suffolk", "Title": "“First time must see venice!”", "Author": "peterjbben", "ReviewID": "UR82718734", "Content": "My wife and I could be described as spoilt seasoned travellers. Venice has for a little while been on our should visit list. We chose the Ca' Sagredo as I purchased a good deal on an Auction site ,which I use, following my usual extensive investigation of the hotel we traveled for a three night stay via Easy jet. Surprising the flight was good the booked pick up by private launch all went smothly , but the meet and greet is a venice con as we were dumped with no booked water taxi by the dock! Hotel was excellent, friendly staff good service and a delightful room with all things as expected of five stars.The hotel resturant for our first Venice dinner was also an excellent choice. The hotel had booked for two other typical venice resturants for us for the follwing evenings. Both were good choices and we had a gondola to take us to the one on our last evening as it was further than we either wanted to walk having done many of the Venice sights during our stay. In short an excellent reasonable priced hotel , good service and standard of all accomadation . Special note of the beautiful breakfast and indeed the rooms it was served in.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely hotel as long as you don't have to eat or drink there!”", "Author": "Moss1236", "ReviewID": "UR82421416", "Content": "We have just come back from a three night stay at Ca Sagredo. The hotel is well located and has an impressive reception/staircase to the second level. Staff service is good with everybody speaking English. Rooms are a good size and well appointed. Our major negative with the hotel is the cost of food/drink. We ate in the restaurant on the first night of stay having arrived late. It was VERY expensive for what you got. We didn't eat there again! Breakfast which in our case was included in price, was good but not if I am honest excellent. I came away from the stay not hugely disappointed, but simply thinking the hotel could do so much better.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "kuwait", "Title": "“not suitable for any kind of stay , Terrible hotel”", "Author": "msmq8", "ReviewID": "UR81745254", "Content": ".we went to Venice looking for a nice hotel to spend our wedding anniversary , so i have chooses this hotel from the site ( small luxury hotel SLH ) , but when i reached the hotel it was a piece of old , dirty , worthless , bad hotel . the service was slow , with a word ( NO ) facing you where ever you are going . the room condition was very bad , see the pictures plz . it was dirty , A/C was full of dirt, the furniture is full of scratches , bath room with a bad condition. so my advice plz don't consider this hotel in your visit to Venice", "Date": "October 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Not big on Americans”", "Author": "Trippy3333", "ReviewID": "UR80526189", "Content": "Unique place to stay. A little loud and busy with ferry back and forth to Rialto market. Hotel manager was seated at table next to me having breakfast meeting with a visiting hotelier. Ca'Sagredo manager kept railing on America and Americans. Her counterpart kept steering her away from this topic but she kept going back despite his best efforts. She had her back to me but he could clearly tell I was hearing all of this. She looks like, and could be, the woman whose picture appears on their webpage. Front desk employee confirmed she was the manager and made reference visiting hotelier as being \"big time.\" If that's top leadership, you can guess what the rest of the employees might be like.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Spectacular Accommodations and Service!”", "Author": "NickyGHawaii", "ReviewID": "UR80325606", "Content": "We just returned from staying at Ca'Sagredo, and the experience was amazing! The public rooms in the former palazzo are magnificent, as well as the room we booked. Having been to Venice a number of times already, we selected a suite on the court side of the building instead of the Grand Canal. The room was beautifully decorated and retained the ornamental plaster work. The bathrooms are sumptuous with marble-lined walls and high-end fixtures. I can honestly say I've never stayed in a room so quiet and dark! The windows are shuttered at night and have three layers of drapes. The two sitting rooms provided comfortable seating, as well as having three flat-screen televisions. The staff was friendly and helpful, the breakfast superbly set in some of the former salons on the piano nobile, and the bar area on the canal was a delight for drinks. I arrived at the hotel by water taxi (50 Euros) and docked at a private landing outside the lobby, but the vaporetto stop (Ca'd'Oro #1 line) is next to the hotel as well for a less expensive arrival. A traghetto stop (50 cents) is just outside the front entry to cross the canal without using one of the bridges (remember to remain standing to get the proper experience!). I'd highly recommend this treasure to anyone heading to Venice! Superb!", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Fantastic Start to our Honeymoon”", "Author": "Wannderer", "ReviewID": "UR78932516", "Content": "I had chosen this place because of its history and art as my wife appreciates both. I couldnt take my eyes off the photographs on their website while booking and the hotel was exactly like in the photographs. The staff was very helpful and friendly and the welcome very warm. The rooms were well presented with the lamps and furniture. The bathrooms were awesome. The breakfast was in halls with paintings and frescos giving the feeling have having a royal meal. The restaurant is a little expensive though. We had 2 'single' beds on our cot which was irritant but we didnt complain as just one of them was large enough for us to sleep. The location is very nice and close to one of the mini-marts there. 10-15 min walk to both Rialto and the railway station.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "1.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Excellent location”", "Author": "wrexham83", "ReviewID": "UR78487015", "Content": "Expensive.It would have been nice if there was a coffee maker in the room.No ironing boards allowed in the room.A steamer for clothing would have been helpful.Expensive for drinks and dinner.Hence,there was alack of atmosphere in the hotel.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ideal Venice hotel for the more refined guest”", "Author": "lacosteman", "ReviewID": "UR78380489", "Content": "I loved this hotel . It does not seem overwhelming , but you discover more and more that it is a wonderful place . A converted 18th cent home , beautiful fresco's adorn the ballroom walls . It is very central in Venice and an ideal base to explore the city . It is just a few minutes from the ferry stop , situated on the main canal .", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very warm welcome fabulous location and service”", "Author": "NDPri", "ReviewID": "UR78028194", "Content": "We stayed there for two nights at August end - we got very good price for the room for last minute booking...we were celebrating our husband's birthday and they upgraded us to a superior room...amazing room...nd the best part was the housekeeping service...every time we went out (even for brkfast) they came and cleaned our room...enjoyed staying thr would recommend very much...only issue was that the bed were two twins joined - the manager said its probably a feature of Venice or moreso Italy though we got a double bed in other Italian hotels...", "Date": "September 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Airdrie", "Title": "“An enjoyable stay”", "Author": "Default111111", "ReviewID": "UR76368108", "Content": "Stayed here for 5 nights on the first part of our honeymoon. Lovely hotel in wonderful surroundings. Rooms were not as nice as we had expected from photos, though still nice. Chambermaids were fantastic. Reception staff ok, breakfast, bar and restaurant staff mixed. Going from very friendly to nonchalant. Price of internet in room was astonishing at 10 euros per hour, as were the drinks in the bar (but not unusual for 5 star in Vencie). Waterbus stop very close. The hotel is a little out of the busier areas but still close enough to walk to the Rialto bridge and St Mark's Square. Breakfast had a good selection. We had dinner once. The food was mixed. My steak was lovely, but my wife's was standard. Sitting on the terrace over the Grand Canal was sensational though. Overall, a very happy and satisfied stay.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Luxury at it's best and away from the crowds”", "Author": "casamoir", "ReviewID": "UR73235532", "Content": "This hotel is old school luxury but with a modern attitude. At check-in, they took the time to explain the surrounding area and things to do, like visit the fish market across the grand canal. The room was just stunning. Sometimes when you stay for a while even in a 5 star hotel, you sometimes don't get toiletries replaced etc. or the room may not appear as it was on day 1. This wasn't the case here. It was just lovely to come home to this hotel every day. I was supposed to stay for 3 nights and extended for an extra 2 nights. One of the highlights for me, was that the staff were really down to earth. It's also away from the crowds in Venice and easy walking distance to some really low key local neighborhoods with excellent restaurants. I cannot wait to go back again.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Elegantly luxurious, with an atmosphere of history”", "Author": "provi", "ReviewID": "UR73162130", "Content": "We were upgraded to a suite overlooking the canal. My only criticism is that in the enormous suite there was only one telephone. The staff were extremely helpful, there is a vaporetto stop just outside for the number 1 vaporetto which takes you to most places and the hotel is conveniently situated to walk everywhere. Not cheap but wonderful.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“When will they learn you feel ripped off?”", "Author": "jcmadrid", "ReviewID": "UR71365757", "Content": "Just finished our stay at this hotel... Two days in what is of course one of the most wonderful cities in the world. But my memories of the Ca Sagredo are not the impecable service, or the friendly, helpful reception staff, or the fantastic setting in a medieval italian \"palazzo\" or the idyllic location overlooking the grand canal. Nor will I remember the wonderfull breakfast next to the main ballroom listening to Vivaldi and Chopin as we had breakfast, nor the restaurant right on the canal. No, what I will remember of the Ca Sagredo is the INSULT of being charged TEN EUROS PER HOUR for an internet connection after spending 400 Euros per night for a suite with a canal view. Basically, you feel cheated and insulted when a hotel charges you that amount of money for a room, and then rips you off for an internet connection. DonÂ´t they realise how badly it reflects on them? When I go back to Venice in a couple of months I wonÂ´t stay there again, so thatÂ´s 800 Euros theyÂ´ll lose. Have they really made that much from net connections to afford to p*** people of to that extent? The curious thing is that I really donÂ´t mind paying 400 Euros a night for a room. But I DO mind being treated like an idiot, which is what theyÂ´re doing. PS: \"Venice Connect\" works fine from the hotel room and costs a small fraction of the price.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Most beautiful of hotels...”", "Author": "Queensgirl55", "ReviewID": "UR70607439", "Content": "I couldn't think of a more beautiful, refined hotel in which to celebrate our thirtieth wedding anniversary. This gem of a hotel exudes a quiet elegance amid an historical setting. The palazzo is original to the 17th century, and the guest rooms have access to the magnificent original fresco-painted rooms in the historic part of this palazzo. We were awed by the beauty of these rooms. I can only equate it to being allowed to stay in the Uffizi galleries as your own personal hotel. We were treated with courtesy and deference by the staff, and the elegance of service does justice to the elegance of the setting. We had a magnificent view of the canal from our room. I would just like to mention the little extra touches that stood out for us: When I mentioned this was our anniversary, a bottle of champagne and chocolates awaited us with a personal letter of congratulations. You will be happy you chose this hotel..", "Date": "July 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge MA", "Title": "“Unhelpful staff”", "Author": "DavidIL", "ReviewID": "UR70255096", "Content": "My wife checked out of the hotel yesterday morning. She was miserable there. First, the hotel failed to side with her when a water taxi overcharged her by 100% (50+ euros for a 5 minute ride from the train station -- the guide book warned her about this trick and she knew it was a false fee, but the hotel essentially sided with the driver of the water taxi though this was clearly wrong). Second, her passport was later stolen while she was walking in Venice. The hotel staff were unhelpful and even hostile when she begged them for advice. She described to me that though she was in tears, they were essentially indifferent to her problems (she needed advice about getting a new passport and about reporting the crime). This is completely unacceptable for a hotel that claims to merit 5 stars. They made a bad situation worse. (There was also a problem with the air-conditioning -- either too hot or too cold.)", "Date": "July 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prestatyn", "Title": "“\"paradise found\"”", "Author": "debbiegj", "ReviewID": "UR69832442", "Content": "What can I say! You cetainly get what you pay for with this lovely hotel. Lovely Boutique hotel with everything you could have wished for - stunning room with view of the grand canal from the window and very luxurious and romantic settling. It had such a lovely italian feel to the hotel, beautiful champagne breakfast and goreous food and cocktails - with the luxury of being on the grand canal. I went here with my husband - but will be back with our 2 children next time- definately go again - thankyou so much.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mumbai", "Title": "“cosy place centrally located”", "Author": "Supratikban", "ReviewID": "UR69204553", "Content": "Rooms are big, comfortable and spacious but ask for front side rooms or you will be looking over the roofs at nothing in particular or into a wall. One problem with the room was that it promotes using internet through their TV as there is no place to park your laptop if you intend using your own laptop - you have no option but to sit on the floor as the cabinet-top doesnt have space to work. Food was good although a lot of things listed on the menu were not available. Staff were pleasant but could be warmer. Pretty decent hotel overall.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fortson, GA", "Title": "“Outstanding experience right on the Grand Canal!”", "Author": "RalphSchmitt", "ReviewID": "UR67297123", "Content": "My wife and I spent 3 nights at Ca' Sagredo prior to cruising to Athens. The hotel was outstanding in every way. Our lovely room was on the 2nd floor with 2 windows overlooking the Canal. All staff members were warm, friendly, helpful. This small, boutique hotel is a converted palace that retains many of its regal, stunning features. We had dinner one evening in the hotel's intimate L'Alcova restaurant, which we recommend highly. We also had cocktails/Prosecco several times on the terrace outside the restaurant on the Canal - a perfect spot to watch all the water activiity, especially at night. We had an excellent buffet breakfast each morning in beautiful rooms with charming staff. Location in excellent, within easy walking distance of everything. There is a vaporetto (water bus) stop next to the hotel and a tragetto location (gondola to cross the canal) on the other side of the hotel. And gondolas are right there, as well. We arrived and departed the hotel by water taxi, right at the hotel's own dock, which was extremely convenient.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“A great place to stay in Venice........”", "Author": "FloHants", "ReviewID": "UR67081929", "Content": "Fabulous hotel worthy of all its stars. Our room was elegantly furnished and extremely comfortable and we had an excellent view of the Grand Canal. Although in a central location it seemed very quiet. The staff were efficient and always helpful, even down to posting a card! An excellent breakfast was included in our deal and was taken in one of the state rooms of this 16th century palace. Food and drinks in the hotel were expensive but then so is everything in Venice.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Mixed Bag”", "Author": "NYC1952", "ReviewID": "UR66213692", "Content": "This beautiful restored palazzo is perfectly located. The property lives up to any expectation of what a fine Venetian hotel should be. The room was well furnished, spacious, comfortable, and clean. A delicious breakfast is served in what must have been a ballroom. Room service, front desk, were tops. What I do caution, is the notion of a room with a view. We upgraded to a room with a partial view of the Grand Canal. It all depends on your definition of the word partial, but I would say we had no view. It wasn't worth the additional cost. So my advice is if you could give up the expectation of a view, this hotel is great. What you get for the upgrade just isn't worth it, and winds up undermining what is otherwise a pretty great experience, and well worth it overall.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“What a gorgeous hotel!”", "Author": "Jenny050110", "ReviewID": "UR65973976", "Content": "This place was idelaly located off the Ca' Doro vaporetto stop and if you walk out you are directly at a gondola/traghetto station. We stayed there for our honeymoon and it was wonderful. They upgraded us to a suite with a full view of the Grand Canal and to rebut some other reviews I have read on this property, were not stuffy at all. I have travelled extensively in some of the nicest hotels in the world, and I truly think this is one of the best. Beware the urge to eat Pringles out of the mini bar however, 7 euros a pop! :)", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Suffolk", "Title": "“Fantastic five star palace”", "Author": "60stravellingcouple", "ReviewID": "UR63725237", "Content": "This was a surprise stay for my wife, and she absolutely loved it! We were allocated a spacious first floor room, with very comfortable large double bed and a seating area with a window overlooking the Campo and Canal Grande. Superb room, large bathroom with powershower, lots of fluffy towels, dressing gown and slippers. Received a bottle of champagne with chocolates. Beautiful Murano glass chandeliers, walls were decorated with silk. Staff very helpfull and friendly and couldn't do enough for us. Beatifully decorated hotel. Great breakfast, including selections of bread, cold meat, hot food, fruuit juices and champagne. Restaurant staff very friendly and helpful. Next to main shopping street and close to Rialto etc. Charges in restaurants are higher than in Rome were we travelled from by Eurostar. But don't take a water taxi! For a five minute ride to the station we were charged 50 Euro! Next time take the water bus for 12 Euro for two. At certain times, the hotel offers special rates, three nights for the price of two plus an upgrade. There are warnings that Venice gets flooded between November and April, be aware! But they put in walk ways when required.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lisbon", "Title": "“A palace home very well placed”", "Author": "janiceLisbon", "ReviewID": "UR61886109", "Content": "Venice is full of palaces and CaÂ´Sagredo looks out side as a beautiful one with light rose walls and beautiful windows looking trough the grand canal. Rooms are all different and nice. Furniture and decoration with good taste, some luxe but very cobnfortable. The staff are nice but not enthusiasitc. The best of Ca' sagredo is location. Very well place, very central not to far not to close.. A vaporetto station ( Ca' d' oro just in lateral facade building helps a lot to travel easily for every where). The Rialto market ( beautiful) is just in face to the hotel and the trajjectto is just there too. the terrace is great to have a nice spritz or bellini. The prices of drinks and food are aexpensive. If you have to pay the breakfast is too expensive but you have lots of nice options the most close you imagine. The architecture and Venice lives there.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "austin", "Title": "“Beautiful hotel on the Grand Canal”", "Author": "jandrews", "ReviewID": "UR53241692", "Content": "The Ca Sagredo is a beautifully restored hotel that is off the beat and path so it's great for walking without the masses. We stayed in the Sebastiano Ricci suite and it was huge and really lovely. It is one very large room with frescoed ceilings and a large seating area. The bathroom is nice sized and updated. The floors slope a lot so the bed is on a platform to keep it level. The housekeeping is very on top of things and the people at the desk are very nice. The breakfast was incredible- lots of things to pick from and all were really good. It is a quiet hotel, not much going on in the lobby which was fine with us. Everyone was very nice and friendly and I enjoyed the stay very much.", "Date": "January 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "San Francisco", "Title": "“Nice hotel in central location.”", "Author": "LeonardoDiSF", "ReviewID": "UR50168254", "Content": "We stayed here for two nights at the end of our 12 day honeymoon. We had just stayed at some of the best hotels in Italy, so staying here was fine but not overwhelmingly nice. It is well located in Venice along one of the many canals. The staff is pretty helpful. We were disappointed by the gym since the exercise machines were not working during our stay so we couldn't work out. The rooms were small but well decorated and fine. The breakfast is very nice and it is in one of the lower floor ballrooms, which are spectacular to walk through (this is the best thing about this hotel). Worth staying at but i am not sure it is worth the $500 per night we paid.", "Date": "November 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“expected a good deal more”", "Author": "mathildexl", "ReviewID": "UR48191934", "Content": "We stayed for 4 nights at room # 311, called \"Water View Double Prestige Room\". In reality you have to tiptoe to catch a side glimpse of the Canale Grande. The best part is the terrace in front of the hotel at the Grand Canal. The magnificent common room as shown in their brochure is almost empty and hardly a place to meet fellow travellers. The breakfast isnÂ´t adequate for Cinque Stelle Lusso. Cheap Hotdog type sausages and Salami of a similar quality, tasteless cow milk milk Mozzarella and so forth. The staff is friendly and efficient with one exception: We left the hotel to go by public transport (Vaporetto) to the train station. After 20 minutes we were told that they were on strike! Nobody at the Hotel cared to tell us these facts.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Stunning palace away from the crowds”", "Author": "Globbo", "ReviewID": "UR47593156", "Content": "I don't give this hotel five stars in every category lightly - the Ca' Sagredo really could not have been better. I ended up loving the location a little north of the Rialto, because it was away from the throngs clogging San Marco. If you travel to Venice during high season, the Ca' Sagredo gets you away from the crowds but still puts you within easy striking distance of all the major sights. As an added bonus, there's a traghetto right outside the front door of the hotel to take you across the Grand Canal (a deal for only 50 cents per person) . We stayed in a standard room facing the campo, which turned out to be more like a junior suite. It had a sitting area with a love seat and a very pleasant bath. But the Library Suite, where the rest of our party stayed, was fantastically gorgeous. This suite is the original library of the palace, and it's a soaring two stories tall, with ornate gold bookcases and a huge Murano chandelier. The furniture is a lovely mix of antiques and replicas, and there's a small balcony with a stunning view of the Grand Canal. This suite isn't for everyone though; there is a guest toilet on the first level, but it's 20 steps up to the master bathroom with the shower and tub. That aside, it's a simply incredible accommodation. Public areas of the hotel were equally magnificent; most of the palace's original frescoes and stucco work are in place. It's a magical environment - I felt like I was staying in my own private Venetian palace. We also enjoyed the terrace fronting the Grand Canal - it's a great place to relax and have a cocktail. This is my new favorite hotel in Venice. I think the value for the money that you get at the Ca' Sagredo can't be beat anywhere in the city.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wolverines in Luxembourg", "Title": "“Excellent accommodations and location for a fair price”", "Author": "AroundtheWorldx2", "ReviewID": "UR41606708", "Content": "We had a wonderful time in Venice and found this hotel to be excellent. The rooms are newly renovated and spacious. The staff was friendly and accommodating. The location is perfect. I would highly recommend it.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Superb Hotel in great location”", "Author": "HamishandMeg", "ReviewID": "UR41140378", "Content": "Excellent location from which to explore Venice. Beautiful, clean, luxurious hotel. Wouldn't consider staying anywhere else if we return to Venice!", "Date": "September 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bromsgrove", "Title": "“We loved this hotel”", "Author": "EnglandCarters", "ReviewID": "UR39050588", "Content": "We absolutely loved this hotel. If you have any sense of history and romance you can't fail but be blown away by it's grandeur. It is a former Doges' palace and apparantly took 5 years to renovate. They have been dogged by red tape and because it is obviously a listed building some of the projects they would like to do will take time. You really feel that you are staying in a palace. The public rooms are very grand, I have never had my breakfast in a room with frescos on the wall! Our bedroom was lovely. It was a urban panoramic view and we had a view of the little square outside. If you want to see the Grand canal then you can sit on the terrace or go to the beautiful balcony in the huge ballroom. We had a meal in the restaurant whilst there which was expensive yes but hey you are on holiday and you are supposed to treat yourself! The meal was delicious and in beautiful surroundings. We thought that all of the staff were very efficient, helpful and friendly.It is very convienient for the vapporetto bus and the tranchetti to cross the canal is just outside. Venice is a walking city and the hotel is wonderfully placed to stroll along the narrow streets there is far more to see than just St Marks' Square. It may be 50 Euros for a water taxi to St Marks but a 3 day vapporetto bus pass only cost 33 Euros and that includes going over to all the islands. We went to the Ghetto area which was very interesting and over to Murano and Burano Islands We would not hesitate to reccomend this hotel and I cannot wait to return.", "Date": "August 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "del mar, ca", "Title": "“Nice hotel, good location”", "Author": "sandiegoguy", "ReviewID": "UR37623602", "Content": "Agree with previous reviewers --- liked this hotel, but didn't love it. Standard room very pleasant, clean, large enough to be comfortable, great view over the grand canal. Staff friendly and helpful. Close by Ca D'oro vaporetto stop. Downsides: public rooms a little run down; computer access limited; breakfast nice but not great. Next time we would stay closer to the Rialto Bridge. As an aside, we were consistently disappointed with restaurant food in Venice.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“We liked it, but didn't love it”", "Author": "Bebe38", "ReviewID": "UR37022618", "Content": "My husband and I spent 3 nights here, in a suite. We were travelling on a luxury link package, incredible value, but the hotel puts their full price clients first. We first were given a oddly shaped room with tiny dormer windows on the 4th floor, really not acceptable. They agreed to change us to a nicer room, although it was just a room, and our package was for a suite. No welcome note, no prosecco, etc. So, luxury link people - beware. I just wasn't in the mood to press further. The room was lovely, good a/c, acceptable breakfast. No bathrobes or slippers, and few amenities. A fee for Wifi. The location is quite out of the way, up the Grand Canal past the Rialto Bridge. A private water taxi is 50 Euros to St mark's plaza, to give you an idea. We had dinner at the hotel restaurant, finding the food very good and the atmosphere charming. Overall the service is friendly and warm, although one front desk woman was useless - gave us wrong directions, was no help in finding a tailor, and had zero knowledge of the Venice Biannale, the popular exposition currently throughout the city. Don't count on this hotel if you need serious concierge service. Overall, we would stay here again, giving it 4 stars, but we didn't fall in love with Ca Sagredo.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“Very good hotel but not the great hotel i expected”", "Author": "WestCountryNorthy", "ReviewID": "UR36951694", "Content": "Would have to agree with the last review on quite a few things,We had really high expectations of this hotel from previous Tripadvisor comments and photos but our first impressions did not live up to these. . We had to wait 2 hours to check in. As we arrived around noon and check in was not untill 2pm. We were also told that the only place we could freshen up was in the two toilet cubicles next to the bar and as previously said served all the public rooms in the hotel. We also were not treated to a guided tour or any explanation of the hotel services ,We didn't recieve any welcoming gift , not even chocolates like the review before did. We had booked a Double room with a panoramic urban view, this was a little disappointing, there was no view as the room(402) was on the top floor and didn't have a window, it had a outside space but all you could see from it was the rooftops of the surrounding hotels and that was only if you were 6ft tall or above.. The room was beautifully decorated but we were very disappointed that it was quite small, the bathroom on the other hand was massive which was a very strange layout, i personally would have prefered a bigger room and smaller bathroom. The reception didn't have a information desk for trips,guides and events etc which would have been helpful as at the end of our stay we found a leaflet for venice guided tours , something which we would liked to have done. The hotel was very grand, everything was decorated tastefully and you really felt like you were in a palace. The location is also great - far enough away from the excesses of St Marco, but still in the real Venice. Lots of small cafes and shops are around the hotel,Also being next door to the Vaparetto stop means that getting to/from the hotel is easy for sightseeing. Overall it was a very nice hotel, i somehow got a feeling though that as soon as the hotel knew i had booked with expedia we were given one of the worse rooms as our room didn't look like any of the official hotel photos. Venice though was magnificent, very busy during this time of year but beautifull views and great to explore around. My girlfriend and I got engaged on the trip which really topped off a lovely trip to the city.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“First impressions didnâ€™t do this hoteljustice”", "Author": "top-trippers", "ReviewID": "UR36306499", "Content": "We had really high expectations of this hotel from previous Tripadvisor comments and photos but our first impressions did not live up to these. This was especially disappointing given that my husband had contacted the hotel in advance to make various special requests to celebrate my birthday. We had to wait nearly 15 minutes to check in. As we arrived around noon our room was not yet ready which we had planned for so had a change of clothes in our hand luggage. However we were told that the only place we could freshen up was in the two toilet cubicles next to the bar/restaurant one of which was occupied. As these toilets served all the public rooms in the hotel we felt obliged to rush.. Unlike some other guests we were not treated to a guided tour or any explanation of the hotel services (the lady from reception who showed us to our room advised that she was just finishing for the day). There was no hotel guide in the room so we had to go back to reception to ask where brteafast was served and at what time etc. Unlike other (lower star) hotels we stayed at during this trip there was no welcoming bottle of Prosecco - although the chocolate covered strawberries and cherries were gorgeous. We had booked a junior suite with front canal view. The room (304) was beautifully decorated but we were very disappointed that the sitting area was split from the bed room by the bathroom. Some people might have thought it cosy but it was a bit claustrophobic for us and so we did not use. The bathroom had no separate shower (mainly because it was too small). There was only one narrow window (no foot balcony) opening onto the canal. If we had known all this in advance we would not have upgraded our room. We had made advance reservations for a quiet and romantic table in the downstairs restaurant for both nights of our stay however when we arrived at the restaurant we were told that there was no reservation. We were given a table and whilst the food and service was good by this time we were so disappointed that we decided to eat somewhere else the following night. On the second day things started to look up. We found the breakfast room on the first floor â€“ WOW. The breakfast was pretty good too. Through the hotel my husband had pre-arranged the â€˜Secret Tourâ€™ of the Doges Palace (which I would highly recommend) and a gondola ride. On our last day (my actual birthday) my husband surprised me with a celebratory lunch at the roof top restaurant at the Danieli - somewhere he knew I have always wanted to stay. The views were fabulous and we both agreed that the lunch was one of the best meals we have ever had. This was a brilliant note to end on â€“ I didnâ€™t want to leave.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "porto, portugal", "Title": "“really worth it”", "Author": "costamendes", "ReviewID": "UR34143754", "Content": "we went to Venice as a 10th wedding anniversary trip. I tried to pick one hotel which was romantic, historical, cool, fashionable and well-located. I did the right choice when I picked up Ca' Sagredo. Its location outside San Marco neibourhood was superb, once we could easily get there by foot while profiting to wander through the magnificent Venice narrow streets and channels on our way. Besides, we were completely out of the touristic crowds. Now, the hotel is a historic treasure on its own, truly unique. The meal at the hotel's \"L'alcova\" restaurant (although a very small restaurant with only five tables) was also first class - in fact, one of Venice best kept secrets. Our room was spacious, with a a sofa and coffee table and a marbled bathroom with little windows overlooking the Venices roofings (which is also a very nice sight). On the day we arrived, there were these absolutely DELICIOUS strawberries dipped in dark chocolate waiting for us in the room!!. On a more negative note, as we always took some time to rest a little bit before dinner (late dinner) there were some days that the maids did not open our beds for the night. Besides that, one could have expected breakfast to have ingredients of a better superior quality, but overall it was not that bad. It is not a cheap hotel, but then again elegance does not come cheap!", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rancho Palos Verdes", "Title": "“Wonderful”", "Author": "rpvtraveler10", "ReviewID": "UR33507434", "Content": "The ambiance, art, food, location and service were worth every Euro. Memories that last forever.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris", "Title": "“Sumptuous decor mixed with flawless service”", "Author": "VeroneseParis", "ReviewID": "UR33040537", "Content": "Ca' Sagredo surpassed every notion I had of excellent service and refined decoration. The rooms are exquisitely decorated without being too ornate, the perfect balance of antique furniture without and simplicity that one appreciates when travelling for work. The friendly and multi-lingual staff are is rare to find in European cities. The reason for our trip was to visit the Biennale, and the hotel offered the perfect haven of peace after bieng in crowded exhibits all day. The breakfast, served in a series of opulent rooms with frescoed ceilings, was nothing less than delightful, and the iced tea served daily in the main hall with its magnificent view over the canal only added to the charm of the hotel. Also perfect also for a romantic vacation or a honeymoon, this hotel leaves nothing to be desired!", "Date": "June 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chattanooga, TN", "Title": "“Great Hotel”", "Author": "Miasig", "ReviewID": "UR32964169", "Content": "A beautiful hotel, with very nice Junior Suites. Laura at Front Desk was always helpful with good tips and recommendations. The hotel is a good15-20 minute walk from San Marco Plaza which is only downside but hotel is right near some fine little coffee, bakery and gelato shops. I would suggest airport water taxi direct to hotel, skip the hassle of taking water bus although it is right next to hotel for up and down day visits.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "kettering", "Title": "“A Once In A Lifetime Experience”", "Author": "KetteringHarvey", "ReviewID": "UR31782209", "Content": "My Wife and I Stayed here for 4 nights and had a fabulous time. Our room was lovely and the staff were friendly and very helpful. Many thanks to Laura for sorting out the problem we had with a purchase we overpaid for!!! Gary & Pat Kettering Northants AND THE STAFF WERE VERY FRIENDLY AND HELPFULL. MANY THANKS TO LAURA WHO SORTED OUT A MAJOR PROBLEM WE HAD OVER A GIFT WE OVERPAID FOR. GARY & PAT KETTERING NORTHANTS.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Massachusetts", "Title": "“La Dolce Vita”", "Author": "LivinLaDolceVita", "ReviewID": "UR31290926", "Content": "This hotel is truly spectacular. My wife and I have been lucky enough to stay in many, many top-flight hotels in many, many places. Ca' Sagredo is a unique, sublime experience. The entire stay, from the moment we arrived via water taxi, to our immense (and quiet) 2nd floor suite, to the impeccable service, to our reluctant departure, was one we relished. Words really can't describe the palazzo itself and the 17th/18th century art that surrounds you. Smokers beware: you can't smoke in the building because of the presence of so many great works of art (we were grateful). And the location is absolutely perfect, although the Ca' D'Oro vaporetto stop in front could be a problem if you're a light sleeper, but do yourself a favor: stay here anyway, just bring earplugs. It's that good. On a different note, the dinner we had in the restaurant here was the best we had in Venezia. The food was absolutely electric and inspired, prepared and presented perfectly. Even if we weren't staying here, we'd go to this restaurant. Truly an astonishing meal. If I were to be critical of anything, and it's a minor criticism, the wine list is neither broad nor deep. It's understandable, as they don't seem to be doing anything to promote the restaurant independently, and perfectly acceptable, as there appeared to be many reasonable wine choices (including the Valpolicella we had). They really should make an effort to promote the food there, as it was astonishingly good. A special note of thanks to Roberto for making us feel warmly welcome -- and feeding us Aperol and Campari Spritz!", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Beyond Luxury”", "Author": "AusSXSW", "ReviewID": "UR27239123", "Content": "You stay in a perfectly preserved Venetian Palace...it's that simple. When we showed people our pictures of the hotel, everyone thought it was from a historical building we were visiting in Venice. It's opulent, the service is great, the rooms are incredible and you eat breakfast under 500 year old hand painted frescoes. I've never stayed in any hotel in any city quite like it.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Eur", "Title": "“I felt as if I were a 15th Century princess in the Ca Sagredo Palace.”", "Author": "travmam", "ReviewID": "UR25874692", "Content": "After waiting many years to visit Venice for the first time, I found myself spoiled forever by the palatial luxury and attentive staff of Ca Sagredo, overlooking the Grand Canal. The tasteful, stunning restoration of this architectural gem in a perfect location was matched by comfort, class, and excellent food. My room was just lovely--calm and dreamy--with a huge marble bath (definitely NOT 15th Century!). The staff arranged concert tickets and invited me to a lovely lace exhibit with an opportunity to meet and communicate with the lovely elderly lady responsible for this gorgeous work; I saw her at breakfast (lovely) the following day, and felt thru her I was at a home I would return to very soon.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Muchty, Alba", "Title": "“Got engaged”", "Author": "DWAG", "ReviewID": "UR24352270", "Content": "After a really interesting trip across to Venice we arrived at the Hotel to a very warm welcome from the reception staff. Our room was fantastic and looked over the main stairwell, (might not sound so exciting it was lovely). To be honest we spent so much time outside the hotel it was difficult to find fault in anything in the hotel. Inside and outside it was stunning. Breakfast was more than adequate and the service excellent. Only complaint would be was that I explained that my partner and I were getting engaged when we arrived and it would have been a nice to see that recognised. I would return again tomorrow, maybe not to the same hotel as it was not memorable but to the city as it was! Finally - take plenty of cash , keep it secure and be careful with your credit cards as I had ours cloned. It really put a dampner on our weekend.", "Date": "February 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Disappointed”", "Author": "CHARPOL", "ReviewID": "UR23689271", "Content": "Very good location ,, however just above the vaporetto stop which works the whole night so not easy to sleep; awful wet smell in lobby and sitting rooms ; no orange juice for breakfast ( not arrived at 7.30,, no more at 8.30!!! ; employees very cold without any smile when they were there. Definitely will not come back.", "Date": "January 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, ON, Canada", "Title": "“It was simply perfect”", "Author": "straysheeep", "ReviewID": "UR23237995", "Content": "We stayed at the hotel for 1 night. The lobby beautifully decorated. Our room was just perfect! Their service was excellent!", "Date": "January 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Beautiful, a real gem - close to the heart of Venice”", "Author": "Bennwin", "ReviewID": "UR22489395", "Content": "My family were taking a cruise from Venice so we needed a nice hotel that would accommodate the children and would have easy access. The Ca'Sagredo fitted the bill perfectly: they were great with the family and the easy location near the Ca' D'Oro vaporetto stop was good. It was an easy walk to the Ponte Rialto and St Marks Square. It was the start of the \"Acqua Alta\" while we were there and the hotel is sited that bit higher, so we had no problems, even though St. Marks was flooded out. The hotel itself was lovely. It is a real Palazzio, with a grand hall and main staircase. We had two rooms, one with a near 360 deg view over the canal and the city from its terrace; our other room was the Library Suite, which was unique and very romantic, with its small balcony looking right over the Grand Canal. Apart from the Ca' D'Oro itself, there is a Traghetto right next to the hotel which takes you right over to the market near the Rialto Bridge. Lovely overall - a beautiful gem in the heart of the romantic city of Venice.", "Date": "December 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Lizard, Cornwall, UK", "Title": "“Superb - Best ever”", "Author": "lizardman1", "ReviewID": "UR21852306", "Content": "Walking through the door was an experience in itself. The reception hall opened up in front of us and exuded luxury. The staff were fantastic and very helpful and polite. We were shown to our suite which was beautiful on the first floor and with a view over the Grand Canal. It was equipped with everything you would need with tv's in the lounge, the bedroom and the bathroom. I would recommend wiling away on couple of hours on the verandah overlooking the canal and watching the world go by with a coffee or two! The history in the hotel was just superb and the route to breakfast was just stunning. Overall a lovely experience for our 6th wedding anniversary.", "Date": "November 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bromley", "Title": "“great location”", "Author": "suitecasepacked", "ReviewID": "UR21509076", "Content": "Just returned from a 3 night break at the hotel ca sagredo, in celebration of my fourtieth. The hotel itself is a completely and wonderfully restored 15th centuary palace, and all of the hotel has retained its palatial feel and character, our room was comfortable and beautifully decorated, the bathroom was a real retreat with hot water and fancy toilettrees in abundance, however sadly I must agree with quite a few of the other reviews in that it lacked any real atmosphere and warmth. There was no bar or snug areas where you could relax and have a chat with other quests or simple take in the wonderful views that this hotel has to offer being directly on the grand canal, the staff however were very polite and helpful, we had breakfast included in our stay, but also found this not upto 5 star hotels that we have previously stayed in, also the room it was served in although beautiful lacked any atmosphere you felt that you almost wanted to whisper incase you disturbed the ghosts, i mean guests!!! Anyway in saying that ,the hotel is ideally situated being very convienent for all the attractions of st marks and rialdo bridge area, there are some great eateries and bars just a simple stroll from the hotel which are not as pricey as some you may find nearer to st marks, try out \"la cantina\" a great wine bar that not only has a good selection of wines and a few good beers but also serves some great food home made soups and fab paninis. also near by is a great local italian restaurant called \"Vini da Gigio\" i took the recommendation from another review and didnot regret it, but book early as it gets very busy. Venice was amazing and we had an amazing time, if we were ever to return we would probably stay in the area but not necessarily at the ca sagredo. Also just have to stay that the transport system must be one of the most easiest and effiecient I have ever experienced, Ken obviously didn't visit Venice when he was in office as london mayor!!!!", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London England", "Title": "“La Serenissima at its best”", "Author": "blanketbay", "ReviewID": "UR21497793", "Content": "We have just returned from a magical four days in Venice staying at the Ca'Sagredo. We were celebrating 30 years of friendship and being with our small art group from London - who were staying elsewhere- poor things! I was worried that the hotel might be too grand to feel truly relaxed but the friendly and extremely efficient staff put all my worries to rest. We had room 201, a beautifully decorated room in creams and browns with great attention to detail. The buffet breakfasts were excellent, where else do you get offered Prosecco for breakfast? And as it was there we just had to try it! We experienced the aqua alter for the first time and I was extremely pleased I had packed my wellies. The rain, however was interspersed with lovely sunshine and we were able to eat outside on most days. Highlights of the trip were going to the opera at La Fenice and visiting Torcello. We have been to Venice a few times already but our stay at the Ca'Sagredo made it our best trip yet. A huge thank you to Sylvia and the front of house staff.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Midlands", "Title": "“FABULOUS CA'SAGREDO”", "Author": "alexjn", "ReviewID": "UR21456560", "Content": "My husband and I travelled on the Orient Express to celebrate being married for a year and as an extra suprise we stayed at the Ca'Sagredo. It was stunning! The main room over looking the grand canal was beautiful by day or night. Our room was right at the top of the hotel with a balcony, from which we could see the canal, the campanile and the rialto market. The people were lovely, breakfast deicious and the cannegrio area all that we expected. A superb stay.", "Date": "November 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Killingworth CT", "Title": "“Enchanting hotel”", "Author": "a30", "ReviewID": "UR21400888", "Content": "My husband and I spent 3 nights at Ca'Sagredo. From the time we arrived by private boat from the airport until the time we left by vaporetto to the rail station we were enchanted. We were greeted at the hotel dock genially and escorted to registration which was smooth. Our interior courtyard view suite was elegant and immaculate. The housekeeping staff is terrific. The floral arrangements throughout the public rooms are fragrant and beautiful and add a fresh new facet to a centuries old palace. Breakfast buffet is plentiful and varied. We ate at different times each morning and the supply of food was frequently replenished with hot items. The staff was welcoming and attentive and the room bright and cheerful. We received accurate and useful information from the front desk staff for touring Venice. Their suggestions were welcome. The management has created an atmosphere of hospitality that is usually found when guests are visiting a private home. We observed them engaging each guest as a personal friend. Ca'Sagredo is a delightful upscale Venetian hotel.", "Date": "October 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "michigan", "Title": "“Truly a Jewel”", "Author": "diannemichigan", "ReviewID": "UR21377159", "Content": "We have just returned from our stay at the Ca'Sagredo Hotel in Venice. This hotel is truly a \"jewel\". The hotel is magnificent and we have never experienced such incredible service. The rooms were so luxurious and beautiful I didn't want to leave. The hotel has an excellent location. It is minutes from the Rialto Bridge and 10 minutes from the square. It is located on the Grand Canal and has a private pier as well as a public pier next door. Gondola's are available as you walk out the door. The restaurant was fabulous with a view that was incredible. Overall, I would return to Venice just to stay in a room at the Ca'Sagredo. This hotel is a must stay in Venice!!", "Date": "October 29, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Paris", "Title": "“My birthday party in Ca'Sagredo”", "Author": "kivavera", "ReviewID": "UR21336400", "Content": "When I visited the hotel in March 2008 we decided with my wife to organize a party for our 40th wedding birthday due in October 2008. I have invited 5 couples for 2 days. I must say my friends and myself will keep a wonderful souvenir of our stay. The hotel by itself is a real beauty, the atmosphere give you the idea of what a true Venitian Palace was in the 15 & 16th century. Rooms are at the top. You find everything you can expect. We had the chance to celebrated our birhtday in the Music Room where we had our diner. Food and service were absolutly great. The chef Mr Cosino deserve to be rewarded by the Michelin. I recommand the \"mushrooms and langoustine risotto\". The visitors must address to Audrey Di Fruscia, she is very kind and helpful and speaks french fluently. The chef of the reception is Mr Lo Mastro. You could'nt find more friendly. This address was recommanded to me by someone belonging to old Venitian aristocracy and I thank the good advise.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Perfect stay- great service, beautiful hotel!”", "Author": "Zoedax", "ReviewID": "UR21284034", "Content": "We had a wonderful stay at this lovely hotel. We booked a Grand Canal room and although the room was a bit on the small side the view more than made up for it! Service was excellent and very friendly. We were given great advice on dining as well as general tourist information. We were celebrating our honeymoon and they were gracious enough to send up some sparkling wine and chocolate covered strawberries, a very nice touch! Breakfast was more than adequate, hot and cold food items, an array of beverages, sparkling wine, etc. The opulent music and drawing rooms on the second level and the grand staircase are unlike anything I have seen at a hotel- just amazing! We would definitely stay here again.", "Date": "October 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“BEST HOTEL I EVER STAYED”", "Author": "tdsbc", "ReviewID": "UR21095000", "Content": "My family and I stayed at Ca' Sagredo Hotel for three nights at the beginning of October. We had two great rooms, one facing the Grand Canal, the other facing a court yard, the red tile roofs and the bell towers of Venice. The location is unique: while situated right on the historic waterway and next to the most significant palaces in the city, the hotel does not suffer from the noise and confusion found in the San Marco area yet it is only a short walking distance (10 minutes) from the famous Square. Among other things, we really enjoyed exploring the old fish and vegetable markets located across the canal from the hotel and the kids loved the short gondola ride that took us there. The .50 cents fare was cheap and gave us the opportunity to go on a gondola ride. The Rialto Bridge and all the shops were right next to the market. The food at the Hotel was excellent, great selection and professional service. Breakfast was evidently designed for the american and european clientel. I strongly recommand the Hotel restaurant. The food is trully first class. We travel frequently and stay at five star hotels, Ca' Sagredo at the top of the list and we will certainly go back.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kent", "Title": "“Lack of facilities”", "Author": "DDIKent", "ReviewID": "UR21093313", "Content": "Not expecting gym/sauna or swimming pool but no bar!! (although couple of tables on canalside) no public seating areas in the lobby (a couple of chairs next to door) So after returning to the hotel in the evening you are unable to relax in the hotel bar and have a drink before bed and to chat to fellow guests. All 5star hotels previously stayed in have had ample lobby seating to have drink/coffee and again chat to fellow guests which I find helpful to exchange city tips. Also the restaurant is very small ,did not try the food however so cannot comment. did not see many diners using the restaurant either. the hotel was nice enough,staff pleasant ,location fine,everywhere is pretty much in walking distance in Venice I found. So not quite enough for me to warrant 5 stars Enjoyed the the trip and city immensely I would not stay at this hotel on my next visit purely for the above reasons", "Date": "October 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Singapore, London and Ibiza", "Title": "“Nice but not perfect and location is off”", "Author": "Livingoutofasuitcase", "ReviewID": "UR20960146", "Content": "Booking the 2 largest suites + 2 large deluxe rooms was not a pleasant process. 2 emails - no response. 1 phone call & then told they would get back to me. When they did and I accepted offer without negotiation I asked for a courtesy boat taxi to pick us up from the train station as we were 8. Answer was 'no, we dont do that, we offer flowers and a bottle of champagne'. I pointed out this was a large booking, their biggest suites, no reduction requested in rate, flowers & champagne are a standard in any suite and still got a 'no'. Finally the general manager cleared the minor expense of the boat taxi on a 'one time offer only'. Very mean & tight fisted and indeed shortsighted of this hotel. How do they hope to get returning guests like us? And they are brand new? Rooms were nice enough (no rooms in Venice are really, truly incredible - none I have found at least), bathrooms are brand new, public areas are a little like a convent and cold - lacking in splendour as far as decor goes. Entrance hall & lobby really are too boring & balnd. Breakfast is pleasant enough. Ballroom is stunning. Restaurant is tiny and very unimpressive looking. Biggest issue for em is the location. Although tshi hotel hopes to be the new 5 star luxury hotel of Venice it will not be able to compete on location with all the older 5 stars which are all much, much closer to San Marco. This hotel is closer to the train station & as such the area is not the grandest in Venice and high end shopping cannot be done in the area. PS: We had to pay for our own taxi boat back to the train station! PS: No flowers or champagne either!", "Date": "October 17, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Co. Meath, Ireland", "Title": "“Good but not 5 star treatment”", "Author": "Aldaris", "ReviewID": "UR20878124", "Content": "We are just back from the Ca Segredo after a two night 10th anniversary trip. We enjoyed it very much and were full of the 'high' of being away as we are both busy working parents of three! We stayed in room 316 which is a Junior Suite at the side of the hotel. It was beautiful, very palatial but would need to be at about 650 euro a night. We had no complaints about the room-looking at a stucco ceiling every night, three tvs and a marble bathroom is wonderful. Our present from the hotel for our trip was chocolate dipped strawberries which we thought was a bit cheap. I agree a lot with the last reviewer's account. The breakfast is not 5 star standard. I have had much better breakfasts in 4 stars in Ireland. If you wanted a freshly bolied egg, you had to pay 7 euro!! We had dinner in the hotel restaurant one night. This was not a great experience. The 'restaurant' is a six table alcove with a heavy emphasis on fish. I ended up ordering breaded veal with chips and I didn't expect to see chips on a 5 star menu. Wouldn't eat there again. The hotel's location is perfect in the Canareggio region of the city which is much nicer than near the Rialto bridge. It felt more real than further up the canal. Venice is the most amazing city I have been to and I would recommend everyone to go. Its stunningly beautiful and not as expensive as you might expect but then I live in Ireland where the cost of living is quite high!!!!!!! Ca Segredo is lovely and we have great memories. Its not often you get to stay in a 15C palace. However, I didn't get a 5 star L experience.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newtownards, northern ireland", "Title": "“Beautiful Location & Hotel”", "Author": "zaria123", "ReviewID": "UR20403990", "Content": "We stayed at the Ca Sagredo for 3 nights on a trip to Italy which started with 3 nights in Rome, 3 Nights Venice, and then one night in Florence. Venice is a truely beautiful place. When we told friends about it they kept saying about the smell, and dirty river etc. But honestly we found no smell (and the weather was hot in August when we were there), and the water was no more dirty than most places, no debris, just a sea green colour. We arrived at the Hotel by Water Taxi which cost 50 Euro, a lot for a trip which is about a mile or so, but worth it simply for the experience. We arrived at the Hotel and were greeted by the Concierge and escorted in to the large and beautiful reception hall. The Reception staff were very friendly and speak excellent English, check-in was simple and quick, and we were personally taken to our Suite by the Receptionist. We had booked a Junior Suite (Without River View), and it was really beautifully furnished, very spacious, with a neat little lounge area, three TV's, Internet Access (chargeable), Marble Bathrooom etc. The staff were also very friendly, and booked a couple of tours we wanted to go on - the Ghost Tour, and the Water Taxi Tour, they were also very helpful in recommending where to eat, although Italy generally isn't great for a lot of vegetarian variety , Pizza and Tomato Pasta get a little dull for 7 days, but we can't complain we still ate very well :-) We found the location excellent - and easy walking distance to St Marco and all the sights. The building lived up to all you would expect from a 15th Century Palace, with wall and ceiling Frescoes etc, all very palacial, and added to their immaculately clean everywhere. Breakfast was simple but nice, and had lots of fresh fruit, breads, yoghurts, cereals, scambled eggs, meats, and a great slection of 'Revolution Teas', I sell these in my Cafe in Belfast, and have never had them anywhere else before - Top Quality! Every night we had a trun down service, chocolates on our pillow, and little cotton towels placed on the carpet each side of the bed. Fluffy white dressing gowns, fluffy white slippers, lots of generously sized toiletries etc. We ate in the Hotel Restaurant one night, but were a bit limited by choice being vegetarians, also we confused the staff a bit (language barrier) and got three instead of four courses, but it was nice, and beautiful located outside right on the river. Pretty expensive for what we had, but we were there to enjoy ourselves, no count pennies!", "Date": "September 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Don't waste your money...2 star trying to be a 5 star”", "Author": "DAALondon", "ReviewID": "UR20277732", "Content": "Customer service equated to 0% the place lacks any soul and warmth and actually was exhausting to stay in, the breakfast was medocre for the rating and found all of the staff extremely unfriendly, our air con was not working requested 4 times for it to be looked at with no avail, was ignored when asking about the internet facility and was told the reason why our room was not cleaned at 4pm in the afternoon was that it was a weekend and priority was given to other arrivals! Tried to have dinner but was told we were not allowed to sit outside, the constant words we can't was ridiculous, breakfast was served in a room upstairs with the same classical CD playing day in day out, last day we were leaving early and wanted breakfast went down at 8am to find nothing had been prepared, this is a 2 star hotel asking 5 star prices a bowl of strawberries was 20euros! The lifts stank of food and the door man did not even ask if he could assist with baggage I have travelled and stayed in numerous luxury hotels but this was by far the worst, take my advice and dont waste your money Dina", "Date": "September 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "", "Title": "“a beautiful palace, needs a little tune up”", "Author": "sebastiaan4norfolk", "ReviewID": "UR20054051", "Content": "A beautiful but sterile hotel that lacks a certain touch of warmth and friendliness. The place is a fairy tale Grand Canal palace with fresco and antiques and looks great with very spacious and well designed rooms. But up-tight service at the front desk and a frosty attitude ruins it for me.", "Date": "September 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Pretty Place - Rude People”", "Author": "isletraveler", "ReviewID": "UR19989319", "Content": "Wow. Hard to write a negative review, but I feel that I must. It's really a combo of good and bad... Here is the good: The hotel itself is beautiful. The room we had was a multi-level suite and it was jaw droppingly pretty and roomy. The hotel is large and has been decorated well. We didn't eat at the restaurant but when we arrived we had a couple of cocktails out on the patio overlooking the water. The lady checking us in at the front desk was very courteous and hospitable, as well as the young man concierge, the staff at the restaurant/bar, and a man at the front desk upon checkout. The bad: This may seem tedious to some people, but it was enough to ruin any good feeling the hotel's first impression had on us. This was our first trip to Italy, and the second city we visited. We were a little unsure of the tipping etiquette, but had heard that you do not tip unless you are overly satisfied with any service you receive. The hotel employs a bellman who is in his mid/early 40's with dark hair, slightly balding. He brought up our bags and set them down, and stood around a second and then left. We were not sure if he expected a tip, but he had already gone so we didn't worry about it. We called to request extra pillows and he returned to show us where they were in the room. He stood around a bit longer, and seemed a bit flustered, so I felt that he did in fact expect a tip. I asked my husband to hand him the 10 euros he had, and we asked the bellman for 5 euros in return (we had 2 suitcases). He quickly and gruffly said he had no change, put the 10 euros in his pocket and hastily left the room. To be honest we were stunned...we just paid $17 for a bellman to bring up 2 pieces of luggage and show us pillows that were already in the room. We felt like we had been robbed. We tried to just use that as a learning experience, but it taints your experience nonetheless. We encountered a few more instances of 'rudeness' and overpricing by the gondola guys and the water taxis. It's amazing that such a beautiful, historical city has people like this, that don't mind being total jerks and/or try to rip you off with a straight face. I guess we are just too naive and nice when it comes to dealing with people and when visiting other countries. And who knows, maybe we just encountered all these people at once... What should have been a magical memory for a country that we would want to return to, became a place that we speak negatively of, and do not at all wish to return to. We visited a few other countries on our trip and had a fantastic time. We will go back to those places.", "Date": "September 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "stockholm", "Title": "“Excellent”", "Author": "tommy303030", "ReviewID": "UR19304065", "Content": "Stayed here for 3nights and everything was absolutely perfect. We had a juniorsuite and the room was so nice. Breakfast was perfect to....and when we were there it was so quiet...we loved it. The hotel has a great location....easy the get to from palazzeroma with the vaparetto(10min) and at the stop(ca`dor) the hotel is 1min walk and the hotel is in a nice quiet area,walkingdistance to everything. We also took the vaparetto to the island lido to the beach,it was a great trip. Venice is a nice old city and 3nights was enough to see everything....but very expensive though.The restaurant at the hotel was magnificent...we had a 3course dinner and the food was stunning...right at the canal.We gonna go back for sure....thanks tommy", "Date": "August 24, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Banbury, United Kingdom", "Title": "“Ca Sagredo”", "Author": "Annl", "ReviewID": "UR19194563", "Content": "We have just returned from the Ca Sagredo and we cannot wait to return. My husband found the hotel when browsing the internet for somewhere in Venice for our 36th wedding anniversary. the website looked fantastic and I immediately checked out tripadvisor to see what others were saying. this confirmed his choice and we went ahead and booked. It is very easy to access from the vaparetto as the Ca D'or stop is just round the corner from the hotel, no steps to navigate with suitcases. on arrival we had been upgraded to a junior suite, with two windows, not a canal view but that did not matter a jot. from arrival to departure our stay was wonderful, the service was fantastic and nothing was too much trouble. We are sure that the staff were watching to see when we went out as everytime we came back the room had been tidied and new towels etc laid out Chocolate dipped strawberries were there on arrival and the breakfast buffett did include prosecco............ Needless to say there were several guests there either on honeymoon or anniversaries. would i recommend this hotel to others, absolutely as long as there is still room for me and my husband.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kent, UK", "Title": "“Beautiful Hotel!!!”", "Author": "The_Two_Als", "ReviewID": "UR18382857", "Content": "Beautiful Hotel! We have just retuned home from a long weekend trip to Venice. Hotel is situated in a great location to most major attractions but set in a quiet area on the Grand Canal. Hotel staff were extremely helpful. Hotel and rooms were absolutely stunning. I am quite a fussy traveller and have stayed in many 5 star hotels around the world and would highly recommend this one to everyone! Couldnâ€™t find any faults! Great break!", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“My own Palace!”", "Author": "brazilian2005", "ReviewID": "UR18015266", "Content": "After a week cruising in Croatia, we started our 5 days Venice \"experience\" in CaÂ´Sagredo Hotel. We loved every momento of our stay, including the fantastic room, with a Canal Grande view, the confort of the bed and all the amenities ( Prosecco, chocolate strawberrys, coupons for La Perla and Ferragamo), 3 TVs!!!! The wonderful staff was always there,including Roberta, Silvia and the boys..., everybody too kind. The housekeeper Claudia found my husband gold chain and leave a note for us, and the blonde girl in the breakfast ( sorry, forget her name) so friendly! In the hot days we spent in Venice, go back to CaÂ´Sagredo was like a gift!", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Carolina", "Title": "“A Beautiful Gem on the Grand Canal”", "Author": "AALynch", "ReviewID": "UR17922221", "Content": "My husband and I booked a 3 night package at this beautiful palazzo comme hotel/museum through luxurylink as the finale to an 11 day tour through Italy in June. By the end of our stay, we were in love with Venice, and felt we could not have picked a better hotel. Our suite was absolutely beautiful and plush with a bedroom, 2 sitting rooms, and a marble bathroom. Aside from the beauty of the hotel, the staff was accomodating to a fault, and the included breakfast provided variety and was an enjoyable way to begin the day. Ca Sagredo is in a wonderful location right at the Ca d'Oro vaporetto stop and conviently located midway on the grand canal. I would not hesitate to return for the staff, the location, and sheer beauty.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Bellisima”", "Author": "SpikeWilliams", "ReviewID": "UR17844712", "Content": "I cant praise this place enough.This is a historic building and even if you aren't privelaged enough to stay in the triple height, fresco ceilinged, grand canal viewed rooms you can still enjoy the splendour of this ancient jewel during breakfast or even just while checking in, the whole building oozes history, art and romance. Expensive but a a real treat. Only 10mins from SanMarco and boat stop right outside. Defintely visit the market on the opposite side of the canal and the gorgeous low key italian eaterie called Vini da Gigio nearby, best italian I've ever had.", "Date": "July 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas", "Title": "“Bravo”", "Author": "LasVegasMD", "ReviewID": "UR16399697", "Content": "This is an amazing museum-hotel. From the moment we docked and walked directly into the foyer we were met with professioinalism and courtesy befitting the majesty of the surroundings. Silvia M. commanded the front desk, her smile, and the English language with grace. The tour of the hotel was offered by the concierge en route to our suite and was quite informative. I suggest taking an extra 10-15 minutes for this experience. Our room (304) was amazing. A sitting area with private patio to the interior, full bath/shower, and bedroom with windows opening directly onto the Grand Canal. I stress this point...directly over the Grand Canal. Some hotels in this price range offer a Grand Canal view but you must look over or beyond (and hear) 2000 people waiting in line to board tour boats to Murano to view the canal. Hotel service was excellent. On both days we had 3 room services. The hotel kept track of our arrivals and departures and dinner reservations and used these opportunities to bring chocolate covered strawberries, candies, towels, linens, etc. Three times per day on both days. I was impressed. The restaurant was impressive, as well. A la carte or 3 course chef's selection menu at reasonable prices (the selection menu comes with a bottle of wine for 60 Euro). Mauritzio and Roberto are cheerful, knowledgeable, professional and quite funny. We ate 3 of our 4 meals in Venice under their care. A dock of Gondoliers, a private water taxi dock, and a vaporetto dock are within steps of this splendid addition to the hotels of Venice.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“nice hotel with history”", "Author": "anilegna", "ReviewID": "UR15911197", "Content": "really enjoyed my stay at this hotel, it is conveniently located on the grand canal, just a few minutes away from the train station on a public ferry, and a short walking distance to all the tourist sights. the neighborhood felt more authentic/ Venetian than the immediate San Marco square area upon arrival (train from Rome, than public ferry) the lobby area was not very impressive, but it is the staircase that takes you to the breakfast room, the ballrooms & etc. that is beautifully preserved my room faced a sidestreet, with the windows open you could hear the boys working the gondolas chatting away, and like I said, the area felt more authentic as heard more Italian spoken vs. the anglo saxon languages the room was beautiful, the bathroom /bathtub very inviting, the room was richly decorated without being gaudy, breakfast was decent, dinner (in the hotel restaurant) was excellent & reasonably priced (but you should definitely still go check out other restaurants in town) the only reason I 'm not giving this hotel a 5* is because on one of the nights there, Coolio & crew were in the hotel to film a music video, my room was downstairs from the set on the 2nd floor (am assuming they were filming in the ballroom), the crew had dinner late and then were upstairs from my room working into the wee hours in the morning (heard stuff/furniture being moved/dragged around & etc) it was hard enough to sleep with jet lag & I would not imagine a 4 seasons hotel allowing this ... having said that the 200euros per night I paid was a bargain for this hotel", "Date": "May 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warwickshire", "Title": "“Stunning rooms and location”", "Author": "Holiday-doctor", "ReviewID": "UR15055123", "Content": "We booked this hotel following a trip on the Orient Express for my mum's 60th birthday. A challenge for it to live up to but it perfectly continued the themes of amazing ambience, careful attention and perfect location. Could not be better, right on the Grand Canal opposite the market so you really experience the heart of Venice from your room. Drinks on the terrace in the March sun were a treat. Rooms are expensive but are even better than expected with everything you need and want. The restaurant and bar staff were friendly and attentive. The concierge recommended a great \"back street, non touristy\" restaurant. My Italian was not quite fluent enough for some of the newer reception staff.", "Date": "April 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Poole, Dorset", "Title": "“Amazing Rooms and Views”", "Author": "Live-Life-To-The-Max", "ReviewID": "UR14863957", "Content": "We stayed at this hotel at the end of our trip on the Orient Express from London to Venice. We unreservedly recommend it. Reception staff are really friendly and gave good advice on sensibly priced 'real italian' places to eat. They held our cases whilst we had a 2 day trip to Rome and when we returned they were already placed back in our room waiting for us. Very efficient. The location is excellent, right on the Grand Canal and the rooms we had had glorious views along the canal. It is right by the Ca Doro vaporetti (Water bus) pontoon stop, so its very convenient to get to the railway station and other parts of Venice and the lagoon without paying water taxi prices. There were small balconies where we could stand to watch all the vibrant canal traffic with gondolas crossing the canal right below us for a half a Euros and all the boats delivering to the colourful fish & veg market on the otherside of the canal. The rooms were amazing (We had suite 203 and rooms 104, 105) all with great views along the canal, large modern showers... lots of space, flat screen TV's, safe, trays of chocolate strawberries to welcome us... The hotel is beautiful classic italian architecture and decor inside but nicely, newly refurbished to a very high spec. and sparkling clean, gorgeous staircases and painted murals and ceilings, a real pleasure to stay in. Breakfast was good with a big selection of cereals, juices, pastries, bacon, scrambled egg and smoked salmon. Breakfast service staff were very pleasant and helpful. We had lunch at the Hotel on the boardwalk patio by the canal, it catches the sunshine and you can sit outside and really enjoy the canal side atmosphere, the service and food were brilliant. But be careful about ordering the 'cold coffee'... its just 'cold coffee'. This was a super choice to stay in Venice and we would definitely stay here again.. and again.. and again", "Date": "April 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“Dreary stay in this empty mausoleum !”", "Author": "HonorBLondon", "ReviewID": "UR14830992", "Content": "I went to Venice for my 40th birthday. It was very cold and raining but a sight to behold.I stayed at this Hotel and the booking was easy.All the female reception staff were charming but the men indifferent.The male concierge on duty at night couldn't recommend us a restauarant ! We found an amazingly charming wine bar about 5 mins walk in the street behind the hotel near the biggish supermarket , he had never head of it.We had a suite which was nice but not reallya suite and nothing special for the price.The hotel is like a museum sure but an empty one with no atmosphere.The reception hall is unwelcoming.Their restaurant for the middle aged in search of a heavy meal , no bar,lounge etc. Breakfast in a high ceilinged room ...food nothing special and taped classical music. Not much fun really ! Very expensive.Quiet but they are really missing out on a great opportunity with this lovely building which they must have renovated at high cost.It needs to develop a heart and soul .It could deliver a bit more on the breakfast front all a bit amateur.I wouldn't recommend it and I am not sure who would like it maybe on my 60th birthday ! Well situated in a nice quiet part of town with some lovely views.Beds comfy but it does pertain to be 5 star !", "Date": "April 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“What a heavenly find!”", "Author": "Ali63", "ReviewID": "UR14638351", "Content": "My husband and I stayed at Ca Sagredo last October, from the 14th to the 16th, booked as a surprise for my Birthday, and immediately fell in love with its palatial splendour and location. We had never been to Venice before and my husband found the hotel on Tripadvisor and was impressed with most of the reviews. The hotel was totally in keeping with what we wanted for a special, romantic short break and could not have been better situated - right on the Grand Canal, opposite the Rialto Market, next to the Ca D'Oro and around the corner from the Rialto Bridge, but away from the crowds around St Mark's Square. Having arrived by private water taxi from the airport - the BEST way to travel, James Bond style! - we were warmly met at Ca Sagredo's own landing stage. The staff were very professional and courteous and as we had arrived before 2pm, we were shown to the outside Terrace for morning coffee. The sun duly emerged from behind the clouds and the view of the Canal, market and passing boats of all descriptions, was fabulous. We had booked a Grand Canal Passage two night package directly with the hotel, which included a Prestige Double Room with Grand Canal view, a half hour Gondola Ride and Afternoon Tea. You can imagine our faces when we were shown to our room, which turned out to be an upgrade to one of their top two Suites - Suite Count Sagredo. The room was huge, beautiful decorated with period furnishings and antiques, its own hallway and massive marble bathroom with twin sinks and separate bath and power shower cubicle. There was also not one, but THREE stone balconies overlooking the Grand Canal! I don't think I stopped squealing with delight for half an hour and could have kissed the Bell Boy! Drawing the heavy drapes at the windows, throwing open the shutters and standing on each of the three balconies in turn in the sunshine, listening to the church bells literally bought tears of wonder to my eyes! The hotel has both a grand and intimate feel, with palatial public rooms and breathtaking paintings and frescos. We enjoyed a wonderful first night dinner in the Hotel's own Restaurant, with highly attentive staff. The Soave wine was like nectar and, just before dessert, the lights suddenly went out and the waiter appeared with a candelit Birthday cake and complimentary pastries, which was a lovely, personal touch. Breakfast was more than adequate, with an array of tempting hot and cold dishes to choose from, and lovely staff. As with previous reviews, our only complaints were minor and did not ruin our stay in any way. There was some confusion and delay over the delivery of our welcoming bottle of prosecco and chocolate dipped strawberries, together with our Gondola voucher; we were not given a preliminary guided tour of the public rooms before we were shown to our room (which so many reviewers seem to have had), and the Restaurant was a little lacking in atmosphere. With the curtains drawn, it was slightly too brightly lit and the adjoining \"Lounge Bar\", is small and more like an extension of the Restaurant, rather than a welcoming and casual place to sit, with fine views. In contrast, the Breakfast Room and adjoining rooms on the first floor are more impressive and have a wonderful Venetian feel about them. Overall, we could not have stayed in a more luxurious room, and even the sound of the passing vaporettos at night through the open shutters added to the experience of staying on a working Canal in the middle of a magical City. The sun shone for us during our entire stay, the proximity of the Traghetto stop right next to the hotel was wonderful, as we could zip back and forth across the Canal for 50 cents each way, and our Gondola ride at sunset was the icing on the cake. Contrary to some reviews, we found the staff to be extremely pleasant and helpful at all times and I can't wait to return one day. Ca Sagredo is not cheap but is worth every penny and, compared with its larger five star competitors, I would choose Ca Sagredo every time. Not only for its history and location, but also for its stunning beauty and warmth.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“A New 5-Star Standard on the Grand Canal!”", "Author": "mykel67", "ReviewID": "UR14325534", "Content": "I spent a few weeks researching where to stay during our first visit to Venice (5 nights in March). We wanted to stay somewhere memorable â€“ luxurious and prototypically Venice. I began with what most of thef guidebooks considered to be the best hotels (Gritti, Danieli, Luna) but the reviews here on Tripadvisor were very critical of these properties. Luckily an auction package through Luxurylink.com or the Caâ€™Sagredo caught my attention; it seemed to fit the bill perfectly. I bid on the package, was the only bidder, and purchased 4 nights in a â€œWater View Prestige Doubleâ€� (including breakfast, and a welcome bottle of prosecco & strawberries) for $972 US. This was an absolute steal given that the hotelâ€™s website rate for this room was 450 Euros per night, and the best rate I could find elsewhere was through Expedia for $525 US per night! Since we were arriving late we didnâ€™t want to spend an additional 450 Euros for an extra night at the Caâ€™Sagredo, so we stayed at the Hilton Molino Stucky (another bargain through Priceline, and a fine hotel as well). The next day we took the Hilton's shuttle to San Marco, then a short vaporetto ride to the Ca D'Oro stop to check in at the Ca'Sagredo. I was impressed by how \"democratic\" the vaporetto is. It was filled with backpacking students, businessmen, tourists, and designer-clad fashionistas alike. My best experience with public transportation ever! The hotel is in the Cannaregio neighbourhood, which apparently is the most residential area in Venice proper. There are lots of terrific restaurants patronized by Venetians (and not tourists being offered â€œtourist menusâ€� at exorbitant prices). It may seem removed from the hustle and bustle (and thatâ€™s probably a good thing), but we walked everywhere. After a day or two the area becomes familiar and you can find your way to San Marco, the Rialto or wherever in no time at all! Upon our arrival, the Ca'Sagredo took our breath away; it's unlike any other placed we've ever stayed (very much like a boutique hotel dropped, seamlessly, into a museum!) Our bags were taken from us as soon as we entered the lobby (the bellman politely insisted on taking even our handheld bags), and the check-in process was handled quickly and efficiently. The office manager gave us a detailed guided tour of the building. His commentary was very informed and interesting, and we were immediately impressed by the sheer scale and grandeur of the place. The murals by Tiepolo and the trompe lâ€™oeil in the ballroom are particularly noteworthy. I think itâ€™s a great thing that the hotel obviously tried very hard not to tread on the â€œfootprintâ€� of the original building too much. There were fresh flowers in all the public rooms, and any staff we passed smiled and offered a polite â€œBuongiornoâ€� -a terrific introduction to our home for the week! We were then shown to our room â€“ 106, with a view down the Grand Canal. The first thing we did was pull back the curtains and open the leaded casement windows to drink in the view. Breathtaking! The room was very luxuriously appointed, and there was a bottle of prosecco and chocolate covered strawberries waiting for us (along with a \"welcome\" note from the manager). This was exactly the type of accommodation we'd been hoping for. It felt very \"Venetian,\" but unlike the criticisms we'd read of the Gritti & Danieli, everything was in pristine condition. The Frette linens on the bed were a delight to slip between each night. The bathroom was not as large as the one in our room at the Hilton, but it was encased in marble and very well appointed. The towels and bathrobes were fluffy, and the toiletries were of a high quality (Gilchrist & Soames). It was nice to have CNN on the flat screen television while shaving and brushing our teeth each morning. Turndown service was a nice touch each night. The maid would leave chocolates and a room service breakfast menu on the pillow, replace any used towels in the bathroom, close the exterior shutters and draw the curtains. Because the room is on the canal you can hear some noise in the morning as the area comes to life, but it was not a problem for us. The shutters, three layers of drapery and upholstered walls worked quite well at muffling the sounds. We ate breakfast each morning under a Tiepolo ceiling, and sometimes took our cappuccino (delicious) out onto the stone balcony overlooking the Grand Canal. How much more atmosphere could one ask for? It was the same buffet each day, and while not as varied as those at other 5 star hotels weâ€™ve stayed at, it was still satisfying. The only disappointment was the lack of freshly squeezed orange juice. The juices offered were obviously from a concentrate. Service was pleasant and efficient. On our last night we had drinks in the small lounge and dinner at Lâ€™Alcova, the hotelâ€™s restaurant. I imagine in the summer these rooms would be very appealing with the windows open to allow the sounds of the canal to float in. There is also a terrace on which tables are set up during the warmer weather. On that particular night, however, it was quite cold out, so the windows were closed and the draperies drawn to keep the patrons comfortable and the attention focused on the food and your company. We enjoyed traditional Venetian spritzes, which were served with complimentary hors dâ€™oeuvres. Then we moved to our table in the intimate dining room, where we were served complimentary prosecco. We both ordered the four course chefâ€™s menu, and it was an excellent choice: an amuse bouche of succulent shrimp wrapped with the most delicate rice pasta; a delicious pasta course of baby shrimp in a tomato and basil sauce; grilled sea bass; and a gorgeous dessert platter. The meal included a bottle of Venetian wine, and when we finished that, the waiter brought us another complimentary half-bottle of another variety. I canâ€™t say enough about the service during that meal â€“ truly outstanding. Donâ€™t be put off by the dining roomâ€™s small size or a lack of patrons - that dinner was a highlight of our trip! The next morning we had a 7 AM flight to catch, so they arranged for us to have a light breakfast in the restaurant at 4:30 AM before catching a 5 AM vaporetto to the airport. I just assumed we would eat after we got to the departure lounge â€“ how nice that the hotel offered to cater to our schedule without our even having to ask! The staff could not do enough for us during our stay, and it was a joy to return to the hotel after a day of sightseeing. Everyone we dealt with was warm, friendly, efficient and extremely professional. I must make special mention of Sylvia, who went above and beyond in assisting us in a variety of situations: arranging for tickets to a Vivaldi concert, booking us on the Dogeâ€™s Palace secret itinerary tour, helping locate a suitcase left on the vaporetto, translating when there was a problem using a bank card at a local instant teller. She is a terrific asset to the hotel! So if you are searching for a very special hotel in Venice, one that captures all the romance and history of the city but does not compromise on quality of accommodations or service, the Caâ€™Sagredo is the perfect choice. Rest assured, there was no smell of â€œsewageâ€� the week we were there; there most definitely is an elegant, refined, subdued atmosphere throughout the hotel; there ARE vantage points from which to view the Grand Canal (both from inside and from terraces and balconies outside); and thereâ€™s nothing â€œhauntedâ€� about a hotel that so lovingly and meticulously embraces its past role as a palazzo home to Venetian nobility. What a privilege to stay in such a special place! The Caâ€™Sagredo deserves every one of its five stars. We are already looking forward to planning a return trip!", "Date": "March 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Very disappointing”", "Author": "MissNicky", "ReviewID": "UR14131997", "Content": "After reading such wonderful reviews about this hotel I have to wonder if I stayed at the right place. I was terribly disappointed with our stay here - maybe because I had such high expectations. Yes the hotel is housed in an old palace but thats where the romanticsm ends. We found the hotel to be so cold, uninviing with just big empty rooms that have so much potential but are simply wasted. We were there in the middle of carnival and there was never a soul to be seen. I felt like I was in a haunted house. You wouldnt know you were on the Grand Canal as there are no decent viewing points or doors leading out onto any balcony. I envisaged a sumptuous breakfast being served on a balcony somewhere but it was in a cold, too-brightly-lit back-room with no atmospehere whatsoever. There was never anyone in the downstairs \"restaurant\" - a white-walled, brightly-lit, closed-in, square room with the ambience of...I dont know what. Our room was a corner \"Suite\" - isnt a suite meant to have more than just a room with a bed in it? The fake floorboards with a large mat thrown over the top nearly killed us each day as everything was so slippery and we kept tripping on the mat. There were 2 single-standing chairs in the room that were always in the way and completely unneccesary - I nearly threw them out the window just to make some space. The bathroom was really very small with the (totally unecessary) bidet right as you walk in such that the door wouldnt open all the way. What little bench space there was, was taken up with a TV screen - who's going to watch TV on the loo? It was all very disappointing and not what I was expecting. On the up-side it has its own water-taxi landing right at the front door which helped getting to and from the balls in big costumes but that was about it. And no-one seems to have the guts to say it so I'll be the first. The entire building reeks of the usual Venice sewerage stench. I know its a problem too hard to fix but you cant consider yourself 5-star when the smell hits you every time you walk in the door. If you want luxury, dont stay here.", "Date": "March 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, New York", "Title": "“A luxurious, historical treasure”", "Author": "PermanentNomad", "ReviewID": "UR13290461", "Content": "We visited Venice last weekend during Carnivale. We were there 3 nights and we found the hotel just amazing. The staff is knowlegeable and helpful. The room was beautifully decorated in period style and the bathroom was luxurious, just perfect for a soak before the evening balls. Breakfast was delicious, with ample fresh fruit, as well as other standard European fare. We really loved the hotel and are looking forward to future stays there.", "Date": "February 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5"}, "AuthorLocation": "lucerne", "Title": "“elegance and romance”", "Author": "rachele_8", "ReviewID": "UR13028327", "Content": "If per chance you are looking for a discreet, terribly adult romantic escape, this is it. there is little noise,little intrusion by staff and little in the way of room service, but the gorgeous museum like ambiance more than makes up for food which you can find one step out the front or side door. it's simply something out of this world because there is (at the moment) no level of commercial anything. You simply are in another world. Order a bottle of prosecco for your room, and enjoy.", "Date": "January 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Beautiful property - poor guest facilities.”", "Author": "scotdog", "ReviewID": "UR12506694", "Content": "Good location on Grand Canal - Paid extra for Junior suite which was good size but dissapointingly on first floor not overlooking grand canal despite hotel not appearing to be full. Absolutely awful sewage smell in corridor every time we left our room which was being masked by pot pourri - not very well. Some beautiful public rooms in this hotel which are not being used - only saw one upstairs where breakfast was served. Guest lounge bar was very poor on the ground floor with uncomfortable seating that made it look like a makeshift bar rather than a comfortable cosy space to lounge in - again on ground floor off reception - nothing special - nor was the room where the hotel restaurant was located. Overall i was somewhat disappointed as I had read good reviews on this hotel but although it is 5 star it is not UK five star and certainly not in terms of facilities. To me it seems they have spent their money on decoration and interiors rather than on guest comfort and facilities. Not bad - but then nothing memorable either.", "Date": "January 10, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great hotel shame about the room safes.”", "Author": "Herks2008", "ReviewID": "UR12456180", "Content": "The hotel is a beautiful building and my wife and I had a wonderful stay. However, I do not recommend using the hotel safes as two large notes went missing. This was raised with the hotel staff. Avoid using safe codes such as 696969 or your DOB as this is on your passport that is given to reception. Once money is taken from a safe you are in a precarious position regarding reporting but we did it anyway as we were 100% sure of the contents of that safe. We didnt let this ruin our wonderful experience of Venice.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Georgia USA", "Title": "“go and be spoiled!”", "Author": "mamamattia", "ReviewID": "UR12421943", "Content": "My husband and I stayed at the Ca'Sagredo Hotel for 4 nights. I had won a package from the Luxury Link web site. It was easy to book and the reseveration staff were very helpful. On our arrival we were given access to our room early. Through out our stay the hotel staff were very friendly and helpful, We loved our room and lacked for nothing. We had our best meal in venice at the hotel restaurant.", "Date": "January 7, 2008"}], "HotelInfo": {"Name": "Ca'Sagredo Hotel", "HotelURL": "/ShowUserReviews-g187870-d648266-Reviews-Ca_Sagredo_Hotel-Venice_Veneto.html", "Price": "$350 - $1,941*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Campo Santa Sofia 4198/99 Ca' D'Oro</span> | <span class=\"extended-address\">Cannaregio</span>, <span class=\"locality\"><span property=\"v:postal-code\">30121</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "648266", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/32/b5/32b5ca12cfdc7c11a9afce37a92cce328large.jpg"}}