{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vólos, Magnisia, Greece", "Title": "“Excellent!!!”", "Author": "Eva K", "ReviewID": "UR127197617", "Content": "Great position,very close to a lot of monuments and the subway as well. Beautiful decoration as if it comes from an other era!! Comfortable rooms, delicious breakfast!! Very kind and friendly staff. We were very pleased by the service in general. An excellent begining to knowing this astonishing city!! Had a great time in Rome and in our next trip there we will surely choose \"Hotel Romance\". There is no doubt that we will recomend it to whoever is interested in vacations in Rome!! Congratulations to the staff and everybody involved. It really is an effort that deserves compliments!!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic hotel”", "Author": "Fireball H", "ReviewID": "UR127116132", "Content": "We just returned from a short trip to Rome. I booked the hotel because of the positive reviews, the excellent location and last but not least the baroque style. The location truely is excellent, only two blocks away from the Colosseum, several small supermarkets, a great restaurant (Luzzi) and a gelateria are all just a few steps away. However, the hotel is located in a quiet side street. The staff at the hotel was beyond friendly and even offered us a last cappuccino when we came to pick up our luggage (we had checked out in the morning and had left our luggage at the hotel as our flight was in the evening). The entire hotel had a lovely baroque design and was well managed. I read an earlier review, saying something about shared showers/bathroom but I can't really believe that. We had a budget room on the ground floor and even that came with its own bathroom. Also the room was bigger than I expected, with even offering an additional single bed aside from the requested double bed. (probably no need to mention this but I do it anyway: the room was also equipped with a fridge, flat screen TV, phone and closet. I was told there is WiFi too but we didn't bring our laptop). The breakfast was good as well, with several kinds of cereals, rolls, breads, fresh fruits, cake, croissants, cheese etc. For drinks there were water, some sort of juice (?), milk, tea and coffee with the cappuccino being really good. The room was very clean. So were the beds and the towels. We got fresh towels every day. Also provided were slippers, shower caps, the usual shampoo and body lotion. However, there were (very few) downsides to the room: - the shower door couldn't be closed properly but kept swinging open a few cm so you always ended up having a bit of water on the floor - the walls/doors are indeed thin and you can hear people outside the room clearly. - if you happen to be tall then the beds might be a bit on the short side for you (at least your feet get fresh air ;) ) - if you are short you might have to stretch a bit in the shower to be able to fully enjoy the massage shower - there was no wastepaper-basket in the bedroom (we used the one in the bathroom instead) - there was no washcloth in the shower/bathroom Long story short: we would come back again and definitely recommend this hotel. The down sides didn't bother us much. If you spend all day in the hotel room this might be different of course, but that'd be simply a waste of time (it's Rome after all !).", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Suffolk", "Title": "“Fantastico”", "Author": "deborahandmartin", "ReviewID": "UR127002904", "Content": "I booked the Hotel Romance for a four night Anniversary break after only limited research, due to internet connectivity problems at home. However, we couldn't have been more pleased. The hotel is in a lovely quiet and safe location, with extremely helpful and pleasant staff. It is spotlessly clean with a decent enough breakfast to set you up for a hard days sightseeing around Rome's many sites (all easily accessible by public transport 5 mins walk from the hotel). The combination of Baroque decor with modern appliances works much better than I expected, and made for a special romantic break (the hotel only opened in 2010 so everything is still in very good condition). Another benefit is that the hotel is just around the corner from the excellent Trattoria Luzzi. We found this by chance on the first night before realising that it is top rated in the Rome Rough Guide. It was so good we ended up eating there for 3 nights out of our 4 night stay (very gluggable house wine at 4 Euro a LITRE was an added bonus - with a 5 minute stagger back to the lovely Hotel Romance).", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paisley, United Kingdom", "Title": "“Top Hotel”", "Author": "Mark M", "ReviewID": "UR126729720", "Content": "Our stay at Holiday Romance was excellent. The hotel is centrally located (just a stone's throw from the Colloseum), and is in a safe area with many lovely restuarants, and hidden galleries and independent shops. We were able to do all our sight-seeing by foot from here, saving us taxi money, and enabling us to see more of Rome. The hotel is clean and tidy, and decorated nicely. Our room was cosy but deceivingly big, and our bed was very comfortable. The English speaking staff were very polite and helpful, from directions to dinner suggestions. The hotel bar was also open late for drinks and tea, which was very welcome after a day of sight-seeing. We would definitely recommend staying here.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Clean and friendly...small rooms and beds.”", "Author": "andrea1120", "ReviewID": "UR126695538", "Content": "Our room was alright... Most of the photos show decent size rooms. Our room was on the small side and the bed was short both out feet hung off the bed.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Powell, Tennessee", "Title": "“Beautiful!”", "Author": "bjdean916", "ReviewID": "UR126564941", "Content": "We stayed in this hotel this week for two nights and we were impressed! It is three blocks from the Colosseum and has such friendly staff! When we go back to Rome, we will absolutely stay here. The breakfast is included. You have to be buzzed in and out of the hotel and it is two doors down from the police station, so safety is not a concern even though it is on a side street. We cannot say enough wonderful things about this hotel!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pozzuoli, Italy", "Title": "“Hidden but worth the find”", "Author": "gibsonchop", "ReviewID": "UR125650462", "Content": "We live in Italy and were looking for a weekend getaway from Naples to Rome!!!! We were sad that this hotel was only available for one night after our first night stay..... Our GPS said we had arrived and we found a nearby parking lot that cost 4 euro for 8 hours so we parked the car and walked the neighborhood that said it was located in. Hotel Romance was a little challenging to find and in fact asked a local residence on the same street if they had heard of this hotel. No one seemed to know where it was. My husband even asked an individual in a local store. After finding it and checking into our room we were delighted that the walk to the metro and historical sites were in walking distance. We slept so good at this hotel and loved the boutique style ambiance!!!! Our 2nd night we stayed by the Trevi Fountain because unfortunately we could not stay here because it was booked. It is reallly romantic, quite and our car was safe in sound for two days by the Hotel Romance......Lots of places to dine right around the corner!!!! www.gibsonchop.com", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Hotel Romance, Rome - our stay for 7 days”", "Author": "Mirsini A", "ReviewID": "UR125638233", "Content": "It has been a very good experience for us as the hotel is very clean, the personnel extremely kind and helpful and the location ideal.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Murrieta, California, United States", "Title": "“Clean, quaint and perfect for our stay.”", "Author": "Lori C", "ReviewID": "UR125353047", "Content": "We only had 1 night in Rome, but chose Hotel Romance based on other reviews on Trip Advisor - I'm really glad we did! The hotel is within walking distance of the Colisseum (where you can catch one of many tour buses that run all over town) and had many nice local restaurants nearby. We had a 1st floor room (but was really more on the second floor the way our room was situated) that was small, but decorated oh so nicely - we felt like we were in a true, quaint European room. The queen (?) bed was a bit short, but after our experience, I'm thinking that this is a common European bed size (as opposed to what we're used to in the States). The bathroom was clean and nice and the shower had multiple shower heads which felt great at the end of a full day exploring the city. The rest of the hotel, hallways, entryway, sitting rooms and breakfast rooms were decorated just as nicely - very classic European/romantic. We didn't have time to linger over breakfast (our ride to the airport showed up 20 minutes early), but there was a nice selection of food and my husband says he had the best cappuccino of our whole trip. We would definitely stay at the Hotel Romance again!", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hobart, Australia", "Title": "“Fantastic little hotel”", "Author": "Nic1605", "ReviewID": "UR124796234", "Content": "A great find through trip advisor. Lovely hotel true to its name. Very clean, comfortable and conveniently located in quiet area. Staff were super accommodating starting with our 3am check-in due to flight delays caused by seasonally unexpected snow. The ability to arrange airport transfers through the hotel was a savior and to have the wine, chocolates and fruit, that we were able to order on booking, waiting in our room, was lovely (and great value also). Reception staff were very helpful and friendly as was the lovely girl on breakfast service. Highly recommended!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Hotel Romance”", "Author": "lensip", "ReviewID": "UR123822017", "Content": "Stayed here the weekend. It's a nice small hotel situated 5 minutes from the Coliseum. It's within walking distance of a few wine bars, pubs and restaurants and located in a quiet area. The hotel isn't spectacular but I would happily stay there again. It's clean, nicely located, quiet and cost. Price is reasonable but next time I wouldn't bother with the breakfast. Overall 3-4 stars seems fair.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Hotel Romance - very romantic and comfortable!”", "Author": "Jem V", "ReviewID": "UR122914796", "Content": "I booked this hotel for myself and my boyfriend as a suprise weeekend away. I picked it because its close to the metro (Colleseo) and the Colloseum/Roman Forum. You'd think that it would be noisy, but its not. Its very quiet and located right next to the police station (in case you were worried about any problems.. the cops are your neighbours!) The hotel is exactly like the photos - the rooms are a little small - your bed and a small desk with side tables and mirrors are pretty much what you'll get - but its lovely, and more than enough space. There is a safe in the room, and its all very modern, with a little t.v. to boot and a very cute french window (not the best view, admitedly, but the room more than made up for it). The bathroom was lovely - good power shower, the usual toiletries and towels provided. And what was obvious to us was that the place was VERY CLEAN - Amazing. I wouldn't say that the hotel was 3* - I'd say that it was closer to 4. The bad parts about this hotel are 2 fold: 1. there are loads of charming little lights in the room, but no main ceiling light, so the room remains dimly lit - romantic, yes. convenient - not so much... but maybe I'm just used to having more light in the room. 2. the walls aren't terribly thick. We didn't find it noisy, but on one night, we did hear \"noises\" from the room above us. Other than that we had a quiet stay. The staff are really friendly - I'd been to Rome before, but my bf hadn't, and so he asked a LOT of questions. Also, we used the metro and bus a lot (the busstop is very close to the hotel and takes you all the way to the vatican on bus no.81) and the staff were really helpful in giving us directions and providing recommendations on where to go/eat. there are some cute local restaurants in the area - which are really nice. There's one with an outdoor canopy, which you will have to queue for, as it gets very busy. But as a tip, skip all of that during the day, as the street food in Rome is AMAZING - go to little cafes for calzones and square slices of pizza with seasonal vegetables. Save the serious dining for the evening, when you'd want to be sitting down formally. great hotel, I'd definitely go there again. Good for couples - we saw a family there, but I'm not so sure that its all that great for kids. Also - free wifi - and the reception will help you checkin for your flights, help print boarding passes etc. the hotel doesn't have a pool. I don't think... so the score i've given for swimming pool isn't strictly correct.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice hotel , ideally located for tourists.”", "Author": "Belkacem", "ReviewID": "UR122607311", "Content": "We stayed there 4 nights in a good and large room. All hotel is very clean and nicely decorated. We did not ask for anything special. The only weakness we noted was the breakfast which was really below the level of quality of such hotel ! Despite this we still recommend this hotel.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "lineyoung@gmail.com", "Title": "“Best serviced hotel in Italy!”", "Author": "youngpeteri", "ReviewID": "UR122276605", "Content": "Hotel Romance is a small and cute hotel next to coliseum and other attractions, its was perfect in every way, and you really get full value for your money here. Before we booked the hotel, we for the first time tryid to find a central hotel with good user reviews instead of just stars, and thats how we found the hotel, and its better then many 4-stars hotels we have been on. The service was excellent, nice friendly and very smiling staff, there probably have the best english in Rome. My husband and I travel 1-2 times a month, and this one of the most comfy and friendly hotels we have stayed on!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent location near Colosseo”", "Author": "David P", "ReviewID": "UR122060674", "Content": "Hotel Romance is near the Coliseum and subway stop. I was able to walk almost everywhere within the historical center. The staff was very friendly and accomodating; the rooms very nice and clean; the included breakfast was more than enough to get me going until lunch. I would definitely stay at Hotel Romance on my next visit to Rome.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great find near Coliseum”", "Author": "David W", "ReviewID": "UR122029259", "Content": "Tucked away in a quiet neighborhood, close to Coliseum and subway stop, this place is a great find. Friendly staff, clean rooms, nice breakfast at a reasonable price. Free Wifi in the rooms is an added bonus. Don't ask the front desk for restaurant suggestions, they will only say things within a couple of blocks- which can be pricey, and not great. We would definitely stay here on our next trip to Rome!", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cheyenne, Wyoming", "Title": "“A nice quaint hotel”", "Author": "Ellie G G", "ReviewID": "UR121927844", "Content": "A nice quaint hotel with positive and helpful staff. It is very clean and fairly well located near the center of Rome. It is somewhat cramped and the stationary computer didnt work but there is free Wi-fi which is always a great commodity, just remember to bring a US/European adapter for your electronics. Overall it was a good experience.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Petersburg", "Title": "“A great hotel”", "Author": "Maria StP B", "ReviewID": "UR121887986", "Content": "Me and my boyfriend visited this lovely hotel in Rome in September! Very clean, nice breakfast, friendly stuff.. Location is good too - close to Coliseum! A pleasant place for sure!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Our own Petit Trianon, but in Rome!”", "Author": "travelbug7246", "ReviewID": "UR121633873", "Content": "Hotel Romance was serene, beautiful, and simply lovely. The service was exceptional, the room clean, big, and beautifully furnished; it truly was the most romantic hotel I've ever stayed in. Breakfast was excellent and had a nice selection of cheeses, bread, cereals, etc. An Italian coffee was never out of reach either, all you had to was ask. The area is also lovely and so convenient to many of the major sites, the Forum, Colosseum, many important churches, as well as, we could walk through wonderful areas to get to the Pantheon, Spanish steps, etc. We only rode the subway twice while there, the rest was easily walkable. You won't be disappointed, unless you don't like watching Italian t.v., because there are no english channels in this hotel -but you shouldn't be watching t.v. in Rome anyways!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“great location”", "Author": "brendan75", "ReviewID": "UR120927606", "Content": "hotel romance was a 5 min walk from the colosseum and metro,the room i was in was very small and im not to big!,nice room which was well furinshed,shower was very good in bathroom also there was free wifi all over the hotel,breakfast was basic", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, ON", "Title": "“Perfect!”", "Author": "bonbon30", "ReviewID": "UR120907447", "Content": "I stayed in this hotel in February 2011. The decor was incredible, and it was just the welcome home needed at the end of a business trip. The location was perfect - close to the Colliseum - I could get pretty much anywhere in the city. The staff was friendly, and welcoming, and very helpful. My room was teeny tiny by North American standards, but it was clean, and perfect, and enough space for 1!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Wonderful hotel and staff”", "Author": "HolidayFreakxx", "ReviewID": "UR120710863", "Content": "Stayed here for my anniversary, my partner arranged for the hotel to have my favourite wine and lovely chocolates on arrival which was great! The staff were very polite and helpful. The room was beautifully decorated and clean, the hotel also provided slippers and a men and women toiletry bag which were great! The shower in the bathroom was the best shower ive ever had! The hotel is beside the Colosseum, there are also some nice restaurants nearby and a lovely ice cream parlour at the end of the street. The breakfast was lovely and included cereals, breads, jams, roll/cake, toast, fruit, hams and cheeses, yoghurts etc, but they do tend to run out of things towards the end of service, so be up early! You can also leave your bags at the hotel if you have a late flight but still want to walk around Rome during the day. The only downside to this hotel is that our room was beside a garage and it was quite noisy at times, but other than that, it was a perfect stay! I would recommend this hotel to others.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Hotel Awesome!”", "Author": "TrippinAnt", "ReviewID": "UR120337103", "Content": "Staff: were very helpful and polite. Spoke English very well. Happy to translate Italian for us. Room: The room was of adequate size by Rome standards. Small shower. Baroque interior was a welcome in itself. Location: It is extremely well located for historical sites. Easy access to local supermarket, food and beverage shops. Bed: Bed was a bit of a let down, it was a bit hard as were the pillows. Serenity: It was very quite and a good place to get away from the bustle of Rome.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "essex", "Title": "“\"Fantastic Hotel In Everyway\"”", "Author": "vanna", "ReviewID": "UR120317983", "Content": "We stayed in this hotel from fri 4-7 Nov, this was a special trip to Rome to Celebrate my dads 60th Birthday on. Ten of us stayed at Hotal Romance. From the moment we arrived in Rome there was nothing we could fault. Hotel Romance had arranged our transfers from the airport and they were there waiting for us, we arrived at Hotel Romance and was greated by Tony who throughout our stay went above and beyond to help us when needed. We must say a very big thankyou to the owner of the Hotel a lovley lady who when we asked if we could arrange a birthday cake took us in her car to a beautiful Italian bakery for a cake ( despite the traffic !!!!! ). The Hotel was always very clean. The location is superb just 5 minutes walk from the Colluseum with many lovley bars and resturants just around the corner. All the staff are more than happy to arrange taxis for you if needed. We all had a FANTASTIC time in ROMA i would not hesitate to reccomend this Hotel. Many Thanks once more to all the staff and hopefully see you again in the future.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colleyville, Texas", "Title": "“Extremely helpful and accommodating”", "Author": "Dan D", "ReviewID": "UR120272507", "Content": "My wife and I stayed at the Hotel Romance on Oct 27. Before our cruise we wanted to stay in Rome for a night and found this hotel very comfortable, convenient with very helpful folks(great shower!). Katherine, the person at the front desk, could not have been more helpful. In fact, we arrived at the hotel right after my wallet with all our cash and credit cards was stolen in the Metro train and she did everything possible to help. This was our 3rd trip to Italy and I will chose this hotel for our next trip.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“We had a great time there...”", "Author": "E C", "ReviewID": "UR120246598", "Content": "Staff was pleasant, cappuccinos were tasty and we in love!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Romance Near the Coliseum”", "Author": "viewfromabroad", "ReviewID": "UR119733912", "Content": "My wife and I spent 5 nights at the Hotel Romance in Rome between October 11 and 20, 2011. The hotel is a 5 minute walk to the Coliseum but you would never know it because it is located on a fairly quiet side street next to a police station. It is within walking distance to numerous restaurants and the Coliseum Metro station and if you are looking to explore the city you are visiting, you can just about anywhere on foot from the hotel without much difficulty at all. The staff is extremely helpful and pleasant and were always willing to answer our questions and provide directions on where to go and how to get there. Our room was typically small for Europe but was clean, cozy and very well maintained. Room size was not an issue for us since we were only in the hotel for sleeping purposes. We went to Rome to see the City, not the interior of our room. Breakfast was included and consisted of juice, a variety of pastries, fruit, yogurt, cheese, sliced ham, toast and coffee (fancy and regular) and tea. More than enough to get our day started on the right foot. There is also a little restaurant across the street if you are looking for more that is very reasonably priced and extremely popular with the locals. I would not hesitate to recommend the hotel to a couple who are looking for a comfortable, friendly and welcoming place to stay in Rome. When we return to Rome, will be returning to the Hotel Romance. Cheers.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“OK”", "Author": "Tourist420", "ReviewID": "UR119674325", "Content": "Small room in small hotel. Cheesy décor. Handy location. Very quiet for central location except for car wash next door. Generally quite satisfactory.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Roswell, New Mexico", "Title": "“Perfect Hotel for Coupls”", "Author": "Joshua S", "ReviewID": "UR119667857", "Content": "This hotel was an amazing experience for my wife and I. The location is amazing, it is less than a half mile from the Colosseum, but is nestled into a neighborhood where there isn't a lot of traffic or noise. The hotel itself is small but elegant, perfect for couples who are looking to experience Rome. The rooms are a little small compared to American standards, but everything is modern. Each room has it's own bathroom, mini-refrigerator, safe and small flat screen television. The bathrooms are nice, the showers are on the small side. The service sets the Hotel Romance apart. All of their staff are incredibly helpful and courteous with anything from booking tours to calling taxis. They are also very pleasant to share conversation and a coffee with. All the staff spoke fluent English, there is an English gentlemen working there who is exceptionally courteous. We stayed for a total of 10 days and my wife and I will remember this hotel fondly. If we ever go to Rome again, there is no question that we will again stay at the Hotel Romance.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Beautiful, comfortable hotel close to Colosseum”", "Author": "markpb", "ReviewID": "UR119584102", "Content": "When I saw the photos of Romance, I imaged a quaint hotel with ageing furniture that needed a little TLC. Thankfully, nothing could be further from the truth. This hotel might be small but it's absolutely beautiful inside. All the furnishings are classy but well kept. Apart from the location (2 minute walk to the entrance to the Colosseum and 4 minute walk to the metro stop, the best thing about this hotel is the staff. They're all incredibly helpful and friendly - I couldn't fault them at all. The restaurant only serves breakfast and it a little small but there are a myriad of nice restaurants nearby so it's not a problem.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable hotel in a great location”", "Author": "bobdibest", "ReviewID": "UR119474469", "Content": "I stayed in this hotel for 4 nights with my wife in October. The main entrance is slightly hidden, but not too hard to find and the reception area of the hotel is clean with free maps of Rome available if need be. The reception staff are very polite and helped us when we needed some advice. There is also a computer with free internet access. Our room was small but adequately sized for our purposes. The bed was comfortable, the bathroom was modern with a very powerful shower and there is a fridge in the room to store drinks and food if need be, as well as free wifi, tv, toiletries and air conditioning. Breakfast is where the hotel loses its only mark. There is cereal, yoghurts and pastries, but selection is somewhat limited. Nevertheless, this is only a minor point, as the hotel itself is very charming and the decoration although over the top, is great. Location wise you are 2 minutes from the Coliseum and the Forum, a 15 minute walk down Via dei Fori Imperiali to the top of the Forum where the Vittorio Emmanuelle Monument and Capitoline Museum is, which is also the beginning of Via Del Corso which takes you to the Pantheon and Trevi Fountain after a further 10 minute walk. For the Vatican we took the metro from the Coliseum with a simple change at Termini for the other metro line - very straight forward and easy to do, and tickets (purchased at machines in the station) are €1 each for 75 mins timed journey - which is plenty of time. Finally, from the top of the forum you can also walk to Campo D'Fiori which is great for dinner and very lively with bars etc, as well as crossing the river to Trastevere for dinner and very reasonably priced set lunch menus (starter, main, dessert and drink €10) which include pasta, pizza, chicken etc. All in all a perfectly located, clean, comfortable hotel with great staff and facilities for a city break. Finally, please note the tariff for a taxi from the airport is fixed at €40 (at time of writing) both to and from the hotel to Fiumicino. Taxi drivers will try and charge extra for bags but the €40 price includes all bags, so don’t let them charge more! We told our cab driver with hand signals and by pointing at the paper printed from the link on the airport website that the price was €40 all inclusive and he agreed and stopped trying to charge us the €45 he'd initially asked for.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Wonderful place to be”", "Author": "MeloV", "ReviewID": "UR119436419", "Content": "Great staff, great location, nice food. My ideal place for Rome trip ever. Me and my 2 friends were soo comfortable as we'r at home. Thanks again to lovely and helpful staff again. I'll be back :)", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waterloo, Canada", "Title": "“Outstanding service!”", "Author": "Carol M", "ReviewID": "UR119397197", "Content": "We booked the hotel for two nights for our daughter and her boyfriend. This was their first trip abroad and we wanted to be sure it was a great experience for them. We couldn't have made a better choice in terms of a lovely hotel and wonderful staff. The kids felt very comfortable at the hotel and were able to navigate their way through the city. We sent some champagne and chocolates to their room and all our daughter could say was \"the chocolates were amazing\" and she loved the decor of the hotel. I can't thank the hotel enough for making sure the kids settled in safely and comfortably. I hope my husband and I can make a trip to Rome and enjoy the same hospitality - thank you! (PS - the kids got engaged when they were there so it made it even more special!)", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Perfect Location, great hotel”", "Author": "Julie M", "ReviewID": "UR119365532", "Content": "We stayed in the Hotel Romance for 4 nights. The location was ideal, just minutes away from the Colosseum/Roman Forum. Staff were friendly and helpful, helping us to find our way round the buses required to get to the catacombs. The hotel also recommended a local restaurant which was so good we ended up there twice!One little thing - i didnt realise was how much I would have appreciated a bath,until I spent long days walking round the sights of Rome, however this was a small detail and the fact that it was a Jacuzzi shower managed to revitalise my tired body, ready for another day!", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winchester, United Kingdom", "Title": "“What a gem our daughter found for us!”", "Author": "Slainte_11", "ReviewID": "UR118926874", "Content": "We stayed at the Hotel Romance for 5 nights on our first trip to Rome and thoroughly enjoyed ourselves. Extremely friendly, English speaking staff who couldn't do enough for us. Location was fantastic, very close to the Collosseum. In fact, we walked everywhere from the Hotel apart from using the Hop-On, Hop-Off bus for 2 days. Continental breakfasts were fresh and plentiful. This Baroque style Hotel was extremely comfortable and spotlessly clean with lots of exuberance and grandeur. You know that you are in bella Roma when you stay in the Hotel Romance. Can't wait to return.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford", "Title": "“Little Baroque Pearl”", "Author": "Rickytivy", "ReviewID": "UR118902912", "Content": "Very friendly small hotel in quiet but very convenient location (although slightly difficult to find as the sign over the door is not very big !). Whilst our room was very compact, this was more than made up for by the cleanliness, the great decor and the very helpful, English-speaking staff. The atmosphere is intimate and the staff really put themselves out to be helpful and to ensure that you have all the information that you need. Whilst it is tucked away in a quiet street, it is only a very short walk from the Coliseum and a whole range of other amazing sights, which means that you are really spoilt for choice for evening walks form the hotel. All-in-all a really excellent choice for someone looking for a hotel with lots of character at a reasonable price.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Small, but great hotel!”", "Author": "Greg C", "ReviewID": "UR118899402", "Content": "We stayed at Hotel Romance for 3 nights to cap off a 2-week trip to Italy. We chose the hotel because of a combination of location and price, and we were very happy with this hotel. While the hotel is admittedly small, the rooms are very clean and quite comfortable, with a decor that was so over-the-top that it was quite charming. The location (5 minute walk from Colisseo subway station) was fantastic, with some great views of the ruins to be found when walking the neighbourhood. Our window view from inside the hotel wasn't great, but if you're ultimately just using your hotel room as a place to sleep and freshen up, then it's great for your needs. We'd definitely stay here again. The staff were very friendly and the experience overall was very good!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Small hotel in great location and with friendly staff”", "Author": "171Kenneth", "ReviewID": "UR118877904", "Content": "The best thing about this hotel is its location close to the Colosseum, Forum etc. and a number of reasonably priced restaurants, trattoria and pizzeria. Staff were friendly and helpful. Our bedroom was small - but clean and comfortable. The lift was small and there did not appear to be any stairs as an alternative (apart from the clearly marked fire exit). The lack of adequate signage was a problem when we arrived as there is only one small entrance onto the road and this is not clearly marked.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fresno, California", "Title": "“Hotel Romance tiny but nice”", "Author": "traveltheworldcs", "ReviewID": "UR118371773", "Content": "I really liked this place. It had a nice casual atmosphere and the location was excellent. The rooms are very small but that is part of the charm. The only thing I didn't like was having a window overlooking the parking garage but you can ask for one that overlooks the street. The people working there are very nice and the breakfast is sufficient. It's not the Rtiz but for the budget minded travelers like myself, it was a good place to rest my head.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Malta", "Title": "“Excellent 3 star hotel”", "Author": "Victor B", "ReviewID": "UR118231201", "Content": "Excellent hotel, with very helpful staff, clean rooms. Service better that you would expect for a three star. It is only a few blocks away from the Colosseum yet it is in a very quiet road.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good for Collisseum”", "Author": "Retrofix", "ReviewID": "UR118118417", "Content": "Had a nice stay at this hotel, though the rooms are fairly small. They did help us out afetr we got stranded after the air strikes so they squeezed us into a different room the next night, though they did charge us less. Literally next to the collisseum and some nice bars and restaurants. Metro is within walking distance which will get you to the other sites in in rome which are further than you think!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A lovely, friendly, family run hotel, would definately return!”", "Author": "Angela W", "ReviewID": "UR117965324", "Content": "Catrine and her team at the hotel were very welcoming. The room was lovely, especially the spa shower, and the decor throughout was perfect for Rome!! Excellent location, just 5 mins from Colosseum, although still nice and quite in the evening so we had a good night's sleep. Would definately stay there again if we return to Rome. Rob and Angela Walker", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Can't Wait to Return”", "Author": "John M", "ReviewID": "UR117707905", "Content": "We are currently touring Italy, and our stay at Hotel Romance was simply memorable. It was our second visit to Rome and our experience here was fantastic thanks to the staff of Hotel Romance. One staff member is English-speaking, and, therefore was of much help. The hotel is small, clean, centrally located and close to all the sights. Breakfast was very varied: fresh coffee and cappuccino, cereals, fruit,cold meats, but to mention a few. Thoroughly recommend the hotel to anyone.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Gorgeous hotel, perfect location, very romantic! Ready to go back!”", "Author": "SWTxBrandi", "ReviewID": "UR117545890", "Content": "This hotel was a wonderful price and an even better location! It was energy efficient as well (which being green is an extra bonus to me) and quite elegant. We traveled all over Europe on our honeymoon for two weeks and this was one of our favorite hotels. You will fall in love with it, I promise. The Coloseum is a 2 minute walk from this hotel, as well as the \"Hop on hop off\" Rome tour bus stop. At night we got a bottle of wine and just drank it sitting beside the Coloseum, watching in all it's glory, then had a 2 minute walk back to the hotel. The hotel staff was very friendly and helpful with helping us plan our travel to the airport the day of departure. As a side, and unimportant, note, they have these delicious candies there, which my husband and I quickly became addicted to. The breakfast is complimentary as well and has a variety of stuff including very healthy options. We will definitely stay there again! And again, and anytime we visit Rome!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Beautiful Decors, Pleasant Stay...”", "Author": "Kiran_Chan", "ReviewID": "UR117248752", "Content": "Being close to the station and the Colosseum were the main reason why we chose this hotel. And not to mention it's beautiful interiors albeit a tad confined. The staffs were indeed very helpful, and assisted us with our planning and trips in Rome. On the whole, it was quite a pleasant stay. However we were disappointed with the below average breakfast, and the not so sound-proofed rooms.", "Date": "August 25, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Dissapointed”", "Author": "Kay P", "ReviewID": "UR117098484", "Content": "**Beware** After many hours trawling the internet (many months in advance) and finally deciding to book 3 nights stay at this hotel we were informed 2 days before we due to fly to Rome that the hotel was double booked and we would have to change our hotel. Extremely dissapointed!!! We were informed by Travel republic that we should count ourselves lucky it didnt happen when we had actually arrived at the hotel!!!!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Brilliantly located and helpful staff”", "Author": "alait", "ReviewID": "UR116868603", "Content": "I loved my stay at this hotel. As a female travelling alone I felt totally safe in the area and the hotel staff - especially Tony - were so helpful when my luggage was lost on my inward Alitalia flight. It's an easy walk from all the main tourist attractions which is great for a midday freshen up when the weather is really hot. Initially I missed the entrance (look on the pavement for the mat with Hotel Romance written on it!). My room was on the small side but had a wonderful shower. Good value.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sacramento", "Title": "“Excellent accomodation, very friendly staff, superb location”", "Author": "Tourist201132", "ReviewID": "UR115678790", "Content": "My wife and I, residents of California, stayed at this very friendly and comfortable hotel in July 2011. The room was comfortable and richly decorated. The small and friendly staff did everything they could to make our stay more enjoyable. The person at the hotel desk, Tony, spoke perfect English and offered lots of helpful advice. The location is superb - 3 minute walk from the Coluseum and close to major bus routes. The room was small by U.S. standards, but not uncommon for Europe. The included breakfast was generous and included choice of pastries, yogurt, fresh rolls, sausages, cheese of various types, cofffee made to order (\"American or Expresso please?\"), choice of cereal, a freshly baked cake, and much more. There are also many nice restaurants nearby and other services such as pharmacy and laundry. We had a very enjoyable stay and we highly recommend this reasonably-priced and pleasant hotel.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "bath, uk", "Title": "“Lovely hotel and excellent location for seeing all of Rome”", "Author": "emsieb39", "ReviewID": "UR115526040", "Content": "A small but perfectly formed hotel in an excellent location for most of the major sites. Our room was small but clean and had everything necessary - air con, fridge etc. Lovely fresh breakfast with fab coffee and friendly and helpful staff made this a stay to remember and we'd definitely come back. Hotel Romance is 5 minutes from the Colliseum and there are enough good restaurants nearby to ensure you can eat close for a reasonable price every night (cheaper as soon as you come away from the main road facing the colliseum). There's also a supermarket nearby for packed lunches as eating out twice a day is expensive, and there's a metro station 10 mins away which is probably the best way to get to Vatican and sites further away.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Port Macquarie, Australia", "Title": "“Hotel Romance - a beautiful little gem”", "Author": "Bridget_from_Oz", "ReviewID": "UR115508146", "Content": "What a wonderful Hotel. It had quite a modest entry from the street, but once inside it was like walking into a Palace, the décor is just superb, right from the foyer and the breakfast room through to the individual rooms ! The rooms though small (which is normal in Rome) were very comfortable, clean and quiet. As mentioned the decor is very majestic and you feel like you have stepped back in time a century or two. Breakfast was included, it consisted of cereals, pastries, fresh fruit, yoghurt, cheese and meats and was very nice. The Hotel is very close to the Colosseum (just around the corner). It’s so close that the colosseum in all its magnificence became as familiar to us as our own back-yard. There is a bus-stop down the street and the Metro is also very close, so you could get toanywhere in Rome you wished very easily. The neighbourhood is charming and had a nice feel, considering how close it was to such a major attraction, it’s actually a quiet little corner of Rome and it wasn’t busy and bustling like the rest of the city. There are a number of wine bars and well-priced sidewalk cafes that offer great quality meals in the area. My husband found the little Irish pub down the street to be a nice watering hole ! The staff are fantastic, so polite and kind. We found them very helpful, knowledgeable and always happy to assist. Overall, everything about the place was great, I cannot think of one negative comment and it has so much going for it, the location, the rooms, and the wonderful staff. Would I stay there again ?? Absolutely ............ AND I would recommend the Hotel Romance to all of my friends !", "Date": "July 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A great place to call home for a few days!”", "Author": "Dreamwalking", "ReviewID": "UR115159015", "Content": "We enjoyed our stay here very much. Everyone was very friendly and extremely helpful. Being close to the Colosseum was wonderful and convenient. Thank you for a great start to our vacation!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Perfect hotel for visiting Rome”", "Author": "fleeeting", "ReviewID": "UR114995981", "Content": "We thoroughly enjoyed our stay at Hotel Romance, especially because of the helpful staff and excellent location. Staff: Excellent! The staff were extremely helpful and friendly, especially Tony, who is a native English speaker. We don't speak Italian, and it was soooooo helpful to have him clearly advise us on where to eat, how to get around Rome, and best places to see. Our trip would not have been nearly as smooth and enjoyable had it not been for Tony. We would definitely stay here again just for the helpful assistance from the staff. Location: Great! Near the Colosseum in a neighborhood with good restaurants and a grocery store. The neighborhood is safe and not too touristy, yet close enough to the main sites that most are walkable or easily accessible with the public bus. It is especially close to where the local city tour buses pick up (at the Colosseum). Rooms: Clean, charming, and ornate. The bathroom and shower were modern with shower jets from legs to head. Breakfast: Breakfast was included with our room. It offered fresh fruits, pastries, cereal, cheese and meats. Internet: Free wifi (yay)! Signal was good in the lobby but weak in the rooms.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect Birthday Weekend”", "Author": "capcop16", "ReviewID": "UR114834355", "Content": "This is my second review on this hotel after my girlfriend and I stayed there last year. We had a wonderful time then and when my mrs surprised me with a return trip for my birthday I initially thought that it might not be as good as the first time and why risk being disappointed. Needless to say, this apprehension disappeared the second I walked through the door. Not only were we welcomed back like old friends (and not just more customers) but we had been offered the same room which we had stayed in previously. This family run hotel prides itself on great quality service and fine accommodation, it maintains the kind of high standards you would expect in a 5 star but at a fraction of the price and without the pretentious attitude! the customer service is genuinely second to none. Most staff are fluent in English which helps and freely offer to advise you on places to eat and drink that the locals frequent, often saving you money and allowing you to experience the 'real' Rome. Rome has more to offer than just the coliseum and the Spanish steps, but the location is perfect for all of these places and more. I would return to the Romance in an instant, the little touches and genuine kindness made this short break as memorable as the first. Thank you to all of you at Hotel Romance and i look forward to seeing you soon", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Perfect location and hotel!”", "Author": "Paige713", "ReviewID": "UR114707491", "Content": "Hotel Romance is a great place to stay while visiting Rome. The staff is friendly and helpful. The hotel is clean and quiet. The location is close to the Colosseum and a bus line picks up at the end of the street. We would stay here again.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Wonderful small hotel close to ancient Roman sites.”", "Author": "Kathy1116", "ReviewID": "UR114585592", "Content": "The hotel was spotless and the staff was outstanding. We stayed in a standard plus room and the room was very nice. The shower was large enough to turn around in and the water pressure was great. Great value! The colosseum was a few short blocks away. The metro was close as well. Several nice wine bars with great food in the area.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Paris, France", "Title": "“Great stay, will stay there when we come back !”", "Author": "Ben_Fani_13", "ReviewID": "UR111564170", "Content": "Lovly hotel, right next to the Colosseum, perfect location! Friendly and welcoming owners and staff, a small but cosy room, and clean bathroom. Very nice breakfast. Made the stay a wonderful one, thanks to the quality of the place. Thanks to all the staff, we will stay there again when we come back.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Great location and wonderful stay”", "Author": "BATraveler23", "ReviewID": "UR111563164", "Content": "The breakfast here is fantastic. You can walk to the Colosseum in 5 minutes. The staff is very helpful with booking museums for you from the US, and helping you get around once you reach Rome. Clean room, although small, and beautiful decor. You won't be sorry if you stay here!", "Date": "June 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very nice hotel, extremely helpful and welcoming service!”", "Author": "MrPhil74", "ReviewID": "UR110402214", "Content": "We arrived at the hotel on the end of march, for a sunny weekend in Rome. Catrine from the hotel staff welcomed us and arranged that we received our room a few hours early, as we arrived at 11am... The room was nice and clean though a bit dark. This was not a major issue, yet the problem was that our bed was small, and as i am 190cm tall, my feet were totally out of the bed. After describing this to Catrine, she immediately arranged us with a different larger room with bigger bed. This was a perfect room and we highly enjoyed it. The service at the hotel was very helpful, kind and generous. The frontmen at the desk were always updated with info about busses, travel tips, retaurants and siteseeing issues. The hotel is quite close to the colloseum and its metro station, and many bus lines are very near. The old city is also just right there. Other main attractions can be reached easily after you get more familiar with the quite awkward transportation system in Rome. Breakfast is quite standard yet effective. Prices are quite fair for what you get. And again, i believe that service and kindness are sometimes worth more than other features. We thank Hotel Romance crew for a wonderful vacation.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Itajai, Brazil", "Title": "“Great location, good choice for a first trip”", "Author": "lvpimentel", "ReviewID": "UR109422700", "Content": "Good service at all. Breakfast was simple, but very tasteful. Rooms look old, but resulted on charm and coziness. An most of all, very close to the main attractions of the city.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“A Gem in the Eternal City”", "Author": "Griswalds007", "ReviewID": "UR109252804", "Content": "We ended our honeymoon in Rome, and stayed in the aptly-named Hotel Romance. The hotel was a little difficult to see from the street so our taxi had to circle the block a few times before we found it. The people on the front desk were very accomodating and helpful, and spoke perfect English. Our room was very 'gold'. We did like it very much it, but the first adjective to come to mind when thinking about our room would be 'golden'. The hotel room was a reasonable size for Rome (and Europe in general). The hotel was perfectly located and close to the Colloseum. There are some great restaurants in the neighborhood - in fact, I had the best pasta on my trip at Ristorante Papagio just around the corner. The hotel staff were very accomodating and even printed off our reservations that we had made for the Vatican Museum. The only complaint that I would have is that the walls were somewhat thin and you could hear voices quite clearly in the next room - it was compounded for us by the fact that we had a couple that were somewhat loud and stayed up late on 2 of the 3 nights that we stayed there, but that was probably just bad luck on our part. I would definitely stay here again. You would struggle to find a better hotel in Rome. They also offered a 10% cash discount and had a decent breakfast.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Great Location, Friendly Staff”", "Author": "steven0419", "ReviewID": "UR108929928", "Content": "I stayed at the Hotel Romance over a weekend while on business. I would definitely recommend this hotel. The location is great, very near the coliseum and 5 min. walk from the metro station. There are very good restaurants within 2 min. walk from the front door. The hotel is clean and well-kept, I booked a double room to have a little extra space and it was a good size. The room was decorated in a \"Boudoir\" style. The bathroom was also big by European standards. Most of the staff were very friendly, although there was one guy who gave me a lecture about leaving my room key at the front desk when I left the building \"so he would know who was in the hotel\". (Personally, I don't think it is his business to know my whereabouts, but I let it go). Overall, I would stay here again while on business or holiday.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Grand Forks, MN", "Title": "“This hotel is a little gaudy, but it was a real gem in Rome!”", "Author": "Happy_Traveler_MN", "ReviewID": "UR107243039", "Content": "This boutique hotel is only 5 minutes from the Colosseum and centrally located. It was very quiet and a pleasure to stay here as the neighbourhood and staff were wonderful. There are a number of wonderful restaurants close by and a gelato a block from the hotel. The rooms are very spacious (we had a triple which had 3 single beds) and the bathrooms are well appointed. The first night they were unable to accomodate us as a triple, but placed us in a double and single for the same price. Nice continental breakfast. I would definitely stay here again and recommend it highly.", "Date": "May 7, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A little on the \"gold\" side but good value...”", "Author": "Nevertravellight_11", "ReviewID": "UR105967825", "Content": "Room not a bad size for Rome....the whole interior of the hotel is done in a rather unique gold embossed style....a little over the top but endearing at the same time. Room comfortable, free WIFI (yeah!) and staff pleasant. A little hard to find on the street - keep your eyes peeled! Within walking distance of the centre and near the metro so very well located.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Charming!”", "Author": "Joss_do_it", "ReviewID": "UR105456386", "Content": "Great little hotel, intimate, very charming, clean, very friendly staff (speak German, and French too!). Located 2 minutes walk from the Coliseum and 3 minutes walk from subway station. Plenty of nice bars and restaurants nearby. We stayed 2 nights at the Golden Tulip Rome hotel before (that was horrible!) and we changed after seeing this one. Don't hesitate, go for it!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“a Wonderful stay!!”", "Author": "MirabellaFlorida", "ReviewID": "UR104852681", "Content": "We arrived 6 hours before check-in, yet they gave us a room, invited us to join them for breakfast, and served us juices & coffees. The staff was kind & very hospitable. When leaving Rome to visit other cities in Italy, my husband asked \"Why are we leaving this hotel?\" Hotel Romance made Rome easily accessible, yet it was away from the hustle/bustle & quiet for relaxation. If we return to Rome, Hotel Romance will be the place we will stay! Also, internet was very good (that was important to us), bed was comfortable (we slept wonderfully), air-conditioning was cold (rare in Italy), beautifully decorated (just as pictured) and very clean rooms. Breakfast was typical of Italy, but the seating room was charming and the staff made the best cappuccino that was inclusive of our room rate.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Great location, near the Colosseum and Roman Forum.”", "Author": "Kristine_Tim", "ReviewID": "UR104333487", "Content": "Spacious and clean bathroom and bedroom. 350m from the Colosseum, fantastic and quiet location. Great water pressure in the shower! Good buffet breakfast, which starts at 7am. Room very gloomy, despite many decorative lights! Walls very thin, could hear people having sex in the next room. Staff reasonably friendly.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rimini, Italy", "Title": "“Excellent position for the Colosseum and central roman remains”", "Author": "Clive58", "ReviewID": "UR99993075", "Content": "Quiet hotel exceptionally well situated within walking distance of the Colosseum and forum, from there its a short taxi ride or interesting walk to the main shopping areas. The entrance is a little hard to find being what appears to be a metal grill in a wall, but once you find it its obvious. The parking is next to the hotel but not part of it, however it is secure and attended and actually very good value at Euro 30 for the overnight parking we needed when we stayed there. Rooms are spacious and clean, and exactly what you see in the web page which is unusual these days as hotels mainly go for the presidential suite to show off their rooms. Also very good value. Breakfast was usual European type (bread, cheese, hams etc) but was good, though the breakfast room was fairly small, which I would say was the only downside to this whole hotel, I guess I had to add something. Basically we will stay there again and is just perfect for a short or long stay in Rome.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent location, heartful breakfast, friendly stuff”", "Author": "alexandrosg", "ReviewID": "UR99368260", "Content": "We stayed there during January. A truly great hotel, located steps away from Colosseum and about 15-20 minutes enjoyable walk from the city centre. Staff is very polite and helpful and rooms are exactly as you see them in the pictures. You feel like a royal couple in there! Not to omit the breakfast, which was relatively restricted but delicious. To be honest, there was a bit of a misunderstanding regarding the city tax for which we were not informed in advance (by the hotel), but after exchanging e-mails with the hotel's staff I believe we reached an agreement. All in all it's a hotel that I would not have any hesitation in recommending it.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Just like it is in the photos.. but one small snag for us!”", "Author": "sofe1978", "ReviewID": "UR98192383", "Content": "We stayed in Hotel Romance for our 4 night honeymoon and chose it mainly because of the reviews on here which were all excellent. We would agree that the hotel is exactly like it is on the photos.. our room was quite small but the hotel had emailed us to warn us about this so we were expecting this and it wasn't that small so we were quite happy with it and it was beautifully decorated just like the photos! Breakfast was included and there was plenty to choose from.. cereals, rolls with ham and cheese, pastries, fruits & yoghurts wtih coffee & orange juice. The guy who served this was particularly helpful and a friendly face to see each morning. The location was ok, literally just next to the colleseum, it is a bit of a walk or bus/metro ride to get to the other main sights but we enjoy walking around cities and didn't find this a problem. There is a main bus route right outside the colleseum which will take you where you need to go so location wise it was very good. There were a few negative points you should be aware of. There are no tea & cofffee facilities in the room. There is a bar in the hotel but no one seemed to use this, we did order a couple of coffees one day and were surprised to find that we were then charged for them when we checked out. It's not a huge bad point but we were surprised. We also found the reception staff a bit unwelcoming, people have raved about them on here and with it being our honeymoon (and having emailed them in advance to tell them this) we expected a bit of a warmer reception that \"passports please, your room is on the 1st floor\".... that was it! All in all a nice but small hotel with lovely rooms, we would recommend it but wouldn't rave about it quite as much as others have on here.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Best hotel for the money”", "Author": "bigb00ts", "ReviewID": "UR98098628", "Content": "I took my fiancee here to celebrate her 40th birthday and we had a fantastic time the staff are very helpful and polite, The rooms are very plush and they are as in the photos and have all that you need . The location is just two minuites from the Colloseum and everything is in easy reach to view all the sights just by a underground ticket and explore !", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Great Hotel”", "Author": "lpoc", "ReviewID": "UR95196002", "Content": "For our holiday in Rome we stayed at Hotel Romance. This is an awesome hotel with the best staff. Beautiful rooms that are made up to perfection each day. All of this and less then 5 minutes from The Colosseum. Can't say anything bad about this hotel 5 star service at a 2 star price. Love this Hotel and their staff !!!! http://www.hotelromance.it/location.htm", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "LA", "Title": "“Great overall hotel”", "Author": "Dappealman", "ReviewID": "UR88782305", "Content": "Took a trip to Italy and was fortunate enough to stay in four great hotels. The Hotel Romance was one of those great hotels. My wife and I stayed in room 27 (victoria) for three nights, and it was enchanting. We usually stay at contemporary hotels, but this hotel was a welcome change. The room was spacious and had great personality. When we has a small issue with the shower head, it was fixed immediately. We also received great local recommendations on food. It is only a 6-8 minute walk to the Colosseum metro stop. Only drawback is that the breakfast is limited in comparison to other hotels. Overall, a great experience for a very reasonable price.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester Hills, Michigan", "Title": "“So happy with Hotel Romance!”", "Author": "Griffinators", "ReviewID": "UR86570769", "Content": "My husband and I just returned from our trip to Rome in late October- we chose Hotel Romance based on tripadvisor reviews. It was fantastic. I booked our stay over email and the hotel arranged to have someone pick us up from the airport. Our driver was waiting for us at the airport (even 1.5 hrs late) and whisked us off in a new Mercedes. Upon arrival, we were offered a drink, and there were cokes, waters, and champagne waiting on us in the minibar in our room. Then later in our visit (2nd night), the staff brought up some more drinks and champagne since we had mentioned that it was our anniversary. Katerine, Tony and Jeffrey were all wonderful and helpful. Especially Jeffrey, who worked at night- he had a drink with us one evening and chatted with us for 45 minutes. He even offered us his bus pass when we weren't able to buy one after hours! (Not sure what the negative reviews about the staff are- they were great). Our room was large and lovely and our view was out over a garden. The walls did seem a bit thin, but we weren't in our room that much so it didn't bother us. Breakfast was good, wifi was fast (and free). The last day of the trip when we were settling up the bill, there was a discrepancy between what we were quoted and what they presented as the bill, but Tony quickly checked the email records and found all our correspondence and honored the price that was originally quoted. There were plenty of cafes and restaurants around us, walking distance to bus stops and the Metro, close to an ATM and a grocery store. Overall I loved our stay!", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“A beautiful and romantic hotel in a great location”", "Author": "ZipporahRose", "ReviewID": "UR86157848", "Content": "I stayed in the Hotel Romance for 3 nights with my boyfriend. I was a bit unsure about choosing this hotel at first because there are so few reviews on TA, but I am so glad I did! The location is great, about 3 minutes away from the Colloseum, the Forum and Palatine Hill. Its lovely staying in the ancient section and it was great at night to go out and see the Colloseum all lit up. There was also lots of restaurants close by (most of them were mediocre at best but we did find one serving the best pizza I have ever had)! The metro station is also very close, meaning it is very easy to get to the Vatican, the Spanish Steps and other tourist attractions. There is a taxi rank just down the road, but most places are within walking distance. The staff are very friendly and helpful, they could all speak good english and offered us a drink when we arrived. The reception and seating area are very impressively decorated. The rooms are amazing, just like the pictures and very romantic, everything was spotlessly clean. The only complaint is that the standard room we had was very small and the walls are quite thin so we could hear most things that were going on in the room next door. The breakfast was included with our room fee and provided a chose of cereal, pastries, cold meat and fruit. There wasn't a lot to chose from but it was quite filling. All in all, I really loved this hotel, because there are only a small number of rooms it felt very intimate and homely in addition to being beautifully decorated and very romantic. When we return to Rome I am sure we will return to the Hotel Romance.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sault Ste. Marie, Canada", "Title": "“NIce quiet and clean hotel in an excellent location”", "Author": "Business155012", "ReviewID": "UR85105726", "Content": "I only booked this hotel because my usual hotels were full and it was in the same area where I normally stay, but I had not heard of it previously. I booked a triple room for 2 persons and it was very nice, clean, quiet, and comfortable and large enough for two very comfortably (or for a family of 3). The service was very friendly and helpful, the breakfast adequate, and the location was excellent for tourists. The hotel is quite small, which has its advantages because the staff gets to know you very quickly. The only drawback for me was the rather cramped breakfast room. I will stay at this hotel again and have already recommended it to others.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stavanger, Norway", "Title": "“An extremely Romantic stay in Rome”", "Author": "sinet", "ReviewID": "UR84642051", "Content": "As it was our first time to Rome,my husband and i booked this hotel way in advance and choose it after reading many reviews of a lot of Roman Hotels.The hotel was smaller than id thought it would be but was actually extremely cosy.It was not cheap for a 3 star but we got a large room which was decorated beautifully and was very comfortable.The breakfast was nice and we booked a lot of tours at reception with a Tour company Green Line,that the hotel was working with. The area was lovely with so many fantastic restaurants and wine bars....we were spoilt for choice.The location was great...right beside the Colosseum and in walking distance of everyting.....altough taxis were quite cheap. We really did enjoy our stay and are looking forward to our next trip to Rome and would probably stay at Hotel Romance then too. .Definetly Recommend!!!", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Utrecht", "Title": "“Nice hotel if you get the right room”", "Author": "schuski", "ReviewID": "UR84570189", "Content": "Great location and nice very clean and recently renovated room for a reasonable price (taking Rome standards into account) in a smaller hotel. Breakfast also decent with a nice cappuccino. We however changed rooms after the first night as the bed in the first room could hardly be called a double at 180x140. The next room was much nicer, more spacious, more light and the bed was reasonably sized. So ask for the garden side top floor (which actually is the 1st - the hotel occupies basement, ground floor and 1st floor of 5 story house). The manager (?) btw said she ordered new beds as she couldn't bear the complaints about bed size any more. One odd thing is that you can't use the stairs, only for emergency. And reg. the remark in a previous review about one staff member: that guy mentioned is indeed unfriendly and somewhat incompetent. But he luckily didn't spoil our stay. Last comment about the shower: I would prefer a decent ordinary shower head compared to the installed hydro massage shower panel that already started leaking. Or install something really good.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Good value, but with reservations”", "Author": "colts4653", "ReviewID": "UR84319904", "Content": "I actually would have liked to have given the hotel a better review. The location is fine, the rooms are nice, the place seems to have been remodeled fairly recently and the value is great for Rome. But, unfortunately, it's hard to get over just how rude the main person at the front desk is. The gentleman working the afternoon to early evening shift (the main shift) couldnot have possibly tried to treat us more poorly. The rest of the staff could not have been nicer, particularly the gentleman working the late shift, but the main person came about as close as possible to doign whatever he could to ruin our trip. If he wasn't there, I'd certainly recommend this hotel to anyone else. Maybe he was having a bad week - but I would rather pay a little bit more and not deal with him again.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Perfect haven in Rome”", "Author": "eleinia", "ReviewID": "UR84125935", "Content": "Cannot recommend Hotel Romance highly enough. It really does look just like the pictures, the room was beautifully furnished. Great service, delicious breakfast, decent shower. Very close to the collosseum and the buses which are a short ride to other attractions such as the Vatican. Quiet location but lots of restaurants nearby. We are already looking forward to our next visit to Rome, and we will definitely be staying here again.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Athens, Hellenic Republic", "Title": "“Grrreat atmosphere”", "Author": "AngeKenos", "ReviewID": "UR82965589", "Content": "After a bum steer at another place not far away we moved to this venue and were very positively surprised. This was not cheap but there were no hidden extras and the staff were oh so nice", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bowling Green, Kentucky", "Title": "“An oasis in the middle of a noisy, hectic, nerve racking town.”", "Author": "JTMorgan5749", "ReviewID": "UR81130020", "Content": "My wife and I stayed here for our 20th anniversary and could not have been more pleased. It's a perfectly clean, quite, and convenient small hotel with a very helpful and friendly staff. Would definitely recommend this hotel for adults, but maybe not so much for kids.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Albans, United Kingdom", "Title": "“Excellent hotel in great location with very friendly and helpful staff”", "Author": "Wilks220", "ReviewID": "UR81092052", "Content": "This hotel is perfectly located for a holiday in Rome, just a short walk from the Colloseum and in easy reach of all the sights but sufficiently \"out of the way\" to make you feel as if you are staying in part of the real city rather than a tourist trap. The room we stayed in was charming, beautifully presented and very clean. It was always quiet and we always slept well. Nothing seemed to be too much trouble for the staff who were very friendly and welcoming. We arrived early and were offered coffee while we waited for them to finish preparing our room. When we got up late and missed breakfast we were offered coffee and pastries from the bar free of charge. A fine romance.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eastern NC", "Title": "“Loved this hotel!”", "Author": "easternNCgirl", "ReviewID": "UR80213875", "Content": "We booked this hotel based on Trip Advisor reviews. Upon our arrival, we were very pleased with our decision. The location of the hotel is very close to the Colosseum and just two blocks from the closest bus stop. The rooms were small, but we were only in our rooms for sleeping so this was not a big deal. Our bathroom (room 23) was lovely with a recently updated shower with body sprays and a rainshower head. Our son and daughter-in-law were next door to us and their shower was much smaller and not updated. The bed was very comfortable and a welcomed sanctuary after a full day of walking and site seeing. The pillows are great with plenty of extras stored in the closet, if needed. Each room has a digital safe, which we appreciated and made good use of. The staff was very friendly and the breakfast was both satisfying and delicious. Definitely order the cappuccino at breakfast! The only negative was that the air conditioning was not working on the first night of our trip, but we opened the window so this was not a big inconvenience. Do not be afraid to book here-it is a great value for the price.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Excellent Choice When in Rome”", "Author": "ViajandoBr", "ReviewID": "UR78825034", "Content": "We stayed at Hotel Romance for a whole week. And we loved. Good clean rooms, great locations if you are up to sightseeing in Rome, and the staff were very helpfull. Even before we arrive Tony managed to book some tickets for us at a night visit at Coloseo. Thanks for that Tony! Katherin helped us finding a tour guide. really helpful. Jeff called Taxis and was very friendly all the time! We even meet the owner at the looby two times! She was gracefull. We would definetly go back to Romance Hotel if we come back to Rome. They still have what is good in a Hotel, price + service and confort Thanks", "Date": "September 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“good price-quality hotel in Rome”", "Author": "MMAV", "ReviewID": "UR76650860", "Content": "Great location. Very helpful, supportive and friendly staff. The best hotel in Rome in that price range.", "Date": "August 24, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hastings, United Kingdom", "Title": "“Faultless!”", "Author": "Penguins_Pet_Pumpkin", "ReviewID": "UR76176386", "Content": "Hotel Romance is walking distance from The Colosseum, The Forum, and most of the other main attractions of ancient Rome. Besides for the proximity, the hotel itself is lovely, with plush drapery and comfortable chairs in the lobby, lounge, and breakfast area. A continental breakfast was included with our room rate, which consisted of meats, cheese, fresh fruit, cereals, and a variety of breads and yoghurts. The coffee, made by the staff, was rich and good, and made a great start to the day, as well as a wonderful break during the period between afternoon and evening when a lot of the shops close down. The room was cosy, and included a decent power shower and a bidet. I can't say enough good things about the staff. We dealt mostly with Tony, but everyone we encountered was friendly and helpful beyond the call of duty. We felt as though we were coming home every time we passed through the lobby. We will definitely return to The Hotel Romance the next time we visit Rome!", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Great hotel, great location, great staff...”", "Author": "alltonnee", "ReviewID": "UR75289825", "Content": "My preferred hotel in the area I wanted to book was really quite expensive for the dates of our stay so I had to find an alternative. I really enjoyed my last stay in this neighborhood as it's so close to the 'action' of Rome, but with it's own charm and personality. Given that booking a 3 star hotel in Italy can sometimes be a lottery, I was slightly concerned that the images on the website seemed too good to be true. However the moment we arrived, I realized that the website is a very accurate depiction of the hotel. We arrived in Rome at 6am, so we went to the hotel to ask to drop off our bags not looking forward to spending 6-8 hours waiting to be allowed to check-in after a 12 hour flight. We was amazed when on arrival, we was allowed to take the room at 6am!!! Not only are the management extremely polite and, it is so nice to see that their housekeeping and evening staff display absolutely the same level of hospitality. Nothing is too much for them, and their service puts to shame many 4 and 5 star hotels. I would absolutely stay here again as any tiny snags or complaints (***) can't be justified given the friendliness, cleanliness, location and great value for money. ***(We stayed twice during our trip, and the second room was a little dark with an inward wall view compared to the first room, bright with a garden view. However, the layout was lovely. The breakfast is ample, but a more elaborate breakfast buffet would no doubt push up the prices.) This new hotel deserves to be a great success, and if our stay is any measure, it no doubt will be!", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Perfect hotel for good price next to Colloseum”", "Author": "Richard_Martinu", "ReviewID": "UR72886913", "Content": "If you're looking for a beautiful and romantic hotel, for a very good price, than this is it!! It's located 200 meters from the Colloseum and about 300 meters from the metro station. So you can be one of the first visitors in the morning. The hotel has a special atmosphere wich we describe as 'romantic'. It's perfect for a city like Rome. It really looks like the pictures on their website! Everything is very clean. The breakfast is simple but O.K. Only point is the sound of the airconditioning, but just ask for help to set the right temperature and it switches off in time. If we ever go back to Rome, we will stay there again.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sorrento, Italy", "Title": "“Above and beyond”", "Author": "pussinhighboots", "ReviewID": "UR71393093", "Content": "Well i guess I can start by saying thank you to those who looked after me while staying alone at the Romance Hotel. Even though the place just opened a month ago it amazed me how they covered all bases to keep their customers happy. From breakfast service to being given information on anything I needed (eg not getting lost in Roma) I was fully looked after and would not hesitate to tell my friends about my wonderful time at that hotel. I spent most of the time at the hotel to rest after a huge 2 weeks travelling. What a break! Thanks to all the staff.. good work", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "0001", "Title": "“one of the quit elegant hotel”", "Author": "lapulapujackol", "ReviewID": "UR70153983", "Content": "I been here in this hotel,and i like it ,and this is one of the quit and elegant hotel that i been,ty to the stuff and management.i had good and rested vacation in rome.i advice to all that when ur in rome stay in this hotel.ty again. MR.lapulapu,jackol", "Date": "July 8, 2010"}], "HotelInfo": {"Name": "Hotel Romance", "HotelURL": "/ShowUserReviews-g187791-d650693-Reviews-Hotel_Romance-Rome_Lazio.html", "Price": "$127 - $237*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Marco Aurelio 37A</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "650693", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/90/7b/3c/ingresso.jpg"}}