{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Perfect location, good price and better than I expected.”", "Author": "jgbklyn", "ReviewID": "UR128169514", "Content": "I just came back from my 1 week long trip to Rome yesterday. I was very much satisfied with my stay at hotel Esposizione Roma. It's in the BEST LOCATION CLOSE TO ALL, WALK EVERYWHERE! I was alone so I had a twin size room with a large armoire (that had a safe in it), flat screen tv, desk and chair. The bathroom was the perfect size for me I loved that it had a bidet and the shower was amazing. Yes it's small but how big do you want it to be for a cheaper hotel. It's a stand up shower with glass door and the best hot water pressure of life! I think I'll miss that the most. The bed was a little hard but I slept on top of the bedding and used my own travel blanket so I didn't mind. I could hear the people above me at times but not overnight so I wasn't disturbed. My room had no view but Rome is to be viewed from outside on the street not from the hotel! The only problem I had was that the phone in my room wasn't working and although I requested it, no one ever came to fix it. But I didn't care I had bought an Italian sim card for my cell and used my iPad for face time anyway(saves u $$$). If I did need the front desk I went to them as I came and went, which was rare. I recommend taking an airport shuttle as your cheapest option to find the hotel easiest because the drivers know where they're going, it is a little difficult to locate if you haven't been there before. The door you need says \"Esposizione 2\" and reception is on the 3rd floor. The elevator is tiny so be prepared to wait or just use the steps. By the way the best way to the Vatican is the termini train station 10 minutes from the hotel it's only 6 stops. Overall I had a great experience and yes I'd definitely stay there again. JG from New York City", "Date": "April 19, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good value for many, excellent sleep quality, great location”", "Author": "JuJuTravels", "ReviewID": "UR127890112", "Content": "This hotel is very basic but offered just what we needed (a good night sleep) with relatively affordable price. The location is brilliant with all the major sights, restaurants and railway station in walking distance. Staff was friendly although we only had more contact with them during arrival and check-out. I don't know if we were just lucky and had silent neighbours but we hardly heard any noises during the night. During daytime instead, you could hear people walking in the corridor through the door. Anyway, I think I've never slept this well in any hotel. The hotel reception is located in the third floor and there is just a small sign outside, so it's not so easy to find but shouldn't be too hard either if you know the street number. The room was ok and they come and clean it every day. The only clear minus is that there wasn't enough space where you could keep your stuff.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "kidderminster", "Title": "“Average!”", "Author": "chop04", "ReviewID": "UR127466731", "Content": "Reception friendly and efficient,hard to find look for the Michigan hotel sign it's in the same building on the third floor.bed uncomfortable,noisy right behind reception.the room was clean but odd set up,half a curtain,dim lights,shower took a age to warm up.no English channels on tv.if your claustrobic don't use the lift. Would I stay here again probably not.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Stay was OK, but wouldn't recommend”", "Author": "twentyfourthworld", "ReviewID": "UR125908662", "Content": "+ Rooms were very pretty and looked just like the photos, and very clean + Room tidied and new towels left every day + We had quite a large balcony (which looked onto nothing but a wall, but nice to have for smoking! + Possibly the best shower I have ever had in any hotel! Really big and powerful. Bathroom a big bonus. + Good location, 10 min walk from train station, 10 from Trevi fountain, Piazza Venezia... to be honest we took taxis to the Vatican and Pantheon, as I found the maps a little confusing and it wasn't too expensive anyway! - The walls are too thin!!! Sat up with friends about midnight having a conversation, with no music on, and was complained about by neighbours and accused of having a party! When reception knocked there was a child happily asleep in our room, yet we disturbed numerous guests and had to whisper. Also, when next door used the bathroom you could swear they were in your bedroom! It's a really big problem, I've never known anything like it and it put me right off, I felt on edge speaking in my own room after 10pm incase people complained. - The shower, even though it's really cool, flooded our room and ended up with a lot of wet clothes! We told reception though and they did come to fix it. - No wifi signal in the room so had to walk down a very big corridor to get a signal, which was annoying. -Beds were uncomfortable, even though they looked nice. The hotel was convenient, clean and pretty, and we got a good price, but the noise is a really big problem and made me feel very uncomfortable! If you plan on having conversations past 9pm I'd be prepared to be assaulted by neighbouring guests and reception. The ironic thing is it actually says soundproofed rooms on the website!", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Varna, Bulgaria", "Title": "“Good value in a great location”", "Author": "markmctaggart", "ReviewID": "UR125266935", "Content": "Stayed here for 3 nights on our trip to Rome. We walked there from the train station and it takes about 10 minutes so no need to get a taxi. Its within walking distance of all the central sights so we really couldnt complain about the location. The Hotel reception is on the 3rd floor of a large building and they have rooms on several floors (We were put on the 5th and our friends on the 2nd). The room itself was good, much as youd expect for such a property, a double bed, TV, fridge and shower all to a good standard. The staff were friendly and gave us a map marking all the sights on when we checked in. Overall, we had a good stay here.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "nijmegen", "Title": "“extra taxes”", "Author": "Peter v Posted by an Easytobook.com traveler", "ReviewID": "UR125166581", "Content": "On the day of our departure we had to pay extra taxes besides the ones on the booking form. Though it was mentioned in the small letters it was a strange surprise. The room was nice, but washing noises from other customers in their rooms we could hear rather good. The room did not have a beautiful view outside. The temperature in the room was not adjustable.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheltenham", "Title": "“Rugby Trip to Rome”", "Author": "Michael E Posted by an Easytobook.com traveler", "ReviewID": "UR124665447", "Content": "Great location and very reasonably priced room. Only down side was lack of tea and coffee making facilities in rooms. Also mattressess were a bit hard but this is probably due to beds being brand new. Also an English speaking channel on the TV would have been useful but not essential.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sheffield", "Title": "“Excellent location, great stay”", "Author": "pink_tsk Posted by an Easytobook.com traveler", "ReviewID": "UR124660192", "Content": "The hotel was in an excellent location with all the great attractions and Termini within walking distance. It was a bit hard to find though as the signage was very small but scrutinizing every name plague on the wall opposite the Palazzo delle Espisizione should do it. Also the lift is a very tight squeeze so if you have a lot of luggage, be prepared to squeeze in or walk up 3 flights of stairs. The rooms overall were spacious and fairly comfortable but the air-conditioning wasn't working but opening the window worked, the wifi wasn't working which really was a bummer and there was no kettle, which thankfully wasn't a problem as we didn't need it to make milk for our baby. Overall, we're happy with our stay.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“A place to sleep to explore the city on your doorstep”", "Author": "JessW92", "ReviewID": "UR124223086", "Content": "When it comes down to it this hotel is very basic, all you get is your room and your bathroom. The beds were very comfortable, you got your own television (Italian channels), a fridge, plenty of closet space and a fairly modern and large bathroom. There wasn't a spectacular view and it wasn't the quietest at night time... BUT... all of this can be ignored because of the fantastic location! I will even ignore the extremely disappointing fact that there was no kettle or tea-making facilities in the room. We walked from the train station, which took about 10 minutes, and the hotel was right on a main highstreet with many shops and restaurants. While me and my boyfriend were there we walked to most places just because everything was so near. The Colosseum was literally down the road, and the Trevi fountain and Spanish Steps where across the street only a few miles away. Do take a map though because the streets are abit like mazes, but once we'de been there afew days we knew our way around and ended up going back to most of the attractions. The metro was extremely handy aswell. We took the metro to get to the Vatican City, but we ended up walking the way back which wasn't effort at all as we got to see the Pantheon and the beautiful bridge infront of the Vatican. I recommend this hotel for its brilliant location. Me and my boyfriend had a great time there and I hope you do too.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Average room in great location.”", "Author": "Luckett79", "ReviewID": "UR122021781", "Content": "Room was small but tidy with adequate facilities including free Internet. Walls must be quite thin as noise from other rooms and hallway is very loud. Excellent location on Via Nazionale within walking distance of many attractions and Termini railway station.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "capetown", "Title": "“Basic Hotel in Excellent Location”", "Author": "jpreid", "ReviewID": "UR120081034", "Content": "This is a basic hotel , you have your bed and your bathroom. The hotel is in a excellent location walking distance to most of Romes tourist activities. The price is expensive for a basic hotel so dont expect to much even with the high price.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Aberdeen, Scotland, United Kingdom", "Title": "“Excellent location”", "Author": "lynsayjane", "ReviewID": "UR119861488", "Content": "I travelled to Italy for my 30th birthday this year and spent 9 nights staying here in Rome. The location of the hotel was perfect, I was able to explore the whole city on foot. Vatican City was probably the furthest away but only took 30-45 mins to walk. The street outside the hotel was very busy however the noise didn't carry to my hotel room. The room I was in was right behind the reception and noises did echo in the corridor, there is also a buzzer for having the street level door opened at night which was quite noisy too. But I did still manage to sleep easily enough and I'm a very light sleeper. The room and hotel was very clean and well furnished, the bathroom was modern and spacious. The hotel also left a bunch of flowers and cake in my room on my birthday after my mum emailed them which was a lovely touch. I would happily return to the hotel and would recommend it. However please note that the hotel is on the 3rd floor and although there is a lift it was rather petite.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Most Comfortable Safe Base for Exploring the City!”", "Author": "Overlykeen", "ReviewID": "UR119139029", "Content": "I booked this as a surprise for My Boyfriend so researched hotels and reviews extensively as I was worried about the quality of accommodation. I was thrilled with my choice when I arrived. We stayed on the third floor. The pictures on the website is the room we got. Clean, quiet and comfortable bed. The Bathroom was modern and spacious. There is an option of breakfast in your room which I didnt avail of and the mini fridge came in handy for water and fruit. We didn't use the Metro once as we were able to walk everywhere from via nazionale. Would definitely recommend this place to family and friends. It is not your typical \"hotel\" there are several in the building itself but I think this is typical of Rome. I was more than happy with the price also 4 nights over the weekend was less than €500 for the room for both of us.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marin County, CA", "Title": "“Great location”", "Author": "bsballbabe", "ReviewID": "UR118908169", "Content": "Esposizione Hotel is in a fantastic location. Close to the Colosseum, other sites, the Metro and the train station. Our room was quiet and the bathroom larger than I expected. The halls do echo so you can certainly hear when someone shuts their door or walks down the hall. It was great being able to open our room windows for some fresh air and not get any street noise. Plenty of restaurants/bars, places to shop and there is a grocery store across the street and up a block or so. It was nice to have a small refrigerator in the room too. The elevator is very small and no more than 3 people w/o luggage can squeeze in there. We were on the 4th floor and primarily used the stairs. After long days walking it would've been nice to take the elevator, but it was being used to move belongings/items to another floor or there were people already waiting for the elevator. Keep this in mind if you have someone in your party who may have a challenge with stairs.", "Date": "October 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Definitely POSITIVE recommendations”", "Author": "Gattusak", "ReviewID": "UR114866430", "Content": "We absolutely loved this little nice hotel! When we saw it from the street, we thought that it might be noisy inside as it is situated at very lively street. But we were surprised how quite it was inside. Our room was on the 5th floor (#57), and we slept like babies - no noise, no bright light if you close special flaps on windows, good showers etc, etc. There was not any view from the window, but being in Rome it is nice not to have any while you are having rest. We walked to every location on foot, even to Vatican (it is a lovely 25 min walk). Personnel is great and helpful (Vicky was very nice), we were helped with booking of our taxi to the airport which was very handy. So definitely POSITIVE recommendations to all, if you are looking for budget and would like to be in the very center.", "Date": "June 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cork", "Title": "“Excellent Hotel”", "Author": "ManByTheLee", "ReviewID": "UR82781324", "Content": "We stayed three nights in Hotel Esposizione. The room was large, bright and clean and overlooked the street. The bed was really comfortable which was welcome after long walks around Rome. The reception staff were very friendly and helpful and made our stay very pleasant. The breakfast was fair. It was mostly sweet - sweet croissants, sweet cake, sweet yogurt. Coffee was ok. It was served in the room as there is no breakfast room. I prefer to eat at the table rather than on the bed. location is good. It's not to close to Termini but is walkable. Central Rome with all the major sights is also within walking distance. I would recommend this hotel.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Excellent hotel”", "Author": "weronika_nadia", "ReviewID": "UR71864231", "Content": "I like this hotel so much! Staff is very helpful, breakfast was tasty, ideal for woman :) - croiisant, juice, youghurt etc. The best is location - closed to fontanna di trevi and metro station. Via Nazionale is also quite nice street, noisy but you can't hear it during stay in hotel. Thank you very much for excellent holidays and best regards for one man from the reception :) My mother and sister are also pleased! I will recomend this hotel for sure :)", "Date": "July 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "athens", "Title": "“choose something else”", "Author": "atheniantraveller60", "ReviewID": "UR68423917", "Content": "The only good thing is the location, close to everything on foot or by bus. Otherwise, the hotel is situated on the 3rd floor of a building which is not mentioned on bookings.com. The room looked into the skylight, the furniture was poor : no drawers, only one chair so one of us had to eat breakfast sitting on the bed.- there are no brekfast room or lobby on the premises. The aircondition was too noisy.The staff didn't speak english !!! The price they charge is too much for what they offer. Avoid it...", "Date": "June 23, 2010"}], "HotelInfo": {"Name": "Esposizione Hotel", "HotelURL": "/ShowUserReviews-g187791-d650611-Reviews-Esposizione_Hotel-Rome_Lazio.html", "Price": "$90 - $236*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Nazionale 66</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "650611", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/97/09/9709f1a29042c74f2b2f692c35a29cd25large.jpg"}}