{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "RABAT", "Title": "“Prestige Guest House, still the good address !”", "Author": "EPICURIEN-2010", "ReviewID": "UR122958671", "Content": "As I couldn't move because too much work, my Wife decided to travel to Roma with my 10 years old boy. She wanted to go for shopping before Xmas and also visit some monuments. They wanted to spend 10 days there. My Son cannot walk a lot because of health problems, so I made the reservation to Prestige Guest House to be in the very center of the City. All the staff, especially Mirela, did their best to find activities and games for the boy and gave address of excellent small restaurants near the hotel. I want to thank these people for the help and smiling service ! About the hotel, new air conditionning system, nice equipements, quiet and smart rooms ... still the good address to stay in Roma ! My Wife and my Son will stay in this place again with some friends during february holidays. Flight Tickets and reservation already boocked.", "Date": "January 12, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Fellbach, Germany", "Title": "“very good location”", "Author": "isaGermany", "ReviewID": "UR117329643", "Content": "The location is perfect to see all the important attractions of Rome. The little hotel is very nice and the staff is extremely nice and helpful. Our room was very quiet, the beds are a bit tiny but very comfortable. The breakfast was served directly in the room exactly at the hour we ordered it. The hotel is recomendable for a short stay.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Stouffville, Ontario", "Title": "“Never again....terrible, terrible, terrible!!!”", "Author": "KarlyT_11", "ReviewID": "UR114775463", "Content": "This guest house occupies one floor of an apartment building. On our second night the neighbors on a lower flower blasted music until 4am. Other neighbors in the building were screaming all throughout the night for them to turn their music off. The room itself was old, dusty and dirty. The bed was so incredibly hard the floor would have been more comfortable but the carpets were stained and sticky. The walls are paper thin and you can hear everything and everyone. Since this guest house does not have a breakfast room they deliver your breakfast to your room. Would have been a nice perk if they didn't forget your breakfast like they did on the morning after our sleepless night. We checked out 2 days early and despite our terrible experience they would not even refund us for one night. We found a much better hotel 5 minutes away and it was a million times better and actually cheaper than this place. I would NEVER recommend The Prestige Guest House to anyone.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "RABAT", "Title": "“Still great service in Prestige Guest House Roma !”", "Author": "EPICURIEN-2010", "ReviewID": "UR81432922", "Content": "As I needed to go to Roma again for my business, I decided to stay again to the Prestige Guest House which is very close to my meetings. Still great service and very nice people to assist you ! Special thanks to Mirela and the morning staff. I think I have found \"my address\" in Roma. Next time I'll bring my Wife and my Son to visit the Historical Center of this beautiful City.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“The best!”", "Author": "Patndave831", "ReviewID": "UR80388061", "Content": "My husband and I found this the best place in Italy. We are seasoned travellers. The reception is just outside your door but we never heard a beep from them, but felt secure that should one of us get sick or be in need of something we had them right there to assist us..This also ensured we had no worries about or valuables being left in the room. Its like having a security guard outside. We had forgotten our camera at a place and realised only when we got back to the guest house. The receptionist got on the phone straight away and located it for us. The same day we came home from walking all day and were very pleasantly surprised to hear a knock on the door and the lovely young lady holding a tray of refreshments for us. Nothing is too much for the staff. We were assured that if we got lost, to contact them and they will send a taxi to collect us. The rooms were immaculate, quiet and comfortable, the mattress a bit hard but we had no problems with it. The position is fantastic. We walked a few steps to get to the major attractions. Restaurants were plentiful and shops galore around us. We were the envy of other tourists who left the Spanish steps to treck back to their hotels in the dark. Would go again and again and again...", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Virginia Beach", "Title": "“The very best”", "Author": "KerryVirginiaBeach", "ReviewID": "UR39462634", "Content": "We had no idea what kind of place this would be but were so pleasantly surprised when we arrived. The location could not be better . You feel like you are staying in someone's home. The owner met us at the elevator and was so friendly. My husband had come down with a bad cold and the owner went out at night for medication. This is something you would never experience at a big hotel. The beds are comfortable , the WIFI is free ( a big deal in Europe). Every morning we were served a delicious breakfast included in the price of the room. We stayed an extra day . The staff was great when it came to directions and even called the Vatican to make sure our tickets were confirmed. I recommend this guest house to traveler looking for a home away from home.", "Date": "September 1, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Ideal location and very good reception”", "Author": "syno", "ReviewID": "UR20082493", "Content": "Ideally situated in the centre of Rome, near the Piazza d'Espagna, not far from the Fontana di Trevi and with a lot of shopping facilities. All the major tourist sites the Vatican, forum romanum Pantheon are accessible by foot. The hotel is located in the via frattini, which is a one way street and quiet at night. The hotel is more a kind of luxury bed and breakfast than a classical hotel, indeed it is situated on the third floor of a building where local people life on the other floors. And the lift is a nice experience old fashioned a bit scarry but working very well. There is no dining room so the breakfast is delivered every morning on your bed at the time you choose.(coffee or tea, orange juice(-), croissants, marmelade, toasts, no eggs.) The disadvantage of this hotel is that there are three rooms situated just in front of the reception (the door is situated 2 m away from the desk) and you hear every telefone communication. But the owner is so nice, you get a welcome drink and a map of Rome with the visiting possibilities, she can also arrange for visiting tours (we had the Rome by night tour which was not too bad ,they pick you up at your hotel for the tour). The hotel can also arrange for a pick up at the airport with a mercedes benz at the same price as a Taxi 40 €. Beware of local taxi drivers, the price from the airport to Rome is fixed at 40 euros plus one euro for each luggage often they try to charge you a lot more.", "Date": "September 15, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Boston, NY", "Title": "“Double Room being renovated”", "Author": "kdogz13", "ReviewID": "UR13697115", "Content": "I booked this B&B and after I received my confirmation, the general manager emailed me to say that the B&B was being renovated during my stay. I quickly checked two other sites, and rooms were still available. When I asked about those sites, the general manager said, that just my room that I happened to book, a double room, was being renovated! There were other double rooms available but he said I would have to pay 250 euros more for the other double rooms! I reminded him about the guarantee I received from the booking website that says my room is guaranteed and if unavailable, then I should be upgraded to another room or hotel. The general manager's reply to this was to apologize for the mistake but I could just pay three times as much for the same room I booked if I wanted to stay. Needless to say, if I receive this type of customer service from the general manager before I even arrive, I would hate to see what happens when I actually show up. I will never stay in this B&B.", "Date": "February 20, 2008"}], "HotelInfo": {"Name": "Prestige Guest House", "HotelURL": "/ShowUserReviews-g187791-d650902-Reviews-Prestige_Guest_House-Rome_Lazio.html", "Price": "$130 - $272*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Frattina 34 (3o floor)</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "650902", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/32/d9/32d9afcad7c951591348935ed2e568d06large.jpg"}}