{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Great for a short break”", "Author": "doreen346", "ReviewID": "UR128522428", "Content": "Stayed here for 3 nights in March. Rooms small but clean and breakfast good. Good location for sightseeing and very handy for lots of eating places by the Spree. Found the staff rather offhand .", "Date": "April 24, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“First time staying here not the last”", "Author": "Anne B", "ReviewID": "UR128347048", "Content": "Great hotel in a quite location very near all the sights, station,shops and Resaurants. Staff very friendly & very helpful, very clean, good choice for breakfast to suit all. Ideal place to stay on a short break. Would go again.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pristina, Kosovo", "Title": "“Does what it says on the box”", "Author": "Bennelong", "ReviewID": "UR126930907", "Content": "If you are looking for a budget stay in a clean, safe hotel without too many bells and whistles, you have it. Free wifi in the rooms, which are compact but well-kept, decent breakfast for 8 euro, walking distance to one of the main shopping / eating precincts, helpful staff, and you can't go wrong. Don't stay here if you are looking for a special Berlin experience, but if you want somewhere to shower, sleep and check your emails, this is a good pick. 20 euro taxi ride from Tegel airport. Note the only English TV channel is CNN.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Base for a Short Break - very pleased”", "Author": "michael c", "ReviewID": "UR126548474", "Content": "We stayed in the hotel for 4 nights as part of a short City Break to Berlin in March 2012. We only planned on spending a minimal amount of time in the Hotel, and this hotel seemed to be perfectly located for quick access to the sights and restaurants - and it most definetely was. We flew to Tegel airport, and took the TXL bus into the centre. This hotel is a 400 metre walk from the Karlplatz bus stop (15-20 minutes on bus from airport) so no need for expensive airport taxis if you've not got too much luggage. Check in process was smooth and friendly, and we were in room, unpacked, and checking out the sights already about an hour after landing! The Room itself WAS small - but that didn't bother us - as i said - it was just a place to sleep. It was however well equipped, with everything you'd expect. The only obvious exception to this was a kettle and Tea / Coffee - not the end of the world however. Bathroom perfectly fine, and a great shower. Only 2 english speaking channels on the TV - again - not a problem. Wasn't going there to watch TV. The Hotel is only 20 mins walk from Reichstag / Brandenburg Gate, and 10 mins walk to the river Spree by Fredickstrabe with plenty of Bars and restaurants on the riverside. We even walked all the way to Alexanderplatz in 45 mins at a leisurly pace. Overall an Excellent location Breakfast was really good. Pretty Much everything you could want. Hot Bacon / Egg / Sausage, cold meats, cheeses, pastries, bread, cereals, fruit, smoked fish, juices, tea coffee. The breakfast room was very big, and although it was considerably busier over the Saturday and Sunday mornings that we were there was plenty of seating. The Hotel Bar was small but never busy when i visited, and also has two internet stations where we were able to book into our return flights and print boarding cards at no extra cost. Now - We stayed in a room on the first floor - When we opened our curtains on the first morning, we received a bit of a shock to see a man in a hospital bed in the building opposite looking straight into our room. After a bit of initial shock, we eventually asked reception what it was - The building opposite (an old WW2 bunker, and subsequent Cold War Bunker) houses a private art collection (The Boros Collection) - one of the exhibits is in fact by a famous Danish couple, and is in fact of a man in a hospital bed looking out of a Window - so don't be alarmed. We thought it was a bit of a nice talking point!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Great location and great staff!”", "Author": "Charlotte946", "ReviewID": "UR122021223", "Content": "Stayed here in September for a couple of nights. Excellent location, all major sights in walking distance and loads of great places to eat by the river. Hotel staff couldn't help enough and were an absolute pleasure to deal with. Super budget hotel, would definitely stay again.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location and hearty breakfasts”", "Author": "Discerning74", "ReviewID": "UR121896570", "Content": "Very well situated and a few minutes walk from the airport bus to Tegel (leaving Karlplatz). Very small rooms - don't bring the cat to swing around! More than offset though by the breakfasts - plenty of continental fare as well as eggs, bacon and sausages. Very clean and comfortable with friendly helpful staff.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice clean hotel in good location”", "Author": "LondonFifi_04", "ReviewID": "UR121242597", "Content": "Hotel is situated in a good quiet area near to lots of good bars and restaurants (particularly the Berliner republik overlooking the river which has been mentioned in another review) . You can get the airpoirt express train from Schoenefeld airport to Friedrickstrasse station which is only 10 minutes walk away. We had a room on the 2nd floor which was fairly small but perfectly fine. The bathroom was open plan i.e there was no door and consisted of a large shower and a sink, there was however a door on the toilet. That set up was fine for us but i guess if you were shaing with someone you didn't know too well it could have been a problem. I don't believe all rooms were set up this way so best to check when booking. Didn't have the breakfast so can't comment but i believe it was buffet style. All in all nice little hotel and would definately recommend it", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Great Location, Very comfortable would thoroughly recommend for weekend breaks!”", "Author": "bevmac36", "ReviewID": "UR120994845", "Content": "A group of us went for a weekend to Berlin. This hotel was really well located by Fredrickstrasse one of the main streets that walking you get to check point charlie in about 20 mins. Rooms were small bust very clean and comfortable. Breakfast was good Great pub called the Berliiner Republik not far from the hotel ( Turn to the left out of the hotel, cross the road to the end by the river and station entrance. Turn left and its just on your left) Open till 6am and does amazing range of beers and food until 6am. http://www.die-berliner-republik.de/en/ ) Also did a walking tour for 4 hours with the Original berlin walks ( www.berlinwalks.de) led by Carlos were surprised when 76 people turned up for the walking tour so they called in another guide and we went with a guy called Finn. Learnt so much about the history . Cost 12 euros and was worth every penny. Saw so much that would never have seen otherwise. Good restaurant called Maximillians just off Frederickstrasse had some wonderful goulash soup", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Harrogate", "Title": "“Comfy, great location, value and breakfast”", "Author": "zippymonkey", "ReviewID": "UR120189950", "Content": "Compact rooms, but clean and modern. Easily walkable from main station and to most of the main sights in the Mitte district. Excellent breakfast with lots of choice and fresh local cakes. Definitely good value and ideal for a sightseeing trip.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, UK", "Title": "“No Serious complaints”", "Author": "pudddddin", "ReviewID": "UR119985271", "Content": "Stayed at this hotel for 2 nights at the end of October. Everything was very clean and the service at reception was good. Overall I had no serious complaints about the hotel the beds were comfortable, the rooms were well maintained, it wasn't shabby, there was nice touches like fruit in the room and we got a free breakfast.... but i have to consider the price vs. value... we paid around 100 euro a night and the place is basically a travelodge or premier inn with a nice breakfast. There were no tea or coffee making facitities in the rooms and the shower cubicle was the most bizarrre design i've ever seen - very open plan!! I was staying there with a friend and when either of us wanted a shower we had to leave the room or face the wall for the duration of the other persons shower because the shower is in the main sleeping room and has a clear glass door. Not ideal. The good thing was that there is free internet, so at least i could go and use that while my friend was showering! ;) The beer at the bar was terrible... the bar staff did not seem to know what they were doing and the beer i did get looked like an ice cream cone... also, the tv in our room had no channels, which was annoying when i wanted to watch something after a night out. The breakfast was fine. Nothing special, but fine, fresh and i have no complaints about that (apart from that there was no black tea for us English people!) The location is excellent, about a 3 minute walk to Freidrichestrasse station and from there you can connect to most areas of the city with ease. Overall it was a good stay but the few finishing touches i mentioned would have made it perfect.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Prime Location, Lovely Hotel”", "Author": "Gigikins07", "ReviewID": "UR119722689", "Content": "My friend and I stayed here for 5 days in the Fall. We wanted a place that would be a great base for exploring the city but also one that we would enjoy spending a bit if time in. It definitely exceeded both of these criteria. The hotel is in a friendly and safe neighborhood only steps away from fantastic restaurants along the river. Brandenburg Gate is a 15 minute walk while Hauptbahnhof is about a 10 minute walk. The hotel itself is lovely. We weren't sure about staying at a Best Western but it was surprisingly personal and unique. Service was great. The desk workers recommended great places to eat and called cabs for us on multiple occasions. Breakfast was a bit pricey but worth trying once. We definitely recommend this place.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Great hotel”", "Author": "DAP05", "ReviewID": "UR119709310", "Content": "I recently stayed here for one week. The hotel Is clean, the breakfast was plentiful, and staff provided top quality customer service. The location was good as well. Easy walking distance to tourist sites and public transportation. Davina was especially helpful and very nice.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Great location, good hotel”", "Author": "k_i_o_10", "ReviewID": "UR118854904", "Content": "This hotel is located very conveniently to sights, restaurants and communication. The rooms are small, but modern and clean. Very good bed. The bathroom \"configuration\" does not give much privacy, so best to share a double room with someone you know well. Very good breakfast with many choices. Nice fruit basket in room. No minibar. Safe in closet. Friendly and helpful staff.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Great location”", "Author": "Frozen_FairyTales", "ReviewID": "UR118838068", "Content": "We used this as our base for the Berlin Marathon and it was ideally situated. The rooms were quite small but they were comfortable, clean and well equipped. Service was indifferent although a couple of the staff did smile, which made all the difference! Having said that for the price we paid it was only average in terms of quality overall but then we possibly were charged more for staying over the marathon weekend!!", "Date": "October 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great Location”", "Author": "Tika983", "ReviewID": "UR118418303", "Content": "Stayed for 4 nights, great central location, rooms are small but comfortable and clean. Breakfast good, staff friendly, would stay again if visiting Berlin.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Berkshire", "Title": "“Good Location”", "Author": "Mjmcj", "ReviewID": "UR118049534", "Content": "I have to agree with other reviewers that the rooms are small, but are well equipped and very clean, clean towels daily.The beds are very comfortable and there was no traffic noise. Tea and coffee trays available free on request, also free internet. The staff are very helpful and the breakfast selection was very good. The location is one of the great benefits as it is easy walking to many of the city sights.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value for money”", "Author": "jvto", "ReviewID": "UR117316219", "Content": "This hotel was clean and had nearly all we needed. Good air con, nice powerful shower. Room was pretty small but it wasn't a problem for us. No kettle in the room which would have been nice. Staff were generally friendly and helpful. Provided umbrellas free of charge when it rained. Didn't try the breakfast as it wasn't provided as part of the cost. Hotel is perfect for the sights of Berlin, it was easy to get to anywhere we needed to go. I would recommend it as a good value for money hotel in Central Berlin.", "Date": "August 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel for the price”", "Author": "Agasuesse Posted by an OctopusTravel traveler", "ReviewID": "UR116343865", "Content": "Excellent hotel, very efficient and helpful staff, good breakfast, comfy rooms, fast free intetnet, great location. I can't find any fault!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Bristol", "Title": "“Basic, but good for the price and a great location near to all major attractions”", "Author": "tigger-tail-bounce Posted by an OctopusTravel traveler", "ReviewID": "UR116068753", "Content": "Small room so wouldn't wanna spend much time in there, but on the other hand lots of the major sights were within walking distance and there was easy access to public transport. Good for exploring outside, less so for chilling inside.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "sheffield", "Title": "“Very good”", "Author": "kitsbits Posted by an OctopusTravel traveler", "ReviewID": "UR115350581", "Content": "Really good for the price. Great room, really powerful shower, good breakfast buffet, free wifi, well placed for touristy things (reichstag, brandenburg gate, holocaust memorial all within walking distance). Very welcoming to us as a gay couple. Couldn't fault it.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Yorkshire", "Title": "“Modern quality hotel, friendly staff and central for Berlin sights.”", "Author": "SP36 Posted by an OctopusTravel traveler", "ReviewID": "UR105231478", "Content": "Clean modern hotel, friendly, helpful staff and within walking distance of all the main transport systems and many of the main attractions. Situated on a quiet road, you are guaranteed a good nights sleep in the comfortable beds and air conditioned rooms. The rooms had everything your require for a comfortable stay and the breakfast selection was excellent. We also enjoyed some nice eating places and bars just down the road, near the river.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Very good value hotel”", "Author": "MILLERM4", "ReviewID": "UR103673766", "Content": "Very close to the centre, railway station and some very nice restaurants, best one was the Argentian Steak house. Rooms very small but quite clean (carpet not so good), no major noise issue, very interesting building next door. Breakfast was a comprehensive buffet, continential style and very tasty.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“excellent hptel”", "Author": "mrjmcclure Posted by an OctopusTravel traveler", "ReviewID": "UR103011130", "Content": "lovely hotel excellent breakfast fab location bit noisy nearby building show in room and it floods the only fault", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "belfast", "Title": "“city break”", "Author": "dmdmdm7 Posted by an OctopusTravel traveler", "ReviewID": "UR99414164", "Content": "hotel very central. very good breakfast.staff very friendly.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bedfordshire", "Title": "“Great Hotel”", "Author": "BedfordshireMx5 Posted by an OctopusTravel traveler", "ReviewID": "UR96177700", "Content": "Good clean Hotel, Good location, Good breakfast, good price and the only downside is the small size of room, staff at hotel very helpful. The hotel as free superfast WiFi which I reeceived in my room with no problems. We got the airport express train from the airport train station (10 mins walk from airport) to friedrichtr station (30 mins, 3 euros ABC ticket) if you leave station using Albrechtstr exit you will come out at the start of Albrechtsr, the hotel is at the end of the street (10 mins walk). This hotel is in a great location and all the sights are within easy walking distant from the hotel.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Unbeatable hotel for the price”", "Author": "hannasdeli", "ReviewID": "UR95277883", "Content": "I was a few months ago to Berlin and found a very nice offer for Best Western Mitte. The hotel is located by Friedrichstrasse and not too far away from Prenzlauer Berg. Well, you have to walk for a while, but it is feasible without much problem. The room we stayed was quite tiny, but fully equiped, modern and very comfortable. We had a generous bed, small flat TV and a tiny bathroom with a toilet divided by a translucent glass. Not much more, really, but everything was well maintained and perfect for what we were looking for. A place to crush after long days and nights enjoying Berlin. The hotel has a glass surface, so most of the room is a large window. The problem is that just beside it there is a huge WWII bunker, now owned by a media tycoon. And the huge concrete walls take a lot of light from some of the rooms. Still, with so much window surface, it never felt dark or depressive. It just felt weird. We never had breakfast at the place, mainly because a couple hundred meters down the street there was a bohemian café serving a simple but great breakfast bufé for 3€. That is a bargain, and the place was all decadent and trendy at the same time. On a funny note, we had a fire alarm one of the mornings we were there. At first we didn't understand, because the alarm consisted on a strange long german pre recorded message... but then we run down the stairs until the firemen checked it was only a false alarm in the kitchen. Personal was dry but correct and provided us with free wifi on request. The reception, by the way, looks much poorer than the rooms are. All in all Best Western Hotel Mitte was a great choice for its location, quality and price. The rooms are small, but that wasn't much of a problem. We could rest perfectly and enjoy Berlin to the max. A great place!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“central Berlin for 70 USD”", "Author": "Matt_Dina", "ReviewID": "UR94572188", "Content": "the prices for the Best Western Berlin-Mitte vary considerably and I suggest you look for another hotel, if prices reach 110 USD, but for less than that the hotel is great. It is 5 Minutes away from the Bundestag and Bahnhof Friedrichstrasse. Unter den Linden isn't more than 10 minutes away and the Museumsinsel you reach within 5 minutes. I personally come to Berlin regularly for business and stay one to two nights. I don't need more than a good bed to crash on and wireless to contact home. The beds are good, the wireless fast and free and the best things is that you can sleep with an open window because it is dead quiet! The bunker next to the hotel blocks the little noise that you could hear. Staff are friendly, the rooms are tiny, but the shower is top notch.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location, spanking clean, great value and fantastic breakfast.”", "Author": "gilliemartin1 Posted by an OctopusTravel traveler", "ReviewID": "UR93705270", "Content": "This hotel ticks all the boxes for us. It is situated on a quiet corner yet close to transport and great bars and restaurants. No frills (but who wants to spend their precious time in the hotel when there are all those sights to visit?!) Extremely well run, comfortable rooms, great showers and helpful staff . The breakfast buffet offered an amazing choice. Tremendous value. Would definitely stay there if we visit Berlin again.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Excellent value for money”", "Author": "Bela1978", "ReviewID": "UR92715269", "Content": "I do recommend staying at the Best Western Hotel Berlin Mitte. Excellent value for money, the hotel is located just off Friederichstrasse, not even a 10-minute walk from Unter dem Linden. There's an excellent breakfast buffet for 6 euros. The shower in my room great. Wifi was available free of charge in my room and the connection was excellent. I opted for a single bedroom and stayed in a bedroom with a queen size bed, perfect for one person. Hotel staff, especially the guy at the breakfast buffet, was very friendly.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Spalding, Lincs", "Title": "“Great value hotel with an excellent breakfast”", "Author": "Jaspat Posted by an OctopusTravel traveler", "ReviewID": "UR92152806", "Content": "Centrally located hotel close to Freidrichstrasse train/tube station. Rooms are small, and en suite facilities are pretty basic, but overall we found the room (And the rest of the hotel) clean and the bed reasonably comfortable. Breakfast was excellent with a large range on offer of both hot and cold food - Ok so you couldn't get a full english breakfast but you shouldn't expect one either Reception was very helpful, and they have a luggage room so you can leave your luggage there until you actually want to leave Berlin", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Finland", "Title": "“The best hotel in Berlin”", "Author": "Memmu80 Posted by an OctopusTravel traveler", "ReviewID": "UR91928351", "Content": "Room was small, but still perfect. Only 500 meters from nearest rail station, so public transport was easy to use. Staff is really helpfull and the breakfast was the best that I have ever eat.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sussex", "Title": "“Great Value, Great Location”", "Author": "SussexOldies", "ReviewID": "UR89628961", "Content": "Stayed here from 6th to 12th December. Very good hotel, clean but small room, excdellent breakfast choice and friendly staff. Well placed for most attractions. Used the 5 day Berlin pass (about £30) which covers all the trains, buses, underground etc.. Hotel about 500 yards from Berlin Friedrichstrasse station with frequent trains to most parts of Berlin. We were there for the Christmas markets and unfortunately it was too Christmassy, with snow nearly all the time. However the Berliners got on with it and transport still ran with very little delays. The only thing that spoilt the holiday was that Berlin Schoenfeld airport ran out of de-icing fluid with many flights cancelled.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cork", "Title": "“most uncomfortable bed i have ever slept in”", "Author": "Buster048", "ReviewID": "UR88293008", "Content": "spent three nights in best western hotel berlin-mitte from the 23rd to 26th of november. went to berlin to see the christmas markets, when i was checking in i asked the lady behind the counter about the markets, she did not seem to know much about them and i was told that the were not on until the day that i was departing. i decided to have a look for myself and found out that the were all opened. apart from the lack of information from the check in staff at the hotel it was in a good location near the main train station and local restraunts. the rooms are very small but clean. the bed was the most uncomfortable one i have ever slept in. i left with a sore back and very little sleep. the should change the beds in my opinion.", "Date": "November 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "liverpool", "Title": "“\"Great Location and Value\"”", "Author": "meddy65", "ReviewID": "UR87280580", "Content": "Stayed in this hotel for 2 night in November 2010 and what can I say \"It's Excellent\". The location is very central to all the main sights eg Brandenburg Gates 10 mins walk , main station with links to the underground 5 mins. The Hotel is very clean, the rooms are small but well arranged and have everything you need, bed very comfortable and very quite, shower is powerful, television only has BBC News in English but you never watch it there is to much to see in Berlin! Free Wifi, Its a very moden hotel built next to a WW2 bunker which is now a Art Gallary. The breakfast I could'nt fault! Hot or cold, cheeses, fruit, tea coffee, ....ect.The service is outstanding, I never had to ask for anything it was already there. I would go back to this hotel again, and strongly recommend it. I have put some photos on so have a look if you like (Meddy65)", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“A SUPERB PLACE TO STAY”", "Author": "AJH1981", "ReviewID": "UR87118639", "Content": "We stayed at this hotel for 3 nights in November 2010, having booked two twin rooms for sole occupancy via Octopus Travel, all I can say about this place is BRILLIANT and exceptional value for money. The TOTAL cost for our stay here was under £290. The hotel is in a quiet street but it is a very quick and easy walk to transport links to take you all across Berlin.The hotel is in a very safe area and very centrally located, easy to walk to the main sights. All the staff we met were very helpful and friendly and spoke brilliant English. We arrived early and they allowed us to check in an hour before we were supposed to, one of the rooms was larger than the other but both were clean with modern decoration and nice comfortable beds. There is free wireless internet access throughout the hotel and also in the reception area two computers for free use and also a printer. No tea and coffee in the rooms, but if you request from reception a box with kettle and tea/coffee will quickly be provided. The breakfast is plentiful and there is a huge amount of choice on offer. I really can't recommend this place highly enough and would encourage anyone needing a clean, safe, comfortable hotel with friendly staff to stay here.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent value for money”", "Author": "Carmen_gest", "ReviewID": "UR74283367", "Content": "This hotel is really a deal . The room was very clean, nice, well furnished and had all the (modern) facilities needed. Internet connection (with cable) worked perfectly from the start (this is often not the case in more expensive hotels with wireless connections...). The location is very central, 10-15 min from the main Museum Island and the Under den Linden avenue. It is true that the hotel is located in a smaller street, however it is 2 min from the underground station. I could not have hoped a better stay. I truely recommend it.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Very clean and convenient hotel”", "Author": "Starshaped", "ReviewID": "UR66003732", "Content": "The hotel was well located - you could walk to the gate, the wall, the cathedral etc. There are a number of great restaurants and bars within 10 minutes walk also. The room was very modern and well laid out considering not much space was available. The shower was amazing - hot and powerful. There was a flat screen tv and separate wc. A mini bar and more storage would have been nice, but this was not a problem. The only negative really was the reception - the lady was very rude and abrupt when we asked a query and seemed like it was a huge hassle for her to help us. This really puts me off a place - I have worked as a waitress before and now as a lawyer - both in the service industry - and I would never treat my clients like that. Someone needs to have an attitude re-think.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“a good choice”", "Author": "Maya_pr", "ReviewID": "UR65134166", "Content": "Great location, nice rooms, good value for money...", "Date": "May 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worsley, United Kingdom", "Title": "“Great location”", "Author": "SHW05", "ReviewID": "UR60442781", "Content": "This hotel was perfect for my trip, primarily due to its location. 5 minutes walk from the station, and ideally located to see all the main sights. Room was quite small but as as I was travelling alone, it was perfect. Clean, modern, did exactly what I wanted/needed it to. Definitely recommend if travelling to Berlin", "Date": "April 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“Great location, small rooms & not so clean”", "Author": "PieterNetherlands", "ReviewID": "UR56606031", "Content": "We spent a few days in this hotel and it must be said that the location is great. It's quite basic and the rooms are not too big, but what really annoyed me is that the rooms don't get cleaned properly. The toilet wasn't clean and there was a really disgusting stain on the white leather chair that was in the room. We mentioned it to the staff (who are very friendly and helpful) and they said they'd ask the chambermaids to do something about it. Unfortunately, they didn't. I remember returning to the hotel at the end of the day and see the shower with still hairs with it on the floor. Since I find a a good hygiene the most important thing in a hotel, I would definetly never go back to this hotel again.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Excellent All Round”", "Author": "avd1 Posted by an OctopusTravel traveler", "ReviewID": "UR55301874", "Content": "This hotel was centrally located, the room was very clean and modern, with all the facilities. The breakfast was varied with a big selection to choose from. All round excellent hotel with good value.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Wirral", "Title": "“Well situated hotel”", "Author": "cerkie Posted by an OctopusTravel traveler", "ReviewID": "UR51072174", "Content": "We stayed here for 3 nights, we found the hotel to be perfectly adequate for exploring Berlin.", "Date": "December 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Leeds", "Title": "“Centrally located, excellent hotel”", "Author": "Tommy96 Posted by an OctopusTravel traveler", "ReviewID": "UR50507861", "Content": "Lovely hotel close to Friedrichstrasse.Reception staff great, breakfast very good, rooms although small were lovely for a couple of nights stay", "Date": "December 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Ireland", "Title": "“Best Western Mitte is just 'spot on' for Berlin break - perfect location”", "Author": "Tomdoodle", "ReviewID": "UR48196007", "Content": "Best Western Mitte has such a lot to offer. Perfect location, excellent value, wonderful staff, brilliant breakfast, sportessly clean - what more could you want ! Location: Airport Express for €2.60 from Shonenfeld Airport to Friedrichstrasse Station leaves you about 100 metres from hotel. Footbridge over river from 1st floor platform in station takes you directly onto Albrechtstrasse - straight road to hotel from there ! All U Bahn and S Bahn trains pass through Fiedrichestrasse Station. Also perfect location for shopping and following tourist trail by foot - Friedrichtestrasse is a central street, lovely walk to Brandenburg Gate, Riechstag, Unter Den Linden, Dome, University etc. Great restaurants and bars right beside hotel and you're also beside the river for boat trip. Hotel: Excellent value for 3 star - most helpful courteous staff, nothing a problem. Guy on desk duty personally took us to restaurant 10 mins. before official opening time (and offered us an English newspaper) to facilitate our early departure time. Super breakfast to set you up for the day - hot food, cereals, cold meats and fish, variety of breads, juices, fresh fruit, yoghurts, pastries, cheeses etc. etc. Place is spotlessly clean, free internet access in lobby and is excellent value . OK rooms are small - but, lets face it, how much of the room do you see when you're in a city on a 3-day break !! Yes, shower is differently positioned but we must still have a lot of very modest people about if this is an issue ! Highly recommendable!", "Date": "October 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cardiff", "Title": "“Modern rooms, great location.”", "Author": "Treherbert", "ReviewID": "UR29954794", "Content": "This hotel had very modern but small rooms with plasma tv. Very clean. Breakfast is a help yourself buffet with poached eggs, hams, sausage, bread and toast with pate or jams, cheese, cereal etc. The breakfast room was busy , so i opted not to have it on the second day as there are cafe nearby which are cheaper. The hotel is five minutes’ walk away from the local train/metro station, and a five euro taxi ride to the main train station Its a great base for exporing Berlin I would personally recommend this hotel to friends and family", "Date": "May 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent value and quality in good location”", "Author": "rockstar3434", "ReviewID": "UR26640061", "Content": "I stayed at this hotel twice (April and August 2008). The rooms are very modern, spacious, clean, and comfortable. Each time I stayed in a single room that contained a double bed, desk, flat screen TV (with channels in multiple languages), and bathroom. The rooms have massive windows allowing in natural light, but once I had a 1st floor room, so I opted not to keep the curtains open as other rooms could see in. My only wish was that the rooms had a small fridge. The hotel is on a quiet street about 5 min. walk to Friedrichstrasse Station with excellent transportation links throughout Berlin by Ubahn and Sbahn. There are a number of restaurants near the hotel and a Subway. The hotel is also within walking distance to the Pergamon Museum and other adjacent museums.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "greece", "Title": "“good value for money, excellent location”", "Author": "BBGreece", "ReviewID": "UR25560144", "Content": "the rooms are not very spacious, otherwise I'd say we were totally satisfied with our choice. The hotel is either new or has been recently renovated, so the rooms are clean and modern, the breakfast buffet good.You can find numerous restaurants and bars nearby, although the area is quiet. The closest metro station is in 3 minutes walk.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brighton, England", "Title": "“Excellent, very good value hotel”", "Author": "AAM189", "ReviewID": "UR25021562", "Content": "Staff on front desk were efficient and check in went smoothly. I asked for tea making facilities and a box containing kettle, tea, coffee, mugs etc was send up to my room very promptly. Room was small but ideal for one person, probably a bit cramped for two though. Bathroom was small but shower didn't flood the room. Very quiet room even though opposite the lift. Beds were very comfortable. I do think it is probably a better hotel for winter (snowed all the time I was in Berlin) rather than the summer when air conditioning would be needed. Internet in the lobby is free of charge but is so, so slow!", "Date": "February 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“Good Value in a Great Location”", "Author": "Scotjonnie", "ReviewID": "UR20540345", "Content": "A good price and great location; a five minute walk from Fredrichstrasse Railway Station and just a tad more to the Reichstag and Brandenberg Gate. Ok small rooms, but fine for a few nights stopover, comfy beds with fluffy duvets and pillows, and yes the shower floods the room - just dont use it on full power! The breakfast buffet was more than adequate and provided a very acceptable start to the day - and a big coffee pot cheerful served by the young, enthusiastic staff! Don't go expecting too much and you will be satisfied with a quite acceptable standard for bed & breakfast in a great location at an affordable price!", "Date": "October 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "perth", "Title": "“okay for the price”", "Author": "kira_L", "ReviewID": "UR20354800", "Content": "its a fairly inexpensive hotel and it is in a good location, but the staff are not overly friendly at the front desk and the breakfast is average as are the rooms. its more like a good motel. The set up of the rooms is not great. i was sharing with a friend and each time one of us had to change or shower we had to leave the room because there is no door on the bathroom, and the way it is set up makes it difficult to have any privacy. the shower is facing the window on the street and the curtains dont give you much privacy either. the windows are huge and when we opened one in our room (because of lack of a/c) it stuck out so we had to go around it to get to the bathroom. its okay if your not spending too much time in the hotel. the freidrichstrasse train station is down the road and the reichstag is about a 10-15 minute walk.. dont expect much from this place and you wont be disappointed", "Date": "September 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“A central Berlin Hotel”", "Author": "Ellerslieboy", "ReviewID": "UR19816203", "Content": "A nice tidy hotel in a great location. In hot months the lack of air conditioning is a pain. Breakfast was well presented and internet wifi was easily accessed. If you want to get around Berlin, learn how to use the S Bahn and you can be most places very easily from the near by station. Walking distance to the German Parliament buildings and some lovely cafes and restaurants.", "Date": "September 6, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Turin, Italy", "Title": "“Fantastic hotel in a great area of Berlin!”", "Author": "Navigator78", "ReviewID": "UR19613744", "Content": "I was in this hotel this winter (at the beginning of January) with my girlfriend ant it was a great experience. The hotel is very near to some of the most popular places of Berlin and with bus (the bus stop is more or less 50 mt far from the hotel) we were able to reach easily Brandenburg Tor and Reichstag. The hotel was very confortable even if the rooms were very small. However we found everything we needed to spend few nights in Berlin. Moreover rooms were very clean and the towels were changed everyday. People at the reception were very kind and they could easily help us. We found an interesting special offer on the hotel website and if so the hotel can be quite cheap. Because of rooms dimensions maybe this is not the right hotel to stay in Berlin for one month but for a week it's great. It is a good starting point to visit Berlin.", "Date": "September 1, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Great experience”", "Author": "SeetheworldSeattle", "ReviewID": "UR17037834", "Content": "Stayed at the Best Western Berlin Mitte for 2 days in April. Had a great stay. Within walking distance of the train station and Brandenburg Gate. Clean modern room and the staff was very friendly and helpful. The hotel is located in a great neighborhood, lots of places to eat and drink. No complaints.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Small, but efficient”", "Author": "winwiz88", "ReviewID": "UR16572087", "Content": "I stayed here while in Berlin for two days in March of 2008. I booked directly through Best Western, and got a decent rate, which I was surprised to find, considering the rates of most hotels in the center of Berlin. This hotel is located just down the street from Freidrichstraße Station and across the Spree. The building is very modern, and I think the hotel is only around a year old (in satellite photos it does not even exist!). They do offer early check-in, but when i arrived my room was not ready. They do allow you to store your luggage however in a locked luggage room so that you can go and explore a bit while your room is readied. I was placed on the top floor, and unfortunately my room was where the letter H was placed (you can see in the photos). While you can still see outside, its essentially like there are permanent blinds. Speaking of the windows, the entire wall was a window which was nice to wake up to in the morning. The room itself was on the small size, but that should be expected. The bed itself was comfortable and large, the TV was a nice flatscreen tv mounted on the wall at the end of the bed, and the bathroom had a shower that got hot quickly and stayed hot. As for wake up calls, I did order one, but they were 45 minutes late. Not that bad, but did throw me off a bit initially. There is also free wifi, but one must ask for a code and sign for it at the front desk. If I were to return to Berlin, I would consider staying here, especially if the price was as good as it was for my stay in March, considering how expensive hotels are in Berlin.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Unsatisfied travellers”", "Author": "58travellers", "ReviewID": "UR16483827", "Content": "Apart from the breakfast which you couldn't fault, the staff in the breakfast room were very friendly and the location of the hotel, in a good position, I couldn't really give a positive review. There was no airconditioning so had to have window open which made it noisy during the night. The staff at front desk were not very helpful and made you feel as if it was an effort to help, room was very small but clean. They advertise internet but this is only if you have your lap top, and as we were on holidays this was the last thing we were taking with us.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Zwijndrecht, The Netherlands", "Title": "“okay if you stay in a good room”", "Author": "Donkie", "ReviewID": "UR16416085", "Content": "Mixed feelings about this hotel. We stayed for four nights and the first night we had a room which was very hot (on the sun side and no airco), very noisy (next to a construction site where worked went on for 24hours a day) and a unpleasant smell of the diesel cars used by the workers. All this together resulted in a very short night. The next day we asked for another room at the other side of the hotel which we got without any problems. This room was much better. It was cool (on the shadow side of the hotel), much less noise from the construction site and no nasty smells. The room was still very small but it was clean, the bed was very good and it had a separate shower and toilet. Location of the hotel is great, right in the centre of Berlin, with many restaurants and bars nearby as well as train/s-bahn etc. Breakfast was also okay and the staff was friendly in general with a few exceptions however.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warwick, United Kingdom", "Title": "“An Excellent Hotel”", "Author": "seanpmcdonald", "ReviewID": "UR16167524", "Content": "I do get an additional discount as a Best Western Gold Card member, even so Location is perfect 2 mins from the friedrickstrasse S Bahn and all the main attractions are walkable Rooms are small but new and clean Breakfast a full range of good food Staff very courtious and helpful", "Date": "May 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“good location,noisy, no AC, kinda dirty”", "Author": "Babakk", "ReviewID": "UR15915567", "Content": "the location was amazing so was the front dest service, great English skills. however the room was not too clean, the cleaner not once did a good job of cleaning for the 4 days we were there, and worst of all the shower was see through. even poeple on the street could see the shower so did everyone else in the room. there was also superloud construction noise across the alley and NO airconditioning", "Date": "May 11, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "paris", "Title": "“could do better”", "Author": "fogee", "ReviewID": "UR15897527", "Content": "Good location for historical Berlin. Room was bright and clean but small. Curtains too short to cover all windows : broad daylight by 5am... Staff unhelpful. Breakfast cheap but mediocre", "Date": "May 10, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great location, reasonable hotel.”", "Author": "mandyc", "ReviewID": "UR15497076", "Content": "I stayed at this hotel for 2 nights on a business trip. Overall, I found this a perfectly reasonable hotel. My room was fine, with comfy twin beds and clean, fresh bedding. A small wardrobe came stocked with lots of coat-hangers, which makes a refreshing change to other places I have stayed! The room was perfectly big enough for a short trip, although I think it would feel a little small for a couple staying for more than a few nights. The bathroom was open onto the room (toilet did have a door though), which was fine for me as I was travelling on my own. But given that this was a twin room, I thought the hotel should give some warning about this as not everyone travelling and booking a twin room will want to shower in front of their travelling companion! However, the shower was large and clean, with great water pressure. For me, the best thing about this hotel was its location. Just a couple of minutes walk from Freidrichstrasse station for easy access to anywhere in Berlin, and within 20 minutes walk of the Reichstag and Brandenburg Gate. In the evenings, Mitte is a great district to be in with loads of restaurants and bars. This hotel is just two blocks behind the river, with some lovely bars and restaurants with tables and chairs overlooking the river. I don't have any real complaints about this hotel. The only slightly disappointing things were that there was no kettle in the room for making tea and coffee, although there were facilities for doing this in the lobby. Also, while the hotel offers free wifi access, you need to take your own laptop with you. The hotel has no computers available for business guests to check email, so I had to go to the internet cafe at Friedrichstrasse station. Next time, I would take my laptop with me and take advantage of the free wifi! I didn't try the hotel breakfast as it wasn't included in my room rate and cost 8 EURO! Go round the corner the the Espresso Cafe and have a fantastic coffee and either a pastry or sandwich for around 4 EURO instead. This place does what it says on the tin. I would certainly stay here again, for business or for pleasure, because the location is fantastic. If you aren't expecting 5 star luxury or high romance then I don't think you will be disappointed.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Noosa, Australia", "Title": "“Value for money”", "Author": "love2travel019", "ReviewID": "UR13779255", "Content": "My husband and I have just returned from 4 nights at this hotel. We found it to be clean,the staff friendly and breakfast good. If you are looking for accomodation that is close to all the sights of Berlin then I would recommend this area. There are also lots of great restaurants within walking distance. The train station is 200 metres away. Yes the rooms are small,but they are well designed and compact,so it didn't bother us at all.", "Date": "February 23, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Auckland-NZ", "Title": "“Good All Rounder”", "Author": "Franklinross", "ReviewID": "UR13733061", "Content": "Predominately a business Hotel, but absolutely perfect for individual travellers. Hotel is new, rooms are modern, light, small, clean and very quiet (quite neighbourhood). The Breakfast is substantial with cold and hot offerings. There is a great Thai Restaurant across the road and a really nice man who runs a Dairy around the cnr for all your basic extras! A couple of small quirks but don’t let this put you off A) Make sure your room door is shut as they need a little extra pull when closing behind you (we had friends in the next room and was the same) B) If you are sharing a room with another person make sure you know them well as the Bathrooms are ‘Designer’ and when you step out of the shower its not a private as you may like it to be. Reception staff mostly helpful but if things are too hard or they don’t quite understand you, you get a straight ‘No’. Located in the ‘East’ side of Berlin this is a true find. Perfect location for sightseeing, just 5mins walk to the nearest Train station ‘Friedrichstrasse’ and Airport bus is also 5mins walk away.If you want to zip around Berlin at least grab an all day train & bus pass (yes you can even use it for the Airport)", "Date": "February 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Petit Roche, AR", "Title": "“Great refueling ststaion”", "Author": "DrRingDing", "ReviewID": "UR12482532", "Content": "I stayed at this hotel during the first week of January, and my experience mirrors the previous recent reviews. This is a nice quiet hotel with cordial staff in an excellent location. My room was also small, but this was not important because I spent little time in the room other than to sleep. In addition to bars and restaurants, a Lidl grocery store is also nearby for inexpensive food and beverages.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“very cute”", "Author": "Sur_la_route", "ReviewID": "UR11672456", "Content": "This is a very cute, clean, pretty well located hotel. The only thing people should know is that the rooms are New York Style Tiny... really small. If you're sharing, you better like the person you are sharing with...", "Date": "December 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Birmingham", "Title": "“Fashionable but small”", "Author": "thomasd70", "ReviewID": "UR10746656", "Content": "This is a very trendy designer-style hotel (beige-brown modernist furniture, walk-in shower and all that) on a budget (paid just under EUR 75). It's ideally located near Bahnhof Friedrichstrasse, from where there are connections all across the city (if you come from Tegel, take the Underground exit Oranienburger Strasse - it's closer). The Deutsche Theater is just around the corner. At the moment, there is still a construction site opposite, and the rooms are not 100% soundproof, although as the previous reviewer said, there are noisier places. One of the drawbacks is that the rooms are very small and that the toilets, while separate in contrast to the shower, are very basic. This whole bath area may have fashionable aspirations, bur is a bit reminiscent of en-suite student accommodation; perhaps an area they should have invested a bit more in.", "Date": "November 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Prety good”", "Author": "jmahon", "ReviewID": "UR10070029", "Content": "Good location , near Freidrichstrasse station. Rooms a bit small, and when we were there there was no door between the bedroom and the wash-hand basion and shower. Which seeemed very odd. There was of course a shower door. Staff friendly and helpful. Along the river about a 2 minute walk away there are somne nice bars. There is an Irish bar \"Oscar Wilde\" about 7-10 minutes walk away, handy if you want to watch english/irish sport. I was there during rugby world cup so managed to see a game i wanted to. Hotel withiun walking distance of brandenberg gate, checkpoint charlie (30 mins).", "Date": "October 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ENFIELD", "Title": "“A new well located city hotel”", "Author": "KMCA456", "ReviewID": "UR8450598", "Content": "Excellent location close to Freidrichstrasse rail station (best to cross the river by the footbridge under the railway). New hotel but lacks a/c so ask for a fan if needed. Rooms are not large but very adequate, and at current prices is excellent vfm. Good breakfast but there are a lot of coffee shops around if you don't want to pig out on the buffet.", "Date": "August 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Good Value, Good Location, Good Staff”", "Author": "BinDereDoneDat", "ReviewID": "UR8428262", "Content": "I stayed from Fri 10th to Wednesday 15th Aug 2007. The location of this hotle is perfect - it's about 200m from Fredrichdatrasse Station which is one of the major S Bahn and UBahn stations in Berlin. This measn that when you come from Schoenfeld Airport, the train stops about 200m before your hotel. Also if you want to get around Berlin it's very handy. One of the best places to eat in Berlin is Orangierstrasse which is about 10 min walk from the hotel. The pice of teh hotel was €47 per night plus breakfast at €8euros. The room, was new, clean and the bathroom facilities very good. There is a new building being erected acrsoos the road from the hotel, but this is not a big deal. There is also a 150 room 2nd Wold War bunker beside the ghotel which is a protected structure, and someone has built a very nice penthouse on top of it. The staff in the hotel are all yound and very helpful - I wanted to know where to go one night and asked the reception guy - I said I had a map - he said, and I quote, 'But I have a better map AND I have a marker' and proceeded to mark the route on a map he gave me. Some of these very German trains of thought ar e very amusing! I found the walking tours well worth while to do - brochures at hotel - don't forget that your watch needs to be an hour ahead or you miss it! Breaksfast was fine but a little basic. Somethimes they had one fruit e.g. mandarins, sometimes two (peaches and pineapple), they also have sliced ham, but this seems to be eaten first in teh morning. So if I were going back to BErlin I would stay at this hotel again. PS: Very good Indian Restaurant at top of Orangierstrasse - large but very fast service and high quality.", "Date": "August 15, 2007"}], "HotelInfo": {"Name": "BEST WESTERN Hotel Berlin-Mitte", "HotelURL": "/ShowUserReviews-g187323-d651595-Reviews-BEST_WESTERN_Hotel_Berlin_Mitte-Berlin.html", "Price": "$98 - $196*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Albrechtstrasse 25/Ecke Reinhardtstrasse</span>, <span class=\"locality\"><span property=\"v:postal-code\">10117</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "651595", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/21/fe/21fe230421c80974bee23ccb331d77886large.jpg"}}