{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Erfurt, Alemania", "Title": "“Poor place in the perfect location”", "Author": "Joakkin", "ReviewID": "UR123464599", "Content": "Lausanne is a hostel within an unbeatable location in Barcelona. Just 1´ from Plaza Catalunya, 2´ from La Rambla and you have all the shops you need just across the street, Zara, Esprit, El Corte Inglés, H&M, Desigual, Hard Rock Cafe, etc. The only places you´ll need to reach the metro are Camp Nou and Parque Güell, since you can do all the main sites just by walking. The bad things: it really needs an improvement, the bedrooms are really small, the beds are just terrible, the walls, furnitures and the whole building is really old, some things are broken, some unclean, actually the whole stuff is bad, except for the baths: they are excelent and modern. I recommend this place if you´re outside during the whole day and return just to sleep and get up early the next morning; that and because its location is the best. Reception guys were nice, and you have free wi-fi in the rooms. Write the adress and number well, since it´s surrounded by shops all across the street, it´s easy to miss.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Belgrade,Serbia", "Title": "“Great location, but crying for renovation”", "Author": "JU050", "ReviewID": "UR122987104", "Content": "I stayed here twice, both in June 2011 and 2010, first time for 2 nights, second time just for one. I have purely chosen it because of the location, it is right in the middle of everything, so close to Placa Catalunya, 5 minute walk to La Rambla, and Aerobus to the airport, El Corte Ingles department store is nearby, short stroll to Barceloneta and Mare Magnum. Location, location... Staff is friendly, especially the old men during the night tho he hardly speaks any English. There is a small balcony at the back, where you can have a smoke/drink. I noticed that one shared bathroom was renovated since my previous visit in 2010, but overall the rooms are so tiny, in desperate need for painting, with nothing except beds and a wardrobe. But location at that price can hardly be beaten, so I would recommend it for 2-3 nights, if you just need a place to sleep and stay right in the center of Barcelona.", "Date": "January 12, 2012"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Great location, but really needs an update.”", "Author": "kimidelaroppa", "ReviewID": "UR114160711", "Content": "Hostel is located near la Rambla, Barri Gotic and the metro wich was perfect, but the hostel really needs an update. Furniture was broken, the towels had stains in them, broken beds on the balkony. The staff did not speak english and there were only 2 friendly staff members the others were uninterested and moody. If you only want a bed to sleep in for the night and you want to be near to some great sites this is the hostel for you, if you expect more you really shouldn't go here. Only positive thing in the hotel itself were the bathrooms, they were updated and had a good shower in them.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Davos, Switzerland", "Title": "“Perfect location, just in the middle of everywhere!”", "Author": "AFS82", "ReviewID": "UR89319037", "Content": "I spent 4 nights in Barcelona for sightseeing, the hostel was literally 1 minute walking distance fron Placa Catalunya. We didn't need to take the public metro except for 3 or 4 times to visit the Barca FC museum, Sagrada familia and parc Guell, we explored Barcelona walking. The hostel was less than averae regarding the style, furniture and comfort, but we didn't need any of that as we started the day at 9 am and return back to the hostel at 11 30 pm straight to bed. The street where the hostel lies is so lively and has many shopping centres; El Cort Inglès, Zara, Massimo Dutti, Mango, Esprit as well as many retaurants. Hostel staff were cheerful and helpful.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Bay Area", "Title": "“Clean hostal, great location”", "Author": "soyyo", "ReviewID": "UR32808307", "Content": "The Hostal Lausanne is a very basic but cool hostal located steps from Plaza España and the gothic quarter. It's on a street that is quite busy by day, but pretty quiet at night. The location could not be better. The hostal is very clean and consists of quite a few tiny, very basic rooms. Mine had just a double bed, an armoire (sp?), a table, a night table and a sink. The window looked into the bare walls of other buildings - not a good view BUT it also meant I could leave it open and nobody could look in. The bed was on the hard side, but I slept well. The two share bathrooms are also incredibly clean. Towels are provided, and there were bottles of shampoo in the bathtub. The hostal counts with one living room with chairs, a TV, a soda/water machine and 2 computers with free internet access. There is also wireless in the hotel, I think. I found the lounge pretty comfy. What I most appreciated about the hostal was the service. I showed up at about 7:30 AM after a long flight from California. Rooms don't open up until 3 PM, but they allowed me to leave my luggage there. I went to take a walk and drink some coffee - I didn't sleep more than a couple of hours in the plane - and realized that I just was not able to stay awake. I went back to the hostal and while they were full so they couldn't give me a room to sleep in, they allowed me to sleep on the sofa in the lounge (and it was quite comfy). In all, my stay was very nice and I was sad to leave it for the business hotel where I my conference was.", "Date": "June 21, 2009"}], "HotelInfo": {"Name": "Hostal Lausanne", "HotelURL": "/ShowUserReviews-g187497-d652577-Reviews-Hostal_Lausanne-Barcelona_Catalonia.html", "Price": "$46 - $91*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avda. Puerta del Angel, 24</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "652577", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d9/b9/2e/hostal-lausanne.jpg"}}