{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Manila, Philippines", "Title": "“5 Star Rooms For A 3 Star Budget With 2 Star Service”", "Author": "Pasyalero", "ReviewID": "UR139977484", "Content": "I stayed in this hotel as part of a tour package arranged by a travel agent. The hotel is very nice and with comparable room size and quality to 5 star hotels at a 3 star price. The bed and towels are very clean as well as the bathroom, which is adequately supplied with toiletries. They also provide complimentary bottled drinking water. They serve set meals for breakfast maybe because that’s the package our agent took for us but they also have a buffet. Food taste is average same as what you can expect from fast food restaurants but I do not know about the buffet since I never tried it. The pool is clean and with enough number of chairs and pool beds. It has a running water designed like a falls that flows to the pool. This is the place in the hotel that I really enjoyed and appreciated. They also have a gym with basic exercise equipment. The front desk needs a lot of improvement though. The staffs are not consistent. They could be warm for a while and very cold after sometime, actually cold most of the time. Checking in and out is slower than most of the hotels I stayed in. The hotel should provide more seats for waiting guests considering their slow process in checking in and out hotel guests. Another negative thing I can say about the hotel is the location which is in Tsuen Wan that is far from where the action is but it could turn out to be a positive thing to those who are looking for tranquility and peace. The hotel tries to remedy this condition by providing a round trip free shuttle ride to the Tsim Sha Tsui area where most of the shops and restaurants are. It leaves about every 30 minutes but it may leave late depending maybe on the number of passengers. However going back to the hotel could cost you a small fortune if you miss the last trip of the shuttle bus from Tsim Sha Tsui if you would take a taxi. So if you are planning to stay late outside don't count on the free shuttle bus to be there to bring you back to the hotel. You can try the MTR if you want to save some money and either walk from the station or take a short taxi ride to the hotel.", "Date": "September 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "hong kong", "Title": "“very helpful staff”", "Author": "biky w", "ReviewID": "UR138385506", "Content": "My family just came back from a stay at the hotel on 25 - 26 August. This is the first time we used this hotel. Whilst we were waiting for the room after check-in, my daughter was unfortunate and was bitten by a bee. The wound got swollen, it hurt so much she could not hold back her tears. The hotel staff immediately came to help and provided the necessary assistance and information. We eventually rushed our daughter to a nearby hospital. When we got back to the hotel, exhausted and a bit down, we were pleasantly surprised that our original booking of a deluxe room had been upgraded to a sea view 2-bedroom suite, the check-out time had been extended for hours from noon to up to 5:00 pm if we want, and we were also given 50% discount coupon for the buffet dinner at the hotel. All these added delight to our stay. Front desk manager Mr Ricky Lau had been of particular help throughout the two days. We would like to say our thanks here.", "Date": "August 26, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Utica, Illinois", "Title": "“terrible service”", "Author": "angiehendriet", "ReviewID": "UR137472104", "Content": "stayed here with my family for vacation. We enjoy every day we spend there in hongkong. Unfortunately this hotel have bad service crew specially in the front desk. the room to small but have a very nice view. location too far from the city, they have shuttle bus that delay most of the time so need some patient with that.. i planning to have my vacation again next year in hongkong with the family but I wiill NOT going to stay in this hotel again that for sure!!!!", "Date": "August 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chennai", "Title": "“Viewable View”", "Author": "sand1977", "ReviewID": "UR134811742", "Content": "I have stayed here before and I chose this hotel again for the view it gives in the evening. Though the hotel is far from the downtown but the hotel provide free shuttle bus. It has all the facilities for the guest to enjoy. The food is also good at the breakfast. lots of variety. I recommend this hotel for the honey moon travelers who need some peaceful time in the room o_~", "Date": "July 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Far from anywhere”", "Author": "agentenzo", "ReviewID": "UR132389375", "Content": "Stayed here on a business trip. Actually it's a good hotel, with quite big rooms and small kitchen area. Not much choices during breakfast, but that was pretty much ok. Unfortunately it's located far from anywhere. It's improperly far from main Tsuen Wan area and its MTR station. There's shuttle buses but quite limited schedule. Most of the time, to get there taxi was the only option. Well, everybody knows the notorious Hong Kong taxi.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Philippines", "Title": "“Very nice stay in the hotel”", "Author": "Rasanne", "ReviewID": "UR130762196", "Content": "We stayed in this hotel for 4 days and 3 nights. My parents ( who were already senior citizens) enjoyed the spacious, clean and big rooms in the 11th floor, non smoking area. We had very sound sleep in the evening. Although, the location is far from the mainland, it is advisable for all the visitors in HK who would like to stay in this hotel to avail for package tours so that you won't have problems in visiting other places with much expenses since you will have your free transfers already. But then if you cannot avail for package tours, the free coach / shuttle bus from the hotel can bring you to the nearest MTR station in Tsuen Wan. From there, you can easily move around the city of Hongkong riding the train. Overall, our stay in this hotel is very good except for one employee who's attitude is not appropriate as one of the front liners of the hotel. This man at around the age of late 40's or early 50's somehow disappoint me because he doesn't know how to handle good conversation to their clients. I hope the hotel managers will constantly remind their employees with the proper etiquette and good conduct among themselves since it entirely affects the company itself especially when evaluated.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“BAD SERVICE AND IN THE MIDDLE OF NOWHERE”", "Author": "Pantelis P", "ReviewID": "UR130451145", "Content": "We stayed at this hotel for 4 nights and we must have spend a total of 2000 HKD in taxis so we can get to civilization. The front desk were either not helpful or unable to understand what we said.Nowhere to sit and have a drink or coffee in the lobby as is reserved for \"Gold card members\"????Nowhere to have a drink with a guest (or even by yourself) after 11.00 at night . Absolutely nothing to do around the hotel apart of looking at the view.The beach nearby looked lovely but with HUGE tankers passing 1 mile away it did not seem inviting! I can find no earthly reason for anyone to want to stay there.99 % of the customers were large groups of Chinese tourist staying overnight on their way to somewhere else!", "Date": "May 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great rooms, but not perfect location”", "Author": "ilovehk9", "ReviewID": "UR130226703", "Content": "Stayed 4 nights at Royal View Hotel because the hotels with big rooms in Kowloon are full. Rooms are big and comfortable, facing the beach. But the hotel was so far out of town! Not even near the mtr station at all. Even the taxi driver had problems finding the place. There is a shuttle bus that goes to Mongkok everyday but the journey is about an hour -.- To get to the nearest Tsuen Wan neighbourhood, we still had to take the shuttle bus. There are no cafes or shops anywhere outside. It seems like the staff could not speak much english? The only plus point of this hotel is that it's near Disneyland and airport. But who would need to stay near these places when most of the life is in Kowloon. Would not recommend it unless u want to be away from town for relaxation. I stayed in a hotel at Kowloon before and there was so much life at Mongkok even past midnight. At this hotel, u can only watch tv or sleep.", "Date": "May 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Bad service & obscure location”", "Author": "PiyoRos", "ReviewID": "UR129215107", "Content": "My friend and I stayed here for 4 nights. (26-Apr-2012 to 30-Apr-2012) Bad Housekeeping Throughout our stay, the housekeeping did not fill the minibar. Everyday after cleaning the room, they forget to refill one thing or another. We had to constantly call the front desk to ask for things Bedsheets don't get tucked properly. There was an extra bed in the room which we requested housekeeping to remove. It was taking up space in the room. They refused to do so. We had to live with that in the already crammed room. The front desk is not always available. There were a few occasions where no one picked up. When we checked in at the lobby, the bellboy simply feigned ignorance and did not offer help till request was made. During checkout, the bellboy saw us with our luggage and looked away. We deposited our luggage at the lobby after checkout. During which we requested for one of the fragile items to be handled with care. The staff rejected our request claiming that such requests would complicate their operations. Location of the hotel is out of nowhere. Even though the hotel provides shuttle, frequency is only about 30 minutes. It took us about 1hr 30 minutes to civilisation each time. And we had to stress over shuttle schedules. Taxi fare from city centre, say causeway bay back is about 200HKD. Albeit seaview from the room, this is totally NOT recommended. I'd rather pay a bit more for a more centralised hotel with better service.", "Date": "May 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Anchorage, Ak", "Title": "“Not worth it, will not recommend”", "Author": "Katrina S", "ReviewID": "UR129022616", "Content": "Me and husband went to Hong Kong to celebrate our 6th year marriage. The front desk was not friendly not very helpful. There's was sometimes where I was sent back and forth because not given the right answer. We got there at 9 am unfortunately our room will not be ready until two. He told us to walk around, this hotel is located in the middle of nowhre. So we decided to hang around on the lounge area second floor. Husband decided to lay his head for just a bit, one of the staff of the Hotel (possibly the boss, lady walking around) came to us that my husband had to sit up. I did not appreciate it and at that very momenti wanted to get the f*** out of that hotel. We finally got our room called front desk to ask where I can get instant coffee, he told us to go down and there's some on the lobby. Husband goes down to lobby and a guy said to turn it off and we are not allowed on that side of the hotel because for black card member. Wifi is not free, you have to pay. The only time is free is when you go to Lido Cafe which the service is execellent I think THEY will do a better job in running that hotel. Would I recommend this hotel to a friend or would I ever stay on this Hotel? ABSOLUTELY NOT!!!!!!!!!!!", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dubai, Dubai, United Arab Emirates", "Title": "“Excellente!!!”", "Author": "Ryan B", "ReviewID": "UR128304067", "Content": "We stayed here for 4 nights with my family last year Dec 19-23. We're on 11th floor Deluxe Seaview Room..It was awesome! we can see the view of tingkau bridge and tsing ma bridge. There's no problem with the transport, there's a pick up shuttle bus every 10 minutes going to tsuen wan mtr station. The service is very awesome especially on the front desk, they're very friendly and cooperative. We missed to use the pool, because of the climate. uhuhuh. it was around 9 degrees celcius that time. Hope we can come back to this hotel with my family again!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "okinawa", "Title": "“Good hotel”", "Author": "erin929", "ReviewID": "UR128161531", "Content": "I stayed at this hotel only because there were no rooms available at a Disneyland Resort hotel. This hotel is about 20 minutes by taxi away from Disneyland, about 35 minutes from Hong Kong International airport by taxi. My 8yr old daughter and I stayed in a Superior room with two single beds. The first room (our original room) we were in was on a smoking floor and the carpet on the floor was softer than the beds. We both had a terrible night's sleep between the smoky smell and the hard beds. I asked hotel staff the next morning if we could move to a non-smoking floor and they happily obliged. Everyone at the front desk was very helpful and spoke fairly good English. The second room we were in was much better, beds were a little softer and it smelled 95% better than the original room. When you make a reservation, if you care, make sure you specify non-smoking. I was not impressed with the $40HKD/hr charge for Wi-fi either, but I guess that's what I get for not checking into it before I booked my room. That was a little difficult to deal with when trying to get in touch with my husband back home but oh well. The hotel is located right beside a bridge but there is so much construction going on around the bridge and hotel that it detracts from the view. Still, it's a cool view when you're so high up (we were on the top floor, 19th).", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Stunning hotel in Hong Kong”", "Author": "Manson_T", "ReviewID": "UR125728059", "Content": "Although the the location of the hotel is far away from the city centre, the free shuttle service between the hotel and Tsuen Wan is convenient to guests. The hotel upgraded my room to sea view superior, which has gorgeous view of Ting Kau Bridge and Tsing Ma Bridge. It is a good choice if you are looking for a relax holiday in Hong Kong.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "mumbai", "Title": "“Good Hotel”", "Author": "sachinbiyani", "ReviewID": "UR125439718", "Content": "This is a good hotel I stayed in the hotel for 3 days , Rooms are clean, service is prompt,Morning Breakfast was also good. The only problem was the hotel is far from Hongkong Island Transportation by road is very expensive.I think this hotel is good for those tourist who have taken sight seeing pakage.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Manila, Phils", "Title": "“The worst front desk people ever encountered!”", "Author": "angiepalManila_Phils", "ReviewID": "UR124046755", "Content": "Our much awaited Christnaa holiday was spiled to the max by the most obnoxious front desk clerk I have personally encountered in my lifetime. First of all, this hotel in terms of loaction is far from desirable. It is practically located in the middle of nowhere. Tnough it cam't be argued that he facilities are quite commendable, the luxury cannot make up for tqhe myriad inconveniences of the location, There is not even one convenience store within 5 km radius. I was with aarty f 6 pax supposedly under group check - in arrangement. We arrived last Dec 20,2012. After being dropped off by the tour guide we were dire ted to a group lounge which was supposed to be a holding area and were instructed to wait. After about half an hour and nobody was attending to us I decided to check with the front desk and was unfortunately attended to be a very unaccommodating lady . Instead of pacifying me she went ahead and started asking a battery of questions regarding my reservations This was even after I presented to her a voucher processed in Manila. I was being handled like I was a crook when j fact my four day stay in this hotel for 16 pax has been fully settled prior to my departure . My sister even had to call in the manager for us to be able to check in after almost two hours . The free breakfast offered was pathetic . I just hope the hotel looks into the proper training of their specially with regards customer relations.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Butuan, Philippines", "Title": "“royal view hotel hongkong”", "Author": "dines_dbj", "ReviewID": "UR123680829", "Content": "the hotel is nice, it has great view of the sea, it is very relaxing and good for honeymooners.however, if you plan to go shopping in hongkong i suggest this is not the hotel for you since it is quite far from the city.choose hotels near the central district, when you come down from your hotel room everywhere you see is a shopping paradise.we stayed there with my husband and 3 yr old daughter, it was a good bond since the place is quiet.good thing, were not there to shop, we just want our daughter to experience the happiest place in the world,disneyland!sure she did!", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“entirely happy and satisfied”", "Author": "allaretakenwhatthef", "ReviewID": "UR122872474", "Content": "I was very pleasantly surprised with this hotel and can fullheartedly recommend for everybody going to or coming from the airport...as it is just 30 minutes from Check Lap Kok at a price of around HKD 200.00 by taxi. When I arrived, the welcome at the reception was cool and rushed but ok. The positive experience started in the room. Reasonably sized for Hong Kong including even a small kitchen. Aircon of course, customable lighting and a plasma tv. Non openable windows. I had ordered a king-size-bed which turned out to be king-size only in asian terms, in European/American terms it would be classified as a queen bed, but as such it was of high quality and the sleep experience was a nice one. The bathroom is probably the highlight of the room and especially important to me on a trip. Amenities including a tooth brush and a comb leave you fully covered in any event, a strong toilet, separate ventilation, sufficient towels and a really well done shower area with strong hot/cold water flow and a choice of hand-held shower and rain shower completed the perfect offering. I also used the hotel restaurant for an absolutely fabulous buffet dinner, that set me back about HKD 400.00 including a couple of beers. It´s impossible not to find something at the buffet, there are international offerings as well as local and Chinese ones. The dessert area is especially intriguing. The hotel also offers a pool area and a massage/spa area, both of which I did not try. On the slightly negative side are definitely the for-pay internet offerings and also I was missing a bathrobe in the room. But after all, this is a 4* hotel at a very reasonable price, so this will in no way deter me from returning should I come back to HK soon. About breakfast I cannot comment as I had an early flight, also the shuttle they offer to downtown I could not test and experience. As cleanliness is of course an issue, well, the bathroom was immaculate, the bedroom could use some in-depth general cleaning in additon to the daily issues....in the corners and under the cabinets you can find some remembrances from earlier customers....", "Date": "January 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Bad stay!”", "Author": "Traveller1104", "ReviewID": "UR122657815", "Content": "1) getting breakfast out of hotel is inconvenient (unlike previous trip I stayed in e city) 2) reception kept looking down at his work while I was asking for some directions. Not a good service from them. 3) bathing drain prevented water to drain off with my bf having to use e toothbrush to scrub away the mould that has been stuck there 4) sink drainage was terrible which took a long time for water to drain off 5) feathers or some white stuff from e blanket was flying around e room 6) dirty carpet that caused e rash on my thighs and my bf's due to sitting on e carpet Bad experience I'd never return to this hotel though shuttle service is always on time. View was supposed to be good facing e sea but much got blocked by the bridge.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hyderabad, India", "Title": "“Tourist Hotel”", "Author": "sureshmohan", "ReviewID": "UR122448748", "Content": "Good for Tourist as they stay very little in the Hotel, conducted tours companies mostly like this. As it is far off from Hongkong city", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“My Choice Hotel”", "Author": "ixia22", "ReviewID": "UR122014936", "Content": "My sister and I enjoyed staying at this hotel. We took the Stylish Green Living Pkg and spent 10 nights there. It was a great deal. We were on the non smoking 19th floor with sea view. Room was spacious and clean, staff friendly and helpful. We took advantage of their free shuttle everyday which was always on time and frequent. We travelled mostly on metro (with Octopus card) to everywhere, even to Shenzhen, and the shuttle took us right from the hotel to the Tsuen Wan station in 10 min. When we went to Tsim Sha Tsui and Central we took the Tsim Sha Tsui shuttle which got us there around 25 min. The only time we used the cab was to and from the Airport. We even managed to catch the last bus from TST back to the hotel when we came back from Macau. Hong Kong is always full of people everywhere, everyday and any time of the day. It was refreshing to come back to a hotel with serene surrounding and beautiful view after a long day mingling with the crowd. Would definitely stay in this hotel again.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Richmond, British Columbia, Canada", "Title": "“Clean unpolluted location, though far from city.”", "Author": "Bbtea", "ReviewID": "UR121573961", "Content": "I stayed at this hotel in November for 5 nights with my husband in a deluxe room with one double bed. The hotel room is clean, and design is contemporary. The bed is extremely firm, so if you are not used to it like my husband, it may be difficult to get some good night sleep. However, I'm used to sleeping on a firm bed before marriage, so I had no issues with it. The pillow is super soft, and usually by the middle of the night, there is no support for the neck left. Having two pillows would be far too high for me. My husband and I arrived on an early flight to Hong Kong, so we were trying to check in at 9:30am. We were advised that check in is not until 2pm. We had to store our luggage at the hotel, so we wanted to get some stuff out of it first. There was absolutely NO seats at the lobby area. The only area they had with sofas were blocked off and you'd have to pay to sit in there (with some food offered, I guess). So I asked the front desk where I could find some space to get my luggage - she suggested I go into the hotel shop around the corner... I went in the shop, and right away, the staff in there told me to get out and deal with my luggage outside. So guess what, I got the stuff from my luggage in the elevator area. There is nothing near the hotel, so be prepared. The first two nights were fine at the hotel. The third night when we returned to the hotel, it was full of cigarette smell. Our floor is a non-smoking floor, so I called the front desk to complain. They got someone up right away, and sprayed air fresheners all over the carpet in our room... and that's it. Next night, it happened again. This time, I asked for a reason, and whether they could do something about it... the staff just basically ignored me and he said he didn't know anything. The good thing about the hotel is that it offers shuttle bus every 15 minutes to Tsuen Wan MTR station. They also have a tight schedule returning from the Tsuen Wan MTR station. We took the shuttle to Tsim Sha Tsui on the first day, and never did that again. The time on the shuttle took so long... I'd rather pay a few dollars HKD (equals $1 USD) to get to TST from Tsuen Wan via MTR. I was very busy in HK this time, so I did not get a chance to try their gym, pool, or restaurant. Next time when I do travel to Hong Kong. I may or may not stay at this hotel again, depending on its value. The cleaniness and quietness is not easy to find in HK, and I guess the trade off is having nothing around you.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“My Travel Experience in Hong Kong”", "Author": "Melba621", "ReviewID": "UR118773581", "Content": "Hong Kong is a vibrant city with lots to offer to tourists and visitors. The transport system is superb and very systematic offering safe and comfortable ride. You will never miss your destination as there are markers and pointers everywhere and all exits are duly marked to guide your travel. It is an expensive city but it is worth it. Food is cheap but hotels are expensive. There are good places to go and even if we stayed for like three weeks there, we have not gone to all places we wanted to visit. At night there is always life at the harbour. We really had fun staying and visiting Hong Kong and I would like to go there again some time.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Royal View”", "Author": "Sam649", "ReviewID": "UR118757137", "Content": "We have been to that hotel twice already and it is a good value. The views are spectacular and the facilities are great. Even though far from downtown the free shuttle and the metro will take you anywhere cheap. Only bad thing is the Wifi is not FREE", "Date": "September 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ahmedabad, Gujarat, India", "Title": "“Avoid Royal View and all Royal hotel in Hong Kong”", "Author": "PrashantAjmera", "ReviewID": "UR118680820", "Content": "This is a bad location and you waste lot of time travelling to down town or just a get some food. Nota good location what ever you wish to do in Hong Kong. Avoid this hotel. This hotel is middle of no where. In fact avoid all ROYAL hotel in Hong Kong as all locations are far from downtown except Royal Garden. Hotel food terrible. 100 Hk dollar for 4 Inch Pizza and coke. It was frozen pizza pocket. Took 45 minutes to deliver. Staff is not co-operative and talks like a government autocrat.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Surrey", "Title": "“Pretty view, but a little out of the way”", "Author": "BelgiumSurrey", "ReviewID": "UR116549023", "Content": "Having so much doubts before finally booked this hotel for 2 nights, it was ok I guessed. Price was £65 a night, so ok, but when u need to go somewhere, u better be on time for the hotel free shuttle bus, otherwise, taxi fare maybe $55 each time.. not cheap. Not too good, when u have to come back at night after late dinner, as u have to pay either expensive taxi fare, or queue up for the public mini bus... which drives very fast.... The pool is lovely though, very quiet and the spa facilities is excellent, especially the jacuzzi inside the changing room. .... very good. By the way, the room is very small......and the room was quiet dusty, even the carpet, I can see the dust...... mmmmm not too good.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "pasay, philippines", "Title": "“Too far from main business district.”", "Author": "rickyrose", "ReviewID": "UR116452456", "Content": "We got this hotel through a tour package. We loved our stay in this hotel and perfect for a couple. The only thing bad about this hotel is it is too far from the main business district and shopping centers of Hong Kong. Overall, our stay in this hotel is very good.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“we loved the view and the hotel facilities”", "Author": "pjbackpacker", "ReviewID": "UR116289857", "Content": "i loved the view from our room. looked like having a view of the Golden gate. and the staff were very friendly and their spa was great!! will surely book there again", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Guwahati, India", "Title": "“DECENT HOTEL BUT VERY FAR FROM MAIN CITY & FUN”", "Author": "anky2k2", "ReviewID": "UR116013942", "Content": "The hotel is decent. food quality also ok...rooms good...view nice....but its very far from the city...overall niceee", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hong Kong", "Title": "“A nice hotel near HK Disneyland for family”", "Author": "Bunnysnaky", "ReviewID": "UR114659310", "Content": "We cannot book a room with Disneyland hotel for birthday celebration, so we stayed in Royal View after everyone exhausted themselves at Disneyland. From Disneyland, just take the MTR to Lai King and then head to Tsuen Wan where they have a shuttle bus (16 seater) waiting for you every 15-30 minutes. The hotel offers quite a number of packages for locals and tourists. The room is small for a family but basic and clean. The breakfast is value for money. Good for a weekend getaway.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Best hotel in hongkong for relaxation :)”", "Author": "reysiyel", "ReviewID": "UR114521300", "Content": "My family and I stayed here this June 2011 for 2 days. We all loved it because all 3 rooms we stayed in (1 for my parents, 1 for my sister and her husband and 1 for us siblings) had great views! My parents' and sister's rooms had the view of the beach/bay and the adjacent bridge with really nice architectural form. Us, siblings had our room at the back but still had a wonderful view of the mountain and hotel's outdoor pool. We also loved the facilities which included a nice outdoor pool, big locker/shower area with jacuzzi, steam and sauna rooms. Although not all staff speaks English, they were all definitely very accommodating. Though this hotel is quite far from other restaurants, tourist spots and even public transportation (nearest MTR station is at Tsuen Wan, an 8 min cab ride from the hotel). it would be a very GOOD choice if you're getting an HK tour package, which means you'll be provided transportation to and from your hotel most, if not all of the time. Just be sure to eat elsewhere before coming back to your hotel - unless you'd like to try their buffets, which are a bit costly (HKD165 per person). Also to note is that if your getting a tour package and chose this Hotel, remember to consider that the inclusive breakfast every morning is quite insufficient for most. For the free set breakfast, they serve only a few pcs of bread, pork & beans, sausage and coffee/tea/juice. You can avail of their buffet breakfast at HKD 60 if this may not be enough. Nothing amazing but choices are good enough. :) Aside from those few peeves, I think this hotel is best for a relaxing experience of Hongkong away from all the hustle and bustle of the city center. Definitely different! :)", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mumbai", "Title": "“wonderfull Location....”", "Author": "akhanisanjay", "ReviewID": "UR113803960", "Content": "This was a trip with friends..... Location of hotel was excelllent. Every thing was perfect from Check-in, in room experience, food, service... Excellent...I suggest this hotel for family vacation... Rates were econimical...", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Chennai (Madras), India", "Title": "“Royal View”", "Author": "Ashutosh M", "ReviewID": "UR111357977", "Content": "Lovely location. The property is adjacent to the Tsing bridge. The view from the room is fantastic especially the night view when the bridge is litup. The ships moving below the bridge is a beautiful view. The Hotel arranges very very frequent bus shuttles to drop and pickup from various points in the city. Food is decent.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Good Rooms by Hong Kong Standard, one unpolite staff ruining the trip.”", "Author": "Matthew_at_KL", "ReviewID": "UR106294413", "Content": "I have stayed with this hotel several times within the past 3 years, however this time really ruined the trip. Im sorry to say that the experience has made me decide never to stay at this hotel again, neither would I recommend it to any of my friends. This round I stayed for 4 nights at their Deluxe seaview room on the 19th Floor, attending a Trade business event with my mother. Location is at Ting Kau, which has a spectacular view of the bridge and waters, depending on which side your room is located. However, do note that traveling is required to get to the hotel, shuttle bus service is available from the hotel to the Tsuen Wan MTR station, which requires approximately 20 minutes traveling time from there onwards to any shopping / entertainment districts. Rooms are large and spacious, the ameneties assure a pleasant stay. Majority of Hong Kong Hotels within the city are small compared to this, with exception to the 5 star hotels. My trip was pleasant overall, only to be dissapointed greatly by a certain Security staff which caused me and my mother great upset and lateness for a meeting. To relate, I was travelling with my mother (aged near 60 - I won't disclose actual age, women don't like that :) We were first in queue for the shuttle bus. There was a Lady and a Bloke behind us, my mother has heart problems, and you will notice that the hotel has a strong stench of Laundry smells when you enter, i do not know if this is their idea of aroma or it really is laundry escaping the exhaust. Anyway, my mum felt discomfort while waiting in line, hence she went out for a breath of fresh air. I had to accompany her, being she is my mother and she has heart complications. We were waiting there for about 10 - 15 minutes. When the bus arrived, we were about to board the bus when a Mr. Alex who just came up to us out of no where and asked us where are we going, I replied Tsuen Wan MTR, and he asked us to go to the back of the queue. We politely explained to him that we were in the queue, and my mother's situation which was why we were waiting outside. He insisted not to let us board, he did not believe our side of the story, we asked him to question the guests behind us, however he never did so despite being invited by us repeatedly. We were late for our meeting, and did not get to board the shuttle bus. A Mr Eric who was the Hotel Manager on duty came out - By then Mr Alex was no where to be seen, hiding somewhere i presume. My question to the Hotel is, why didn't Mr Alex question the other Hotel guests when we invited him to do so? Or is he afraid that the guests will defend us? I am very displeased with this Hotel for causing us such embarassment (He just shouted and argued with us in front of all the boarding guests as if we were criminals and did something terribly wrong!!!!) and discomfort not to mention inconveniance even as a guest of 4 nights at their hotel. After 20 minutes or so of non-productive chat with their Hotel Manager - which insisted that his staff was right. Mr Eric agreed to pay for the cab fare to the MTR station (suggested by him). I suggested for Mr Alex to apologize to us instead. But it never happened. Is the Royal View Hotel too arrogant to humble themselves to apologize to their guests? I even requested that they play back the CCTV recording to prove us wrong, which they never even bothered to act upon!! I shall most definately bring this complaint to the highest authority rest assured. A hotel which did not respond correctly, made a mistake and now the price shall be paid.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“We would love to stay here again”", "Author": "wanjoboy", "ReviewID": "UR106054957", "Content": "The hotel is not that far from the airport. If you take the airport express to tsing yi, interchange from lai king to tsuen wan, which is the last station. We had no trouble looking for Exit B3 which is where the shuttle stops. The shuttle service is always on time to and from and the hotel. The queue for the shuttle is near the foot of the stairs of Exit B3. we had the deluxe room with the view of the pool. althought the room wasnt that big, it was clean, cozy and very comfortable. the bathroom is small but with modern fixtures. the hotel staff was very helpful and friendly. upon check in, they would ask for a $500 deposit. if you give your credit card, they would charge it right away but said that the charge will be reversed after 14 days upon check out. since the hotel is in the middle of nowhere, i would suggest to grab something to eat or drink at tsuen wan station before heading back to the hotel. lots of stuff to buy at the station...they have mcdonalds, 7-11, beard papa, sushi station, pies, tarts and cakes, theres a grocery where you can buy fresh strawberries which i loved. the breakfast buffet costs $70 dollars, the selection is very limited, i wanted bacon and scrambled eggs, but they only had ham and hard boiled eggs, fried rice, fried noodles, corn flakes, bran, vegetable salad, hash brown, french toast, dimsum. you can have your US dollars exhanged at the rate of 7.3 which is not bad. exchange rate at the airport is only 7. but you can get 7.6 or 7.7 in mong kok or somewhere else. there's a beach near the hotel too. tsuen wan is not that far from disneyland, maybe half an hour by train more or less. but quite far if you're going to The Tram and Victoria peak but you only need to board the train once---from tsuen wan to central.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "California", "Title": "“Nice rooms, location ok”", "Author": "Ling1674", "ReviewID": "UR102551550", "Content": "I only stayed 2 days at this hotel before heading back to the USA, and chose it because of its location away from the madness of Hong Kong and proximity to the airport. Plus the prices seemed reasonable and I wanted a quieter location. I chose a room package which was to include discounts off spa, food and other amenities. Plus I was under the impression that the hotel offered airport transfers. I since found out prior to arrival that airport transfers were not included, and they recommended only a taxi or public bus, or very expensive limo service. When I arrived at the airport I took a taxi to the hotel...but it wasn't until I arrived that I found out about an additional charge with the taxi that was not included with the stated meter rate...needless to say this resulted in a little tiff with the taxi driver and I was told by the porter that was rather common...nice. ...For transportation / airport transfers, I recommend instead using Trans-Island Limousine Service Limited which you can find on the Hong Kong airport (HKG) web site, I hired one of their private town cars from the hotel back to the airport and its well worth the money. Forget the taxis! My room was a \"deluxe sea view\" room in which I had a limited view of the sea and by the way, the hotel is located right under the Tsuen Wan bridge. The room itself was spacious with a kitchenette and comfy bed and nice rainforest shower. Overall the amenities were quite nice within the room, but they charge for bottled water in the fridge so be aware if you take any water or soda from the in-room fridge! The carpet also could have used a good cleaning. The service could be improved: their free hotel shuttle goes to the MTR station which is convenient and runs every 30 minutes, however there is no sign at the MTR so pay attention to where they drop you off because it was hard to find where the shuttle bus picked up on the way back! Also pay attention to being overcharged: I did not receive the food discount that I was supposed to because they said the package did not include the lunch buffet I had (which was not clearly indicated in the package), plus they tried to charge me for the \"complimentary\" high tea service. I had a spa treatment which was quite nice, but again at Check Out I had to point out that they hadn't offered the discount from the package. Also the hotel is more for Chinese tourists than Western tourists and is a bit out of the way of everything all things considered...and it was further away from the airport than the 20 minutes they indicate on their web site and not that quiet. Overall the hotel itself was decent but the staff is young and does not seem to know the answers to many basic questions. They are nice enough, however pay attention to your hotel charges and especially any package amenities that should be included.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Hong Kong", "Title": "“Average........”", "Author": "PaulSHongKong", "ReviewID": "UR97380861", "Content": "A new hotel but totally out of the city and no real transport except taking cab service. There is no shuttle buses to the airport and vice versa, so ended up taking the Airport Express to Tsing Yi and cab service. The main shopping, leisure and business places are miles away from the hotel. The free shuttle bus takes nearly two hours to get to Tsim Sha Tsui after stopping at various points in the city. Also, there is basically nothing in the vicinity of the hotel unless you intend to use the hotel room services. On the other hand, like I mentioned hotel is new, rooms are clean and does have a beautiful view from the rooms facing the sea. However, I would rate it average unless you intend to spend your time in the hotel itself and spend hours traveling to the main entertainment locations.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Abu Dhabi", "Title": "“Last Minute Booking = Value”", "Author": "facorsig", "ReviewID": "UR92855764", "Content": "Learned that my reservation to another hotel was not confirmed and stumbled on this hotel through TripAdvisor.com. Yes, it is a 20 minute taxi ride for 180 & 200 HKD, but far short of the 900 HKD quoted elsewhere. Front desk staff told me internet was additional, but when I showed them my pre-paid itinerary showing free internet, they took it off. I forgot to request non-smoking room and the room odor was noticeable and did impact sleep, but no fault of hotel. No noise from overhead bridge.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good value hotel”", "Author": "alkanoate", "ReviewID": "UR91932503", "Content": "We stayed at this hotel tduring our trip to HK for a very reasonable price. Rooms were clean, and in my opinion roomy by HK standard. It has all the amenities and the hotel staff were helpful and friendly during our stay. Free internet (included in our booking) was a big plus. Location wise, we made use of the hotel shuttle to Tsuen Wan (convenient from Tsuen Wan to catch MTR to other places in HK) and mini bus 96M. It's a little bit inconvenient as the shuttle buses are not awfully frequent (one every half hour during some time of the day, and more frequent at other times) and there are also no shops around the hotel, but Tsuen Wan has everything that is needed, including plenty of good food, shops, laundry service and restaurants. For the price and the quality of the rooms, highly recommended if you know your way around the MTR and Tsuen Wan!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bangalore, India", "Title": "“dumb desk agents”", "Author": "bnrajagopal224", "ReviewID": "UR91111652", "Content": "i was accommodated in this hotel as complimentary stay by Cathay pacific airlines. First of all when we reached the hotel at about 10:00 A.M, on 23/12/2010, the clerk at desk told us room is not ready and we should wait till 11:30 A.M. When I protested strongly they alloted a room after nearly half an hour. Then the clerk asked me to give credit card for reference. I had only debit card and I gave it. Shockingly he charged HK $500. I told him he cannot make any charges as my stay was complimentary. Also my card was a debit card and the amount will be transfered immediately. The blank look on his face showed his dumbness on the subject. He assured me that when we vacate he will reverse the charges. But so far it has not happened. I have taken up with Cathay Pacific Airlines. So beware dont give any credit card or debit card to them.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Venice, Florida", "Title": "“Isolated Hotel”", "Author": "wanderer11111", "ReviewID": "UR88804601", "Content": "Far away from establishments, shopping malls and MTRs. You need to return back early at the pick-up point for you to catch the last trip of shuttle, unless you are willing to pay 900HKD for a cab. Having a second thought whether you go to the night market or enjoy the Victoria Peak at night? Better think of the time you spend travelling from hotel going to the malls and other attractions in HK, then you will find out it will cost you an hour for a one way trip to the nearest decent shopping mall. Poor Hotel Staff services", "Date": "December 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“stay if you have researched your daily travel”", "Author": "ramsun", "ReviewID": "UR87826050", "Content": "the hotel is neat clean with the usual amenities ,rooms tend to be little compact so if you have many pieces of luggage its hop skip and jump.they run a shuttle to Tsimsha sui & Tseun wan stn as this become the most important travel exit to rest of Hongkong make sure of your drop points .you have to go to Tseun Wan stn to pick up tour daily food water in case you are not using the hotel restaurants as no shops are available close by so before retiring for the day pick up your things .for a tourist it is very near the airport ,Disneyland ,the great Budha ,Nong Ping 360.there is a great beach across the hotel .dont forget to go to hotel rooftop.so basically a resonablew hotel if you have worked your travel plans .vegetarian food not available esp for travellers from India", "Date": "November 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Good views, wonderful staff, would stay again”", "Author": "E803", "ReviewID": "UR83204140", "Content": "Although the hotel has nothing nearby (other than the Tsing Ma bridge), it has a very convenient and free shuttle bus that will take you to the MTR station (Tseun Wan line). The shuttle comes every 30 min and at least during our stay in Sept, we never really had to get in line until about 5 min before the shuttle was going to come. The shuttle ran on time, the only downside is the last shuttle bus is ~10:40pm, so if you want to stay out later than that, you would need a taxi. The hotel staff was wonderful, and the housekeeping staff even organized our shoes! The hotel is very clean and modern, beds are kind of small, but there is a nice view. No wifi in rooms, need an earthlink cable (they will provide yo one) but you have to pay for the internet like most hotels.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "UAE and China", "Title": "“Ideal for fans of industrial architecture and extended taxi rides”", "Author": "LanPing", "ReviewID": "UR82985577", "Content": "No non-hotel shops within walking distance, no public transport other than clueless taxis and a virtually unusable shuttle bus (see below), Buffet dinner priced well over the odds compared to other local hotels. And now the bad points. The location is truly awful - actually UNDERNEATH the span of the bridge to Tsing Yi; this hotel is a very, very long way from anywhere, and rather than the sea views avaialble on Lantau, this hotel looks out across the dockyards at the entrance to the Rambler Channel - http://en.wikipedia.org/wiki/Rambler_Channel The concierge was adamant that you couldn't take a taxi to Shenzhen Bay crossing; I do so almost every day, though when I finally did so from here the driver got lost and cost me an additional HK$90. The same happened on the return leg, with the driver taking me to the Gold Coast Hotel instead. The receptionist thought that a taxi to the Ngong Ping (Buddha) Cable Car would cost HK$250; in fact it was less than half that.. All in all this hotel is in the middle of nowhere, and not even the staff genuionely know where it is located or how to get there. No English-language maps or guidebooks; several Chinese coach parties and local weddings. Staff have a limited grasp of English (I work iin HK, and these people were exceptionally poor by local standards). And the Shuttle Bus. Frankly, if you can find the stop at Tsuen Wan MTR station, then you are a better navigator than I; when I called for assistance the receptionist simply parrroted the same unhelpful instruction to \"Go to Exit B3\" - the exists are indeed lettered, but not numbered, there is no sign for this Hotel's pickup and, ultimately, there was no bus. Don't stay here; there are plenty of far better alternatives - the Garden View, Silvermine Bay or the Prudential are all similarly priced and far, far better", "Date": "October 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bahrain", "Title": "“great stay and service”", "Author": "ReenaRBahrain", "ReviewID": "UR81015402", "Content": "I did my research and was aware of how out of the way this hotel was but it was what I wanted for our last night in Hong Kong and its somewhat closer to the airport. The hotel staff were extremely friendly and professional. A very good, organised shuttle system in place which drops you off near MRT station so you can get to places that you want to go. An excellent fitness center and pool there. Great views from hotel room. Definately worth it.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "1.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Feel like in Main China”", "Author": "Cartier79", "ReviewID": "UR76611576", "Content": "Overall would say this hotel is nice, even tho far away from Central. But still a good place to stay after a long day from meetins. However, on your return when you step down the taxi and enter the lobby. You thought youself was in China. Tons and Tons of ppl from mainland yelling and screaming with no control. Rude and noisy. One thing I need to mention, they do have a huge sign outside the hotel building. in chinese. i am not sure what it means, but looks like the sigh of a furnel home. i think they could do a lot better on this or simply take it away. if you can't stand go back to China, i am sure this is not a place for you.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Oxford, UK", "Title": "“A bargain for leisure travel in HK”", "Author": "AlexPOxford_UK", "ReviewID": "UR74840553", "Content": "Having stayed before in various hotels in Wan Chai and in the Holiday Inn Golden Mile (Kowloon) for business, I was a bit apprehensive when I chose this hotel for the leisure trip with my wife. How wrong I was! It is located indeed quite far from the Tsuen Wan Metro station (45HK$ taxi ride) but we did not know about the shuttle bus that the hotel runs every 15 minutes to and from the station. We were given a room on the 10th floor with a nice view over a fishing harbour and the hotel's swimming pool. A very romantic view at night and extremely pleasant in the early morning sipping your coffee by the window. The hotel room extremely spacious (in comparison with the downtown hotels where rooms are like matchboxes,) LCD TV with multiple programmes (in English too!), coffee/tea, excellent bathroom with all amenities needed. Breakfast buffet very reasonably priced and service with a smile - not always a feature in HK hotels and restaurants. If you plan to visit the Tian Tan Buddha, the Po LIn Monastery and/or the Disneyland resort the hotel is probably one of your best choices. For business travellers there is also a shuttle bus taking you to (and from) Tsim Sha Tsui (downtown HK), so it is all a matter of co-ordination with the very helpful and courteous concierge desk. 24 hrs of internet connection will cost you 120$HK but there is free wifi in the lobby and cafeteria areas. At a rate of 480$HK per night which we paid (The HI Golden Mile offered the same type of room at 2300$HK), we could not have a better deal!!", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "philippines", "Title": "“No regrets at all”", "Author": "emberPhilippines", "ReviewID": "UR71196779", "Content": "The hotel was lovely, nice, modern, contemporary! everything in their website is true as well as the testimonials here in tripadvisor, it helps me to decide in choosing this hotel.. Although the location is quite far, but i love the place because of the nice scenery.. I find the location not a problem because of their free shuttle service going to the downtown.. If you really want a real vacation, a place that you can relax, i could say this is the perfect place to stay! Quite and far from the hustle and bustle, that is Tsuen Wan. Here are the comments that i can say to their: Room = lavish, lovely, modern and a lot of space! We are all 3 adults and 1 child (with luggages) in the room and there are lots of space still for us to move around. Bathroom= a bit small but very clean and contemporary. Love their shower!! There was no bathtub, but its ok. What is important is you can take a shower right? Room Hallway= nice design, very spacious. But not so soundproof, since i can hear the footsteps of some guest passing our room. Swimming pool = they have a large swimming pool. We really enjoyed swimming there, with some trees in the surroundings. It was very refreshing.(Too bad, i haven’t tried their sauna and gym) Lobby = i found the lobby very simple yet elegant. Although, the area is quite small for their many guest. They could put more chairs/sofa in their lobby coz the other guest are just standing waiting for their turn to check-in/check-out. Buffet breakfast = not so lavish but atleast there is a variety of food. I could rate it very good! their cafe Lido has a nice view facing the beach. So relaxing. Complimentary shuttle service = the schedule is very accurate and on-time! This free service is very convenient for their guest. This is a good plus for their customer. Once you reached the MTR station, it’s easy for you to move around hongkong. Dont worry if there's no convenient store near the hotel, just hop-in to their shuttle bus (from 7am till 10:40pm daily) going to Tsuen Wan MTR station, there are lots of restaurants and store in that area. If i will go back to HK, no doubt i will stay again to this hotel. They have good service, the hotel itself is nice, at a very affordable rate!", "Date": "July 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Dubai", "Title": "“Great Hotel At Affordable Price”", "Author": "Qervee", "ReviewID": "UR68744523", "Content": "This is the best Hotel to stay in Hong Kong if your main concern is quality at an affordable price. The facilities are nice and clean. The food is good too. The only downside is the location. It is very far from simple necessities. No convenience store or establishment nearby. They have free shuttle to downtown and back but only on a very limited schedule. So if you want to stay late shopping then you have spend some money on taxi going back which could be a poor man's fortune.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“everything perfect except for the location”", "Author": "mattandjess100", "ReviewID": "UR66323872", "Content": "On arriving at the Royal View we were greeted by friendly staff but there were some minor language difficulties in checking our booking etc before allowing us up to our room. The room itself was of good size and very clean. Everything was modern in age and design and there was good use of space throughout. The view from our main window was just breathtaking, we probably sat down and admired the view of the harbour for at least an hour before organising ourselves and heading out. Location unfortunately isn't fantastic, with a good 15min drive to reach the central city area in Kowloon. There is however a free shuttle that takes you into the city, and I believe it goes approx every 30mins. All in all we had a really comfortable stay at the Royal View, even though we were a fair distance from the central city area, it was in some ways quite nice to get away from the hustle and bustle and just take in the great views the hotel has to offer. The staff and porters were very helpful in organising taxi's etc and were always on hand to handle our baggage.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "delhi", "Title": "“Worth Spending every penny.”", "Author": "drpradeepsharma", "ReviewID": "UR59992338", "Content": "Stay there ones u will start loving, liking the nature. Its on the edge of sea. Newely built beautiful hotel with all modern aminities.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "EU", "Title": "“It's ahhh nice enough but too far IMO”", "Author": "EUTrav", "ReviewID": "UR59975940", "Content": "Well the hotel itself is smallish but niceish, clean, contemporary etc. But I probably wouldn't go back because I found the travel into HK and the reliance on the shuttle and MTR a bit too much for my liking. It took me 40-45 minutes to get into HK so I guess it depends on where you are going. For me, who usually doesn't mind travelling a bit farther in order to get a nice and clean (most important!) hotel, I would hesitate going again.But room itself cool, with hotel amenities, a little sink and fridge, clean room, nice colors etc I got an Ocean Deluxe, maybe because I had just moved from the Marriott SkyCity but the window and view was really quite small. Nice enough hotel overall, I checked out the gym etc and it was nice but I didn't use it. I think it was good though and they also have a pool reopening on the 1st April. Make sure you know where to queue for the shuttle bus as you are very reliant on it. Again don't get me wrong, it's fine but just not suitable for someone who prefers convenience and proximity - items I wouldn't underestimate on holidays anymore :) Tip: There is a Park n Shop supermarket two levels above where you catch the shuttle bus from Tsuen Wan, buy your food there, they have cooked food, good value", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, South Australia", "Title": "“Royalview Hotel is fantastic!”", "Author": "GMVince", "ReviewID": "UR59104177", "Content": "Please check out this site for a fantastic hotel if you are planning a trip to Hong Kong, ok! www.royalviewhotel.com.hk It is a fantastic hotel, just a little bit outside and away from the hussle and bussle of the busy Hong Kong Central Business District, but its only about 20 minutes by the train. It is the most beautiful little hotel with a wonderful view, great food, great service, and the really nice rooms, so you will love it there, ok guys! If you need a nice hotel, but something not too expensive, then look no further! I am definately going back there next time I go to Hong Kong. Regards from Vince Palumbo (Australia) www.grandmastervincentpalumbo.com", "Date": "March 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Manila", "Title": "“Great Rooms, Bad concierge and frontdesk staff, location is far from the city but thanks for the shuttle bus”", "Author": "mystay2009", "ReviewID": "UR52897352", "Content": "Well, we stayed here on August 21-23, 2009, it was booked by our travel agent. Well the room were we stayed is amazing, the bathroom is nice and clean and its pretty like of an studio type apartment except for the dining area. There is sink and a lot of cabinets; i really love the design and it was really cozy. If you want to stay in a cozy hotel then this one is for you however you will take a lot of time going to the city (but its also a good thing to try out staff like riding their mtr and going to the outskirts of Hong Kong), the view here is good, its serene and is away from the loud noises from the city, you can feel that your really on a vacation. The staff is not that good, some of them doesnt speak english, the concierge staff (the old man there) is so much discriminating especially for Filipinos. The frontdesk staff is good but will make you somewhat wait for a while but its okay. Well, for those who intend to get a set breakfast from the hotel (if you registered in a travel agency and sees that you will have a breakfast outside or set breakfast), beware since your menu will be just be bread, beans and sausages, however for the buffet, its just like buffet breakfast of any other hotel. Corridors in this hotel is not airconditioned; so dont get irritated if it's hot in there. If you went outside the city, dont forget to buy water as well as food, since there is no convenience store nearby and these goods are expensive if you will buy it in the mini bar. Food in the restaurant (ala carte) is also expensive, so just hop on their shuttle that goes (I think) every 15 minutes going to the MTR station where you can dine without getting your wallet shrink. I havent tried calling the frontdesk for any problems (like lack of towel or supplies inside the room) and I havent tried their room service so I cannot really comment about their service. But overall our stay here is amazing; since I really loved the room.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "1.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Cebu", "Title": "“Good for Honeymooners & those who want to discover Other side of HKG”", "Author": "celia_travelways", "ReviewID": "UR40090089", "Content": "We stayed in this Hotel last Feb.14-17,2008 together with my husband & baby. We enjoyed our stay there, the hotel was clean & safe, it's quite far from the Center of HKG, BUT they have free shuttle service from hotel to MTR station almost every 15minutes, and in the MTR station there's a Mall with a Grocery Store where you can shop like locals for cheap prices. We also had a room with a relaxing view of the beach.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "1", "Rooms": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Nice hotel, but bad service”", "Author": "Inni85", "ReviewID": "UR37067757", "Content": "A nice and affordable hotel, lots of luxury, swimming pool, sauna, etc. But the staff barely spoke any English. And things are explained very vaguely in their brochure. Hotel is far from anything, but they do have a regular bus service to the nearest metro. Would recommend an octopus card for those who are staying for longer than a week, and whose going to use the metros on a daily base. Internet at the hotel is a bit expensive, but decent.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Assam,India", "Title": "“It is a nice hotel.”", "Author": "BipulAssam_India", "ReviewID": "UR36194419", "Content": "We stayed in the hotel for three nights 13th,July to 16th,July.Everything in the hotel is o k except the location.It takes about 45 minutes by bus to the city.Hotel provides free bus trip to the city and metro station time to time.The hotel is situated in newly developed area in new territories and you are not going to find any shop,resturants or market nearby.We got a seaside room by the bridge it was a terrific view from room, sea with the bridge.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "england", "Title": "“Its Worth your Money!”", "Author": "xickleboox", "ReviewID": "UR35091437", "Content": "I loved this hotel!!!....... the staff were always helpfull and friendly!! I even managed to jam the lock on my suitcase one day and they sent up one of their engineers to break it free for me;D The facilities are Fantastic....swimming pool ,sauna,Jacuzzi and even a free gym and u can sign guest/s in to use it (well at least i think u can cause thats what i did)!! The Only problem I had was it was bit far from the centre....so if ur after late nights out and clubbing it probably not the most ideal location for you. However A free shuttle bus does runs on regular basis (cant exactly rmeba wot tym it ends...either 10 or 11 pm). and i forgot to mention that they have an internet cafe on site was cost da bomb!! it was like $40 HK for half an hour. and I cant reli rate the hotel food as i neva tried it as I was too busy touring HK!!", "Date": "July 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“Loved the Sea view by the bridge ..”", "Author": "Sidhant-Del", "ReviewID": "UR32127723", "Content": "Though its been a while I stayed at the Royal View, but the warm memories are still intact. We arrived at the hotel about 4 pm, local HK time. There was a warm welcome for our group of 5. The check in was smooth(though not the quicket). We got deluxe sea view rooms on the 10th floor. Like most rooms in HK, this was pretty compact too, but had most of the moderm amenities(Kettle, LCD, Internet LAN etc). This hotel is far from the city: Plus: Serene and quiet surroundings, Small beach 2 mins walking. Next to the sea so amazin view. Cons: Takes time to reach to the MTR(Metro train) or the city. Though there is a free shuttle service every 30 mins to the nearest MTR station(Tsuen Wan). You can reach any part of HK once you touch the MTR. The breakfast served is really nice. Room service is prompt. However at the time of checkout, there was an additional charge of few cokes/water bottles/chocolates which we never consumed. The manager was courteous enough to hear out the entire fuss and finally did not charge us for the same. But the hassle/trouble took sometime to settle. Overall, a good hotel and can be a good destination for a vacation/with frenz or family. Business people may prefer to be closer to city!", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Batangas", "Title": "“great yet very far in the city”", "Author": "ypeL08", "ReviewID": "UR27021977", "Content": "it was really such a great experience! though being the first time traveller! we had a great time during our stay inthis hotel. thank God we had a shuttle bus that can pick us up during our tour! the service and facilities of this hotwl is really awesome & great! i love it!!", "Date": "March 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "dublin", "Title": "“Out of the hustle and bussel”", "Author": "ww1977", "ReviewID": "UR26839949", "Content": "Don't stay here if your looking for something inexpence and not to far from central. Stay here if you have been to HK before and looking to get away from the hustle and bussel. Upgrade to sea views rooms you will enjoy more. The room I stayed in was small but it was fine for my needs. In review i would recommend this hotel as an ideal base to hire a car and explore the New Territories.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "China", "Title": "“Unless your priority is looking out the window, you can do better”", "Author": "Respect_please", "ReviewID": "UR23570786", "Content": "This hotel reminds me of a woman who seems beautiful until she opens her mouth to reveal a voice like a banshee, a bad disposition, and very little brain. The room and the public areas we saw were very nicely designed (except for the odd way room numbers are assigned and displayed). But the location and service were aggravating. We spent one frustrating night at the hotel before managing to reach the airport. The hotel is remote from Hong Kong's wonderful public transportation system, and so it is remote from restaurants, shopping,and street life, yet doesn't make up for the lost amenities. When we asked for an ATM, the desk suggested we take a taxi. (The hotel can charge your credit card for things like drinking water, which is not provided, but cannot arrange a cash advance on the same card). When we tried to set up transportation the night before going to the airport, the desk said it was too late to arrange their advertised airport shuttle, and recommended another taxi. The fare was HK$240, a rude shock compared to our experience a week before at the Royal Park Hotel, where a bellman escorted us across the street to an express public bus which cost HK$12 and took about only 20 minutes longer. Because there's no nearby dining, we ordered the only vegetarian option from room service, tomato and egg sandwiches (HK$7 + $7 \"service fee\"). We've had better sandwiches for the cost of the service fee. In fact, we can't remember worse sandwiches at any price. In a note to management, I suggested the sandwiches be renamed \"mayonnaise on white bread garnished with four thin tomato slices and a small chip of egg white.\" Management obviously hadn't gotten the message by the time we left the next day. It was still on the tray sitting in the hallway that reeked of cigarette smoke. Unless your main priority is too look out the window at distant city life, you can do much, much better in Hong Kong.", "Date": "January 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Nice and simple”", "Author": "Perspective", "ReviewID": "UR22616692", "Content": "Check in was very smooth, booked the two-bedroom suite as this was the biggest suite. Decor is simple and nice, Everything went very well and nice for a getaway. I live in Hong Kong at the Peak and this getaway just staying at the hotel and eating and shopping around that area made it a new exprience for me, seems like i went to another country which was very nice as it is a relaxtion time for us. The monthly suites are much better espcially the three-bedroom ... I stay here when it was newly opened..", "Date": "December 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dhaka City, Bangladesh", "Title": "“Beatiful location”", "Author": "VaboGhurey", "ReviewID": "UR21497238", "Content": "I was on a business trip and found all the hotels near business districts (Tsim Sha Tsui, Mong Kok, Central, etc.) are on sold out state. Found this new place in Tsuen Wan district. My counterparts in Hong Kong were complaining why you are staying so far. But I really enjoyed this place. The hotel really have a nice view around. It is very near to the longest cable bridge in HK. Large and lush green hills are on its north and beach is on its south. The place is very calm. It is actually adjacent to Ting Kau village and I am convinced that I will like it better when I will be in a leisure trip there. Though it was away from my business places, but I rather liked to have my evenings in this country side after a busy day. I find the room decor nice. It is well maintained. Everything in the room was nice. I only missed a phone set in the toilet. The restaurants were serving very delicious food and drinks. Overall my stay there was quite comfortable.", "Date": "November 3, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "laguna", "Title": "“commendable hotel”", "Author": "ceruleanblue", "ReviewID": "UR19319982", "Content": "We stayed at RVH for 4nights and all I can say is we were given superb treatment. We had a nice room with a minibar, plasma tv, hairdryer. The staff were all very nice and they could speak english (although not good) so asking for directions was easy. It is far from the city but they have shuttle buses that take guests to the MTR station every 30mins. We were only asked to deposit HK$500 when we checked in which was refundable (it was not stated in their website when we booked them). And although our room had a veranda, we were told that we needed to pay a small amount so we could open it. We didn't bother anymore as we didn't plan to spend our time in the hotel the few days we were in HK.Sans those facts, our stay had been good, to say the least. :)", "Date": "August 24, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Manila", "Title": "“never again. i swear.”", "Author": "randomdays", "ReviewID": "UR18085661", "Content": "My sister and I stayed at the Royal View Hotel for 3 nights. As a first timer in Hong Kong, we're both very excited in this trip. We were usually out for our tour and we only get a chance to be at the hotel during the morning and evening. The tour was very tiring and we are expecting to get a very good service from the hotel. The first thing I noticed was the very small lobby and lack of space for the lounge area. I've been to different hotels before and this one is very unbelievable. They accommodate most tourists in groups and it is just impossible for everybody to fit in. Another thing that I hate was their food. Their breakfast is delicious but if you have to eat the same thing everyday, it won't be anymore. They did not even try to change the set of their buffet. Some hotel staffs are nice but what made me go crazy is their F&B attendants. Imagine, I was still eating and she was already trying to get my plate, which I was still using! I don't know if that is part of the Chinese culture but I think it's very inappropriate to do that especially I'm still using it. And it happened twice. My mom also left a message to us at the front desk the night we arrived. And guess what? The staff just gave it to us when we are about to leave already!!! The internet doesn't work too... Lastly, the hotel is located in the middle of nowhere. This hotel needs improvement. Badly...", "Date": "July 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Melbourne", "Title": "“4 nights in Royal View”", "Author": "apfish", "ReviewID": "UR17299533", "Content": "We just returned from a 4 night stay at the Royal View Hotel, Hong Kong. Arrived during a rainy day but the concierge was there to help from our Taxi. (There were 4 of us and about 12 pieces of luggage) Check in was quick and we were given 2 standard non smoking rooms, along with 4 keys. Staff was considered enough to ask whether the other guests needed registration, to enable phone calls or any other enquires. I have stayed in numerous hotels during the last few years in Hong Kong, and with a tight budget, I rather choose a out of town place with a bigger room, rather than a shoe box in town that is not much bigger than a double bed. As previously stated, the room felt damp once we entered the room, but this is a common problem in HK with the high humidity, the solution is simply turn the A/C to high, interesting the A/C doesn’t turn off even when you take the room key out (My guess is too many guests complain about the dampness) The shower was strong and with a rain drop shower head and a 3 way adjustable flexible shower head on a cord. The bathroom area is small but very modern and clean. The room area is big with a enough room for all our bags along with a very nice bay view and of either the Tsing Ma or Ding Gau Bridge. Big Panasonic Plasma screen with 30 Cable TV channel is at the end of the bed. Fantastic Gym with 24 hours access, however one downside is that the swimming pool is only open during 0700 - 1930, couldn’t even sneak in as the access area is locked. Convenient complimentary mini bus service running to Tseng Wan MTR station (every 10-15mins) or TST (hourly). Given the price we paid, ($580 HKD per room per night), would definitely stay again, same room in HK Island or Kowloon is often 1.5 x to 2 x this price.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "sw france", "Title": "“good hotel at a very good price”", "Author": "messean", "ReviewID": "UR14426741", "Content": "arrived at hotel at 9.30 in the morning after an overnight flight;staff could not have been more helpful getting a room ready in less than 30 minutes;our room was slightly below average in size (especially bathroom) but did have a kitchen area with facilities to make a hot drink;room was very quiet at night;had a better night's sleep than in any of the other 10 hotels we stayed in on this trip;location is not great as you need transport to go anywhere but the free shuttle service to downtown Kowloon was very reliable,alternatively taxis were always available", "Date": "March 21, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "houston", "Title": "“Wonderful stay!!”", "Author": "cattleyagirl", "ReviewID": "UR14237090", "Content": "We stayed at the Royal View Hotel in Hongkong as part of a package tour and my sister and I were very pleased with the experience. Upon chek-in, the staff were very helpful in placing us in a Non-Smoking floor when I requested that they do so. The concierge gave us excellent tips on where to go and very clear directions on how to get there. The view from our room was spectacular! Very helpful and knowlegeable staff! The rooms very cleaned daily and the toiletries and towels were changed daily. The really enjoyed the plasma tv in the room, although most of the shows were in Chinese and we both did not speak the language. Maybe the only downside is that the hotal is far from the City, but they have shuttles leaving every 30 minutes. Taxis always come and go, but if you do not want to spend a lot on cab fare, do what we did, we tok the shuttle to the MTR and then take the subway. Two nights that we missed the last shuttle, we took the MTR to the last exit closest Ting kau and then caught a cab ($HK 43) Since the hotel is far from the City, we enjoyed a wonderful view and had the chance to stay away from the hustle and bustle of the City. Over all, we had a very pleasant stay and would prefer to stay there again.", "Date": "March 12, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Thornhill, Ontario", "Title": "“Horror Story”", "Author": "Sylvia26", "ReviewID": "UR8403726", "Content": "We stayed at the Royal View Hotel for one month on a recent business trip. The hotel is very nice looking, with pool, fitness facilities, and a lovely view of the sea under the Ting Kau bridge. That is where the compliments end. The customer service representatives are friendly and must say, \"I am sorry\" often. After doing so, there is no resolution to the many problems that we faced. The rooms are very damp, my sofa was replaced 3 times. I needed two dehumidifiers in the room, running 24 hours a day, just to take the moisture out of the room so it would be livable. These machines did a good job, but sleeping through the noise of the machines could be difficult. My colleague chose not to have the machines in his room, so lived with the mildew building up on the walls. I was offered other rooms to move to, but they were all damp. The customer service rep. apologized and said the building engineers are looking into the problem. They offer internet in each room. It worked only sometimes. For one week, I had no internet at all, so working in my room became impossible. I was advised to go to the business centre in the hotel, where 2 computers were available, but the waiting time to use these computers was often long. The hotel is located in the middle of nowhere. There are no amenities within walking distance. The shuttle from the hotel runs every half hour to the subway. You must get in line early enough to ensure your space on the 29 seat shuttle, because if you don't get a seat on the shuttle, you don't get on the shuttle and then must wait another half hour. We were in Hong Kong during a typhoon, the shuttle doesn't run during a typhoon, so we had to find a taxi back to the hotel, which was difficult. Some people in my group used the hotel laundry service. Clothes got \"misplaced\" but were later found. Some did not have their clothes picked up from their room, due to lack of good communication amongst the hotel staff, which was an ongoing problem. Large tour groups use the hotel, so the lobby is frequently filled with excited, loud tourists numbering anywhere from 30 - 100 at any given morning or evening. This also makes it difficult to get to the front desk and make inquiries or requests. The carpets in the halls are new and full of fluff balls all the time; the fluff balls enter into your room. Unfortunately, I was placed on a smoking floor,and while my next door neighbour smoked, I felt the affects of second hand smoke in my room, coming through the ventilation. You cannot open the windows in the hotel. It took me several attempts to establish a wake up call, on a number of occasions, they forgot to call me for my wake up call, \"I'm sorry was the response\". The hotel staff are very nice and friendly, but very inefficient. They have staffed this brand new hotel with untrained employees. Sometimes I was not sure if they did not understand the question or they simply did not know the answer. For instance, when I asked if the boom box in the room played DVD's they said no, but I later found out it did. My telephone had to be replaced because it was not working. My friend did not have any lights in his room for 2 days, until engineering finally came to fix the problem. The list goes on and on. It was a horror show, I wouldn't recommend this hotel to anyone.", "Date": "August 13, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Toronto", "Title": "“This hotel SUCKS bad....”", "Author": "Arachides", "ReviewID": "UR8392361", "Content": "I just spent a month at Royal View, which was the place I was set up in for my stint teaching for a month in Hong Kong. This is the worst place I have had the displeasure of ever staying in. #1 - The humidity in the rooms is ridiculous. If you sit on the couch, your ass gets wet. Other teacher friends requied dehumidifiers for their rooms because they had condensation dripping down the cupboards. The hotel keeps 30 dehumidifiers on hand - does this tell you anything? #2 - Because of the humidity in my room, I had black mildew forming on the ceiling/wall right near my main air conditioning vent. The cleaning staff did not seem to care as they never once tried to clean it. I came to view it as my pet, which I named Millie. #3 - The bathroom is poorly designed. The sink is buried under the medicine cabinet such that it is impossible to get your face in their to wash it and/or rinse for shaving. #4 - Housekeeping sucks. They wipe, but they don't clean. The soap scum in my shower stall just kept building and building, particularly on the glass door. I asked for my laundry bag to be picked up from my room for \"by the pound\" wash service. They never showed up. I called back and they said they would send a person up to fetch it, since I had to leave for work. It was still there when I returned at the end of the day. At least one day I knew they had changed my sheets, since they left the used ones in a big ball on my aforementioned moist couch. The hallways and are full of dust bunnies from the carpet fibres that are EVERYWHERE. They are enitely clueless. #5 - The place stinks - literally. They have got a SERIOUS air exchange problem at this place. If they do not bring in some engineering consultants to fix things, they will be screwed. As I mentioned, my room had mildew growing openly on the wall. The hallways smell disgustingly musty from dampness, mould and mildew. I wouldn't be surprised if they have black mould forming within the building. Some parts of the hallway smell worse than some of the streets in Mong Kok. #6 - Their shuttle service in inadequate. both in frequency and the size of the shuttle bus itself. #7 - They have a Reading Room, where there are two computers available for use in a hotel of 17 floors. Their internet drops constantly. The computers have no Microsoft Office Applications; they're simply for surfing. They are extremely hard to even get on as they become monopolized by little kids playing games for hours. In summary, for a hotel that bills itself as a 4-star facility in Central Hong Kong (...that's a laugh, it's in the New Territories at the very end of the Tsuen Wan subway line + ten minutes, i.e. about as far away from Hong Kong island or downtown as you can be...) this place is a joke. The majority of the staff are truly clueless, both in capability as well as level of service. One minute issues always take 10 to remedy. Truly I think it's a management problem. The staff has not been trained properly in how to serve paying customers. They cannot think beyond their little function, whatever that may be, and their myopia drives you nuts. And the facilty management is pathetic. DO NOT STAY HERE. EVER. YOU WILL DISAPPOINTED AND ANGRY BEYOND BELIEF. Stay anywhere else. Anywhere in Hong Kong is better. A decent view and a great pool are not enough to deserve your travel dollars. This place just sucks...", "Date": "August 10, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Hong Kong", "Title": "“A Traveller's Nightmare”", "Author": "walwalf", "ReviewID": "UR8214567", "Content": "The Royal View Hotel is a relatively new hotel, and thus some of it's incompetencies can be excused. However, as a traveller I found the hotel and it's staff to be unbelievably incompetent in their customer service skills. For one, the first thing I noticed was the new carpets they set down on each floor. Although it very effectively reduces the sound of footsteps, since it's new, it's very easy for \"hairballs\" to stir up. The result of that is a layer of hairballs that cover more than half of the carpet's surface area. Now for someone who's allergic to dust, this raises some concern. Upon raising this concern to the management staff at the hotel, they did agree to send housekeeping to vacuum the carpets... however this action was not taken until several days later. Secondly the appliances are, to a traveller, quite confusing. For example, the microwave took me 2 days to figure out since all the function buttons had no words and were all represented by symbols or pictures. The laundry machine was the hardest to figure out: I required the assistance of housekeeping staff to help me. Now here's the catch. The housekeeping staff ALSO did not know how to operate the laundry machine, which is perhaps the most surprising event that happened during my stay. A less serious problem I found was with the TVs in the room. Upon my previous stay at a nearby hotel, the hotel included a piece of paper that detailed what channels were available. This I did not find at The Royal View Hotel. The most serious problem I found with this hotel as a traveller was the fact that transportation was unbelievably inconvenient. Let us compare this to a previous hotel I stayed at (which is located minutes away from the Royal View). At that hotel that shall remain unnamed, they provide transportation services from their hotel to the Tsuen Wan MTR station with two large tour buses, with buses every 30 minutes or so. Here at Royal View, there is only one 29 seat shuttle bus that goes to Tsuen Wan MTR, and this shuttle bus doesn't come around until an hour later, so if one misses the bus, they would either have to take a long walk out to take the minibus or wait an hour for the next shuttle bus. Also, the staff was at first very reluctant in forming a line for guests to line up in to board the shuttle buses, resulting in obvious chaos. On a final note, the broadband internet service here is horrible and often kicks you off the system, a problem that rarely occurs in other hotels. On the bright side, the view really is very nice, the air conditioning is amazing and the swimming pool is pretty nice to dip in in the evening. Overall my stay at the Royal View hotel was horrific compared to that of other hotels I have stayed in over the years as a constant visitor to Hong Kong.", "Date": "July 22, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Fun to stay in a brand new hotel!”", "Author": "contentedcow", "ReviewID": "UR7727914", "Content": "We stayed here for two nights 22nd and 23rd May. The hotel was not fully open and there was still some work going on, but it wasn't noisy or intrusive. We got the impression that we were acting as guinea-pigs for staff training and that there were very few other guests. All staff that we interacted with were eager to please and spoke a little English. Our first impression on arriving at the hotel was that we'd made a big mistake in booking it because it is built right underneath one of the bridges connecting the New Territories to the other islands and also there are several busy roads all around. However, once inside the hotel we were not aware of this at all, and I am really sensitive to noise. The whole ambiance is of peacefulness and elegance. The rooms were average sized, even quite generous by Hong Kong standards, and very comfortable. The beds were firm, but not hard and had good quality bedding. I have not stayed in a brand new hotel before and it was very nice to think that we were probably the first people to sleep in them! The view from the window was of the sea, with a variety of boats constantly passing by and was quite mesmeric! The TV only has a couple of non-Chinese channels, which didn't bother us other than our daughter being unable to catch American Idol! There is a small kitchen area with tea/coffee making facilities, a sink and a fridge, but no microwave or plates or anything. Plenty of cupboard space, but I don't know what for! The bathrooms are nice, although not very big. It took us a while to realise that to get hot water in there we had to use a switch on the wall outside! The shower has a regular removable shower head and also an overhead rain shower one, which was great. You can only use one at a time though. One minor point, the tap over the sink was fixed so close to the edge of the basin that it was difficult not to splash water everywhere when washing your hands. Obviously everything was brand new, so very clean and in excellent condition. The health club and pool area were not open, but we had a look round and they are very nice, with some good fitness equipment. The gym looks out over the pool, which is in a garden setting and would be very relaxing to sit by or swim in. We ate two meals in the hotel's Cafe Lido and would recommend both. The first day we had the buffet lunch, which was under 100 HKD each and included a main course chosen from a menu of about half a dozen items, plus the soup, salad and dessert buffet. All the food was beautifully presented and well prepared, with freshly baked bread rolls and was good value, although the drinks were expensive - my coke cost half as much again as the meal - but there was water provided and continually refilled, so another time I would stick with that. The next day we tried the set breakfast in the same cafe, including fresh fruit, a cooked main course, toast and jams/marmalades, plus tea or coffee, which they kept filled up. I think it was around 70HKD, so not particularly cheap, but it was good and there was plenty of it. There isn't anything else around the hotel, so you are stuck with the hotel food unless you want to go the 5 minutes or so into Tsuen Wan. There are 2 free hotel shuttle buses which go on separate, circular routes at scheduled times. One goes to Tsuen Wan MTR and the Tsing Yi Airport Express stations, the other into Kowloon. Again, they were brand new. There wasn't much room for luggage, so you'd be better off getting a taxi if you had much luggage, also they are not that frequent and we needed to be at the airport before the first scheduled bus. the hotel desk ordered us a taxi to be there for 6:30 am and it was waiting for us. It was about 200 HKD, plus luggage charges of another 50, to the airport. We chose this hotel because of the early flight and it was much cheaper than the airport hotels. However, it isn't in a particularly convenient position and we spent quite a bit of time on the subway in and out of Hong Kong, which wasn't a problem for us. It's not very close to the airport though - I would guess about 30 minutes door to door and about the same into Central. I think this would be a good hotel to say in if you want to spend time relaxing at the hotel and don't mind some travelling to get to the main tourist parts of Hong Kong and we would definitely go back, at least while it is cheap and new.", "Date": "June 1, 2007"}], "HotelInfo": {"Name": "Royal View Hotel", "HotelURL": "/ShowUserReviews-g294217-d652907-Reviews-Royal_View_Hotel-Hong_Kong.html", "Price": "$90 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.353 Castle Peak Road, Tsuen Wan</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "652907", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bc/32/bc32b8f1fa0aab2b84c71d62fc39bf5f1large.jpg"}}