{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“A one and a half”", "Author": "Peter G", "ReviewID": "UR134806896", "Content": "As I'm in a reasonably good mood I'll round it up to a 2. Yes, it is 'an airport hotel', and sort of does what it says on the tin but firstly the transfer form the airport took an absolute age as they didn't seem to know who they were picking up from which terminal or when, Secondly felt like the check-in was a real chore for the people behind the desk. Third did not really enjoy walking around in the dark to find the room, and when we did I thought we'd been transported to a Pontins camp. Fourth, we had to leave early the next morning and the only thing on offer was a coffee making machine and a doughnut for breakfast, OK if you're Homer Simpson I guess. And the guy on the desk was really grumpy again. Positives - clean and quite close to the airport. Won't be rushing back there.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Mendoza, Argentina", "Title": "“Not that close”", "Author": "bj8plus", "ReviewID": "UR133761799", "Content": "From Barajas airport but Ok. If you arrive later than 9 Pm you have to call in order to ask for the schedule to pick you up, after that they show up about 15 minutes later. Not a bad experience. Clean room and bathroom and a pretty good breakfast. The staff was kind but do not expect anyone carrying your luggage or walking you to the room. No food after 9 pm except some packed sandwiches. Schedule to the airport next day on time and good service.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Plovdiv, Bulgaria", "Title": "“rather ordinary, internet did not work”", "Author": "silvy023", "ReviewID": "UR120197760", "Content": "the hotel was kind of ok, clean… but internet did not work… transfer tend to be late sometimes… i nearly missed my transatlantic flight for that reason...", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Buenos Aires", "Title": "“An airport hotel worth considering”", "Author": "cpsimons", "ReviewID": "UR119564211", "Content": "At the last minute we decided to book a room for a night, as we had a lot of time between flights. We had to pay the rack rate, but if you book at least some days in advance, you pay half as much - and then the price is right. The van picked us up at the airport - and brought us back - without much delay. The room we got was big enough, with a good bathroom - and clean. It is built like a motel, so you do not have to expect miracles. Everybody was very helpful and we got what we were looking for: rest.", "Date": "October 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Oklahoma, USA", "Title": "“Basic hotel for 1 night only”", "Author": "DarekJarmola", "ReviewID": "UR115659142", "Content": "This is a good, basic overnight accommodation near Madrid Barajas airport. Free shuttle service is provided - transfer takes about 20 minutes. This hotel has a feel of highway motel, with majority of room having no indoor hallways. Location and the layout of the hotel contributed to a lot of outside noise at all times of the night. Room is simple - no AC in mine - but clean. Bathroom and shower are clean and on a large side. Breakfast was basic and costs extra - not a good value. This is a budget hotel - and good for one night stay - yet, there are many similar hotels near the airport and I will try a new one on my next pass through Madrid. Check in and checkout were simple and business like, as was the transfer to/from the airport. As a side note, this hotel is also used by a number of airlines for their stranded passengers.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Hotel for overnights near the airport”", "Author": "PedroMelo", "ReviewID": "UR113369283", "Content": "We had to catch another flight early in the morning, and arrived in Madrid airpot late at night, and for 48 euros, free bus shuttle and hotel near the airport, SHS seemead a good Option.... The facts- there is really a free bus that picks you up (and returns) to the airport, thats efficefficient.; the hotel is about 10 minutes from the airport and there´s a parking lot if you are flying and dryving. The hotel is located next to a free-way, so expect allot of noise during the night!. It is composed by too building. We stayed in the main one, the the reception and bar is. The room and general hotel style are simple, and practical. Despite the furniture were dated and used, the rooms were clean and spacious. Overall for a couple of hours of sleep between flights, despite the noise and dated style, is a fare hotel for 48 euros (and free shuttle).", "Date": "June 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“WORST EVER - Avoid !”", "Author": "idainc", "ReviewID": "UR98618318", "Content": "I read these prior reviews and had diminished expectations. It took the van an hour to pick up at terminal 4. This is unheard of. The front desk didnt think it was an issue. This is a horrible hotel in the middle of nowhere. It is FILTHY and is poor repair. Worst ever airport hotel on all accounts !", "Date": "March 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chichester, United Kingdom", "Title": "“no sleep here!”", "Author": "jongoff", "ReviewID": "UR92289545", "Content": "booked this hotel through the hotel kiosk at madrid airport cos stranded by snow . upon arrival the staff were friendly and helpful. my room was not in the main building but in a \"block\" opposite and as previous comments have said, it does look like a row of prison cells with their metal doors!. i was pleasantly surprised when i enterd because the bathroom was nice and the bedroom was huge-although sparsely furnished, but clean. 10/10 for the bed-possibly the most comfortable hotel bed ive ever slept in...or should i say, TRIED to sleep in. I have never experienced anywhere so noisy in my life! all the rooms have wooden floors so you can hear everyone clacking about but it must be due to the construction of the building that it sounds like the people in the adjoining rooms are in your room with you, so much so that you can even hear what people next/above/below you are saying (and doing!!) in their rooms! worst night ive ever had in a hotel...youll only get to sleep here if you're a VERY heavy sleeper!", "Date": "January 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Rooms": "1", "Service": "4"}, "AuthorLocation": "", "Title": "“Booked at airport hotel reservations...”", "Author": "jerrikamison", "ReviewID": "UR64751330", "Content": "Booked at airport hotel reservations desk. Staff was friendly. Chewed up apple core in closet. Dirty bathroom floor. What seemed to be a poop stain on sheets. Shower switch was stuck. Very noisy!", "Date": "May 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "ontario canada", "Title": "“great value for sleeping but expensive food”", "Author": "cathycanuk", "ReviewID": "UR57662436", "Content": "We were looking for a cheap hotel close to the airport waiting for a flight...this hotel was an amazing deal and offered free airport shutte. The taxi driver could not find it and although we could see it from the highway, it was set in a very convoluted traffic maze surrounded by what appeared to be car lots. The place is sandwiched between industrial type buildings overlooking a busy highway, very seedy. Upon arrival we were told that our room was on the first floor...first floor being up about 20 stairs...no elevator or ramp for luggage. The room was spacious and clean. Two single beds, but we didn't mind since it was only for one night.....we were hungry and tired and looked at the room service menu....the first thing that popped out was 30 euro for a ham plate....Chicken brochette was 21 euro...so, we decided to check the restaurant...the restaurant menu showed chicken brochette for 18 euro........so, we decided to eat in the restaurant to save 3 euro....upon sitting the waiter brought a dish of olives and basket of bread to the table...I told him I don't eat olives or bread and he said that there is a 3 euro \"table\" charge and they would be included in that price....so, I ended up paying 21 euro for the entree that I could have better enjoyed in the room.... coffee was additional 4 euro... Free WIFI only.... wired internet was 5.25 euro for an hour....not impressed...I only wanted to check flight, but did not want to pay 5.25 euro for a 2 min session The end result, I would not recommend this hotel since although the room was very cheap and clean...the $ you save on the room will be spent on food and drink. Might as well spend more somewhere else that is a little less dodgey.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "west midlands", "Title": "“avoid at all costs - total rip off”", "Author": "wolvesmad", "ReviewID": "UR57092853", "Content": "i agree with previous comments entirely. this hotel should be classed as a motel as most rooms are outside of the main building in 2 storey high blocks with metal front doors which makes them look like cells. we came across this hotel (after being stranded in Madrid overnight) after using the tourist info centre at the airport who said that it was the only one available to take 4 people. the hotel charged us €125 euros for the room which we later found if we had booked on line or through a search engine would have been €40 less. this was for a standard double room and 2 extra camp beds. the food is very overpriced in the restaurant with a basic sandwich costing €6 and coffee at €2.80. they offer you a free drink to get you in there and when you ask for a free drink you can't choose what you want you can only have some kind of cheap white fizzy wine mixed with orange juice. the walls are paper thin and if you are on the ground floor you have to put up with noise coming from above which on the night we stayed was particularly noisy - so much so i went to reception to complain and to be fair they did deal with it. Internet connection is very slow but if you push them for it they will give it you for free. there are better, cheaper hotels locally we just did not know it at the time! express breakfast was served in hotel reception was €3 for a coffee and sticky bun. it does have a free shuttle bus to the airport", "Date": "February 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Switzerland", "Title": "“AVOID!!!”", "Author": "piupolino", "ReviewID": "UR46934594", "Content": "Horrible. Although the hotel was clean (or it seemed clean) it was extremely noisy (you can see everything from other rooms and outside), bad taste, TV with no reception, internet with ridiculous speed. I did not venture in the restaurant at I saw it. The only thing positive was the airport shuttle.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "DonaQuiote", "Title": "“Over priced!”", "Author": "DonaQuiote", "ReviewID": "UR37718488", "Content": "We were overcharged for our rooms and were unable to get them to acknowledge the overcharge and credit our bill. The restaurant was extremely overpriced as well. We will never stay at this hotel again!", "Date": "August 15, 2009"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "USA", "Title": "“Absolutely terrible”", "Author": "FrequentTraveller023", "ReviewID": "UR19875781", "Content": "We stayed over night between flights. It is absolutely scary in an industrial park with a high security fence around it. The rooms are in several two story dormitory or prison like buildings. The second floor rooms require a walk up an outside stair case. The room was sad at best. It had been sprayed for bugs and the smell was over whelming. The bed was one where my wife and I slept with our street clothes on. Music played loudly until about sunrise and we think we heard either firecrackers or gunfire around 4 A.M. We are not snooty and have stayed in our share of budget motels and hotels but this was a new low. We saw the restaurant but did not eat there. We wore shoes to use the bathroom and could never recommend this hotel to anyone. Although advertised as close to the airport it was a 15 minute ride in a taxi at a cost of 28 Euros. Do not stay at this place.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "san francisco", "Title": "“The Worst Hotel in All the World?”", "Author": "mtea", "ReviewID": "UR7700386", "Content": "Nobody should stay in this rickety, low-rent hotel if they can help it. Though they adverstise having wireless access, only the main building gets it, and when we asked to be moved to one of those rooms the concierge told us that even though there was in fact a room available in that building, it was being held for any return guests who had learned on their previous stay that the other buildings don't pick up the wireless signal. As if anyone would ever return to this place! The hotel interiors are sad and depressing, located in long brick buildings that resemble prisons or military baracks. We had to be moved from our first room because the bathroom window's lock was broken and the place is crawling with unsavory men. There is no information in the rooms about how to do simple things like get an outside line or locate the resteraunt. The resteraunt, however, should be avoided at all costs. The food seemed to have time traveled from 1970. The asparagus that seemd vaguely promising were plucked from jars and heaped with mayonnaise. It cost 11 Euros to eat a not particulalry tasty tomato heaped with not particulalry fresh parmesan cheese. The tiny plate of bread and cheese that the waiter brought, unasked, was not complimentary and was also overpriced. The meal was super expensive and we wound up using the bulk of it to feed the stray cats that prowl the hotel grounds. Thank god for the stray cats! They are the only nice thing about this place. Those who dislike cats may enjoy the spiders that lurk inside the room; we did not. We are cat people. Also, it appears that some rooms come with soap and some do not. Good luck!", "Date": "May 26, 2007"}], "HotelInfo": {"Name": "SHS Hotel Aeropuerto", "HotelURL": "/ShowUserReviews-g187514-d653032-Reviews-SHS_Hotel_Aeropuerto-Madrid.html", "Price": "$57 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Av. de Aragon 345</span>, <span class=\"locality\"><span property=\"v:postal-code\">28042</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "653032", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/22/cc/22ccbd24dc1ae2be07303643030ad70e5large.jpg"}}