{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Indiana", "Title": "“Best Park/Sleep/Fly EVER!”", "Author": "SeekerOfTheSun", "ReviewID": "UR125442941", "Content": "I always stay at the Microtel Inn and Suites when flying out of Indianapolis airport. The rooms are always very clean and comfortable. The entire staff is always very pleasant and helpful. Breakfast is provided. They have a restaurant/bar just beside the hotel called Kazablanka. They serve good food and it is SO convenient. Since I discovered this hotel in 2007, I've never stayed anywhere else when I fly out of Indy and I've recommended it to many of my friends and family as well.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tuscola, Illinois", "Title": "“Park et Fly great experience”", "Author": "capieillinifans", "ReviewID": "UR125184205", "Content": "Convenient location right off of rt 36; very clean facility; staff are awesome. The gentleman i spoke with when making reservation was \"very\" helpful et when we arrived everything was taken care of including notation of when we needed shuttle to airport et when we were arriving. Everyone was on time. Our flight was delayed coming home(1:00am)et i called to let them know--very nice with no problems. The driver on the return trip was great--friendly et helpful AND this is my first experience on an airport shuttle when the shuttle was actually warm et we have had many many other experiences. Thank you! We would return here without any reservation at all!!", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“First stay here, but not our last!!”", "Author": "loisthomas23", "ReviewID": "UR123678707", "Content": "If you are looking for a super ritzy hotel with a luxurious room and fluffy towels, this is not the place for you. But, if you are looking for an inexpensive, clean hotel with super nice and helpful staff, then this is where you need to stay. We had never experienced the Microtel line before, but had stayed other hotels in it's \"Family\" chain. When we arrived, we were given a coupon for the restaurant next door, which we used. Food was great, not expensive, and there was no delivery charge. They have free breakfast daily from 6a-9a that included food such as: Yogurt, biscuits and gravy, muffins, bagels and cream cheese, fruit, coffee and juice. Free Wi-Fi was also included in the stay. Rooms have a fridge and microwave. Super comfy beds! There is also a Sam's Club directly behind this hotel. We were traveling for medical treatment and have made reservations to stay again next month.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“GREAT PARK AND FLY SERVICE”", "Author": "tcamp56", "ReviewID": "UR123320005", "Content": "Nice clean room. The staff was very nice. Had a good meal reasonably priced at the restaurant located on the property. Was located less than 15 minutes from airport. Driver was on time to take us to the airport. Our arrival flight was delayed 3 hours and when I called for our pick up the staff was aware that our flight had been delayed. They sent the shuttle and we were picked up in less than 20 minutes. Great service!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Very Organized Park & Fly; Clean and Comfortable”", "Author": "KyShutterBug", "ReviewID": "UR121867237", "Content": "With airfare cheaper out of Indianapolis, hubby & I chose to take advantage of this Microtel's Park & Fly based on good reviews here on Tripadvisor. This was the most organized Park & Fly hotel we've ever stayed in. \"Joe\" asked us for our flight times during the reservation call, advising us what time we should leave the hotel to make our outgoing flight. At check in, the manager-on-duty handed us a sheet of paper with very thorough instructions for our drive to the airport the next morning, as well as directions & a contact phone # for our return trip. While we only stayed a few hours, we found our room very comfortable and (my #1 priority) CLEAN ! Also, despite the hotel's proximity to the highway, we found our room to be extremely quiet. Everyone was friendly, to boot --- from the reservation call to the front desk manager and both shuttle drivers. Upon our return from the Caribbean, we called the # on our instruction sheet and had a WARM van pick us up curbside within 15 minutes, which helped us transition to the 30 degree weather. Overall, staying at this hotel SURE beat paying $7.00 a day for parking at the airport!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, United Kingdom", "Title": "“Good Value and would stay again”", "Author": "marieanddon", "ReviewID": "UR120084535", "Content": "Very nice hotel. New looks nice from outside as well as inside. Easy to find and few minutes drive from loads of eating places. Very close for Indianapolis speedway track. Reception spacious and helpful friendly staff. Room big with 2 beds, very clean. Had fridge, microwave and TV. Free WIFI. Breakfast nice with yogurts , cereal bars, toast and muffins. Very good value Would stay again.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "West Des Moines, Iowa", "Title": "“A Bad Night's Sleep”", "Author": "Gary326", "ReviewID": "UR119846077", "Content": "This was the worst bed I ever slept on in a hotel. Thin mattress that was mushy in the middle. I only got 3 hours of sleep. Will never stay at a Microtel again.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Perfect Stay, freindly, clean, comfortable !!!”", "Author": "David S", "ReviewID": "UR119671648", "Content": "We stay for several months this summer while working in Indy, everything was perfect, from the time we checked in to checkout!!! Very clean, comfortable, & friendly, from managment to front desk & housekeeping !! The room was great, clean, roomy, microwave, frig, wet bar, lots of cable channels, even HBO. Everyone was friendly and treated us like part of the family. Would highly recommend, from a 1 night stay to an extended stay (also a nice meeting room, Miranda does a wonderful job on weddings & special events). Joe and Miranda, thank you for all you do, Anytime we needed a fax sent or anything else your staff was always nice & friendly. We truely felt like part of the family !!!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "LaGrange, Kentucky", "Title": "“Great value!”", "Author": "Srlackner", "ReviewID": "UR119570400", "Content": "We were trying to book a last minute trip to Indy on our fall break and were unaware that every room in the city was booked due to the FFA convention. Finally, another hotel recommended we call this place as they had heard they had a few remaining rooms. As soon as they said they had a room, we took it without looking at a single review. We were pleasantly surprised. The rooms were updated and clean. The window seat made a really nice out of the way place to stash luggage and we had plenty of room for two nights with two adults and three kids. The breakfast was pretty good, but closes early at 9:00. We would definitely stay here again, thank you!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cromwell, Indiana", "Title": "“Nice clean hotel.”", "Author": "Jolene63", "ReviewID": "UR118824197", "Content": "We arrived after 3:00 and room wasn't ready but that can happen even though I booked it months ahead and I guess that is even more reason it can. Kept the car for a park and stay. Got out fine the next day by shuttle to the airport. That went well even in the pouring rain. Mark and Miranda were very pleasant when we booked the room. John had breakfast ready the next morning as we had a 6:30 a.m. flight to catch. Beds were very confortable. Room was nice and clean. There was a mix up coming back a week later to pick us up, but that can happen too. Manager of hotel wrote us a nice apology letter and paid taxi to get us back to our car. I would probably stay again.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Port Saint Lucie, Florida", "Title": "“The little motel that could.”", "Author": "George_and_Veronica", "ReviewID": "UR118187562", "Content": "We are retired and traveling the US by car. We picked this motel from a coupon in the motel coupon book at the interstate rest area. This is an excellent little motel that does the job right. Room was clean, plenty of outlets for our electronic gadgets, desk, iron, micro, frig, hair dryer, toiletries, coffee, excellent lightning, and many channels to select on the TV. Breakfast was excellent. The total coupon rate with tax included was $64 and this included a free 2 topping 14 inch pizza delivered right to the room by the front desk. Not a knock off frozon pizza but a real one from the italion restaurant next door. An amazing motel offering exceptional value. Don't pass this one by. Conveniently located on the interstate near the airport.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "St. Henry,OH", "Title": "“Nice Park Sleep & Fly Package”", "Author": "emw2011St_Henry_OH", "ReviewID": "UR118038367", "Content": "Stayed here before flying out to Cancun. Very friendly staff. Gave us great directions for getting from hotel to airport. Good value. Beds were comfortable. Great location with a fun bar/restaurant with outside seating next to the hotel.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Decent for one night on a modest budget.”", "Author": "JCR12", "ReviewID": "UR116677781", "Content": "From all the previous reviews, we felt we made an excellent choice, but we were sort of disappointed. The desk clerk was busy talking with someone else the whole time I was checking in. We had asked for a non-smoking room only to find a musty, smokey stench on the floor we stayed on. The smell wasn't as bad in our room, but there was an ashtray in our room. Why, if it's a non-smoking room? The room itself was decent, but not great. Definitely doable if you want to save a buck and certain smells don't bother you.", "Date": "August 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Edwardsville, Illinois", "Title": "“A Good Value”", "Author": "JCH62", "ReviewID": "UR116470482", "Content": "Tucked into a small complex of hotels near a Sam's Club, just off I-465, and not too far from I-70. Clean and comfortable. Free wireless, but signal faded in our second-floor room at end of the hall. If you want to take advantage of the refrigerator and microwave in your room, there's a pretty good Kroger's about three miles away on Crawfordsville Rd. If not, there's a restaurant next door for which we received a coupon at check-in.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Troy, Ohio", "Title": "“Nice Place to Stay”", "Author": "mhelke", "ReviewID": "UR115940162", "Content": "I stayed at my first Microtel last year in Ann Arbor and loved it so I thought I would try another. I wasn't disappointed. For the price...you can't beat it. Friends were at another hotel close and paid twice as much but we basically had the same thing. Nice clean room, friendly staff and breakfast. We actually had more tv channels than they did! I would recommend this hotel. It's worth the stay and you can't beat the price!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Great Hotel for the Price”", "Author": "lmr6326", "ReviewID": "UR114773770", "Content": "This was one of the nicest hotels that my husband and I have stayed at. We had a coupon for a discounted rate that included a coupon for a free pizza from Godfather's. With the microwave and the fridge in the room, it made the price we paid even more worth it. The only complaint that we have is that the breakfast food was not the greatest. The biscuits for the biscuits and gravy were hard and stale. The waffles were hard and stale. And there was no attendant present to check the freshness of the food or the levels of the food, which were also low.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "villa grove illinois", "Title": "“Reasonable rates, clean, good service”", "Author": "suzyq43", "ReviewID": "UR104205884", "Content": "We have stayed here several times when flying from the Indy airport. They have a good package deal where you can leave your car and shuttle to the airport. Early breakfast for early flights and good restaurant next door for dinner the night before. Clean and comfortable.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bridgeport, WV", "Title": "“Amazing staff, good value...”", "Author": "pinkprincess03", "ReviewID": "UR103229504", "Content": "I recently traveled to Indianapolis for work and stayed at this Microtel. The staff was top notch--I was welcomed by name (which is extremely rare!) once I arrived to the hotel, had all of my questions answered, and was picked-up and dropped off to the airport in a very timely manner. The breakfast was standard, nothing fancy, but yet adequate for a quick bite to eat. The rates were very reasonable for the value received. Unfortunately, the developers of the property didn't think things through very well when they placed the fitness center on the third floor. This makes it very difficult to sleep when someone is above you running on a treadmill. The other surprise was to find half-used shampoo bottles left for me to use rather than new ones. Thankfully, the kind staff and their hospitality made up for the two shortcomings.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Elkhart, Indiana", "Title": "“Great Stay”", "Author": "confire", "ReviewID": "UR102478873", "Content": "I’ve stayed many hotels on the west side over the years but this was my first at this or any other Microtel Inn. I was in town for a conference and selected it based solely on the low rate. I will admit I had low expectations (do to the low rate) but was pleasantly surprised. The exterior and lobby were warm and inviting. Check-in took less than 2 minutes! The front desk personnel were friendly. The room was a nice size w/2 queen beds, sheets were soft and the bed slept fantastic. The bathroom was slightly above average and very clean. Another big surprise is how well lit the room was with two large lights above the bed. Wi-FI, was fast w/no password to fool with. On the negative side: rooms are not very soundproof and the Continental breakfast was extremely poor (on both days) All in all, the quality and cleanliness was well above average. I will unquestionably be staying again.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Highly recommended - nice room and good service”", "Author": "lonestar_queen", "ReviewID": "UR102459034", "Content": "I've been to several hotels in this area before, I can say that this hotel is the best ever. Front desk staff was very friendly and helpful. I arrived here around 12:45pm, I could check-in immediately. The location of this hotel might be a little bit off the beaten path. However, as someone mentioned, a restaurant is next door, and Sam's Club is right across the parking lot. CVS pharmacy and some restaurants are also walking distance. I wanted to go in Sam's Club, though I'm not US resident. I asked for the front desk person about that, she gave me a member number. So I could totally enjoy shopping! Room was nice and wide, basically clean. Only a complaint was that I found stains and someone's hair in the fridge. But the housekeepers seemed to work hard. Suttle driver was professional, I could get to the airport on time. Overall, everything was great. I think there are not so many hotels that have adequate rooms with Micro-fridge at affordable rates. I would stay here again!", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greencastle, Indiana", "Title": "“Great Value -- Great Staff!”", "Author": "TNoble", "ReviewID": "UR101140483", "Content": "A recent stay in a Hilton Hotel, made me appreciate just how much I'm getting for my money at the Microtel Inn, Indianapolis Airport. This attractive, VERY clean, and comfortable hotel rivaled and even exceeded the Hilton when it came to service and amenities, such as free WIFI in rooms, free breakfast, and affordable rooms with jacuzzi tubs. I often stay here when I have an early morning flight. They offer free airport shuttle service and recently when a (long) delayed flight made it impossible for me to return home, I made a reservation at the Microtel, not knowing exactly when I'd arrive in Indianapolis. When I called them from the Indianapolis airport, the person at the desk had been watching my flight status, knew we had landed and had already sent the van to pick me up. It was after midnight, after an 18 hour travel day and I can't tell you what a joy it was to see the Microtel driver already waiting for me. This is a great place and a more than holds its own against more expensive lodging options.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "louisville", "Title": "“All I expected”", "Author": "mharmonLouisville", "ReviewID": "UR96517849", "Content": "Stayed 1 night while in Indy for the theater. The staff was pleasant, the room and bathroom were clean, and the free breakfast was better than some. There is a restaurant connected to the hotel that is owned by the hotel and they offer room service at no extra charge. The hotel is right off I-465 but isolated. Would stay again if in that area.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norfolk, Virginia", "Title": "“Great deal for the money and perfect location if local-public transportation is preferred. Also great staff and service.”", "Author": "prisva74", "ReviewID": "UR86702592", "Content": "The great service of the Microtel staff began when we read the reviews and decided to stay at this hotel. I called the hotel to find out about public transportation in the area. I spoke to Miranda who pointed out a bus stop was diagonally across. We thought the hotel was closer because we were promptly picked-up from the airport. Dawn, the driver said she had left early base on the flight. The room was somewhat small but very clean. On our arrival day the hall way smells of smoke. We told Miranda and she said because we were across from the only smoking room on that floor but it will be taken care of. We went to dinner. When we return the smell was gone for the rest of 5 day stay. We truly enjoy our stay at the hotel and if we ever visit Indianapolis we will be stay at this hotel.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newport News, Virginia", "Title": "“Excellent Hotel with Cheap Rates”", "Author": "No_Names_Are_Leftt", "ReviewID": "UR76513368", "Content": "Me and two friends stayed here for a bachelor party for 3 nights because it had the best deal (roughly 85 bucks per night for an online prepay). The hotel exceeded our expectations. The service was high-class, prompt, and friendly. The room was exceptionally apportioned given the price. The beds were fantastic. We had to have a roll-away bed brought to our room, and amazingly, even that was of great quality. Continental breakfast was above average as well, with more food available than typical. Only real drawback was the location. It was a 15 minute drive to get to the heart of the city (and the drive was through some VERY shabby areas). And the immediate area around the hotel was lacking in terms of walkable shops, food stores, etc.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "NYC, NY", "Title": "“Short on hospitality”", "Author": "KEBnNYC", "ReviewID": "UR72714270", "Content": "We checked in late on a Friday night after an event in Indy, having called ahead that day to say we would be arriving around 11:00 pm. When we got there, the front door to the lobby was locked, and the alternative--a security window to the desk area--was vacant. Although I could see a hotel employee sitting inside the lobby, who actually looked up and stared at me through the glass doors after I knocked on them, he couldn't be bothered to get up and actually open the door. (I'm 6 months pregnant and was wearing a formal gown and high heels; it's not like I looked threatening.) Finally, the guy inside told the desk guy that someone was out there, and he came to the security window, and buzzed me in. When I was then checking in at the desk, my family attempted to bring in our bags, and was met with the same impediment. Doors to lobby locked. They were left standing out there at 11:00 pm, having to pee, and eager to get settled in...until I finished the transaction and opened the door to the lobby for them myself. So much for welcoming hospitality. We all agreed it was a terrible first impression. The room was not bad, however the shampoo & conditioner amenities in the bathroom were half-used. We took the shuttle bus to the airport the next morning, and while it arrived right at the time we had requested, be forewarned: it is not exactly a short ride to the NEW Indianapolis airport out on I-70...it's about 20-25 minutes drive. Realizing that there were plenty of other hotel options that would have been much closer, we were left questioning the \"Indianapolis Airport\" claim in this hotel's name. On the bright side: The low price was good for the quick overnight stay. The breakfast (cold muffins/danish & juice/coffee) was ready & available, even when we left at 6:30 am. The free shuttle bus got us to the airport on time. I don't think we'll be staying here again, however.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beaver Falls, Pennsylvania", "Title": "“Basic, Comfortable Accommodations Accessible to Highway”", "Author": "jsctraveler", "ReviewID": "UR72702016", "Content": "Even Microtel is getting more expensive these days (paid about $79), but my family was happy with our stay. The room was small (but that's what we expected and all we needed for a one-night stay), clean, comfortable, and quiet. The bedding showed signs of wear, but was clean. Continental breakfast was plentiful, well-presented, and adequate to our needs. Front desk staff was efficient, pleasant, and helpful.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Azle, Texas", "Title": "“Nice, Clean hotel..Good Staff”", "Author": "Mccbassist", "ReviewID": "UR71762435", "Content": "This place was well worth the money.. It's a lower/midrange priced hotel, but the quality and cleanliness was well above average. The only complait we had, were the doors are heavy, and would close very loudly, so anyone coming in late would make quite a bang if they just let the door close on it's own... I didn't bother me much, but annoyed my wife. Otherwise, a great place at a good price.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Hamilton, Ontario", "Title": "“Too much noise from floor above”", "Author": "moe2468", "ReviewID": "UR71265132", "Content": "The floors in this hotel are not at all sound proof. I'd guess that they don't have concrete floors, but rather wood floors as you heard every step taken by the people in the room above us. Breakfast was OK. Restaurant next door was nice. Desk staff very hospitable. I wouldn't stay at this chain again solely based on our experience with the noise above, even though the people were just walking around (which they did all night).", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cortez, CO", "Title": "“Convenient, Clean, Comfortable”", "Author": "southwestgirl_8", "ReviewID": "UR67799645", "Content": "Booked based on previous reviews - they were right. This is a very clean, accommodating hotel, with a very comfortable bed. We stayed due to 6am flight- close proximity to airport. Our 2nd floor room was very quiet. Check in & check out a breeze. Coffee in lounge was good. Appreciated information about restaurant next door that delivers food to rooms, but did not partake. No complaints - great value!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Midwestern Girl", "Title": "“I'd stay again tonight! Great Value”", "Author": "SashieBunnie", "ReviewID": "UR66022517", "Content": "We had 7 girls and a VERY early flight the next day. We knew we wouldn't make it in time driving from Fort Wayne, so we decided to get a couple of rooms and come down a night early after work. The included parking made it an exceptional value ... and the free breakfast that was served early enough for us to have time to enjoy it before we shuttled off to our flight! I venture to say this room was nicer than our room at NYNY in Vegas......it had a microwave and a fridge....not really necessary on an overnight stay, but still nice. There was also plenty of mirror for getting ready in the morning! Everyone was pleasant, the bathroom was clean, and the shuttle driving was early, so we could leave 15 minutes early. And even though the parking wasn't gated (it's just behind their restaurant on the same lot), ....we had no problems. Well done, I'd recommend it to my family.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ohio", "Title": "“Very pleasant surprise: clean, cheap!”", "Author": "professorroyhinkley", "ReviewID": "UR61154161", "Content": "We usually stay at Hamptons or similar, which have been steadily getting more expensive. We really just needed somewhere clean to sleep on this trip, and the cheaper the better. We tried Sleep Inn (right next door) and got a great AAA rate. I called Microtel based on their reviews here, and asked them to match, which they did. She told me they'd probably upgrade us to a 2-queen bed room... One thing to note: they have signs out front saying they will \"beat any competitor's price by $10\", which I would recommend taking care of during the reservation process. It didn't work for us, but to be fair, we had a really cheap rate. The rooms were really clean, and not really much smaller than other hotels we were used to. Our room had a fridge and microwave, which is always nice. Good: Beds were comfy enough: plenty of water pressure & hot water: temperature controls with numbers (not just \"high, med, low\"): free easy internet: really friendly staff: and the restaurant next door delivered our dinner with no delivery fee in less than 15 minutes... and it was really good! Interesting: The TV is on a slant above the bed in a really weird location... nothing wrong with that, just never seen it before. The breakfast was strictly what you would expect - the coffee wasn't good, but at least there was a free breakfast (again, a little more than what you might expect for under $60) Overall, we were really happy with this hotel and would stay again! Recommended, especially for a quick overnight visit or airport run.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fort Wayne, IN", "Title": "“Pleasantly surprised...Good choice for clean, economical airport hotel”", "Author": "BrendaFW", "ReviewID": "UR57989647", "Content": "My husband and I were pleasantly surprised at this hotel find. I am quite particular in hotel accomodations. We were searching for a clean, economial hotel offering free 24-hour airport shuttle. We found it. We stayed one night. Staff was polite; room was clean; shuttle driver was waiting for us when we were ready to leave in the morning. The breakfast looked okay, but we didn't take advantage of it. The room wasn't really large, but clean and comfortable are much more important to me for a one-night stay. Upon our return to Indy four days later, we called the shuttle driver and were picked up 15 mins later. We would use this hotel again.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southeast Missouri", "Title": "“OK for our needs”", "Author": "doctorjr", "ReviewID": "UR55313354", "Content": "We were in Indianapolis for one night for a Pacers game and stayed at the Microtel Inn and Suites. We got to town just in time for the game and left the next morning, so we basically wanted a clean, comfortable bed. The Microtel Inn and Suites fit that need, and the price was reasonable compared to the other hotels we checked out. The location was convenient to get to, and only about 5 mles from downtown. It was easy to get to downtown from the hotel. The room was clean and comfortable. We also had free wireless internet in our room and there were no problems with the connection. However, if we were going to be in Indy for more than one night, I probably wouldn't stay there again. The complimentary breakfast was pretty poor quality with very limited selection. The restaurant that was advertised as being adjacent to the hotel (and owned by the hotel) was a smoking bar / grill. When we walked in, the smoke was so thick that we immediately turned around and left. I also didn't care for the fact that the only ice machine I could find was on the 1st floor in the breakfast area. However, I think it's a good option if you're passing through and need a comfortable room, and I can also see why it would be good if you needed an airport hotel, since it offered a free shuttle to the airport.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Great deal, great hotel”", "Author": "ruralchick", "ReviewID": "UR53130293", "Content": "My husband and I stayed at this Microtel (based on the good reviews here on TripAdvisor), and used their Park and Fly system. Everything was terrific! The hotel is only 2 years old. The two gals who handle the front desk could not have been more helpful or efficient. Our room was very clean and the bed was extremely comfortable - important since we both have back/neck issues. We had dinner at the restaurant right next door (Kazablancas or something like that). Very convenient, since we were tired of being in the car. Food was fine, service was great; sit in the back to avoid the smoke from the bar. We parked our van there, and they provided excellent shuttle service to and from the Indy airport (about a ten minute ride) for less than what it costs to park long-term at the airport. There was even some of the breakfast buffet set up - and we left for the airport at 4:45 a.m.! I can't say enough nice things about this place, and I'm pretty fussy when I travel.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "IN", "Title": "“Excellent Hotel, Staff, and Service”", "Author": "BritYank", "ReviewID": "UR51521242", "Content": "We used Microtel for Park & Fly booking directly with the hotel. We stayed one night before flying, one night after and left the car there for 10 days. Booking was easy, thank you Miranda. The hotel was clean and comfortable and had everything we needed. Beds were excellent. I agree with a previous reviewer that the TV was in an awkward position but it works if you are lying down. Personnel at the hotel, restaurant (Kazablanka) and the shuttle drivers were efficient, helpful and very friendly. I would most definitely use this hotel again.", "Date": "December 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sullivan", "Title": "“Great Hotel, Great Price!”", "Author": "antrotter", "ReviewID": "UR46276441", "Content": "This hotel was very clean and neat. The staff was very friendly and helpful which was great! great value!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boston, Ma.", "Title": "“Excellent stay at an airport hotel”", "Author": "BacktoBoston", "ReviewID": "UR39106009", "Content": "I went to Indianapolis for a family wedding. I searched on the Tripadvisor site and found this hotel listed in TripAdvisor as the # 1 value- I agree with that rating. I had never stayed at a Microtel property before and was somewhat skeptical that the hotel could be good and so inexpensive. I was happily surprised. The room was large with two queen size beds, a seating chair and large bathroom and shower. The hotel is only a couple of years old and looks brand new.It is very well maintained and there was always someone cleaning and polishing. Breakfast comes with your stay and though the choices were limited- eggs, waffles and cereal-it also had biscuts and gravy- the gravy was really good. The staff was very friendly and helpful with directions. The rooms came with extra towels but getting extras was no problem. The hotel is next to a restaurant/bar- though it was not noisy I would suggest asking for a room on the opposite side of the restaurant. The hotel is centrally located- easy to get on Route 70, 465 and Rte 36. My only complaint is the ridiculous position of the giant TV- its positioned on top of a wooden closet at an awkward downward angle so that it can not be turned and viewed if you are staying on the far bed. Best viewing position- standing up next to the window. My wife used the top of the ice tray and wedged it into the stand so you can move the TV (see my pictures) Though the hotel is labeled an airport hotel, it's an extremely long 3 miles from the airport. If you are using a GPS, do not let it direct you to the airport service rd- it will lead you no where- get directions from the car rental place. There are other hotels nearby and a couple places to eat. If you are fast food junkee, just travel west on Rt 36 and within another 2 miles you will see every fast food place you can imagine (Steak & Shake, White Castle, DQ, etc)", "Date": "August 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ontario", "Title": "“There's a reason why they are ranked high!”", "Author": "basketball-traveller", "ReviewID": "UR34885926", "Content": "Travelling with a large group from Canada, when booking hotels I tend to depend on the honesty of trip advisor comments. What a pleasant surprise! Maranda and Dawn were both excellent and bent over backwards to make sure everything we asked for was done with a smile. Complimentary breakfast was great, fresh fruit, waffles, biscuits and gravy (that was new for us). Tea and coffee was a nice extra, and it really was available 24 hours. Sam's Club is a walk over the parking lot, we got complimentary day passes from the front desk. Computer and printer were available, which was really handy for printing out mapquests to the next game. Fridge & Microwave in the room was wonderful. On our last night we used the services of Kazablanka, the restaurant on the hotel grounds. Great Pizza & Wedges, they set everything up for us, it was as if we were in the restaurant. We will be back next year! Thanks Joe & Robin for making our stay so enjoyable.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "West Chester, OH", "Title": "“Served Its Purpose Well”", "Author": "WXRN", "ReviewID": "UR34880602", "Content": "We stayed here on a \"Park, Sleep, Fly\" deal where you can spend the night, take the hotel shuttle to the airport, and leave your car at the hotel. We flew out of Indianapolis to escape the high airfares in Cincinnati, and it was cheaper to stay at this hotel than to pay for the long term parking at the airport. This makes it a tremendous value. The hotel was nice, too! It is a basic hotel with large, clean rooms. We had two queen beds, but the room was not cramped. The shuttle service was very efficient. Someone called the day after I made the reservations to arrange a time for the shuttle to the airport, and on our return, the shuttle was at the airport within 15 minutes of our call. Although we left before the scheduled start of the breakfast, the staff had set out some muffins and such for us, which was appreciated. The only flaw was the air conditioner. It had been set so the fan would not run continuously to drown out the inevitable hotel noise. Therefore, the A/C would cycle on and off, quite loudly, all night long. I read that this Amana model of A/C can be controlled by the hotel, and it would be nice to allow the guests to run the fan if desired. Otherwise, this is a great place to stay if flying out of Indianapolis.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mt. Carmel, IL", "Title": "“Nice place to stay inexpensively!!”", "Author": "sdcarwile", "ReviewID": "UR32747544", "Content": "We stayed here 1 night in March 09. Rooms were very clean and nice. It was nice there was a fridge and microwave in the room and breakfast available in the morning. The only thing I had trouble with was the a/c it seems a little tricky to operate. I guess there is some kind of sensor in the room but I had trouble keeping the a/c on. Hotel workers were very nice. Free wireless internet in the rooms. I would stay here again.", "Date": "June 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Meridian, ID", "Title": "“Great Place to Stay!”", "Author": "PattyBMeridian_ID", "ReviewID": "UR30263626", "Content": "Great place to stay, very clean and neat, nice breakfast items, extremely friendly and accomodationg staff, restaurants and stores close by. Would stay here again given the opportunity!!", "Date": "May 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Other reviews don't lie...this is a wonderful place to stay!”", "Author": "tartwithcart", "ReviewID": "UR28911087", "Content": "Other reviews don't lie...this is a wonderful place to stay! Extremely clean and outstanding value with updated rooms, no polyester comforters here! Helpful front desk staff, quiet even though near the airport, although currently road construction happening out front at all hours...don't let it stop you from staying here. We discovered, since the restaurant next door is also a bar and therefore allows smoking, children are not allowed entry (the law in Indiana?), which was absolutely fine with us as the hotel front desk took our order and our food was delivered from the restaurant to the hotel...be warned...portions are large, our salads were more than enough for two! Our room included coffee maker, dorm sized fridge and microwave.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Freeport, Il", "Title": "“clean hotel”", "Author": "day52", "ReviewID": "UR26974875", "Content": "Very clean hotel with comfortable beds. The kids liked the biscuits and gravy for breakfast.", "Date": "March 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Grand Ledge, MI", "Title": "“Cleanest hotel I have ever stayed in and staff was very much accomodating”", "Author": "scents4theseason", "ReviewID": "UR24111013", "Content": "I don't believe that I have ever stayed in a nicer hotel---even the top of the line hotels do not compare to this one. Very luxurious beds were the absolute most comfortable and on top of everything you get a breakfast included. Our group took over almost the entire hotel and there was not one person that had a complaint. We will stay at this hotel every event we come to in Indianapolis. I encourage anyone to stay here---I will surely tell all my friends and family that may travel to Indianapolis for anything.", "Date": "February 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Champaign, IL", "Title": "“Loved the hotel and staff!”", "Author": "CRMJEM", "ReviewID": "UR17584731", "Content": "I booked this hotel because it had a park and stay. I had a early flight and live about 2 hours from the Indy airport. By booking the hotel, I was able to sleep at night and still get the airport on time. The cost of the hotel was around $80 and that included parking for 8 night (9 days), the hotel for one night and ride to and from the airport. I would have paid more for parking alone at the airport. The room was great. It had a little couch and kitchen area with microwave and fridge and a separate sleeping area. The staff was very friendly and helpful. They even called me ahead of time to get my flight times so they could schedule the shuttle. I would stay at the hotel next time I fly out of Indy or even if I was going to Indy for the weekend!", "Date": "July 6, 2008"}], "HotelInfo": {"Name": "Microtel Inn & Suites Indianapolis Airport", "HotelURL": "/ShowUserReviews-g37209-d653125-Reviews-Microtel_Inn_Suites_Indianapolis_Airport-Indianapolis_Indiana.html", "Price": "$65 - $109*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5815 Rockville Road</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46224</span></span> </span> </span> </address>", "HotelID": "653125", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/90/d0/90d000d076bd1c7d7edc817045bf11655large.jpg"}}