{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Great Hotel with Finest Staff !!!”", "Author": "MumbaiJay2009", "ReviewID": "UR125595740", "Content": "In spite being one of the oldest hotel in Bur Dubai area, it's still the finest , the location is simply the best, all major shopping areas, metro station, Gold souk well within walking distance, rooms are absolutely clean and so are the toilets, rooms are cleaned on daily basis and the toiletries are generously replenished , shoe polishing machine on each floor , the breakfast is Indian but simply awesome, in fact excellent , we stayed there for 7 days and everyday there was a different item, the restaurant staff were most courteous, speaking of staff, I would like to state that every single staff member of this hotel are most courteous, polite and ready to serve/help at any given time, my sincere Thanks to Mr Edward, the senior Receptionist who was not only most helpful in giving guidance but arranging our tours at a very short notice, letting us keep the room even after the check-out time, I had to send a local fax, he did it and when I asked how much, the reply was \" Oh come on Sir, it's on the house \" I mean there wont be many hotels which gives this kind of service , over all I had a wonderful experience, Ambassador exceeded my expectations", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kathmandu, Nepal", "Title": "“Great Location & Good Service”", "Author": "joe1280", "ReviewID": "UR125063721", "Content": "We stayed in this hotel for 6 nights and the best thing about this hotel is the location....its right next to the creek....near to everything you want...abra, bus terminal, metro terminal. It was very convenient for us to just walk a few steps and we get to the place we want. There is a department store (Carrefour) nearby. Its close to the heritage museum...good restos, old dubai (Diera), souqs. The room was very good, clean and up to the mark of a 3 star hotel. Room service was 24hrs....and good. The staff were very cordial and helpful. The breakfast was simple but good. The restaurant manager was very helpful and accommodating. The hotel is owned by an Indian national so expect Indian dishes. They did serve continental too. The WIFI is not free....but somehow we couldn't get connected to facebook. It also has a bar though we didn't use it... but judging from how it looks it must be good. Over all it was a pleasant experience for us.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“A GOOD LOCATION”", "Author": "apintolobo", "ReviewID": "UR121720881", "Content": "One of the oldest in Dubai. Its location is excellent as there are many shopping centres withing walking distance. Breakfast is good. Food is pretty palatable, that's if you are ordering Indian cuisine. Cleanliness and hygiene is excellent. Staff very helpful and friendly.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Bhubaneswar, India", "Title": "“Good hotel but there are better ones in town”", "Author": "BASISPRADHAN82", "ReviewID": "UR118414898", "Content": "There are so many good hotels in Dubai that even though this is good it fades in comparison. I liked the bar \"dragon....\" But the location was a bit too awkward for me. Food was good , specifically the Indian choices. The pick and drop service was very average why I am saying that I don't know but thats true. I will say good value but personnaly go for Royal Ascot instead.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Nagpur, India", "Title": "“The Best Hotel in the Best County”", "Author": "mufaddalali", "ReviewID": "UR111251060", "Content": "the Ambassador Group is very much lucky to have a Hotel at a Tourist Spot in Dubai... it is a very good and hospitalized Hotel... the Food is very much edible and delicious .. and would like kingfisher to make a trip for myself and my family to this hotel again in the same country", "Date": "June 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“Satisfactory Stay”", "Author": "Ricky_NewDelhi_India", "ReviewID": "UR106676791", "Content": "Was in this hotel for a day in October, 2005. Its location was great, close to the shopping malls and the Creek in Bur Dubai. It shares its swimming pool with another hotel next to it. The restaurant here was quite good. Though I didn't have any problem with the hotel, some of my colleagues were woken up at night with random door knocks...", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Superb Hotel - at Nice Location”", "Author": "patilprasanna2003", "ReviewID": "UR90694740", "Content": "Hotel is a Three Star Hotel but Five Star Service... I was there in hotel for 5 nights from 13th to 18 december ... Every Employee of the hotel are very co-operative and helpful.... they make us feel comfortable and guide to explore dubai... We had arranged a tour package from hotel itself it included half day city tour, desert safari with dinner, and Dow Cruise with dinner... all were good. Rooms of the hotel are very nice and clean.. i had a room with a view to Khalifa... which shins like a star at night as the khalifa has flashing lights ON at night. Room was big enough for 2 people, it had bath tub and fridge, etc etc... Rooms were kept clean by the house keeping section, Every time we were out for lunch or tour our rooms were cleaned and give a nice feeling to enter in the room. We had a Breakfast included for Free which was also nice... Staff over there was nice to serve us nice breakfast they arrange a special request from you for your breakfast... Restaurant is now a days decorated with Christmas Trees and stuff, coz its christmas time now. Hotel is located in bur dubai and in middle of city which gives us a easy access to shopping mall and Taxi and Indian Restaurant etc. etc. Shopping Mall named \"Carrefour\" is very near to hotel which is good for shopping, I prefered food from Restaurant Name \"Karachi Darbar\" which is good food joint. Even Meena Bazaar is close to buy other stuff. Theres is Bus Stop near and we can easily get Taxi in seconds from the Entrance of the Hotel. Also you take a small boat which is also near hotel to go to Diera or Gold Souk they small boats charge 1 AED to travel to other side of the creek. Soo i would say hotel is in good location which gives access to all the things and good to travel. Soo it is the One of the best hotels if you have a budget tour for Dubai...", "Date": "December 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pune, India", "Title": "“Not to be missed hotel esp for a family with small kids”", "Author": "M_Pune", "ReviewID": "UR90090862", "Content": "We stayed in Hotel Ambassador for 5 days in December,2010.We were a family of 3 including our 18 months old son.When you have kids you need special arrangments related to their food ,mainly milk. We got excellant service from the hotel staff during our stay. They are very cooperative and all are Indians especially from Maharashtra,Marathi speaking. They helped us a lot in catering our child food habits. The location of the hotel is also very convenient and centrally located. We will strongly advice to stay in this hotel. Though it is not vey luxurious,it has all the essential amenities.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Helens UK", "Title": "“Good, clean and central.”", "Author": "pbyrnes1", "ReviewID": "UR57065057", "Content": "Stayed in this Hotel and found it to be good value and close to the creek and Al Fahidi street so great for bargains. The wine list is limited but it is a muslim country. All the staff are freindly and helpful.", "Date": "February 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Half-decent on room rates situated in the old town”", "Author": "thewaterboy", "ReviewID": "UR53465833", "Content": "One of Dubai's first large hotels which has seen better days in the 70s. It does have a half decent British pub which has the Premiership games, a pool table, lager at decent rates & a wonderful spicy chicken dish. The rooms were alright, room service was laboured, and though breakfast was on the house, they took ages with the preparation of simple Brit fare. I was also told off by the staff for pre-ordering before coming down to the restaurant?!!! Its situated in the bustling old part of the city - Bur Dubai, a stone's throw from the nearby arbra / dhow crossing and hence is not too bad w.r.t. location. There are far far better hotels in Dubai, but this made for decent value for money for those doing business on a tight budget.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bangalore", "Title": "“Decent, Average Place in nice location”", "Author": "vkg1974", "ReviewID": "UR29457592", "Content": "This is a old hotel (has been around since 1950's) and the room / furnishings are average - becoming a bit old now and require changing. Internet didn't work and had to come to one of their office rooms for the same - couldnt access it even there.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "bombay", "Title": "“Value for Money”", "Author": "mawphlang", "ReviewID": "UR29180705", "Content": "Great value for money. The rooms arevery clean if unpretentious. The restaurant has a limited menu but the vareity is good enough and the helpings are generous. Good ,attentive service.", "Date": "May 2, 2009"}], "HotelInfo": {"Name": "Ambassador Hotel", "HotelURL": "/ShowUserReviews-g295424-d653849-Reviews-Ambassador_Hotel-Dubai.html", "Price": "$75 - $75*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Al Falah Street</span> | <span class=\"extended-address\">P.O. Box 3226</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "653849", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/58/86/5886a101a42fdf4c84d400cdfb5178972large.jpg"}}