{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wolverhampton", "Title": "“Value For Money Stay - Poor Transportation service”", "Author": "nlhm111", "ReviewID": "UR127828107", "Content": "We stayed at this hotel for 3 nights whilst visiting the parks in Orlando. Got a great deal on Netflights. I agree with other reviews that say this hotel is somewhat dated and needs a refurb. The room was clean but hallways were tired and carpets worn. Good facilities including free wi fi. We ate in the main resturant twice and the food was ok. The Deli provides good value for money snacks and beverages. We used the pool one of which was heated One thing i really must complain about is the so called transportation to Universal Studios/Seaworld.The hotel offerred one bus to Universal, the same one also stopping at Seaworld the morning journey on the bus was very cramped and uncomfortable cramming people into every gap available, not good for a 20 min+ journey. The return journey was even worse with what i would consider to be an illegal overcrowding to the point that the rear suspension on the transport failed after leaving Seaworld leaving us on the side of the road for 40 minutes whilst a new bus was sought. The security staff at Seaworld commented that it was extremley overloaded. and the police were also called to the incident, not good when you have two young children and 90 degree heat. I appreciate the transport is complimentary but the hotel has a duty of care to its guests when offering services, guests also commented that the buses were crammed the previous day as well. I would be interested to hear what the Raddison did to address this as it was raised as an issue with the management upon our return to the hotel. Overall hotel was fine for a few nights but i would not stay there again if looking to use park shuttle facilities", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“NOt a long term saty but you cannot beat the rates”", "Author": "WolfTravler", "ReviewID": "UR126101170", "Content": "The accessibility to Disney property, and the US 192 attractions make this an OK stay. The place is dated to say the least and you have all of 5 channels on tv that are not Tourist information. The A/C works well and the water is hot for showers. The food on site is pricey, however this area is LOADED with food choices. There are shuttle services that run to the parks as well. PLEASE NOTE YOUR ROUTE as they serve many hotels and you do not want to wind upon the wrong side of town. Parking is enough and large groups do stay there. Pool and rooms are clean if a bit dated.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "St. Thomas", "Title": "“Ok for price”", "Author": "Danny101304", "ReviewID": "UR123351446", "Content": "It wasnt something you want to spend a honey moon in but just to crash the night after so much driving in the day it was good . Might need some updating though .", "Date": "January 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Yuma, Arizona", "Title": "“horrrible made me and my mom sick for 2 weeks!!”", "Author": "arizonagirl88_11", "ReviewID": "UR120752392", "Content": "when we first got to the hotel we went in to the lobby it looked nice they also offerd a bus to disney world but it was only once a day!!! they had a cute little market we were going to get some ice cream until we saw bugs in one of the containers! then we got to our room it looked nice but it smelled like mold the air vent was extremely noisy and our sheets were hardly changed we were there for 2 weeks we also went to the pool which looks nothing like the photo and it was not heated at all a week into our stay we got a really bad cold which was probably do to the all the mold and the fact the room was almost never cleaned! avoid staying here if possible!!!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brentwood, California", "Title": "“Don't stay here”", "Author": "KathleenF83", "ReviewID": "UR118829176", "Content": "Our room was disgusting. Our carpet was duck taped to the wall. A picture frame had broken glass with a screw sticking out to hold the frame together. Hair found in the bed. The halls were dark and smelled like mold. It was part of our vacation package. We immediately checked out and went to the Marriot down the street.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Terrible rooms smell horrible, musty, moldy”", "Author": "tracyfrogger", "ReviewID": "UR116067031", "Content": "Rip u off and charge excessive fees on top of resort fees on everything u buy. Housekeeping walked right in my room without knocking. Filthy carpet. Activities are lame and few. Took over thirty minutes for front desk to answer calls. Hot tub nasty black film. Pictures on website deceive. Mandolin restraunt buffet sucks food cold and bland", "Date": "July 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cary, North Carolina", "Title": "“Horrible Stay.....From start to end”", "Author": "BJST", "ReviewID": "UR107752603", "Content": "Where to start......what to write??? Its definitely gonna be long. Phewww I planned my trip to Disney in December and surely I didn't plan in advance so I had not many options. When I started to explore all the websites to book a decent budget hotel and unfortunately I didn't have many options. I read all the bad reviews but still I was positive that its from the Ramada Group and should have some basic facilities with professional staff. Boy.....I was wrong. The most horrible thing which I experienced were the staff (horrible attitude, liars, unprofessional, and some of the housekeeping had difficulty understanding English) After booking online I called them well in advance and asked if I can request for microwave and refrigerator since I need them badly b'coz I was travelling with a small kid (they don't have them in room and they provide @$5 each per night) and got the response from their staff that you don't need to worry and we have them in plenty so not a problem. I trusted them and not even carried my small microwave with me in my car. When I reached there around 8:00 pm I was told \"no refrigerator and microwave available\" and when I told them I spoke to a lady and she told me it would be available and then immediately that guy asked what was the name of that person and I was shocked to see their attitude. Our trip was spoiled at that particular moment. When we entered in the room, the room was bit smelly so I switched on the AC. That was working fine luckily :) Then we switched on our laptop but realized that we are not able to get the internet connection. We tried to call the front desk....no body picked up the phone so my husband went personally to the front desk twice if they can do something for the internet connection. Not much help except the password they provided. Any ways we were without internet for 4 days there. Luckily we had our GPS and we didn't have any problem finding the desired destination. My husband went to nearest walmart to buy a small microwave so our daughter can have some food and milk. When I put my daughter in bed I realized that the bed sheets has not been changed and their so called blanket which they provided were smelly and had plenty of hair. I felt like crying and returning back home. I called their housekeeping and asked them to explain and to change. But they said they don't have any more blanket....they will be getting them tomorrow. They can provide some extra sheets. She changed the bedsheets and gave 2 extra white bedsheets instead blanket. I got the room where I had no bath tub. I thought They don't have bathtub in any room. But next day when I came out of my room to ask the housekeeping to vacuum my room, I found out the next door room had bathtub and I was so pissed. I called them to ask why they didn't give me room with bathtub when they also know that we are travelling with a kid and how am I suppose to give her bath in shower. She was so scared. Same answer......You should have requested. Bathroom was so dirty that when I switched on the shower the hot water and mold on the shower curtain created some kind of toxic smell. We were only provided 1 bath towel initially and I can't explain the size of the bath towel. It was so short. One funny thing I want to share with you...when we reached there we felt a big sticky spot near the staircase (may be Pepsi or some spill) and they didn't clean that for next four days. it was so sticky and just next ro the staircase....no one could miss, how come they ignored?? Hotel construction is old.... expectable. But this kind of attitude.....unimaginable The hotel was dirty, filthy, rude, irresponsibly lazy staff, spider webs........etc By this second day....I started to get used to their attitude and expected nothing at all from them and with a different attitude headed for Disney and returned back only at 12:00 pm just to sleep. But I had great experience in Disney.....I wish I would have stayed in some other decent hotel.....this trip would have been WOW", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Florida, Florida", "Title": "“I Don't Agree with All the Negative Reviews”", "Author": "yvonne_and_gus", "ReviewID": "UR107731462", "Content": "My husband and I were in town for a dog show. It was being held at the convention center, so naturally all the dog show people were staying at the hotel. I made my reservation without checking the reviews. When we started the drive from Miami to Orlando, I took the time to check out all the reviews on Trip Advisor and almost canceled my reservation because I was so discouraged by all the negative comments/reviews that had been posted. I called the hotel and spoke with Penny at the front desk. I explained to her my concerns and she assured me that we would not experience any issues during our stay. Traveling with very large show dogs is not easy, so I trusted her assurances and arrived at the hotel. I had reserved a VIP King Suite and when I arrived the room was ready for check in. It was huge. 1200+ square feet with kitchenette, dining room, living room, 2 full bathrooms and a bedroom. The room was impeccable. Very clean, very well kept. I am a hotel snob and I felt that the reviews in no way fairly represented my stay at this hotel. I was there for 3 nights and aside from 1 little hiccup - that was promptly taken care of - our stay was perfect. Everyone was courteous. The lobby bar was great for having a beer or glass of wine before heading out. The hotel is located in an area that is full of restaurants extremely close and there was ample parking on the grounds. I highly recommend this hotel and suggest that if you are concerned about staying here because of the reviews - call first, speak with Penny or Joe the manager - and give them a chance to prove the reviews wrong. The manager even walked me out to my car at check out. Nice guy. No complaints, folks, and this comes from a snooty hotel goer.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New Brighton, Pennsylvania", "Title": "“Beware! ( Dirty, Outdated, Broken & Moldy )”", "Author": "Whitepines2", "ReviewID": "UR106822429", "Content": "Spent 4 nights with my 11 year old son, who was participating in a National Tournament being held in the property's convention center. The entire place was dirty. Hallway carpeting was never vacuumed during our stay and was covered with crumbs and debris. In the room, the shower curtain smelled of mold and I never had a wash cloth for our entire stay and hand towels for only one day, even after several requests. Also three of the lighting fixtures in the room didn't work. With my son occupied most of the day, I spent most of my time with other parents by the pool. There were a total of 10 pool towels stocked during my 4 day stay. We had to walk a mile to buy our own. The pool area also had weeds growing through the pavers and it was obvious that the pool hadn't been cleaned in weeks. Don't plan on using the \"spa\" as it's been filled in with dirt and the stump of a dead palm tree occupies it now. It was a stay I will never forget....but for all the wrong reasons!", "Date": "May 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Eustis, Florida", "Title": "“Disasterous stay very disgusted.”", "Author": "captngator", "ReviewID": "UR104666890", "Content": "Arrived on Friday April 15 th for a one night stay so that I could enjoy an air balloon ride out of lobby area early saturday morning. Got into room and very outdated with musty and moldy smell. After further inspection bathroom shower area had lots of mold and mildew, paint discolored as if mold was prevalent and I was up coughing and sneezing most of night. Walked outside and it subsided must have been in room. Also rowdy guests in our building. Next morning during Air balloon meeting in restaurant area there were ants all over table and I even took photographs. Wow what a MAJOR dissappointment. Oh I forgot they charge a $10.00 resort fee, don't mind paying if you receive something from it but it was just an an additional profit center to make rates look good.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Jackson, Wyoming", "Title": "“Not top of the line”", "Author": "violetsunstar", "ReviewID": "UR103524857", "Content": "We booked this hotel through a package deal from a caribean cruise line offer so we did not have a choice on the hotel unfortunately. The hotel itself is run down, one of the elevators was broken and it was a major traffic jam with no end in sight, the hot tub was very disgusting with little to no maintenance and we purchased a meal plan with our accomidations which was not worth the money because the buffet was aweful and the service not so great! The bar tender at the hotel was very awesome though and did brighten the place up a bit. All in all not worth your time and money.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Average hotel, value for money”", "Author": "bryan75", "ReviewID": "UR102354455", "Content": "We stayed at this hotel for two days. The main entrance and lobby area are maintained well. However, the rooms section is not given much attention. Area surrounding the rooms requires maintenance. Since the corridors are open, dry leaves from trees are blown in, and are not swept and tidied up. Rooms are good and have two queen beds. Hotel amenities such as swimming pool, tennis court, billiards, business centre, ect. are good. Restaurants serve good food. Overall, value for money.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Cannot fault the hotel whatsoever - great value and great staff”", "Author": "T_Cronin1888", "ReviewID": "UR99488639", "Content": "Looking around Orlando at short notice, it quickly became apparent just how expensive hotels can be. However, at almost half the cost of some of the bigger well-known hotels, the service and comfort is far from half of what you might expect. I traveled alone and needed a clean and comfortable hotel. This is exactly what I got. I didn't use the pool there nor the other facilities, but the shop had everything I wanted, the breakfasts were superb and portions for evening meals generous. Maria was excellent in Reception, helping me with any questions I had (I didn't know the city very well) the room was clean and comfortable and in terms of value for money, I just cannot fault this hotel.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Spring Hill, Florida", "Title": "“Please read this review.”", "Author": "lovekeeneygirl", "ReviewID": "UR99182076", "Content": "Having just arrived back tonight I did not want a moment to go by without writing this review. We only live an hour and a half away. We go to Orlando on a regular basis as we have season passes. We are always looking for a good deal so that we don't have to drive home tired. I thought this was an amazing deal. I booked through Travelocity's hot deal category. The name of the hotel is kept secret. It was only $25. You get what you pay for goes with this review. This hotel was formally a Ramada hotel. This is no longer the case. The lobby and internet pictures were very deceiving. At first glance it looked very nice. The room had two double beds. My husband described sleeping on it like \"sleeping on a saltine cracker.\" The carpets were dirty. The walls were dirty. There were no bathtubs. They only gave you two towels ... we had to ask for more, and the light fixtures did not work. Now on to customer service, we called ahead of time to see if the reviews we read were true ... \"Michelle\" assured us that things have been taken care of and not to worry. We got there only to find no lighting, two towels, and when we went to call the front desk the phone did not work. My husband went to the front office to get more towels and let them know about the phone. They young man with slicked back hair didn't even know where to find towels. And now that we are safely home we are still waiting for them to fix the lighting and the phone. Now on to the \"You get what you paid for phrase.\" Listen folks, if you bring your own bleach, comet, blankets, sheets, towels, garbage bags, tissues, toilet paper, microwave, and cooler you will be good to go. If you don't have small children that crawl on the floor you will be fine as long as you wear shower shoes. If you want security you can waive to the gate house where there was no one attending. They charge you a resort fee, do not pay this. Please refuse. There is no security and no transportation. When asked about transportation they said \"we are working on it .... kind of like how they are still working on our phone and lights. You could tell that it used to be a nice place. The economy has taken its toll on this place and now looks like something out of Deliverance.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“No longer a Ramada.”", "Author": "TradeshowMagician", "ReviewID": "UR98750296", "Content": "The hotel/motel is no longer part of the Ramada chain. This property was once a great destination. But, with the reccesion and competition it has past it's prime. I would be surprised if it stays open past this year. I paid only $39 per night via kyak and the room was clean. If I paid $79 per night I would expect better. No real complaints, just the feeling of a hotel on it's last legs. Half the resort is shut-down and un-used.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“FILTHY! DISGUSTING! WORST HOTEL IN ORLANDO!! DON'T STAY THERE!!”", "Author": "coolbreeze057", "ReviewID": "UR98111241", "Content": "I booked a weekend get away and decided to stay at this hotel because it was close to Disney..BIG MISTAKE! When you enter the lobby, you think, well average place, no frills! Check In was horrible, the clerk smelled of cigratte smoke, was very rude & abrupt. Our rooms were literally about a 1/4 mile from reception. The hotel had no bellman to assist we luggage. When we finally located our room...SURPRISE, we had a welcome party at our door...DEAD ROACHES!!!. Our room was filthy & Dirty. I appeared they had not cleaned since the last guest checked out. The sheets were dirty and stained...they had no blankets or comforter. The rooms smelled old and musty. There was used soap in the shower stall and counter. The shower stall was dirty and was full of mildew and mold. Hair all over the bathroom floor. It was very late when we checked in, so against our better judgement we decided to spend the night. We had not Towels or wash rags, so we decided to call Housekeeping to get some...Well, after about 15 minutes we got through to the front desk, only to be told they are out of towel....WAS THIS A JOKE!!!! A HOTEL OUT OF TOWELS AND WASH RAGS!! We did not sleep that night because we did not want to lie in the bed for fear of bed bugs. We decided that night that this would be our first and last night. When we went to the front desk to complain, The Front Desk Manager was not very apologetic, she apologize but you could tell, it was not genuine. You could get better accommodation and service at a SHELTER. This certainly was not work the $79.00 that we paid. DO NOT STAY AT THIS HOTEL!!!! DON'T BE TAKEN IN BY THE PICTURES ON THE WEB!!! THIS HOTEL IS NASTY! THE GROUNDS ARE OVERGROWN AND LOOK LIKE A DUMPSITE! ...RAMADA REMOVE YOUR NAME FROM THIS DUMP OF A PLACE!!", "Date": "February 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Worst hotel ever, under a bridge you get the same service”", "Author": "TelmaFregeIssa", "ReviewID": "UR93535470", "Content": "People were rude, rooms dirty (sheets with stains, bathroom full of bugs, hair and used razors). At first we thought someone was still using the room. We found used items in the room and bathroom (razors, food). We asked front desk to clean the room and they didn't. Not only that, they yelled at me when I complained. The guy at front desk told me in a very rude tone that he doesn't clean bathrooms and there was nothing he could do, and hang up the phone. He didn't answer my next calls. I've been filling complaints about the place but management hasn't replied or done anything. AVOID AVOID AVOID. It was a waste of money!!!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“This is the worst hotel I have ever stayed in. Do NOT stay here.”", "Author": "happyabby89", "ReviewID": "UR92228886", "Content": "As the title says, this was the worst hotel stay I have ever had. Every day my friends and I had problems. The safes that their website says are included in every room do not work well. Ours was missing its \"activation key\". It took 4 hours, 4 phone calls to the front desk, and a trip to the front desk to get it resolved. During those calls we were not offered any compensation and told that we were \"just unlucky\" with our safe and were out of luck. Every day, the housekeeping came and took our towels. Some days they replaced them, some not. Some days they took all but one of the dirty towels and gave us no clean towels. There were 3 people in our room, which they knew. I had something stolen from the room one day. Another day, only one of the beds was made. I'm fully capable of making a bed, but it had better be done for me if I have to pay for it. The hotel also says that certain blocks of rooms are pet free. Too bad the housekeeping people bring a dog into every room while they clean. Very unprofessional. When we checked in, we asked if breakfast was included. We were told \"just the coffee behind you\" in the lobby. Upon checkout when we complained about all of the problems we encountered, the woman attempting to help us asked \"Did you at least get your breakfast vouchers?\". No. We did not. Apparently we were supposed to get breakfast for free EVERY DAY. We (3 people) had to buy our own breakfast for 6 days. The person who checked us in lied. Costing us, collectively, about $150. The pool is full of bird poop, as another complaining guest said, \"you couldn't pay me to swim in that pool\". The \"high speed\" internet is very very slow. Also, we were told that they have just enough blankets for each bed. There are no extra blankets. Better bring your own! I'll put an end to my complaining now, but just know what you are getting into. The employees at the front desk are reasonably polite, but do not offer any compensation. All they do is make excuses for all the problems. Any amount you might save in hotel costs are probably not going to seem worthwhile after your frustrating stay here.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“theft+dirty+rudeness=worst hotel stay ever”", "Author": "CBSChicag0", "ReviewID": "UR92106422", "Content": "To begin, only 2 of the 10 people at the front dest had any customer service skills. The hot tubs were turned into planters. The \"heated\" pools were freezing and 2 of the 3 pools were filled with bird feces. I asked for them to be cleaned and to turn the heaters on, They did neither. I had a pack of cigarettes and money stolen from my room. The money was returned once I spoke with the manager but never was an appology given or expressed. The t.v. was broken in one of my rooms and we were told to unplug it since it would not shut off or change channels. The rooms were aged and stinky. This was my 3rd stay in Orlando. Most disappointing place I could have imagined!!!!!", "Date": "January 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Good Rate - No Frills”", "Author": "all4ofus2disney", "ReviewID": "UR91565928", "Content": "We checked in after dark and I have to admit I was a little worried looking at this hotel from the parking lot. The lobby was huge and beautiful. The room we had was very basic but clean. The bathroom was spotless. The shower stall (no tub) was clean. That was my only requirement...cleanliness. The pool that was located in our \"pod\" was warm and crystal clear. My kids would have swam all day (and saved me a bunch of money on Disney!) if I would have let them. This hotel has an excellent location to Disney...less than 5 minutes. I don't know about the other travelers and their problems but luckily I didn't run into any of their issues at all. My two complaints were that the business center was too expensive and nothing worked. Called the help desk and no one ever came and the hotel charges a \"resort fee\" (all hotels in the area do) but they really don't provide any amenities (no microwave, no fridge, etc).", "Date": "January 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Toronto", "Title": "“Awful-Definitely NOT recommended”", "Author": "analisa272001", "ReviewID": "UR91132653", "Content": "My boyfriend and my family were to stay at the Ramada for two nights. The room was smelly, stuffy, the chair had a big stain, the water in the bathtub did not drain. I took a shower with the water up to my knees. The phone cord did not fit into the jack properly and above all the biggest upset, disappointment was the bed bug found in our bed. Once the manager on duty was notified about all our concerns on Christmas eve she was rude, defensive and unprofessional. She did absolutely nothing to rectify the situation or to accommodate us in anyway. Needless to say we checked out immediately. I would not recommend this Ramada for anyone looking to have a nice comfortable, clean stay.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Fort Mill, South Carolina", "Title": "“Didn't expect much. Got less than that!\"”", "Author": "Jabbo87", "ReviewID": "UR89345071", "Content": "Booked this through Travelocity's Top Secret Hotel Deals. $15/night for a 3-star hotel, how could we go wrong? Where do I start? First of all, it is NOT $15/night. They charge you a ridiculous $10/day \"resort fee\" which is supposed to include bottled water in the room and a newspaper. We got neither. What we did get was a VERY run-down room with disgustingly dirty hallways and bathroom. The hallway reeked of cigarette smoke, even though there is a ban on indoor smoking in Fla. We travel quite a bit as a family, and rarely find a reason to complain. Our motto has always been, \"hey, we are together, let's just enjoy ourselves\". We couldn't quite come up with that much enthusiasm for this place. Bottom line, there are simply too many options in the Kissimmee/Lake Buena Vista area to stay at a place this bad. Don't let the exterior fool you when you drive up (it actually looked pretty nice). The place is a dump. Period. I would go so far as to ask Travelocity to remove this property from it's Top Secret Hotel list. It is not worthy of their promotion, or your time and money.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Coquitlam, Canada", "Title": "“Had my room broken into Ramada kept the insurance money”", "Author": "Feez", "ReviewID": "UR88654122", "Content": "The hotel was nice and the food was good. Unfortunatly I had my room broken into and although I did a police report and an insurance claim was filed I never did recieve the money. Pretty sure they kept it. Sent an e-mail to the entire managment team and cannot get a response. I'm not sure but it would seem like an inside job. I wouldn't stay there or if you have to for a meeting don't leave anything in your room.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Burnham-on-Crouch, United Kingdom", "Title": "“Disgusting”", "Author": "joymargaret", "ReviewID": "UR88525261", "Content": "Not to be recommended. Yellow Water - Blocked Toilets - Smelly Room with No natural Light - Dark & Dingy with Neon sign shining through window - Day & Night, Noisy - In need of pulling down", "Date": "November 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Good Location....”", "Author": "ndmjax78", "ReviewID": "UR87095904", "Content": "I would say be wary of this hotel. Like what others have said, this hotel really needs a major renovation. The grounds need severe upkeep, the hotel rooms are very antiquated, and also very poorly kept. The benefit is you have a balcony and it's proximity to Disney; however, it is not within walking distance of any good fast food areas. The bad thing is they have a club event go on Saturdays, so it then turns a little sleezy while the club is going on. My advice is to ask to stay as far away from the club as possible. This is a decent hotel, and the price on Hotwire is usually 30 dollars, so if Hotwire puts us there, we know to ask for a room far away from the convention center.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“INFESTED WITH BED BUGS”", "Author": "concernedtraveler005", "ReviewID": "UR85994405", "Content": "Beware of this place!!! never in my life have I encountered such a place. At first we thought it was a real bargain. The place looked nice from the outside. However the room wer were given looked dirty & Dingy. TH carpet was old and looked like it could use a cleaning. But we for the price why complain. I later noticed little black Bugs in the bathroom (That dhould have been a red flag) Early in the morning I woke with what I thought were Mosquito bites (They itched liked crazy) Made My Vacation A Living hell!, This happened every night. even thought I couldn't find any evidence of Mosquitos in the room. It dawned on me later that they might be bed bugs & sure enough the stories matched mine. Upon arriving back home I decided to isolate any belongings that were in the hotel room with us.I found litllte bugs in the trunk and still find them there to this day (even though I have cleaned over 20 times) I cannot use my trunk anymore thanks to this establishment. Do not put your family through this torture and stay elsewhere. I would have rather paid the extra than deal with this crap!", "Date": "November 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portugal", "Title": "“Needs major overhauling”", "Author": "nmontenegro", "ReviewID": "UR85980893", "Content": "This resort is outdated and was without use for a long time since the Hyatt dropped it from its ranks. It has major potential due to its location (within a stone's throw from Disney Sports Complex), however the investment has not been made to better the facilities and it shows. The staff does its best, but the infrastructures are poor. Due to rain, there was water leaking in the main area, where the nice restaurant is located. The gym had all its machines broken and the water provided wasn't potable to drink. The rooms albeit spacious, have entry ways that are not clean. The housekeeping left my room door open after cleaning and after a day away, I was lucky that no one entered the room. The pool areas were very nice and quiet, but without any shade.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mackinac Island, Michigan", "Title": "“WHAT A DIVE! STAY AWAY!!!!!!!”", "Author": "notafussygal", "ReviewID": "UR85839440", "Content": "My first trip to Florida and I end up in the dive from hell! We arrived at the hotel and the lobby was very clean and pretty, I thought yup it's just like the website. WRONG! We were given our room key with a \"here is your key and your room is over here\", we went to our room and my first clue should have been the food on the floor in the hallway, upon entering our room the air conditioner was so loud you could hardly hear your self think, it smelled funny and to top it off there were some kind of big dead bugs on the floor! We took our suitcases back out to the car and weent back to the front desk and asked for a different room, when I explined what the problem was the girl never said anything she just gave me a new room key and told me where the room was, no sorrry no nothing. Well room number two wasn't a whole lot better, but at least it didn't smell and the air conditioner wasn't as loud but it was just the begining of a stay at this dump. The bathroom had mold groing in the shower (no bathtub), the soaps looked as though they had been rolling around in a box for years, the shampoo may have been left by previous guests or just plain refilled. Had a king size bed with unfitted sheets that barely fit the bed, and two blankets that barely fit the bed as well. We didn't get any sleep at all because the walls were so thin you could hear everything in the room next door and across the hall, baby crying all night next door and a tv blasting across the hall all night. We thought we would go take a swim but after looking at the pool I figured this was not a good idea, there was something black growing on the edge of the pool and the bottom was filthy, it had bad written all over it. The business center is joke! what hotel charges you .25 cents minute to use a computer? To add insult to injury when trying to print our airplane boarding passes wee had to pay .75 cents a page to print them and the printer didn't work correctly and had to TRY to get someone down there to fix it and of course cost more money becuse the clock was ticking on the on the minutes purchased to use there computer. Bottom line this place is a dive, dirty, paint peeling off the walls and just plain unfriendly. I could have changed hotels but I was on a budget and didn't have the extra money to do so. My advice stay away from this place, it's pretty bad when you end up in a dive and really don't feel safe while you are on vacation. '", "Date": "November 3, 2010"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“This can't be the same place I saw on the internet!”", "Author": "tpdisneymom1", "ReviewID": "UR84499888", "Content": "Stay away from this place. The website said it had lush tropical views from your patio.I only had a block of weeds outside my sliding door. The description said upgraded linens. I had a double mattress pad on a king bed. They advertised a shuttle to all the Disney parks when in reality there was a bus that came once a day to take you to three of the parks. You had to use Disney's buses if you wanted to go to Animal Kingdom and if you needed to go any time but the one listed, you were out of luck. If you need a cheap place to stay that is a few miles from the parks and you have a car, then this is OK. It is by no means a resort. The manager was very appreciative about my bringing the problems to her attention but it seems like there is little she can do to change things.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“BLACK MOLD all OVER bathroom...GAVE us an OCCUPIED ROOM!”", "Author": "MS3998", "ReviewID": "UR82109765", "Content": "This hotel was bad from the start. After we checked in we went to go check out our room...and unknown to us it was ALREADY OCCUPIED..had two double beds...( we asked for a king) and the peoples belongings everywhere. We were very upset, what kind of security is this? When we reported it to the front desk she said oh this is a complete mistake Im so sorry and the manager gave us coupons for a \"continental breakfast\" ( Funny they are suppose to be free) So we get our actual correct room and when we go inside..its awful..the wall paper was peeling off...the lamps didnt have working bulbs...the ottoman had ciggeret burns on it ( room said non smoking) and then to top it off...BLACK mold ALL OVER THE BATHROOM! The next morning when we went to breakfast we were told that our coupons were only for muffins, bagels and cereal..are you kidding me? So went back to front desk and they pulled the our mistake again heres the hot breakfast cards.. the cafe staff was rude and ignored other guests who had been waiting ten minutes just to pay for their breakfast! We grew impatient and just sat ourselfs..while they cleared tables and chit chatted. I will never stay at a Ramada again..this hotel was anything BUT a resort...it was disgusting.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Good room, great value and pool, amazing convenience.”", "Author": "secondgrademom", "ReviewID": "UR81458750", "Content": "Let me first tell you our travel style.....We like to travel but have to be wary of the budget. We've stayed at luxury resorts but most often find ourselves in a name brand value hotel to save the $$ for fun. That being said, we\"ve been burned by \"deals\" on Expedia for rooms in this category sight unseen. We made a list of some options and went to FL with no reservations. After arriving on 192 we checked out some of the options. We also used the Unofficial Guide to Disney's list of Top 30 hotel values. That is how we arrived at the Ramada. Ironically we have driven by it a hundred times before and never gave it a second thought. The Expedia rate was $37 and the walk in rate was $38. Expedia also offered free breakfast every day as a bonus. Before booking we asked to see the room we would be aasigned if we stayed. Good thing to ask because they want you to stay so will show you a good room. We took the room but opted for the walk in rate rather than Expedia to avoid the 2 hour lag of processing the reservation online. Here is what we got: The property was deserted for such a large property. Most people were off to the parks and there were a few small conferences being held there. The lobby and common areas were very clean and the staff friendly. They even delivered a fridge and microwave (spotlessly clean) to our room at no extra charge. We arrived at our room through an interior hallway. The room was roomy and very clean. It was in a non smoking building. The ac worked well. There were not enough towels for 4 but the housekeeping staff just gave us a stack of more towels. There was shampoo, soap, tissues, mouthwash and body lotion on the sink along with tissues and extra toilet paper. The beds were comfortable(pillows and mattresses on the soft side) and came with no gross bedcover. There were soft sheets and a cotton blanket. Again, everything was very clean. Behind furniture and under things were also clean. The room also had ample lighting and closet/drawer space for a family of 4. The table and chairs were great for eating meals and working on the laptop (free wifi). The bathroom was also clean and consisted of a separate vanity/dressing area and then the bath/shower. There was no tub, only a stall shower. There was a spot of rust on the bottom of the door frame where the shower must leak out if the curtain is not closed. there were also a few spots on the towel bar (pea sized spots). After unpacking we headed out to the pool. It was clean, neat and had plenty of seating/lounges. The lounge chairs under the trees were not as clean as the ones not under the trees. The pool and deck were maintained well. The pool had a deep section as well as stairs and a railing to enter the shallow end. There was a lip all around the pool. Towels were provided at the pool. Check out was easy. Taxes and resort fees added $12 to the $38 room rate; typical at most of the hotels. It was still a great value. One of the best parts was the ultra convenience of being on 192 near everything. If you don't have a car, you won't find it as convenient. With a car, grocery, restaurants, pharmacies, etc. are 5 minutes away. And of course the most important factor is just how close it was to the Disney gate. We were going under the Welcome to Disney World arch in 5-7 minutes. We would definitely come back here again. Just so you know....I don't know what makes it a resort. we've stayed in many resorts and all that is here is a pool. This hotel served the purpose of providing a clean hotel while we did other things during the day. If you want activities and entertainment other than the pool this is not the place for you.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Not what we expected”", "Author": "pinelopakee", "ReviewID": "UR80515437", "Content": "Our sheets were dirty when we arrived and they didn't change the sheets on the 2nd day too. We had to call them to come and change them. When we booked it we were promised for free breakfast and when we arrived we were told we had to pay for it. And considering we were 14 people (with kids), it was a lot of extra money for us. And no wifi in the rooms! On the other side,our pool was clean and great and there were a lot of towels to use.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“will never go back”", "Author": "lovemykids_10", "ReviewID": "UR78702853", "Content": "i was at this hotel with my chruch convention and i will never rocommend this place to no one.this hotel has no tub,just a shower and that has mold in it,the serice was so bad,my mom had a room on the 2nd floor , she is 78 years old they did not let her change her room what is that? every time i came in the room it had a foul smell.i dont know why this hotel is stell open.oh can someone tell me why there are cat's all over this hotel, so take it from me don't go stay at the RAMADA CONVENTION CENTER IN KISSIMMEE FL,", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Nothing special but not terrible”", "Author": "mybroker", "ReviewID": "UR78527860", "Content": "This appears to be a hotel in decline. There are obvious signs that this hotel will either be closed soon or renovated. One of the buildings is already closed and in disrepair. Our building had a sign for a house phone but there were just wires sticking out of the wall. Overall the room was very average. There were no obvious defects and the beds and furniture were clean and insect-free. The conference center was also very adequate and sound-insulated well. It's fine for an inexpensive hotel.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangor, United Kingdom", "Title": "“comfortable rooms”", "Author": "squinky57", "ReviewID": "UR78486645", "Content": "We stayed here one night on way to Orlando airport.It was easy to find off the highway no traffic noise. Yes you do have to carry your cases to upstairs rooms so not recommended for anyone who can't do this. The room was large,very clean, plenty of towels and pillows.Only complaint would be the corridor had a strong smell of cat but the smell did not carry into the rooms. The staff on the desk were friendly.You were given a voucher for compliementary breakfast in the restaurant.Reasonable choice and the waitress brought us bread to toast when we asked. We didn't have time for the pool but it looked nice. Certainly close for disney and other attractions.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Perth Amboy, New Jersey", "Title": "“DO NOT STAY HERE AT ALL, THIS CRAPPY HOTEL!!”", "Author": "ladydon13", "ReviewID": "UR77524301", "Content": "I am going to round this up nice and sweet in a nut shell, this is by far one of the worst hotels that I have stayed at in my life. I would not recommend this hotel to anyone at all. My family and I was vacationing in Florida and booked this hotel through travolcity as a flight and hotel package. The ice machines were brooken, had to keep calling the front desk for ice. My husband found a roach near our room door. Good thing we are always prepared when we travel with our own washclothes and towels, I found someone elses hair on one of the hotel's towels. The $10 a day resort fee is really for what!!! For NOTHING!!!! I was given a bottle of water at check in and I I didn't go to Disney nor use the tennis court. The only thing my family did was get in the pool only one day that was it and we used two towels. You tell me it sounds like a rip off!!!!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mc Calla, Alabama", "Title": "“DO NOT STAY HERE!!!!!!!!!!”", "Author": "jmb9880", "ReviewID": "UR75522664", "Content": "My fiance found this hotel online for a great price! I wasn't to sure about staying here, sounded too good to be true, but figured that it wouldn't and couldn't be that bad. Besides,we were going to Disneyworld and Universal Studios and Downtown Disney and would not be in the room that much at all, and the price was very reasonable. Well, it was that bad. Lobby was fine, looks like that's the only thing they keep up. Our room was supposed to be non smoking. However, when we returned every night from the park it smelled as if someone had been smoking in the room. I did not feel comfortable leaving my things in the room. Parking, oh the parking!!! We always parked at a ridiculous distance from our room after a looooong day at the park. There idea of security is a man sitting at what they call a gate which is just a stick with a stop sign glued to it and he checks for your parking pass and lets you in. Keep in mind they call this place a resort. The bathroom is big enough to turn around in and it is just a shower. Reminds me of the showers we had back in high school. The toilet takes forever to flush. The bed and pillows are horrible. I could go on and on....please do not stay here. They say they have a laundry room.... Yeah right, it is one washer and dryer that cost $2.00 to use both and they are sitting outside!!!!!!!! (by the stairwell) and they were out of order. I have never seen such. This place is a disgrace to the Ramada name. The guy at the concierge desk was not friendly at all. We wanted to get tickets to the park, he was selling them only if you wanted to talk to him about a timeshare, and we didn't so he got pissed and told us we need to talk to the other lady at the desk because he could not help us! They have the nerve to charge a resort fee per day and want to charge you extra if you want a fridge and a microwave! What a joke. They tried to make another transaction showing up as debit card transaction (not showing anything related to Ramada) on the bank statement on my fiance's card weeks after we have been home from our trip that was paid in full on checkout. How shady is that? This place ain't right. It's a shame that hard working people can't even take a vacation and relax without being at risk of being taken advantage of. We will defintely spend our money somewhere else next time and pray we won't have to deal with this again.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greenville, Ohio", "Title": "“I will never stay anywhere else”", "Author": "oger4450", "ReviewID": "UR75183871", "Content": "My wife and I took my 2 daughters to the ESPN Wide World Of Sports at Disney World series of softball. We are from Dayton Ohio and travel for softball alot. We normally stay in hotels that are clean and nice. Normally you get what you pay for but in this case we got way more. The room very clean. Servies and staff as freindly as we have ever encountered. Our teams stayed in the same area and paid over$100 more a night then we did. WE were able to have fun and spend money on the things we wanted to do instead of an over priced hotel. THANKS RAMADA", "Date": "August 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ludlow, Massachusetts", "Title": "“Average Stay”", "Author": "Alicia413", "ReviewID": "UR73970299", "Content": "Nice big hotel. Nothing spectacular, but okay compared to other hotels we stayed at during our vacation. Originally was supposed to stay at another Ramada, but the staff was great at switching us to this hotel. No elevator, so lugging up suitcases was not so fun. Layout of the hotel was interesting (based on Asian flowers). Pool at every section of hotel. Hotel also located directly off highway (192?), easy access to and from Disney (especially when the park closes and you wait an hr. just to got onto the highway from Magic Kingdom).", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Good, cheap hotel close to Disney”", "Author": "Lake_George_John", "ReviewID": "UR73876746", "Content": "I read all of the reviews and it appears to be a mixed bag of reviews. Being a Floridian now, you need to understand that bugs, ants, cockroaches are a way of life down here. They are everywhere! With that being said, our hotel stay was good, the rooms were clean, sheets were clean and towels were ample. The front desk staff (especially Evelyn) went out of her way to make sure we had a clean room close to the pool, with a refridgerator and plenty of towels for the kids. We did not eat at the restaurant there, but the breakfast smelled good. This is very close to Disney and is located just off I-4. The price was great considering that the Disney hotels are 4x the amount. My only gripe was the high speed wireless internet (NO CONNECTION)", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Not bad at all for the price”", "Author": "aesiovwa", "ReviewID": "UR72794511", "Content": "After reading the negative reviews for Ramada, I decided to only make a reservation for one night at the very cheap rate it was going at...big mistake. It was nowhere as bad as people made it seem. Yes, it could be better, but not sure what the negative reviewers were expecting for the low rates! By the time I saw our room and went back to make new reservations for 4 more days, the great rate was gone. In my opinion, this hotel is great value and the rooms are not bad at all. Reception area could be improved though....", "Date": "July 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Dallas, Texas", "Title": "“Horrible Hotel... DO NOT STAY HERE”", "Author": "pmjc101", "ReviewID": "UR72024817", "Content": "I booked this hotel through Expedia.com as I was looking for a decent place to stay for a good price. I found the hotel for $40.00 per night but would come to regret it. My first complaint is that the room I was given was absolutely filthy. The carpet was dirty and filed with stains, room had a foul smell, and the couch was soiled. It was filled with dirt, and various fluid stains. I’ve included pictures and will leave it up to your imagination to determine what type of stains they are. It was so dirty I just wanted to take that couch outside and set it on fire.. The only reason we stayed that night is because we had driven all day to get to the Orlando area and arrived at about 10pm. We were just too tired to look for another hotel and decided to stay the night. We checked out at 8am the next morning and I requested a refund for the remaining days on my prepaid reservation. I was told that I needed to call Expedia.com and request the refund since I booked the hotel stay through their website. I called Expedia.com on 7/3 and I was told that they were unable to authorize a refund without the consent of a manager at the Ramada Inn. Expedia also told that the manager was not available and to call back during normal “business hours.” I found this answer to be unacceptable for a hotel chain as a lot of people were staying at the resort during the Holiday weekend. In fact I was told by a hotel worker that all of the rooms were booked. I waited until after the holiday and called Expedia.com on 7/6/2010 again to process the refund. This time the Expedia.com representative was told to call back in 4 days when the manager got back from vacation. I filed a claim with American Express to refund my money for the other three days. See the pictures. DONT STAY HERE!!!!!!!", "Date": "July 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "florida", "Title": "“Worst hotel that I every stayed in”", "Author": "jackmarcus", "ReviewID": "UR71032089", "Content": "I was at this hotel for the Orlando balloon ride with my wife. The balloon ride company wanted us to meet at this hotel at 5.30 in the morning. As we traveled from a different place to Orlando, we thought of spending the night at this hotel as it is a Ramada. As soon as we checked in, we tried to turn on the A/C, that's where I saw a bug (at least as lengthy as my short finger) crawling on the wall. We were so tired that we want to get sufficient rest before we can call these people to report. Also before I wanted to catch/kill the bug, it disappeared. We woke up early in the morning at 4. We saw the bug crawling on the wall over our bed. We were so frustrated that we got cleaned up and checked out at 5 in the morning. While I reported to the person over there, he is busy in the check out process and didn't care much about it. Also the TV was not plugged in, which I did myself by removing the table lamp power (as there were only 2 power outlets, one was already used for cable). The buildings are old. I would not recommed staying at this hotel.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "wales", "Title": "“for the price, i have no complaints at all!!!!!!!”", "Author": "para999", "ReviewID": "UR69964494", "Content": "i feel i must have been in a different hotel to most of the other people reviewing here. As a hard working couple who had saved hard for this holiday, i was dreading this place after the reviews, but i can honestly say i have no complaints. It worked out around £20 per night for the room, we stayed 2 weeks, checkin was quick, room was rather nice actually, yes its all a litlle tired looking but as a place to lay your head it was great.clean sheets and towels, fab location, mins from disney. On one occasion the pool was a bit dirty, requested to be cleaned and in 10 minutes someone was there servicing the pool. requested an umbrella and table another day for shade as we have a young baby and again was brought to us in minutes. Staff were pleasant throughout. Lobby area quiet and bar we never saw open. If you expect to get what you pay for then you shouldnt be dissapointed. We had a great time here and took it for what it was. i have visited tripadvisor many times but never felt strongly enough to review but i just felt most other comments seemed unfair.", "Date": "July 6, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Lakeland,fl", "Title": "“People are Naive and I hated this hotel”", "Author": "Goliathbst", "ReviewID": "UR64012841", "Content": "I was just reading some of the minority comments that actually say that this place isn't so bad and to give it a break. These people must not stay at many hotels. For goodness sakes, the Orlando/Kissimmee area is crammed with hotels everywhere! This hotel, even with the special rates, costs about $70 per night including taxes and fees. $70! Do any of you people realize the sheer number of nice hotels you can book for that price of less through Priceline etc. in this area? Dozens and Dozens! Even if you can survive staying here, why would you? It doesn't make sense to me, but maybe I'm crazy. I personally would rather stay somewhere 2-3 times nicer for less money, but hey, you're free to make your own choices. I would list what I disliked about this hotel, but it's easier to list what I liked. Here goes: Not much of a list, eh? And no, I'm not some prima donna either. I'm a U.S. Army veteran and used to sleeping in some pretty nasty places.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "slough", "Title": "“Why do people always expect more than they pay for.”", "Author": "gat1234", "ReviewID": "UR63580545", "Content": "After booking this hotel and reading the reviews we were expecting the worse and for the second now time we were waiting for the horror story. Hey guess what, none of that, the room was clean, beds comfortable,check in was fine, free Wi Fi worked well and the pool was as expected and all for a great rate. If I had to find one issue it would be that Ramada must hold the world record for the thinest toilet paper. PS Good location as well right on the i4 and 192. Enjoy Gat and Karen UK", "Date": "May 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Kokomo, Mississippi", "Title": "“Stay away from this DUMP!”", "Author": "nedyahr", "ReviewID": "UR61672440", "Content": "Thank God we only reserved this room for one night! When we pulled up I was thinking, this is the nicest Ramada I have ever seen. Had Bellboys opening door for you. Went into Lobby and thought I was in a 5 Star Hotel. Got Checked in after a long wait behind only 3 couples. Got our room and drove around to our building and could not find the elevator. Had to tote 4 huge bags of luggage up stairs. Got in room and it was a dump. Sink drain was stuck. Had to get under sink to fix it. The door to the balcony would not lock and whoever stayed in the room beside us could have just came in from the balcony we shared. We went to take a bath and all there was was a stand up moldy shower. Also found that we had one bath cloth and one towell for 4 of us. Comode was filthy and so was the floor. So we went to eat and came back and told the guy at the desk about our problems. I asked him why they would only put one bath cloth and one towell in bathroom when they knew 4 of us were staying. He could not answer that question. Told him our room was a crap-hole. When I told him I had to fix the sink, he asked if I needed an ENGINEER to come check it......I told him I am a man and I know how to fix a sink....he just laughed. Asked him about elevator and he said that they could not put them in a seperate building.....WHAT!?!? Stay away from this dump. As I said....Thank God we were only spending one night! Oh, dont forget to watch for the roaches that like to scurry across the room when you turn on a light.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Watertown, Wisconsin", "Title": "“A step up from a motel, but not really a resort experience”", "Author": "midwestmommy", "ReviewID": "UR61336955", "Content": "As other reviewers mentioned, I can see how at one time this was considered a fine resort. Today, it is showing signs of wear and age and although service was adequate and everything was clean, you will be disappointed if you are expecting a resort experience. Pools were cold and not very clean and the hot tubs they used to have by each pool have been removed. Every vending machine was empty and unusable. There were no signs of life in lobby, cafe and bar area when we walked through, but they do have a nice little convenience store/gift shop. Location is good, so if you are planning to go to the Disney Parks and not spend much time at the resort, you may like it just fine for the price.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Not bad, but a Resort?”", "Author": "FLDIsneyFan", "ReviewID": "UR60658903", "Content": "I just returned from a two-night stay that I got through Priceline. I stayed at the hotel before, and it is close to Disney but I think it is a far cry from a \"Resort.\" I actually remember this hotel from the 80's, as it was one of only a few close to Disney. It was considered super modern at the time because they had cards instead of keys to open the doors. Trying to keep positive, I liked the security guard at night, the pool was clean and the beds were comfortable. There were a few choices for dining, including a pizzeria / sandwich / ice cream shop, and a small grocery type store. With a major refurbishment, this place could be a gem with its location and facilities. Until then, I would have to say that its just adequate for a short stay.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Newark, NJ", "Title": "“A little below my standards but super close to Disney”", "Author": "jessxo", "ReviewID": "UR60325170", "Content": "Location-wise - ideally situated right next to Disney front door! However, let me begin by saying that although the front desk spans an enormous counter, there was never more than 1 person serving customers = long line to check in, ask questions - very frustrating. Staff was adequate, not terribly helpful. The room was basic, OK, not great. Pool was convenient and relatively clean. Forget the restaurants - there is a tiny deli, and although they claim other restaurants, we went in looking to eat around 7 pm one night and were told restaurant didn't open for another hour?? The place just basically seems a shadow of its former self, everything has more or less been let go, including the landscaping. $10 a day 'resort' fee is a joke. and free shuttle schedule is ridiculous. Fitness center was barely deserving of this name. So if you're looking to drive into Disney, and want to be super close, you will have that here. However, you will be underwhelmed by the hotel in every other aspect.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "south carolina", "Title": "“Well, we tried.....”", "Author": "ajhappy1", "ReviewID": "UR60056741", "Content": "For the first time I tried Priceline's \"Name Your Own Price\" and went three star, \"Holiday Inn, etc....\" I got this place for a quarter a night. Saw reviews and called Priceline to complain and rebook. No luck (stick to Expedia). Arrived at the hotel very late. There is a security \"hut\", however, there was no security. Went to room. DIsgusting carpet, hair on doors, grime on outlets and switch plates, someone else's headband on shower bar, terrible stain on dust ruffle noticed by my 12 year old, grout in bathroom is black instead of white. Cleaning service was terrible and half hearted. My coffee leftovers remained as well as the dirty floors. Folks next door talked and smoked all night in a no smoking hotel, but too tired to call as I didn't know how how neighbors would react. Ferrel cats abundant. Pool water murky with molded tile, so not used. Required to pay \"resort fees\" which you would really have to see to believe. This was the worst motel experience ever. Priceline is OUT! No deal on this is a good deal.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "cyprus", "Title": "“come on guys give this place a break”", "Author": "stickyvikki", "ReviewID": "UR58984860", "Content": "My partner and i stayed here for two weeks and athough i was dreading it after reading some of the reviews , i was suprised.No bad smells, no pet hairs,everything worked just fine and definately no cockroaches. Our room was clean and service came everyday.Ihad also read about guests having to pay for parking(a bit off as you really need a car )and resort fees etc when we checked out we had not a penny to pay BONUS !.The staff were always helpful even if they didnt speak much english they did what they could. Our only gripe was that the bar closed way to early, and didnt really have a set time but was any time from 10.30 to 11.One night a singer was on and the bar closed before she was done and left us with no drinks ! Not the best hotel but certainly not the worst, by far.Lets face it all we need is somewhere safe,quiet and clean to lay our heads,we were not in the room 24..7 and this hotel gave this and more.", "Date": "March 19, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Atlanta", "Title": "“Never ever stay here”", "Author": "AJ333", "ReviewID": "UR58804118", "Content": "Dirty carpets, locker and phone broke. Very noisy, you can literally hear every word from next room. Cigarette smell in the rooms and corridor. Not more than 1 star. To top it off, very rude employees. And now comes the creme, they charge you additional $10/night for amenities. When I asked what amenities, they said parking, pool. They never told me about this $10 additional fee or other amenities while checking in and they were very rude at check-out and said that I signed the agreement while checking in. Who goes through tons of fine print while you are checking in?", "Date": "March 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Chicago", "Title": "“Do not stay here. Worst in my life.”", "Author": "RyanBinghamChicago", "ReviewID": "UR58727797", "Content": "This hotel is really gross. All the hair in the bed when we enter, and did not clean after the make up. Dirty carpet, we should wear the shoes. Stain and filthy. Of couse smelly. you can hear all the traffic noise and the voice of next room. There is 10$ resort fee. Met the all the bugs at night time. We left after 1 night even though we paid 3 days in advance.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ypsilanti, mi", "Title": "“Nice heated pool, but the grounds lack landscaping”", "Author": "chino53", "ReviewID": "UR57790681", "Content": "Got a good rate on priceline. The hotel desk staff was overworked and understaffed. Rooms were clean. Free coffee in the morning , has a small pizza shop with value priced pizza, ( 1/2 off 2nd pizza ) buffet breakfast in am @ 9.00 per person.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Great room for the price”", "Author": "kim110503", "ReviewID": "UR57703553", "Content": "I got a room for a great deal through Hotwire. Our family was going to Disney so the Ramada seemed a great hotel since it is so close to Disney. The lobby was very inviting, my kids loved the huge fountian they have. The staff at check-in were very polite and helpful. Parking is free, but there is not enough! We had to walk from another building to get to our room, which I wouldn't have really minded except it was about 40 degrees outside. The room itself was very clean, beds were more comfortable than other hotels I've been to for the same price. I was able to access the internet with no problem. The only negative to the room is it had only a shower, no tub, which is inconvenient for those traveling with small children. The room did have a patio, but no chairs to sit on, which was a downside. As it was 40 degrees out we didn't go to the pool, so can't comment on that. We dined at the \"cafe\" for breakfast only, which is very convenient when you're up early and heading to Disney. They have a pretty good selection and my kids loved it. And the kids ate for free. Be advised, they do put a $50 hold on your credit card upon check-in (to cover any incidentals). The booking comany did not inform me of this, but it was released about 3 days after checking out. If you're in Orlando to visit a theme park like we were, this hotel is a comfortable and clean place to come back and crash at, especially for the great deals you can find. Overall I would recommend this hotel and would stay there again myself.", "Date": "March 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Matthews, NC", "Title": "“You couldn't pay me to stay there ever again”", "Author": "elbree123", "ReviewID": "UR56710186", "Content": "The rooms are uncomfortable. Very outdated furniture-just a table with two chairs. Two uncomfortable double beds. Lousy service. Trash in the bushes. Intermitten hot water. Dead bird on the balcony, which has no chairs to sit on. Wad of gum on the side of the dresser. Food way over priced and lousy. The worst experience I ever had in a hotel. Don't go there with your family. You will be highly disappointed.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Cincinnati", "Title": "“Save Your money and upgrade to a Motel 6”", "Author": "WillTheTraveler17", "ReviewID": "UR55897406", "Content": "This propoerty is way past it's prime and a disgrace to the Ramada name. The staff is friendly, but the rooms are just plain worn out. Strange smells around the propoerty and a lack of capital and suppplies is evident everywhere you go. The restaurant is horrid, They should pay you to eat there, It is almost never open and the deli is again staffed by friendly people who sort of speak english, but do not have the skills, supplies or backing to provide a decent meal. There is a Radisson across the street. If my company has another event here, I'll stay there and walk. This place is terrible,", "Date": "February 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Peterborough, Ontario", "Title": "“Would not stay here again....”", "Author": "hedgren", "ReviewID": "UR55500472", "Content": "We selected this hotel based on a the sale rate for this room and location to Disney. We arrived and the desk clerk was not very customer orientated and we seemed to be interrupting her morning. Be aware they charge a $50 damage deposit when you check in and it comes off when you check out. The hotel is old looking and the pools are adequate. If you plan on spending no time at the hotel and tour Orlando then the hotel served its purpose but the room is nothing great. Be aware this hotel is located next to the highway (very noisy) and our room overlooked the highway. Our telephone did not work and when we mentioned it to the staff at the desk they seemed unconcerned. They did send someone to fix the phone. We checked out the next morning not ishing to spend any more time here e.g. breakfast etc. The concierge seemed to be focussed on selling some form of resort/time share breakfast meetings in exchanged for cheap disney passes. Not the greatest experience based on the price we paid (approx $100/night) The best thing about this hotel is the close location to Disney.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“all around great trip”", "Author": "nyctravelerb", "ReviewID": "UR55007774", "Content": "I stayed here with my family as we escaped the cold weather in NY. The staff was very helpful in welcoming us to the hotel and were able to satisfy all the requests we had. The rooms were not mint but they were very clean and in very good condition. For the price it was an excellent deal and a great economical trip to a great place for the whole family. There were good food options also at a favorable price point, much cheaper and better than some of the offsite dining options. Friday night they even had a music show that was really enjoyable for the kids and even my wife and me enjoyed it. The location is very close to all the parks and we are looking forward to making this an annual getaway for the family.", "Date": "February 2, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "PA", "Title": "“Just OK”", "Author": "anonymousPA", "ReviewID": "UR54509849", "Content": "We stayed here for three nights of a conference. The good: lobby was actractive, check-in clerk was polite, room had apparently been recently redecorated and was actractive, location was convenient for Disney and for conference. The bad: stong smell of dampness in hallway and room (even the bed felt damp), noise from interstate (we were on the back side), no elevator - had to lug suitcases up to serond floor, lack of security - anyone had access to the corridors which pizza places took advantage of, and, worst of all, did not receive wake-up call for early flight.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "new york city", "Title": "“This place needs renovations and better service”", "Author": "kat527", "ReviewID": "UR54463050", "Content": "Checking in took forever and the girls behind the desk were airheads. Went to my room and the place was fair but outdated. One small balcony looking out to the pool. The place was dusty around the tables and under the bed. Beds get made, but one day the bed was made at 6pm and another day it was done around 11am (so random. Coffee machine in the room but i had to clean it. Every time room service came in they did a lousy job with exception to this one day. There's a pizza place within the hotel but it looks so dirty and gross. Other nicer dining areas though, but i didn't try any of their food.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Columbus, OH", "Title": "“Okay hotel, but would not stay here again.”", "Author": "zippyincolumbus", "ReviewID": "UR54454828", "Content": "My husband and I got a Friends and Family deal (50% off normal rates) for Ramada, and decided to go to Disney World, since I had never been (at 31 years old). We chose the Ramada Celebration Resort, and stayed for a total of about $50/night for 4 nights. I don't think I would have paid more than that. The hotel is clean, and safe, and the staff was very pleasant, so all that was fine, it was just all the little things added together...the hotel seems pretty old, and could use a bit of a rehab. The shower we had in our room was a hand-held sprayer in a holder, and it wouldn't sit upright in the holder, so you had to take a shower with one hand!!! I had a headband with me, thank GOD that I used to jerry rig the nozzle head to get it to sit upright so I could shower with 2 hands. We were also supposed to get a courtyard facing room, but had a parking lot view. I didn't think it was a huge deal when we got in the first night, so didn't alert staff and request a room change, but we could hear a lot of noise from the nearby highway pretty much all night, so a courtyard facing room would have been better. After the first night, we were always up early and in bed late, so I never did take it up with the staff re: switching rooms because we didn't have time! Shuttles/Transport: We didn't rent a car, since we didn't really need one (we were only doing the Disney parks), so we took a cab from the Orlando airport to the hotel, and back to the airport and that cost $55 plus tip each way. The shuttles to and from the Disney parks were nice. We took the earliest shuttle to Magic Kingdom every morning, and then caught a bus from Magic Kingdom to whatever park we wanted to go to (they run about every 15-20 minutes, so we didn't have to wait long once we got to Magic Kingdom). The evening shuttles are a little tricky during the week (that may just be in January, too, since it's the off season)- there was only one that left Thursday night from Magic Kingdom to take us back to the hotel, and it was about 15 minutes after the fireworks ended, so we had to hustle to get to the parking lot. And the shuttle that left Hollywood Studios one night left at 8:55 and the park closed at 7:00!! But there were always enough seats, and the drivers were pretty nice. At night this hotel was usually the last stop on the shuttle route, so plan on getting home late! Food: Breakfast during the week at the Paradise Cafe was pretty good- for $4.95 each we got the Continental Buffet (cold cereal, bagels/muffins/danishes, fruit, coffee and juice), which was pretty reasonable, I thought (especially for Orlando!) or on the weekends for $9.95 you can get the Hot Buffet instead, with pancakes and bacon, eggs etc. We ate a late dinner one night at the Market Place and Deli, and their food was really good, and the staff was really nice. Amenities: The in-room safe was nice, and easy to use. We never did try out the tennis courts or fitness room, and it was too cold for the outdoor pool. Don't be fooled by the business center- you have to pay $.25/minute for internet time and $.75/page to print anything out. We flew Southwest, so had to pay like $4 total to check in online and print our boarding passes. I thought that was included in the $10/night resort fee we paid, but nope! It's extra! So, overall, we feel we got what we paid for, and we are glad that we only paid 1/2 price. It was clean, no fear of bugs or weird stains on the sheets or anything, and the staff was nice, but it wasn't a great stay. If you're expecting a resort-like atmosphere, stay somewhere else! Neither of us could imagine paying more for this hotel. We both thought next time we stay in Orlando, we will stay at one of the Disney hotels just to make it easier to get to the parks, plus when you purchase anything at any of the parks, they will send it to your hotel room for you when you stay at the Disney hotels, which we thought was awesome, plus if you stay with them, you can access the parks for more hours. So that is what we will do next time, for sure!!", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "cheshire", "Title": "“Great hotel in a great setting and the right price”", "Author": "cttraveler10", "ReviewID": "UR54354525", "Content": "I stayed at the hotel for two nights for a very important business meeting. I had a long flight and was not feeling well. I requested a hot soup to be delivered to my room. I had the best chicken noodle (pepper) soup that I needed. Walking in the lobby that night and was talking to a restaurant hostess and after a quick chat she suggested a hot drink with some liquor which was good. I am not heavy eater in the morning but my egg and potato was well done. I travel to many different destinations every month and I come to Florida twice a month but it was the first time to stay at Ramada celebration. I was meeting with three people one of them could not make it and we needed to conference him but nothing was planned. I asked the girl at the desk who assured me that someone will come to the restaurant and see me. A gentleman from sales came and offered me the suite attached to my room and to setup a polycom for my meeting. I have to say that this saved me a lot and made me and my company looks very good. Lunch was great; we enjoyed the Salmon pasta and the Mahi sandwich. I left the next morning with one thing in my mind is pass this information to the travel department in my company to recommend this hotel to other departments. I recommend this hotel to anyone who is looking for the right place with the right price.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Canada", "Title": "“the worst resort hotel Ive ever styed at”", "Author": "tripper101Canada", "ReviewID": "UR54352677", "Content": "No door persons,no luggage carts ,broken down elevators,poor resteraunt service, a overwellming smell of clorine in the lobby and resteraunt Even though my stay was prepaid We left and stayed at a best western", "Date": "January 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "tampa", "Title": "“you better check your bill before you leave,added charges”", "Author": "marieTampa", "ReviewID": "UR53960522", "Content": "when you make reservations make sure they give you what was agreed to and at the charges they agreed to or you will be charged at the end of your stay,so I would recommend you study the invoice at the time of check out my husband and I will not stay here again", "Date": "January 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Detroit", "Title": "“A Big dissapointment”", "Author": "stangly", "ReviewID": "UR53886946", "Content": "When we arrived there were no blankets on the bed. We called the front office and were told they would send someone up with them. An hour later (1 AM) we called again and were told they were out of blankets and would be happy send up more sheets! In the morning a followup discussion with the front desk uncovered 2 out of 4 remaining blankets in the hotel and the explaination that there are 500 rooms in the hotel afterall! In addition the sliding door to our balcony did not work and the front desk promised an engineer. NO SHOW. In addition housekeeping seemed to be unable to restock the in room coffee service. The grounds show lots of deferred maintenance and the room was shabby and neglected. (dirt spots on the carpet, curtains and dirt flying from the AC unit) On the good side - the location is good and the lobby is nice.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "baltimore", "Title": "“Lousy Customer service, no blankets, no complimentary breakfast...”", "Author": "umcpfreck", "ReviewID": "UR53875925", "Content": "This hotel has been horrible. We were told that they did not have enough blankets for guests staying, and so we were not given anything but a sheet. We have not been able to access the internet the entire time we have been here and the fitness center has been closed. Perhaps the funniest, but most upsetting, is that though they advertise a complimentary breakfast, they do not give you this if you book online. Instead they charge you $9 for runny eggs and cold coffee.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Beware on Weekends! Turns in a Party, Managment doesn't Care”", "Author": "ndmjax78", "ReviewID": "UR53239032", "Content": "My partner and I stayed here on Christmas Weekend 2009. We stayed 2 nights. The first night, we were pleasantly surprised by the room. I was prepared with multiple candles and air sprays; however, our room (room 3911) did not have a smell to it. I do agree that they do not provide enough blankets. The review would have been glowing had it not been for the event listed below. The second night, we came home from Disney to music from the convention center. We heard music because our sliding glass doors were situation literally right outside the bay doors of their convention center. We left Disney early (around 11), so I figured there was a wedding/party reception. We were understanding of it, so we let it be. By midnight, the music became louder, the doors of the convention center were opened constantly, so I called front desk. They said it would be a few minutes. By 1 lack of sleep made me dress and go to the front desk. There, I asked if they can turn down the music. A manager, who was standing at the front counter, said \"the concert\" will last until 2. The concert?!? Ok, moving on. I asked, so we are stuck with this music right outside of our door until 2am? The management just shrugged. A shrug was an unacceptable answer, so I asked for the corporate number. It was not until I did that, that he offered to move our rooms for an upgrade fee (they didn't have the same room we were in). I told him I don't agree with the upgrade fee, but he just shrugged. We also were informed we would have to check out of our old room to get a new room. I figure, we could leave our stuff in the room we were settled it, and sleep in another room. I have a problem with this since they knew a concert was happening and we could have been booked another room at check-out. When we did check-out, we were handed a sheet of paper, and the front desk clerk literally turned and walked away. All she said was, \"What was your room number?\" It was not until another clerk friendly as can be informed me that was all. I wrote Ramada via their contact information on their website about 2 weeks ago, and they have not responded to my complaint. I wouldn't stay at any ramada again because they are not customer friendly", "Date": "January 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "va", "Title": "“STAY AWAY”", "Author": "bishbt", "ReviewID": "UR52766821", "Content": "Never could get anyone to answer at front desk, was given 2 towels and one washcloth for 4 people-when asked for more was told they had no more. Rooms were old and smelled. Bathroom in bad condition. Pools not heated.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Ontario", "Title": "“For 1-2 nights = A-OK...”", "Author": "italianchicka", "ReviewID": "UR52625390", "Content": "http://www.ramadaorlandocelebration.com/ I was worried about going to this hotel from what all of the reviews had been like. We only stayed for 1 night and it was really not that bad at all. It had everything we needed. Staff were polite and our room was ready when we arrived (we got to the hotel around 5 or 6pm) There were no elevators to our rooms, and we all had suitcases, so that was a little annoying. The rooms were clean and bathroom was clean as well. This hotel has a pool as well. Rooms have free wi-fi. It really is not as bad as some of the reviews say. For the price we paid, it was worth going for one night. It`s also super close to Disney, which was the reason we went. 15 min away from Downtown Disney :)", "Date": "January 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Plantation", "Title": "“I can't believe there are still dumps like this in the Orlando area...”", "Author": "ILoveStars28", "ReviewID": "UR52609707", "Content": "For the record I have NEVER stayed at a Ramada before and I don't ever want to again. I chose a 3-star rated hotel in the Maingate Disney area through Priceline. I ended up with this hotel. When I checked in the girl at the desk with the purple phone was too busy texting to acknowledge my presence. Thank god the sun was still out because if it was dark out I'd lose a tire in the huge pot holes throughout the parking lot. After 6 pot holes to my hotel room I was already a bit P'Od. I must admit the room did seem outdated (80s) and the hallways had a weird smell. The bathroom had someone else's hair in the shower and on the shower walls. GROSS! It gets better when, I turned down my bed to see if the sheet were clean I found small brownish red drops on the sheets. It looked like blood but I could be wrong. So, we chose to sleep in the other bed. As the night progressed the temperature in Orlando dipped down to the low 30s in January 2010. I tried to turn the heater on but it did not work. I tried the air condition and it did not work either. There are no comforters on the bed. All there was is a bed sheet and a very, very, very thin \"blanket.\" I received the bill on the floor the next morning to see a $10.00 hotel resort fee. WHAT A JOKE! They should inform guest of the hidden charge and not slap it on us when it's check-out time. I'm just glad I stayed for just one night.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Baltimore, MD", "Title": "“Worst hotel stay ever”", "Author": "mikers22", "ReviewID": "UR52503849", "Content": "Nothing good to say about this hotel. After checking in we found our room to have no blankets, not enough towels (had to ask each day for more towels and wash cloths), bathroonm smelled of mildew, security latch on our door was broken (which they did fix), telephone did not work at all, remote for TV worked sometimes. Complained to front desk about the lack of ice (none in 3 adjacent buildings we checked) and no soda in vending machines in all three buildings for the enire 6 night stay. Constant noise after 11 PM. Teens playing ball outside our window then screaming & running up and down the hallways. Tried to call thew front desk on our cell phone about this but there was no answer. Some days our room was cleaned, sometimes not. The worst was the natural gas odor in the corridors, like gas was escaping from the outdoor pipes and of course was never addressed. The shuttle to Disney World was the only thing worth the $67 they charged for \"resort fees\" and that was overly crowded with people standing on most trips. Staff always said they would \"get right to it\" but most of our complaints remained throughout our vacation.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Sacramento", "Title": "“Needs to be condemned...............”", "Author": "EGcomp", "ReviewID": "UR52447625", "Content": "We are a traveling competitive team from northern California who attended the Disney College Showcase from Dec 31-Jan3. We were required to book our hotel through Anthony Travel....a sponsor of the tournament. When our travel coordinator arrived on Dec 28th the hotel was overbooked, but guaranteed that our block of rooms for the team were guaranteed....by the time a majority of our team arrived at midnight (including most of our players) the hotel had given away a number of our rooms. They put these people in rooms that were under maintenance with bunk beds.....the showers produced either extremely hot water or freezing cold water -- nothing in between. Spiders and ants were crawling out of the closets! The next day we spoke at length with the manager, Jeff Howard who had no idea of the situation. We requested to be moved to another property, but he insisted along with Anthony Travel that we\"our entire team\" had not been inconvenienced. He offered to comp breakfast the next morning, but \"renegged\" after our team had eaten and said he would cover half! We had toilets that leaked, no towels (or at least not enough, no washclothes or hand towels), blankets the thickness of a table cloth, and no one would answer the front desk phone....at one point it rang for three minutes before someone answered. The odd thing is that on New Years Eve the hotel had a full staff and a full parking lot .....they seemed to have been able to accommodate everyone! While standing in line on the 28th they were turning away guests who had booked on Travelocity -- apparently the rooms were guaranteed through Travelocity, but the Ramada said they were not guaranteed through the hotel....how ridiculous, if Travelocity has bookings with the hotel then the Ramada is obviously contracting with them and the rooms should be guaranteed. Finally the reason the hotel manager, Jeff Howard, knew nothing about the situation was because the staff were instructed not to contact him. We have had better service and accommodations at a Motel 6 or Holiday Inn for half the rate. Mr. Howard, our entire team was INCONVENIENCED as we all came three days early and paid for your crappy hotel and rental cars and reserved soccer fields that we could not use because most of our team was exhausted from having to wait in line for over an hour (at midnight) just to get a room....with spiders, ants, no towels, bad plumbing, etc! Ramada, Anthony Travel and the Disney Showcase Management should be ashamed for recommending such a dilapidated property....this hotel should be condemned (parts of it were actually boarded up!) . We would not recommend this dump to our worst enemy!", "Date": "January 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“Average 2 star hotel, terrible service”", "Author": "ks1601", "ReviewID": "UR52413386", "Content": "The rooms were poor to average. Clean enough to stay in for a night or two, but I wouldn't want to spend a week long vacation here. This hotel is in major need of renovations. Yes, the sheets and towels were clean, but the floors, walls, shower, etc. were not. For the price, though, it didn't bother me much. If the service had been better, I might have considered staying here again because of the value. However, service was terrible. We waited in line for 45 minutes to check-in because there were only 2 people working the desk (the resort is huge...during a busy time they definitely need more than 2 desk staff). Waiting to check in for 45 minutes was the last thing I wanted to do after a 15 hour drive to Orlando. That night, it was really cold in our room. The next night we called and asked for extra blankets (they dressed the bed with one top sheet...no blanket)...no one showed up. We called 30 min later to ask for an update. They said they would arrive soon. We fell asleep 45 minutes later without our extra blankets. I got a great rate on this room, but if I hadn't, I'd be complaining a lot more! Look for other hotels in the area with a similar price, but better reviews.", "Date": "January 2, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Rooms": "3", "Service": "1", "Location": "3"}, "AuthorLocation": "Kentucky", "Title": "“Good, but not great!”", "Author": "sable2000", "ReviewID": "UR52206076", "Content": "Hotel had a beautiful lobby and upon arrival seemed to be more than expected for price and was until the second night. Upon arrival from a long 10 hour fishing excursion, our keys wouldn't work in our door and the wash rags, bath mat, and soap had not been replaced. The front desk was called and still no replacements two hours later. Notification of the absent items at check out and not even a sorry. Might go back, but not without soap, wash rags some things are just a necessity.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "LONDON", "Title": "“It was GREAT for what we needed :D”", "Author": "Zee_1986", "ReviewID": "UR49169358", "Content": "Me and my husband stayed in this hotel in oct 2009. i found this hotel was great for what we wanted, we just wanted a pleasent place to spend our nights somewhere safe to stay, and this hotel offered this. I wouldn't recommend u to eat at the resturant in the hotel as the food wasn't that amazing and not much choice especially if you are a vegetarian, but there was plenty of place's to eat out in and around the kissimmee area anyway. I would definitely recommend you to hire a car (with a TOM TOM..!!!) if you want to visit the Florida Parks, you can book it from home and then pick up from the airport. we actually didn't hire a car from home, we thought we would just get shuttles everywhere, we tried this on the first day out and got a shuttle to Sea World which was about $24, they were late on picking us up and tell u what time they pick you up so u have less time in the park. When you arrive at this hotel go and speak to the guys at the concierge, they gave us some great advice on all the places we wanted to visit.. I would recommend this hotel, and i would 100% go back.. :D", "Date": "November 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Vancouver, WA", "Title": "“Last choice of a place to stay while in Kissimmee”", "Author": "tilt00", "ReviewID": "UR48952616", "Content": ". This hotel may have been okay when it was new but it is very much in need of cleaning and maintenance. The room was not clean and the beds were terrible. The sheets didn't stay on the bed. There was mold in the shower and the lighting was insufficient. We tried the buffet for breakfast twice because we thought it would be fast. It was very expensive and items were cold and tasteless and eggs not cooked all of the way. The people at the reception desk were rude and non-responsive. We were there for eight nights and in all of that time, didn’t find anyone helpful or friendly. I can’t find anything nice to say about this hotel.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "NY", "Title": "“The Halloween Horror Night”", "Author": "Lastspider", "ReviewID": "UR48669847", "Content": "1. Rooms Stink 2. Lobby Very hot 3. Internet wireless no signal 4. TV with NO Movies 5. Food and Service Horrible", "Date": "November 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Saint Cloud, Florida", "Title": "“Hidden charges and poor management and the staff could care less.”", "Author": "JMGatsby", "ReviewID": "UR48628609", "Content": "This is what I sent to the Ramada today in response to their Online Satisfaction Survey: The staff were completely incompetent. Had proof of delivery on a package sent to hotel that they insisted was not there. Day one, I called the front desk and asked about it. I was told they would go look and someone would call back. No call back at all. Day two, I went to the front desk and waited 45 minutes for someone to \"check\". They claim no package. Oh what about my proof of delivery? Oh well, sorry they can't do anything. After I checked out the gave me my package which the security person said was sitting in the back the entire time. I needed the package during my stay so finding it at the end was entirely useless to me. Next, this hotel employs deceitful methods for charging additional expenses to your bill. At check out I was billed a $10 a day \"resort fee\". Nowhere on my printed reservation receipt was this charge disclosed. The front desk refused to refund it. They responded that on the website there is a checkbox where you agree to the charge. Sure, I remember a checkbox on a website for a reservation I made five months ago. Show me a printed disclosure, not some vague claim. Restaurant service was poor at best, servers seemed annoyed that they had to take care of you. Food ranged from bad to absolutely disgusting. My hamburger (that I waited nearly an hour for) arrived burned to a crisp and completely inedible. The server didn't see why this was a problem. No wi-fi although it's advertised as available. Yes, if you stand in one spot in the lobby you might get a signal. Pretty awful considering I was at a conference in the hotel that required me to be online. Forget the \"business center\", it was overrun by hordes of 10 year old children surfing the internet and generally acting rowdy. Can't possibly get work done in there. And, no, management did not come by to ask them to calm down. The gym, if you could call it that, had three mismatched weights and no air conditioning. I guess that's part of the \"resort fee\"?? Never coming back, ever.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Good hotel, still needs some refinement”", "Author": "ORDVacationer", "ReviewID": "UR46241370", "Content": "Stayed close to a week at the hotel for a conference. Price was SUPER cheap. Loved the \"pool in each pod\" set up, alas no hot tubs. Maid service quite slow although the hotel was nowhere near capacity. Numerous problems with key cards - pain to have to go to lobby to get new keys issued. Convention rooms were decent. Service was above par for large banquet. On-site restaurant not always open for all meals. Small snack shop takes FOREVER to get food. Free coffee service in the morning in lobby. For the price I paid, I really cannot complain too much, though! Overall it's a decent place to come back to if you're out sight-seeing all day.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Yorkshire", "Title": "“This is a MOTEL not a 3 star hotel.”", "Author": "Bella_Yorks", "ReviewID": "UR43083703", "Content": "When we arrived at the check in we were told they do NOT do B&B. I said we had paid for that and showed our paperwork.Grudgingly they agreed. The electric plate warmers were only turned on once during our stay therefore the food which was only cool was cold before we finished eating. Nice glass tops on the tables. I ran my napkin round and so much dirt was in there. The bar closed at 9pm most nights, some nights it didn't even open. The entertainment had to be paid for if you wanted it,plus compulsary purchase of 2 drinks. I have never known anything like this before. I think it was 2 nights of our stay there was a menu for a dinner, otherwise it is junk food from the pizza place situated in the far end of the lobby. Someone said the pools weren't clean. The one we used was, but most of them were cloudy and the areas surrounding uncared for. Our room was spotless, clean sheets and towels etc every day. How many hotels do you know where there are over 900 rooms with carparking space outside each room? This is a MOTEL.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "AL", "Title": "“This place was fine”", "Author": "RACINDIVA", "ReviewID": "UR41694984", "Content": "The room was large and clean, the bed was comfy and the check in and check out was fast and easy. I was only there for one night, but it was a nice stay.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Tampa, Florida", "Title": "“Never Again”", "Author": "lblTampa_Florida", "ReviewID": "UR37307560", "Content": "Stayed here for the Southern Open Chess tournament and I woud never stay here again. While the rooms were clean and the beds nice, that's where it all ends. The pools were not clean, very cloudy, I was worried about the chemical levels being very low. While there, my children had the great pleasure of being yelled and cursed at by a group of drunken swingers at 4:30 in the afternoon. They had taken over the pool area and claimed they had permission from the management. Apparently, management had scheduled a swingers event for the same weekend as a chess tournament! Really??!! Management denied giving them permission to have the pool closed. The women were topless and kissing each other in a very sexual manner. I was on the back patio of our room with a direct pool view but could not see what was going on until my children ran back to the room in tears. Management, in the end, did take care of us, but I was truly apalled. Two mornings, I was awakened at 6am by the neighboring empty rooms alarm going off about 6am. I had to call and security would come and turn off the alarms. Housekeeping really needs to make sure that the alarms are off in rooms. Walls were very thin as were the bath towels. No free breakfast as promised. Oh, don't count on the free bottled water either. Internet was down for over a day. $10 a day resort fee is outrageous IMO. This was, as my 9 year old daughter put it, a homel. Cross between a motel and hotel. Do yourself a favor and bid for a priceline room, 3 stars should get you something much nice for the same price!", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“A Nice Hotel for the Price”", "Author": "SingingPenguins", "ReviewID": "UR33326998", "Content": "My friends and I traveled to Orlando to go to Disney World in celebration of our graduation from high school. It was out first time traveling alone, and we were a group of two eighteen year olds and three seventeen year olds. We all shared one room to keep the cost low, and five nights with continental breakfast and a rollaway bed for the room came out to $441 and change. This was really a great price for the hotel. My friends and I spent our entire first day in the hotel, since we got in at 3:00 in the afternoon and didn't want to spend money on a park ticket for the day. The resort was completely empty, since we arrived June 10, which was the middle of the week and I suppose most schools hadn't gotten out for summer yet. Plus most people who stay there probably spend the entire day at the Disney parks. We ate lunch in the hotel deli, which wasn't bad, and then had the pool near our room to ourselves. We then went to dinner in the hotel restaurant, which was okay, played pool and toyed with the jukebox and then we went up to sleep. It was a nice enough experience. The hotel seemed a bit understaffed (there was one guy running the souvenir shop and the deli) but I assume that had to do with the fact that it was the off season. Overall we had a positive experience. The rooms weren't extravagant but it was enough for us since we really only slept there. We did have a problem with the water on the second night. There were five girls sharing a shower and by the time my last friend went in the water shut off halfway through and didn't come back on until 4am. It was only that one night though, and we had no other problems with the water. Every time we asked for things like extra towels or pillows the staff brought them up in under fifteen minutes. We used the shuttles a few times. It was fairly reliable but for the most part we chose to shell out the extra $5 a day each for a cab since it allowed us more freedom. We were able to call a car easily from the front desk every morning. It was definitely a nice enough hotel for the price we payed and I'd recommend it to anyone else vacationing on a budget.", "Date": "June 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "jax, fl", "Title": "“Hidden charges, cleanliness issues..but good value”", "Author": "teacherJax_Fl", "ReviewID": "UR32875714", "Content": "Nice-sized room, bed was hard, lobby ac not working, spiderwebs growing on sick plants, old and stained furniture, mold on pool tiles....hotel poorly managed, but for a little bit of careful attention, it could be really nice. After all it ended up being 2 nights plus continental breakfast for just under $100. What can you expect?", "Date": "June 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "louisiana", "Title": "“Good motel for the money”", "Author": "rtmyers5", "ReviewID": "UR32211782", "Content": "I was a little worried when we first reserved 2 rooms for my wife 3 kids and mother, but after a 6 day stay. I can say that when we go back next summer we will stay here again. the rooms were not fancy, but we nfound them comfortable and clean. the grounds were well kept and we felt safe there as well.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "shropshire", "Title": "“great hotel”", "Author": "lin64", "ReviewID": "UR31498291", "Content": "we have just got back from 2 weeks holiday staying in this hotel. i read the reviews before i went and was open minded as it was just some where to sleep as we were going to be at the parks all day, first may i say as a british guest what do you americans expect for your money? ive stayed in 4star london hotels and the rooms were of that standard ,you got a free safe which if you holiday in europe you have to pay for this,the room was cleaned everyday and the hotel and grounds were very clean theres a washing machine and dryer in the hotel which is great,the free continetal breakfast was cereal/bagel/danishpastrys/muffins/yoguat/fresh fruit and juices . the reception staff were always chatty and friendly and you got to use the internet for free.the hotel also offers a free shuttle to the parks 3 in am 3 in pm but if you want you can get the lynx 56 which stops outside the disney transportantion centre right by the free shuttle stop so if you want to get this they are every 30 mins cost 2 dollars and the hotel is the first stop takes just 12 mins you only have to cross the road we used this to get back from parks as the last one 10.50 which means you get to watch the firworks with out rushing for the free bus. i would recommend this hotel to any british guest and take little notice of american reviews as i said they want the ritz for travel lodge money .", "Date": "June 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "canada", "Title": "“Stay here is you want to Sleep with Ants and Blood stained sheets!”", "Author": "Sasha7728", "ReviewID": "UR30647295", "Content": "We booked this hotel for 4 nights at $55 thinking it was a great deal and the pictures of the lobby look great. When we checked into the hotel the first impression based on the lobby looked great but that is where it ended. The rooms look like they haven't been updated or cleaned in 20 years and the rooms had a very musty smell. We booked 4 different room for our party and in our room the safe didn't work and AC didn't either, In another room the latch for the patio door would not open and In the other two rooms we quickly found out that it was covered in Ants, crawling all over the counter and walls. we all got changed to a new room on the second floor in a different area because we were told that they were renovating the hotel and the section they first put us in has not been done yet. The second room was even worst than the first room and it didn't look any different from the first, at this point it was already 12:30 am, we were tired so we just wanted to sleep and get out of there in the morning. When I pulled back the covers, the mattress liner was covered in hair (hair from every part of the body) and there was blood stains on the liner and mattress. We called for new sheets and the security guy came 30 min later with new sheets apologizing saying there is currently no house keeping. We ended up changing our own sheets and slept fully clothed. The next morning we couldn't check out of that hotel fast enough and into a new hotel, I didn't even want to eat the continental free breakfast. The first night of our vacation was depressing due to the hotel. DON'T STAY HERE FOR ANY PRICE!", "Date": "May 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Maryland", "Title": "“No frills, low end service”", "Author": "MDFreqTvlr", "ReviewID": "UR30389900", "Content": "This is a barebones minimum services hotel. It is very convenient to Disney, etc and if you are not planning on spending a lot of time in your room it will work. The check in service is very slow and the restaurant service is non-existent. With so many good restaurant options in downtown Celebration there is no reason to eat at the hotel. Room was clean but very basic. Despite a large conference/convention center there were very few amenities at the hotel, although the pools were a highlight. Again, if you are looking for a reasonable place to sleep while visiting the area this will work, but don't expect a lot.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Hillsborough, North Carolina", "Title": "“Don't waste your time or money !!!!!!!”", "Author": "Thecatsmeow98", "ReviewID": "UR28487782", "Content": "We go into Orlando after a very long trip and expected a nice cool room. The room was hot, the a/c was not on ( found out later it was not even working). we were assigned a room on the 2nd fl ( there were no elevators). We were facing the pool and kids were screaming ( the pool is open until midnite). When we finally get unloaded my hubby goes to get ice to keep his meds cool and there is not a working ice maker in the whole entire pod- he had to go to another bldg still did not find ice). I called the front desk asking for a fan and no they don't have them. I called back asking for another room since the a/c is not working and I have a diabetic that needs to keep his meds at a consistent temp and 73 degrees and climbing is not cutting it they offered to fix it I blew a gasket and walked to the front desk and by this time I was really ticked off. I told the front desk that I had called and asked for another room and why and was turned down and I let them know that if anything happened to my husband because they could not be bothered to give me a room that had a working a/c then the people at the front desk and Ramada Inc would be held liable. I got another room on the bottom floor that time. The next morning they wanted to charge me a resort fee I told them in no uncertian terms no way in hades was that happening and why. I also let them know that this was the 2nd bad experience for us with Ramada and never again would we stay in a Ramada even if we had to stay in our veheicle.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“A Great Deal for a Great Hotel”", "Author": "williamsalicia", "ReviewID": "UR28433586", "Content": "This hotel was great!! I booked this 3 star hotel on hotwire for $28/night-hotwire then downgraded it to a 21/2 star and credited me some $$ back but I didnt understand why it was downgraded. The hotel reservation area was huge-it was well decorated, their were comedy shows held their, music, their's a gift shop and a breakfast area. Unfortunately the breakfast is not included on hotwire but still was a great value. They have balconies for each room, which is convenient for smokers. They are located on a main highway so everything you need is w/in walking distance. I never felt in danger or anything like that, front desk was always helpful, and the rooms are a basic-nothing lavish, but its a 21/2 star so what do you expect....I have nothing bad to say about this hotel. I wish the fridge and microwave and parking were incluided but for $28, guess they have to make their $$ some way. I stayed for a week and everyday the pools were cleaned and the rooms cleaned. The halls didnt stink and i didnt look around to find if there were any paint chippings or stains on the tiles, if ur that picky pay $300 and stay somewhere else but this hotel is great & if I werent moving to Fl next yr i'd definately use this hotel again", "Date": "April 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Saint Louis, MO", "Title": "“Sent there for training course. Simple, Clean, and will go again.”", "Author": "Land_Dude", "ReviewID": "UR27970281", "Content": "Went for a four day mandatory course. Went early enjoyed weekend of warm sun. Had fun in the comedy show on saturday , bucket of beer. My room was simple no frills, but clean. Breakfast was a simple buffet. Training rooms were fine, not too cold. I'd go back again.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "South Carolina", "Title": "“Pretty decent stay”", "Author": "roaa4", "ReviewID": "UR27886513", "Content": "I was quite concerned about staying here due to all the negative reviews. I shouldn't have worried. This place was quite adequate. I got a great rate through Hotwire for $33. The hotel is older, however the rooms were updated somewhat and were very clean. The grounds were absolutely beautiful and were kept up. The pool area was also clean, and my only complaint about that, is that it was not heated and there seemed to be a little too much chlorine. I would not hesitate recommending this hotel.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Norwich", "Title": "“Great Hotel, would go back previous reviews do not give enough credit!”", "Author": "Hixxyz", "ReviewID": "UR27492461", "Content": "Just returned from Ramada Celebration in Kissimmee we read reviews on here and was not too sure to expect, was more than pleasantly surprised, if you are a regular kinda person/family with no high expectations and are looking for a cheaper hotel to use as a base to go to sleep and maybe chill out by pool for a bit then this hotel is definitely for you. Rooms were cleaned every day, maids made a real effort in keeping clean, great attention to detail with towels and beds and even folding up your PJ's! free complimentary shower/shampoos daily/ coffee machine in room. On second day we got delivered a fridge without asking, so that was nice. Mattesses looked new really thick and comfy. Rooms are not decorated like 5 star luxury, but remember you are not paying 5 star prices. Free wi-fi which worked all the time in rooms and bar and lobby. Staff very friendly. Who goes on holiday to work out anyway?? Gym looked fine to use. Has own gift shop and market place food deli which is open till late to get your late nights snacks. Bonkerz comedy club in hotel is worth going to, very funny great comedians. You get free shuttle to Epcot in mornings then from Epcot you can catch Disneys free transport to other parks. This changed on our last day and I now think there are 3 times in the morning to go to three park drop off and three times in evening you can catch the shuttle back. Much improved service. If you do not have a hire car ask for a room near lobby we asked and got one no problems. Free continental breakfast is included which is ur usual cereal, bagels, pastries, fresh fruit salad, toast. But you can upgrade to $5 per person for a hot. My only negative comment about this hotel is the hot breakfast, this for me is the only area that needs improving, but not too much of a big deal as you have lots of other restaurants to chose from nearby. Old town is well worth a look and if you want to be gobsmacked a drive through Celebration town is a must, absolutely beautiful and only 5 mins drive from hotel! there is a shuttle service called fun spot shuttle which wil pick you up from your hotel and take you anywhere one the 192 for free!! you dont just have to go to fun spot! Just give them a dollar tip at the end, we used this on the last day as only found out about it last day but what a great service! Lovely hotel complex not scary at all don't know where people get that from?? So all in all very impressed with hotel, not enough credit given too it, would definitely use again as a cheaper base hotel, go for it! you will be pleased! hope this helps!", "Date": "April 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Green Bay, WI", "Title": "“No frills, needs some work, but cheap clean rooms.”", "Author": "ryanprint", "ReviewID": "UR27030652", "Content": "We thought we had got a deal booking this hotel, but the photos online are very misleading. At first I was disappointed, but then realized I only paid 29.95/night. You get what you pay for.The hotel is a \"Ramada\" now , a former Hyatt. The rooms were clean, but very outdated. The hotel has been stripped of its \"Hyattness\" for lack of better words. The exercise room had no working equipment, and the machines appeared to be broken for some time. Restaurants were closed at the hotel when were were there.The \"business center\" appeared to have been closed for some time as well. The pools were somewhat dirty and UNHEATED which is not mentioned on the website. This is at best a $45/night chain hotel: clean, conveniently located, relatively safe: but you won't want to \"hang out\" here. Wouldn't reccomend the hotel to families that want a \"be at the pool with the kids\" experience.", "Date": "March 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "VERMONT", "Title": "“Clean & comfortable”", "Author": "TAXOL13", "ReviewID": "UR26731688", "Content": "This hotel was very clean and comfortable. The staff at the front desk was very helpful. The pools were spotless. Close to lots of restaurants & stores. Getting to Disney was a breeze. Would definetly stay again.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "cheapprincess", "Title": "“Don't listen to the horror stories!”", "Author": "cheapprincess", "ReviewID": "UR26619282", "Content": "#1 great location #2 staff was helpfull #3 comfortable beds #4 clean If you go to disney, what else do you need? You can add $700 moreand stay in a disney value resort. This hotel is very close to shopping and eateries, and a pizza to your room does not cost you 50 bucks. If your seeking a resort go somplace else. If you want to spend 10 hours a day in the parks and need a place to sleep, it is fine. Yes, it could use some updating, but the more money they put into it the more it will cost. My only complaint is the WIFI did not work one day when it was REALLY needed. They were gracious with our complaint and even comped us breakfast. Every hotel in the area charges the $10 per adult resort fee. It is to pay for the free shuttle to and from the parks. The times for the shuttle were undoable for us, so we never used it. I would stay here again. Clean, curteous and a comfortable bed, that 's all we require when we stay somewhere.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Uxbridge, Middlesex, UK", "Title": "“Noisy, Hotel between i 4 & 194 Major roads. Free Breakfast useless...”", "Author": "lexgjackson", "ReviewID": "UR26328100", "Content": "The hotel is between 2 major roads and Very noisy, even with the doors closed. The pool was not heated and cold, no shade around any of the pools. All the balconies are too small to put anything on, so no one used them, (what is the point,,) The breakfast was cerials (no milk to be found) coffee only, and stale bagels. So all had to toast them on the small 4 slice home toaster, worse than quieueing in the parks. worst I have ever seen. so did not bother after the first day. Rooms were clean and recently re-furbished, (our safe was missing..) No security at all, drinks machines on ground floor had been broken into, for cash. Did not feel very safe. loads of noisy kids staying overnight for a large Church meeting at the hotel on Sunday.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "perth", "Title": "“Great Location, close to Disney world, seaworld dinner shows ect”", "Author": "Danni091", "ReviewID": "UR26181669", "Content": "Was pleasently suprised. After reading some of the reviews i was a little scared but it turned out to be a gem. Big rooms which were nice and clean. Easy check-in and out. Close to Disney world 15 mins approx and seaworld about the same. Located off a main highway with a great secetion of food. Mini golf round the corner and close to all the dinner shows. Breakfast was not to bad but had to pay extra to have hot breakfast as the breakfast included was only for cerals ect. I would stay here again.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "south carolina", "Title": "“Watch out for unauthorized charges”", "Author": "activefam", "ReviewID": "UR25295284", "Content": "We booked the hotel throught hotwire. We got a good deal $33.00 dollars a night. As soon as i found out the hotel name I called and they informed me of the resort charges that they charge. I was fine with that. So at check out I was charged a total of $12.00 for resort charges and taxes. A few days after getting home I checked my checking account and found a charge from the hotel that I did not authorize. I contacted the hotel and I was told I would get a refund in a few days, which never happened. So I called back and was told the same thing. After 2 weeks i went to my bank and the lady at the bank tried to call and get it taken care of, they gave her the run around and said the would call her back and never did. So I had to dispute the transcation at my bank. This hotel took money that they had no right to and then did not want to give it back. Be careful.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“Great Value - don't let others scare you away”", "Author": "Jeffreyisu", "ReviewID": "UR24802440", "Content": "Like many others on here, we booked through Priceline.com by naming your own price. We picked $35 per night and this is the hotel we got. I was very concerned at first by reading all the negative posts, however the hotel is clean and did just fine. My wife and I went to Disney for a Valentines getaway weekend. The rooms were actually pretty spacious for 2 adults, it was clean, somewhat outdated, but many hotels are the same outdated status and asking over $100 per night. There are extra charges, $5 plus tax per night for a parking/resort fee. However, all these people on here claiming \"hidden fees\" and \"Surprise charges\" simply didn't read what they signed. In BOLD print right under where I was asked to sign at check in, it stated there would be a $5 per night charge. Overall a great visit!", "Date": "February 19, 2009"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Runaway! Runaway!”", "Author": "krommec", "ReviewID": "UR24782671", "Content": "When hotwire was giving this place away for $28 a night, that should have been my first clue. The people at the desk were nice, our room was clean but OLD, but a lot of things were just not right. The room didn't have an alarm clock. We called the front desk for a wake up call that never happened -- luckily my husband wakes up pretty early on his own. There were what appeared to be urine stains on the wall in the hallway. The other clientele was, well, more of that you'd expect to see in a cheap roadside motel. I didn't feel safe leaving our luggage in the room and we therefore took it with us when we went out for the day. So, we only stayed for one night and booked another hotel for the other two nights.", "Date": "February 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "local", "Title": "“A hotel disaster”", "Author": "fooddood", "ReviewID": "UR24764846", "Content": "Some of the nicest staff working at the worst property ever. the hotel is going through a conversion from hyatt to ramad but these guys are a mess. on top of little training for the client support folks who are nice, but poorly equiped...the following didnt work... phones and wifi in an entire segment of the hotel shower in my room key in my room run away until they sort out their problems", "Date": "February 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Millis, Massachusetts", "Title": "“Don't judge a hotel by it's looks!!!”", "Author": "travelin_tigger", "ReviewID": "UR24497263", "Content": "Although this resort is recently updated, it's basically superficial. New coats of paint and clean rooms give it a great look, but once you're in the room, that's where the problems start. In my room, the heater/air conditioner/fan unit didn't work at all. Come to find out, there were numerous complaints I heard at checkout - no hot water, no heat, etc. and that was in the 5 minutes I was there. One furious guy asked to speak to the supervisor and was told the supervisor wasn't in and they wouldn't help him. Also be aware of the hidden resort fee: $10.65 attached per day and not told of up front. Other than that, location was great and that’s the only good thing about it!!!!", "Date": "February 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta, Ga.", "Title": "“Look out for rip-off charges and skewed star ratings”", "Author": "reid77", "ReviewID": "UR23975682", "Content": "We had a three-night resort stay booked in Orlando, but decided to tack on an extra day at the very beginning. We booked this property via Hotwire for $33 per room per night ($47 with taxes and junk fees) and we booked two rooms total. Obviously, the price was nice, but we still felt baited and switched. But first, let's mention the positive: the rooms were perfectly adequate, the beds were very comfortable, the gym was good for a property at its level (I'm a workout addict) and the staff was largely pleasant to deal with. Sleep was quiet and undisturbed. However, on the negative side, despite my booking via Hotwire (which is supposed to be 100% prepaid, barring incidentals like phone calls and on-site dining) the property decided to charge me some previously undisclosed fees: $5 (plus tax) per car for parking (which is OK in a downtown area but on a sprawling property next to the interstate? C'mon!) and another $5 per room (again, plus tax) as a \"resort fee.\" Needless to say, I began the stay feeling ripped off, which isn't a good way to make your guests happy, and I've complained to Hotwire about that too. The price should be the price, and any mandatory extras should be fully disclosed online. Finally, Hotwire represented this property as a three-star. Now, in my experience a three-star is a building where the lobby can be reached from a guest room via an elevator ride (i.e. \"minimal full-service\" like Holiday Inn and Radisson). In this case the rooms were in clusters of 20 or so, in two-story buildings spread throughout the property and exterior stairways. To get to the lobby from nearly any room was a serious hike -- that's a two-star motel to me, not a three-star hotel property. On top of that, the guest areas needed work -- lots of scuffing, missing paint and needed maintenance. Bottom line: had it been two-star rated, and had I not been charged the extra rip-off fees, I would have been perfectly happy with the stay. With all that, no way.", "Date": "January 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Definitely not usual Ramada standards, but OK.”", "Author": "MapleScotland", "ReviewID": "UR23891464", "Content": "My husband and I stayed at this hotel over new year. On first inspection the property looks OK. The lobby is nice, but the rest of the main area could do with updating. The staff on the front desk were extremely slow and their lack of attention caused us big problems on the first night. To cut a long story short they forgot they had allocated us our room, allocated it to someone else a few hours later and we were woken from sleep by someone entering our room. Scary!!!! The property is motel style with small blocks of 10 or so rooms, so I didn't feel very safe in the first place. The grounds are huge and not very well lit so trying to find your block is a nightmare. The room was ample size, clean, had a comfy bed and had all basic amenities. The decor is abit dated though. Breakfast was very reasonably priced and they had a good selection. There is a small shop and the staff there were friendly and helpful, as were the staff on the concierge desk. There are a few good restaurants and a supermarket within walking distance. The hotel is next to the highway so Disney can be reached in approx 10 -15 mins and Universal 20-25 mins. There are small pools throughout the grounds, but we didn't use them so can't comment. They looked OK though. Overall I would say that this hotel was OK for a budget break. You don't spend alot of time there anyway when you are at the theme parks all day. I would stay there again if I had to, but wouldn't choose to. Definitely not up to Ramada's usual standards.", "Date": "January 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“Stay away from the Ramada \"Convention Center\" Celebration!”", "Author": "pinkchicago", "ReviewID": "UR23437972", "Content": "Our flight back home to Chicago on Christmas Eve was cancelled due to bad weather in Chicago, so we had to find a room to stay one additional night in the Orlando area. So we booked the Ramada Celebration Convention Center sight unseen through calling Expedia from our rental car. When we arrived, the appearance of the property and the unsavory people walking around worried us. It was night. My husband checked in and drove us to a remote motel style building. You could tell that some people actually live in this motel because some of the people had Christmas lights hanging in their hotel room windows. As we were about to get out of our car and go into our room we saw a Ramada security/staff person running around the outside of the motel building we were about to enter. He seemed as though he was searching for someone for an unknown reason. My husband told me to stay locked in the car and he checked out the room. Neither one of us is too picky, but he said that it looked so bad and the property didn't feel safe, so we weren't going to stay. We called Expedia, who called the Ramada. The Ramada refused to give us our money back even though all we did was look at the horrible place, but thankfully the Expedia representative told me that she would give us a full refund. Due to Expedia's understanding, we will absolutely book through them again. My husband had to wait almost an hour to give back our room key and tell the Ramada staff that we weren't going to stay there. The Ramada staff was rude and did nothing to try to apologize. Since we still needed somewhere to sleep we ended up walking into a Holiday Inn on the same street (also in Celebration) and we were happy with the room, the safe surroundings and comfortable beds.", "Date": "January 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“value can't be beat”", "Author": "kimmygpt", "ReviewID": "UR23207086", "Content": "Booked through hotwire and got a great rate. So much so that I wasn't expecting a lot but was pleasantly suprised. Clean room, with comfortable beds and accomadations. Heated pool that was shared between 4 buildings in a pod, so it was private and conveinent. There was no refrigerator but rented one for $5 a night which was well worth it. Very close to Disney and restaurants. Worst experience was that I had to recheck in because the reservations were under 2 names and they couldn't get it right.", "Date": "January 2, 2009"}], "HotelInfo": {"Name": "Ramada Orlando Celebration Resort & Convention Center", "HotelURL": "/ShowUserReviews-g34352-d656339-Reviews-Ramada_Orlando_Celebration_Resort_Convention_Center-Kissimmee_Florida.html", "Price": "$87 - $113*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6375 West Irlo Bronson Memorial Highway</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34747</span></span> </span></span></address>", "HotelID": "656339", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a1/0a/a10a52a9d9c0f2d9f0ba916520bf80f13large.jpg"}}