{"Reviews": [{"Content": "Its ok if you want to cook for yourself I have to agree with all of the comments of the previous reviewer. In fact he covered all aspects (even that awful lift) even better than I could have.Like him I only stayed here because the Crowne Plaza was full. I did have difficulty finding the place and thought it in a very odd location too I drove past the turn off twice because I thought it couldnt possibly be in amongst the paint and car body shops.The one thing I had a smile at was that all the rooms were touted as having a balcony. The thing was, as already mentioned, there was nothing to look at even if you did want to go out there and secondly the balcony was so small and narrow that you would only be able to stand (probably sideways if you had large feet) so not exactly somewhere you would sit and relax.The place is fairly new and adequately furnished. I did find the Internet connectivity a bit of a challenge - first time I stayed I didnt know I had to tell them on reception that I wanted the $20 per day deal so then I had to call down to get them to set me up and then wait for some time before they got back to me with a [great long] pin number that I had to key in. And then because I didnt tell them I needed it for more than one day I had to go through the ordeal all over again the next time I wanted to use the Internet. The plus for me has to be that I can cook for myself. I get very sick of room service food. Also I really do like the staff on reception, which is something I have found with all the Quest properties I stay at. They are always friendly and accomodating.I certainly would never stay there without having transport but when I do go to our Sydney office now I do tend to prefer to stay at the Quest Castle Hills. To be honest I was getting bored with the Crowne Plaza having worked through their room service menu several times etc and I tried the Hills Lodge once but didnt like it. I really like to cook for myself so serviced apartments are always my preference.", "Date": "Mar 13, 2008", "ReviewID": "UR901459681", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "1"}, "Author": "BrisCaz"}, {"Content": "Business Time The quest, is unusual in many ways, none the least, the way you access it, its literally part of an light industrial estate, and i dont mean in the middle of one, i mean part of one. So you have to go in a driveway shared by 20 other business, drive past them around a corner down past more business and theres the quest, its actually hard to find the entrance as you just dont expect it to be there and the sign is pretty missable - very odd - in fact all the entrances are weird, my room had 2 lockable doors to enter it , this is so you can combine rooms but it is weird to go in one door to another then into your roomOnce you get past this bit, the quest seems to be semi new building or could be refurbished hard to tell.Quest is a serviced apartment type chain so each room has its own kitchen etc and non studios have washing machines etc. We were booked in here as the Crown Plaza Norwest was fullThe rooms are nice enough, and reasonably well apointed, no real complaints, bathrooms are smallish but more than adequate, although slightly more fashionable than functional in my opinion with very little vanity space - views are non existant from many rooms, as the building is a triangle type shape , so sort of look at each other, the other side of the building faces a busyish road and is noisy or looks across the carpark which is noisy in morning. Internet is through a 3rd party company who you need to pay directly, it is basically a ripoff like most hotels, with options by the hour or day, with the day rates being limited on data with low limits $40 for a couple of days and limited to couple hundred mb, is hardly generous. There is a largish underground parking area, which supposedly is secure, but in reality is open all day/night , there is a gym in the building as the only other facility which was pretty popular, there is no resturaunt of room service and there is NOTHING nearby so if dont go back to the room hungry without a car, if you have one however its a central suburb so there is all manner of stuff nearby. Speaking of location, you would have to have a reason to stay here in Castle Hill its 40km from the CBD about an hours drive in light traffic, and $10 in motorway tolls, if your a tourist visiting sydney then this is NOT the place for you or anywhere similar as its way outside tourist areas. The most annoying thing that sticks in my mind is the elevator, there is one and its the SLOWEST elevator in the history of the world, you can wait for 5 mins to even get in it and should you be on level 5 and have to stop on each floor, pack a sleeping bag. Overall, average place for above average price, The rooms are more than adequate and there are a lot worse out there, they are clean and comfortable but nothing special and the location is great if you are a rep visitng business or someone local otherwise look somewhere else.", "Date": "Mar 5, 2008", "ReviewID": "UR832381930", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "1"}, "Author": "MikekNZ"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d656659-r14267342-Quest_Castle_Hill-Sydney_New_South_Wales.html", "HotelID": "656659", "Price": "Unkonwn"}}