{"Reviews": [{"Content": "Romantic Christmas Trip we spent our romantic christmas trip in this lovely downtown hotel.the hotel is located in the heart of the downtown from which is possible to reach all the monuments by feet. the rooms were quiet, cleaned and scented. the staff was professional, friendly and efficient. i enjoyed our romantic christmas trip so much (I also made great christmas shopping).", "Date": "Dec 27, 2008", "ReviewID": "UR737757475", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "sofiePrague"}, {"Content": "A jewel The small Hotel Cosimo de' Medici was one of the highlights of our European visit which included a Mediterranean cruise and a few days in Italy. Tucked away just 5 minutes' walk from the railway station, accessible through a gated archway, it proved to be an excellent choice and a great way to finish the holiday. The desk staff were fantastic, speaking excellent English and happy to take the time to provide maps, directions, and advice on how to get where and also nearly places to eat. Although the place has a spare, humble look to it, everything was spotless, beds were comfortable, plumbing, windows and a/c worked fine, and the breakfast was delicious and attractively served in a charming breakfast room. Great European coffee served with a pitcher of hot milk. Our room was very quiet although there was a lot of foot-traffic on the sidewalk outside and all the rooms were occupied. The hotel has combined new windows with the old windows, resulting in about 4 layers of open-able windows! Our overlooked a small interior courtyard. There is a typically tiny European elevator to take you up to the second floor. For me, one of the best things about the De' Medici was the free fairly fast Internet available at a computer in the lobby. Helpful staff give you a password that is yours for the duration of your stay. I loved this little hotel and i overheard other travellers saying the same thing. From it, we walked easily to the Accademia, the Ufizzi, the Duomo, the market, the bridges, and the bus garage by the station to catch a ride to the airport. This is a great spot.", "Date": "Nov 8, 2008", "ReviewID": "UR591750523", "Ratings": {"Service": "-1", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "DLCAlberta"}, {"Content": "wonderfull On our recent trip to Italy, Florence, we were staying in COSIMO DE MEDICI a wonderful hotel in the centre of Florence. The location of the hotel is great, we were in the centre of everything.As well the accomodation and cuisine were very good with friendly and helpful employees. We wanted to share our excellent experience with others who may be visiting Florence in the future.K.D. Macan", "Date": "Oct 7, 2008", "ReviewID": "UR431842158", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "tukaka"}, {"Content": "Great location!! This hotel is located in the most convenient location in Florence. It is right across the street from the train station (Santa Maria Nouvella) and it is steps away from the great sites situated in Florence. It is definitely a comfortable hotel, as we stayed in a quad. If you are looking for a quaint place to stay right in the heart of Florence this is the place for you. And be sure to visit the restaurant a few doors down from the hotel for some of the best pizza. Although from the outside it may look a little unsafe, this hotel is truly a safe place to stay because they locked the gate at night and you had to be buzzed into the hotel after a certain hour. Safety at its prime.", "Date": "Sep 25, 2008", "ReviewID": "UR114008841", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "divaheart06"}, {"Content": "A convenient base to see Florence The hotel is located near the station which was only a short walk away. Set back from the road, it took two attempts to find it. The room was clean, the bed comfortable but the shower room was tiny, but adequate. The room had air conditioning and also had additional glazing to keep the noise out from the street.The staff were helpful and friendly and a good breakfast was provided. The hotel was very convenient, San Lorenzo Market and Mercato Centrale were just around the corner. Il Duomo was a 10 minute walk and the Palazzo Vecchio a 15 minute walk.I thought the hotel was reasonable value and perfect for our two night stay. I would definitely use the hotel again for a short stay.", "Date": "Sep 18, 2008", "ReviewID": "UR779327129", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Paddington58"}, {"Content": "not the greatest, not the worst well, the pictures dont tell the whole story. the rooms are small...but ok. The bathroom is miniscule. there is nowhere even to put a brush, let alone cosmetics. the shower is narrow and tiny and you are lucky if you fit into it. in our room, the tv barely worked and we could not access cnn or any other english network. as for that apartment that some people write about, the mattress is actually a boxspring, and the loft sleeping area is at the top of steep stairs. the bathroom, of course, is downstairs. For $165 a night, it is ok. you might be able to do better, but the only reviews i can agree with are those that say the staff is helpful and friendly. And, that an added perk is that internet is free and it is very close to the train station.", "Date": "Jul 3, 2008", "ReviewID": "UR903894411", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "PEZMOM3"}, {"Content": "Closely located to train station This hotel was excellently located within walking distrance to the train station. The staff were very helpful, happy and could easily communicate in English. Our breakfasts in the morning were good, there was excellent choice and the dining room it was served in was nicely set up but a little cramped. The rooms were back from the street making them very quiet in such a noisy city.Unfortunately the saying - you get what you pay for, really showed in this hotel. I did request mid range priced accommodation in Florence as it was very expensive to stay there. I found the room very dark and old but adequate. The lighting needed brighter globes, the window opened up into a small central area that people above strung their laundry across and the air conditioning units worked from. The bathroom had a little mildew on the wall and was very small but clean. The cords near the television had some exposed wiring so we had to be careful when using the outlet to recharge our phones etc. I found it a little depressing whenever we came back to our room but we spent most of our days out and about anyway.As I commented earlier you get what you pay for.", "Date": "Jun 28, 2008", "ReviewID": "UR640047688", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "5"}, "Author": "funnycarsummer"}, {"Content": "Charming, Friendly  Hotel Cosimo de'Medici is a wonderful quant/warm hotel. The decor is beautifully done, rooms are clean, computer friendly, parking if necessary, close to the train station (no cab needed), close to the duomo, uffizi, the market, not too far a walk to ponte vecchio (the old bridge), or even Piazza Independenza and Piazzia Signoria. The staff are wonderful, friendly and VERY knowledgable about every detail of Florence, surrounding cities, wonderful restaurants (that are not so tourist filled but the best of the locals) and speak several languages! You are in good hands during your stay there. I have stayed there many times over the years and it only gets better! You cannot go wrong to plan any time with Hotel Cosimo de'Medici, family, business they meet all your needs!", "Date": "Jun 2, 2008", "ReviewID": "UR851310429", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "lisavb"}, {"Content": "Friendly, Friendly staff We stayed here twice during out trip to Italy. The staff was super friendly. I cannot say enough about how helpful they were during our stay. The rooms were very clean and the beds were comfortable enough (for a european hotel). Each room had a small flat screen TV with CNN (for the non-Italian speakers, like me) and free wireless internet access. The hotel was affordable and centrally located. Even though it was close to the train station and on a pretty busy street, the rooms on the street had double windows that really helped deaden the sound.", "Date": "May 29, 2008", "ReviewID": "UR420400553", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "shelingas_sis"}, {"Content": "noisey, and because of a conservation law no a/c This hotel is located almost directly across the street from the train station. Don't use a cab. The staff was very friendly and helpful. They gave us great recomendations for eating. We arrived early in the day (815am) they held our bags and delivered them to our room while we went for a walk to start our exploration of this beautiful city. The room was very nicely furnished. The bathroom doesn't have ventilation except for the fullsize door/windows which if you like your privacy you won't have open while taking a shower. The location is the on a main street so if you leave the window open everyone coming home from the pubs walks outside making a lot of noise. Florence has a law that doesn't allow the use of a/c s during non-summer months. we had a warmer few days and couldn't leave the windows open, too noisey.", "Date": "May 2, 2008", "ReviewID": "UR228454464", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "2", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "fire9883"}, {"Content": "Great interior design! The 3d time I visit Florence鈥nd what a find! Florence itself is a maze of old buildings - this is really terrific, except when you find your room to be a little bit old, stained and ...even dirty, that鈥檚 not so uncommon in the city downtown.This is the first time that my room was spotlessly clean and looked brand new! I鈥檓 an interior designer and the hotel shows a marvelous work. Pretty good style, good light effects鈥he atmosphere is really enchanting and modern. Hotel鈥檚 central location (right in front of the train station, few meters from the Duomo and the Uffizi Gallery), free Wi-Fi, private parking鈥?and nice staff, even if you're not in a warm family-run environment...My only complaint is that Florence is so rainy in January鈥ut I don鈥檛 think the hotel is responsible :)", "Date": "Feb 8, 2008", "ReviewID": "UR460215592", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Suzy70"}, {"Content": "Good enough for the money In a great location - walking distance to almost everything. This place has free wirless too! Very hotelish if you know what I mean - but the rooms were clean and the bed wasnt too hard (they all are in Europe it seems). Overall - this is a good place for the money - clean but not luxurious. Would stay again.", "Date": "Sep 27, 2007", "ReviewID": "UR594855070", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "drtryba"}, {"Content": "Servizio eccellente e posizione strategica   showReview(23090010, 'full');", "Date": "Dec 30, 2008", "ReviewID": "UR900743989", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "piccolaxyx"}, {"Content": "Un hotel muy recomendable   showReview(22188660, 'full');", "Date": "Nov 25, 2008", "ReviewID": "UR186457017", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Poling"}, {"Content": "Tr猫s bonne adresse   showReview(19099514, 'full');", "Date": "Aug 19, 2008", "ReviewID": "UR806139353", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Parisnina"}, {"Content": "Perfecto y claramente recomendable.   showReview(16646523, 'full');", "Date": "Jun 3, 2008", "ReviewID": "UR538897433", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "KAIABILBAO"}, {"Content": "hotel a florence   showReview(15542016, 'full');", "Date": "May 1, 2008", "ReviewID": "UR354023109", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "franceMeriel"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d656738-r23028306-Hotel_Cosimo_de_Medici-Florence_Tuscany.html", "HotelID": "656738", "Price": "Unkonwn"}}