{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tyreso, Sweden", "Title": "“Excellent!”", "Author": "Cecilia W", "ReviewID": "UR127467271", "Content": "This hotel is a very good choice when you stay in Rome. The staff is very polite and helpful. They can answer all your qustions and show the way to museums etc. The breakfast is fine for example eggs, yoghurt, jucies, choco pops and milk and of course both tea and coffe. Very good cleaning and the bathroom is very pleasant. My tip is to sit upon the terrace on the topfloor, have some wine and eat Prosciutto crudo :-). The hotel is situated in a square so of course there is some traffic but me and my husband were not disturbed by that. You have the tram just outside the hotel that you can take to termini (metro) or you can walk 7 minutes to another metrostation. If we come to Rome again we will for sure stay there again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5"}, "AuthorLocation": "Cambridge. UK", "Title": "“Great Five Day Visit”", "Author": "Les T", "ReviewID": "UR127263155", "Content": "Entered the hotel and greeted by a warm freindly receptionist who spoke clear english. Exceptionally clean, modern room, comfortable bed, spotless linen and en suite. Continental breakfast was more than adequate, served with a smile. Staff gave helpful advice on trams/metro etc, where to eat (Il Tempio di Minerva, on Manzoni, 5 minute walk, excellent food) and best attractions. Would recommend and stay again", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey, UK", "Title": "“Fabulous small hotel - excellent value”", "Author": "JohnsonsGatwick", "ReviewID": "UR126337792", "Content": "We were a bit anxious when we approached the hotel as we were waiting for the catch. We'd got a great deal, the photos looked amazing, but there had to be a catch. There wasn't a catch. This is quite simply a fabulous little gem in the heart of Rome offering excellent value for money, a warm friendly atmosphere and lovely modern fixtures and fittings. I think one of the hotel's huge plus points is the fact there are only 12 rooms, so all the guests are treated like part of the family. With my reviews, I always try to be as objective as possible, but I really can't fault anything about the hotel. From a personal point of view, the bed was a little on the hard side, but that is purely my preference. The only warning I would give is that as the hotel is located at a busy junction, those who are light sleepers may benefit from taking earplugs, but the potential noise is not a reason to skip this hotel when making your selection for accommodation in Rome. The hotel is around 15 - 20 minutes walk along a straight road (so you can't get lost) from Termini (the main train station) and many attractions are within easy walking distance. We will definitely be going back, hopefully very soon.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "ross on wye", "Title": "“Weekend break in R ome”", "Author": "paul h", "ReviewID": "UR124828072", "Content": "What a lovely hotel. Very friendly reception staff, exceptionally clean rooms, very good continental breakfast. If there is one down side it is the hotel is a little out of the way. Saying that you can walk to the Colosseum in about 30 minutes and there is also the Metro station 5 mins away and trams and busses stop just round the corner of the hotel from about 7am till midnight.Would deffinatley stay at this hotel again.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bromsgrove, United Kingdom", "Title": "“Long weekend before Xmas”", "Author": "Alex218", "ReviewID": "UR122725569", "Content": "Lovely small hotel for a short stay ..clean rooms and lovely terrace on the rooftop .Continental breakfast was just enough( no cooking facilities/restaurant) but would be nice to have something cooked .The staff were very friendly and helpful with advice about getting around .The metro is 10 minutes walk away ( cheap tickets 1 euro for a single ticket valid for 75 minutes).There are also buses just outside the hotel that take you to the Colosseum, but you can walk there in about 20 minutes .The receptionist said that they were going to move to a 4 star hotel in spring/summer 2012. Disappointed with the sister hotel , Hotel Portamaggiore when we went for dinner there and had an awful meal , so eat elsewhere !!", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Great weekend”", "Author": "HeatherKennedy", "ReviewID": "UR119795543", "Content": "Hotel Latinium is a nice hotel in a so-so neighborhood. It's a bit off the beaten path but the hotel itself is small and nice. The staff were really helpful and the overall condition of the rooms was great (although, we were a little shocked that it's already considered 'winter' in October and the air con was shut off!). The metro is a half mile walk away (Manzoni) but there is a tram literally that runs through Piazza Porta Maggiore (either the 5 or 14) that run from the Termini. We only figured this out our last day and this would have saved quite a bit of walking and time! Also, bus 3 leaves from just outside the pizza shop and goes directly to the coloseum.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Loved the breakfest, very nice staff”", "Author": "gilbr3", "ReviewID": "UR119188763", "Content": "we spent 4 nights last december in rome, we had a'lot of fun and the hotel was just right, it is abit far from the center but we enjoyed the walks, the staff were really nice and helpfull, we liked going up to the roof every morning after breakfest to check the weather. except for coffe they dont serve anything hot or cooked for breakfest but we really liked it, simple and nice just like the hotel. very nice and clean bathroom (just a shower- no tub) small TV with no channels in english so don't think about watching any...", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Would stay again!”", "Author": "Marianne J", "ReviewID": "UR118616570", "Content": "Charming hotel and nice rooms! Great value for money! Not the greatest location, but several bus lines run right infront of the hotel making it easy to get around the city! Only a few blocks from a subway line as well! Desk workers spoke English and were very helpful!", "Date": "September 26, 2011"}, {"Ratings": {"Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Miami, Florida", "Title": "“Not Friendly/Very Rude Staff”", "Author": "IlleanaRica", "ReviewID": "UR116323195", "Content": "My family and I stayed at this hotel for 3 nights. We had traveled many cities in Europe and Rome was the first city we visited in Italy. The staff at this hotel gave us a bad taste of Italy. I felt like I was in a communist country! We were being watched all of the time. We reserved 4 rooms there and we were told we were not allowed to visit our family in other rooms! The concierge would scream at us and even once pushed me (I m a woman!) because he was upset that my cousin had entered my room! We had a horrible time in this hotel. Very rude staff, not friendly and really disappointed us of the Italians.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“lovely hotel, would stay again”", "Author": "Kazbob61", "ReviewID": "UR115590135", "Content": "Lovely hotel, bit of a walk from the centre but plenty of trams or buses to take you to the very heart of the city. Loved the roof top terrace. First impressions outside were it was on a busy roundabout/crossings of trams etc but once inside we didnt hear them, excellent sound proofing! Room was lovely, clean, spotless & bed comfy. Downsides - no hair dryer in the room, but one attached to the wall in the bathroom, so take your own. No milk just powder for making drinks which wasnt nice! Staff were extremely friendly & helpful. Would stay there again.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Boston", "Title": "“Stinky ventilation and improvised bed”", "Author": "heheman3000", "ReviewID": "UR114554835", "Content": "We booked Hotel Latinum for a short two-day stay in Rome. Our experience with it was not too memorable; for the money we expected better compared to our other accommodations in Italy. Lack of free Internet is deplorable for this price. We were in room 13 and there were two main issues that bothered us. First, there was something really funky about the ventilation in the bathroom. If we did not close the bathroom door and the AC was running, putrid bathroom odors emerged into the bedroom throughout the night, presumably from other rooms. This was a real distraction to sleep until I discovered that closing the bathroom door fixed the situation (I thought it was coming out of the air conditioner.) Second, the bed was made from two single-size mattresses lashed together, so that the middle of the bed was an uncomfortable jointed section with no support. The mattresses themselves weren't great either. I would expect better for a hotel at this price range. Otherwise, the hotel staff were very helpful in directing us to public transport, and breakfast was half decent. The hotel itself has a modern and clean feel. I would probably find somewhere else to stay next time in Rome, though.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Loved this hotel”", "Author": "speckled_one", "ReviewID": "UR114238251", "Content": "We stayed here in early June 2011 and have nothing to but good things to say about the room and the staff. The hotel is not actually the one in the photo (that is another hotel owned by the same owner) which made us a little suspicious just before we checked in - but once we did (in the much smaller hotel next door that IS Hotel Latinum) we were very pleasantly surprised. The room was spacious, clean and new. There was a balcony via our room that wrapped around the corner where we could stand and watch the lovely people, the Roman ruins and the crazy traffic below. The traffic noise is nothing a set of ear plugs can't block out. We loved coming back here mid-day for a little siesta, and just taking it easy after a long day walking around the city - it was a such an oasis for us. The staff we all so positive and helpful and always smiling. That makes all the difference for us. The breakfast was just what we needed, yogurt, breads, cheese and ham with aromatic Italian coffee and steamed milk. I'd absolutely give a rating of 5 out of 5 had it not been for the unfortunate restaurant recommendation we had from reception (Il Tempio di Minerva) - which wasn't their fault at all (but which we wanted to note). We would definitely recommend this hotel and look forward to returning some day.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hertfordshire", "Title": "“Lovely Hotel”", "Author": "Courtney_Brown2388", "ReviewID": "UR104902304", "Content": "I found this hotel via expedia. I was looking to visit Rome with 6 of my friends including my boyfriend, once coming across this hotel I was slightly concerned with regards to no reviews on it. But once arrived I was put at ease. I couldn’t thought anything on the Hotel at all, from exploring Rome I soon realised that things were situated all over the place in Rome. So Hotel Latimium was perfect, it was a 5 minute walk to the metro which took us everywhere we needed to be. This was our first trip to Rome for all 6 of us no neither of us knew where to go and the hotel staff were great to help out. The food was lovely, just what we needed in the morning. On the day we were due to leave our flight wasn’t until 9pm Sunday, they were more than happy to help us with the luggage storage for 6 people. Overall a great hotel and I would recommend it to anyone.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A great place to stay in Rome, good value and modern clean rooms”", "Author": "Rickers16", "ReviewID": "UR82061721", "Content": "Hotel Latinum was at first a little difficult to find (it isn't clearly labelled from the road) so definitely look it up on google maps so you know what you are looking for. It is a small hotel which makes it really pleasant and quiet compared to the larger hotels. The continental breakfast is very nice. The hotel is a little out of the centre of rome although the main attractions are about a 20 min walk away, alternatively the bus and tram stops are right outside so worth getting a 3-day pass from the metro/tobacco shops to be able to hop on and off as much as you like. The roof terrace was pleasant to sit up there at the end of the day as the sun sets. Nearby restaurants are a little bleak although if you take a right out of the hotel and walk to the set of traffic lights (less than 10 mins) you will see a great restaurant on your right (not overly priced) or alternatively a large supermarket to get stuff in.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Excellent base for exploring the Rome area”", "Author": "Collers1212", "ReviewID": "UR81397730", "Content": "The hotel is small with very friendly staff and is impeccably clean. It is situated on a busy Piazza approximately 1 1/4 miles from the Colosseum and the central tourist area that can be reached via a leisurely stroll in about 25 minutes. Alternatively the Piazza is criss-crossed with buses and trams enabling quick and easy access to all parts of Rome once you understand the route numbers. (The front desk can help with this.) Although the hotel is situated directly on the Piazza it does not portray the hotel name and therefore isn't easy to spot. It pays to check it out on Google Street View prior to your visit. We stayed for 6 nights arriving very late on the first night. The front gate was electronically locked but a buzzer on the post soon had it unlocked from within by the night desk porter. He made us very welcome and we were soon unpacking in our rooms. The hotel has three residential floors with about 4 rooms on each. The decor is modern and pleasing and the hotel is spotlessly clean. There is a small area opposite reception where a self-service continental breakfast is provided which is more than sufficient to start you off for the day. The hotel is non-smoking throughout but if you like the occassional puff as I do then take the lift to level 4 which is a lovely little roof terrace overlooking the Piazza where you will find tables and chairs and you may smoke here. This is a lovely place to relax with a glass of cool wine in the evening after a busy day sightseeing. Being just out of the main tourist areas means there is not an abundance of local restaurants but close by on the Piazza there are a couple of local pizza/pasta establishments which are passable but if you want a really nice meal turn right out of the hotel and almost immediately right onto the road leading into central Rome. About 2 or 3 blocks down look for a restaurant with tables spilling out onto the pavement on an avenue leading off to your right. The food and wine here was pure Italian, absolutely delicious and not overly expensive. The hotel has double glazing and very efficent air-conditioning. Being on a busy Piazza there can be a rumble of traffic at peak times but this always sounded distant and was never intrusive and our room was very quiet and comfortable. A small fridge is provided together with a kettle and tea/coffee facilities. The shower room is tiled throughout with a bidet and toilet and the water was always piping hot. I highly recommend this hotel but do bear in mend you cannot step straight out into the Colosseum, you either stroll, as we did several times, or take a short bus ride. Public transport is cheap and if you buy a 16 Euro 7 day pass you can travel anywhere on trams, busses, the metro and trains as much as you like. We took an excursion to Ostia Antica about 25 minutes by train from Rome using the same ticket. (Check out Ostia - it's amazing.) One word of warning when using buses - make sure you know when the last one runs. We stayed late in central Rome one evening only to find our busses had stopped. Don't despair if this happens, we took a taxi back to the Hotel. These are regulated with a meter and only cost us 11 Euros - a fraction of London prices.", "Date": "September 28, 2010"}, {"Ratings": {"Sleep Quality": "1", "Overall": "2.0"}, "AuthorLocation": "Drogheda, Ireland", "Title": "“No room at the Inn!”", "Author": "Berniebobcat", "ReviewID": "UR68980636", "Content": "I booked Hotel Latinum for our recent weekend trip to Rome on the basis of reviews that I had read on several travel websites. I had spent several hours trying to decide which hotel was best suited to our needs, so one can imagine the disappointment when we arrived at 10pm on our first night to be told that they did not have a room available for us! The gentleman at Reception was quite matter of fact as he explained that he would call a taxi to move us over to the Hotel President which was a few blocks away. He blamed an internet problem for the fact that several bookings were taken at a time when the Hotel was already fully booked. I can quite happily accept that rooms can be double booked due to errors, but I think it is unacceptable not to advise guests of the fact until they turn up on your doorstep, last thing at night. For this reason I would not recommend Hotel Latinum to potential guests.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Moscow, Russia", "Title": "“Modern design, a bit remote from the centre”", "Author": "Thaiss", "ReviewID": "UR38113489", "Content": "Compact urban hotel, with modern furnishing (quite recently renovated). Rooms are very small which is typical for Rome. Everything is clean. There is a tiny restaurant which is ok for breakfasts. Not a touristic zone, quite close to some railroad - a bit noisy. So in general the hotel is nice to spend your nights there. Sure you wouldn't stay in there when it is possible to be the whole day outdoors and enjoy Rome, its sights, food etc. The underground is ten-minutes walk from the hotel.", "Date": "August 19, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Netherlands", "Title": "“TO BE AVOIDED”", "Author": "vantooren", "ReviewID": "UR37650240", "Content": "Hotel Latinum was the only thing that ruined our trip to Rome: located in a distant from center, noisy ( extremely noisy!) place, with noisy room - basically we could not sleep at all during the night. the air-conditioning in the room was very loud, even the electricity box located in the room was making terrible noise. we thought it was only a problem related to our room - no, our neighbors had the same issues. in addition, it is quite far away from downtown; one needs to use the bus service or metro. you can't simply walk - if you return late, then you must use a taxi ( rip-off). there is no restaurant in the hotel so if you want a dinner close-by - you should use some local restaurants recommended by the hotel, where again you are being ripped-off by the waiters and annoyed by street musicians. so if you want to have no sleep in the night, be constantly tired - chose Latinum Hotel.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“Modern decor; a bit of walking”", "Author": "ipbsln", "ReviewID": "UR35317409", "Content": "The decor is very modern, and the hotel is quite comfortable. The rooms are not very large, but quiet and decently appointed. The breakfast is very basic: cereal, cake, croissant, jam and fruit salad with juices/coffee/tea. I wish they would add a few things more. The bathroom was fine, although the flushing mechanism could use some work since it requires a lot of pushing. The staff is reasonably friendly, although some are better than others. Its a 15 minute walking distance to the Mazoni subway stop, but in Rome everything is at a distance from the subway since the system is very rudimentary. Internet is a bit pricey. The only negative thing is that it is a bit difficult to find the hotel. Remember, its right on the traffic circle, not located on any streets branching off the circle. I would suggest they at least put up a board with their name. Tip: Take the 571 bus to the Pantheon and other tourist places, and that bus departs from just a few steps to the right. Invest in a bus map, since the buses go everywhere. On the whole, I would stay here again.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Lahaina Hawaii", "Title": "“Great value for Rome”", "Author": "mauiguys", "ReviewID": "UR31667233", "Content": "For starters, let me just tell you that rome is a dirty, crowded, tourist trap of a city covered in grafitti and trash everywhere except the Via Veneto, and most people you encounter aren't overly friendly. Also, by the time you leave you'll be sick of pizza, pasta, gelato and paninis because that's all you can readily find. We were there for 6 nights and think that 3 would have been plenty of time. Such a pity that a city with so much history left such a bad impression. We will never go again and my advice would be for nobody else to, but if you must go this hotel is a good choice. Now on to the hotel review..... We arrived at the Termini station at 11 a.m. after 36 hours of traveling. we took the Leonardo express from the airport for 11 euro each. I had previously done a Google Earth search of the hotel and knew that you just had to turn left out of the station and walk down Giovanni Giolitti and you would bump into the hotel at the Porta Maggiore. Alas, it was that simple. A 15 minute walk and we were at the hotel. As others had previously mentioned, there is no signage whatsoever on the hotel, just the number 11, so I'm glad I had seen traveller photos from this site because it made it super easy for me to recognize the building. The iron gate was open when we arrived so we didn't have to use the buzzer. The building itself made a great first impression. A little gem in the middle of a bunch of filth. It was 11:15 and we were praying we'd be able to check in early as we were soo very exhausted but were not expecting to since they only have 12 rooms. We walked down the walkway to the door and the tiny little lobby/ breakfast area is so clean and the glass floor with the ancient ruins underneath is cool! There were two ladies at the front desk who were both very nice and to our surprise our room was ready! As one of them took our info, the other pulled out a map and started to show us how to get to the Manzoni subway station and the stops for the various historical sights around Rome, etc.. I gave them 5 Euro each which I have always found sets a good tone for any trip. :) We took the little elevator to our room #33 and were so impressed at how new everything was. It was obvious they gutted the building and started from scratch. We opened our door and were so glad that the room was as clean and new as the pictures showed. It may sound funny, but that is one of our top priorities! We got to the window and.. cool! we have a balcony! One of only two rooms with one. O.k., time to get clean and take a nap. But not so fast...I expected noise as others had mentioned it before, but even with how well the room is insulated with very thick double pane glass and carpet, it's incredibly loud. Bee boo, bee boo, bee boo, there was a siren every 15 minutes in the daylight hours and about once an hour at night. It seems the Porta Maggiore is a freeway off ramp? When the trains go by the entire building rumbles a bit. You do get used to it though, a \"white noise\" if you will. :) A few other things to mention so you aren't surprised. The beds are very firm, which is what we love and have at home, there is no tub, only a stand up shower, which is what we love and have at home, they didn't change our linens after the 3rd day, so on the 4th we left a note for the housekeeper to change them and she seemed to be taken by surprise, there is no iron / board and there really isn't room for one so we didn't even bother asking for one, there is very little shelf space in the bathroom, the towels are a very thin European type which we grew to LOVE, I didn't get any wifi signal in the room, but I found a free hotspot right past the newsstand around the corner, and yes it's a long walk to anywhere, but Rome is a walking city and I don't think it would be much closer no matter where you stay, don't show up for the breakfast before 7:30 as we did at 7:25 by accident on our first morning and were shooed away by the mean night guy that others have mentioned here, and most importantly, don't forget to tip! Leave a 2 Euro at breakfast, a 2 Euro on the bed for housekeeping etc... it turned the mean night guy into our best friend by the time we left. :) Be sure to go up to the terrace on the roof. It's so nice a have a glass of wine up there at night and watch the hustle and bustle below :)", "Date": "June 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "chattanooga", "Title": "“Great Hotel, not crazy about the location”", "Author": "stellarspacey", "ReviewID": "UR20423399", "Content": "The hotel was excellent and i have no complaints about the room, service, cleanliness, breakfast. we had 4 day stay in Rome (3 nights here) and with a tight schedule we were walking quite a bit each day. my only complaint is that i did not think that the public transportation was really close enough to this location and there were not many nearby restaurants.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Hidden Gem in the Piazza di Portamaggiore”", "Author": "peepthischica", "ReviewID": "UR15780771", "Content": "I saw this property listed on Expedia but not for the full duration that I needed. I contacted them directly....and lo and behold, they did have a room available for me. And they gave me a bit of a discount for the rate listed on EXP. Andrea is the person who helped me make the reservation and was very nice. I did not think I was the greatest candidate for solo travel if public transportation was part of the plan, BUT there right outside the hotel, there is a bus stop, tram stop and taxi stand. This made it so convenient to go anywhere in the city. Literally, every site I visited was reachable within 10-25 minutes. The termini station is 10 minutes and 2 bus stops away and that connects you to anyplace in Rome, the rest of Italy and beyond. I booked a double room for single use, which was a great option....some of the other single rooms I saw from pics at other hotels were literally the size of my closet. Quite the contrary here, there was plenty of space for everything I lugged along with me. The beds were a bit hard, but I have a pillow top mattress at home and anything less is hard to me. The shower had an adjustable shower head and the water was always hot (I take long showers). There is no room service in the hotel but they serve a continental breaakfast daily and have a bar where you can get a drink at any time. The key card operates the remote control to the lights and a/c or heat in the room. Someone else mentioned the person who worked at night - Carmelo...but he was perfectly nice to me and very helpful. The whole staff was very helpful in getting directions to anywhere in the city (and I am directionally challenged). My room was on the 1st floor off the street and there was a bit of noise, but not really early or too late. I did open the window (the breeze at night was so nice), which magnified the noise level by 10, so there was pretty good soundproofing - it was just not completely noise/sound-proof. I would highly recommend this hotel to anyone. I only wish their rating here was a bit higher so other people could try them, too.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Wales", "Title": "“Nice Hotel”", "Author": "IestynH", "ReviewID": "UR15512353", "Content": "We chose to stay here based largely on Tripadvisor reviews and were not disappointed. It's a good, comfortable, clean and welcoming hotel, and not at all far out if you've got no fear of public transport. Our room was facing the piazza, so a little noisy first thing, but tolerable - it's Rome! Minor quibbles: a) The shower had what seemed like a thermostat problem, which the staff said 'is working ok' but they'd obviously not climbed in! b) Mini-bar but no kettle c) 40-odd TV channels, but all in Italian. We got the weather, but missed the news Plus points: i) breakfast was included, good standard continental ii) tram and bus stop right outside. Use them to get to the metro at Vittorio Emanuele and you're no more than 30 minutes from anywhere. iii) nice restaurant opposite, as well as a pizza snack bar.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, NC", "Title": "“Beautiful, affordable retreat close to historical center of Rome”", "Author": "Bergerocks", "ReviewID": "UR12759708", "Content": "What an extraordinary little hotel off the beaten path! Within walking distance to the main historical attractions (the Colosseum, Palatine Hill, Nero's Golden House, the Sacred Steps, the Capitoline Museum) yet far enough away from the throngs of tourists that visit the city year-round. The evenings were nice and quiet (the rooms have sound-proof windows) and during the day the bus stopped literally five feet away from the hotel for easy access to tourist areas. My husband and I discovered the wonderful underground Metro system, which allows for daily tickets or these great weekly tickets which provide unlimited use of the Metro for around 18 Euro per week per person. The nearest Metro station (Manzoni) was only a few blocks away and right next to a large supermarket that offered toiletries and of course fresh deli meats and wonderful cheeses (not to mention superb Italian wine) that we would cart back to the hotel for a snack after long days of sight-seeing. I can't say enough about the Metro! We boarded at Manzoni station and within 20 minutes we were outside the walls of Vatican City across the Tiber River! Do mind your bags and wallets, however, as the Metro can get extremely tight and skilled pick-pockets are about. The hotel itself was a beautifully refurbished building with a free continental breakfast every morning (fresh espresso or American coffee, fruit, croissants and other rolls along with deli meats and cheeses), a gorgeous terrace on top of the building that boasted quaint bistro tables and chairs with a neat view of the Porta Maggiore (ancient city walls) and of course a wonderful, friendly staff who were always ready to answer any questions about the sights or to recommend shopping or good restaurants nearby. All-in-all a wonderful stay, and we can't wait to go back in the summer time! The only negative aspect of the hotel that comes to mind were the firm mattresses which, if you have back issues like I do, may cause a bit of soreness but we just took the extra blankets in the closet and softened my side which worked fine. Also, be mindful of the automatic heat system in the rooms. If you don't like it too hot or too cold, be sure to adjust the thermostat in your room immediately upon entry as the heat kicks on automatically when you place your room key card into the slot next to the door (really neat system though). Other than that the stay was wonderful and we were sad to leave! We would definitely recommend this hotel to couples on a honeymoon!", "Date": "January 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chalfont, PA", "Title": "“very cute place”", "Author": "lulush91", "ReviewID": "UR10542175", "Content": "The employees at this hotel were wonderful, especially Andrea and other young women. He helped me with any information i needed, and even called to get me a refund for cancelled train. The only person i didn't care for is Carmelo (old guy who worked night shift) who yelled at me after i asked him for a 2nd towel (i have long hair, and they use waffle towels that are paper thin) and told me i am only allotted one towel per day...that really wasn't necessary….i stood speechless, as there was nothing I could say to make him understand anything. The rooms were nice, and clean…although small, but that’s expected in all of Europe. The hotel was recently renovated, and I thought they did a very nice job, the terrace on the roof was very cute. I would definitely stay there again. The train (Roma Termini) was close by, and we walked everywhere, but still it wasn’t right where the touristy places were, so that was nice.", "Date": "November 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kansas City, USA", "Title": "“Great value in Rome”", "Author": "pericson", "ReviewID": "UR8665058", "Content": "First place we stayed in Italy and the Hotel Latinum set the bar high. This hotel is perfect for visting Rome. It is close enough to be in the center in 10 minutes, but off the beaten path for a relaxing and comfortable nights sleep. The hotel was spotless and quiet, the showers were hot, A/C was cool, breakfast was delicious, and staff worked hard to make the stay as comfortable as possible. The restuarant Carmello recommended nearby was fantastic, in fact we decided to go there again before we left. The rooftop terrace is a beautiful spot to enjoy a glass of wine...weather permitting. Overall wonderful hotel!", "Date": "September 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Welwyn Garden City, United Kingdom", "Title": "“Highly recommended”", "Author": "robbycox", "ReviewID": "UR8398343", "Content": "I must admit i booked this Hotel with just the 2 previous reviews by to go on, they both gave glowing write-ups and seeing as how we only paid £140.00 for our 2 night stay, I had high hopes for this hotel. I’m glad to say we weren’t disappointed. In fact we were absolutely delighted with our stay there. The room, on the 3rd floor with a balcony, was spotless. The bathroom, with shower and bidet was absolutely pristine. All very nice indeed. House keeping was great with clean towels provided and the room tided, even during our brief 2 night stay there, something that in our experience, not all hotels do when only booked in for a short break. The hotel itself is an older building that’s been renovated to an exceptionally high standard. The English speaking staff were always helpful, courteous and polite. The hotel is on a busy junction but with the shutters and/or door shut you rarely hear any traffic noise at all and it certainly is entertaining to watch how the cars and mopeds dodge each other! The air conditioning worked superbly and was very welcome after a day of visiting the sites and walking around Rome. Whilst the other reviews recommended walking up Via Giovanni Giolitti to get to the Termini I’d recommend walking up Via de Porta Maggiore to the underground station Vittorio (Manzoni underground station was closed) instead, the walk is certainly no longer than walking to the Termini, in fact if anything it’s shorter, and it’s a much nicer walk with (what I’d call) proper Italian coffee bars and shops to look in! All-in all a great stay in an historic city made better by the high standard of a very reasonably priced and lovely hotel.", "Date": "August 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Staffordshire", "Title": "“Exceeded our expectations”", "Author": "PearlyPotter", "ReviewID": "UR8219384", "Content": "We spent 6 nights at the Hotel Latinum from 9th to 15th July. We chose the hotel at short notice based on 1 Trip Advisor review and hoped we had done the right thing. We were not disappointed - the hotel hasn't been open long and is in an older building that has been beautifully restored. The decor is contemporary with carpet on the bedroom floors and dark wood furniture. The air conditioning was most welcome whenever we returned to our room and we had it on throughout the night. There's double glazing so any traffic noise isn't intrusive but it would be noisy if you had the windows open during the day. The bed was firmer than I like but I used a couple of blankets folded under the bottom sheet to soften it. The bathroom was spacious with a great power shower (no bath). The dining area is off the reception area and the inclusive breakfast was continental type with plenty of choice - a bonus as we often stay in hotels where breakfast incurs an additional charge. The staff were welcoming and most helpful if we needed anything. The hotel was located about 1500m down a straight road from the Termini and we found this to be a very convenient location (walking down a parallel street is prettier where there is a supermarket and a famous ice cream parlour). Some of the area around Termini is a bit run down but we felt safe walking back to the hotel in the evenings - and there are plenty of buses and trams that stop right outside the hotel. In overall terms we had a super holiday in Rome and would be happy to recommend this hotel to others.", "Date": "July 23, 2007"}], "HotelInfo": {"Name": "Hotel Latinum", "HotelURL": "/ShowUserReviews-g187791-d656843-Reviews-Hotel_Latinum-Rome_Lazio.html", "Price": "$119 - $219*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Piazza Porta Maggiore 11</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "656843", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a3/cb/a3cb708a4e22dc8bdc610f8f4f392c565large.jpg"}}