{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Great value for family”", "Author": "mojo1107", "ReviewID": "UR126467259", "Content": "We booked this hotel for 3 nights because it seemed to be well located, reasonably priced and could sleep 2 adults and 2 kids. We were not disappointed, although strange entrance/front desk, staff were very helpful. We got our parking spot in the back as promised, room was big and clean (a little musty, faint smell of stale smoke). Location was fantastic, s-Bahn a block away, subway 5 minutes away, many restaurants and shops in the area. This is not by any means a five star hotel, but if you are looking for well priced, comfortable place to crash after a long day of sightseeing, you will not regret staying here.", "Date": "March 21, 2012"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Worth for what I have paid”", "Author": "Cherrypratiwi", "ReviewID": "UR116833283", "Content": "Been here for a week during my visit to Berlin. Found this hotel and booked it online and surprisingly cool!!! Spacious for 3 bedrooms room with full kitchenette where we could cook for our food. Close to city, few blocks to Ulrich for groceries and Karstadt as well as C & A. 5 minutes walk to S-Bahn and bus station. One spacious bathroom with bathtub, nice dining room, daily room service.", "Date": "August 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Great service and kind attitude”", "Author": "Metayel35", "ReviewID": "UR97185009", "Content": "We would like please to thank the great staff of this hotel. Our stay was a pleasure. The hotel is located in a very good area, with a parking space. The staff did everything to make us feel welcome, comfortable and wanted. They assisted us with all needed logistics and tourist information. See you again soon.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Basic and worn, and very loud at night due to trains”", "Author": "J0_mc", "ReviewID": "UR80436608", "Content": "1. Was the hotel close to things (e.g. transport, attractions, restaurants)? 2min walk to train station, 15min walk to city areas. Many restaurants nearby. About 15min on train to city. 2. Was the hotel in a safe area? Yes. 3. Was there much noise at night? Too loud. Our room was right next to the train line - maybe 15m away!! All night we could hear trains rumbling past. There was also the courtyard of a local restaurant under our window, and we could hear the staff emptying the bins / chatting on thier mobiles out there until early morning. 4. What was the quality and cleanliness of the hotel furniture and fittings like (e.g. bed, lock-up safe, shower)? Basic furniture, a bit old and worn looking, but functional. Pillows very uncomfortable. There was a safe present. The toilet was very odd, with a platform at the back of the inside of the bowl, which made using it fairly unpleasant! 5. Do the hotel staff provide a good service (e.g. competence, attitude, availability)? Although staff seemed to be friendly in general, i felt like i was asking a lot for basic requests. The staff seemed to find it odd when i asked for a second pillow, and could only locate a huge one with no pillowcase after a lot of searching. Over 5 nights it was never provided with a cover, although i left it for the cleaners to see. I also asked staff if there was a laundromat nearby and they couldn't identify one, even though thier hotel had no washing machines or laundry service. 6. What were the hotel amenities like (e.g. breakfast, restaurant, pool, bar, car parking)? None of these amenities available. 7. Did the room come with extras (e.g. minibar, TV, internet, air-con, tea making facility)? Small fridge available, TV, and air con. 8. Other / general comments: Very basic accommodation, and very loud. OK for a rough traveller perhaps.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brasilia, Brazil", "Title": "“Good price & central”", "Author": "F_Velame", "ReviewID": "UR24159132", "Content": "I stayed in Berlim for two nights, and the Vega ApartHotel was a good option. It had triple rooms, what was useful for me. The building is located very close to the S-Bahn tracks. As it was winter season and the windows were closed, it was OK. But if you are sensitive to some noise, it may be a reason for complaining. I would suggest the Hotel to reform the sound isolation. The Hotel is ruled by some russians, and they are nice and kind. There was no breakfast, but there is one starbucks coffee not fair from there. The subway (U-Bahn) is also very close. It seems (as an ApartHotel) that you can also rent a room for longer periods, what can be useful for people who will temporarily work or study in Berlin.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montevideo", "Title": "“Excellent for the price”", "Author": "uy_best", "ReviewID": "UR15121441", "Content": "Altough the entrance to the apart-hotel (and the reception) are very strange, we found this hotel excellent for the price we pay. The rooms are very spacious, and is very close to many shops, supermarkets and public transportation.", "Date": "April 18, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Excellent place to stay!!!”", "Author": "jones_v", "ReviewID": "UR11199641", "Content": "The outside does look a bit worrying but as the other review says dont be put off, I stayed here with 4 friends and the size was perfect, it was clean and the noise of the trains wasnt bad at all We had a bit of trouble finding a decent pub as they were all very small locals or restaurants which isnt good when you just want a drink and not food aswell but the Irish bar in the Europa Centre is perfect. Your right in the middle of everything and the train station is about 10mins aay and can take you pretty much anywhere, the Zoo is a definite go see!!! I would definitely recommend this to anyone!!!!", "Date": "December 2, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Great Location”", "Author": "Capo1980", "ReviewID": "UR10817039", "Content": "When you arrive at the hotel don't be put off by the reception area! It seemed a little dodgy at first but once I saw the room I was extremely happy! The apartments are large and the showers are great. There is a little noise from the trains but it did not disturbe my sleep. The hotel is about 2 minutes walk to the U-Bahn (underground)and about 5 mins walk to the Zoo station for the S-bahn (overground). Journey time to the tourist sites from both stations is maximum 10 minutes. It is also about 2 minutes walk to the main shopping street. The Europa centre is 5 minutes walk - it contains lots of nice places to eat at a reasonable price. There is also an Irish pub if you feel like a pint of Guiness.", "Date": "November 14, 2007"}], "HotelInfo": {"Name": "ApartHotel Vega", "HotelURL": "/ShowUserReviews-g187323-d656865-Reviews-ApartHotel_Vega-Berlin.html", "Price": "$64 - $197*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Uhlandstrasse 185/186</span> | <span class=\"extended-address\">Charlottenburg</span>, <span class=\"locality\"><span property=\"v:postal-code\">10623</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "656865", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/17/85/178580be0a7c8d7851a87406fd9a120c1large.jpg"}}