{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Abu Dhabi, Abu Dhabi, United Arab Emirates", "Title": "“Perfect location and basic accomoodation”", "Author": "Abeer K", "ReviewID": "UR124377690", "Content": "At first we first shocked to see the hotel, not very fancy as in the pictures, basic and in a small alley. However we realised how lucky we were to have stayed there when we managed to visit all places such as Aya sofia etc on foot :). Everything from restaurants to Yanikapi (the port where we took a ferry to Busra) to Aya Sofia, Topkapi where as far as a 15 min walk. Breakfast was fun - warm and fresh although same everyday. Not the best hotel but if you're looking for a reasonable place where you can have a good night's sleep and a hearty breakfast then this is your hotel...", "Date": "February 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hengelo, The Netherlands", "Title": "“Good, not great.”", "Author": "Eszmee", "ReviewID": "UR121200431", "Content": "My friend and I went to this hotel in August 2011. Rooms are clean and the beds okay. We could hear the traffic at night but what do you expect? Istanbul is a big city with a lot of traffic! Breakfast was good. It was easy to travel by tram and metro and everything you needed was nearby. The staff was very helpfull especially at the reception. I would go to this hotel again.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Global Traveller", "Title": "“A good option in Istanbul”", "Author": "TheJackalope", "ReviewID": "UR119706138", "Content": "After hearing horror stories of hotels in Istanbul, we was very pleased with our choice to book at Mintur Orient. We were upgraded to a suite, very comfortable beds, clean bathroom, elevator to room, and friendly check-in staff. The breakfast was delicious (buffet) and we were able to leave our bags for the day after checkout. A couple of things to mention - firstly, I'd recommend booking online rather than at the hotel - we wanted to stay another night, but found the price being quoted at reception was decidedly more than we had paid online. Secondly, cab drivers aren't always aware of the location, so take a map. While it says Yenikapi, on foot/public transport, it's best to take the tram to Askaray, then it's only a 5-min walk. (but should you be arriving by boat at Yenikapi, it's also only about a 5 min walk). There's building works across the road, but our room was completely soundproof, so not a problem at all.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“This is your hotel if you are just looking for good location...”", "Author": "gudogn", "ReviewID": "UR119429220", "Content": "We decided to stay in this hotel mainly through the recommendation of our local agent for we were looking for a 3 star good location hotel. We read the hotel review prior confiming the booking and from those reviews, we were expecting the extraordinary hotel breakfast, service and location but we could only agree on the last one. But dont get me wrong, service was fine but just nothing special ,you get that kind of similar services everywhere anyway and it is not like they do anything extra for you. In fact, the receptionist was just too busy trying to sell us excursion and forgetting our service request! The location is great though, knowing i will write the reveiw of this hotel, i timed the distance everywhere we go, apparently, it took 30-40 mins walk to most tourist attraction such as, the grand baazzar ,blue mosque and hagia sopia etc. If you do not want to walk, the tram which costs a few lira (probably just 2 lira but dont know for sure as we didnt take it) take you directly to all attractions in minutes because the tram route is just following the main straight road, and the tram stop is just 2 minutes walk from the hotel. We would give 90% to the location of this hotel! also, there were no shortage of restaurant and coffee shops on the way to the attractions. About the hotel itself, like i said, service was average, hotel room is small, and we forgot (or didnt notice) the window was open for us the whole time so there was noise all night as if someone was loading up his trunk all night long! Fortunately we still managed to sleep at night due to the fact that we walked everywhere so we were so exhausted everyday! but we could still hear the noise regardless, we realised the window was open for us on our last night so when it was close, it was a lot quieter although you could still hear some noise. We like to give the credit for the cleaniness of its bathroom as we understand budget and cleaniness usually 'dont' mix together so we were worried about the bathroom situation at first but....true enough, it was small but clean ! The most disappointing is the breakfast as we read quite a few comments about this hotel and almost all of them mentioned about the greatness of its breakfast, it is not like we were crazy about the breakfast but since we already had the preconception about it, so we expected but it disappointed us big time, and from the person of me usually a sucker for juice--any kind of juice, their juice was undrinkable, i really didnt know what was that with the funny looking colour! Their coffee machine was constantly not working, out of the three days we stayed there, two mornings were not working, we ended up had to go out for breakfast everyday. All in all, to us, the most importance of a hotel is its location for convenience, and the clean bathroom as after a long day of sightseeing, a hot shower in a clean bathroom is a must, so i guess we could ignore the fact of a little noise in the evening and the under-average breakfast. Honestly, we might not stay in this hotel again but if you are dont want to pay too much for hotel accommdation like us and make sure you will close the windows at night, this hotel is definately your first of choice.", "Date": "October 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sibiu, Romania", "Title": "“Next year again”", "Author": "DorelBlejdea", "ReviewID": "UR117689413", "Content": "It was a very good hotel, no problems with the check-in formalities, and the hotel staff is very friendly..we stayed for 5 nights..breakfast buffet was very good..the hotel is close to the main attractions of the city, like the grand bazar, sophia museum, and other..next year we will definitely come back.", "Date": "September 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Holland", "Title": "“5 days and 4 nights”", "Author": "SultanHolland", "ReviewID": "UR113462067", "Content": "The hotel is in the centre of the main city, the service at the reception is kindly and helpfull. We had 1 room with a 2 single beds with airco. The breakfast was good, love turkish local food. We had a boat trip for a full day as recommend, it was beautiful. We like to thank the crew menbers (Adil, Sener and Yasar). Next time we will sightseeings Istanbul at NIGHT.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bonn, Germany", "Title": "“Friendly service, especially good value in a fascinating city”", "Author": "judy12345678", "ReviewID": "UR111308986", "Content": "A neighbor had recommended the Orient Mintur Hotel in Istanbul because it was comfortable and clean, within walking distance of major attractions, shopping areas and restaurants and a GREAT value. The hotel is not posh, but it is obviously very popular with tourists from western European countries and tourists from other parts of Turkey. The service was friendly, the breakfast was good. Since we were staying for four nights, we were given an upgrade upon arrival since a larger double room was available.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oldenburg, Germany", "Title": "“You `ve made our trip perfekt!”", "Author": "maedelstour42-01", "ReviewID": "UR109032189", "Content": "Very nice hotel with great breakfast every day - clean and friendly! (We had a 2-bed-room with standart-bathroom. All was really ok! The Hotel is in the near of tram, which brings you to topkapi, hagia sophia etc in 10 minutes! It was quiet and friendly all over the time. And there are very good windows! You can`t hear anything from outsite, when they are closed!) Thank you for all and greetings to Yasar, Sener and Adil, the reception-personal, who care s about us all the time. It was a wonderful time in this city and this hotel. We`ll never forget! :-)", "Date": "May 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zuidland, Netherlands", "Title": "“A good hotel with sufficient service on a good location”", "Author": "AJdP", "ReviewID": "UR83388721", "Content": "The service at the reception desk was friendly and helpfull. The rooms are sufficient and clean; we had sight at the sea. The beds were of a good quality. Breakfast was included in buffet, mainly turkish local food. The location of the hotel is in the centre of the old town; most of the sightseeings can be reached by food and public transport is nearby.", "Date": "October 13, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Avoid!”", "Author": "Shazdeh", "ReviewID": "UR69272472", "Content": "We stayed in this hotel for seven nights. The room was much smaller than we expected and the bathtub was awful There were no shampoos or soaps. Four out of the seven nights our phone rang sometime in the middle of the night waking us up. The hotel had no explanation. The neighbourhood is very noisy. On the plus side the staff were polite and breakfast was fine. In summary, unless you are really short in money, stay elsewhere.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Chicago, Il", "Title": "“Stay here is you DON't want to sleep”", "Author": "budgettravellr", "ReviewID": "UR53211788", "Content": "While the hotel and rooms are relatively clean, the walls are paper thin and you can hear EVERYTHING going on in the hallway and the adjacent rooms. Seriously, there is one sheet of drywall between you and the next room. You can see into the next room through the vents in the bathroom. In addition, while we are no prima dona's, having slept on pull out couches, air mattress, etc, this bed was like sleeping on 2x4s covered in cheesecloth, scratch that, there was no sleeping involved so it was like just laying on 2x4s covered in cheesecloth. Because the hotel is on the less expensive side, many younger people were staying there coming and going and being loud at all hours, all of which you could hear through the walls. The common areas are fine and the breakfast was decent, the staff was also friendly, but the fact that you really cant sleep in the rooms makes it very difficult to appreciate the rest of the hotel.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Russia", "Title": "“The biggest plus of the hotel, its arrangement and service”", "Author": "Juliya", "ReviewID": "UR32430540", "Content": "The hotel is located near the airport. 15-20 min. by a taxi. Around Yenikapi. On foot to historical centre Sultanahmet of 25-30 minutes, by a train of 10 minutes. We spend there 3 nights. Room was clean,and service is good in the hotel. If to go to the centre on foot it is possible to go on quay where quite good fish restaurants are located.", "Date": "June 16, 2009"}], "HotelInfo": {"Name": "Orient Mintur Hotel - Istanbul", "HotelURL": "/ShowUserReviews-g293974-d657446-Reviews-Orient_Mintur_Hotel_Istanbul-Istanbul.html", "Price": "$68 - $122*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Mermerciler Caddesi No:5</span> | <span class=\"extended-address\">Yenikapi</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34380</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "657446", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0b/6a/0b6af2b6533c30d16880d736f2cc4e444large.jpg"}}