{"Reviews": [{"Content": "decided not to stay Based on the last review., I decided to check Checkers out again. I'd stayed there before with a really disappointing result - overpriced, poor food at breakfast (cereal, toast, instant coffee, fruit), and it was old, poorly maintained, and boring. Last time I stayed there was a disagreement with the surly lady at checkout over the rate - the rate had been quoted by the Manager's wife, and this woman at checkout said that the manager's wife was not authorised to quote rates - I said, well, I had been quoted. She was obnoxious and I agreed to pay the higher rate she demanded - but I was offended. So I read the last review that sounded like they are refurbishing the place. Wrong! They are doing 'selected rooms' I was told - I guess this means that when a room becomes unoccupiable they do something about it. The central building (restaurant, bar, meeting areas) is not being refurbished due to cost, I was told.The breakfast menu is still the same toast, fruit, instant coffee and toast, for $26 (incredible price!) - they still charge for internet connection at $5 an hour - the parking lot and driveway has been resealed, but so what? That doesn't make for a better stay. The rooms are cold with bare brick walls. I looked for the aircon that the last post talked about, and it was there, but just a wall unit. Nothing fancy about that. Being winter and cold at night I requested a heater for the room, which they they provided. There was a function in the main building with a rowdy crowd so that made sleep impossible until after 1:00 am when the crowd finally left. A man was vomiting in the parking area then got in his car and drove away - that's pretty rough. I stayed one night and left - I went to the Travelodge at Brookvale - much better and professional.Checkers is overpriced, and owned by Chinese investors who don't have a clue how to serve and promote - they seem to know all about money, but not about quality and service. Everything at Checkers has a price, and there are none of the 'small things' that help make a nice stay better. The pool was dirty and full of leaves - it was winter and the man showing me around said they don't clean the pool in the winter because nobody uses it - there is no pool heater. Does this sound like a 'resort'? - not to me. In other words, I haven't seen any real change since my prior stay. And the same surly woman who argued with me over the rate is still working there, so be ready for an argument!", "Date": "Oct 23, 2008", "ReviewID": "UR924435713", "Ratings": {"Service": "-1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "STOFER"}, {"Content": "Five Star Stay at a Three Star Price I'd stayed at Checkers previously as I often have business in the Terrey Hills area and it was always satisfactory.Since my last stay earlier in the year, it appears that the Hotel has begun extensive refurbishments. The car park has been completely resealed and is in brand new condition. Very nice.I was lucky enough to book one of the newly refurbished rooms (which was only $50 more than a non-refurbished room). My room was SPECTACULAR to say the least. Relaxing, contemporary, clean and modern. It really was a 5-star room at a 3-star price!! Brand new flat screen TV and free cable. Great soaking tub and shower and (most importantly) an extremely comfortable bed. I've stayed in a lot of hotels and this room was real bang for your buck! The only downside to the room was that the air conditioner was not functioning as yet. I was told by the receptionist that the aircon units had just been installed and were yet connected. Other than that - perfect room!The main complex of Checkers still seems run down. Hopefully the owners will also re-do the reception and dining hall which seem trapped in the mid-1980's and are in DESPERATE need of a facelift too!And don't bother with the breakfast unless you like gummy cereal and room temperature yoghurt.", "Date": "Aug 31, 2008", "ReviewID": "UR172779689", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "3"}, "Author": "CorporateKate62"}, {"Content": "Never ever stay at this place This place would have to be the worst place we have ever stayed at. The only reason we stayed here was because we needed to be close to family and to attend a family funeral. We didn't expect five star but this was MINUS five. We first had to negotiate a pot-holed driveway but worse was yet to come. The entrance door badly needed a coat of paint and half the room number was missing. The sofa was badly stained, the water in the bar fridge was frozen, curtains were falling apart and the bathroom is badly in need of some attention. Even the guest guide book was filthy and out of date and the room had an awful disinfectant smell about it. At around seven am we were woken by an excavator digging a trench outside our window. Then what sounded like a jack-hammer and other tools started in the room below us. We turned on the TV to drown out the noise but couldn't even hear it. The least they could have done was to warn us about the noise. I don't know how a place like this could be called a resort but to anyone looking for accommodation in the Terrey Hills area, this would not even be the last resort!", "Date": "May 2, 2008", "ReviewID": "UR363933578", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "KAG977"}, {"Content": "Give checkers a big miss!! If you are thinking about staying at Checkers.....change your mind!Checkers is a run down motel that needs a lot of work. When you arrive the driveway and carpark look like you are in the middle of Iraq. The potholes were bigger than the car. The rooms are poor to say the least. The floor was dirty, there were cockroaches (thoughtfully the motel had put a can of insect spray in the room) the bed was worn out and the room stank of some sort of deodariser that had been used to disguise the cigarette smell. I am very glad I only had to survive there for one night.", "Date": "Apr 20, 2008", "ReviewID": "UR121068151", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "keep_it_real72"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d660103-r21145783-Checkers_Country_Resort_Conference_Centre-Sydney_New_South_Wales.html", "HotelID": "660103", "Price": "$74"}}