{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“great location”", "Author": "brummiee", "ReviewID": "UR73174481", "Content": "When we got to the apartment the room was not ready. we were told it would be an hour so we walked around the ramblas for a while, got back still not ready. We were really tired but didnt make a fuss. When we got to our apartment it was the wrong one as we had expected four beds as there was four of us. We could not be bothered to complain as we were so tired we just wanted to crash. Overall I was quite happy with the room as it was close to las ramblas and lots of shops and restaurants open till late which was ideal as we were on a stag do so we were out most of the time.There was a lot of noise from outside but didnt bother us much as we were up till late anyway. We had a tv that we couldnt work but apart from that the room was fine. The kitchen was a big plus as it meant we could make our own tea (very british I know). The shower didnt give us much warm water but didnt mind as it was so warm during our visit. The best thing about the apartment is location. If you go in expecting luxury then you will be dissapointed. Its basic but what we needed which was a place to sleep. If your young and don't mind noise and slumming it a bit then its ideal. I didnt not like the lady that was a cleaner because she was a bit moody but thats it. Wouldnt reccommend for families or elderly as the area is loud even up until 5 am. The area stinks a bit but it was fine.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Basic, Close,Fun, Clean”", "Author": "Johno46", "ReviewID": "UR38284646", "Content": "I thought this set of apartments ticked all the right boxes, nothing dirty, cheap, basic and with a good set of people staying in it. At first glance, the street in which they are located looks a little rough. But not once did my friends or I feel threatened, we weren't approached for money, or drugs, or anythign you might expect in Glasgow. Close to the sea, and right in the midst of Las Ramblas, i would definately recomend it to anyone looking for cheap, no frills accomodation in a great location in the heart of barcelona", "Date": "August 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Southern UK", "Title": "“Central Location but dodgy area”", "Author": "Johnboyno1", "ReviewID": "UR26506868", "Content": "The small apartments are located down a small back street just 100mtrs or so off the 'Ramblas' main strip. It offers no frills accom' with our apartment containg a very small kitchen, one bedroom with twin beds, a living room area with a sofa bed X2 , Balcony plus a small toilet/shower room. A TV ( Spanish channels only) and small sterio system was also provided in the room along with some additional bedding , blankets etc. The appartments appear quite secure due to a 24hr maned reception area and an additional 2 locked doors before you reach your appartment. There is internet available in the reception area at a rate of 1 euro per hour. On the down side is that the road the apartments are located on could only be described as 'Very dodgy' after dark, plenty of people hanging around street corners up to no good and the road is very noisy with local drunks shouting and yelling until 5AM, this didnt bother me too much as I was pretty mashed myself but i could not recommend this place for the elderly, lone female travelers or familys.", "Date": "March 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Shrewsbury", "Title": "“Cheap but basic.”", "Author": "Just4Art", "ReviewID": "UR14031651", "Content": "We had an apartment with a bedroom and lounge. The kithchen was basic but clean and functional. Don't expect to cook extravagent meals unless you know some good one pan recipes. The shower was a fairly clean wet room style off the lounge. There is no view and the street outside is narrow and fairly non descript. However it was cheap and right round the corner from the La Ramblas and secure. If you're planning to spend most of your time out of the apartement then it's ok. It didn't spoil our visit, but then again it didn't add to the charm or visual experience. If you do book one try and ensure you get one with a Balcony. Not for the view but simply so you can open the door and get some fresh air into the room. For 4 people it could be a bit crowded. In a single phrase it is 'cheap but basic'.", "Date": "March 4, 2008"}], "HotelInfo": {"Name": "Apartamentos Bahia", "HotelURL": "/ShowUserReviews-g187497-d661969-Reviews-Apartamentos_Bahia-Barcelona_Catalonia.html", "Price": "$95 - $222*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Montserrat 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">08001</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "661969", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/dc/11/dc11560654540479f11760bb900bb8a32large.jpg"}}