{"Reviews": [{"Content": "Viva la Vincci Via I stayed at the Vincci Via for 10 days in October. My room was on the top floor (10) and I had spectacular views of the City. The room was very smart, the lighting effects really cool and the bed huge and comfy. It's a stylish hotel, very contemporary - (great bathrooms!!) Breakfast was good and worth paying for, although the restaurant gets quite warm - dress lite! The terrace is neat with nice loungers and shower facilities and if you can block out the sounds of the sirens up and down the Gran Via a perfect place to relax and catch the rays. Loved it!!", "Date": "Nov 13, 2008", "ReviewID": "UR250826828", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "CityboyLondon"}, {"Content": "A great hotel! We stayed in the Vincci Via for 2 nights for a short break. The hotel was easy to get to from the airport and was very close to the metro station. We arrived quite early but got a room immediately. While the room wasn't the biggest, it was very well decorated and was very comfortable. The bathroom was fantastic! We didn't try the breakfasts in the hotel, however the restaurant across the road served a nice and cheap breakfast. The air conditioning was set to turn off once it reached a certain temperature and then the room would immediately heat up again. This was the only downside to a lovely stay. I would most definitely go back and stay in this hotel. Well worth the money!", "Date": "Nov 10, 2008", "ReviewID": "UR210026826", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "Dub26"}, {"Content": "Absolutely Fantastic! We stayed here for 2 nights as a birthday treat for my husbands 40th. WOW it is a superb, trendy, botique syle hotel with every mod con you could wish for, we were even upgraded to a penthouse suite for no extra charge. The location was perfect, only a 1minute walk from Plaza de Espana metro station and everything was within easy walking distance. This is the best hotel I have stayed in for a long time. The only thing I would say is dont have their breakfast...its far too expensive! Pop over the road to Zahara cafe and soak up some cafe culture for a couple of hours. The breakfast there was only 4 euros!All in all a perfect city break. Stay here!", "Date": "Oct 30, 2008", "ReviewID": "UR560097407", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "chiggs1971"}, {"Content": "Perfect for a fun weekend in Madrid - recommended! I was very impressed with this hotel. It's in a great central location. While check-in was a bit slow, the reception area is impressive with a cool, modern look.The route to the lifts takes you past the amazing marble staircase which is extremely impressive. Our room was on the 5th floor and was decorated in a very comfortable and trendy black/white design. The beds were wonderfully comfortable and the bathroom was large including double sinks. The variable mood lighting was another great touch.We made late night requests (11.30pm) for ice and extra towels while getting ready to go out and these were supplied quickly, even though room service was supposed to end at 11pm.We enjoyed the great Madrid nightlife which is literally on your doorstep.We tried to visit the room terrace but this appeared to be closed. Even so, I thought this was a great hotel and would definitely stay again on my next stay in Madrid.", "Date": "Oct 29, 2008", "ReviewID": "UR413626881", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "richardlondon"}, {"Content": "Very nice hotel We stayed at the Vincci in October for a long weekend in October. The hotel is in a good location (right by Plaza de Espana metro station 鈥?easy access from the airport), but also very easy to walk to all the tourist sites). Although our room wasn鈥檛 available when we arrived, the staff were very helpful, stored our luggage for us and told us when it would be. After a quick walk we were able to check in. As other reviewers have said the rooms are a little on the small side, but very well designed (and the bathrooms are lovely). Unfortunately we had a problem with the air-conditioning, but the staff couldn鈥檛 have been more helpful 鈥?and without us asking moved us immediately (to a better class of room) 鈥?although they did imply we would have to move again (we didn鈥檛). The second room (a superior) was even nicer 鈥?not much bigger but it had a lovely terrace.If you stay here don鈥檛 miss a sit on the hotel鈥檚 lovely roof terrace 鈥?it鈥檚 not well advertised but is beautiful 鈥?a great place to sit with a drink. The bar is quite funky but is overpriced 鈥?but this is normal with hotel bars. As for comments on breakfast 鈥?why bother? We rarely do in cities 鈥?there are great places all around you can go for breakfast. Also unusually fro a Spanish hotel it has a lovely staircase that you can use 鈥?useful if you aren鈥檛 on a high floor (the lifts do take a while to come).Overall we really enjoyed the Vincci 鈥?and would thoroughly recommend it.", "Date": "Oct 10, 2008", "ReviewID": "UR692566944", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Aylesburytravellers"}, {"Content": "Great location, great decor, friendly staff... I just returned home having stayed here for two nights over a weekend and was very impressed by the Vincci Via 66. The location of the hotel is fantastic; a 1 minute walk from both Plaza de Espa帽a and Callao metro stations. We arrived early on Friday morning, but were allowed to enter our room straight away. The room was not large, but very well appointed, the beds were comfortable and the decor, as in the whole hotel, was quite 'funky'... the bathroom was also well decorated and everything was extremely clean.The hotel has a 30's feel, but with a modern edge which made it a great place to spend time in...and the bar on the first floor had some great stylish flourishes!The buffet breakfast was good and varied, and the staff in the hotel were always very helpful. I would recommend this hotel, based on my experience, and will definitely stay there again when I return to Madrid.", "Date": "Aug 11, 2008", "ReviewID": "UR446071288", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Krepkaya"}, {"Content": "Not Quiet Attractive as in the Photos Except the Bathroom I was really charmed by the photos of this hotel. I thought, I should experience such a 'design' room in my life... Well, I did not have a big disappointment but the size of the room, quality of workmanship in some details etc. etc. do not match with the charming photos, be aware!Nice things: The bathroom! Yes it was really good and sexy. Unlike the room itself the bathroom is roomy :-) Also hotel staff were pleasant.", "Date": "Jul 17, 2008", "ReviewID": "UR170270290", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "euphrates78"}, {"Content": "BAD services!! A great hotel, like a palat, a great location, but BAD SERVICES!For a hotel 4*, no soap every day, no clean every day, even I already spoken at the reception about this problem!!!Attention for the turistes : I paied on line with my credit card this hotel, bad and breakfast, during 4 nights and 4 breakfast.  I was so stupeffied when the staff told me I have to pay cash 2 breakfast, so, even I don't understood, I paied! It's for my first time in my life when I saw a penible situation, like their breakfast! Concerning the breakfast: if you want a coffee, you are asked, and that is served directly on the kitchen, just one! You can't serve yourself the coffee !!!Very disappointed, it is a pity for this lovely hotel.", "Date": "Jul 16, 2008", "ReviewID": "UR876230098", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "5", "Location": "5"}, "Author": "ninovici"}, {"Content": "A fantastic return visit! I stayed at the Vincci Via 66 with my husband in November 2007 shortly after it opened. We had not originally booked this hotel for our visit to Madrid, having booked to stay at another hotel which turned out to be fully booked when we arrived there. The staff at that hotel were extremely unhelpful, even though we had paid before arrival, and we were left having nowhere to stay and had to find another hotel quickly. We had stayed at two other hotels in the Vincci chain on previous visits to Spain and had been very impressed with both. After making enquiries with the Vincci Soho in Madrid, which was also full, we were directed to the VIa 66 which did have a vacant room. During the November 2007 visit we had a wonderful, relaxing three day stay and the staff went out of their way to be courteous and helpful at all times, and the hotel was extremely comfortable. I made a return visit to Madrid in May 2008, taking my sister for a 50th birthday treat. I booked an Executive Room with terrace at the Via 66 and am so pleased I decided to return to this hotel. I have to say I do not have the same experiences as some of the other visitors who have reviewed this hotel. I found the staff on both visits unbelievably helpful (on the first visit the Receptionist readily telephoned the box office of the theatre opposite the hotel and arranged for us to pick up tickets - the Box Office staff did not speak English and I don't speak Spanish!!). My experience of the staff is that they always greet guests with a ready smile and hello. I have never entered the hotel without a porter being on hand to offer help with bags, or just to give a cheery welcome. The Manager, who I emailed before my visit to let him know I was making a return visit with my sister, had arranged for a bottle of Champagne to be in our room when we arrived - a really lovely, unexpected surprise! Our rooms were wonderful on both visits - fantastic decor and amazing, spotless bathrooms. The terrace attached to the Executive Room was fantastic - 10th floor with a wonderful view across Madrid to the hills on the horizon.My sister also had a wonderful time on her visit to the hotel and plans to go back to stay with her two children. My 25 year old son (who was also in Madrid at the same time but staying at another hotel) has said he will definitely be going back to stay there himself - he loved the rooms and decor!I have absolutely no negative comments to make about this hotel and would thoroughly recommend it to anyone wishing to stay in a great location in Madrid. There are two Metro stations within a few seconds walk of the hotel, and the Palace and Plaza Mayor are a short, few minutes walk away.", "Date": "Jun 3, 2008", "ReviewID": "UR503475434", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "HappyF"}, {"Content": "all style, no substance (spa shut, roof terrace a let down!) We stayed for five nights whilst exploring madrid. The good things about the hotel: It is quite stylish, the rooms are clean and it is centrally located on one of the main roads.The less good:We partly chose the hotel because of the free sauna advertised on the website. When we tried to use the facility we were told it was shut and would not be open. The staff were incredibly unhelpful and frankly rude. The roof terrace was also a supposed to be a selling point. However, the unhelpful receptionists said that they were unable to provide cushions for the chairs (despite their presence in the photos) and it was not possible to request drinks on the terrace as they were understaffed and did not have a licence to do serve drinks on the terrace (again despite the photo)The rooms are comfortable and well represented in the photos, the only complaint being that the small glass screen on the shower fails to prevent alot of the water soaking the floor. Overall it was a an adequate experience, I would not stay there again as without these extras i dont think the hotel represents value for money.", "Date": "May 17, 2008", "ReviewID": "UR218065933", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "4", "Location": "4"}, "Author": "secaa"}, {"Content": "Overbooked  Positives: Great Location for theatre goers with transport right nearby, funky contemporary decor and newly refurbed, although there was still construction dust all over the bathroom walls one month after opening. Nice boutique size.Front desk service was average/ok.Negatives: Hotel overbooked on the first night and sent us to another 4 star which was the complete opposite in decor  size, it was old  uninviting with 2 single beds! Management did nothing but provided us with a glass of popcorn!!! when we returned the next day.There was no atmosphere in the hotel and rooms were very small.", "Date": "Jan 19, 2008", "ReviewID": "UR814438023", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "3", "Location": "4"}, "Author": "bluesora"}, {"Content": "Brand new, pretty, cool       Room 1002 - The Bed", "Date": "Nov 30, 2007", "ReviewID": "UR207530478", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "OK-in-MUC"}, {"Content": "Great location       Lift hall at 3rd floor", "Date": "Nov 23, 2007", "ReviewID": "UR744775073", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Lovecraft"}, {"Content": "Wonderful City Boutique-hotel Great location, great decor and great stay. Was only there for 1 night and missed breakfast but the hotel was great and I will be back to make the most of the great bathrooms and what i can imagine is a great breakfast. Right in the center of Madrid and good value for money!", "Date": "Nov 6, 2007", "ReviewID": "UR291006488", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "busastep"}, {"Content": "Ottimo il Vincci Gran Via   showReview(23342588, 'full');", "Date": "Jan 7, 2009", "ReviewID": "UR151803333", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "flyer64"}, {"Content": "potete trovare di meglio !!!   showReview(23311458, 'full');", "Date": "Jan 6, 2009", "ReviewID": "UR269515907", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "nicVerona"}, {"Content": "veramente soddisfacente   showReview(22997880, 'full');", "Date": "Dec 25, 2008", "ReviewID": "UR898730429", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "giovannipalau"}, {"Content": "Genial       Vinci via 66", "Date": "Dec 24, 2008", "ReviewID": "UR909568000", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "MiguelSevilla"}, {"Content": "Excellent h么tel   showReview(22344936, 'full');", "Date": "Dec 1, 2008", "ReviewID": "UR927531279", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "cris06"}, {"Content": "Colazione un po' \"salata\", ma...   showReview(22197373, 'full');", "Date": "Nov 10, 2008", "ReviewID": "UR891308601", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鍐呰銇屻亰銇椼們銈屻仩銇ｃ仧   showReview(21172894, 'full');", "Date": "Oct 24, 2008", "ReviewID": "UR252305622", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Hoshinohoshiko"}, {"Content": "Parfait pour une visite 脿 pied des principales places touristiques   showReview(20551740, 'full');", "Date": "Sep 15, 2008", "ReviewID": "UR830694605", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "El hotel est谩 muy bien ubicado...   showReview(20628857, 'full');", "Date": "Sep 15, 2008", "ReviewID": "UR357685473", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel tr猫s classe   showReview(20551739, 'full');", "Date": "Sep 3, 2008", "ReviewID": "UR353487084", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Echt gut   showReview(20551738, 'full');", "Date": "Sep 1, 2008", "ReviewID": "UR148124499", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Super Lage   showReview(20551732, 'full');", "Date": "Sep 1, 2008", "ReviewID": "UR703450462", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder   showReview(19633283, 'full');", "Date": "Aug 30, 2008", "ReviewID": "UR787977525", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "H么tel design au coeur de la ville   showReview(19633282, 'full');", "Date": "Aug 28, 2008", "ReviewID": "UR320466576", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "hotel in ottima posizione   showReview(19633280, 'full');", "Date": "Aug 25, 2008", "ReviewID": "UR536099145", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "OK.   showReview(19633279, 'full');", "Date": "Aug 24, 2008", "ReviewID": "UR725230546", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "ottimo hotel in pieno centro   showReview(19633278, 'full');", "Date": "Aug 23, 2008", "ReviewID": "UR700993274", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Magnifique !   showReview(19633277, 'full');", "Date": "Aug 22, 2008", "ReviewID": "UR461906741", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "H么tel g茅nial et en plein centre ville   showReview(19633276, 'full');", "Date": "Aug 22, 2008", "ReviewID": "UR489520130", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "spitzen Hotel   showReview(18533877, 'full');", "Date": "Jul 24, 2008", "ReviewID": "UR157944478", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Traumurlaub   showReview(18533880, 'full');", "Date": "Jul 21, 2008", "ReviewID": "UR173795387", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel tr猫s design tr猫s bien situ茅 avec une belle terrasse avec vue panoramique sur Madrid   showReview(18533868, 'full');", "Date": "Jul 21, 2008", "ReviewID": "UR252145375", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bien situ茅 mais   showReview(18533865, 'full');", "Date": "Jul 17, 2008", "ReviewID": "UR513766409", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Viva Tio Pepe!!   showReview(18533878, 'full');", "Date": "Jul 16, 2008", "ReviewID": "UR483063497", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Der Tipp in Madrid   showReview(18533866, 'full');", "Date": "Jul 11, 2008", "ReviewID": "UR916640570", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Espana   showReview(18533864, 'full');", "Date": "Jul 4, 2008", "ReviewID": "UR588603929", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Magnifique hotel en plein centre de Madrid, tr猫s bien situ茅   showReview(17433438, 'full');", "Date": "Jun 28, 2008", "ReviewID": "UR553611913", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "consigliato a tutti   showReview(17433418, 'full');", "Date": "Jun 21, 2008", "ReviewID": "UR173629093", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "bel hotel design, moderne, central mais accueil un peu froid   showReview(17433437, 'full');", "Date": "Jun 19, 2008", "ReviewID": "UR884181903", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Aussergew枚hnliches Ambiente   showReview(17433417, 'full');", "Date": "Jun 13, 2008", "ReviewID": "UR996852750", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Zentral und ruhig   showReview(17433416, 'full');", "Date": "Jun 11, 2008", "ReviewID": "UR546553592", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder   showReview(17433415, 'full');", "Date": "Jun 7, 2008", "ReviewID": "UR663409260", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "hotel tres agreable   showReview(17433412, 'full');", "Date": "Jun 2, 2008", "ReviewID": "UR785347748", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "tr猫s agr茅able et dans le centre de madrid   showReview(17433413, 'full');", "Date": "Jun 2, 2008", "ReviewID": "UR573986939", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bon hotel,   showReview(16589381, 'full');", "Date": "May 22, 2008", "ReviewID": "UR919740476", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Exelente Valor/Porecio   showReview(16180952, 'full');", "Date": "May 18, 2008", "ReviewID": "UR256116567", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "AmericanoPractico"}, {"Content": "Zentrale und ruhige Lage   showReview(16589378, 'full');", "Date": "May 18, 2008", "ReviewID": "UR476683384", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder   showReview(16589377, 'full');", "Date": "May 16, 2008", "ReviewID": "UR337416382", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "tr猫s bon hotel   showReview(16589380, 'full');", "Date": "May 16, 2008", "ReviewID": "UR627289826", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Nel cuore pulsante di Madrid, design eccezionale   showReview(15791543, 'full');", "Date": "May 8, 2008", "ReviewID": "UR768032505", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "pliwi"}, {"Content": "ottimo hotel   showReview(16589379, 'full');", "Date": "May 7, 2008", "ReviewID": "UR902550480", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottimo Hotel a Madrid per vacanze   showReview(15567210, 'full');", "Date": "Apr 19, 2008", "ReviewID": "UR743340949", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Excellent h么tel 脿 Madrid, 脿 recommander   showReview(15567208, 'full');", "Date": "Apr 19, 2008", "ReviewID": "UR889516809", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "hotel nuovo,in pieno centro   showReview(15567207, 'full');", "Date": "Apr 10, 2008", "ReviewID": "UR956570195", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "schick und angemehm mit kleinen M盲ngeln   showReview(15567206, 'full');", "Date": "Apr 3, 2008", "ReviewID": "UR329538549", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Sehr gerne wieder   showReview(15567205, 'full');", "Date": "Apr 1, 2008", "ReviewID": "UR816121301", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "Turista, Evitare colazione...   showReview(14650036, 'full');", "Date": "Mar 26, 2008", "ReviewID": "UR605100554", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "SUPERBE et romantique a souhait   showReview(14317200, 'full');", "Date": "Mar 16, 2008", "ReviewID": "UR721336540", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "chouchou79"}, {"Content": "Un hotel somptueux!!   showReview(14735011, 'full');", "Date": "Mar 10, 2008", "ReviewID": "UR499534696", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Bon hotel sur Madrid, jolie d茅co et bon emplacement   showReview(13195442, 'full');", "Date": "Jan 14, 2008", "ReviewID": "UR459502076", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder; super nettes Hotel in bester Lage   showReview(13195439, 'full');", "Date": "Jan 7, 2008", "ReviewID": "UR670724366", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bon h么tel   showReview(13195440, 'full');", "Date": "Jan 7, 2008", "ReviewID": "UR809324567", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel magnifique   showReview(13195434, 'full');", "Date": "Jan 3, 2008", "ReviewID": "UR849726753", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Una noche con mi pareja   showReview(12143371, 'full');", "Date": "Dec 31, 2007", "ReviewID": "UR705605910", "Ratings": {"Service": "-1", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "luhis22"}, {"Content": "J'y retourne si bon prix   showReview(11315504, 'full');", "Date": "Nov 21, 2007", "ReviewID": "UR394023125", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187514-d662558-r21823050-Vincci_Via_66-Madrid.html", "HotelID": "662558", "Price": "$194"}}