{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Excellent value for money”", "Author": "brycephillips", "ReviewID": "UR137169574", "Content": "We stayed here for a month after moving out of our flat and before leaving Hong Kong. The place is handy once you know which buses to get. The rooms are pretty good and you can negotiate to have or not have the breakfasts. We would stay here again.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Good place with basic necessities.”", "Author": "YoGos", "ReviewID": "UR135514982", "Content": "We came to Hong Kong as a group of 16, 9 of which were children, for a one month visit and wanted a place that wouldn't eat our wallets. Caritas Oswald Chueng International House provided us with a nice place to stay for a good price (discounts for longer periods of stay.). It is a few walking blocks to the main Aberdeen shopping area where there are plenty of cafes and restaurants to choose from. Transportation all throughout Hong Kong is super easy with regular bus schedules and plentiful taxis so getting into other areas of Hong Kong was no problem. There are a couple of bakeries, a dim sum house, and a place to get fresh rice noodles and congee within a block from the hotel. Maid service happens twice a week but the garbage gets emptied daily. The front desk staff was always very helpful. Only issues we had were the shower floor flooding and the toilet pipes leaking every time someone flushed. This was the same story in all four rooms we had. Otherwise, the rooms were clean and roomy and very reasonably priced.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Filthy Toilet!”", "Author": "Bianca L", "ReviewID": "UR134168491", "Content": "The Caritas Oswald Cheung International House is very hard to find, as it is not named as such. It is named as the Caritas Jockey club. We arrived on the street just fine, after travelling by bus. Walked up and down the street looking for this place, in the pouring rain. Only after finding a nice girl inside a 7/11 did we find the hotel, as she showed my partner and I where it was situated. When you enter the building, I was still a bit unsure as to whether we were in the correct place. There was no indication that this was a hotel. Once we got into the lift, only then it became apparent, as the hotel was named by the floor button. When we finally go to the reception, we were greeted with an unfriendly service with no smile! As if this wasn't a bad enough welcome to a new city, upon entering our room I noticed that the toilet had failed to be cleaned and was covering in urine! So I went back to the reception to complain, no one was present, I rang the assistance bell several times and waited around 10 minutes before the host appeared. When I advised what the problem was, there no offer to move room. Instead a cleaner was sent to deal with the mess. We initially booked for 2 nights via Asia rooms, but needed to stay another night. As we failed to find another hotel within the area and to avoid the hassle of moving our bags we asked if we could extend our stay by one night. They said they could, however at a much higher price than we initially paid. We later asked another receptionist, and they gave us the room for an other night at a similar rate to what we paid initially. Confusing! The breakfast is included within the price, it's a buffet Chinese style breakfast.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "manila", "Title": "“fair and far”", "Author": "jadl", "ReviewID": "UR123053766", "Content": "this hotel is really far from main attractions. some would say they dont mind at all.but trust me, after a day of walking, commuting in a bustling foriegn city is not the best idea. first of all, consider the traffic which is not uncommon. during our stay, traffic wasnt that bad but there were some consturctions and improvements in the roads that made traffic quite slow. second, consider that this hotel requires that you take the bus or the taxi (which is not the primary option by taking this budget hotel). Most bus drivers are unable to speak english. some would even shrug you off if you try talking to them. You have to buzz before you come to your stop, which means you have to know where you are stopping as buses dont always stop at all the stops unless they have to. though most buses have bus stops announced, mind you, your nearest bus stop may not come in the name you know, ie by your street name. as for this hotel, they generalize it as tin wan, but tin wan has plenty of bus stops that dont even stop at tin wan exactly where caritas is located. this hotel has some positive points too. first, it is relatively spacious by hong kong standards, community is friendly and laid back, hotel is efficient enough for most travellers, free wifi in the room though no internet in the lobby. free breakfast though it will be the same every single day. the 3 lifts are efficient enough. you can leave your bag at the hotel lobby for days without cost. market nearby with eateries along the way (though most dont understand english). mcdo and 7-11 just a block away. bus stops are plentiful in the area which is good but sometimes confusing as well. airport bus stops a block away from the hotel. hotel is relatively clean though not squeaky clean as most would like it to be. tea making facility available in the room though no tea or coffee available. view from the rooms looks across through the other building or to the cemetery behind the hotel, kinda spooky for our first night.=) so if you dont mind getting lost sometimes, and traveling for an additional 20 mins from hong kong station. this is an ok option for a relatively clean budget hotel.", "Date": "January 14, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Cambridge", "Title": "“Great value, but a little far out of town”", "Author": "tourismplanner", "ReviewID": "UR116972769", "Content": "This hotel offers exceptionally good value for money for the cost conscious tourist", "Date": "August 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Holds credit card funds”", "Author": "dstar01", "ReviewID": "UR102845965", "Content": "Be very careful with your credit card here. I reserved a room on another website with my credit card and when I turned up they held $750HKD with my authorisation. When I checked out, I was given a cancelled credit card slip for the held payment, and payed for my room. I then found out later that day that they has not sent through the request to release the deposit. When I got home, I could not find an email to contact the hotel directly. Instead, I sent several emails to their head office in Hong Kong and did not receive a single response. If you stay here - make sure that your budget allows for held funds for a week. I didn't, and it really made my trip miserable.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Average - No probs”", "Author": "barkerrichard", "ReviewID": "UR74873116", "Content": "Ok but souless, clean and not to far away although has to be by taxi or bus, i caught the bus from airport 90mins!", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Very well equipped and a great price. Charming attentive service too.”", "Author": "rnolds", "ReviewID": "UR8850482", "Content": "Very well equipped and a great price. Charming attentive service too.", "Date": "September 22, 2007"}], "HotelInfo": {"Name": "Caritas Oswald Cheung International House", "HotelURL": "/ShowUserReviews-g294217-d662753-Reviews-Caritas_Oswald_Cheung_International_House-Hong_Kong.html", "Price": "$77 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.20 Tin Wan Street, Aberdeen</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "662753", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bc/bf/36/caritas-oswald-cheung.jpg"}}