{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Maryland", "Title": "“You'll get what you paid for and less”", "Author": "flashtrum", "ReviewID": "UR139844079", "Content": "Ok so I'm the sucker. I read the reviews but the price was decent and I told myself I wouldn't spend much time in the unit. Let's start with the outside. It's a two-story building and apparently these people don't understand the concept of a broom. I was on the second floor and it was REALLY dirty (I wouldn't walk barefoot outside). Cig butts, bottles, beer bottle tops - all in the same place the entire time. They leave the linen room open 24/7 and it is REALLY filthy. The linen room! (Ceiling is also coming undone). Ok now for the unit - I had to be moved because my air didn't work. It was cooler outside than in my room, and there was 1/2 inch of space on each side of the unit to the wall (you could see outside if you were looking at the AC). Ratty towels, EVERYTHING was unplugged - TV, Cable, lamps. WTF? Second unit - funky smell. No lamps near bed. Some sort of white stuff in the corner of the room. Entry lamp and shower lamp did not work. Oh, and in both units, the bathroom window COULD NOT BE LOCKED.Mattress was really, really old. There is a \"buddy wall\" between units and the people stating next to me kept trying to get into my unit. Real safe feeling. Someone also tried my room from the outside door one morning. \"Do Not Disturb\" signs? THEY DON'T HAVE ANY. Let's go back outside. The second floor walkway to the right side of the building is sagging badly and when I walking on it (just once) I felt like I was going to put my foot through it. The floor is basically made of wall paneling from the 60's and is in bad shape. You can visibly see the rot. Heck they aren't going to clean it why bother thinking of replacing it? Yet the \"proprietorship\" (who I think own a few of these old-school places) drives the most expensive cars and scooters. They have no plans apparently to actually put profits back into their business. There are mattresses standing up outside, old AC units piled high, there is broken glass frames in the back of the building. I will be calling both the Chamber of Commerce and the Health department tomorrow. I don't need someone's private-hair in my bed sheets, thank you.And in the second room they sent me - thanks for cleaning out the trash from the last people. My advice? Search tyour couch for change, cash in that 20 dollar lottery ticket you won six months ago - and spend the extra 15-20 bucks a night for SAFE and CLEAN room in an establishment that does it right. I know of a few but this isn't a commercial - it's a warning.", "Date": "September 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Horrible”", "Author": "Sonson786", "ReviewID": "UR139033300", "Content": "Spare yourself the trouble this place is horrible your not even getting your money's worth I just couldn't do it I had to go sleep in my truck. There is mold everywhere didn't take my flip flops off for a second. The floor is wet and has stains all over it. They really need to think about renovating", "Date": "September 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ligonier, Pennsylvania", "Title": "“Cheap Stay”", "Author": "jessica n", "ReviewID": "UR134785235", "Content": "Well I booked this hotel and read the reviews afterward and I thought I booked a dump. I took cleaning supplies and my own linens with me because I was scared on what I was getting into. The Floors were clean, The bedding was clean, and the room had a tv and refridge/freezer. It aslo had lamps and alarm clock. The room had a couple of down falls such as a musty smell from the air conditioner and the bathroom faucets were out dated other than that it was a room to stay in and walking distance to alot. I also read a review that they didn't clean their pool and well I stayed for 4 nights and the pool was cleaned daily. I would stay hear again.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Pennsylvania", "Title": "“HORRIBLE!!!!!”", "Author": "tspeck63", "ReviewID": "UR134436901", "Content": "I have stayed at the Cabana many times in the past and it was always \"Okay\" (you got what you paid for). However this most recent stay was the first time in about 5 years. Since then there has been new owners. The room was filthy, the bathroom made me want to vomit it was so dirty. (see photos) We never got clean towels, I had to go into the store room and get them myself. I was affraid to eat anything while in the room for fear I might get sick. I am 49 years old and I have traveled all over the world and this motel without a doubt is the most disgusting place I have ever seen. If anyone has given this place a goo rating I will bet a years pay it came from the onwers. The toilet would not flush and I complained but they did nothing and I had to fix it myself. I would not shower in this room and had to go to a friends hotel to shower", "Date": "July 15, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“They couldn't PAY ME to stay here again, dead cockroach on the wall as we checked in, most disgusting building I've ever stepped”", "Author": "MarkBees", "ReviewID": "UR117430902", "Content": "Granted it's $40 a night, but this place is flat out disgusting. We had dead cockroaches all over our room's wall when we checked in. I complained, but the guy at the desk didn't even speak english. What a disgrace. We are not at all picky, but we ended up sleeping in our car. Do yourself a HUGE favor, don't be cheap and settle for this dirthole. Spend the extra few bucks elsewhere...ITS WORTH IT", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Bowie, MD", "Title": "“It was an OK place to stay spur of the moment”", "Author": "Pam L", "ReviewID": "UR117054227", "Content": "My boyfriend and I wanted to take a spur of the moment trip overnight to OC back in June of 2010 (not 2011 like it says above). We found out about The Cabana Motel online prior to going down and booked the room a few days in advance. We really didn't think it was all that bad, considering the price was affordable for us and we are not all that picky. It was very close to the beach and boardwalk and was just fine for us. I didn't notice any mold, smells, dirty carpets or plumbing issues. The only things that I can say that weren't good about the place were the rickety, old, wooden steps that we had to walk up to get to the 2nd floor to our room, the fact that the key we were given wouldn't open our door so we had to go back to the office and get the attendant, and the ants that invaded the room during the night (I woke up and found them all over the nightstand and next to my head on the bed). Other than that, the room pretty much provided everything we were looking for...a place to crash, watch cable, keep a few drinks in the mini fridge, a microwave, and a nice, little view outside the bathroom window which faced the beach. The bed was really comfortable, too. I'd go back again, and I've heard they made some renovations since we stayed. Maybe they worked out the kinks...", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“You get what you pay for”", "Author": "cin0576", "ReviewID": "UR114675336", "Content": "If you are looking for a very basic room without traditional amenities or hotel comforts, this is for you. Hotel rated a 2-star - very much a stretch. Older motel that has not been updated (no outlet in bathroom, old tile, old windows, screen with large hole - allows flies in). You will need to bring a power strip, blow dryer, and iron / ironing board. Room did provide clean sheets / towels and ok flat pillows. Mini-fridge, microwave, and old TV were stacked vertically in the closet space opposite the beds. No room for hanging clothes. One dresser - 2 drawers was it for storage. Shower curtain had mold and it was hard to tell if tile was clean so bring flip fliops. Front desk staff very friendly. Hotel rate was inexpensive. Many long-term :young people were guests.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, Pennsylvania", "Title": "“Accessible! Affordable rates and we loved it!!”", "Author": "Thomas54046", "ReviewID": "UR110541862", "Content": "We came down on a weekend that we randomly planned. looked up some hotels and motels , but they were ridiculously expensive, so then we stopped by cabana motel. they had a good price and i've been told they just re innovated the rooms, so we decided to spend the weekend there. We had a wonderful time there , not going to lie, its nice, cozy and looks fresh. staff is also very helpful and nice. while i read all other reviews on this site i just had to write a review that they really did a good job on renovating the rooms and they look nothing like the photos i saw on this site, however i never stayed at this motel before.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Prime location.....”", "Author": "Dugl", "ReviewID": "UR78699058", "Content": "But that's where it ends...OK...I took the cheap route...but also fell for the advertisement and claim of \"new management\". The 1st room offered had the commode dismantled and laying in pieces on the bathroom floor, and the sink was full of ashes and cigarette butts. A replacement room was offered and it was somewhat better....... 1.) One bed frame was broken. 2.) Fridge thermostat had no adjustment knob 3.) No HBO, but it was supposed to be included. 4.) No ice available 5.) The soft drink & snack vending machines were non-functional. 6.) The swimming pool in the parking lot closes at 7:00pm 7.) Consider your potential neighbors at a 1 star motel...beer bottles tossed onto the parking lot from the balcony were shattered all around my car. 8.) The day we were packing to leave, I looked under the bed for any lost socks.....I found ten yrs worth of food, debris and loose change.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Ridley Park, Pennsylvania", "Title": "“It's not the Hilton.”", "Author": "kjill99", "ReviewID": "UR77041100", "Content": "Spur of the moment trip to OCMD and this hotel had the room we needed for cheap. We got cheap. When we arrived there was a steaming mad lady in the lobby who wanted her money back. NO REFUNDS. I went to look at the room prior to signing at her urgency. It was ok and would do for my next to nothing budget. Room had paint peeling and by the eve of our departure the ants found us. I read other entries and for a couple days I walked in and out confidently saying the ant reports were bogus-NOT. When we arrived, the fridge wasn't plugged in and the AC was not on, so it was steaming hot and we had luke warm juice because there was no ice machine. We were told to go to the shopping center and buy a bag of ice for 2 bucks and it would not have fit in our freezer. The freezer didn't freeze either. Carpets were worn as were draperies. No table to sit at but the room was small so there was no place to put a table anyway. Pool area was dilapidated and there were broken light fixtures. The pool could use a good cleaning too. The pool is only open from 930am to 7pm and you have to ask to have it unlocked. It's a shame because with an over haul that place would be awesome. It was one block from the beach, less than that even. The maid service is full of non-English speaking staff. When you ask for 2 flat sheets, you get one. They do not use fitted sheets so bone up on your bed making skills that require hospital corners. We had slid sheets off the bed by the morning after we arrived and once I made the beds utilizing my nursing skills, they didn't budge. The nitwit maids only gave 2 towels and 2 washcloths to use between 4 people. They didn't provide trash bags in the cans and the GUEST has to REMOVE TRASH ON THE DAY OF DEPARTURE from the rooms. No one was rude and I did get a weird feeling from the place, so I locked up valuables in the car when necessary. It also attracts kids with kegs. Monday through Friday it is quiet and it's safe. The kids were disappointed and called it small and boring.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lanham, Maryland", "Title": "“Decent”", "Author": "msvenice", "ReviewID": "UR64055802", "Content": "My boyfriend and I decided to have a weekend getaway for memorial day weekend. we drove three hours from our home in southern MD. without a reservation for the holiday weekend we knew we would not get and affordale rate last mintue at a hotel. The cabana was perfect for the weekend. affordable price, the rooms were ok.. a motel room for sure. which didnt matter because my boyfriend and i was out of the room most of the time at the beaches and clubs.. just a place to shower and crash. we came down again for the fourth of july with out a reservation and sure enough the cabanna came through for us. Its in a great location and i think its where we'll crash this year", "Date": "May 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New Jersey", "Title": "“DISGUSTING! Don't STAY”", "Author": "Lislazz", "ReviewID": "UR46002135", "Content": "We decided to take a long weekend in Ocean City, MD the 1st weekend in September, 2009. Check out a lot of sites and this Motel kept coming up - being touted as \"clean, family owned and operated, yadda, yadda\". We didn't want something right on the beach of boardwalk because of the noise and this one was a block in - pretty pictures - family run - sounded good enough - we just needed a place to sleep! It was the most disgusting place I have ever stayed in. Unfortunately, they've got your deposit up front and as you're checking in (and second guessing you're plan because of what you're seeing in person - and it has nothing to do with the photos on any web site checked) you see the small sign that says \"no refunds\". So you might as well grin and bear it and stay the night. Right? WRONG. DON'T DO IT! RUN AS FAST AS YOU CAN. Entering the room - (I'll forget about the outside - it is a motel near the beach - the elements have beaten it to death) we put down our bags and sit on the corner of the bed, which immediately falls to the ground. The carpets, wall paper/paint, curtains, etc., have not been changed (or probably even really cleaned) since the 1960's. I am NOT exaggerating. The bathroom - OMG. Worse than the public restrooms on the beach/boardwalk. Again, NOT exaggerating. Oh did I mention that when you close the door you can see daylight coming through all 4 sides? The worst - the ants. I saw one ant before we left to go to the boardwalk. We came back with an italian ice - almost finished. Walked into the room - put it on the night table - changed my clothes - turned around and the cup was COVERED with ants. You could not tell what was under the ants. There were so many, there were layers and layers of ants on top of the cup, in the cup, climbing up the table to get to the cup. Went down to the lobby (which was closed) - to get someone to come look - figured then there was no way they could refuse me a refund. But alas, nobody home! Call the number on the sign taped to the front door - guess what? You guessed it - NO answer.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Baltimore", "Title": "“The most nasty place you've ever seen, trust me”", "Author": "Jay3607", "ReviewID": "UR37896075", "Content": "I am not a snob or picky AT ALL, and i will stay just about anywhere if its half way decent. This motel is so nasty i cannot even describe. Please trust both my review and the other ones that say its nasty-- and there are many. This place has it all; mold, hundreds of ants in your room, stinks, inoperative faucets, your bedding IS NOT CLEAN, suspected mice infestation, the maids steal. Ive been to prison in my youth and stayed in more humane dwellings. This place should be shut down, blown up and/or set afire. NASTY!!!", "Date": "August 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "PA", "Title": "“Spend the extra money for a better place”", "Author": "Traveler1234Pa", "ReviewID": "UR37668410", "Content": "On a trip with my sister we picked this less expensive place to stay since the pictures of the motel looked descent. We aren't super picky about hotels/motels, but this place was disgusting! As soon as we check into the room we notice there is sand allover the bed and also noticed some kind of vomit like substance on the comforter as well. The ceiling tiles have black mold on them. The bathroom couldn't have been cleaned all year. The sink sprayed water everywhere when you turned it on. We woke in the morning to ants allover the dresser and there were strange noises all night. Resembling the sounds of mice scurrying through the walls. If we knew it was going to be this bad we would have spent the extra 50 bucks for a better place. Not recommended for those people who like a little cleanliness in their lives.", "Date": "August 14, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "3", "Value": "3", "Location": "5"}, "AuthorLocation": "Joppa, MD", "Title": "“Very Small but Nothing too bad”", "Author": "poca1313", "ReviewID": "UR34173033", "Content": "This was the cheapest motel I could find for one night. The room was clean but extremely small. The window was really small and didn't open. I saw a few ants in the bathroom. It is definitely an old motel with few upgrades but it we didn't stay long in it served its purpose and we all got a good nights sleep. The pool was small but clean and the kids enjoyed it. But what can you expect for 75$ a night? The people above us were extremely noisy as well.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Pen Argyl", "Title": "“Nasty!!!!”", "Author": "BannaBoat87", "ReviewID": "UR32488199", "Content": "Stayed here for 4 days last july. It was very hard getting extra towels, there was mold on the ceiling and in the bathroom. The entire room smelled like something had died. The cherry on the top was when i thought the maid was stealing money from me. I would leave spare change on the dresser and on the bed, when we came back form our day it would be gone. I wouldent suggest anyone staying here, you get what you pay for. Also, I got a really bad case of athletes foot from their beautiful bathroom floor, make sure you wear flip flops, bring your own blankets, and maybe a safe to put you’re belongings in.", "Date": "June 16, 2009"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“I want to Stay Again!!!!”", "Author": "lullabykisses13", "ReviewID": "UR16519996", "Content": "I'll admit it wasn't what I expected...but for me it was perfect! Me and my guests stayed in a standard room and some other people that were with us stayed in the larger room. The standard room was fine, small, but sufficient (stay in the deluxe room if you have a lot of people). The bathroom was a good size and the shower was plenty large enough (The bathroom in the deluxe room was the same size but had a tub/shower). It has great parking and great proximity to the beach and boardwalk. The balcony/walk way is a little concerning because its weak in some places, but it wasn't a problem. I stayed on the second floor in a room second from the end. I wanted to stay this year but they were booked for the dates I need :). I liked it, and it was the best vacation I ever had (and yes I've stayed in nicer hotels). Perfect for people who want to spend most of the day out and about and have a clean convenient place to sleep and shower...or just watch TV. Oh and big plus...Dunkin' Donuts is right next door...and CVS is across the street! Such a great location we never had to use the bus (I do like the bus though, its great for getting around). All in all, I got my money's worth and then some.", "Date": "May 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "baltimore maryland", "Title": "“old but very clean and good price”", "Author": "aj4519", "ReviewID": "UR8588587", "Content": "me and my wife stayed at the cabana motel for a week our stay was very good the price was even beter and the service i could not say one bad thing about it i would tell all my friends to stay at the cabana because the price is great and teh rooms are clean and its a family motel that does not rent to too many kids i saw all families there and i liked that alot.", "Date": "August 30, 2007"}], "HotelInfo": {"Name": "Cabana Motel", "HotelURL": "/ShowUserReviews-g41298-d664835-Reviews-Cabana_Motel-Ocean_City_Maryland.html", "Price": "$30 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1900 N Philadelphia Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "664835", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/88/de/88de174264e4f07fe50d255e616f10e21large.jpg"}}