{"Reviews": [{"Content": "A shocker! We last stayed here 14 years ago, and we had very special memories about the place. It was pretty decent then, but I don't think anything has been done to the place in the intervening time. Shabby in the extreme, run down, and the junkie chatting up the reception lady didn't help. To make matters worse, the balcony door to the room didn't lock, and there was no way we were going to stay in a place like this with a non-locking door. I think the receptionist worked out exactly how we felt, and offered our money back. Good move!", "Date": "Dec 12, 2008", "ReviewID": "UR625034988", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "joandtina"}, {"Content": "A Sydney Secret Having had to spend an extended business trip in Sydney recently, it was brilliant to find this 'home away from home' at such reasonable rates. Sure the rooms (studios  1 bedrooms) could do with a lick and a polish but they are sunny, all have balconies, and are in the heart of a plethora of restaurants and bars. Sydney's coolest pizza bar (Hugo's) is downstairs. Kings Cross train station is 2 minutes away. There are a supermarket and a convenience store within one minute.Minuses:The kitchenettes are not up to much - OK for making breakfast but stick to restaurants and takeaways for other meals. There is no airport or other broadband. You have to clamber into a tiny bath and have poor water pressure for the shower. You have to take your own rubbish out and cleaning is only weekly.Pluses:The lovely staff - Michael and Lada - who will do whatever they can to help you. Location location location. Sunny, warm and bright. Price price price.Highly recommended.", "Date": "Aug 7, 2007", "ReviewID": "UR678572466", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "bloodgroup"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d669540-r22662999-The_Crescent_On_Bayswater-Sydney_New_South_Wales.html", "HotelID": "669540", "Price": "Unkonwn"}}