{"Reviews": [{"Content": "Excellent value for price  We found this hotel through a Japanese website that had good reviews. We were not disappointed.It is located near a subway station. We stayed in a large room with 2 double beds, which is large for a Tokyo hotel. The price was also very reasonable (~C$90 for the room). The bathroom was small but clean and efficient, but this is standard for a Tokyo hotel. It is in the Asakusa part of Tokyo near the famous Asakusa temple (Senso-ji). Our friends also stayed here and used the modem (provided by hotel) in their room with no problem. I used the free wireless in their lobby (my pocket computer to use Skype to call home), with no problems.The receptionists were very friendly. They even stored our friends' baggage for a whole week (for free) until they returned to stay there (as they didn't want to travel with a lot of luggage through Japan). Furthermore, the staff at the front desk spoke English which is hard to find in Tokyo.I would stay here again if I return to Tokyo as it was good value for our money with easy access to subways.", "Date": "Aug 25, 2007", "ReviewID": "UR635831152", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "Xcalibur"}, {"Content": "Royakan like family room in Tokyo A great Asakusa location, the hotel is located on the same street as the Kanimarimon gate of the Asakusa Kanon Temple. It was booked for us by friends who live in Tokyo. The special room we rented had two double beds and an area with a tatami floor. The floor could be used as a small meeting space, or mats can be spread out. This gave the room a royakan feel. The children or parents can sleep in this area. The room has a spaciousness unexpected in Tokyo.The standard rooms look western style, but I did not stay in them so I cannot say much about them.There is Chinese restaurant on the second floor for breakfast serving chinese/japanese style breakfast.. If you crave a western style breakfasts, that is not a problem as there are western style restaurants in short walking distance.I would have given the hotel an above average rating, but for two problems. One, the air conditioning was very poor. Two, despite advertising fast internet, we could not get our laptop working with the hotel supplied modem. The modem had to be hooked to the phone, which was located by the bed and not the desk. We tried two modems andthen gave up. I had to connect with the wireless in the lobby.Overall, if you are a family looking for a room in Tokyo, with a somewhat reasonable rate, this might be the place for you.", "Date": "Aug 19, 2007", "ReviewID": "UR249956815", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Ben60025"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066461-d672038-r8501509-Asakusa_Central_Hotel-Taito_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "672038", "Price": "Unkonwn"}}