{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not for you if you value your privacy!!”", "Author": "Kym D", "ReviewID": "UR126523383", "Content": "I stayed at the Ambassador only for 1 night. While I was there I took a shower and staff let themselves into the locked shower cubicle that I was in apparently to fix the blocked drain. When they walked in on me they seemed to find it highly entertaining and after walking out just continued to knock on the door incessantly until I got out. When I talked to staff about it later they just implied that I left the door unlocked (which I didn't, I heard staff playing with the handle for a few minutes before they actually got in and am confident that they knew someone was inside). I doubt that anyone spoke to the maintenance people about it afterwards and I wouldn't feel confident that it wouldn't happen again to someone else, so shower at the Ambassador Vancouver at your own risk!!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Threw me out on the street! Not for my actions, but anothers'”", "Author": "Jennifer C", "ReviewID": "UR122648574", "Content": "I had been staying here for 10 days and was going to extend my stay for another week, but they wouldn't because the manager left a note not to. No one told me this ahead of time so when it came to my atttention that a so-called friend of mine had dropped by the night before and given my name and room# and asked to see me, well I guess there was some sort of discussion. LONG STORY SHORT... they totally left me scrambling to get my stuff together and find somewhere to stay at the last minute. I accept some of the blame for having a friend without enough commen sense to bite his tongue when he feels someone is giving him a hard time, but it was me, who had nothing to do with his actions, that paid the consequences. Not fair. Yeah, I know that's life. Other than that, the maid was virtually non-existant and the free wi-fi crapped out right when I needed it the most to find a new hotel. (Or maybe that was further punishment for whatever stupidity happened, when I wasn't even there!) I sure sound whiney and I hate that, but I was in a mild state of panic. It is not nice to put a single girl, on her own, out on the street. Not nice at all.!!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland New Zealand", "Title": "“change of name”", "Author": "jeannie020", "ReviewID": "UR118434055", "Content": "This hotel has now changed its name to Ambassador Hotel but is exactly as it was, it really is more of a backpackers than a hotel but for the price quite comfortable, although the room we had was terribly hot, we had to sleep with the window open and the door partly open though secured as there was no A/C. The staff are friendly and the room was very clean . It was handy to the centre of town and Granville Market.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Centrally located, and great value for a budget traveler.”", "Author": "deadhippy", "ReviewID": "UR87214022", "Content": "I was in Vancouver for 4 days, and stayed here. It was a small cosy room, great to come back and unwind in after a day of sightseeing. Shared bathrooms, but these are very clean. Nice cozy lounge where you can watch TV and also enjoy wi-fi. Great friendly staff. Best thing about this place is that its walking distance from most things- Granville Island, the museum, shopping districts, train stations etc. Easy to get to and from the airport.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“A really nice little hotel with great staff!”", "Author": "Candycloud", "ReviewID": "UR34510097", "Content": "3½ stars, totally. Since our flight arrived in the evening and it was way past regular check-in time (I had sent an e-mail where i asked for extended check-in time) I was expecting problems but there were none, the guy at the reception was really nice and truly intrested in what we had to say. All the rest of the staff which we encountered during our stay were also very polite and helpful. And as we were checking out at the end of our stay, they kindly stored our bags in their office since we had many hours til the departure of our flight. We were aware of the shared bathrooms and showers, this was clearly stated on the site were we had booked our stay. The guy at the reception also took the time to mention this. The room we were given fit our needs quite well, after all we were there to see Vancouver, not the four walls of our hotelroom! Equipped with a big double bed (sheets clean, bed neatly made), wash basin, fresh towels, TV, fridge (big plus atleast for me) , big fan and a safe (another big plus) the room was just fine, atleast in my opinion. Both of us were travelling with big suitcases and there was plenty of room to leave the suitcases open without tripping over them. The door locked fine, and the window was easy to both open and close. Our window was even equipped with a net ( good thing since we had enormous seagulls and other birds parading on the roof just outside our room, so beware of birds, hehe.), so we felt comfortable leaving it open during the day when we were gone. Housekeeping worked fine, our bed was made and our towels were changed almost every time we came back after a long day out. I didn't mind the times this didn't happen since i don't change my towels back home every day either! We didn't use the kitchen, but I think that was a great facility which they had to offer. I had a quick look inside when the door happened to stand open and everything looked very clean and functioning. Now, I understand that someone may find the sharing of the bathrooms a problem, and of couse it would have been nice to have an en-suite, but this system worked fine as well. Locks to both shower and toilet worked just fine. And during our 3 week stay, I qued to shower and toilet maybe once and that was for max. 5 mins, so no complaints there. When sharing a shower or toilet it's just common scence not to occupy it for like an hour, and people did seem to remember that. We had breakfast every morning, except for one or two when the whole street was suffering from a power breakdown. These mornings the staff apologized and were truly sorry for the inconvenience. There's a 7/11 and a Subway-restaurant just down the street towards Granville bridge, so it's not a long walk to get some quick breakfast. Anyway the food at G sports bar was nice, as was the staff and the bar itself. (Once we returned home I developed a huge craving for pancakes and maple syrup after having had it almost every morning, he he) Laundry facilities were also easy to use and cost just 1 dollar per wash, but haning the clothes out to dry was a little tricky since there was actually no place to hang anything in our room. But it worked out eventually. Location was great, close to cinema, library, shopping, eating, theatre and much more! And the drive to and from the airport didn't seem too long either. The only minor complaints on my behalf were the noise from the bar below (can easily be solved with earplugs) and that there wern't always dry towels to stand on stepping out from the shower, that's it really.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Union, New Jersey", "Title": "“European accomodations in downtown Vancouver”", "Author": "Pointe-Claire", "ReviewID": "UR33373251", "Content": "The Granville Grand offers European style accomodations, which means shared bathrooms. There are two full baths per floor (men/ women) and two half baths; individual vanities can also be found in the room. In general, our room was pretty acceptable- clean sheets; a dresser, TV, and mini-fridge. However, there was no closet but a triangulated bar from which to hang clothes, no air conditioning, no cable TV, and not-so-plush towels. One knock is that our room was not cleaned and we had to ask for fresh towels. As far as wireless, there is free WiFi from selected areas within the hotel, as well as pay-per-use desktop computers. There was a lounge area with a flatscreen TV; a kitchen area; and pay-per-use laundry facilities. They do offer complimentary breakfast at the adjoining bar- your choice of 1 of 3 breakfast options from the bar menu, which was surprisingly good (but coffee/ soft drinks are not included...how can you not include coffee??). The staff are very nice and friendly, which is a plus, considering some of the other more established hotels where we stayed in downtown Vancouver. The bottom line: the accomodations, while sparse, are what you would expect for the price. if you're looking for downtown accomodations for a place to sleep while you venture around the city, then this would be acceptable. As long as you are comfortable with sharing bathrooms (bring your flip flops and shampoos!) then you'll be fine. I'd recommend this place (based on price/ breakfast/ location) for couples/ travellers but not small families.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "california", "Title": "“Best Hotel For The Price”", "Author": "amy143", "ReviewID": "UR24193245", "Content": "I loved staying at this hotel. Very friendly people and excellent service. The people at the front desk are very nice. Great deal for the price you pay.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "UK", "Title": "“The Granville is getting there”", "Author": "rivvorz", "ReviewID": "UR24020024", "Content": "The Granville Grand sits somewhere between being a 2 star hotel and a very nice hostel. My room, and others that I saw, were large, with Queen bed, wash bashin, TV and storage closets and rails. There is one shared shower (and toilet) and one toliet per floor, a shared kitchen (equipped with 2 microwaves, a large oven with four gas burners and pretty much any cutlery of kitchen equipment you might need), a shared lounge (with large Plasma TV) and a 'WiFi' Lounge (a shared computer and desk for people to use their wireless devices at - the wireless didn't work consistently through the building). I was shown around before I checked in, so was made fully aware of the shared nature of the facilities. The staff were polite and helpful. If you are looking for somewhere cheap, but nicer and more private than a Hostel, then the Granville is a good bet. The location is really good, and there are deals with the nearby 'G's Resturant & Grill' (which I ate at tonight - food is good and they have sports on the TVs). It so happened that I needed to check out earlier than I'd anticipated, but the staff were helpful and sorted everything out for me. So in summary - it's not the ritz but it doesn't claim to be. For a short or medium stay in Vancouver, you could do a lot worse, just come with your eyes open.", "Date": "January 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "falkirk, scotland", "Title": "“hostel not hotel”", "Author": "ka058", "ReviewID": "UR18832906", "Content": "stayed one night here... so obviously a hostel and not a hotel. rooms were clean, but noise from street was so bad as to prohibit sleep. nightclub next door possibly??? dance music played til early hours... two bathrooms per floor, again clean. overall this is fine for a drunken night out, to crash in, close to downtown, however if you plan to sleep, book more carefully and spend your money more wisely. breakfast is served in bar next door... you are given a voucher and advised to eat there. food was nice, but the voucher only includes three options of breakfasts and no drinks of any kind at all.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ireland", "Title": "“Worst \"Hotel\" ever!”", "Author": "braystoners", "ReviewID": "UR17775112", "Content": "This is not a hotel, it is a hostel. There are no en-suite bedrooms, which they neglect to mention until you have checked in. Even if this is not a problem for you, there are approx 20 bedrooms on the 2nd floor with only 2 showers for the whole floor... and they don't have working locks on the doors of the showers. Location is pretty awful. Apparently it is the centre of the \"entertainment district\", which seems to mean a dingy street with bums begging every 5 metres, and raucous drunken teenagers parading the streets. It classes itself as a \"new\" hotel, but it's mismatched furnishings are anything but new. For those who enjoy a hot sweaty night you will be happy to hear there is no air conditioning. Safety is paramount at the Granville Grand, we had a fan in our room which was missing it's front cover. The guy at the front desk was quite rude. When we decided to change our 4 night booking to a 1 night stay as we were appalled just after seeing the lobby, he told us we were crazy and we would never find anything so cheap. Price isn't everything! To sum up the Granville Grand is anything but \"grand\".", "Date": "July 11, 2008"}], "HotelInfo": {"Name": "Hotel Granville Grand", "HotelURL": "/ShowUserReviews-g154943-d672510-Reviews-Hotel_Granville_Grand-Vancouver_British_Columbia.html", "Price": "$64 - $132*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1212 Granville Street</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6Z1M4</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "672510", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bc/47/19/hotel-granville-grand.jpg"}}