{"Reviews": [{"Content": "Lovely stay This is a good place to stay if you dont mind not having a beach at your doorstep. Having stayed in numerous private villas and hotels in Bali, this was the best experience in a villa. It doesn't have spacious grounds as other villas, but we needed a clean, mosquito free, safe environment as we were traveling with 3 kids.So when we arrived at our 4 bedroom villa, we were pleasantly surprised by the cleanliness and hotel type service and amenities. Usually, the pictures on websites can be misleading but the villa looked exactly like those on the site.We also had a full kitchen to prepare meals for our toddler. Room service usually arrived within 15 minutes (maybe cos it was off-peak). The pool was enough to entertain my 3 kids. There is also a good restaurant (Blossom) and the breakfast selection was pretty good. If we wanted to hit the beach, a public beach is a short stroll away (but through a small lane) which was not practical with 3 kids in tow, so we just went to Ku De Ta, and also the Conrad (where you could pay a small facility fee to use their pool and beach) Location is pretty central with La Lucciola, Hu'u and Sarong minutes away.We booked direct which may offer discounts during off peak season.", "Date": "Dec 3, 2008", "ReviewID": "UR101106716", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "4"}, "Author": "acir"}, {"Content": "The very best in Bali! Oh, my God. Without question the very, very best Bali has to offer (and we've experienced a lot!).My partner and I had discovered The Sentosa by accident in November '07 after a discovery jaunt on our motorbike. We were staying at The Legian at the time, and upon arriving at the most impressive entry I've experience in years of international travel, I felt like I'd walked into a James Bond movie. We ate at Blossom, drooled deliciously, went back for dinner, swam in the main pool and were so impressed by everything we decided to stay there on our annual Bali trip this year.Checked in a few hours earl, yet our rooms were ready. Our Sentosa driver delivered us to our villa, opened the swivel door and... there we were. In paradise. Huge premises all to ourselves, positively private. A living/dining/fully equipped kitchen area bigger than our house at home, completely separate to our bedroom/bathroom area. And what an area that was!We were in a Royal 4 bed villa (they'd locked the other three bedrooms as we didn't need them) king size bed and plasma TV - with a marble bathroom which was as big as most hotels rooms, with a jacuzzi bath! Even the bathroom was airconditioned. The bathroom led to a beautifully manicured private garden with an outdoor shower like you've never experienced. And the lap pool was as large as our pool at home (which is huge!).My only gripe: it'd be great if there was an iPod dock in the living area.PLEASE ignore the other Tripadvisor review on the Sentosa complaining about the staff and also the belief that particular reviewer was ripped off. If that reviewer wasn't savvy enough to shop for the best rate before they got there, it's nobody's fault but their own! Contact the hotel, check their online rates, then go through a wholesale travel agent - shop around for the best price - it's not that hard! So if you end up with a bad rate, it's no-one's fault but your own.You could not fault the staff - personal touches I've never experienced - even at establishments like the Four Seasons, Mandarin Oriental and Waldorf Astoria: so eager to please and constantly happy - which can't help but make you smile in return.The gym is high-tech and certainly satisfied my rigorous daily fitness requirements. Luxe Lounge spa is out of this world, with very reasonable prices for massages.Don't even get me started on the food at Blossom, the hotel's restaurant headed by Australian Executive Chef Chris Z. Better than any gourmet I've eaten in Sydney, New York, Paris or even little old Perth.The experience is absolute and will stay with you as one of the most magical experiences ever. And I'm a cynical traveller quick to point out the bad things, so to impress me is a hard task.Pricey? Maybe. SPOIL YOURSELF.", "Date": "Nov 17, 2008", "ReviewID": "UR130420762", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Marika_G"}, {"Content": "Wonderful and well worth it We spent 7 nights at the Sentosa based on a friends recommendation and overall we were extremely happy with the decision. So much so, that we are planning to stay again next year! It is also great value for money with the space and facilities you have.The villas themselves are very large. We had booked a 2 bedroom villa, but as normal we were placed in a 3 bedroom and they locked off the spare. All bedrooms were generous with great fittings. The bathrooms were a mixture of some outdoors, master being indoors.(which im told is not the case in every villa- check this out if its an issue with you. I would imagine that in really hot weather showering and putting on makeup outdoors on a really humid day wouldnt be great!). Neither had any great drawbacks for us.Service was excellent throughout. They knocked themselves out for us and were charming, friendly and helpful always.Prices were good and food was lovely, though limited in choices and evening dining has a heavy emphasis on Thai.We had some great treatments at the spa although I do think they dont have the usual touches that alot of spas in asia have. There was no offer of changing into a robe first or showering afterwards even though they have the facilities for this and they bring a basket into the treatment room with you that has a gown in it?? Strange. Perhaps more training wouldnt hurt.The lounge / kitchen area was wonderful with full size fridges and all indoor areas are well airconditioned. I have seen some comments here that the villas were starting to look alittle shabby. I wouldnt totally agree with this, although I did notice that the furniture in the lounges were quite stained and this was abit off putting. At this level they should ensure that they are well cleaned and kept that way.We loved the flexibility these villas offered. You had all the amenities of a 5 star resort whilst also being able to self cater and bring in your own beverages (which everyone does. Bali Deli is 5 minutes away and VERY handy!).One word of warning to families. The 'kids club was no such thing. One small room (air conditioned) with some shabby old toys, a TV and NO ONE in attendance. There is no programme, and it is right by the pool. What sort of parent is going to leave their kids there unattended?? It didnt present a huge problem for us however as the pools in the villas are so large that the kids only wanted to be in the villa anyway, but as an option - not ideal. If they could sort this area out they would have a fabulous, well run and thought out boutique establishment.", "Date": "Aug 4, 2008", "ReviewID": "UR170100576", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Burracooka"}, {"Content": "Not that great! We have just returned from 5 nights at the Sentosa Villas. To be fair we had had 5 nights at the Amankila, so anywhere would probably have been a let down, but Sentosa is no way a 5 star resort. The villas themselves are fairly spaciousand nicely done but they are already looking a little worn and they are not that old. We had a 4 bedroom presidential villa but it was situated in the middle of a construction site - not Sentosa's but surrounding properties. The banging and sawing started at 8am each day and continued to 5pm. There was no privacy as there were people working on roofes that overlooked our pool from both behind and beside our villa and dust and dirt also blew in. When we complained they did move us but they did not seem very apologetic and the villa we moved to while it was not overlooked and we didn't get the dust we still got all the noise. I don't think that most people go to Bali to listen to banging and sawing all day. They must have known it would be a problem but they were still putting people in that villa and the others nearby.Service was slow and sloppy - 4 phone calls to have lunch dishes removed. It wasn't all that clean - some days they emptied the rubbish bins and changed all the beds and others they didn't. They only provided 3 pool towels - some of which were yellow and stained - even though there were 5 of us in the villa. They seemed surprised that we would need one each. Reception would happily ignore you for 5 to 10 minutes when all you wanted was for them to order you a taxi.Overall I would probably try somewhere else next time and I really wouldn't recommend it to my friends.", "Date": "Jul 8, 2008", "ReviewID": "UR746384563", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "3"}, "Author": "Davies72"}, {"Content": "Unique Seminyak Sanctuary If you want to relax in uber style with privacy on tap, this is the place to be in Seminyak. We spent a week here in March and could have easily stayed a month if time permitted. We stayed in a 3 room villa that was superb. The staff were attentive and discrete and the bar, restaurant, spa/gym are something to experience. It's hard to describe other than Sentosa has a sophisticated vibe that we haven't indulged in any other resort in Bali (anywhere else for that matter). It's not the place for you if you like big hotels with hundreds of guests crowded around a pool!PS, what a place for a party.", "Date": "Jul 2, 2008", "ReviewID": "UR663125244", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "worldwandererPerth"}, {"Content": "Dishonest, arrogant and a blight on Bali We made a booking direct with the property at US$1331 for a three night package or $443 per night. This compared almost exactly to what was available through various online booking services but with a complimentary BBQ and 2 x massages and a boat trip. The usual incentives to book direct. We paid that exact amount in advance by credit card. Upon checking out we were informed that this was a PER NIGHT rate and that we owed and additional US$2662. I refused to pay and asked to see the General Manager. He would not speak with us and after 1 hour a manager arrived. Rushing to catch our flight he finally agreed that we could pay the same rate as that on the internet and settled the account for extras. Upon arriving home we received an email stating that we must pay or that the matter would be handed directly to the Indonesian Police. Being regular vistors to Bali we wanted to avoid this so we reluctantly settled. Absolutely disgusting. DO NOT TRUST THEM.", "Date": "Jun 21, 2008", "ReviewID": "UR510830364", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "3", "Location": "1"}, "Author": "kevinyaxley"}, {"Content": "Great Villas ... very CHIC!!!       The main pool beside Blossom Restaurant - which is empty all the time!!!", "Date": "May 22, 2008", "ReviewID": "UR885094514", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "4"}, "Author": "davao"}, {"Content": "Terrible service, over-charged - BEWARE! This is a lovely hotel with excellent villas but the staff are horrendous and I was overcharged TWICE after leaving the hotel. I am yet to recover thousands of dollars owed to me by the hotel. BEWARE!!", "Date": "May 7, 2008", "ReviewID": "UR736198525", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "4", "Location": "1"}, "Author": "tiptopbkk"}, {"Content": "The most amazing place we stayed at while in Bali...       Our beautiful private pool...", "Date": "Mar 29, 2008", "ReviewID": "UR190156385", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "lotuschild33"}, {"Content": "Awesome Rooms, Service still Green       Outside the living room", "Date": "Feb 19, 2008", "ReviewID": "UR939920165", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "3"}, "Author": "gt4877c"}, {"Content": "Oh my god................... Had the extreme pleasure of staying here at the end of November 2007. I cannot say enough good words about it. Open for barely a year the place is and looks spotless. The open pool/bar/restauant area is modern and funky and the building that houses the spa and gym looks cool too. This place has a really trendy vibe and looking at the guests here the marketing guys are hitting the spot. I/we stayed in the four bed duplex villa which was huge, massive pool, big open plan/air lounge and kitchen area, one of the bedroom is upstairs with outdoor shower. If you want to ask me anything further (n-carver@sky.com) i would be happy to. The staff are so helpful and efficient, taking you around in a golf buggy as the place is spread out, bringing cold ones in a split second. I really cannot big this place up enough, it rocks and i will stay here everytime i am in Seminyak. Another bonus, the superb Ku De Ta is close by. GET HERE!", "Date": "Dec 5, 2007", "ReviewID": "UR774399183", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "niccarver"}, {"Content": "Absolutely amazing! Class act. I recently stayed at the Sentosa Bali and it was amazing. Each villa has it's own pool ( plus a huge guest pool near the entrance) and absolute privacy. The staff were fantastic, the food was great , the gym was sensational and the rooms were beautiful. It was not cheap but it was worth every cent. I will definately stay there again. If you want a rest from your pool, the beach is a 5 minute stroll.This place is a class act .", "Date": "Nov 29, 2007", "ReviewID": "UR356550220", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "JWHMelbourne"}, {"Content": "搴冦亜锛?#x201d;   showReview(21744905, 'full');", "Date": "Oct 15, 2008", "ReviewID": "UR824474031", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "瓒呯礌鏁碉紒   showReview(19164570, 'full');", "Date": "Sep 25, 2007", "ReviewID": "UR632777420", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g469404-d673618-r22410296-Sentosa_Private_Villas_Spa-Seminyak_Bali.html", "HotelID": "673618", "Price": "$606"}}