{"Reviews": [{"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Good Hotel with attached kitchens”", "Author": "Paragjs", "ReviewID": "UR117550506", "Content": "Stayed there for a business trip twice, first in march 2009. Good hotel in the heart of Dubai, BUR DUBAI. cheap shopping market of Meena bazaar is nearby. Dubai metro Station is also near. The staff in house keeping and room service is OK kind of. good for people with low budget . they can cook there food themselves.They Offer airport drop and pickup.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Dirty! Wouldn't rate even 2 Star”", "Author": "RMACH", "ReviewID": "UR115720552", "Content": "We stayed.three nights and after our first night would have left except we were on a tight budget and would have lost our money. We arrived at 230am - shown to our apartment it was smelly and stuffy. Air cond had not been turned on. There were only two towels (we are a family of four and this was a two bedroom apartment). The \"kitchenette\" (a hotplate, kettle, barfridge) had four dinner plates and one breadknife - no cooking utensils, bowls, cups/glasses, cutlery, pots... The master bed was two singles pushed together - no queen/king mattress on top. Very uncomfortable. The Wi-Fi did not work the first day (paying service) On our second day we happened to move the coffee table and discovered old bread/toast under the table. The floor looked like it was only ever swept and not mopped/wet cleaned. For a non-smoking room it stunk of stale cigarette smoke. We asked to borrow a multi-adaptor plug, and despite paying aed10 it didn't even fit the electrical outlets in the room. On our departure we again reiterated to hotel staff about our disastisfaction and were told it was because we \"booked through Expedia\" that we got a lower standard room.", "Date": "July 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Sachin bafna 09422038631”", "Author": "sachinbafna", "ReviewID": "UR114878625", "Content": "Perfect stay for vegetarians,best location-in market,good shopping surrounding. very good breakfast kamat restaurant in hotel,good veg restaurant shivsagar near by.good hotel for family.executive rooms r good.I enjoyed my stay.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "uk", "Title": "“Not clean and very basic”", "Author": "maleehah", "ReviewID": "UR111668873", "Content": "Was awlful and not clean the only good thing was it was quite large we stayed in a two bed apartment", "Date": "June 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dont go back !”", "Author": "mc2711", "ReviewID": "UR102093532", "Content": "This was one of the worst hotel stays i have had. From the first moment we arrived at the hotel the staff were rude and very unhelpful. they had not got our booking so upgraded us to a better room. that night they then wanted to move us back to original room. because they had new booking for the room we were in. Through out the stay the pool was not working at all ! never any expectoration or apology for this. there was a number of \"mice\" seen by the group nothing was ever done about it. A number of the group had items which went missing from their bags during the stay. When asked to see manager he refused to do any thing about it saying that his staff would \"never do some thing like that\" ! Rooms very dirty and need a very good deep clean to make them liveable. Rooms very hot and noise with traffic, The air con did not work ! The internet very slow and over priced ! Never eat in the restaurant as food very Indian orientated and an couple of the group were ill after !", "Date": "March 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chennai", "Title": "“Decent-Value for Money”", "Author": "dxbbala", "ReviewID": "UR101692279", "Content": "I am regular visitor, but staying here for the first time; Value for money property; always busy so book in advance; great location; Internet should be free, as it is very cheap in DXB; Everything else is fine; B/fast is too Indian", "Date": "March 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Surat, India", "Title": "“Not that much attractive”", "Author": "nayan0001", "ReviewID": "UR99831904", "Content": "Needs lot of improvement to attract more customers as studio rooms are too small. Service very poor. Out of the two lifts available, one lift always found under maintenance. Staff also not properly trained. Swimming pool is there on top 10th floor but that does not attract customers. Passage also very conjusted at reception counter. Over all better find another hotel in Dubai if one needs comfort and luxury at a time.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Great service and decent value for money.”", "Author": "dipalinshah", "ReviewID": "UR99068041", "Content": "The place had great service. Staff couteous to all inspite of the volumes of people there. The decor was oldish and dated, but the rooms themselves were spacious and clean. I had been there with my in-laws (who are old), and my husband was unable to come along, so it turned out to be a good choice as the staff was great. The breakfast was good, but the selling point for us was the Kamat restaurant right below. My in-laws usually suffer a lot from lack of food alternatives, so this was great. And the food was good to boot, Barjuman was a 10 min away, and the location was not bad, if not great either. Another guest was complaining that the swimming pool on the top floor was dirty, though I cannot confirm this as I wasn't able to go there. There were certain issues such as safe not working (not solved), and delayed room service, but having travelled enough, my husband and I look more at hotels'response to complaints than to the problems themselves. In proactivity, the service came out tops, but they were a little sluggish to react. However, between the general service conditions, the staff, the Indian veg restaurant at the bottom and the breakfast spread, I'd say this is a good place.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Only Eyes would believe and stay would give you the experience, I had an amazing time there”", "Author": "Kiran2277", "ReviewID": "UR97962049", "Content": "Date: 16 Feb 2011 to 20th Feb 2011 I was told before I was leaving for India that it is not a five star property and i would not be satisfied with the service. But to my surprise, I had a complete different experience. Upon reaching i was given their big two bedroom suite in place of two separate bedrooms booked for four of us. More than that, the staff were kind and most hospitable. I lost my shopping bags and i received great help from the staff around to help me search one. The breakfast menu and the arrangements made with Kamath were superb. Even my friends and cousins , who did not stay in the hotel, but came to see me , were well attended. Of all this: BIG ROOM, GREAT FOOD and SITUATED AT THE MAIN MARKET MEENA BAZAR makes it all worth a stay in DOLPHIN. Thanks for making our stay pleasant, peaceful and of all Value for Money.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Worst stay ever”", "Author": "MammaAnja", "ReviewID": "UR89256783", "Content": "Filthy rooms, Unpleasant staff, not helpful at all. Big rat in a room next to gym. Rooftop pool not avalible. Door locked every time we tryed to go there. Breakfast juice served in tiny one-use cups, at what's supposed to be a 3 star hotel. We were only served breakfast the first day even though it was to be included for the entire stay according to our booking. Good location close to Dubai creek and lots of good food.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "mumbai", "Title": "“nice & decent place to stay in dubai”", "Author": "rockwiz", "ReviewID": "UR83426434", "Content": "nice location, decent food, easily accessible. near to market area & metro stations...ideal place for people travelling with families...good indain breakfast...pure veg hotel for better for indain travellers..only problem is slow life..rest its ok", "Date": "October 14, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "delhi", "Title": "“BAD staff”", "Author": "friendlysma", "ReviewID": "UR79660534", "Content": "Hotel location good. Clean and good food. Bt all things are in vain when the staff is not good. They will nt help u and also its a surprise when u ask dem road to a famous place and dey reply, sir we dnt knw. And also if u try 2 bring ur guest into hotel the staff will not allow bt you can take a guest frm d hotel itself. The reason dey say its banned bt we can provide u frm hotel not ur frend frm outside. I have a vry bad experience and i recommend dnt take this hotel.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "mumbai", "Title": "“Good food, spacious rooms”", "Author": "mehul84", "ReviewID": "UR69030667", "Content": "rooms are big , clean....food is good.....best option for indians even the location is good.....near meena bazar, were lots of shopping can be done", "Date": "June 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“The best for family in this area”", "Author": "Travelloholic888", "ReviewID": "UR67036273", "Content": "I am regular traveler to Dubai UAE i have also stayed in Imperial suites ,York & Ramada they are just pimp hotel service only for that people those who wants single enjoyment But this hotel is strictly a family hotel no nonsense is allowed family can stay for long time and best of all the morning Indian & continental breakfast is free which i like the most because their breakfast is like home made food. The only family hotel left in Bur Dubai.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "vadodara", "Title": "“budget comfortable incity hotel”", "Author": "deepzaveri", "ReviewID": "UR58902893", "Content": "dolphin is a 3 star hotel, its location is good as it is in city area of dubai. meena bazar. please confirm the booking to this hotel before reaching to hotel... location is best , as it is in city, and also its budget hotel", "Date": "March 18, 2010"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fremont, CA", "Title": "“If you are human, just avoid this Hotel - Dolphin Hotel Apartments, Dubai.”", "Author": "Paul107", "ReviewID": "UR49938311", "Content": "I stayed at this Hotel in Nov. 2009 and treated like a Dog. They forced all their guest to submit their passport. In fact, I made a police complain for that too. In case, if you are visiting this Hotel, Please… Please don’t submit your passport. And if you will submit your passport, please be prepared for surprise. Another thing, they might give a drop-off transfer in a Van without Air-conditioned. So be prepared to get lot of surprise in this Hotel. I will strongly recommend that if you are human and paying just close to $100, just avoid this Hotel. There are 10s of Hotel next to this Hotel which provides lot better service at the same price.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Nice Hotel Cum Appartment”", "Author": "VirendraPethad", "ReviewID": "UR39027308", "Content": "I had been in Dubai for 3 days and stayed at this place. It is a nice hotel cum appartment and very very good for asians specially Indians. The rooms are really big, spacious, neat and clean with an equally clean bath. The location of the hotel is also good ie in Meena Bazar. There are plenty of Indian restaurents near by and is also near to Deira. The only turn off is that sometimes the area gets a bit crowded. The breakfast is nice & Suitable for Indians.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Wouldnt Go BACKK\"!!”", "Author": "DP523", "ReviewID": "UR37450471", "Content": "I stayed there for a week , let me start wil the good points the hotel was located in the meena bazar where all the shops were there was A wonderful resturent oppiste the hotel -FOR VEG ermm the rooms were a suite so it was nice n BIG. Now the bad points it took forever for the lifts to come! the swimming poor was tiny n rubbish the gym was TINYYYY !!!!!! the resturent was crap n so was the staff", "Date": "August 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Essex", "Title": "“Fab!!!!”", "Author": "JasminEssex", "ReviewID": "UR29692117", "Content": "My Mm and Dad treated my 3 sisters, me, and my daughter to a week in dubai. Its was arranged by Hari Om Travel and it was one of the best holidays i have been on. The hotel is located on the corener of Mina Bazar, and it was great for 5 gilrs all wanting to do shopping!!!! We had some indian suits made at Dream Girl and were charged around 9 pounds for stiching. you can by some really lovely ready made suits too. My sisters are real pros at haggling so do not be afraid it is expected!!!!!! The hotel was clean and the staff freindly, becuse we went away as a family we wanted to stay on one floor which the staff helped us to do until we were all happy. My Mum and Dad are elderly and they were well looked after and respected at the hotel and in all the shops and resturants we went to. the pool at the doplhine was lovely and a must, go upstairs and chill on the roof top. Mum and Dad both enjoed sitting on the roof terrace too. The best jewlers in Dubai is Kanz at the gold souk. (dont bother with any others!!!!!!) They were fab and we were in there so long they ordered lunch for us!!. Take your old gold and trade it there. We ate at Rongali most night which is a pure indian vegetarian resturant and they had an amazing choice of food. The buffet is a good deal. Again staff very helpul to Mum and Dad. I think if you are Asain and a girl this is a great hotel, and we had a fun time shopping. although thigs are the same price as U.k it was fun to shop. We went on the night cruise and this was great fun, again Mum and Dad looked after, and vegetarain food was lovely. The jeep safari was a blast and we had a giggle the whole time althoughtMum and Dad did not come. You must try the river boats they are cheap and fun. The weather in April was lovely and just right. Defo go back, this time maybe i will try the beach and water parks, with my family.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bangalore", "Title": "“Good for Strictly vegitarian Family types...”", "Author": "mohanherle", "ReviewID": "UR21640899", "Content": "Please read my opinion keeping in mind I have paid 500AED for a double room with 2 persons per day and easy cheap mobiliy being important concern. The room I was staying in was very clean with good linen and simple, tasteful interiors. The air coditioning was noiseless and was very efficient. For the price the room is well furnished which also includes hot plate, fridge, sink, iron box, locker, provisions of coffee/tea/sugar. About the TV....not good. The reception is relatively small and always crowded. Majority of the crowd is Asian (Indians in particular). The staff at reception barring few could have been more professional. The breakfast is extremly good if you like strict vegitarian Indian food. Catering is done by a group related to a famous South Indian restaurant chain called Kamath Hotel. The location of the hotel is very good if you are looking for quick and easy access to all important parts of UAE. From airport you can catch any bus which reaches Al Gubia bus stand which is very near to hotel by paying 2 AED. Other bus routes to hotel from airport are C1 and C2. A small walk will take you to the creek and by paying 1 AED you can reach Gold/Spice Souk (Diera) by boat within 5 Minutes. Dubai museum (good) is 5 minutes walk and is next to creek. Burjuman Mall (good) is 10 minutes walk away and Careefour (Super market) is next to bus stand. We can reach Abu dhabhi (15 AED), Sharjah (5AED) and all other local places like Jumeira area, Sheik Zyad Road and other malls etc., (flat 2 AED for local travel within Dubai) from the Al Gubia bus stand which is 5 minutes walk from the hotel. Free airport pickup and drop are possible with request. Hotel does not have a Bar, Night club, and defintely not suitable for Bachelors with different ideas. However, for travellers with family and budget and easy mobility being other concerns may find this hotel suitable.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "london", "Title": "“vegetarian delights”", "Author": "holidays786", "ReviewID": "UR14814967", "Content": "Arrived there on an overnight flight, had emailed the hotel prior to arrival so that i can have an early check in but the man in reception was very unhelpful with this and could do with a lesson in customer service. However a room was sorted out after making a bit of a fuss which i think you have to do in general to get anything done as people are very laid back. The room was ok, two single beds, kitchen area and seperate bathroom. Cleaniing was ok and we recieved a complimentary bottle of water everyday whilst we were there. The breakfast is buffet style but only vegetarian both indian and continental, this was a slight downside as we were not told that this is a vegetarian only hotel, but you can have food delivered to your apartment. Overall it was ok and central near the meena bazaar and walking distance to get the abra ( water taxi) to deira which was quite cheap, can get a bit noisy at night but still ok. May consider going again as the rest of the staff were very friendly.", "Date": "April 5, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "ahmedabad", "Title": "“no frill apartment hotel”", "Author": "vandandalal", "ReviewID": "UR14294270", "Content": "No frill apartment hotel is located in mini India in Bur Dubai. Hotel has studio rooms(ie one bedroom),two room apartments with separate kitchenette & dinning area.Hotel rooms are equipped with fridge,small kitchenette,locker apart from TV & airconditioner. Rooms are reasonable in size.Each room has a window facing the main roads of the area. The hotel has Kamat Restaurant (Very popular south Indian food chain of restaurants). Small swimming pool on terrace & a health club are the additional features of the hotel. Major advantage of the hotel is it is in the centre of Dubai so very convenient to travel around.As it is in little India(known as Mina Bazaar) you will fill like you are in India. At least 10-12 Indian restaurants,majority of Indian brand shops like Raymond,Liberty,Bata, Parthas,Nalli etc.Apart from that it is very near from creek,major bus stand,electronics market,Dubai museum etc. As the hotel is a family hotel & does not have pub,discotheque & theme restaurants it does not have nuisance of prostitutes(it is very common in most of the hotels in Dubai). The hotel is managed by south Indiann so it has typical Indian touch.Majority of staff is Indian & you can so talk in Hindi & rupees as the currency. Problems at Dolphin. Requires maintenance & upgradation of the venue. Noise of the vehicles. Lifts are terribly slow. The kitchenette is basic,while safe lockers does not work. Breakfast is typical south Indian one. Few more continental varieties will give good change in the menu.No eggs are served,so no question of non vegetarian items. Restaurant has very few waiters to serve you & clean the tables.Compared to the occupancy the restaurant is small. Check in time of 12 noon is also problematic as all the flights usually coming from India come in the morning(Nearly 100% guests were Indians,In our case they had given us temporary room to freshen up but got the final room in the evening only). Again all the flights to India are after ten in the night,you are without room for the whole day.Rooms do not have any view,but the rooms with view costs a lot. Over all the hotel is Ok type. You can not give star rating but Dubai being one of the expensive city,Dolphin is good option to stay.", "Date": "March 15, 2008"}], "HotelInfo": {"Name": "Dolphin Hotel Apartments", "HotelURL": "/ShowUserReviews-g295424-d673812-Reviews-Dolphin_Hotel_Apartments-Dubai.html", "Price": "$60 - $261*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Khalid Bin Waleed Road</span> | <span class=\"extended-address\">PO Box 121678</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "673812", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b7/74/b7745da8a2ca89efde7f8436e6d0ac061large.jpg"}}