{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Ives", "Title": "“What a fantastic place!!”", "Author": "NicolaPrisk", "ReviewID": "UR127879544", "Content": "We arrived back yesterday after a 2 week holiday. We have always been lucky enough to stay in time-share with my parents when visiting Orlando and so was a little apprehensive when my father-in-law booked this resort, but oh my goodness me!!! It was fantastic!! It is as good as some time-shares that I have stayed in. The townhouse that we stayed in was 3 bedroomed with a spacious lounge/dining/kitchen area. It was spotlessly clean, well equipped and just lovely. There is a washer and tumble dryer, wi-fi and even has hair dryers in the bathrooms. The clubhouse was lovely with 3 computers that you could use FOC, a small bar by the perfect pool area which was tended by two really friendly welcoming gentlemen - Adam and Tino. We had an added bonus of visiting raccoons every night, Blue Jays & Red Cardinals in the trees right outside our house and even a couple of ducks came to visit!!! I would recommend this place to stay for not only being a great place but also being really central to all the parks and shopping", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hertfordshire UK", "Title": "“Excellent villa and location.”", "Author": "MrsBKH", "ReviewID": "UR127854649", "Content": "We have just returned from a 2 week stay here. The villa was spacious and clean with lovely big beds. Large bedroom with super kingsize bed and own bathroom downstairs and 2 bedrooms with a super kingsize bed in one & 2 kingsize beds in the other with a seperate shared bathroom upstairs. All with tv's. The complex is fairly small with a lovely pool and small clubhouse with small bar, there are 3 pc's with internet which are free to use. We really liked being about 5-10 mins walk from the 192 with all the restaurants etc. Would definately stay here again.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely Town House”", "Author": "chillout2005", "ReviewID": "UR125234896", "Content": "We arrived quite late, and was not too sure how to get in as it had two gates... maybe it was jsut the Brit in me driving on the Wrong side of the road and all that... We loved the Accom, Was spacious, clean and to a high standard the Staff were very friendly and very informative, its was like a home from home, our Children aged 11 and 16 enjoyed it two.. was walking distance to walmart and all the Resturants and Flea Markets... we Loved it and will be going back again..... very good value for money and had everything we needed even some amazing wildlife.. the Pool was nearly always empty and with a mad day at one of the theme parks it was nice to just come home and relax away from it all...", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worthing, United Kingdom", "Title": "“Home from Home”", "Author": "Vic S", "ReviewID": "UR124855757", "Content": "Just returned from 2 weeks at Lucaya Villas! It couldn't have been more perfect. The house was suitable for the 3 adults and 2 small children. Clean, spacious and the facilities were just what you hoped for (inc a washing machine with a 15 min cycle!) The pool area was clean and inviting. The boys really enjoyed jumping in and out of the water, which was kept maintained to a high standard and the staff were very helpful and friendly. Can't wait to go back next year!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“\"Outstanding\"”", "Author": "Angela P", "ReviewID": "UR123108903", "Content": "We have stayed here twice now and both times it has been outstanding, it is so clean a real home from home. Staff are extremely helpful and with it being gated you feel so secure. The location is great within easy reach of all the attractions. The pool is lush!!! 10/10 next time we go we will go back here for sure.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Excellent”", "Author": "kariluz", "ReviewID": "UR122980961", "Content": "Great place to stay, close to everything. We were please with the place. It was great and it has everything we need. We were a group of 6 adults, 2 children and 2 babies and met all our expectation and more. Easy to get there, close to many places to eat, to buy essential things and close to parks. I would stay there anytime.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Great location and value for money”", "Author": "Charlieandaustinsmum", "ReviewID": "UR122175553", "Content": "We stayed here for 11 nights for a christmas vacation, we booked through a third party site and paid a little under £50 per night. We arrived at Lucaya villiage resort in December and were expecting a pretty average experience and that was what we got. The houses are in a gated development, in a quiet location in Kissimmee, it is about 15 miles from the airport and around 5-10 miles from the major parks. The resort had a pool which looked very nice, but we simply didn't have time to use. The house we were expecting was a 3 bedroomed, 2.5 bath but we were given a 4 bedroomed, 3 bathroom house which was very spacious. The houses are well equipped with microwave, full oven, coffee maker, blender etc but they were slightly light on cooking pots and pans - they had the basics but you wouldn't be cooking a three course meal there even if you wanted to. The licing area had 2 sofas and a table and chairs that sat 6 which made it a little small for a house that sleeps 10. The bedrooms themselves are very nice, good quality beds, linen and lots of spare blankets, sheets and towels. Each bedroom had a TV with a good number of channels so it was good for the kids in the morning, We had two double bedrooms and two twin rooms and there was a sofa sleeper in the living room so plenty big enough for most families. This is a quiet resort with little noise even coming from the busy roads surrounding it and everyone we met was very friendly. The downsides of this resort are that there is no outdoor space for your house, our doors opened right onto the walkway - which is fine if you are using it for a base to visit the parks but is not so good if you have small children you want to let run around or for drying washing (although a drier is provided which is very effective). The upsides are the facilities provided - laundry soap, dishwasher powder and even a welcome basket full of tea, coffee, popcorn, crisps and candy - which was unexpected and very well recevied. I would recommend this resort if you are coming to Orlando with a largeish family and want somewhere safe, clean and comfortable to stay.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond", "Title": "“Very nice stay in Kissimmee”", "Author": "phasmid", "ReviewID": "UR122070150", "Content": "We booked a four bedroom condo at Lacaya Village based on the Trip Advisor reviews and we were not dissappointed. Our condo was quiet (I had concerns when I booked but they were unfounded), clean and very nicely furnished. Everything we needed was supplied including dish washer soap. Having a full kitchen made fixing morning breakfast a breeze. Additionally, the property is gated and a safe is provided in the down stairs bedroom closet. The property is very convienently located to all of the WDW parks, Sea World and Universal. I believe our longest commute was 15 minutes. Publix Grocery, CS, Wal-Mart are close by as are many resturants. There is a pool and hot tub on site but we never had time to use them. Over all we really enjoyed our stay and we would stay at Lucaya Village again.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect!!!”", "Author": "Janeybabydee", "ReviewID": "UR119532729", "Content": "Absolutely amazing place to stay. Our party of 4 stayed in a 3bed 2bath townhouse for 11 nights in mid September. We cannot fault it at all. We all felt at home straightaway and it had everything we needed. We had no problems while there but the staff we did encounter were very helpful. The location was great taking just minutes to get to shops, restaurants and the parks. As we were there at a quiet time, after a morning at the parks we had the pool to ourselves every afternoon. We were devastated to leave and can't wait to go back one day!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“Great place to stay”", "Author": "ManchesterMolly", "ReviewID": "UR119051695", "Content": "Second time we have stayed at lucaya village townhouses are in a great location. Staff are great very friendly lovely pool area. Townhouses are very well equipped we have stayed in 3 bed house very spacious will be returning", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterborough", "Title": "“Excellent Place To Stay”", "Author": "87Karen", "ReviewID": "UR118973144", "Content": "Stayed here for 14 nights there are excellent clean townhouses they are fully equipped with everything you need they even supply washing up liquid,dishwasher powder and washing powder, you also get a Welcome basket which provides you with the essentials until you get to the supermarkets. We had a 3 bedroomed townhouse which had wi-fi and flat screen tv in lounge, tvs in all other bedroom, the beds in the master bedrooms are huge and the third bedrooms contains two double beds. The resort is in a very central location it takes approx 10 mins to get to Disney, Turn left out of the resort and you are minutes away from Lake Buena Vista Outlets and a huge Walmart. Turn right and you are a minute away from the 192 and all the restaurants and shops along there. You can walk to a number of restaurants Ruby Tuesdays, Macaroni Grill there is an excellent Chinese buffet at the top of the road on the 192 again within walking distance. The staff are friendly at the resort the grounds are lovely and the pool area is great with a lovely hot spa, pool area was never crowded while we were there. Although you are only a minute away from the hustle and bustle of the 192 the resort is really quite and peaceful, the resort is gated and you enter by putting in a code at the gate this made me feel really safe and secure. I will defiantly be looking to stay here again next year.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "wiltshire, england", "Title": "“Quiet, Clean and secure”", "Author": "mogre", "ReviewID": "UR118937351", "Content": "Booked this for a week using our American Airlines airmiles. Checked in at centre just off Irlo Bronson highway which was quick and straight forward, with clear instructions for security gate, house door access and directions to Lucaya. Lucaya is a gated community off Polynesian isle boulevard consisiting of a series of blocks of townhouses.It is screened all round from neighbouring roads etc and was very quiet. We had a 3 bedroom unit , main bedroom with ensuite downstairs ,off kitchen /diner/lounge.2 bedrooms upstairs with family bathroom.Kitchen was fully equipped , with washer dryer upstairs.The unit was generally clean. Clubhouse on site has tv, computer access and printing facilities,books/magazines to borrow ,pool/jacuzzi and someone on desk most of the day if you have any issues. As its just off Irlo Bronson highway there were numerous restaurants, Walmart/Publix and entertainment within a short drive(or walk if you were up to it).Also well situated for access to Disney and I4 for Universal. We would come back again. Tip:check in at the clubhouse soon after arriving to get parking permit for car( this was not explained at the initial check in off site)", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stevenage", "Title": "“Recommended”", "Author": "tyrrelltribe", "ReviewID": "UR118522245", "Content": "We stayed in a 3 bed townhouse for 12 nights. The house was spotlessly clean (including steam-cleaned carpets) on arrival and quickly felt like a home from home. There was a strange smell in the large cupboard that stored some ironing and cleaning things that we never managed to identify but it just meant that we couldn't use it for storing shoes or clothing. Storage space was ample though and a fully equipped kitchen with everything we needed, including dishwasher tablets. Other people had commented on the beds being uncomfortable. They were quite creaky, but each one in our unit was used and we all found them very comfortable. We booked with Holiday Genie as a package and think we got a great deal on flights and accommodation. This was our 7th holiday in Orlando and the location was the best we had ever stayed in for nearness and easy driving to attractions, restaurants, shops etc without having to hit the usual bottlenecks where traffic jams occur. However when we were inside the gated property we could've been in the middle of nowhere - it was SO quiet! Polynesian Isles Boulevard is a quiet road just off the 192 with a good range of restaurants at one end and the Lake Buena Vista Factory stores at the other. We never had to travel far to eat. The clubhouse was an added benefit and although the pool area, clubhouse and fitness room were all quite small, they were never busy and very clean and inviting. The air-conditioned clubhouse was a welcome relief when the sun got too hot around the pool! One of the men who sat at the reception desk (Rafael, I think), was extremely helpful and friendly; the other one not at all - quite the opposite. It would have been nice to get the same service from both of them. Overall, I would definitely recommend this property and would consider returning again.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great Location and Very Private”", "Author": "GenevaCast", "ReviewID": "UR118521966", "Content": "I'm really sad that this year we weren't able to book the Lucaya villas! This is one of our favorite places to stay in Orlando for any occasion whether it be business, trip with friends or vacationing with family. Everything is spacious and very clean!!", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location, very nice.”", "Author": "KahlenS", "ReviewID": "UR117736927", "Content": "When we arrived, we walked into a house that had not been cleaned, which is not what you want after a 9 hour flight! We complained and it was dealt with straight away, which was great . We where nervous as people said it was noisy and the pool being dirty but this was not the case, the resort it's self was great the kids loved the pool and it's a great depth for kids. We also encountered a racoon, a black snake and frogs, the resort is so peaceful and a great base as it's not that far from the parks. The staff where great and always willing to help. The home it's self was great as you get your detergents and a little basket of things like tea bags and things like that, which saves you some money and you don't have to rush out and get them. We really enjoyed our time at Lucaya and would recommend this to anyone.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "s.wales", "Title": "“A place to chill.”", "Author": "Squidicca", "ReviewID": "UR117534055", "Content": "Bit worried after reading the review that said Lucaya was noisy, but we shouldn't have been. Lucaya is a gated assortment of linked houses just off the 192 where in 3 minutes you can walk to many different restaurants and gift shops. There is a Walmart store if you turn left out of Lucaya Village, too far to walk in the heat but only 2 mins in the car.The staff were all extemely friendly and the 4 bed house we stayed in was fantastic.Yes some of the furniture had a few marks on them ( pen on the seats of the dining chairs) but I have marks on things in my own house. The carpets and settee are steam cleaned in between each letting and the house has everything you can want and more.When we arrived the house was spotless.The dishwasher, washing machine and tumble dryer were very useful. All detergents for these is supplied.A cleaner comes in every few days to empty bins, make beds etc. Air con worked brilliantly. The complex has a small but relaxing pool especially after being in the parks all day. There are 2 small lakes inhabited by ducks behind the pool where you can hear frogs and crickets chirrupping into the night. We also saw lizards,a racoon, an armadillo and a friendly black snake- so I was told. Lucaya is the perfect place to escape the busy theme parks and we will be definately be returning when we next visit Florida.", "Date": "September 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Wonderful resort”", "Author": "SeamusIreland", "ReviewID": "UR116575486", "Content": "Stayed at Lucaya village again. Same great service, location terrific Stayed in a 3 bed townhone, will definatley be back", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Bucks", "Title": "“So disappointed...we will not return :(”", "Author": "lissybubs", "ReviewID": "UR116261948", "Content": "When I 1st booked at the start of the year, this resort was No.1 on Trip Advisor for accommodation in the Kissimmee area. Since then, it has slipped to No.10 and now I think I know the reasons why. The standard of accommodation is not up to standard at all and it's a very noisy/party type place. Before I start, I didn't realise that the resort units are split up and owned by different Management Companies therefore not all units may not be the standard that we experienced. So, we checked into our 3 bed unit to find the carpets were so disgustingly filthy - everywhere. So of course, you go looking for other dirty things too and there were many stains on the sofas, curtains, towels, bedding etc. \"We are not staying here kids!\" So after a complaint, another villa was found for us with even bigger stains and the whole unit was so dark you would need all the lights on all day. Very depressing. So, more complaining and we were upgraded to a 4 bed unit. Much better (all carpets and furniture had just been steamed cleaned) and much brighter. But I have to say that everything was of a very low standard (pillows, bedding, cushions, towels etc) had all seen much better days. But keen to finally start our holiday we just tried to make the best of it. That was until night time came. OMG! It was like staying in a teenager party palace. Screaming, shouting, swearing, very loud music, fighting - all of which went on till way past 4am and right outside our window. I can't tell you how depressed we all were only managing about 2 hours sleep. So, after yet another complaint we decided that we just couldn't stay there any longer. To be fair to Holiday Villas they had done everything that they possibly could to help us but we just had run out of options and the best solution was to check out and find somewhere else. A real shame for everyone.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Scotland, UK", "Title": "“Great stay at Lucaya!”", "Author": "James2007", "ReviewID": "UR116118026", "Content": "We arrived on Fri 15/7/11 during a horrendous thunderstorm. Picked keys up without any problem at Hotel Beds along the 192 highway. Arrived at Lucaya Village and found our unit quite easlity. Great central location for Disney and all other parks, Walmart, restaurants on the 192 highway. I4 to Tampa just along the road. Pool was never busy but nothing special - if you want a clean place to go then head for a water park. Our 4 bed townhome had everything we needed and was spacious. Management Company based at Clubhouse friendly and efficient. Lovely and quiet and felt secure in this gated community. If anything negative to report then maybe just the standard of cleaning prior to our arrival however, overall this rental was great value for the money we paid. Top tip - get to Harry Potter early in morning or wait until evening, as this was just too busy during the daytime with no ability to enjoy this part of the park.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Puerto Rico", "Title": "“The perfect place”", "Author": "rlpagan333", "ReviewID": "UR115999939", "Content": "The village was comfortable, pretty and spacious.Very good location and accessible We got a very good experience and definitively we´ll come back. Very clean, includes eveyrthing you need to feel like home.", "Date": "July 29, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Convenient but not Luxurious”", "Author": "lunchbox_hero", "ReviewID": "UR115301156", "Content": "I usually book hotels inside the theme parks to avoid the hassle of driving, but this time we were traveling with a bigger group and on a budget. I decided to book this 3 bedroom 2 story townhouse at Lucaya. I have to say the place is super convenient and close to restaurants (Perkins, Uno, Chilis), drugstore, and even Walmart. You're also about 2 miles from Disney. Upon arriving the place was well kept in a gated community. The apartment was nice, well furnished, with free wifi. However, the beds were really stiff and uncomfortable. I also didn't like the carpet on the first floor, half of the time I was worried about someone spilling sodas on the beige carpet. I would stay there again if I'm on a budget again ;)", "Date": "July 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tinley Park, Illinois", "Title": "“Decent location, mediocre property”", "Author": "cdsmom", "ReviewID": "UR107183611", "Content": "I honestly don't understand all the excellent reviews on this property. I agree that the location is very convienient to the Disney parks. Also the units are large and very quiet. The rooms, however, did not seem to be cleaned professionally. The carpets were stained and there was hair in the shower upon our check in. The carpets and couchs were very worn and appeared to be in need of replacing. The pool area is small but not crowded. I didn't have a terrible stay,but can't say that the place is anything but mediocre at the very best.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Braintree, United Kingdom", "Title": "“Lucaya - Fantastic place to stay!”", "Author": "Iloveflorida2011", "ReviewID": "UR106812687", "Content": "Have just returned from 3 weeks at Lucaya Village Resort. We had a fantastic time and will definitely stay there again. Lucaya is a gated development, a few minutes walk from a selection of restaurants including Macaroni Grill, few mins drive to Walmart, 5 mins drive to Lake Buena Vista Factory Outlet Stores. Quite a small development with a clubhouse with free tea/coffee, computers/printer, books to borrow & small gym. Reception very helpful and friendly (can also book tickets for you). There's a pool & spa pool, 2 ponds to walk round, childrens climbing frame. Pool isn't that big but didn't get crowded so not a problem. Fairly quiet & peaceful with tiny geckos running around everywhere. Townhouses are very spacious and clean and come equipped with everything you need including free WiFi, dishwasher, washer/drier, hairdriers, ironing board/iron, safe (you set your own combination). Also provide dishwasher tablets, washing powder, toilet rolls, tissues, kitchen roll, bin liners, etc (which we've had to buy ourselves at other places). We stayed in a 4 bed/3 bath house, tv in each bedroom & in lounge. Downstairs has open plan kitchen/diner/lounge and master bedroom with ensuite. Upstairs there's another large double room with ensuite, 2 twin bed rooms & family bathroom with huge shower. Washer/drier is upstairs in cupboard. Both double rooms have large walk in wardrobes so plenty of storage. Definitely the best place we've stayed in Kissimmee - can't wait to return.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Israel, Solomon Islands", "Title": "“NOT RECOMMENDED”", "Author": "DOR123", "ReviewID": "UR106143475", "Content": "We have been there for 12 nights april 2011. With 2 child and A Baby. The place look nice from the outside. Inside the AIR-CONDITIONING IS VERY VERY WEAK!!!! So The Home Is HOT ALL DAY AND NIGHT. We Ask About 6 Times To Send Some One To Fix It, AND NOTING. We Paid 85$ A Day and Ww Could get A suitein DISNEY HOTEL for 89$ Through AAA Including breakfast. Also They THREAT You That if the AIR-CONDITION unit will freeze you will have to PAY FOR THE TECHNICIAN. So the AIR-CONDITION UNIT is not good and you will pay to fix it??? It Dosn\"t make a difference if it's clean and good location if you can\"t sleep at night after a long day . NEXT TIME THIS WILL NOT BE THE PLACE FOR US.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“A Nice Gated Condo Complex----Not A Resort.”", "Author": "jameyod", "ReviewID": "UR101295828", "Content": "After flying in from Denver with my 9 year old son and picking my rental car, we picked up our key in Kissimmee from HotelBeds.com and drove down the highway 2 miles to Lucaya. When we got there, the temp inside was 82 and the A/C wasn't working. I got the clubhouse attendant named Pedro to come down and check it out, and when he opened the circuit box outside, sparks jumped at him and hit him the eye, burning off his eyelashes. Needless to say, things weren't starting well. We tried then to get him to change our unit, but his hands were tied, so we tried calling HotelBeds.com and said they couldn't do anything but try to reach the management company....so involved in this thing was the Lucaya property attendant, HotelBeds.com, Gemstone (Property Management Company), and the owners themselves---whoever they were. With no luck reaching the management company, we were later told that an A/C guy would be there in half an hour and to be at the unit when he got there. An hour and a half later, there was still no one that had arrived. After travelling back and forth and fit to be tied, a guy finally showed up at 10:30 that night and fixed the problem and we have been loving the cool life in our condo ever since. This place was advertised as a resort and it is definitely NOT, but instead a gated condo complex with a very modest pool and clubhouse. The saving grace in this whole experience so far has been Pedro...what an outstanding gentleman that knows how to treat people! He was very emphathetic to our situation and really made it easier for me to hang on until the problem was solved. Unfortunately, it is not enough to make me want to come back here. Last year at this time, we stayed at Wyndham Bonnet Creek and that place was a resort. They will probably get our business again next year! One more thing...I could not get the wireless to work in our unit and there was no ethernet connection.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockport", "Title": "“A Return Visit”", "Author": "Sandraw7", "ReviewID": "UR99386062", "Content": "Back again for the Disney Marathon/Goofy Challenge and the village gets better and better. Its also great at night to be able to walk for less than 2 minutes and have a choice of 4 or 5 excellent eateries, and have a few drinks and not have to worry about driving. The staff were fantastic and the townhouses are immaculate. Fantastic for everyone whatever your age.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newry", "Title": "“still at its brillant best”", "Author": "gerry47", "ReviewID": "UR91698323", "Content": "Back again over christmas and the village gets better and better. For the golfers out there the village now has links and preferred rates with 5 excellent golf courses all within 7 minutes drive of the front door. Its also great at night to be able to walk for less than 2 minutes and have a choice of 4 or 5 excellent eateries, and have a few drinks and not have to worry about driving. The staff were fantastic and the townhouses are immaculate.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Nelson, Canada", "Title": "“Lacking teaspoons”", "Author": "riotambopata", "ReviewID": "UR89214926", "Content": "If the biggest 'complaint' I have is that there were no teaspoons, hopefully you will see how far I have had to dig to find a negative. IOW, I struggled. And I think we managed to get by without teaspoons, really. Smooth check in, easy to find our room. First impressions: superb. Modern, spacious apartment, with nice fluffy carpets which the kids were quite awed by (as we don't have them at home). Open plan layout really suited us as we could keep an eye on the youngsters. Everything worked, and we were able to make a good meal for the children in the kitchen. The location is quiet, and it is even possible to take a walk around the small landscaped pools in the grounds (I saw a venomous cottonmouth here: very pleased to see that the Florida wildlife struggles on through the urban concrete-scape). The place has an excellent location, right by the strip which leads to Disney. Nice pool too. All in all, we loved this place, and could have stayed longer. If you can, we also recommend doing what we did, and visiting in late November, when virtually no-one else was there.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Better than before - worth a repeat visit!”", "Author": "UkBobsgirl", "ReviewID": "UR85103381", "Content": "My husband and I stayed here before, but this time it was even better. October is quiet, but the weather was great so we really enjoyed Lucaya and using the hot tub. We were suprised to find it is under new managment, but we were treated so well you would not know any change was going on. Some owners were there, and even stopped to say hello and ask us how we liked staying at Lucaya. We were happy to say we have been repeat customers, and look forward to coming again next year, bringing more of our family with us. The 3 bedroom condo was a bargain, so we would have plenty of room to bring the grandkids and kids. It would cost us the same price for each hotel room as this place charges for 3 bedrooms in one. How can they do this so inexpensively? The kitchen was fully equipped, but we really only used it for breakfast and to make sandwiches for later in the day. That really helps out on stretching our vacation money - have you seen the price of food in the parks? We were interested in using the grill under the big oak tree, but someone else already had it going. I hope they get more grills! We will definitely be back.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Perfect resort in Kissimmee with everything you need!”", "Author": "rawaspecial", "ReviewID": "UR81931962", "Content": "After researching a lot re accomodation in Orlando I found Lucaya Village. I was a bit apprehensive at first staying in Kissimmee other than Orlando - but it is absolutely no problem! Our stay at Lucaya Village did not disappoint us! Lots of food, supermarkets & shopping closeby and the resort is gated! We arrived a little early and our accomodation was not ready after having checked in, so we had to wait a bit which was not a problem. They have a big clubhouse where you check-in and in there you also find a fitness center (did not use it) and business center with lots of brand new computers and printers which you can use free of charge! Have never seen anything like it! When we entered our townhome it smelled a bit strange (from the cleaning, but that was gone after leaving the door open a while) and we noticed the carpets in the complete house were still wet. So this probably meant the house was really cleaned top to bottom and yes, it was spotlessly clean! Also, I have to add: the complete resort area was exceptionally clean! The townhome was huge: from the front door you come straight into a living room with couch & TV, dining room, kitchen. On this floor you also have a master bedroom with king bed, huge bathroom with tub and a safe. Upstairs we had another bedroom with a king bed as well as a bedroom with two beds and a separate bathroom. In the bathroom upstairs there is also a washing machine (was amazed to even find washing powder!) and a dryer which comes in very handy! The place is huge! We used the kitchen a lot and it had everything, even coffee filters, salt & pepper shakers as well as dishwasher tablets! We did not have time to use the pool but it looked very nice and it was never crowded during the time we were there. Actually the whole resort was never crowded although you saw a lot of parked cars at night. We also loved the beautiful walkways throughout the resorts which were decorated with lots of different plants - our own private jungle which also came with lots of cute geckos everywhere! All in all we had a great time and would come back again! Thank you again Rick King from Royalty Vacation Homes for making our stay at the Lucaya Village so enjoyable!", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "N. Ireland", "Title": "“Very happy with return visit”", "Author": "templecorran", "ReviewID": "UR74376704", "Content": "I'm back at Lucaya Village. I really love this place. The beds are just as comfortable as my water bed at home. This is a self catering resort so we particularly like being able to walk to Longhorn, Ruby Tuesday, Krispy-Kream and CVS Pharmacy; and Walmart is only 1 mile away. This gives us the freedom to dine in or out. Another plus I didn't notice before is that the pool has been changed to a salt pool. No nasty chlorine chemicals in the water. Security gates have been installed since we were last here, that makes us feel safe.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, Minnesota", "Title": "“Lovely place near Disney”", "Author": "OtterCrossing", "ReviewID": "UR71882640", "Content": "Really wonderful experience. Lovely,large and impeccably clean resort rental. Convenient with lots of extras and so roomy. Especially nice was well appointed kitchen and very fine large baths. Pretty pool with easy access and very hand little computer center. Perfectly wonderful desk staff were helpful throughout. So easy to Disney parks from here. Pristine grounds and nice gated security. For a family with small children was super.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston area", "Title": "“Affordable multi-bedroom townhome”", "Author": "px64", "ReviewID": "UR64849979", "Content": "If you like to stay somewhere where you can really spread out at a great price, this place is for you! I had already reserved a room at the doubletree in Orlando when TripAdvisor sent me an email saying that it appeared that I was going to be visiting Kissimmee and then listed the top reviewed hotels in Kissimmee. I had done research but was looking in Orlando, not Kissimmee. When I checked out the reviews for this place, I quickly looked for availability. They had a 2-bedroom on their website for even less than the travel sites listed, and it was awesome! It was out quiet oasis of peace while we were on vacation. With palm trees swaying out front of our door, and a quiet walkway leading to our room, I felt relaxed every day as I approached our condo. We had our own bedroom and bath, and the kids had their own bedroom and bath. We had a full washer and dryer and full kitchen with granite countertops. They even provided coffee filters for the coffee. We found the wal-mart close by and made frequent visits to pick up supplies. FL allows the sale of wine and beer at walmart, so that made it easy to stock the fridge in the room. The pool is pretty straightforward with a mushroom fountain and a hottub, but it was pretty empty and thus relaxing while we were there. We had a good game of marco-polo in the pool without fear of running into anyone else. I used the computer center to print out some directions and the free wifi in the room was nice. Parking was free, which is saying something considering how much some of the other hotels in the area were charging to park your car. Pros: * the price * separate bedrooms and showers * peace and quiet Cons: * The pool is not a waterpark * You can't walk to Disneyworld from your room", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“This is the best deal ever...”", "Author": "Mimi247", "ReviewID": "UR63739916", "Content": "Our family (Mom and Dad, six year old and two year old, Grandma and Grandpa) stayed at Lucaya Village for four nights while we visited Disney. The accomodations were immaculate, there is plenty of space. We loved that Mom and Dad were upstairs with the kids with their own bathroom (and the washer and dryer). Grandparents stayed downstairs with private bath. Plenty of room for breakfast for all. The pool is just what we needed at the end of the day as the weather was unseasonably hot (97 degrees in May!) and humid. Plenty of towels and linens. Just about ten minutes to Disney property. We liked that the resort is small, it was very comfortable for us. We're already planning next year's trip and wouldn't think of staying anywhere else.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, VA", "Title": "“Super in every way”", "Author": "ToLoseLaTrek", "ReviewID": "UR61783558", "Content": "This is a gem of a place near Disney World. The accommodations proved to be super and the staff remarkably professional, helpful and friendly. We spent 5 nights after visiting with relative on the west coast of Florida, then drove here. Friends recommended this place after they stayed here last year. I have stayed in a lot of resort condo type places and found them generally lacking in many departments. First of all the location we found great for the Disney parks. The property is off the main road and therefore quiet and pleasant. But there was a route into Disney that seemed to get us there in an instant. We had a 4 bedroom townhouse type place with 2 levels. The place was huge and so well appointed. The cleanliness was incredible and the overall grounds and such just beautifully maintained and clean. Particularly nice bathrooms, closets and kitchen. The pool is very attractive and really nicely kept like all else. A main building offers a guest computer room with desktop units and really good Internet that kids found very appealing. Outdoor areas are very enjoyable with a small parklike area with benches and a couple small ponds with large trees and palms. The overall size of the site is fairly small but so pleasant and easy to get around. There is a gate system at the entry for extra security but was quick getting in and out. Extra security was appreciated. We had a couple of minor issues and a maintenance guy appeared like lightning. One morning my laptop was giving me trouble that I was not sure was my unit or signal related. I called the desk and a computer technician was at my door within 5 minutes. Problem solved. Desk clerks and concierge help was just outstanding. The people here are doing a super job and I highly recoomend this for anyone looking for this style of place.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "monaghan", "Title": "“Perfect location”", "Author": "nialor", "ReviewID": "UR60273561", "Content": "Top class accomadation in a great location,close to good restruants and shops. Walmart only 1 min drive,Longhorns 2 min walk,TGI Fridays 5 min walk.Property was absaloutly spotless and had everything you would need.Gated community with a great pool and 24 hr security.Booked property 437060 directly from owner,Gerry,who was nothing but decent and honest about everything. Will be recommending this one to all our friends.Once again,thanks for everything Gerry.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "MA", "Title": "“This place is a gem”", "Author": "famroadtrip", "ReviewID": "UR58177378", "Content": "First off, we booked here thanks to the great reviews on TripAdvisor and we were not disappointed. We rented a 4-BR condo which was impeccably clean, comfortable and spacious with every convenience we could ask for --very easy to make yourself at home. The service was great and the staff was very friendly. Wi-fi was fast (compared to some other big name resorts), multiple flat screen TVs were very convenient, the business center was great for printing boarding passes. They even had a high chair we checked out for our youngest child. We also enjoyed the zero-entry heated pool in spite of relatively cool weather. A 24-hr WalMart supercenter down the road was a simple 1-shop stop for food, supplies, etc. Any downsides? Hard to think of any, but if pushed I'd say (1) Kissimmee is not Orlando, but it is minutes to most theme parks and the entire resort is gated for privacy and (2) those looking for a resort with a theme park atmosphere, restaurants, activities, etc may want to look elsewhere. Overall, this is a great place to stay for families who appreciate quality, cleanliness and service.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huntsville, AL", "Title": "“Beautiful, relaxing, affordable condo”", "Author": "jchapin1", "ReviewID": "UR56169586", "Content": "In January my husband and I stayed at Lucaya Village for our Disney vacation. It was wonderful. It was a 3 bedroom condo that was clean, very pretty and cheaper than staying at a Disney resort for a week. It came with a fully stocked kitchen (which we took advantage of). That really helped us save since we didn't have to eat out all the time. It was only 10 minutes away from the Magic Kingdom, which was fantastic. Our whole vacation was fabulous and I would reccomend this place to anyone.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "newry", "Title": "“An excellent clean place to relax and enjoy yourself”", "Author": "gerry47", "ReviewID": "UR52946283", "Content": "Stayed there over Xmas and found the villas to be first class and spotlessly clean. Great to have a Walmart 1 minutes drive away and fantastic to be able to walk to the restaurants at the end of the boulevard. It was great to be near the golf courses and the travel to and from celebration and falcons fire was simplicity. Lucky also to have Lake Buena Vista shopping complex within 2 minutes drive and then when you return the clubhouse and pool were excellent. The Jacuzzi is a nice bonus as is the fitness room and IT giving you 4 access points to surf the net or to play games.Agreat place to switch of and relax and will definitely go back", "Date": "January 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Don't stay anywhere else in Kissimmee!”", "Author": "mm&ost", "ReviewID": "UR52865109", "Content": "The houses in Lucaya Village are just gorgeous! Loads of space and every amenity you could wish for. They are in excellent, clean condition, superbly equipped and a real home from home. The location is absolutely ideal for all the parks and shopping malls, yet it is a peaceful haven of tranquility after a busy day out. The clubhouse includes a lovely pool, jacuzzi, gym and free internet suite. Fabulous! If you are travelling with a group of friends, or a family, you will not find better value than this in Kissimmee. Next time I will go for the great selection of golf courses right on the doorstep! Lucaya Village is a hidden gem and not to be missed!", "Date": "January 7, 2010"}], "HotelInfo": {"Name": "Lucaya Village Resort", "HotelURL": "/ShowUserReviews-g34352-d681210-Reviews-Lucaya_Village_Resort-Kissimmee_Florida.html", "Price": "$125 - $235*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2941 Lucayan Harbour Circle</span>, <span class=\"extended-address\">Polynesian Boulevard off Highway 192</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34746</span></span> </span></span></address>", "HotelID": "681210", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d7/57/d757af0e8dd0bf66d0c1e59c203112d71large.jpg"}}