{"Reviews": [{"Content": "Quite fancy for low price, good location Our friend who lives in Tokyo found this hotel for us, 3 nights for $400Cdn, pretty good for urban Tokyo on top of a metro station. Was very very clean and nice and wonderful. Included breakfast - both Western and Asian foods on buffet. Recommended!", "Date": "Sep 2, 2008", "ReviewID": "UR530743865", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Hanoisy"}, {"Content": "Great hotel and excellent location Loved this hotel as it was in a great location which is right next to the train section. This was extremely useful as the Tokyo train station at first is a nightmare to figure out. In addition, it is right close to the ANA hotel which means you can take the limousine shuttle bus to ANA and then walk 5 minutes to the hotel. The location is excellent which is Roppongi which is has a great nightlife after you have traveled in all of the other neighborhoods in Tokyo. Some of the plus and negative of this hotel:Plus:1. Amazing location that is right next to the train/subway station. You cannot go wrong with this as after a full day of walking around it is pretty sweet to be able to step off the train station and be right in front of your hotel.2. Great customer service.3. Free broadband access in your room. 4. Fairly reasonable in relation to other Tokyo HotelsCons:1. Small rooms but to be expected in Tokyo2. No room service.Overall I would highly recommend this hotel for the 1st time traveler to Tokyo.", "Date": "Feb 8, 2008", "ReviewID": "UR322505532", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "christiancadeo"}, {"Content": "Comfortable, convenient, well priced Location and Access: This hotel is located in Ark Hills, a new complex of office buildings, hotels, restaurants, and shops. The hotel is an easy ten minute walk from the gaijin infused night life of Roppongi and the more cerebral delights of seminars at the International House of Japan. It is a five minute walk from a new museum atop a neighboring skyscraper. Access: Directly accessible from the Roppongi Ichome Station on the Namboku Subway Line. One block south of the ANA Intercontinental Hotel with airport limo bus service direct from Narita. Room: By Tokyo standards for hotels in this price range, the room was spacious with a comfortable full sized bed. The room was meticulously clean, with the usual amenities (green tea and plum tea with hot pot, toiletries, tub, bidet). The windows opened for fresh air. The hotel offered free internet access in rooms, with ethernet cables provided at the front desk. Hint for English speakers: the TV remote control has a bilingual button to secure the English track of CNN. Drawback: My top floor room had a view of a massive building 20 feet away. I suspect that the views from other rooms may have been similar. Services: The front desk handled messages and faxes with efficiency and good cheer. They went the extra mile, posting a note on my room door to inform me of an important urgent fax. Food: A western style breakfast buffet was provided in the lobby of the hotel. Omelet, vienna sausage, orange juice, rolls, cereal, yogurt . . . and a minced cabbage salad with Japanese rice vinegar / sesame / soy sauce dressing. My own tastes would have been better served by a traditional Japanese breakfast, but it was nice to start the day with a full belly. No restaurant on premises. Public Spaces: The lobby was spacious and reasonably well appointed. Nice enough to meet up with visitors. Not quite comfortable enough to hold long discussions. Bottom Line: I have stayed at many hotels in Tokyo, from the upscale to the modest. The Villa Hotel Roppongi provided good value for the money. A decent room, convenient location, and good service for non-Japanese speaking visitors, all at a reasonable price.", "Date": "Jan 25, 2008", "ReviewID": "UR541727718", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "aversetospam"}, {"Content": "Upscale, but Low Price Stayed one night in an upscale-appointed 'single' room with queen-size bed and spacious bathroom in this rather posh very modern large Western-style hotel in Roppongi for about $100...Located in a huge multiplex of offices , lovely restaurants, cafes, shops, and conference center, there is a large subway station downstairs...and the buffet breakfast is included! Staff speak English.", "Date": "Oct 2, 2007", "ReviewID": "UR834740176", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "lolow"}, {"Content": "Tr猫s d茅cevant   showReview(21215951, 'full');", "Date": "Oct 26, 2008", "ReviewID": "UR260130631", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "jeanpms"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066451-d729701-r19666917-Hotel_Villa_Fontaine_Roppongi-Minato_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "729701", "Price": "Unkonwn"}}