{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, Ile-de-France, France", "Title": "“Great place”", "Author": "Byron G", "ReviewID": "UR125619061", "Content": "Great place to stay while on visit to Istanbul. Perfect service, professiona and kind and incredibely informative. Perfect location, walking distance from most available sites. In the heart of it all! I was exspecially happy about the fact that requested outside takeaway ordering was available for just inside my hotel room when needed. And the minibar was excellent in its mulitple choices at offer as well as the walk out balcony was a plus for any attraction worth viewing from my street overlooking room.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“It was just Awesome !!!!”", "Author": "Khringo", "ReviewID": "UR122363872", "Content": "It was my first trip to Istanbul. And i was realy suprised by the beauty of the city and also the country. i came here with 3 friends and we were welcomed by the team \"CEHANE\", \"Luqman\" and \"Nedim\". They are very helpful and nice. the rooms are well arranged and clean. The hotel is clean and the breakfast on the terrace is very delicious, prepared by the way by LUQMAN's Wife. The hotel is located in the center of Sultanahmet, 2 minutes far from the Blue Mosque and Aya Sofia and 5 minutes from Topkapi Palace. Basically, I had a dream week and I'm very satisfied and enjoyed by my reservation.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Huelva, Spain", "Title": "“Nice Hotel, very friendly receptionists”", "Author": "FAYSAL A", "ReviewID": "UR122277177", "Content": "we stayed one week, nice experience, the receptionists helped us a lot especially Ceyhan, Luqman and Nedim. Very good Breakfest the hotel is located only two minutes from the Blue Mosque and Hagia Sophia in the Sultanahmet district", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Karachi, Pakistan", "Title": "“wow amzing i m very enjoy in istanbul”", "Author": "mehwish l", "ReviewID": "UR121880788", "Content": "hotel apex i very enjoy apex hotel staff is very good service Excellent. Ä°n morning roof was so nice with sea veiw and blue mouqse evry think was great and aur room was so perty ,, if i come again in istanbul i will stay in apex hotel............,", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bergen, Norway", "Title": "“Great Location, excellent staff”", "Author": "killemom", "ReviewID": "UR120505114", "Content": "I stayed a few days in this hotel in October. It was a very pleasant stay, everything was perfect. Its a very small and cosy hotel, and since the weather was really bad in Istanbul during my stay, I spend some time at the hotel. I was participating at a friends wedding, so I had plenty of time on my own. The boys in the reception and the ladies who cleaned was so nice, helpful and friendly. The cleaning lady( I am so sorry I never asked her name) even came with food to my room as a nice surprise! Tea was free, and I got refilling on teabags many times The location is also perfect. Just 5 minutes walk from Aya Sofia and the blue mosque and many good restaurants just around the corner. Breakfast was served on a nice roof terrace overlooking the Marmara sea. The beds was not to hard, just perfect. Internet and heating worked, it was clean and spotless. Thanks for a very nice stay in rainy Istanbul :-)", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fethiye, Turkey", "Title": "“professional staff, clean hotel in excellent location”", "Author": "Lorraine B", "ReviewID": "UR119031089", "Content": "Excellent service from reception staff, who telephoned me when our coach was running 3 hours late, aid not to worry that the rooms were ready and waiting. Arrived at 3.30am, exhausted to be greeted by lovely staff member who checked us in quickly provided us with basic information i.e. map and breakfast times and showed us to our clean rooms. Wonderful location, nice roof terrace for breakfast with good choice of cheese / olives / cereals (what more do you need?) and plentyful hot coffee.", "Date": "October 7, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“True valued for money hotel”", "Author": "Minaseyahi2011", "ReviewID": "UR118259363", "Content": "Just ignore all bad comments, if you come to travel around Istanbul and not expect to stay in hotel much....this hotel is a must choice!!!! Room is fine, some problem with AC but still a good sleep. Breakfast also fine....but the most impressive thing is Staff which really generous and helpful.... Stay this hotel if you are real traveller!!!!!!!", "Date": "September 18, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "2"}, "AuthorLocation": "New York", "Title": "“Find somewhere else”", "Author": "freecycle3", "ReviewID": "UR117508030", "Content": "Before booking this hotel through expedia, I read some of the reviews here on trip advisor. I ignored the people who had had bad experiences with this hotel, assuming it wouldn't happen to me. Unfortunately, it did: I paid for a room at the Apex but was placed further down the hill at their affiliate, Sultan's Eyes. My single room was very small, had bad hot water, and had the constant company of ants (first discovered crawling out of my computer (!), which I had left in my locked suitcase on the floor (no opened food in it)), then making their way up my legs as I sat on the bed. Don't believe the hype--find another place, there are plenty nearby.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Bucharest, Romania", "Title": "“not a place go back to”", "Author": "JohnSibi", "ReviewID": "UR115586841", "Content": "Reading the previous review it seams that what happened to us is a practice. We booked a room at Villa Pasha, a 4 star hotel and finally ended up in Apex Hotel because Villa Pasha done overbooking. after arguing with the manager from Apex that we paid for something differed he promised that if next days will be available rooms at Villa Pasha he will let us know. He didn't return to us next day and just avoid us.The furniture in our room was very outdated and actually the room is all beds. The bathroom is in very poor conditions and for closing the door at the room you need some exercise. The only plus is the staff at the reception that was very friendly and helpful, good English and nice attitude.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“great choice”", "Author": "peter_sindar", "ReviewID": "UR114673088", "Content": "The hotel is located at a quite street very close to agia sofia and the blue mosque. The employees at the reception were exceptionally polite and they could speak english rather fluently. The manager of the hotel was also very helpful when we asked him to make a reservation change. The room was cosy and was being cleaned every morning. The breakfast is served on a balcony on the top floor with great view. I would suggest this hotel with no second thought!", "Date": "June 23, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York City, New York", "Title": "“Beware!! Bait and Switch”", "Author": "krashtest", "ReviewID": "UR112441563", "Content": "So you know how you sometimes you read that lone trip advisor review that's horrible and you're like \"that sucks, but what are the chances that will happen to me?\" Well, apparently they are pretty good!! Another reviewer wrote about a bait and switch about 1 month ago, and I read it, and still booked because of all the other positive reviews. However, when I arrived to check in, the couple ahead of me was having trouble. They had booked at APEX, but there was no room for them, so they would have to stay 100 meters away at the \"sister\" hotel. Off they went. So now I go to check in, same situation!! how many rooms are they going to overbook? and I was staying more than one night! So i'm laid back, I go with the flow, go to check out this other hotel. It's called the Moonlight, and it's not the same quality. As the other reviewer said, that hotel is ranked about 100 below this one. The rooms they showed me were 2 star hotel rooms. Don't get me wrong, I'll stay in a 1 star hotel if I want, but I will pay one star prices for it. And the service at Moonlight was very good, they were friendly and helpful. The room was basic, clean, etc. The low rating I am giving here is not for the Moonlight hotel, it's for the trickery of the Apex hotel. Now, does the Apex deserve a better rating than just that one lonely bubble thing i gave them? who knows, cuz I didn't get to stay there!", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "southern california", "Title": "“Stingy management”", "Author": "gonebutnotdeparted", "ReviewID": "UR111166318", "Content": "Good: Location is good being very near many of the most desirable attractions and the price is lower than some surrounding hotels. Bad: stingy beyond belief. It became a joke between my wife and me saying: \"sure we have \"x\" ....- but you can't use it!\". There are fan/AC units but they removed the remotes because \"it is not hot enough for ac yet\". There are shower jet panels but the valve handles have been removed. There is a glass cabinet proudly displaying the yogurt, milk, etc that you would like to enjoy for breakfast at the rooftop but it is locked. The server hardly ever gets around to setting these things out and if you ask you can be sure to never have them. Maintenance was lacking also. The shower hose and nozzle were broken so that you could not secure it anywhere and the curtains would not cover the window because of missing hangers or whatever. Overall I got the impression that they would not and have not spent a dime on this place for years. There were other significant problems including losing my reservation but I only have so much time. Also annoying and indicative of level of class here: the manager was outside in the street from 1 to 2 am pacing up and down and talking loudly on his cell phone and disturbing his guests. I would never go back to this place, ever. There are far superior places just across the street", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“What a Sweet Hotel”", "Author": "Holly1000-11", "ReviewID": "UR106865889", "Content": "Friendly & helpful staff. Comfy bed. Quiet street at night, yet centrally located. Great value for the price.", "Date": "May 4, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Bait and switch? No, more like Sell and then switch”", "Author": "LondonGenie", "ReviewID": "UR106404465", "Content": "I feel aggrieved at what this hotel just did to us. We went to Istanbul for the Easter weekend and when we arrived with our printed out direct confirmation from the hotel itself were told that there was no room for us. What are people meant to do in such circumstances, wonder off and try and find another place on a rack-rate at 5pm? We were told that we would be put up at an associated hotel 100 metres away, and upgraded from a standard double to a suite. But the place we ended up is ranked something like 150th in Istanbul, versus 50th for the Apex. Plus we had the rigmarole of re-checking in with reception who could not seem to grasp that we were referred at our booked rate and not simply walk-in customers on the rack-rate. Then the 'suite' well it was their best room, but it wasn't a suite rather a small bedroom with a bathroom, and that at euro120 odd a night. Bait and Switch is at best fraudulent in many jurisdictions. Here we turned up confirmed at the Apex, but with no realistic choice but to accept something graded much lower. I'd suggest the Apex stop doing this immediately, and if they are that concerned about no-shows then take the first day of the room cost as a deposit.", "Date": "May 1, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bellflower, California", "Title": "“Best Location, Friendly Staff, Great Price”", "Author": "yalil", "ReviewID": "UR106312225", "Content": "I stayed at the apex 4 nights at my 4th visit to the most beautiful city in the world. We were 2 women traveling, we never felt unsafe at the hotel, Lockman, Yacob and Yassin took care of us and helped us. Our room was perfect, the location was great and the price was very affordable. I will go back to the apex next year during my 5th visit to Istanbul. I loved the hotel and the staff.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Lovely staff, perfect location”", "Author": "kate_dreamer", "ReviewID": "UR102215518", "Content": "I spent 2 nights in this hotel and I was extremely happy and satisfied with everything. Service is excellent, everybody is willing to do the extra mile to make your stay comfortable. They are really like a family and the hotel is like staying at home - with a lovely balcony used for breakfast. Breakfast is really good, good variety and the view is second to none. Perfect beginning of your day! My room was spacious, clean, comfortable, quite with all the necessary amenities. Great tea selection! Location is perfect, few minutes walking distance from the most popular hisotrical buildings in Sultanhamet, from the seaside, etc. I will be back to Istanbul and I would not stay anywhere else. Thank you, all of you, who looked after me during my stay.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Danville, California", "Title": "“Great recommendation from Trip Advisor”", "Author": "uskuhlmans", "ReviewID": "UR99572929", "Content": "As usual, I used the recommendations of others to choose the APEX. I was not disappointed. As many have noted, the location was superb--a short walk to almost everything and with a fine assortment of shops and restaurants nearby. The neighborhood is full of small hotels and suspect that many of them would be fine choices. The internet worked flawlessly and the are was amazingly quite. Though it was very cold, the window was open all the time and the room was comfortable. Even with the widow open, there was little noise--with the exception of the 0530 call to prayer! The staff was friendly and accommodating and the breakfast was adequate--though the rooftop terrace was a real treat as the views were lovely. All in all, excellent value for money and a treat all around.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“nice hotel in old city”", "Author": "dengregor", "ReviewID": "UR99021011", "Content": "We found the hotel by a online agent. it is in the old city of Istanbul with nice rooms. The staff is also friendly and welcoming. Especially very handy to tram station. good value for vacation.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Great hotel in fantastic location”", "Author": "Aussie_hoppy", "ReviewID": "UR94706635", "Content": "I have been remiss for not writing this review sooner. My mother 75yrs and myself stayed at this hotel for two nights before we headed to the shipping docks to board a cruise liner. Our experience of this hotel was 1. very close to the tram statÄ±on. 2. very close to tourist attractions like the Blue Mosque and Cistern. 3. Our room was nÄ±ce and clean. Although we were there in the winter we still had our breakfast outside on the upstairs deck, by the way breakfast was delÄ±cÄ±ous. 4. The staff were great from my online booking with numerous emails through to carrying our bags to and from our rooms. I also received a Blue Mosque statue which has pride of place among my many travel treasures. 5. I would not hesitate in returning.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "El Jadida, Morocco", "Title": "“I LOVE APEX HOTEL !”", "Author": "Marwa_C", "ReviewID": "UR94649610", "Content": "Apex hotel is really lovely the staff is friendly , the rooms are comfortable , clean and really beautiful !! it's because of this hotel that i enjoyed my holiday at Istanbul for the very first time!! wish all the best to all the staff over there !! i will always go there every time i go to Istanbul , Love you apex hotel !! <3", "Date": "January 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "5.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Dublin, Ireland", "Title": "“I don't recommend!! We didn't get a room!!”", "Author": "dialam123", "ReviewID": "UR92269293", "Content": "The hotel didn't have a room for us although we have received 2 emails from the hotel confirming the reservation. We have also advised that we might arrive late and they said there is no problem with 24hr check in. Upon arrival we find out there is no room for us. The guy was hardly speaking English adnd we don't speak Turkish so we couldn't even explain what has happened and why they don't have a room. We were moved to other hotel, which I would never choose (because of the hotels reviews, I remembered it from the website) but it was 1 am and we were exhausted after 3 hours delay of our flight so we stayed there. We were given 3 bed room and we were told we can stay there for 3 nights. The next day they told us to change the room cause we paid for double-bed not 3- bed room. Fair enough but why previous night they told us we will stay in that room?? Overall - I don't recommend Apex Boutique Hotel. We were talking to a manager on the phone and he didn't see any problems in the fact that we stayed in a completely different hotel that we wanted and we paid for. We said we should received a discount because the hotel we stayed in had a lower standard but he said he would give us a discount if we have stayed 2 nights instead of 3. LOL", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "casa", "Title": "“nice little hotel in a good location”", "Author": "inmorocconow", "ReviewID": "UR92219128", "Content": "Stayed here for one night in December 2010. This is a nice little hotel, within 10 min walk of the Blue Mosque and Aya Sofia. A bit hard to find at first, but once you find it the location is great. Had a lovely stay for my last night in Istanbul! Amazing little rooms with heat and a good clean bathroom. Terrific to have internet in the room! Just a few little FYIs for future travelers looking up this hotel on Tripadvisor that are no means criticism of the hotel and absolutely have not been considered in my review : The rooftop terrace, where breakfast is served, can be a bit chilly in the winter as the plastic sheeting that serves to help keep out the elements does not keep out the cold. You may want to bring your coat the first day you are there if traveling in the winter until you determine whether or not it's an issue. If you are looking to book the budget double room, do be aware that at least one of them is on the ground floor near the stairs/computer where you get noise from people coming in/out and using the computer. If you are a light sleeper you may want to book a different category of room for just a little more money to avoid potential noise issues. I did not have an issue as I was dead tired and fell right asleep.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Above and beyond”", "Author": "gilbertenstein", "ReviewID": "UR91140401", "Content": "We booked online so didn't know what the rooms would be like in reality. They're not great but they're clean and comfortable. The big plus here is that the staff are very helpful in fact they are more helpful than most staff at 5 star hotels.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Lots of room in this hotel, but only for improvement.”", "Author": "DanaAb", "ReviewID": "UR91082366", "Content": "In my book a good budget hotel must have unquestionable cleanliness, a comfortable bed and a decent bathroom/shower. Rating the Apex hotel against these I would give it a 'fair' rating. My first impression of the hotel was soured by the smell of bad plumbing that pervades the lobby and staircase. Luckily our room was odor free and looked generally clean. The decor was nice, if a bit kitschy. Our triple room had three single beds set in a row and felt a bit cramped at times. The bathroom was small but not tiny and had a modern looking shower. Unfortunately the fancy shower didn't work properly and the water trickled out of the shower head rather than exploded. The hotel has a free wireless internet connection, however the connection on our floor was not working. We reported it to the manager who promised to ask his 'friend' to come have a look at it. It was never fixed and the manager never followed up to see if we still had problems. We worked around the problem by connecting to the hotel's other very weak connection which worked most of the time but was slow and unstable. The hotel has a free breakfast served on the roof top every day from 7:30 to 10:30 but we were turned off trying it by the smell in the lobby. Despite all this, the hotel has some definite pluses. It was the cheapest hotel I found at the time in the Sultanahmet area. The beds were comfortable. The towels and sheets were clean and our room came with 3 nice bath robes in addition to the towels. So all in all not a terrible experience, but I would probably opt for another place on my future trips to Istanbul.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "The Hague", "Title": "“Excellent value for money”", "Author": "BiancaNL", "ReviewID": "UR88957183", "Content": "I found this little place through Trip Advisor. It's small and friendly and located at one of the most charming and quitest streets of the Sultan Ahmet area, yet close to the main tourist attractions. Above all service was excellent, at first by helping me getting around. Unfortunately I got quite ill at the second day of my stay in Turkey, but luckily they helped me out terrifically. By retreiving my (lost) luggage, postponing my onward flight and most importantly: by meeting all the needs a sick person had. A bit like home away from home.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Roma", "Title": "“Cozy hotel in the heart of Old City”", "Author": "Rostaluma", "ReviewID": "UR88717321", "Content": "My husband and me spent 3 nights at the Apex Hotel and it has been a great deal! The hotel is nice, room clean and breakfast tasty. You get everything you need. Location is fantastic just few meters away from Blue Moschee, Saint Sophia and Topkapi Palace. The staff was really friendly and ready to satify our requests or to advice us where to go.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Thank you for the lovely place”", "Author": "Katyapal", "ReviewID": "UR88403450", "Content": "Very nice cozy place - small and friendly. The whole area though is full of nice little hotels like this one. It's a great destination in Istanbul.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Europe", "Title": "“Great location and super-friendly staff”", "Author": "NomadicWombat", "ReviewID": "UR85460146", "Content": "Apex is a good mid-budget hotel that is very conveniently located for all the sights of Old Istanbul. What makes it special are the people who work there. They make a great effort to be helpful and personable. For example, on my father's birthday, they surprised all of us with a cake.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "gurgaon", "Title": "“Home away from home!!”", "Author": "rakeshmehra", "ReviewID": "UR81420851", "Content": "One of the best properties i have stayed in, considering traveled all across the world. The owner Ibrahim along with his hotel staff was very helpful and charming. One of the best Indian restaurants is walking distance from the hotel.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shanghai", "Title": "“Nice boutique hotel”", "Author": "ricedish", "ReviewID": "UR80665560", "Content": "I stayed here for one night at the very end of my trip, in the hopes of saving some money. The rest of my time in Istanbul, I stayed at Millennium Suites, which was wonderful, but cost more. Overall, excellent for the money. You'd never consider this a five-star hotel, but that's not what you should expect given the very low price. I think of this as a very cozy, serviceable boutique. The front staff is extremely friendly (almost a bit too friendly when you're exhausted, but can hardly blame them for that). The rooms are not huge, but comfortable enough. The beds are a bit on the hard side. And the bathroom is tiny tiny. Still, I enjoyed my one night here, and would stay again on this budget.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Great location and reasonable value”", "Author": "blinknoodle", "ReviewID": "UR77854415", "Content": "This place has a great location, with a central location but also quiet enough since it is further back from the main street. The staff are reasonably helpful, although at times I wondered whether they completely understood my questions. They, thankfully, helped us print our plane tickets the night before. We had difficulties with a missing plugin on the main computer, but in the end it was figured out. The rooms were small and my gripe is mainly with the washrooms. We couldn't figure out how to use the shower. The breakfast was buffet-style but fairly minimal. We had a hard time getting an early breakfast. The staff were usually still putting things together after we had finished and left. I don't think we were able to have anything that was served hot.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“harika.....!perfect......hotel at the best place!tessekur enderim from greeks!”", "Author": "sundaysgroup", "ReviewID": "UR76824815", "Content": "It was really very friendly the people and the place at the hotel......I m from Greece and really...I couldn t beleive that in turkish I would have the best vacations ever! The hotel has the anatolian character and the rooms as well...with very beautiful and hot design! Turkish people at the hotel very friendly!.....I m looking forward to go again there! Tessekur enderim kardasia", "Date": "August 25, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Awesome service and great location”", "Author": "gurby", "ReviewID": "UR69291626", "Content": "This is the best hotel i stayed in my entire 3 week trip to Turkey. The staff are incredible. Always smiling and go out of there way to make sure u are comfortable. The location is fantastic. The hotel is walking distance to all the main sites including blue mosque, haggia sofia, topkapi palace, basilica cistern and even the grand bazaar. The rooms are clean and appear to be recently renovated and the rooftop terrace provides a great view at breakfast and an ideal place to relax. Simply love this hotel.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Quiet, lovely staff, great location”", "Author": "TravelM00se", "ReviewID": "UR68597530", "Content": "The hotel is in a great location near all major sites in Sultanahmet. We were able to walk to all sites from the hotel. The staff is wonderful-- they made us feel welcome and made us laugh as well. The rooftop terrace is lovely with great views of the Sea of Marmara and the Blue Mosque. There is also a quiet, shaded sitting area in front of the hotel, which is a nice place to rest, talk and have a cup of tea (which the staff always seemed happy to provide). The rooms were a bit small, but comfortable, quiet and clean.", "Date": "June 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Surrey UK", "Title": "“A customer friendly small hotel in a location convenient to the main sights.”", "Author": "LuverlyJubbly", "ReviewID": "UR68097560", "Content": "We were greeted like family on our arrival and throughout our stay treated almost as family by the hotel team. They went out of their way to help make our stay memorable. They were able to recommend good restaurents local to the hotel, provide travel tips and suggestions for sightseing. Rooms clean and comfortable, with working aircon. Ideal position for the main sights.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Warm hospitability”", "Author": "Gabi37", "ReviewID": "UR67036897", "Content": "The hotel is clean, nice and near to the most important touristic attractions located in the old city of Istanbul. The staff is very friendly and ready anytime to meet the guests requirements.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hailey, Idaho", "Title": "“location, location, location”", "Author": "sunvalley-traveler25", "ReviewID": "UR65751614", "Content": "We stayed in one of the triple rooms for three or four nights and couldn't get over how nice the location was! Not too close to the train below and just far enough from the Blue Mosque as to not feel like \"we were in\" the morning prayer at 5:30 AM. The deck is a great blend of views of the sea, Prince's Islands, and Blue Mosque. We really enjoyed spending time up there every morning and evening. Staff was very friendly and helpful. We were within comfortable walking distance of everything we came to see. Much more than I expected for the price.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Fantastic service makes all the difference.”", "Author": "nettwerkjohn", "ReviewID": "UR65053966", "Content": "My wife and I have stayed in all sorts of places, backpackers thru to 5 star hotels. And, whilst the Apex is certainly not a 5-star hotel, our stay there was one of the best we've had anywhere. The staff there are the best - friendly, attentive, courteous, helpful. They made our stay in Istanbul very pleasant. We also got a great rate, at which we believe it to be a bargain. Negatives:the breakfast wasn't the best we've had in Istanbul, and it is a little difficult to find at first, but hey, thats Sultanhamet. We'd recommend the place to anyone.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Excellent location with outstanding service”", "Author": "david_2010_10", "ReviewID": "UR64015130", "Content": "I just stayed at the Apex Hotel for the second time in a year and thoroughly enjoyed my time there. It is just a short walk to the seaside, fish restaurants, and pubs and restaurants below the Blue Mosque. The hotel is located on a quiet street. The service is impeccable. Emrah is forever helpful at the front desk and Ibrahim makes sure everything is in top order for you. These guys are more like great friends or family! They make me feel at home in Istanbul, and I will certainly stay there again. See you guys at the White House! David", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "York, UK", "Title": "“Brilliant hotel!”", "Author": "Dokitaro", "ReviewID": "UR63681537", "Content": "I don't have enough nice things to say about this hotel. It was clean, excellent location, quiet (we were on the top floor) and the staff were unbelievably friendly and helpful. It's about 5 minutes walk from the Haga Sophia and Blue Mosque, and not far from other sights. Rooms are fairly spacious, clean and the decor is great. We had a few cupboard door handles come loose, but even that just seems to add to the charm! The staff are fantastic, will offer any amount of help and welcome you to sit and order pizza with them! Really nice place, great atmosphere.", "Date": "May 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“Warm welcome, excellent service, remodeled rooms!”", "Author": "psk219", "ReviewID": "UR63000221", "Content": "From the moment I arrived at the Apex Hotel, I was greeted by young employees who couldn't do enough for me. From handling my luggage, to bringing me tea and then bottled water, to helping me figure out how to turn the tv on, to fixing the toilet from continuously flushing, they were terrific. Happy to be at their jobs and happier to be of assistance, the team at the Apex Hotel made my stay warm, friendly, safe and enjoyable. The location is walking distance to the Blue Mosque and the other must-see mosques and museums. Restaurants are also walking distance. The rooms have been remodeled recently and were more than adequate. Not luxurious but well appointed, clean. It had everything I needed plus a safe deposit box in the room, slippers and robes. The room was small; the bathroom also small but very clean. The shower was a corner style so room to move in it was minimal. I liked the employees the best and the smoke filtering inside from the outside, the least. But this is Turkey and most people smoke!", "Date": "May 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Argentina", "Title": "“Extremely nice staff and very good location”", "Author": "Tropos", "ReviewID": "UR62796002", "Content": "Our stay was part of a quite long trip. We had a not pleasant surprise at first as the double room was not available. After a friendly discussion we got the room. The staff, mainly young people, Emrah and the other guys, were extremely nice and helpful all the time. All the stay was very good. The hotel, a tipical boutique is ok, but could be better. The location, in old Sulthahmet is very good, close to a lot of historical places and not far from the tramway, which is very useful.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Turkish hospitality in its best”", "Author": "Rowing_by", "ReviewID": "UR62558371", "Content": "A lot is written about hospitality of people working in this hotel. What can I add? I can only assure you that it's really true! I has just asked about possibility of changing room to the one with the city view and in five minutes I was moving my luggage without any additional charge. And finally before my leaving I got a wonderfull turkish coffe from guest relations girl who really cares about all guests. The only thing which can bother is that everything what is screwed in the wall do not work :) I mean they need to take new screws and make it again.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Enjoyable hotel”", "Author": "sashkin2000", "ReviewID": "UR62542354", "Content": "Apex is a perfect place to stay - nice and warm atmosphere, friendly staff, comfortable (not large) rooms, good terrace view, calm street, near most of Istanbul attractions.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Great location, nonexistent breakfast”", "Author": "nowisee", "ReviewID": "UR60228634", "Content": "The hotel is in walking distance to all the major sights and some of the best restaurants in Istanbul. So if you dont mind small rooms with some mold and having to buy breakfast at local shops you will have a great stay. When we arrived at the hotel the first day/night we where given a room with 3 beds on the third floor. The manager tried to explain that this was because the room we where supposed to have was taken and that the next day we could have that room. Not that i understood everything he said but that was fine. I think the manager called the room we got the first night a \"family\" room. The first night i woke up at around 3'o clock when the garbage truck collected garbage. Then at 6, to the call of prayer from a minaret. So if you are a light sleeper i would suggest you get some earplugs like i did. The next day we went to get some breakfast at the terrace before we started our long day of sightseeing. The breakfast had a small selection of cold cuts and cheese, not the kind of cold cuts im used to and it looked as if it had been on the tray for some time. There was also a selection of cerials, but no milk. And the bread was limited to one type of white bread. We do a lot of traveling and this is one of the worst breakfasts we have had on a hotel. Food is cheap and it would have cost them so little to have a brown bread and some better cold cuts. All in all this hotel is ok, but nothing more.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“romantic heaven to stay with”", "Author": "Irmona", "ReviewID": "UR58147603", "Content": "A stylish cozy boutique hotel with great room accommodations, polite and helpful staff and excellent pricing. Centrally located to all essential sightseeing of Istanbul right in heart of historical part of Istanbul - Sultanahmet, this is a MUST stay for those in on personal travel and even romantic vacations. By the way, it is located in a quiet area surrounded with fairy tail and other beautiful small hotels within 5 minutes from Aia Sofia, Blue Mosk and may be 10 minutes from Grand Bazaar. I have stayed at this Apex hotel on several occasions now and rate it very reasonable. Why? Because the service is excellent, the staff are consistently pleasant and helpful, go out of their way to assist and the room I continue to choose has excellent light and views (such as they are). Apex design concept is made in luxury classic style to feel comfortable and relaxing inside. Each room has a big bed, rich decorated windows and mirror and even plate with various choice of coffee and tea with some sweets that makes it more feel like and home. Front desk staff was very friendly and even advised me how to get to places and where to dine, took for wonderful shopping and informed about night life. Overall, a wonderful stay in Apex hotel. Will definitely revisit again ;)", "Date": "March 9, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Blah60", "Title": "“An excellent little hotel with very friendly staff in a great location”", "Author": "Blah60", "ReviewID": "UR56835770", "Content": "An excellent little hotel with very friendly staff in a great location in central istanbul.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, England", "Title": "“Great hotel! Great people!”", "Author": "mzyxhsme", "ReviewID": "UR56050525", "Content": "This is a nice little hotel in the heart of the main historical district in Istanbul. Our room was clean and comfortable. The breakfast (Coffee, tea, bread, cheese, meats, etc) on the rooftop was fantastic way to start the day. The hotel staff are fantastic, going out of their way on many many occasions to help, give advice and make our stay more enjoyable. If we go back to Istanbul we would definitely stay here again!", "Date": "February 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Delhi", "Title": "“Good hotel for its price. Excellent staff who go out of their way to help tourists”", "Author": "Admiral18", "ReviewID": "UR54772156", "Content": "One of the best things about this hotel is its location and its hospitality. It is located in Sulthanahmet, old town of Istanbul, and has many tourists attractions at a walking distance. Besides, the staff gave good recommendations regarding tours, etc and were otherwise very helpful. I would recommend this hotel to someone who's looking for a good value for money. Ofcourse its not like a 5 Star hotel with all great amenities, but what you're paying for, its definitely worth it. Good luck! On a separate note, please beware of taxi drivers of Istanbul. They are EXPERTS in ripping off foreigners. We experienced several times them changing a 50 Lira note to 5 Lira (since both resemble in color) and claiming that we only gave them 5 Lira. Always get out of the cab and pay change (if possible). This has nothing to do with the hotel.", "Date": "January 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“You will not find a better hotel...truly amazing”", "Author": "Sayyid", "ReviewID": "UR54386553", "Content": "If you want peace of mind...choose Apex hotel If you want to feel at home.. choose Apex hotel If you want a beautiful buffet breakfast overlooking the Bosphorus and Blue Mosque... choose Apex hotel If you want staff to meet all your need... choose Apex hotel If you want spotless clean rooms... choose Apex hotel If you want to be picked up from the airport... choose Apex hotel If you want advice on what to do during your time in Istanbul... choose Apex hotel If you want value for money... choose Apex hotel If you want free internet... choose Apex hotel If you want a hotel that is 2mins walk from Arasta Bazaar, 4mins from Blue Mosque, 6mins from Hagia Sofia, 7mins from Sultanahmet tram station, the Hippodrome, the tomb of Sultanahmet, the Turkish and Islamic Arts Museum, Topkapi Palace... choose Apex hotel If you want to visit Istanbul choose Apex hotel, as not even a 5* hotel could match this hotel's friendliness, beautiful environment and peace of mind. The staff were truly amazing. Emrah the receptionist was wonderful. I chose Apex hotel simply based on their reviews on TripAdvisor and I would recommend anyone to go there. The manager Ibrahim was first class and me and my wife were truly saddened when we had to leave Istanbul. Despite it snowing for 4 days during our visit, they still managed to ensure we enjoyed ourselves in Istanbul by giving us priceless tips that you would never find in a guide book. Apex hotel in one word...BRILLIANT", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Canada", "Title": "“Best value in Istanbul!”", "Author": "Liam72", "ReviewID": "UR54320723", "Content": "The staff of the Apex Hotel were wonderful, the free buffet breakast was generous and the location of the hotel is incredible! Easily the best value in Istanbul!", "Date": "January 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ohrid, Macedonia", "Title": "“Excellent french fries for breakfast”", "Author": "Slavc0", "ReviewID": "UR54308001", "Content": "Staff extraordinarily friendly and welcoming. The breakfast was very good and tasty, clean rooms, nearness of the historical sights, free transfer from Attaturk Airport.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "United States", "Title": "“Great Value, Great Hotel”", "Author": "trvlr2010", "ReviewID": "UR53770982", "Content": "We very much enjoyed the Apex Hotel. Our room was very small (what do you expect at these prices), but was clean and comfortable. There are some great included perks, like free breakfast, lots of tea and coffee in the room, and a free airport shuttle (if you stay long enough). We were continually impressed with the staff -- they were exceptionally friendly and cheerful. If you are looking for an inexpensive hotel in Sultanahmet, you can't go wrong with the Apex!", "Date": "January 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Nice, caring and helpful.”", "Author": "NoorPalijo", "ReviewID": "UR52025651", "Content": "I stayed at Apex hotel for four nights and I must admit all the staff were very friendly and helpful. They do not speak English as good as I would expect in England but you can communicate quite easily. They arranged hotel for me in Cappadocia and gave them personal assurance that I will not cancel the booking. They helped me find an economical flight to Konya and helped me book on Turkish Airline's Turkish website, as the same flight was TL100 dearer on the English website. I stayed at three more hotels in Turkey but their breakfast was better than all others. My parents are planning to visit Istanbul this April and I have already suggested them to stay at Apex.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bahrain", "Title": "“Excellent Experience”", "Author": "mzhoque", "ReviewID": "UR51594773", "Content": "I booked this hotel, reviewing the comments on the hotel on Trip Advisor. I found the experience of staying in the hotel excellent. The front desk is extremely helpful and gave us good advice on the tours and transport arrangements. The rooms were decent and we found our stay very enjoyable. A great bargain for the price we paid. Zahid", "Date": "December 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "India", "Title": "“This Hotel Lives to its Name”", "Author": "Priyankb", "ReviewID": "UR51585008", "Content": "Apex is an Awesome experience for us (me & my wife). We got more than we expected after reading reviews about hotel from the hotel and its staff. I would specially like to mention about the kind of guidance Emrah(receptionist)has provided us in exploring Istanbul and its lesser known places. He has answers to all our queries during our stay in Hotel, and more importantly the answers were perfect. Thank you Emrah & entire Apex Hotel staff for all your support during our memorable stay in Istanbul.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ras Tanura", "Title": "“Excelent hotel and wonderfull staf, the best option in Istambul”", "Author": "Pipones", "ReviewID": "UR50463818", "Content": "We are a family with two small boys, my children specially enjoyed the hotel, the staff is absolutely friendly and love the children, we felt as at home. I fully recommend this hotel specially to families with children.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "beirut", "Title": "“Very good hotel, exceeds expectation,”", "Author": "nadim80", "ReviewID": "UR50393417", "Content": "Location amazing 2 minute walking from Aya Sophia and sultan ahmet money value amazing, staff friendliness beyond expectations, room have an amazing design, i recommend it to any budget traveller family, the Manager Ibrahim and the working staff Emrah and Osman were very friendly people and i would go there again,", "Date": "December 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Pudsey, Yorkshire ,England.", "Title": "“Great place to stay!”", "Author": "moddington", "ReviewID": "UR50181416", "Content": "We stayed here for 5 nights, the room was lovely, not very big but you're out and about during the day. The staff were excellent, very very helpful and friendly, the location is fantastic-right in the heart of Sultanahmet, lot's of restauraunts and bars just around the corner, yet at night it was very peaceful. It's very near the Blue Mosque-no better location! The attention to detail in the rooms was great, slippers, fluffy dressing gowns, toiletries, kettle, tea, coffee etc- TV too! There's also a safe- not that we felt like we needed one but it's there anyway, minibar too- everything you could wish for and 24hour reception staff who actually want to help you. GREAT TIP- to get back to the airport- taxi costs 30 Euros- get on the tram near the Blue Mosque to Zeytinburnu, then transfer to the Metro for the airport (Ataturk)-it will cost you about 2 euros each-takes just over an hour but it's a bargain- not really used much by tourists, it's so easy -just check out the trams first so you know what you're doing- it's easy when you know how!", "Date": "November 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Friendly, Hospitable, Clean, Excellent Location & Well Priced!”", "Author": "AussieLegend", "ReviewID": "UR49881867", "Content": "Great little place! Stayed with my girlfriend and another couple. We had orange juice and coffees on arrival, all the help possible during our stay and sandwiches on departure! Staff are lovely, rooms are traditional and very clean. Would definitely go back and would Definitely recommend!", "Date": "November 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Friendliest staff”", "Author": "rustyman", "ReviewID": "UR49834630", "Content": "Stayed here for 4 nights in October. Room is traditional, clean, quite small and a little tired......but I'd definitely go back. The location is great, safe and the staff, every one of them could not do enough for us. They even made sandwiches for us on our departure at 5:30am, we din't ask for them, and they had coffee for us at the back of 5am. It was bucketing it down on our last day so the guy at reception gave us a brolly. No matter what I asked for they said everything is possible. So if you're happy not staying in a 4 or 5 star hotel then try the Apex. By the way if you stay here then book a table at the seafood restaurand 50 yards along the road, Balikci Sabhatin.", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cincinnati", "Title": "“Ideal location with perfect ambiance”", "Author": "LRCcincy", "ReviewID": "UR49705245", "Content": "Located just steps from the Blue Mosque, Hagia Sophia, the historic cistern and Topkapi Palace. The rooftop terrace breakfast buffet affords a breathtaking view of the Sultanahmet district, the Sea of Marmara and the Bosphorus. The Apex is a jewel with a friendly knowledgeable staff. ,", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Arizona", "Title": "“Great place at great price”", "Author": "KTBlount", "ReviewID": "UR49694292", "Content": "After reading the other review online, I decided to book this hotel. My email inquiries were always answered in a timely fashion, and were always polite. Upon arrival, we were greeted by Lokman Yunushan, the person whom I had been emailing with. He could not have been any more hospitable or polite. We were treated like family, and offered our choice of a double room or a triple. Although there were just the two of us, we chose the triple room. It is about the size of a standard US room, but there are three twin beds. The double was very small with only one double bed, so we opted for the extra space. The room was clean and comfortable, with a modern shower and clean bathroom. In the morning, you can go up to the terrace to experience what a breakfast in Istanbul consists of. Keep in mind that you are in Turkey, and do not expect a typical American breakfast. Hard boiled eggs, toast, small sausages, meats, olives, cerial, and other items make up the spread. It is all served with pride by one of the staff members - in our case a very polite young man that wears a bow tie and takes his job very seriously. The day we left, I went up to the terrace to take his picture and he was extremely surprised that I would want to take a picture of him. He stood erect and took this job as seriously as he did with the food. All in all, I enjoyed our stay at the Apex and would recommend it to anyone wanting a clean, friendly place at a decent price. Many thanks to Lokman who was just a pleasure to deal with.", "Date": "November 20, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quiet well run hotel convenient for all the sites”", "Author": "blueferret", "ReviewID": "UR49512725", "Content": "Whilst possibly not the most glamorous hotel you could book it was well managed and very very hospitable. The manager and staff were ever helpful without being pushy, in fact when a better room became available at short notice we were offered it at no extra cost. The rooms were comfortable and breakfast was enjoyable one the roof terrace. And it was conveniently located near the blue mosque so site seeing was easy.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Virginia", "Title": "“Great location, friendly owner/staff, great value.”", "Author": "GreatFalls", "ReviewID": "UR49416816", "Content": "My wife and I ended our trip to Turkey with a 4-night stay at the Apex Hotel. The hotel was located within walking distance to all the main sites that we wanted to visit, 5-10 minutes by foot to Blue Mosque, Aya Sofia, Topkapi Palace, the Basilica Cistern, with other sites/locations such as Grand Bazaar, Spice Market and Galata Bridge just a bit further, but still most enjoyable walks (once you learn to ignore the persistent street peddlers/restaurant hawkers). The hotel manager, Mr. Ibrahim Billik, and the front desk managers were genuinely friendly and helpful. They provided directions, sightseeing advice, and a nice welcome whenever we entered the hotel. We had the feeling that the staff would go well out of their way to make our stay enjoyable. There are a few things, in my opinion, of which potential visitors should be aware: first, the rooms are not very large (especially the single room we had on our first night's stay); second, there was no seating in either of the two rooms we had during on our visit, although the second room (a double/triple) would have been large enough to accommodate a small table with a couple of small chairs; and third, we found the breakfasts, buffets on the roof veranda, to be just passable, with small selection of items and eggs that were not quickly refilled when they had already been consumed by other guests. That said, these quibbles were far outweighed by the ways in which this hotel did excel. As mentioned, the location couldn't be better and the courtesy of the staff was superb (also, the neighborhood felt very safe, for anyone concerned with this aspect of travel). The rooms were clean, the beds comfortable, and the air conditioner worked well. While we couldn't sit comfortably in our rooms with no chairs, this was more than compensated for by having available a roof veranda that had wonderful views of the Bosporus in one direction and the Blue Mosque in the other. When my wife and I returned in the evening to the hotel after dinner and/or sightseeing, we would go up to the veranda with some tea or ice cream (not too much wine/alcohol in Istanbul) where we could watch the sun setting on the Bosporus, see the Blue Mosque minarets illuminated by spotlights, and listen to the nightly calls to prayer from both the Blue Mosque and a smaller mosque across the street from the hotel, each muezzin seeming to respond to the others' call with an answering call. It really made Istanbul come alive. All in hotel, we enjoyed our stay at the Apex Hotel and found it to be great value for the money. Subject to the review above, we would highly recommend the Apex Hotel.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New Zealand", "Title": "“Don't Stay Here”", "Author": "Shelyr", "ReviewID": "UR48990587", "Content": "We can't understand the good reviews this hotel has received in the past on TripAdvisor - which was the only reason we chose it! This hotel is overpriced, not particularly clean and across the road from two excellent hotels either of which would be a much better choice. The friendliness of the staff does not compensate for the tired rooms, average breakfast and scruffy decor. If you are looking for an hotel in this area of Sultanamet try the Ferman or the Aveccina across the street which are a similar price and of a much higher standard.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Wales", "Title": "“Good hotel, but not great hotel....”", "Author": "GrahlindWales", "ReviewID": "UR48804897", "Content": "First time to Istanbul, wonderful city!! Hotel was good, but cannot see why it is so popular with Tripadvisor reviewers? It is a good three star hotel, no more. The room was probably the smallest I have ever stopped in! Breakfast was on roof top, it rained the last two days and was quite cold. I realise that for most of the year Istanbul is sunny, but there were no area to eat indoors? Staff were very helpful and friendly, and excellent location. I appreciate the price we paid, 50 Euro's per night, for the area we were stopping was very good value, and some great restaurants also, but sorry, cannot see what all the fuss is about.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Mundesley, Norfolk", "Title": "“Front desk staff the most helpful ever found”", "Author": "cmwMundesley_Norfolk", "ReviewID": "UR47883860", "Content": "Stayed at this hotel with another couple. We are all well travelled & rated the hotel highly. Ideal for a short break visit., and within easy walking distance of Blue Mosque & good restaurants. The rooms were modest, but clean and the beds the most comfortable we have found in some time. The staff were so friendly & helpful...the owner vetted my list of suggested restaurants, and the desk readily telephoned attractions to check on opening times etc. & to book restaurants.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Anywhere and Everywhere", "Title": "“Cozy”", "Author": "DAGK", "ReviewID": "UR47108548", "Content": "Nice Turkish boutique Hotel ( seems like there are dozens of these today!) in a good area within walking distance to the major tourist sights. There are manynhotels that have the same amenities and location as this hotel but, what set this hotel is the service. the people working at this hotel are top notch.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Athens", "Title": "“If you go once, you will go again!”", "Author": "KimonAthens", "ReviewID": "UR47095200", "Content": "Very nice boutiqe hotel, in the historical centre of Istanbul, in a quite and beautiful little street, only 5 minutes walk from Saint Sofia and the tram stop. The personel is very friendly, kind, willing, helpful, polite. The rooms are very clean with nice decoration. A little bit small but no problem. The breakfast is full of goods, what I expected to find. Nothing more and nothing less than a good hotel breakfast! Thank you Apex, I enjoyed my visit to your hotel and I hope to visit Istanbul again soon!", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Norway", "Title": "“Excellent service!”", "Author": "Teacher060", "ReviewID": "UR47067183", "Content": "Excellent location and friendly, helpful people managing the hotel. Lots of good restaurants near by.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Greece", "Title": "“Like going for a visit to friends”", "Author": "Dimitris78gr", "ReviewID": "UR46745242", "Content": "A very nice and cozy boutique hotel. As expected, the rooms were relatively limited in space (especially the single ones). However, the friendliness and politeness of the owner and staff were outweighing the space limitations. Very close to the main attractions of the medieval town. Clean and quiet. Maybe the price could be a little cheaper. Still, I totally suggest it, especially if one doesn't require amenities of a luxury hotel and can cope with something more modest. I am definitely coming back again soon!", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Athens", "Title": "“A fantastic hotel, in a perfect location with excellent staff.”", "Author": "Yiouli", "ReviewID": "UR46345760", "Content": "Apex Hotel is situated in a very quit neibourghood in the heart of historical Istanbul. Hotel staff is perfect, they can give you tips on cruises, on sightseeing, on dinning, on taxis... The rooms are very nice decoraded, clean, with many facilities (they have many different choises for having tea in the room). Breakfast for local standards is good. I will totally recomment this hotel to all my friends!!!", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Granbury, Texas", "Title": "“A wonderful small hotel and staff.”", "Author": "BethGranbury", "ReviewID": "UR46310023", "Content": "We have never stayed at such a friendly hotel. We spent four days in Instanbul and Ibrahim and his staff were delightful. They could not do enough for us. We came in late one night and his family was having a wonderful meal on the terrace and they insisted we join them. The food was all home cooked and was great. The location was great and the air-conditioning worked great. Jack and LInda, Granbury, Texas", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“One of my best hotel experiences in my travels”", "Author": "b_nittmo", "ReviewID": "UR45689753", "Content": "I saw this place on Trip Advisor when I was planning my trip to Istanbul and thought I'd give it a shot. I was very impressed with this small, intimate hotel. While I was there, I had a touch of bronchitis and the hotel manager walked with me to the pharmacy and bought me some cough medicine. I've never had anyone go that far out of thier way to make me happy at a hotel before. Not only is the service incredible, the location is perfect for travelers looking to see all the sights of Istanbul. I can't say enough nice things about this place. If I ever go back to Istanbul, this is the place I'm going to stay.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ontario", "Title": "“Wonderful Hotel”", "Author": "GrahamOToronto", "ReviewID": "UR45651965", "Content": "Ibrahim and his colleagues at this wonderful hotel could not have done more to make us feel welcome and comfortable. I would go back here again in a shot if I could! Thank you all.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“A wonderful hotel- the staff were amazing!”", "Author": "minty_b", "ReviewID": "UR41822002", "Content": "the hotel is situated in a prime spot, nearby the Blue Mosque and Aya Sofia. All the main attractions are within walking distance. The staff are amazing, often going above and beyond to make us comfortable. They even invited us to break their fast with them. They were very friendly and sociable, and arranged transport to and from the airport, so there were no hassles on the last day trying to find a taxi. However, the streets are cobbled, so make sure to wear comfortable shoes. It is almost impossible to wear high heels!", "Date": "September 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "jersey city, new jersey", "Title": "“The Hotel with a heart and soul”", "Author": "sharex13", "ReviewID": "UR41366934", "Content": "This hotel was like being at home, Ibrahim and his staff treat you like family. When I originally arrived at the hotel I was very distraught, first by the nightmare of a flight from Casablanca to Istanbul, and that topped off with lost luggage. By time I got to the hotel I was in tears, it was 7 in the morning and I hadn't slept for over 24 hours. The first thing I was told to do was get some sleep and we would take care of everything after I rested. When I did wake up I felt a lot better. Ibrahim contacted AMEX for me to discuss my luggage protection plan. He then offered me food, but what was really amazing was that he sent one of his staff to take me shopping for some replacement clothes etc. I was taken from store to store, my bags were carried for me and also my receipts. He also arranged a trip on the Bosphorus for me and a private guide for a tour of the city. Upon returning from these tours he made sure that there were not problems, that the guides were good etc. He also had a friend who helped me plan my trips to Cappadoccia, Pamukkale, and cruise on the Meditterean, from Feythia to Olympos. Now my missing bag arrived 3 days later but was no longer usable. I was leaving early the next morning for the rest of my trip so he lent me his suitcase till I returned to Istanbul. That night I asked where I could get a bottle of wine and he didn't want me to get ripped off so he went to the liquor store and brought back 4 bottles for me to choose from and then took the 3 bottles back to the store. When I returned to Istanbul he again took me shopping for a suitcase after telling me I didn't need one but could keep his. I was even invited to break fast (it was during Ramadan) with him and his friends. I travel extensively around the world and I have never come across service like this from the personel at a hotel. Ibrahim is a hands on owner/manager who goes out of his way to make you feel comfortable and happy. The hotel is very good value, clean, and close to most tourist attractions. On a scale from 1-10 I would give this hotel a 10+++++. I will never forget my experience in Turkey and I will never forget my new family at the APEX, which is with out a doubt the hotel with a heart and soul.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Najran", "Title": "“A home away from home”", "Author": "hsm67", "ReviewID": "UR40455938", "Content": "Superb!!! I stayed alongwith my family for three days at the hotel. And I was amazed by the hospitality of the staff who seemed to be no less than a family. Situated close to most of the tourist attractions, it was a perfect place to be. One of the most memorable stays i had away from home. The hotel facilities were immaculate and the services highly appreciable.It all made us fall in love with Istanbul and its people. Wish all the best. Dr Hamid.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Genuinely friendly - couldn't do enough to help”", "Author": "PatchMelbourne", "ReviewID": "UR40264191", "Content": "We travel a lot and choose to stay in the smaller \"character\" hotels in the centre of town. From previous experience choosing the right boutique hotel can be quite hit and miss -but the Apex was a delight. The facilities and location were really good and the cost the best we experienced this summer in Europe - perhaps more importantly the service was fantastic. Just ask.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Carolinas, USA", "Title": "“Nice hotel with super views and even better service!”", "Author": "millsm123", "ReviewID": "UR39775688", "Content": "Ibrahim and his team were great from the moment we entered the hotel. They make you feel at home and cater to any need or request that you have. They helped recommend many of the restaurants and bars we went to and we were pleased with all of them. They really are a genuine group of people that want to help. The hotel is very comfortable and has a lot of charm. It's in a excellent location with a 5 minute walk to all the top sights. Apex is more than worth the money and I'd recommend them to everyone. If I go back, I already know where I am staying.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Great service, charm and views”", "Author": "SKSKNewYork", "ReviewID": "UR39722552", "Content": "We loved the hotel. Staff was extremely friendly and attentive. We loved having the delicious breakfast on the rooftop terrace with views of the Blue Mosque and the Marmaran Sea. Location was perfect for seeing the main sights and the street was very quaint. Our kids felt most welcome, too. Rooms were on the small side but very clean with comfortable beds. We would definitely stay here again!", "Date": "September 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Perfect location and a comfortable stay”", "Author": "RedindianLondon", "ReviewID": "UR39509951", "Content": "A perfect location within minutes walking distance of the Blue Mosque and the historical centre of Istanbul. The hotel is in a very quiet cobblestoned road that fortunately misses out on traffic and crowds. The staff were extremely friendly and welcoming. They kept a low profile; always on hand to help if needed but without imposing themselves. The rooms were clean and comfortable with amazing character. We felt at ease throughout our stay; it provided a base for a very relaxed, comfortable and enjoyable stay.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“My favourite hotel ever”", "Author": "gm0u90b2", "ReviewID": "UR39353361", "Content": "M wife and I stayed at the Apex hotel this month for 7 nights. It is an absolutely fantastic hotel, with everything you could possibly need. Great location on a lovely little street, clean rooms (which are full of character) and a roof terrace for eating breakfast on. The staff are friendly and helpful and so welcoming. I really couldn't reccommend this hotel any more highly. Brilliant.", "Date": "August 31, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Barcelona", "Title": "“Very good service!!!”", "Author": "Vidalson", "ReviewID": "UR38833679", "Content": "This hotel boutique is really very good! Ok...the furniture wants to seem elegant and it's really old-fashioned, not according with the status of the hotel....but it's even funny. But the best of all, with no doubt, is the service; the people working there really wants you to be well and confortable: we arrived at 6 a.m. Our room was not ready, but they gave us another one, so we could had a shower and rest for a while...until the breakfast: they gave us breafkast buffet...for free!!! At 9:30 we could enter to our room, very spacious and with the typical carpets in the turkish hotels. The hotel is very well situtated, in a calm street, in a beautiful neighbourhood full of wooden houses and only 2 minuts walking to SultanAhmet Mosquee (the \"blue one\"). Breakfast is very good also, as you are in a terrace with a great views. So...hotel 100% recomendable, due its situation and, over all, thanks to the staff.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bucuresti", "Title": "“Wonderful place in the old city Istanbul”", "Author": "zmd71", "ReviewID": "UR38501659", "Content": "There was a four days where we spent our times in a plesant way. Our guests made us to feel in their hotel like in our home. Many thanks to Mr. Ibrahim and his nephew.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Amazing hotel, exceptional location and the best service I have ever experienced”", "Author": "AdamK82", "ReviewID": "UR37716508", "Content": "I have travelled quite extensively and I can honestly say that the Apex Hotel is the best hotel I have every stayed at. What differentiates this hotel from all others is the customer service which quite simply is at a level which I have never experienced and doubt I will ever again. As this is a small boutique hotel, run personally by the owner and his fantastic staff they truly treat you as though you are part of the family. I was welcomed with drinks and fruit and given a detailed description of what to do and where to go in Istanbul, and on the day i left they provided me lunch as i waited to go the airport. The staff were always there to help with any question I had. The rooms are great, the airconditioning fantastic which is vital considering the heat of Istanbul in summer. There is free wireless internet which is a must in hotels these days. The location of the hotel is perfect, less than a 5 minute walk to the Blue Mosque and the other main tourist attractions. Before I booked this hotel I read the reviews on this site and can only confirm everything that is said. The owner has put his heart and soui into this hotel, and I only wish that all the other hotels I had stayed at provided the same level of service that the Apex Hotel does. I strongly recommend you stay at this hotel when you come to Istanbul.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Israel", "Title": "“Great hotel, amazing service and location.”", "Author": "meirahuva", "ReviewID": "UR37672705", "Content": "I stayed at the Apex hotel with my wife and two friends for two nights. There is no better location for a hotel in Istanbul. The service and the cleanliness in the hotel was above anything I have ever since and I have stayed in many hotels before. The concierge and the manager were very friendly, we felt very comfortable talking to them and asking them questions. Breakfast was average but good, and our room specifically was a little bit small. We strongly recommend this hotel.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Trondheim, Norway", "Title": "“Good hotel!”", "Author": "mostad", "ReviewID": "UR37161483", "Content": "This hotel was a very small and cosy hotel, had a soul to it (also meaning a little old). It is very close to the Blue Mosque and many restaurants. Rooms are a little small but ok. The staff is very friendly and speak well english. I like the outside breakfast on the roof with a view of the city. The breakfast it self was ok. For the price it was a very nice hotel.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Honest and hospitable staff, amazing service, and beautiful location!”", "Author": "CocoOno", "ReviewID": "UR36926883", "Content": "I cannot say enough about the integrity and friendliness of the owner and staff of Apex. They assisted us with every aspect of our stay, from river cruises, to dining recommendations, and advice on where to find the best values (and hidden treasures) in Instanbul. The rooms are clean, the air conditioning is great, and internet is free! Best of all, they have comfortable deck space overlooking the skyline, including the Blue Mosque and the Bosphorus river. If you stay more than three nights, they'll either pick you up or drop you off at the airport, for free (about a twenty Euro fare per person otherwise). To give you an understanding of how honest and hospitable the owner is, he offered to pay for our ride back to the airport after one of our other friends had already used up the free promotion. The guys (and gals) at Apex are truly top-notch. We'll be going back for sure!", "Date": "August 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great Little Hotel”", "Author": "Sydneysida", "ReviewID": "UR35613602", "Content": "Boutique Apex is a great place to stay for a visit to Istanbul. It is superbly located within easy walking distance of the Blue Mosque. Rooms are clean and comfortable. There was wireless internet available. Importantly the staff were the friendliest and most helpful of any of the hotels we stayed at during our trip.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bratislava, Slovakia", "Title": "“Great location and helpful staff”", "Author": "Boris_SVK", "ReviewID": "UR35303577", "Content": "Apex hotel was great.... it is as the photos show. It's situated in a great location to explore Istanbul.The staff are friendly, polite and very helpful. Free wifi is a great advantage as well. I will recommend this hotel to everybody. :)", "Date": "July 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Calgary", "Title": "“Why is this hotel so popular?”", "Author": "RoadRutz", "ReviewID": "UR34674940", "Content": "I agree with others that the staff here are friendly and helpful, but frankly the hotel itself is just one step up from a hostel. Our room was like an oven when we checked in -- it took the small, noisy air conditioner over an hour to get it to a habitable temperature. The room was small, the paint chipped and peeling off picture frames and the bed's headboard. Every hanger in the place was loose on the wall. The toilet would not stop filling; the hotel manager called \"his friend\" to fix it, but the friend either never turned up or didn't manage the repair. Both mirrors were mounted so low that I had to bend down uncomfortably to shave or brush my hair. The shower was tiny and the doors didn't close properly. One knob was missing off the shower control. When we checked in, the 'minibar' was unplugged and contained two bottles of warm water of unknown vintage. We could use either the fridge or the kettle or the TV, but not any two at once as they shared the same wall plug. There was nowhere to sit except on the bed. At least the bed was comfortable and the hotel is well located for doing touristy things, but I am sure there must be dozens of better hotels in the area.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“Great Friendly Staff”", "Author": "nate_the_dogg", "ReviewID": "UR34198956", "Content": "Great hotel. Great staff, and great location. The first few nights I was there I had jet lag and cold not sleep. At 4 am, starving to death, I wandered to the lobby to see where I could get some food. The staff was nice enough to prepare me a plate of food, with juice and water all free of charge. They did this a few nights (until I ended up being able to sleep on a normal schedule). They were extremely, extremely nice. We shopped around for a number of hotels and this one had one of the best prices. I stayed for a week with my wife. The location is great. The rooms are small by North American standards, but average size for European standards. We ended up staying in a \"triple\", which has 1 double bed and 1 single. I would definitely recommend upgrading to this size, since there is considerably more room than a double, even if there is only 2 people. The breakfast buffet is OK, but not spectacular. There is an assortment of breads, jams, cheeses, etc. The coffee was great. The AC worked great, and everything was very clean. For the price, the hotel is a fantastic deal, and the staff is the nicest that I have ever come across. I would definitely recommend the hotel to anyone that cannot afford ot stay in the swanky four seasons hotel a few blocks away.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "CT", "Title": "“Pleasant Hotel with Accomodating Staff”", "Author": "dxzium", "ReviewID": "UR34176336", "Content": "I booked my stay at the Apex Hotel to spend my last night in Turkey and I could wholeheartedly recommend this hotel for the service alone. I arrived in Istanbul from my excursion in Bodrum early in the morning and on my way to the hotel I ran into the service staff who served breakfast who kindly assisted me with my luggage in one hand as he carried fresh groceries in the other. While they did not have an extra room available for me to do an early check-in, they invited me to their breakfast buffet consisting of various juices, coffee, cheeses, sausages, fruits, etc. and some fresh produce / bread from the local market. A modest breakfast overall and a bit different from the Western breakfasts I am accustomed to, but pleasant nonetheless atop the rooftop terrace. The room I had at the Apex seemed rather small compared to most other hotels I've stayed at, but for a single traveler it was more than spacious enough and had a very nice touch of \"home\". The bathroom was also very clean and all the facilities were in good condition. Having been given a tour by the hotel owner and seen the different rooms available at the Apex, it is fair to say this hotel is improving still with flooring and furniture replacements. However, I do have two reservations about the rooms: first, the lighting was inadequate--do not expect to read after sundown in the room without eyestrain; and second, the air conditioner in my particular room did not seem to do much cooling (although the windows were enough for the mild early-June weather). The location of the hotel is great, located in convenient walking distance from all the great attractions including the bazaar. Public transportation (the tram) is a fair ten minutes from the hotel and will take you to the airport (with one transfer-- very cheap and convenient). Note, however, that there are hills near the hotel (meaning sidewalks are littered with steps) and the pavement is close to a brick-like texture of stone. If you have a heavier, rolling, suitcase, it may be difficult to navigate comfortably on foot. Also note that taxis are not allowed to travel through the Sultanahmet area (that separates the tram and the hotel). However, the helpful staff actually assisted me in bringing my bags to the tram (!!), a true example of Turkish hospitality. My overall experience at the Apex was excellent and I encourage anyone looking for a comfortable and convenient place to stay at the Apex.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "vancouver", "Title": "“APEX Hotel”", "Author": "aussieadanac", "ReviewID": "UR33755122", "Content": "Spent five wonderful days in Istanbul at APEX Hotel. Hi to Ibrahim and his staff. Staff had lots of good ideas for sightseeing and restaruants. Central location close to all the Sights. Istanbul was very warm, we found a lovely sea wall walk about five minutes from the hotel - felt about 20 degrees cooler by the ocean! Great view of the Blue Mosque from the rooftop patio. Our room was on the third floor facing the street, it was quiet and comfortable. I recommend this hotel.", "Date": "July 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Perfect holiday”", "Author": "strixje", "ReviewID": "UR32603156", "Content": "We enjoyed ourselves very much this week. The hotel has a perfect location, so if you want to go to the bazaar or the mosque you only have to walk a few steps. There are also many museums and monuments. The rooms are very tidy and clean and you got everything you need for your vacation. The breakfast on the roof is very nice and the staff gives you all the service you need. So if we ever go back to the same region we will definately stay in Apex hotel again.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "St.Petersburg", "Title": "“Very nice hotel”", "Author": "tek71", "ReviewID": "UR32509938", "Content": "I stayed at Apex hotel in the end of May, 2009. Very nice small hotel, only 12 numbers. An ideal location - 5 minutes walking distance to historical places of Istanbul. Bedrooms and bathrooms are not so big, but comfortable, very clean with fresh towels every day. Free wireless Internet is also a nice touch. Breakfast is included up on a roof terrace with an incredible view to Bosporus and the Blue mosque. Very friendly and helpful staff. In a hall of hotel always suggested to drink a cup of tea or coffee. I think, that it is very good hotel under quite reasonable price.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bratislava, Slovakia", "Title": "“Awesome location, great staff :)”", "Author": "adinkaaa", "ReviewID": "UR32509016", "Content": "Istanbul became one of my favorite cities because of its special atmosphere, numerous world - famous historical sights, delicious cuisine, great music and of course, very friendly people. All in all, city itself is wonderful to explore. :) As for this hotel, I must say that it was a good choice. It is a nice little hotel with family atmosphere. The best thing about Apex Hotel is its location - in Sultanahmet, so everything that is worth seeing in Istanbul is within a short walking distance. For example it takes just approximatelly 3 (!!) minutes to walk to Blue Mosque, isn't it amazing? :)This hotel is situated quite close to Topkapi Palace, Grand Bazaar and Hagia Sophia as well. Rooms are decorated in a classical Turkish style, they are clean and beds are veeery comfortable ;p ..bathroom is ok too..so no problem at all. Breakfast is served on roof terrace which has a view of the area (Blue Mosque on one side and Sea of Marmara on another side) ..simply amazing! Well, the breakfast is simple yet sufficient however I didnâ€˜t like it very much. And as for the staff, they are amazing! They try to do their best and to make guests feel like at home :) I really appreciate it, because actually it's the first hotel I stayed in where I saw such a friendly and helpful staff who care. In my opinion, they should add one more star * to hotel for the staff :) Yes, it's not 5* hotel, but it's deffinitely a great place to stay. I'm sure I will stay in this hotel again next time when I come to Istanbul and I hope it will be soon!", "Date": "June 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Melbourne, Vic. Australia", "Title": "“Cannot see what others see in this hotel”", "Author": "Blossom55", "ReviewID": "UR32184185", "Content": "Firstly let me say that the management and staff are warm, pleasant and do their best for you. Many thanks to the lovely young man, Tosun I believe, who serves breakfast. For us, the accommodation was really not up to par, nor was it good value for money. Our room was dark and cramped. It was one of 2 on the ground floor. The lighting was really very deficient within the room. The floor was extremely uneven to walk on. The toilet seat, in the bathroom was broken. The sink leaked over the floor, from its base, perpetually. The bathroom, like the room was extremely small. Realising that this situation may have been confined to our particular room, when ascending the stairs to the breakfast room, where there were open doors, we did peer inside to see if there was imprved accommodation on upper floors. To us, there was not really much improvement witnessed, regarding spaciousness. The manager was apologetic and let us know that he was aware of the standard of the room, but stated he had no other to offer. I had booked our accommodation last year. Mainly due to reading reviews on this web site. Booking that far ahead, and being in direct contact with the hotel, several times, prior to arrival, I wrongly assumed that we would be given a better room than we supplied with. The turkish people are very kind and generous and this etablishment is no exception. Our hosts were generous, but if I had been aware before arriving in Istanbul of the standard of accommodation I woukd have booked elsewhere. Nice people do not ensure a comfortable nights sleep or bathroom experience.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cheshire", "Title": "“A friendly base in the heart of historic Istanbul”", "Author": "cgtree", "ReviewID": "UR31451144", "Content": "The staff were extremely friendly and helpful. We had a great 6 day stay. The hotel is in a perfect location in a relatively quiet road just around the corner from a street of cafes, restaurants and rug shops and less than five minutes from the Hagia Sofia and Blue Mosque. The inclusive breakfast is adequate. The rooms are adequate, as you will be out and about the sites or local cafes.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“Fabulous location, wonderfully friendly staff and a good value too!!”", "Author": "kchurch49", "ReviewID": "UR31334555", "Content": "We just returned from 4 nights in Istanbul; the last three spent at the Apex Hotel. This hotel is in a great location , so close to everything important to visit in Istanbul. My husband and I were really overwhelmed by the helpful and friendly staff. They even filled our request for a bucket of ice late at night so we could try some Raki! Where does THAT happen in Europe? a BUCKET of ICE ! This place is a good value too; the rooms are comfortable with T.V. ( if you really must watch the news) and the rate includes an adequate breakfast on their rooftop terrace. We would absolutely recommend APEX to anyone traveling to Istanbul.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "birmingham uk", "Title": "“What a lovely owner!”", "Author": "pongowaring", "ReviewID": "UR30103919", "Content": "I think I will just be reinforcing what everyone else has said! This is a quirky lovely little hotel slap bang in the middle of all the tourist sites, but down a little (safe) side road, so it is quiet. It is clean, super comfy beds. The breakfasts are fine, but was the one thing that could be improved on. The best bit about Apex is the owner Ibrahim. We had to return to the UK urgently whilst in Istanbul and he could not have been more helpful or kind in what was a difficult time for us. I doubt very much that the four seasons up the road would have helped us in the way that the staff at the Apex did. Do yourself a favour and stay at the Apex- we certainly will be should we go to Istanbul again.", "Date": "May 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bangkok Thailand", "Title": "“We have made a right decission, feel like home.”", "Author": "sonorsotha", "ReviewID": "UR29823188", "Content": "After we have searched for a lot of hotel in Sultanahmet area, we have read almost all comments in each hotel and finally we selected this hotel only from their high rating and reasonable price for us. We were impressed by their hospitality and helpfulness from Ibrahim (the owner) and his staff which you can asked for their help 24 hours a day. The location was within 5 minutes from Blue Mosque and Hagia Sophia but in the quiet part of the area. The room we have was clean and airy. The roof top breakfast was breezy with Mamara sea view. We will be there again.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Great service and location”", "Author": "Robert5480", "ReviewID": "UR29290401", "Content": "Quaint 12 room boutique hotel centrally located on a quiet street in the historical Sultanahmet district. My wife and I stayed in a standard room, which though small, was clean and comfortable and a suitable base for exploring Istanbul. There is no restaurant in the hotel but they do have breakfast on the roof top with an incredible view of the Blue Mosque. The staff at the front desk could not have been more helpful, especially Ibrahim, the general manager. He made great restaurant recommendations and arranged transportation, guides and of course, a Turkish bath. Once he found out we were there to celebrate our anniversary, he made sure that the restaurant (only 5 minutes walk) set aside a special table by the fireplace; and upon our return had a bottle of wine and fruit in our room. Such personal attention added to a wonderful stay in Istanbul.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bristol", "Title": "“Promising little hotel”", "Author": "Serkore", "ReviewID": "UR28846338", "Content": "The young manager took charge of the place a couple of months ago and has already improved things. The new terrace on the roof has a view onto the Blue Mosque. While I was there, a kitchen and bar were being built onto the terrace which means farewell to the horrible, fake orange juice and average breakfast and hello to fresh products and food. The rooms are a bit kitsch but I prefer that to cold Heathrow Ibis hotel efficiency. A very promising place with a dynamic manager.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Great location”", "Author": "EnglandSmarties", "ReviewID": "UR27981849", "Content": "We spent a very enjoyable 4 nights at the Apex Hotel. The location is excellant and the staff friendly and very helpful. The room we had (we were given a choice of 2) was larger than average, with a very comfy bed and a good sized bathroom. Shower was good with plentiful supply of hot water, but some of the other fttings need a little TLC. Toilet roll holder only held in place by one screw, so roll kept falling on to the floor. Hairdryer kept falling out of holder and glass shelf above basin broken at one end. Only small things, but annoying! Breakfast was ok, bread, cold meats, cheese, boiled eggs, jams, fruit etc. Coffee and orange juice could be improved. Basically, the hotel was as described on the Internet and good value for the centre of the Old Town. A little quiet haven after the hustle and bustle of the city.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dubai", "Title": "“Couldnt be better:)”", "Author": "FTurkan", "ReviewID": "UR27386307", "Content": "It may not be the best hotel of stars but i may say that it is the best place that we could stay and the only place we ll stay in the future. Perfect location (walking distance to historical places-sultanahmet-topkapi palace-yerebatan-ayasofya and many more)the friendliest ever and helpfull staff, it was a home away from home... we love u guys and hope to see u again soon.", "Date": "April 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ennis, Co. Clare , Ireland", "Title": "“Excellent Location. Wonderful Staff. Perfect! A Must!!!”", "Author": "DavidPG", "ReviewID": "UR26939049", "Content": "We stayed at this hotel for five nights and can say that it is faultless. Ibrahim and his staff pull out all the stops to ensure that you have a wonderful time and are very helpful with advice on places to eat and where to go and what to watch out for. They offer a courtesy transfer from the airport to the hotel and if you're staying six nights or more they offer a courtesy transfer back to the airport otherwise transfers cost TRY40 (approx Euro18). There's free Wi-Fi. Bedrooms and bathrooms are comfortable, very clean with fresh towels every day. Breakfast, although simple, is fresh and delicious and is included in the nights stay. The hotel is 200 meters from the Blue Mosque and within walking distance of everywhere. It's in a lovely, clean and safe location and I couldn't recommend it highly enough. We've already advised friends and family to stay here and we're really suggesting you consider the Apex. You'll enjoy it and the warm welcome. We can't thank Ibrahim and his team for their help in making our visit to Istanbul such a memorable and happy one.", "Date": "March 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“Safe and Central Location”", "Author": "SH88", "ReviewID": "UR26640942", "Content": "The best part about this boutique hotel is its location -- near the main attractions and yet quiet and safe. There are several other boutique hotels along the stretch and around the neighborhood and yet, there's a casual and calm feel about the place. This is not a five-star hotel, but the friendliness of the reception staff -- Fikret, Ibrahim, and Yusof -- and the convenient location more than make up for it. The hotel has a family rather than a commercial feel to it. When I checked out, I had some leftover Turkish lira. They allowed me to pay in part in Euro and in part in lira. Because of the conversion, I didn't have the exact amount, and yet, they were so nice to close an eye about it. I would stay here again.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dubai,UAE", "Title": "“EXcellent, clean, friendly staff, close to historical places”", "Author": "DoctorDubai", "ReviewID": "UR26601395", "Content": "Hotel was very clean,comfortable rooms, 24hrs hotwater,sufficient spread breakfast,very friendly staff, arrange your sightseeing arrangements,value for money rates", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Saint Petersburg, Russia", "Title": "“Very very nice hotel!”", "Author": "Agafa", "ReviewID": "UR26434468", "Content": "It is a very nice, cozy and charming hotel directly in the heart of Historical center o the quiet street. Clean rooms decorated Cupidons, terrace with a view on Blue Mosque. Very friendly staff.We will come back to this beautiful hotel in the June!", "Date": "March 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "perm", "Title": "“Very good small clean hotel, friendly staff, centrally located (5 minute walt to the Blue Mosque).”", "Author": "lego52", "ReviewID": "UR26038587", "Content": "Very good small clean hotel, friendly staff, centrally located (5 minute walt to the Blue Mosque).", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moscow", "Title": "“Funny hotel with angel's decoration right in downtown”", "Author": "Lets_go_outside", "ReviewID": "UR25347621", "Content": "When we were choosing the hotel, it was about 2 a.m. so it was extremely hard to find something. Finally we opened the fun photoes of Apex hotel with angels over the beds and 32-teeth smiling stuff. We decided to come here to look at them by our own eyes. So we booked the room and after this minute didn't have any regrets about our choise. Right the next day after the booking, I received the confirmation about it and a question about details of the flight to pick us up in the airport by a free transfer. Actually I liked this moment, because I don't like to call to the hotel by myself to clean up all the details. The hotel is situated on a very quiet street even if it's really located in the historical center, close to the sea also. A guest manager Yunus gave us a very good room, which we liked as soon as we entered it. It was big (for a hotel of such type), clean and comfortable for us for two weeks staying in Istanbul. Everything worked well. I must say, that the personnel is very-very friendly, always smiling. They try to do their best to make guests feel like at home. And actually they do it successfully. For example, we could come to have a breakfast in any time we liked (even if it was too late for breakfast, the cook Murat made a great omelet). They always were ready to help in choosing restaurant, in telling true prices for taxi, they found for us an extra-drawer to the room, gave any information we needed, and even they made a company in playing tavla. (Thanks to you, guys! Yunus can be a champion, when he has a luck! Ibrahim is not a brilliant player, frankly speaking, but probably after years of training he will begin to win(-; ). So many thanks to Apex hotel and to everybody in Istanbul, who made our holidays unforgetable! I enjoyed every day staying there and do recommend it to all, who goes to Istanbul for getting positive emotions!", "Date": "February 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "The centre of England", "Title": "“It is very much in the eye of the beholder”", "Author": "ooDormouseoo", "ReviewID": "UR25324181", "Content": "There have been very many positive reviews about the Apex Hotel Historical with the occasional poor review. So how can this be? I think with the Apex the impression can very much be in the eye of the beholder and how they feel at the time. I can see elements of everything that has been described, yet overall I feel that the Apex Historic is a favourable venue for a stay. Although staying as part of a business trip, I was relaxed, the weather was hot and the sights & smells of Istanbul were intriguing. In other words I was pleasantly disposed towards my surroundings. Viewed in this light the hotel was small, attractive & had an air of cosiness and intimacy. But fact â€“ many of the rooms are small, the shower /toilet in my room was very small, as indeed was my room with the double bed filling most of it. The dark colours of the decoration were, let us say different, but did that add to the mystery of Istanbul? Breakfast on the roof â€“ magical in the warm sun looking out over Istanbul, but my notes of my visit say â€˜adequate but not quite so tastyâ€™. I found the staff on reception to be helpful and accommodating, on one occasion providing us with refreshment as we sat outside engaged in a business meeting. As with a lot of the hotels in Istanbul, collection of guests from the airport is part of the â€˜dealâ€™ and this was the case with the Apex Historic when I stayed. The hotel was a nice place to return to at night but sights & experiences of Istanbul crowded out the memory so the accommodation took a little of a backstage in my thoughts. Its location is close to all the major historic sites, down a quiet backstreet where you are not pestered by people wanting you to dine at their restaurant. Nearby are one or two bars where you can sit outside drinking into the small hours. All in all very convivial surroundings. So I would venture that if you are honeymooning, taking a romantic break with a partner or conducting a â€˜liaison discreetâ€™ you will find the hotel quite charming, if you are â€˜passing thoughâ€™ a pleasant place to stay but if you are more used to the comforts and arrangements of the modern hotel then it could seem to you a little shabby and run down. As I say, with the Apex it is very much in the eye of the beholder.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TENNESSEE", "Title": "“Better than 4 stars, excellent hotel i would recommend .....”", "Author": "samozarif", "ReviewID": "UR24661606", "Content": "It was first time in istanbul, my wife and i stayed at apex hotel 6 nights, we really enjoyed our stay. Stuff is friendly and always ready to help, room very clean, breakfast was excellent, airport transfer was appreciated, free wireless internet. free tea any time, decor is new, location is fantastic, the guest manager ( Ibrahim ) is extremely nice, he did his best to make us happy, our flight was 11:30pm , we had to check out 1:00pm, he gave us free room to stay and free drink. If you wanna stay in istanbul go to apex. excellent hotel i would recommend.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague", "Title": "“Weekend in Instanbul”", "Author": "Jan051", "ReviewID": "UR24372120", "Content": "We spent in this hotel only one weekend but it was wonderful time. The hotel is situated in the historical centre in a quiet place. You can see the Blue Mosque from the terrace just 200m from you or you can walk there in 5 minutes. I would like to stress three important points from my point of view - very friendly and helpful staff, clean and comfortable rooms and no noise.", "Date": "February 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“Exactly as promised”", "Author": "TimoGeneva", "ReviewID": "UR24303458", "Content": "great location, great staff and services, excellent organized pick up and drop off. we will be back to istanbul in fall and will definitely return to the apex hotel", "Date": "February 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Krakow", "Title": "“Excellent!”", "Author": "Agni77", "ReviewID": "UR24078019", "Content": "Me and my boyfriend spent 3 nights in this hotel and I must admit that everything was perfect from the moment they picked up us from the airport (included in the price) until we left with a goodbye gift (!) from the hotel. I have never experienced such incredible service before - nicely furnished and clean room, tasty breakfasts, friendly staff always ready to help with any request. What is also important - this charming hotel is very well located in old Istanbul, just 5 minutes walk from Blue Mosque. I will come back there for sure.", "Date": "February 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“the best there is!”", "Author": "YvonneRobert", "ReviewID": "UR23924589", "Content": "We spend 3 nights in this lovely hotel. After the excellent pick-up from the airprort , we had a very warm welcome at the hotel. We reserved a double room but they gave us a bigger room for the same price. Good service! The Staff is friendly and gives very good information and tips. Breakfast was very good, rooms, bathroom are very clean. Rooms are cleaned every day. The hotel is in a very quiet street, so no noise from the street at night and the blue mosque is just around the corner, and all the main atractions are within walking distance..,perfect. Our advice: stop searching and go to this place, you won't be disappointed. Robert & Yvonne Amsterdam, Holland", "Date": "January 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Friendly and helpful staff!”", "Author": "Smappe", "ReviewID": "UR23434002", "Content": "I stayed at Apex Hotel during Christmas holidays. The shuttle service from the airport to the hotel worked well. WIFI connection was quite OK. The hotel staff was always smiling to me and willing to help - their suggestion was always useful. I loved the location too, within the walking distance, you can do the most of expected activities. The day before the departure, the hotel staff kindly offered internet checkin and printing out of boarding pass. Furthermore on the departure, I received small presents from them! Such a lovely service with perfect hospitality. I definetely recommend this hotel to the people!", "Date": "January 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dunedin", "Title": "“A Romantic Treat!”", "Author": "sophiaDunedin", "ReviewID": "UR23362461", "Content": "My husband and I stayed at the apex for 2 very romantic nights over christmas 2008. We loved the hotel, the staff and especially the room. The hotel is close to the most important sites in the old city area and very clean and well appointed. I would happily recommend it to anybody wishing to find accomodations in Istanbul and the breakfasts are terrific!", "Date": "January 7, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sweden", "Title": "“Warm welcome, great location”", "Author": "SveaCH", "ReviewID": "UR23353261", "Content": "We enjoyed very much our stay at the Apex Hotel. Transfer from the airport to the hotel was organised and worked very well. Had a very warm welcome up on arrival. Hotel is perfect situated. All major sights are within easy walking distance. Prefered the Sultanahmed area to Taskim, where we stayed last time. Breakfast was traditional and Ok. Good value for money! Alex/ Sweden", "Date": "January 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Clean & Very Friendly Hotel”", "Author": "jkhsin38", "ReviewID": "UR22583629", "Content": "we stayed at the apex on our first trip to istanbul. its situated ideally just a couple minutes walk from the blue mosque & aya sofia. we took advantage of the free pickup from the airport and used their services (at a charge) back to the airport as well. the hotel is modest and only has 8 rooms total - but clean with all that you need including free wireless. its not the four seasons, so don't expect those types of amenities, nor are you paying for those as the hotel is very reasonably priced. the staff was unbelievably friendly and helpful in all ways. i would definitely recommend this place if you are looking for a clean and well priced accomodation.", "Date": "December 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Latvia", "Title": "“Good holidays”", "Author": "AnceP", "ReviewID": "UR22128334", "Content": "The location is close to the â€œmust see sightsâ€�. Good for single travelers, have shutle from/to airport, hamam. Good advices from very friendly and helpfull staff. I recomend this hotel for everybody who want to relax from day crowd.", "Date": "November 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UAE", "Title": "“My best vacation”", "Author": "AMOA", "ReviewID": "UR22066772", "Content": "We stayed here three days and were completely satisfied with everything. Very friendly staff, cleanliness, quietness, good breakfast and good location, the staff were really helpful , they guide us and informed us what is the best in istanbul. they can arrange every thing for you.", "Date": "November 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt", "Title": "“A very good choice”", "Author": "reginee", "ReviewID": "UR22050643", "Content": "We stayed here five days and were completely satisfied with everything. Very friendly staff, cleanliness, quietness, good breakfast and excellent location near to the most important points of interest. At the airport we were picked up and brought to the hotel with a red leather bolstered car, at the hotel we were offered a welcome drink and turkish delight and we could choose from two rooms the one we liked better. At departure we even received a little present. The people here are really very kind and generous. All in all it was a very good choice and we would come back again.", "Date": "November 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Very good experience”", "Author": "thitherandyon", "ReviewID": "UR21850632", "Content": "We asked for an airport pickup and were quoted a price of 25 Euros, which seemed to be in line with what we expected. When they were unable to give us the room that we expected, they comped us the airport pickup, gave us a nice gift and apologized profusely. They gave us good advice about where to dine, didn't try to steer us to a particular restaurant. They were very pleasant and accommodating. The location is great and we would stay there again.", "Date": "November 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "vancouver", "Title": "“Highly Over Rated / Poor Quality”", "Author": "travel2008vancouver", "ReviewID": "UR21534264", "Content": "We stayed at The Apex Historical for two night after arriving in Istanbul by Cruise Ship. The hotel is well located in the historical district and is walking distance to all of the major sights. Certainly no complaints about the location at all. The hotel itself is quite run down and is in need of attention. The furniture is the cheap and nasty and the property is not well kept. The rooms are filled with low quality furnishings painted purple. The bathrooms are small and not particularly clean. On one night it rained and the water came through the ceiling and dripped on the bed all night long. The hotel did nothing to correct this not even an apology or discount. The breakfast was terrible. Some bread, tea and cereal served on a cold and depressing roof top patio. It was not even replenished when other guests came for breakfast. Really a poor offering and almost insulting. On our last night we asked for an early morning wake up call as we had an early flight home. Good thing we woke of our own accord since the call never came and we had to wake the night manager who was sleeping on the sofa in the lounge. I booked this hotel because of all of the reviews on this website, however, please be advised it's no deal and you can do so much better. The historical area is filled with wonderful small hotels that are way better than The Apex in every way. We loved the area but only wished we had chosen one of the othe hotels to stay at.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "white rock b.c.", "Title": "“Loved the service ,cleanliness and location”", "Author": "peegeeWhiteRock", "ReviewID": "UR21311067", "Content": "We arrived by bus from Burgas, Bulgaria in the evening and took the metro and tram to the Blue Mosque stop and walked to Apex Boutique Hotel. We were met by a very friendly staff member that gave us drinks and turkish delight. Our room was in the back on the 2nd floor, with a view of the Blue Mosque. This hotel is small and quiet, but very friendly, exceptionally clean and the location is the best, within walking distance to all sights. The beds were comfortable. The staff went out of their way to be friendly and answered many questions for us each day. Breakfast was good and filling with fresh bread and many selections of cheese, meat, and salad, juices, coffee and tea. We would recommend this hotel and definately stay here again. Canadian couple 59 years old.", "Date": "October 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lake District", "Title": "“Wonderful location/service/room/views”", "Author": "AdeleJ", "ReviewID": "UR21074966", "Content": "Received warmest of welcomes as we checked in after a dreadful journey! Offered valuable tourist information, maps etc Thought the shower didn't work BUT it is different to home and we had not understood its method. (Perhaps like previous reviewer). It was explained to us and the next 4 days had no problems. Room in vibrant colours was so typically what I imagined Istanbul to be like, I felt like the holiday had begun. Fantastic views from the roof terrace of the Blue Mosque in one direction and the Marmaris in the other. The location was great, 2 mins walk to choice of quiet restaurants, 1 min walk further to restaurants with music and dancing, 1 min walk further Blue Mosque, then busy restaurants noise and bustle, whatever suits you! We travel extensively and this is the first time I have wanted to share information and recommend a hotel. We were sorry to say goodbye.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Apex need renovation”", "Author": "Dubai604", "ReviewID": "UR20608034", "Content": "I requested my travel agent to book this hotel based on the reviews below, but I found my stay there was a total disappointment. I booked 2 twin rooms for my friends and i ( 4 pax), but we are only given 1 twin room and 1 double room near the reception area. My travel agent OK this arrangement without first checking with me. Both rooms were extreme small, (especially the double room ),there was barely much space to put our bags. The decoration of the rooms were hideous, too much red in the room, lack of calming effect. They properly want to go for the classical look, but end up looking like a cheap brothel. Problems with the rooms: Twin rooms *the hairdryer broken. (My friend went to sleep with wet hair) *heater was working *wire with the water heater way too short to reach the power point. *shower area dirty filled with hair. *moldy smell from the bed Double room: *light at the bed not working *air condition not working *shower was not working properly. *only 1 pair of slipper in the room, that was torn upon wearing. * noisy My friends, who was staying in the double room, was having problem sleeping. She can hear people checking out and making compliant. It seem that we were not the only one having problem with the room, a lady came down early in the morning complaining about a spoil shower. Nevertheless, the hotel still have a few good points going for them: * great location * nice courtyard * great view from the root top terrace. Unfortunately there are many hotels within the same area that share the same advantages, you will get better value for your money elsewhere.", "Date": "October 4, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "copenhagen", "Title": "“Byzantine, Konstantinopel and Istanbul”", "Author": "julianeCopenhagen", "ReviewID": "UR19965430", "Content": "We have just spend 9 days at the Apex Hotel and we like to give all future travellers to Istanbul our great recommandation to choose this hotel, especially people who are avoiding big hotel chains looking all the same over the whole world. The staff is kindly and the hotel is located very near the highlights to be seeing and also near an area where local turkish people live, not mentioned in the guide-books. Yours Anne-Mette Lise and Peter JÃ¸rgensen, Copenhagen, Denmark", "Date": "September 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Astrakhan", "Title": "“One of the amazing surprise during our visit in Istanbul......”", "Author": "Mili28", "ReviewID": "UR19562308", "Content": "Me and my mam had to visit IStanbul second time and we did nt want to stay in previous hotel becouse we didnt like it. We decided to search and choose the hotel in hotels website. And We noticed Apex Hotel and our choice of Apex was only course of its location, HISTORICAL location. We did nt know what Apex is and decided just to book spontaneously. And we didnt regret that we booked it! The hotel is very beautiful. The decoration of the hotel is fantastic , the oriental style amazed us. Especially the colors. The rooms are very beautiful and well decoreted, comfortable and home like. The service is very friendly and kind! We want to say the the service of the HOtel everywhere - reception, housekeeping, restraunt is on the HIGH QUALITY!!! And if we will have chance to visit Istanbul one more time - ofcourse we will stay in APEX Hotel!!!! Thanks for nice holiday!!!", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "caltanissetta", "Title": "“Wonderful area of location and kind staff\"”", "Author": "filippoCaltanissetta", "ReviewID": "UR19408127", "Content": "the location of the hotel is wonderful, right in the centre of Instambul in a pretty area. The hotel staff is very kind expecially with children. I really advice the hotel as one of the best accomodation I have had during my travels.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome. Italy", "Title": "“Apex very nice small hotel”", "Author": "MaraRome_Italy", "ReviewID": "UR19373446", "Content": "I stayed at Apex Hotel for one week at the end of July and I strongly recommend this hotel for the exceptional location, the kindness of the staff, the friendly atmosphere and the cleanness of the room. All interesting sites are really at walking distances, the staff and the manager are very helpful and gave us useful information. Small attentions such as the pick up at the arrival, slippers in the room, the tea /drink they always offered us give to this hotel an added value. If, in the future, I 'll have the opportunity to come back to Istanbul, I 'll return in this hotel with the impression to be hosted by friends.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge", "Title": "“I Was Well Cared For at The Apex”", "Author": "MissRich64", "ReviewID": "UR18986571", "Content": "The Apex is a small, family-run hotel with charm and style. I was in Istanbul for eye surgery and wound up with a longer recovery than I had planned for; everyone at the Apex was wonderful to me, even running out to get food for me when I couldn't see well enough! The hotel is small, but very clean and cozy. The rooms are also not huge, but they are exceptionally clean and cared for. A classic Turkish breakfast of fresh cucumbers and tomatoes, cheeses (yummy cheeses!), breads, eggs, and so on, is served each morning on a terrace with a fantastic view of the water. The Apex staff also were really receptive to any problems I had with the hotel - my TV had some problems initially, but as soon as I asked about it, it was fixed. Hey, I'm as much a TV addict as anyone, but you're really not going to want to watch a lot of TV with the beautiful surroundings you have within a 200 yard radius of the hotel. The wireless worked flawlessly for me, both in my 3rd floor room and on the cute terrace downstairs (I loved working there, because they'd serve me tea and I could play with the hotel's mascot-kitten while working!) I'm planning another trip back within the next two months and will stay at Apex again.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Africa", "Title": "“Highly Recommended”", "Author": "RobsSouthAfrica", "ReviewID": "UR18887524", "Content": "We really had a fantastic time at the hotel. The staff are extremely friendly and will go out of their way to assist with any requirements. The location is fantastic, very close to most of the tourist spots although the morning call is something to get used to! I would definitely stay there again.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town", "Title": "“such a friendly hotel!”", "Author": "AlanCapeTown", "ReviewID": "UR18843436", "Content": "Loved staying at the Apex. really friendly and accomodating staff. will definately use the hotel whenever i'm in the city!", "Date": "August 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg", "Title": "“Friendly staff”", "Author": "Mbutlin", "ReviewID": "UR18830987", "Content": "Very helpful and friendly staff. Accomodating to our travel arrangements.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Apex big disappointment”", "Author": "gavismom", "ReviewID": "UR17872987", "Content": "I hate to cast a negative review here, but my husband and I were really disappointed with the quality of the Apex Hotel, especially after reading all of its glowing reviews. Upon our arrival, we were informed that we had been given a ground floor room right next to the lobby because all others were occupied. This room was tiny (there was barely space to walk around the bed to get to the bathroom), with scant light and ventilation. The wallpaper was peeling and the towel rack in the bathroom had come loose from the wall. The wall-box AC either blasted or did not work at all. We got noise and cigarette smell from the lobby and nearby lounge. By the time we made it to breakfast, the cheese and hard-boiled eggs had been consumed and were not replaced. The staff was nice and apologetic, but we opted to move to the Sirkeci Konak Hotel, which was fabulous in all respects.", "Date": "July 14, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Austria", "Title": "“Unforgettable!”", "Author": "Laralu", "ReviewID": "UR17828115", "Content": "A charming little hotel in the middle of the ancient part of Istanbul and many of the beautiful sights are only a few minutesâ€™ walk away. The rooms are not too big but very comfortable and nicely air-conditioned. The typical Turkish breakfast at the hotel terrace (on the hotel roof) is a great experience every day because of the breathtaking views of the Sea of Marmara and the Princes Islands. Service is really friendly and they even help you to learn a few Turkish phrases to get along ;-) ... Highly recommendable!", "Date": "July 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Latvia", "Title": "“We enjoyed our stay. Ozolu family”", "Author": "luksis", "ReviewID": "UR17498574", "Content": "The hotel service is simply amazing and very helpful. The staff goes out of their way to make your stay convenient and enjoyable.The location was perfect. The only thing we had to get used to was the singing call to prayer from the nearby mosque, but it was not a serious problem. We loved Istanbul and the hotel.", "Date": "July 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Would certainly return”", "Author": "dgener8", "ReviewID": "UR17181685", "Content": "Stayed two days at the Apex Hotel and had a great experience there! Correspondence with the staff prior to arrival was efficiently answered. Staff was very helpful and willing to assist with all our arrangements (airport transfer, late checkout, etc). Breakfast buffet was a nice experience with the backdrop of the Blue Mosque. Rooms were exceptionally clean. The manager have us a gift of Turkish apple tea with glasses and a front desk staff member gave us free postcards of Turkey! Would definitely return again. :)", "Date": "June 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "roma", "Title": "“Apex Istanbul”", "Author": "turkisman", "ReviewID": "UR16899734", "Content": "we loved our staying in Istanbul and Apex hotel was the perfect accomodation for visiting all the best attractions of the city. We appreciated a lot the free service transfer from the airport to the hotel (waiting for us notwithstanding our flight was late) and also the breakfast served on terrace in a quite atmosphere, far from the noise of the city. But what revealed really winning fro our holiday was the position of the hotel, stategic indeed: 5 minutes far from blue mosquee, hagia sophia, topkapi palace, T2 tram line.", "Date": "June 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "roma", "Title": "“istanbul perfect at the apex!!!”", "Author": "iako", "ReviewID": "UR16795548", "Content": "It is incredible to stay in a place for few days and feel like home. My parents staid at the hotel and they told me it was absolutely fantastic. The location absolutely incredible!!! It was my mother's birthday and the trip was her present. The hotel arranged a rose and a cake on the date which made my mother nearly crying. I personaly asked for a rose to be found at breakfast and that I would have paid myself. It was a present from the hotel!!!! and on top of this and the free transfer from the airport my mother and her friend received a welcoming present! My parents told me it was so clean and so perfect and the people so nice that they would tell everyone looking for accomodation to go there. I personally hope to visit istanbul very soon and will definitely stay at the apex. It is difficult nowadays to find a very comfy clean place to stay run by nice people genuinely looking after you. Thanks \"apex team\" you made my parents (and friends) stay VERY SPECIAL ! elena", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great little gem in Istanbul !”", "Author": "Lisa_1975_STHLM", "ReviewID": "UR16792156", "Content": "We spent a long weekend in Istabul at the Apex, the city in itself was lovely - but the stay at Apex really made our weekend. Rooms are nice (we stayed in 134 a fairly large room with a clean but small bathroom.) The breakfast is not much to cheer about, quite boring actually. However the staff were wonderful - they really made that extra effort in making us feel welcome and at home. Location is perfect - especially if this is your first visit to Istanbul, close range to the \"must see sights\". And also just a few minutes walk to the tram to take you to Beygolu (for night life). We can really recommend a stay at the Apex !!", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“our romantic week together”", "Author": "roundys", "ReviewID": "UR16706677", "Content": "me and my girlfriend stayed at this hotel for 7 days and it was the best 7 days of my life the staff were very freindly and kind the breakfast was lovely and our room was always clean the staff explained to us the beautifull parts of the city i dont speak very good turkish but the comunication was very good the last night i was there the staff were very helpfull because i was ill but my girlfreind did a very perfect job of looking after me i love her to bits we really had an amazing time and in october we are thinking of staying there again because we are planning to get married i hope we get the same room :)", "Date": "June 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "India", "Title": "“Highly Recommended”", "Author": "SaurabhSangekar", "ReviewID": "UR16483043", "Content": "The hotel is a very nice and comfortable boutique hotel. The staff is very freindly and hospitable. Mr. Harun Cadirci was very helpful. The location is excellent as it is away from the hustle bustle but still close to the city centre. The Blue Mosque, The Hagia Sophia, the Topakiki Palace is approx. 5-10 mins away. The Spice Market, Domalbache Palace, Bosphorous, Taksim Square, Galata Towers etc are easily accessible by Trams. The tram station is about 10 min walk from the hotel. The breakfast spread was decent. My major concern is cleanliness. The room size was decent and clean. The bathrooms were also clean. When we came back from our day trips the rooms were spic and span. The hotel perse does not serve meals but there is a fairly good choice of restuarants available within 5 mins walking diatance from the Hotel. Highly recommended.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edgewood, Kentucky", "Title": "“What a great find.”", "Author": "LuvDCaribbean", "ReviewID": "UR16443370", "Content": "We ended our cruise in Istanbul. Knowing that we'd have already spent a fortune, I needed to find something nice, but inexpensive. I found the Apex on Trip Advisor. What a gem this was for us. It was the best price by at least 100 euros compared to any other hotel, yet no other hotel has perfect reviews. For this price, employee friendliness, and central location - you will not do better than this place. The Apex is in the same area as the 4-Seasons resort - this is a very nice area with old, restored buildings. The streets are made from bricks. Not only are all the main attractions within 5 minutes walk, but there are shops, restaurants, and pubs right around the corner. This is a super little hotel, located in a very nice neighborhood, with everything close by. This was the only piece of our trip that I feel like \"I received the best deal\". It's nice to feel that way once in a while. It is not a 5-Star hotel, but it's certainly a great place to stay.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Perfect stay!”", "Author": "Raf-Freya", "ReviewID": "UR16287361", "Content": "Our stay in the Apex Hotel was just perfect. We appreciated a lot the warm welcome and nice explanation about the hotel and Istanbul in general. The rooms are lovely decorated and very clean. We stayed in a room in the back which was very quiet but I think the front rooms are also nice because the hotel is located in a very quiet street. Just around the corner there are some very nice restaurants and shops and the Blue Mosque, Aya Sofia and Topkapi palace are only a 5 minutes walk! A pity that they were working on the roof terrace but the breakfast downstairs was also nice (French bread, cheese, salami, marmelades, honey, tea, coffee, olives, eggs,...). A special plus for this hotel is the friendliness of the staff. All of them were always very helpfull and friendly.", "Date": "May 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Four wonderful days in Istanbul”", "Author": "WoodsIreland", "ReviewID": "UR16165940", "Content": "We have just returned home after four wonderful days in Istanbul. Our stay there was truly memorable due mainly to the hospitaly shown to us by Harun and his staff at Apex Hotel Historical. All the staff were friendly and courteous at all times. We were a group of four people, a German couple and ourselves, an Irish couple. The staff were able to converse in both english and german. Apex Hotel is ideally located -- a few minutes walk from Topkapi Palace, Blue Mosque, Aya Sophia and Basilica Cistern. We had no need for public transport or taxis. Bedrooms were very comfortable, by day 4 we actually slept through the early morning call to prayer from the Blue Mosque !!! Michael Mary Cox Ireland", "Date": "May 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rhinelander, Wi", "Title": "“Just the Best - from the USA”", "Author": "nocnurse98", "ReviewID": "UR15960746", "Content": "We have never experienced a more pleasant and welcoming hotel stay. The staff were phenominal in meeting our needs and went above and beyond our wildest expectations in making our stay a most memorable experience. The rooms were clean and comfortable. The hotel's location is excellent. We fell in love with Istanbul and it's people and hope to return soon. We will not even consider booking our accomodations anywhere else except here.....and my children are in complete agreement...", "Date": "May 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "GENOA", "Title": "“Istanbul, The Blue Eye City”", "Author": "ICELAND2008", "ReviewID": "UR15953479", "Content": "A very comfortable and peaceful hotel in the heart of historical area of Sultanahmet. It's amazing the way we have been welcomed in Turkey by Hotel staff: a transfer from Ataturk airport to Apex hotel on a new Mercedes offered by Mr Harun Cadirci (Hotel General Manager), a welcome drink with a taste of typical Turkish sweets at our arrival, little briefing on Istanbul best attractions with informations about distances and means of transport given by desk clerk (all guys are very good, always smiling and helpful). The rooms are well equipped, with much space between bed and bath, kept tidy.... towels changed everyday, minibar, TV... The first reason why everybody should choose Apex Hotel? Because it is 5 minutes walking from the most important beauties.... and it's situated in a very safe quarter where you can find also little restaurants and pub or handicrafts shops. Before leaving the hotel a bue eye gift will be donated wishing good luck!!!", "Date": "May 12, 2008"}], "HotelInfo": {"Name": "Apex Hotel", "HotelURL": "/ShowUserReviews-g293974-d729891-Reviews-Apex_Hotel-Istanbul.html", "Price": "$80 - $197*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Mimar Mehmet Aga Cd Amiral Tafdil Sokak No:24</span> | <span class=\"extended-address\">Sultanahmet - Fatih</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34122</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "729891", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/6a/2e/72/exterior.jpg"}}