{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cranbrook, Canada", "Title": "“Older property, 100% smoke free.”", "Author": "Dawn B", "ReviewID": "UR127494752", "Content": "I booked this hotel with CheapTickets, which advertised the room as a smoking room. It was not until when I went to check in after a day of travelling that I was informed. Kim at the front desk was wonderful, got Cheap Tickets on the phone for me, looked at their listing on their website and ensured a refund. I did stay for one night since it was so late by that time. It appears to have been a grand hotel in its day. There were many maintenance issues reported as I stood at the front desk on hold with Cheap Tickets for 1/2 an hour and then for another 1/2 hour once I finallly got a person. (I will review Cheap Tickets in a separate one) The staff at the hotel were very accomodating and attended to the maintenance issues quickly, I believe that they had their hands full. The pool area was gorgeous. There are elevators. The rooms have balconies, but without tables or chairs. The rooms have a fridge and a microwave. I never did get any hot water in the bathroom sink, and was only able to have a bath after getting some help getting a plug and some instructions on how to get water in the bath (turn more than 5 times). I was given a cable to hook up to internet in my room, but I was able to get a bar of wifi in there in which to search for another hotel. Kim saved the day. If anyone reads this and stays there, she is the overnight person that comes in at 11pm. Please tell her that she has had a compliment online, because without her I would have been frazzled.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Raleigh", "Title": "“Dreadful”", "Author": "Mark B", "ReviewID": "UR126322357", "Content": "Dirty, dark, and dated. Air conditioning was broken for most of our 3 night stay. Most of the advertised amenities are nonexistent; i.e. in-room wifi, pool bar and restaurant. The upholstery on the furniture in the restaurant was FILTHY! If I hadn't pre-paid, I'd have found other lodgings. On the plus side, convenient access to the 10; two great restaurants right across the street; centrally located.", "Date": "March 19, 2012"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "dfw", "Title": "“Nice for the price”", "Author": "Mr_Kov", "ReviewID": "UR126189231", "Content": "After 1 night in a grotty Super 8 I decided to pay a little more and stayed 1 night here. Not bad for the price I paid. Hotel is 20-30 years old. Clean rooms. Toilet flush was not great, but I've had that same problem in ***** hotels. Wifi was fine for me. TV good. Did not have time to try the $4 breakfast. Nice view of the mountains! Not fantastic but much better than a Super 8! There is an excellent hiking trail about 2 miles from the hotel,", "Date": "March 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Jose, California", "Title": "“The lowest”", "Author": "GarryPy", "ReviewID": "UR125078771", "Content": "I've stayed in many hotels around here, this was the lowest. It clearly has had no renovation for decades, or is it meant to have that well used 70's look? There is no wifi beyond the 2nd floor, my TV was half dead and the breakfast is an insult. Never again.......", "Date": "February 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pleasant Prairie", "Title": "“Phoenix vist”", "Author": "bearman_10", "ReviewID": "UR124024937", "Content": "I enjoyed my stay at the Grace Inn. Very nice people and it was not very busy so had the feeling of run of the place. The staff was friendly and helpful. Granted it is a bit older but rooms were fine and hotel was clean. Good value for the money. Nice hot tub also. If i head back out to Phoenix i will stay here again. I like that all the rooms come with a small frig and microwave.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "sedona", "Title": "“Nasty”", "Author": "honeydue", "ReviewID": "UR123814917", "Content": "Old. Very old and poorly maintained. Not the cleanest place either. Staff has been very polite and the location is pretty good this place needs renovating desperately. Paint right over the wall paper old broken fixtures and pubic hair on the celing in the bathroom! How does THAT happen!?", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Parker, Colorado", "Title": "“Dated, but Pretty Good”", "Author": "DrTom234", "ReviewID": "UR121134826", "Content": "WWe were looking for a pretty cheap hotel close to family and this one was on Expedia for 30% of their $99 price. $99 is very overpriced for this dated property. The room was large with a sink and fridge that had been uilt in after the fact. A very old microwave sat in a weird spot on the counter. The shower worked but was also dated. The bed was comfortable enough and it was relatively quiet. While I was not overly impressed by the property, there was very good service. I left some jewelry in the room when I checked out and when I called back, they found it and held it for me - I was very thankful for that.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Phoenix AZ", "Title": "“Old, tired, sad hotel”", "Author": "msphx12", "ReviewID": "UR120194880", "Content": "Staff was very polite. Great location. Rooms , lobby, etc in serious need of updating! Hallways have a moldy smell. There are too many other hotels in the area to stay here", "Date": "November 5, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Snohomish, Washington", "Title": "“Won't go back!”", "Author": "mistykinko", "ReviewID": "UR117867295", "Content": "Nice pool but that's where it ends. Couldn't get our door open staff said they would fix it that never happened. The carpet was wet from a leak in the bathroom so the room smelled horrible when we told the staff they didn't seem concerned.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "San Diego", "Title": "“Not so great...”", "Author": "RegularGuySanDiego", "ReviewID": "UR115907415", "Content": "I wasn't expecting anything terribly special... just an average hotel. The room was provided for me by the people who hired me that day, so I wasn't going to complain. The lobby is kind of nice and the room is... average. About what I'd expect. The problem here is that there were a lot of little things that add up to give it a not-so-great review. There was no info in the room that told me the check out time or any of the amenities or things available at the hotel. I found that I kept having to call the desk with questions, and while the person working there was nice enough, they weren't terribly helpful or enthusiastic. It seemed like they didn't like their job that much. I called to ask about getting the internet and was told that WiFi was available in the lobby. I said I was surprised that they didn't have it in the rooms, and she said that they did, but I'd need to come down to the lobby and pick up a cable to plug into the wall. I thought it odd that I would have to throw a few questions her way to finally draw out that information. The bar was large, but they were doing karaoke for a small group of people (pretty bad) the night I was there, so I didn't hang out in the bar. The next morning, I went to have breakfast in their restaurant, where they advertise the $4 breakfast. The service was pretty bad. Like they didn't want to be there. And it felt pretty warm in the restaurant too. I suppose this might not be a problem during the winter, but it was pretty lame during the summer. This wasn't just limited to the restaurant... In the room, I couldn't get the AC to cool the room down enough for my taste. It was over 100 degrees outside, and it was like the room couldn't get any cooler than the mid to upper 70's. To Arizonans, that probably feels great, but it's still a little warm for me to sleep. Fortunately, I had an electric fan in the trunk of my car, so I brought that in and it helped. The pillows were the heavy kind, that almost feel hard. Not terribly comfortable. The bed itself was ok, and the TV was ok but there was no guide to the channels or any other literature, for that matter. No complaints about the bathroom or shower. They had only 2 luggage carts, both of which didn't exactly roll great. I got to use one to check in, but naturally, at check out time, they were nowhere to be found. I'm a musician and I had a couple of guitars, an amp, a cooler and a couple of suitcases with other touring merch & clothes, so a cart was really needed, but I had to get going. Without the cart, this would take at least 3 trips. So I took one load down and on the way back in from the car, the woman at the front desk offered me a different kind of cart meant more for the kitchen or housekeeping staff to get my stuff together for check out. That was pretty cool of her to lend me the other kind of cart, but when I got back upstairs to my room the key card didn't work anymore. It was 10 minutes prior to checkout time. AAUUGGHHH!!!! I had to go all the way back down the hall, catch the slow elevator and go to the front desk for them to reactivate the key. Really annoying. On my way back up to the room, I passed a family in the hallway that had been locked out of their room too. The staff acted like this inconvenience was completely normal and to be expected. I can't recall that happening to me anywhere else. After that, I got everything on the cart and made as quick an exit as I could. Again... not completely horrible, but the little annoyances really added up. I suppose I'd still stay there again if the room is provided for me, but at least I'd know going in what the problems were. I probably wouldn't choose to stay here if I was spending my own money, though.", "Date": "July 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "San Jose, California", "Title": "“Cheap Grand Canyon vacation”", "Author": "sleeslee84", "ReviewID": "UR115737887", "Content": "Very out dated inn but great for the poor college student--it's clean but definitely not pleasing to the eye. There are some close by restaurants--nothing really fancy. Although there is a Savers near by and I found a lot of treasures!", "Date": "July 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Loves Park, Illinois", "Title": "“They really went out of their way for us...”", "Author": "bethbj", "ReviewID": "UR100190698", "Content": "Staying at Grace Inn was the highlight of our trip. It was very clean and the staff were so helpful. This will be our \"regular\" hotel from now on.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Not as advertised”", "Author": "stockwell13", "ReviewID": "UR93271489", "Content": "They advertise an airport shuttle--there is none. Cost me $60 for taxi to and from airport. No place to eat on-site. Carpets are old and dirty. Would never recommend staying here.", "Date": "January 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Outstanding service, location and price”", "Author": "MarciaMcGrath12", "ReviewID": "UR86877073", "Content": "For the past 5 years I have booked the Grace Inn for our high school swim/dive end of the year awards banquet. The reason I return every year is because of the exceptional service, location and price. Nancy in the catering department is such a pleasure to work with, always returning phone calls and emails promptly with superior customer service. Her friendly and relaxed attitude makes for my job as the banquet coordinator less stressful. Every year when I ask for the dining room to be set up 2 hours prior to our event start time, I am never disappointed. The room is clean and colorful. Once we have added our centerpieces, silent auction, balloons, etc, we could be in a ballroom in the Ritz Carlton! The staff that works in the dining room is always very professional and go above and beyond. The meal they provide is very tasty and plenty of food. The price is the best in town, as I have checked numerous other locations and no one else can come close to what we pay at the Grace Inn. If you are in need of a banquet facility, look no further, you will not be disappointed.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great Resort!”", "Author": "danappraise", "ReviewID": "UR86211760", "Content": "Wow!! We enjoyed our stay at the Grace Inn. Not only was the hotel great, the staff really treated us really well. Olimpica was really nice and welcomed us with open arms. We have already booked our rooms and the ball room for our next event. Nancy and Jim were terriffic too! Thank you all for an amazing stay!!! Dan", "Date": "November 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tubac, Arizona", "Title": "“Cannot Recommend”", "Author": "68ElCamino", "ReviewID": "UR84785510", "Content": "I am sorry to say I cannot recommend this hotel. Years ago a friend stayed at the Grace Inn and I remember it being a fairly nice, upscale hotel. Boy, things have changed. My wife checked in early and gave me a call informing me that the place was not too great. It was a last minute decision for me to come along on the trip and I am now glad I did, I would not want her to stay at this hotel alone. When I arrived it was after dark and some of the lights were burned-out in the parking lot, making the lot dark. Some of the exterior lights on the building were also burned-out, or flickering, giving the whole place a creepy feeling. Going up to the room the elevator made odd clunking noises, and when the elevator doors opened the hallway looked quite depressing, and had a musty smell. The room itself was tired and not completely clean - It is a place where you consider wearing socks to bed because you don't want to walk on the carpet in bare feet. It really looks like the room has not been updated in 10+ years; all the furnishing looked rough and old. You couldn’t pay me to sit on the couch or chair. The a/c system is loud, but the worst part is that the toilet was not cleaned very well prior to our arrival. Unacceptable. At least the television had a lot of channels and the bed was not altogether uncomfortable. The room is also larger than most standard hotels, and features a wet bar. Let's just say we were glad to be out of there at 6 am the next morning.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Bullhead City, Arizona", "Title": "“Would not stay again.....”", "Author": "JSJGSedona", "ReviewID": "UR54909260", "Content": "The Grace Inn does not live up to it's reputation... The room was dirty, the airconditioner did not work, lighitng issues with flickering to the point that our son had a seizure, the room was loud, the bedding and chairs were the most uncomfortable we have had ever, our daughter whom we were visiting would not even stay with us and she was the one who recommended this hotel after viewing it on line............ Not even worth the lower price, I would rather pay for a higher end hotel and get what I am paying for!!", "Date": "February 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Spend your money elsewhere”", "Author": "cthoemke", "ReviewID": "UR54430788", "Content": "Air conditioning in my room never worked, despite reporting it several times during my stay. I ended up leaving the window open overnight, but still had to sleep on top of the sheets; very uncomfortable. Each time I reported, did not get a report back from the front desk if they even looked at it. I stayed here to save some money despite my conference at the Arizona Grand down the street where my colleagues stayed. I ended up feeling tired through much of the day and in the long run, was not worth the money saved. No wireless internet in rooms, though they did provide an ethernet cord to use in the room. Also, this is one that the picture on the website does not match what it actually looks like.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Gilbert, AZ", "Title": "“The \"Graciousness\" of the Grace Inn for Conferences”", "Author": "Gilbert_Gail", "ReviewID": "UR51359732", "Content": "My name is Gail Blackburn and I am the Regional Coordinator for LPA District 10. We have had 2 Regional Conferences at the Grace Inn over the last several years and I must say that both the management and the staff have been the most accommodating that our disability group has ever encountered. First - when we were searching for a conference location several years ago it was like pulling teeth for every little thing we needed - all the other hotels were either totally unaccommodating or added a hefty price to any and all extras (that were not extras at all in our world). Our group is also non-profit, and the Grace Inn literally bent over backwards to accommodate all of our needs at no additional cost - infact - they gave us an awesome group rate and maintained that same rate years later (even though the cost of living had increased). Second - the professionalism of the Grace Inn included impeccable service while also providing incredibly personable, warmth and sincerity. Everyone bent over backwards to accommodate our group - from the front desk to catering to banquet to restaurant to housekeeping to security to management. Special needs required extra effort on everyone's part - it was given willingly and appreciated tremendously. Third - the banquet facilities were perfect for our group, the pool and surrounding area was clean and inviting, and the rooms were tidy and comfortable. The layout of the Grace Inn also provided excellent cozy areas for various subgroups to congregate - from the cozy firepit area to the fun seating around the water feature to the comfy seating on the second floor balcony to the relaxing seating around the pool. Our group was also impressed with the restaurant, the bar, and room service - which all bent over backwards to meet our needs. I just can't say enough about our positive experiences at the Grace Inn... They will always be our only option for our very successful Regional Conferences !!!", "Date": "December 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Queen Creek, Arizona", "Title": "“A grand old lady...”", "Author": "canyonrock", "ReviewID": "UR50715615", "Content": "... in need of a face lift. You can tell this used to be grand hotel but now this proud lady is past her prime. While service was good and the common areas and rooms were clean there is a lot of deferred maintenance. The furniture in our room was worn out, wood work was badly scratched, peeling paint, outdated fixtures. It's a shame how the owners have let this property down. With some paint, varnish, and elbow greese, this tired old lady could easily return to her sparkling prime.", "Date": "December 6, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“reasonably priced accommodation in phoenix, arizona”", "Author": "KatieM3", "ReviewID": "UR48541898", "Content": "reasonable price: 50 dollars per night for 2 people with 2 queen beds. good comfort. good access to I10 east for tuscon or mexican border. recommended to us by the locals.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "AZ", "Title": "“Great service, great value”", "Author": "AzAz411", "ReviewID": "UR48465740", "Content": "This was the first time I had stayed at the Grace Inn- as we live here locally- so us needing a hotel room is unusual. I was really impressed with the representatives at the front desk- they were very friendly- and ensured that our accomodations were to our liking. The rooms were clean, comfortable and welcoming. The beds were soft, and had clean sheets- as I am reading one visitor said they did not have the same experience. I had a great nights sleep- and woke up feeling refreshed. The shower worked fine- no problems with the knobs, and there was adequate shampoo, conditioner and soap on hand. There were plenty of towels- which was really nice. The amenenties were nice. The pool area was well kept- and has a great veranda with tables to lounge at. The hotel also has plenty of room inside the lobby to sit and catch up with friends. There is a sunken in lobby that has plenty of seating- as well as sofas and chairs away from the check in desk. Everything was to my satisfaction. The value was great and overall sevice was excellent. I will recommend others to stay here- it is close to the freeway- so there is close access to the airport, mall, plenty of restaurants, and stores.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Better than the reviews but too many problems to recommend.”", "Author": "chacharu", "ReviewID": "UR33027302", "Content": "I needed a room for one night and got a pretty good deal here with Hotwire. Even after the iffy reviews I really hoped to enjoy my stay. From the outside and the lobby I was hopeful & the clerk who checked me in was friendly and efficient. The room was fine, furnishings showing some age but adequate. It annoys me when people get a cheap room and bitterly complain about not having a 5-star atmosphere--if you want that, pay for it! My needs were simple and everything was fine. The bathroom was spotless which is a bonus in an older hotel. There was a small balcony where I enjoyed my morning coffee but wish there had been a chair. I was happy to see a little coffeemaker and fridge--always a big plus! The free wireless internet was very slow to connect and then none-too-speedy, but it was adequate for my needs. So I was feeling pretty good about everything. That's when things started going downhill. First, when I got to my room that evening it was very chilly and adjusting the thermostat to a warmer temp just seemed to inspire the ac to blow colder. I hate \"idiot\" buttons. If they aren't going to allow us to adjust the temp, don't put a thermostat on the wall to give the illusion that we can control it. We'll KNOW it's not working. Finally I was able to just shut off the fan and hope it didn't get too warm overnight. And it was fine. The room was quiet, the bed comfortable and I slept like a baby. I turned the ac back on in the morning and all was well, but I should have been able to adjust it to a more comfortable temp that evening. In the morning, I was glad for the coffeemaker but annoyed that there was no creamer at all. Oh well... I made do without. Not the end of the world, likely just sloppy housekeeping. Then when I went to shower the knob to turn on the water was either stuck or broken. No amount of pulling, turning, twisting or prodding did the trick and when I pulled the front off the knob, I gave up. I could have gotten dressed again and I'm sure the hotel would have sent someone to fix it but in the interest of time, I didn't bother. I just washed as best I could in the sink and called it good enough. Why didn't housekeeping report the problem and have it fixed before putting someone in this room? Strike Three. Dang, I wanted to give the place a good review and if I got a good deal, I probably would stay again. I mean, what are the odds that I'd get a shower I couldn't turn on again??? I would even recommend it for a budget traveler--God knows I've stayed in so much worse! But all things being equal, I guess I'd pass this up for someplace with a better reputation.", "Date": "June 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "mpls", "Title": "“I escaped the nut house!”", "Author": "ddandst", "ReviewID": "UR30973329", "Content": "After discussing our time at the Grace inn, My wife and decided to write a comment here. About 1 am on May 21, my wife was trying to call the front desk. She tried calling many times. After a half an hour of trying to call with no answer, she decided to go down to the front desk. My wife got into the elevator and there was a individual in the elevator that had told her to be be carefull, as people are coming to get him. This scared my wife and she took the elevator back up to our floor and told me about this. So, I decided to go down to the front desk. I met up with the security officer and told him of the individual in the elevator, and he told me he is familliar with that person and would go talk to him right away. Security was very very helpfull! Thank you John! Anyways, I came to the front desk and noone was there. I hit the bell that was on the counter and waited.........after 10 minutes of waiting, I hit the bell again.........another 10 minutes went by.........hit the bell again.....and a lady came out from one of the rooms in the back. I was stunned at her appearance! No uniform, she was slopply dressed in clothes only fit to clean house with. She approached me with an attitude as if I had woken her up. She also had no name tag on so at the time I did not know her name. She answered my question and i proceeded back to my room, in a rather bad mood I might add! I again ran across the security officer. He told me he had spoken with the strange man in the elevator and if we had any further problems to let him know. I asked the officer what was the name of the white haired lady behind the counter, he told me her name was Kim. I was going to call management, but I thought that this comment would be enough. I will never go to that nut house again!", "Date": "May 27, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Charleston, SC", "Title": "“Will never go back - terrible!”", "Author": "withdubi", "ReviewID": "UR26172929", "Content": "Okay, number one - if you plan on using WI-FI at all, be prepared to have very intermittent connection. Plus they don't mention that wireless is only available in lobby, NOT THE ROOMS. Staff was okay, but not very helpful when we had questions. Rooms decor cheesy and very outdated. Hotel is smelly and old, and in need if serious updating! The \"Spa\" was pricey and costs more than worth. YUCK!", "Date": "March 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Philly, PA", "Title": "“I should have run screaming when they precharged my credit card”", "Author": "travelgrrl0896", "ReviewID": "UR25589421", "Content": "per my guidebook, this \"aging resort\" supposedly has newer rooms, so you'd think when I asked at check in if some rooms were nicer, she would have put me in a non crappy room. not the case. There were cigarette burns in the blankets, the thin cheap tacky fake-quilt-pattern comforter was falling apart, stitching & threads coming out, scratchy, nasty looking etc. I wonder when it was last washed? the sheets appeared to be clean, but I wasn't convinced and considered sleeping in the car or just leaving and eating the cost since they told me it was prepaid and nonrefundable. and the handle to turn on the water in the bath/shower was falling apart so that I couldn't turn the water on or off. I kind of felt like maybe I should have worn plastic flipflops in, like at the gym or something. the \"mountain view rooms\" afford lovely views of the McDonald's, gas station, and the strip mall across the street. I could see the highway from my balcony, and watch the bikers smoking in the hotel parking lot as they geared up for their ride. someone woke me up having a party at about 3am. not exactly a classy place. bring your own soap and shampoo as there's is the crummy motel kind. the air con controller looks like it is from 1970--no lie. the carpet frightened me too; it may have been cleaned once or twice but it seemed old and was just gross. the room was good-size and didn't *appear* to be dirty--thats the best I can say. I tipped housekeeping b/c its not their fault the rooms are old and dingy; they can only do so much. It's close to the airport, which is why I stayed there. But the room was so gross, I spent the whole night out until it was time to go to sleep, and I did that finally with great reluctance. it wasn't the grossest room I ever stayed in, maybe like the 2nd grossest, next to a highway-side \"inn\" I got stuck at once. another plus is that at least there were no bed bugs. spend another $50 and find somewhere nice. it's worth staying further away from the airport and getting up an hour early. trust me.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“more like a motel than a hotel”", "Author": "pkPortland", "ReviewID": "UR23963565", "Content": "The Grace Inn is in serious need of remodeling and upgraded services if it wants to be \"the premier choice among Phoenix Hotels and Resorts\" (as they say on their website). My room was very outdated along with cigarette burns on the blankets and nightstand, threadbare sheets, a broken closet door, and a tub that backed up when you turned the water on (probably from the big glob of someone 's hair that I could see in the drain - the drain plug was missing). There was no description of amenities or services in the room so I was calling the front desk every time I had a question such as to find out if there is internet in the rooms (only some rooms). When the AC/heat fan starting making a loud, clanging noise at 10pm, I was told I would just have to wait until morning to have it fixed. The included breakfast buffet was edible, but far below the quality of national chains such as Holiday Inn, Hampton Inn, and Best Western. The pool area was kept up and pleasant. If you are just looking for a very basic, Motel 6 type place to sleep, this will probably do. If you are planning on spending any time in your room or have business to conduct, I would not recommend Grace Inn.", "Date": "January 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "del mar, ca", "Title": "“Extremely reasonable for the price paid. Excellent service.”", "Author": "surfgal1", "ReviewID": "UR23211788", "Content": "I was there 3 nights for a conference and am giving it 5 stars, as it was quite reasonably priced for what we received. The staff was friendly overall. Of course, it's not the Four Seasons, but the stay was pleasant.... Airport shuttle service was convenient as I chose not to rent a car during this trip. No complaints about the room, pretty clean. I went to the lunch buffet twice and had a nice meal and again at very reasonable price. There was a few restaurants within walking distance to eat at as well. The conference/banquet room was great. Very accomodating, good acoustics, clean. Not sure where the location was in reference to tourist spots, etc....but for a local conference, it was perfect.", "Date": "January 2, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Overall": "5.0", "Rooms": "4", "Service": "5"}, "AuthorLocation": "Lancashire England", "Title": "“Great Hotel”", "Author": "Mightymo1", "ReviewID": "UR21900843", "Content": "Great hotel, economic ($81prpn). Rooms clean, King size bed, Microwave, Coffee Maker etc, Fridge, Free Broadband. Decent size pool and jacuzi with towels loungers and chairs. OK, we had to take care of getting baggage to our own room, but I am sure that if that had been a problem the hotel would have helped. Hotel shuttle bus (and drivers ) great. Take you anywhere within 5 miles of hotel and collect you!! This meant we could visit \"sights\" and resteraunts etc., within that area. The only time we hired a car was at the weekend at $35 per day x 3 full days all incl.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Two Night Stay. Nice view”", "Author": "RWBiv21", "ReviewID": "UR17917722", "Content": "My fiance and I stayed there for two nights at the end of February. The good. Nice view from our balcony. Convenient Location. Many things around like Lifetime Fitness, Restaurants, I-10, We paid only $99 per night for two nights, so that wasn't bad. Had a nice little buffet breakfast in the morning. Pool was nice and was heated. Staff was very friendly and accomodating and gave us directions to a Joyce Meyer conference which was about 30 minutes away. Very helpful. The bad. Seemed like it could have a nice cleaning. Our room was somehow connected to another room (which we didn't want or realize at first. Our first night there no one was in the room next to us, but the next night people were there).That it made it very uncomfortable when we could hear and see the shadows of the peoples feet next to us under the door. It's a good thing they weren't doing anything, (at least we couldn't hear) uggghhh! otherwise we would have asked to switch rooms immediately. They shouldn't give you suites unless you actually pay for that, otherwise it makes for uncomfortable situations. Overall, probably wouldn't stay there again, because there are so many other options in the Phoenix area, but for our experience it was fun and were glad we picked it.", "Date": "July 15, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Humble, Texas", "Title": "“Grace Inn”", "Author": "dottxs", "ReviewID": "UR15333564", "Content": "I attended a conference at the Best Western Grace Inn and Conference Center at Ahwatukee in Phonix last week. First, the good parts... The public areas at the hotel were really quite nice, and the conference rooms had the unique feature of opening on to the pool/patio area. With absolutely fabulous weather, we had those doors open all day and night, and it was such a nice departure from the usual, closed in, conference atmosphere. The pool area was quite nice and it looked like the restroom in the lobby had been recently remodeled. Now for the not so good... The rooms needed some updating BADLY. It was a sparcely furnished, huge room with a flat, planklike bed, a small sofa and a chair, a desk and a TV cabinet, and even with all of that in there, the place seemed cavernously empty. Old, OLD drapes and bedspread, and in that whole humongous room, one teeny little picture on the wall made it look uncomfortably spartan. The whole room slanted towards one wall, and one morning when I opened up my drapes a bit past the window, I found a huge crack in the wall. Seems like the whole place is on it's way to toppling! My friends had a room that slanted even more than mine... one of them had trouble staying on her bed without sliding out. Another friend had a shower head that was hanging off the wall. On arrival, the main elevators in the lobby weren't working and it took most of the next day for them to be fixed... so we had to use the freight elevator to get our stuff up to our rooms. The restaurant takes the prize for the world's worst breakfast buffet and service. One morning I sat there for 20 minutes and no one even came around for a drink order. No coffee... thank heavens I was able to scrounge some up at the conference. If you're attending a conference, there really isn't too much in the way of lodging close by... there's a hotel accross the highway, but it's a very busy highway, sort of like a freeway, actually, so it wouldn't really be convenient to stay elsewhere. There are, however, several restaurants within walking distance. If it's not your vacation, you can tough it out for a couple of nights for a conference... but if you're considering this place for a vacation - I'd stay elsewhere!", "Date": "April 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Pay extra and stay somewhere else”", "Author": "PERKEISHA", "ReviewID": "UR14132542", "Content": "This has to be the worst hotel I have ever stayed in! And I was there 20 days on business needless to say I didnt pay for it! Their was no HOT WATER! The beds are very hard. The staff was friendly. No wifi only in the hotel lobby. If you get a suite with a stove dont except dishes, pots and pans they do not provide them you have to buy your own. Pay the 20 extra and stay somewhere's else", "Date": "March 8, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ohio", "Title": "“Convenient location but hotel is terrible”", "Author": "jsolo60", "ReviewID": "UR10609640", "Content": "My trip was paid for in advance and they charged me a second time. I have been trying to get a refund for over 2 weeks now and they are non-responsive. No internet access except for a kiosk in the lobby which I found shocking, considering even the Super 8 offered free wireless the last time we stayed there. Rooms were on the dumpy side and the hallways and elevator screamed \"run down\". The pictures on the website are deceptive - it is not look that glamorous or elegant.", "Date": "November 5, 2007"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Not bad for one night”", "Author": "Extended_Weekender", "ReviewID": "UR7667593", "Content": "Stayed on a Sunday night. Front desk staff were friendly and helpful both with early check-in and an early check-out. Room was large and spacious, but rather bland. Excellent for a business traveler, or for a stayover with early departure to Phoenix Sky Harbor Airport, took 8 minutes to get to the airport via 10 freeway. Ideal location. Very affordable rate at low $50s. The pool looked nice, as did their restaurant, but didn't try either one.", "Date": "May 21, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san leandro, ca", "Title": "“Don't know why so many rated it low, but...”", "Author": "bizh", "ReviewID": "UR7429092", "Content": "I thought it was fine. The shower head may have been a little weak, but it worked. Nice pool, and poolside atmosphere. I didn't think the room was outdated at all, it was nice and it was clean. The hotel is located to Arizona Mills, a group of factory outlets and restaurants. We had a nice stay.", "Date": "April 24, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "TX", "Title": "“Not a 3 Star”", "Author": "littlewingtalks", "ReviewID": "UR7010606", "Content": "I don't know how this hotel received a 3 star rating. Needs to be updated. The shower head was hanging off the wall. Under the bathroom sink where another metal pipe should have been was a rubber pipe, like one would use in your car. The a/c didn't work properly, and neither did the bath water. It would go from cold to scalding hot, and vice versa. The hotel was in an excellent part of town, but I don't recommend it, and will never stay there again. I should have known better, when I read that it used to be a Best Western. The beds aren't comfortable either. Luckily, we weren't at the hotel a lot, so that helped.", "Date": "March 11, 2007"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Seattle", "Title": "“Don't do it!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4587389", "Content": "This place is run down, dirty and loud. The pictures they provide on the web do not tell the story so don't be fooled.", "Date": "March 6, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Chicago, IL", "Title": "“Total Dump”", "Author": "ScottBanks", "ReviewID": "UR4365559", "Content": "Lobby is old and dated. Rooms smelled like mildew. Beds were old and uncomfortable. Rooms, beds, and bedding need to be remodeled. Very dated - like walking back in time to the 70's. Will never stay there again.", "Date": "January 20, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "2", "Value": "3"}, "AuthorLocation": "glendale, ca", "Title": "“Well below average”", "Author": "glendale-member", "ReviewID": "UR4143600", "Content": "I was looking for an above-average traveler's hotel for a one-night stay. Unfortunately, this is below average. Rooms are large but very plain, with furnishings and fixtures as cheap as possible. The hotel shows its age and badly needs refurbishing. Bathroom sink was on a slight slant because it was pulling out of the wall. Nothing is especially terrible or unacceptable about this hotel. It is just subpar.", "Date": "November 25, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "", "Title": "“\"best\" Best Western”", "Author": "A TripAdvisor Member", "ReviewID": "UR3697831", "Content": "This hotel is the \"best\" Best Western I have stayed in. Not especially attractive outside or surrounding area but convenient location and walk to small strip malls c eateries. Inside hotel is cool and southwestern. Hotel desk staff was friendly. There is a complimentary shuttle that goes anywhere in 5 mi area, including airport, and runs early am until about 10 pm. Free high speed internet. Very comfortable room. Pool area clean but not very attractive. Two dificulties I had were: One, the restaurant service was terrible! It opens at 6 am which was great for the sightseeing tours and my breakfasts were all free, but once had to finally open the kitchen door and ask to be seated. Then wait to give order, then wait for the food. The food selection was pretty good. One time the employee stopped to pick up dirty plates as he led me to my seat! The other problem was the hotel manager - a young woman apparently somewhat new at her job. She tried to refuse my gold crown club points as payment for my stay. When I was persistent, she made a phone call and I heard her say \"well, i never heard of that\". Then she credited me for my points. I would definitely stay here again when in the Phoenix area!", "Date": "July 25, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3338545", "Content": "This hotel is in a great location right off of I-10, but the best part is its proximity to South Mountain - only a few minutes drive from the hotel to the parking area at the mountain, or you could walk it if you don't mind the busy streets. If you plan to do any hiking, this is a perfect place to stay. There are also lots of restaurants to choose from nearby and right across I-10 in Tempe. The rooms are large but need renovation, although they are clean and it's well worth the $72 we paid - especially considering that it was March in Phoenix, usually a really expensive time. The maids were efficient and unobtrusive, the restaurant staff was courteous and attentive. Definitely the place to stay if you aren't looking for a resort-type hotel.", "Date": "April 6, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“nice hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3282732", "Content": "The hotel is nice, it is a little outdated, but nothing I would complain of (mexican tiled floors in the front desk area with fountain). My boyfriend and I went there last week for spring break. The weather was awesome and they have a nice pool area, so we spent most of our time there. You can see small mountains/hills out your room window. Rooms are roomy and the maid service is prompt. Front Desk is very friendly, we had lots of questions about the area and they knew all about it. They have a complimentary shuttle service and will drive you any where within a 5 mile radius...The drivers are very nice and are willing to make sure you get where you want, we didn't have a car, so this became very nice to have. This is not a five star hotel, but for the price we got it for I would not complain. The rooms are ok, but the service is excellant, and it is nearby lots of resturants and a mall, some you can even walk to. Hint for spring breakers: I would stay here again but if I wanted to enjoy the college scene, i probably would not come here again, not a lot of action near by and was quiet, but that is what we wanted, so if you want a relaxing stay come here, but if you want to be near all the bars etc, go somewhere else.", "Date": "March 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "NJ", "Title": "“2-1/2 to 3 stars for this nice hotel”", "Author": "dace2huds", "ReviewID": "UR3265184", "Content": "March 5-March 9, 2005 I was pleasantly surprised when I drove upto the hotel. A six story pink building in a southwest theme. Grounds are in top shape. Nice palm laden pool area with good sunlight exposure. The room was big, king size bed, full bath/shower also had a fridge, small cocktail sink, coffee maker, a zillion tv channels and movies. I left my room everyday around 7am for golf, upon my return room was made up by the maid service. A lounge and seperate resturant on site. The front desk had a lovely young lady named Lindsey, she knew all you would ever need to know of the area. An airport shuttle service is available, plus they will drive you to any of the area resturants, malls, golf clubs within 5 miles of hotel. I cannot give it anymore than a 2-1/2 stars beacuse it just a nice hotel, it needs to be updated with newer rugs and furnishing. No bells and whistles here just a clean room in a good area. I will go back again.", "Date": "March 11, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Kansas City, MO", "Title": "“Pleasantly Livable”", "Author": "A TripAdvisor Member", "ReviewID": "UR2772218", "Content": "Wi-FI (g) in the lobby; decent restaurant; stayed in the vip suite, also with high-speed internet--both connections are free. Had a bit of trouble w/ the employees not knowing whether the room had internet access or not, although \"it says so in the computer.\" Stay in the vip suites, not only do you get a special key to the last floor that only you can access, but you get a full-course breakfast for free. And i'm not talking about those \"continental\" breakfasts that imply something plentiful. I mean eggs, bacon, sausage, etc.", "Date": "October 22, 2004"}], "HotelInfo": {"Name": "Grace Inn Phoenix", "HotelURL": "/ShowUserReviews-g31310-d73727-Reviews-Grace_Inn_Phoenix-Phoenix_Arizona.html", "Price": "$74 - $121*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">10831 South 51st Street</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85044</span></span> </span></span></address>", "HotelID": "73727", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/a7/e4/e2/grace-inn.jpg"}}