{"Reviews": [{"Content": "Great We stayed for a week golfing this year and even though it was in an industrial area it was easy to get to the freeways from there. The staff was very nice and helpful. The hot breakfast every morning was served made to order with a nice selection of items. The rooms were very clean and quiet. Restuarants were in short driving distances from the hotel.", "Date": "Mar 28, 2005", "ReviewID": "UR522022148", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "horrible This hotel is in an industrial area in a less than desirable neighborhood. There were shady locals hanging out around the hotel in the evening. There were cars with booming stereos and squealing tires in the parking lots late at night. There was no hotel security visible and hotel guests were allowed to frolick in the pool area making considerable noise until about 3am. As far as the inside goes, it was not the cleanest and the bathroom is the smallest I have ever seen. After two nights there we moved to a nicer hotel in Tempe. I will never stay there again and I would not recommend it.", "Date": "Mar 23, 2005", "ReviewID": "UR640384475", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "mlempx4"}, {"Content": "worst hotel stay ever!! I stayed at this hotel for a few days on a business trip and was quite dissappointed. I checked in late at night only to have a burly man, rude as hell, no people skills whatsoever, quickly pass me off to a room that was in BFE! I felt like I had just walked a marathon to get to my room. As I was unpacking my clothes, trying to get comfortable after a late night flight, I'd realized that there was no hot water in the room after running the bathroom faucet and the shower for what seemed like hours. I figured I could deal with that and stay in the room until morning. I decided to iron my clothes before bed when I discovered that the iron didn't work either. Extremely upset at this point, I called the rude, burly man and had him change my room immediately. (it's now midnight) He sent security up to check out the room and give me keys to a new room a couple of doors down (mind you security there is lucky to be old enough to buy a pack of cigarettes!) The next room was fine, hot water and a working iron. Management's excuse for the problems in the previous room was that the hotel had been sold out the week before for NASCAR events. Great...that doesn't help me any this week! (Was I supposed to care?) The location of the hotel was horrible, in a very industrialized area but I knew that before I booked my reservation there. The ONLY good thing was the cook-to-order breakfast in the morning that was free with your stay. In short, our company will never be sending our employees there again.", "Date": "Jan 14, 2005", "ReviewID": "UR963948212", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Villager Premier poor neighborhood The Villager Premier offers decent lodging, but is in a terrible neighborhood. It is in an industrial area of factories and warehouses and the occasional adult entertainment venue, on a busy arterial street with freight railroad tracks right across the street. On the plus side, the room was clean, and the cook-to-order free breakfast a definite step above the usual continental breakfast of a packaged muffin and coffee.", "Date": "Jun 23, 2003", "ReviewID": "UR512288484", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g31310-d73782-r3308280-Comfort_Suites_Conference_Center-Phoenix_Arizona.html", "HotelID": "73782", "Price": "$135"}}