{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manteca, California", "Title": "“Nice Outside Areas.”", "Author": "onthegoTwainHarte", "ReviewID": "UR127046125", "Content": "Only stay here because it is near the airport especially since the rates are very high for what the hotel has to offer. Small rooms, limited and unattractve dining area and lots of airport noise. Good points are nice outside areas around the pool and fire pits and next door to the Hilton which serves food late into the evening.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson", "Title": "“Very Nice Place”", "Author": "dkdono", "ReviewID": "UR125563873", "Content": "My wife and I were flying out of the PHX airport early in the morning so we stayed at this hotel the night before. They will let you park your car in their lot while you are on your trip, and will shuittle you to and from the airport at no additional cost. Excellent service, excellent staff.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "McLean, Virginia", "Title": "“Suberb staff nice amenites too”", "Author": "NancyAnn31", "ReviewID": "UR125284604", "Content": "I spent 3 weeks at this hotel for a training program nearby. The front desk, shuttle bus to airport and class drivers, and the wait staff were ALWAYS pleasant. The rooms are clean,there's a great buffet breakfast with healthy choices too. The pool is inviting and there are BBQ grills to use if you feel inclined to cook as some people did. There are also nightly buffet style meals which were fun. I though tit was a good value and very pleasant. Safe area quite near the airport, not a lot to walk to though there are a few restaurants within walking distances.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Excellent service!”", "Author": "probkauz", "ReviewID": "UR124675902", "Content": "We stayed at the Marriott near the airport in Phoenix for the Barrett Jackson Car Auction weekend. It was a very clean, well maintained facility with excellent customer service. Highly recommended!!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Nice, Clean, Would Stay Again”", "Author": "Bobkatevan", "ReviewID": "UR121331242", "Content": "We initially were booked at the Marriott in downtown Tempe, however rooms got overbooked and the hotel asked us if we wouldn't mind moving to another Marriott about a mile away. We really wanted the other hotels location, however, the hotel offered to shuttle us for free back and forth. They offered us another incentive, and we agreed. The hotel was very clean. Nice lobby. Room was very clean and the bed was comfortable. We were given a free breakfast as another incentive for our room. I had oatmeal and my hubby had a breakfast plate with ham, eggs, potatoes, etc. It was very good. The lady that shuttled us back and forth to downtown hotel was very nice. All staff we encountered were very nice. We initially didn't get one of our incentives, and I called the hotel manager back and she immediately resolved. I would recommend this hotel and definitely stay again. The location isn't as convenient as the other downtown Courtyard, but if they would offer to shuttle again, then it's no big deal, as it's only a five minute drive down the street. I really like downtown Tempe area; very fun area.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Convenient Airport Location with Shuttle!!!”", "Author": "Dedphred", "ReviewID": "UR120256010", "Content": "Great location for business travelers. My room was large, clean and quiet. Everything worked, including the internet connection. I had breakfast twice in the lobby restaurant. Buffet was large, food was hot, and eggs were cooked to order. Prices reasonable for the level of hotel. No complaints. The young man who checked me in was efficient, friendly and very helpful. Couldn't do better. I also got a free drink coupon which was very welcome. The bar was quiet, but the drink was definitely fine.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Renovated Courtyard perfect for business travel”", "Author": "Traveler4workandplay", "ReviewID": "UR119270256", "Content": "Renovated Marriott Courtyard provides excellent high speed wi-fi throughout the hotel for free. The newly designed lobby/bar/restaurant is a friendlier, open floorplan. If they aren't busy with airport runs the free shuttle will take you to (and pick you up) Mill Ave. near ASU where you can find plenty of restaurants and bars.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Example of how a Courtyard Should be”", "Author": "goldie363", "ReviewID": "UR118496295", "Content": "Completely renovated lobby, rooms were clean, bed comfortable, big flat screen tv. Close to airport with 24 hr shuttle. Only downside, there was not really anywhere to eat nearby other than the hotel itself.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“Golden butttered toast”", "Author": "GeorgeRex", "ReviewID": "UR117622343", "Content": "I stayed here on business one night. The property seems to be well managed - check in was fast and the reception employee had helpful information at hand about local restaurants and shopping. There are also workstations and printers in the lobby for printing airline boarding passes. I did not try any of the food options here so I cannot comment. The hallways could probably use a renovation but my room was clean and equipped with an LCD television, good desk and wireless internet. The gym was on the small side for a large property but had decent equipment. There is also a medium sized pool which I did not have a chance to try. Might be handy on longer stays. Parking was free and convenient. Overall, I think a good comfortable choice for business travellers needing or wanting to be near the airport. By the way, it is about 15 minutes drive to the rental car return.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brickell, Florida", "Title": "“Friendly staff, they go above and beyond to make you feel at home!”", "Author": "Miamifun_9", "ReviewID": "UR117554772", "Content": "I was forced to stay at this lovely hotel due to my flight being cancelled. Having the staff pick me up from the airport and then drive me around to a local restaurant and local drugstore was certainly impressive. Rachel from the front desk was super friendly and not only picked me up from the airport, she also checked me in! All the stress I had due to my flight issues pretty much went away buy how the staff treated me. THANK YOU FOR A GREAT SHORT STAY!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Maryland", "Title": "“Perfect for Business Travelers”", "Author": "aandptravels", "ReviewID": "UR115866895", "Content": "Marriott has clearly redesigned its Courtyard properties to cater to business travelers, and this hotel near the Phoenix airport is no exception. Casual restaurant/lounge with lots of tables for laptops, booths with private tv's, and a limited but satisfying food and beverage menu. Only the craft beer list was lacking. Friendly staff. Clean, quiet, upgraded accommodations. And Starbucks to boot!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Just right (like Goldilocks)”", "Author": "cgerard", "ReviewID": "UR115635694", "Content": "Weekend stay. Came to relax and hike. Laurén was very gracious and had me laughing at check-in. Liked the layout of the building a lot. The balcony was a big plus. It was nice to get some fresh air easily while staying in the room. Pool area was very pleasant, as was the outdoor seating. Usually stay on other side of airport at Residence Inn, but this will now be my go to hotel when in Phoenix.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“This place is GREAT!”", "Author": "MBBMimi", "ReviewID": "UR114680325", "Content": "I stayed here in May and in June. It is VERY convenient to the airport. The shuttle is really nice and runs every 30 minutes or at your request. They will even drive you over to Scottsdale and some shopping sites. The staff members, particularly Tony Weaver, was exceptional in his effort to make you feel at ease. They have a nice selection of breakfasts and sandwiches at their bistro. While this is not a 'full service' Marriott, I really did love the location and the staff. Rooms were super!", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dana Point, California", "Title": "“Fine hotel but noise is a problem”", "Author": "travelingbarb2-2", "ReviewID": "UR109718085", "Content": "I booked this hotel for the night before my overseas flight, which was comprised of 14 hours of flying time and two stopovers. I took the hotel's shuttle, which leaves every half hour in the morning, to the airport the next morning. That is a convenient service. I have no complaints about the room, which was completely satisfactory, or the breakfast was good. However, I barely slept at all, which was extremely distressing. My room was on the north side of the building in the rear that faces the merger of the 10 and 202 freeways, which happens to be on a curve. The noise was loud and non-stop all through the night. I don't know how less noisy the rooms facing south would be, but if sleep is important to you, at least insist on room that doesn't face the freeway. I have booked a different hotel prior to a trip I'm taking in July with hopes of a better night's sleep.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Salt Lake City", "Title": "“A nice airport hotel with great service”", "Author": "PG32", "ReviewID": "UR101658427", "Content": "I have stayed at pretty much all the PHX airport hotelsand I think this is my favorite. The lobby has been remodeled and now includes a restaurant. Food quality is about what you would expect. Breakfast is quite good. No room service. The rate is reasonable and the rooms are clean. It's much quieter than neighboring hotels and feels cleaner to me in general. The gym is quite small, which is my only critique. Some of the AC units are a bit loud but most are fine. Free Internet for Platinums. Maybe lower status too? The staff are extremely friendly and helpful. They shuttle me back and forth to the office, airport, and Mill Ave restaurants for free and with very little wait. A very comfortable business traveler hotel. Enjoy your stay.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Edmond, OK", "Title": "“Disappointed (again) by Courtyard's \"broadband\" internet”", "Author": "hpdp", "ReviewID": "UR95115236", "Content": "Why oh why does it seem impossible for the hospitality industry to understand that their pathetic excuse for \"broadband\" internet is unacceptable to business travelers? What does a techie do first thing after checking in? Fire up his or her laptop and start working, of course. When the property's internet speed is sorely lacking, it doesn't matter how nice the LCD television is or how comfortable the bedding is or how fresh and sparkling clean the bathroom is. It just sets everything off on the wrong foot. See my attached photo to understand just how painfully lacking the speed is at Courtyard Phoenix Airport. So Courtyard, here are a couple of tips. Stop embarrassing yourself by labeling anything under 1Mb/s as \"broadband\". Secondly, spend the money to provision REAL network infrastructure instead of trying to cheap-out by letting data ride piggy-back on your aging voice lines. When your guest's CELL PHONE is 3x faster than your supposed \"broadband\" internet, you've proven yourselves to be truly clueless.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“They had fabulous service!!”", "Author": "purplesand508", "ReviewID": "UR83248309", "Content": "The hotel was so clean and they had computers in the lobby that the kids could play on. There was an WI also. We were picked up at the airport within 20 minutes of landing and they took us to meet our friends for dinner. Overall I would recommend this hotel.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“great service”", "Author": "Jeff866", "ReviewID": "UR82649716", "Content": "friendly staff who always gave great service. The rooms were clean with shuttles running on a regular basis not much noise either which is nice. good food but pricey everything was very clean. Another disadvantage was no free internet lots to see and do in Phoenix and some good restaurants close by.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Woking England", "Title": "“Good - but not sure about the Bistro”", "Author": "MJJWokingEngland", "ReviewID": "UR77863391", "Content": "We stayed twice in this hotel in February, and we wouldn't have gone the second time if we hadn't been happy with it. The rooms were good, the beds fantastic, the courtyard area very pleasant. Staff were helpful, efficient and reasonably friendly but generally not as friendly as those in the Seattle Southcenter Courtyard. We have stayed in USA Courtyards 4 times so far this year on our visits from the UK. We have mixed views about the new Bistro catering concept being rolled out across the chain. Our first experience of it was at this hotel and it came as something of a shock. The huge counter dominates the lobby area and when we arrived, tired after a long flight, it was like a slap in the face, with a lot of bustle and people around it and a jarring colour scheme - orange, lime green and white, not exactly a relaxing experience! The cubicles in the lobby all have their own TVs, adding to the noise. Overall, it destroys the ambience we used to enjoy. On the plus side, it does mean food can be obtained across wider hours and the staff were very pleasant .", "Date": "September 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Central Virginia", "Title": "“Friendly staff, updated common areas.”", "Author": "vamaddog", "ReviewID": "UR71427546", "Content": "Stayed here one night after getting bumped from a flight. As a Marriott Platinum member they were considerate enough to upgrade me to a King Suite. Bed and pillows were very comfortable, room was quiet but there was some airport noise as is typical with close in properties. I had breakfast at the lobby restaurant and it was very good. Service was prompt and courteous. Morning staff were a lot friendlier than the late night crew but they were all courteous. Pool was very nice as was the hot tub. Fitness room was small but in good condition. Free wireless was nice. I would stay here again.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Providence, NJ", "Title": "“Surprisingly Good Place”", "Author": "TallJim", "ReviewID": "UR62430580", "Content": "We stayed here the night before our 7am flight. This hotel was a great value - $89 per room. Place had a great pool and a nice firepit adjacent to pool. Very friendly service. At night, our kids swam and my wife and I had a drink at firepit. For a place where we only came to sleep , it was a gem.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Excellent staff, updated lobby and close to airport”", "Author": "AJ2", "ReviewID": "UR46585665", "Content": "I love this Courtyard Marriott (as compared to another large chain hotel nearby) for several reasons. The staff is always friendly, including the airport shuttle drivers! The lobby has recently been redone and has about 6 public computers - 2 specifically for printing out boarding passes and other directions. They also have a nice little restaurant in the lobby for a quick bite. The grounds as well as the interior of the building is always impeccibly clean. The workout room is small but clean, always has towels, water, working TVs and great air conditioners! I highly recommend it if you need to be near the airport. And it's so nice that they include WiFi in the cost of the room! The only downside of the hotel is the location - it's not very close to Mill Ave in Tempe where there are lots of great restaurants and bars.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "California, Maryland", "Title": "“Typical Courtyard Hotel--Excellent”", "Author": "Fixo", "ReviewID": "UR38202077", "Content": "I actually thought the front desk staff was professional, but not as friendly as a weary traveller would expect. The printers in business center was not working. The Pool, Spa and Gym were all well equipped, clean and comfortable--especially the pool. Nice place--going to return next week. Not much in the immediate vicinity, but you are five minutes from the ASU Campus which has a number of great restaurants and great college town atmosphere...", "Date": "August 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "CA", "Title": "“Decent room but that's about it”", "Author": "CrazyinCA", "ReviewID": "UR19674409", "Content": "Stumbled onto this hotel after trying to find something close to the airport. There is no restaurant/lounge on premises but next door at the Hilton they have a great restaurant and bar with TV's. Other than that there is a delivery restaurant. Nothing else seems too close but I didn't want to drive anyway! Bed was really nice and comfy. Coffee and great tasting ice cold water available in lobby all day. Breakfast was not included and seemed pricey so I skipped it. Very convenient drive to airport.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Great front desk staff”", "Author": "Maribeth", "ReviewID": "UR8489686", "Content": "Juan greeted us at the front desk at 8 p/m and was very accommodating with directions to several hamburger joints \"out West\" that my 17 year old son wanted to try. Juan and his co-worker were not able, on a sold out night, to give us two adjoining rooms (necessary with our two teenagers!), so they allowed us to cancel one of the rooms, even though it was past the cancellation deadline. Great service, clean room, good value, delicious breakfast. A little hard to find from the airport, but I did it!", "Date": "August 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Garrison, NY", "Title": "“Very comfortable business hotel”", "Author": "Bandlady", "ReviewID": "UR8396259", "Content": "We stayed at this Courtyard due to its proximity to the airport. The room was large, comfortable, and spotless. Everything was of very high quality. Good business area downstairs to print our boarding passes. Many good restaurants a mile or so down the street. We did not eat breakfast due to our early flight. Overall, a very short but pleasant experience!", "Date": "August 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glastonbury, Connecticut", "Title": "“Nice place at a good price”", "Author": "nwb", "ReviewID": "UR8364386", "Content": "A very nice property with a very accomodating staff. Beds were very comfortable and the breakfast was good. We had purchased the summer special that included breakfast. We arrived rather late and the staff directed us next door to a Hilton where the bar was still open for food service.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Quiet Retreat during Travels”", "Author": "Pennystinker1", "ReviewID": "UR7838237", "Content": "I booked this hotel as we were flying in to Phoenix very late at night and wanted a fresh start early n the morning to head to Sedona and then the Grand Canyon. The free shuttle was very convenient from the airport to the hotel (I don't know why I thought I could walk to it from the airport?). The room was clean, they had a lovely pool and patio where I had some coffee before setting out at 6am. I left too early to have any breakfast there so I can't comment on that. The price was reasonable and I didn't notice any airport noise at all. I would stay there again.", "Date": "June 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "California", "Title": "“Good value, decent quality”", "Author": "finickytripper", "ReviewID": "UR6184630", "Content": "I stay at Courtyards fairly often for consistent quality at a fair price, and this location was no exception. For a very nice $79 weekend rate, we got a clean, quiet, business-class room with a comfortable bed with crisp new linens and new furnishings that included an impressive desk space. A professional reception staff provided crisp service with mixed friendliness. The airport shuttle service was not only handy, but ran more often and on-time that other such shuttles I've taken. One driver apologized for being only five minutes late. Some nitpicks: The staff recommended a shuttle time that barely gave us time to catch our plane; use your own judgment on when to leave. Courtyard has spent lots of money on upgrades to cater to business professionals, with such amenities as a nice free business center in the lobby. However, this location is a little average on the fundamentals, with the somewhat sickly lit shower rooms, substandard toilet paper and towels, and hasn't yet put in the curved shower curtain rod that most hotels are now offering. Courtyard also expects that you pay for your breakfast, while others in the price range offer at least a basic continental for free. When I asked the staff if they could print my boarding passes, I was directed to the new business center, where a gentleman surfing lingerie models told me he needed significantly more time on the only computer. The 1-mile radius around the hotel can be sketchy in places. We were approached and asked for money by two men in a dimly lit parking lot at a hotel-recommended restaurant nearby. If you miss the road to the freeway in the other direction, you'll find yourself amid several gentlemen's clubs in another dimly lit neighborhood.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Safford, AZ", "Title": "“Fantastic!”", "Author": "JosieAZ", "ReviewID": "UR5813563", "Content": "Marriott is the one chain we didn't have a frequent guest card for. We stayed there because we were meeting friends who had a room booked there. We'll definitely go back. It's convenient to the airport (which was our friends' concern), and it offers a shuttle to a local mall. We were happy with the price, the rooms were spacious and comfortable, and the pool/hot tub area was really pretty. They didn't offer a continental breakfast, which was the one negative, but overall, we were very happy and we'll stay there again.", "Date": "September 18, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Midland, TX", "Title": "“A very nice stay”", "Author": "GingerandGilligan", "ReviewID": "UR3997553", "Content": "We booked this hotel through Priceline, and were treated very, very well. We soon found that our toilet wasn't working right, and within ten minutes the chief of maintenance had looked at it, decided he'd rather have us in another room, brought two keycards for the bigger room across the hall, and gave us passes to breakfast in the morning. The staff was terriffic and the hotel was lovely.", "Date": "October 6, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Windsor, Ontario", "Title": "“Best Bet - Courtyard Phoenix Airport”", "Author": "A TripAdvisor Member", "ReviewID": "UR3266112", "Content": "This hotel was perfect. The staff went out of their way to accomidate all that was asked. The beds were very comfortable. The outdoor pool and whirlpool were exceptionally clean. The shuttle service was very convienient and speedy. Next time I visit Phoenix I'll definately be staying here again. P.S. - don't forget to ask for a room with a balcony !!!", "Date": "March 11, 2005"}], "HotelInfo": {"Name": "Courtyard by Marriott Phoenix Airport", "HotelURL": "/ShowUserReviews-g31310-d74590-Reviews-Courtyard_by_Marriott_Phoenix_Airport-Phoenix_Arizona.html", "Price": "$101 - $214*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2621 South 47th Street</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85034</span></span> </span></span></address>", "HotelID": "74590", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9e/aa/9eaa9d873cac7e39ab94ec797954fd916large.jpg"}}