{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Gatos, California", "Title": "“Beautiful setting, clean, convenient”", "Author": "Natalie H", "ReviewID": "UR128027809", "Content": "The setting is lovely. My room was on the second floor facing the pool and had a balcony with a chair and table. From my balcony I had a view of the mountains. Room was very nice, standard for what I expect from Marriott. Housekeeping was especially early (rather than tardy like some hotels) and cheerful. Location is fantastic...I walked to do my shopping and dining. My only complaint had to do not with the hotel, but with the thoughtless guests above me who carried on a boisterous conversation at 2:30 a.m. I finally called the front desk; the staff shut them down within 5 minutes.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "virginia", "Title": "“Loud and Odd”", "Author": "vacationx2", "ReviewID": "UR127271717", "Content": "We stayed here for a girls weekend in Phoenix. The double suite with the pull out sofa was perfect for the three of us. It was a simply appointed room, very minimalistic, and clean. Two beds in a separate bedroom, small bathroom, living room area, and a tiny balcony. There was a refrigerator and a microwave in the living area, but no sink, and just two glasses. The room was just near the elevator, but apparently all of the suites were. All rooms overlook the pool as well. It is a nice garden area with a good pool, but it is surrounded by hotel, so all the sound is amplified. And the pool opens at 0600, and plenty of parents let their children run screaming to the pool at 0601. So don't stay here if you are looking for peaceful. The walls are very thin, and I am pretty sure we heard every noise coming out of our neighbors. The coffee maker in the room is awful... so they offer free coffee in the lobby, but it is not always full. Since they charge you for Starbucks just across the lobby, I figure they lure you to the lobby with the offer of free coffee, but figure you will drop the two dollars if it is empty and pay. It worked... anything was better than the room coffee. There is a small yogurt shop in the adjacent shopping center... it was very good! Parking was easy, but the entire place is behind a shopping center, and off the road... it is just an odd layout with the location, pool, and coffee.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great for a quick stop”", "Author": "Wynchesster", "ReviewID": "UR127070699", "Content": "I was in Phoenix for a week on business, and I wanted to stay the weekend on my own dime to explore and do some hiking. When work was over I moved to this hotel for the weekend. I'm a loyal Marriott patron collecting my points and occasionally getting those free nights when I travel. For me, this place was a perfect fit. The location was good as it was close to Camelback mountain, which was a great hike. The hotel itself is perfect. The rooms are nice and clean and well decorated. The pool in the courtyard is well maintained with lots of chairs and a towel service. There are nice cushioned seating areas in and around the pool that are shaded. Those are great places to have a drink, do some reading and stay out of that hot sun. Just by chance, there is an LA Fitness right next door, and I do mean right next door. I just happen to be a member so this was a fantastic bonus for me. The only gripe, and it has been repeated before, is that they still do not have wi-fi access in the rooms. Wired access only for your laptop, but that renders my wi-fi only iPad useless. They have wifi in the lobby and common areas. The signal was weak out by the pool and came and went which was annoying. But this is still minor. There are a ton of restaurants of all classes close by, and you have fast access to the highways to get where you want to go.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Strictly Business of the Spartan Kind”", "Author": "terrla", "ReviewID": "UR126642600", "Content": "I chose this hotel because of the location, close to Scottsdale and in the Camelback Corridor. For a quoted price of $299 per night my expectations were pretty high. What a letdown. Upon arrival we were directed to a room with one window and no terrace or opening to the outside. It was quite small. When I asked to see something else they did find a room opening to the pool area. This was pretty nice, however, the room was strangely lacking in amenities. No lotion, 2 thin bath towels, and no suitcase stand. As a result we had to work out of the suitcases on the floor. This is not a leisure hotel. Also after we loaded up the car and went back to use the bathroom,, the cleaner was already in there, we were gone no more than 3 minutes and hadn't even checked out! The spartan amenities put it on par with a Super 8. I will never revisit a Courtyard again.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix", "Title": "“Perfect for our overnight stay”", "Author": "Shanon J", "ReviewID": "UR123612953", "Content": "We had to attend a birthday dinner near the property and it was perfect for what we needed. The entrance was a little awkward coming in off of Camelback, but the guy at checkin was really nice and helpful. The beds were SO comforable that we are thinking of purchasing one from Marriott. The room was very small, but we were only in the room for a few hours. The lobby looked great and very modern.", "Date": "January 25, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "menlo park", "Title": "“No more wifi is a deal breaker”", "Author": "mac k", "ReviewID": "UR122160511", "Content": "I've stayed here several times over the years, and loved it. But for some reason, the place does not have WiFi in rooms anymore. I checked out early. Too bad. It used to be a great hotel. Now, it's a waste of money.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colorado", "Title": "“Don't let the construction out front fool you...great stay”", "Author": "happytrvlrColorado", "ReviewID": "UR121964682", "Content": "This hotel is in a great location. Very easy on and off to the highways. There is a construction area in the front of the hotel but the renovations to the hotel itself are complete. Our room faced the back and we heard no construction noise at all. You could tell that it has just recently been redone. Everything from carpet to furnishings was very new. Just behind the hotel is a strip mall (Town and Country) with a Trader Joe's and it's very convenient to walk over to buy some fruit for breakfast etc. A great secondhand clothing store called My Sister's Closet is there as well. Approximately 3 tenths of a mile from the hotel is a McCormick and Schmick's restaurant with a great happy hour menu. Food prices start at $1.95 and I had a hamburger with fries for only $2.95 and it was very good. The pool area has a hot tub and was nice although due to the surrounding buildings and trees it doesn't get as much sun as I would like. This is a nice Courtyard in a great location and I would definitely stay here again.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Friend, Nebraska", "Title": "“I wouldn't stay here again!”", "Author": "Frogpondqueen", "ReviewID": "UR120462677", "Content": "The best way to describe this hotel is, you can dress up a 90 year old woman with make-up and new clothes, and try to make her look 30, but she still is a 90 year old woman! The hotel has been renovated, but the rooms still are outdated by their layout. You have to close the bathroom door in order to use the restroom, and the toliet paper holder is right in your lap. The rooms are very noisy as you can hear everything in everyone elses room. I have stayed at many Courtyards and this one ranks among the worst!", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Monteverde, Costa Rica", "Title": "“Typical Courtyard with great location.”", "Author": "supaihiker", "ReviewID": "UR119141676", "Content": "A typical Marriott hotel. Almost all Courtyards have the same room setup and same amenities. Expect soft comfartable beds and a good room layout. This Courtyard is located along the east Camelback/Biltmore district. Close to the Biltmore Fashion park, great places to eat, and close to the 51 freeway. The hotel is undergoing a renovation at the moment. It appears that outside the hotel is also undergoing a large renovation. The northeast side of the Town and Country shopping center is being torn down and the boarded up Mexican place and recently torn down steak house and being flattened for some type of new construction. Be aware that these projects appear to be just starting as of October 2011 and will be ongoing. They are immediately adjacent to the Marriott so expect noise and congestion with the ongoing construction.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northridge, CA", "Title": "“Newly renovated rooms & great location”", "Author": "bluefaery", "ReviewID": "UR118911657", "Content": "I just stayed here 2 nights and was quite pleased with the hotel. They are in the middle of renovating and I received a newly renovated room. The bed was very comfortable. The staff was friendly and it is in a great and safe location. I used to live down the street from here so I was very familiar with the area but for those that aren't it's a great spot. It's near the Biltmore mall, has a Trader Joes, Fry's grocery store, multiple restaurants nearby and is close to freeway access. I would recommend this hotel for a trip to Phoenix and would stay here again.", "Date": "October 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Very nice quiet hotel”", "Author": "skeletoncrew", "ReviewID": "UR116436669", "Content": "We arrived around 9pm, hotel was almost empty, check in was fast, we got room on the 2nd floor facing the pool, king bed and a sofa bed. Staff is friendly and polite. Very clean room, clean bathroom, we had mini fridge in the room. Pool is open till 11pm which was great as it was 43C outside. Accross the street from a hotel there is a bookstore with great deals on new and used books, check it out.", "Date": "August 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice place but walls not soundproof and no wifi”", "Author": "cardbrat", "ReviewID": "UR101657906", "Content": "Very nice room. Quite clean. Rates good. Free parking. Only downside would be that I could hear people in next room. I could actually make out the words in the conversation! The people weren't that loud either. Wouldn't want to be beside anyone partying or someone with a deep voice.....Oh and there was no wifi in the room - only in the lobby.! For the room, you have to physically plug into the ethernet cable.. Had to buy a special attachment for my ipad ($30).", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burtrum, Minnesota", "Title": "“Location, location, location!”", "Author": "freespirit74", "ReviewID": "UR91857115", "Content": "I stayed at this hotel several times between July-November 2010. I lived in Arizona for several years prior to my business travels there so I was familiar with this hotel's location. I don't particularly enjoy being in downtown Phoenix so I prefer this location, it is just a couple of blocks from 24th Street and Camelback, known as the Biltmore area. You can find all sorts of shops, restaurants, and things to do in the area (movies, hiking, etc). The hotel itself is also in the same complex as a Trader Joe's and a few other restaurants, and it is right next to a Bookstar bookstore (a division of Barnes and Nobles), so you are definitely not without variety or convenient access to places and activities. If you do have a rental car for other distant travels, the hotel is located right off the 51, so it is very easy to get on to and off the freeway without worries of getting lost or turned around. As for the hotel itself, it is clean and quiet and simple. They do have mini fridges in the rooms, but on my last trip there there was not a fridge in the room. I was told they are not always in the rooms but are available upon request (no extra charge) and they brought me one immediately. I didn't have any issues with outside noise and slept comfortably. The staff is friendly and helpful and very responsive to questions and requests. They have reasonable rates as well, which is important for repeat trips.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "seattle, wa", "Title": "“Ok, but pricey for what you get”", "Author": "tinadam", "ReviewID": "UR66542850", "Content": "Stayed three nights recently while on a business trip. The hotel is tucked away in a pretty nice shopping center. There are plenty of good eating and shopping options within walking distance, and the neighborhood is pretty good, safe for walking around even at night. 30 min walk to the Biltmore complex, where I had a convention event-- a really nice and pretty walk, even at 100 degrees. If I had to guess, I'd guess the hotel was built in the late 1980s, early 1990s-- that's kind of the decor and feel I got from the place. Staff were quite friendly, and I had a good sleep, free internet worked great. The only real issues I had have to do with value. I paid around $120 per night, for which I expect quite a lot. In the room, I was disappointed to find no mini-fridge. Isn't that pretty standard nowadays? The other thing was breakfast. Do they offer complimentary continental breakfast? Staff were wishy washy on that topic when I asked (\"we have a restaurant which opens at 6:30\" was the response I got), so i assumed they don't. I don't want to sound like a cheapskate (even if I am one), so make it clear. In any event, for $120 a night, they should. Would I stay here again? I guess I would, but not before investigating other options in the area.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey, Canada", "Title": "“Nicest Courtyard yet.....”", "Author": "Son_of_a_Sailor_51", "ReviewID": "UR64990322", "Content": "Walking distance to restaurants, shopping etc. Great courtyard pool area, with whirlpool, and couches, lounge chairs, lots of shade (if you prefer). Room was clean and efficient, and staff friendly and helpful. Lobby areas, hallways, etc were clean and eye-pleasing. Did not partake in breakfast, so no comment on that, but the coffee was good. Stayed at several other Courtyards, and this one is the best so far.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Good for a quick trip”", "Author": "santabarbaraserenity", "ReviewID": "UR62114425", "Content": "If you are looking for an inexpensive hotel and you do not plan on availing yourself of amenities like free breakfast or dinner, then this is the spot. Very convenient to the central corridor of Phoenix and various restaurants, this simple \"no frills\" hotel is perfect. Nice staff, comfortable rooms and beds, nice pool area and spa all make this hotel a great value for under $90. If you are going to spend more than that or need a suite, look around because there are better deals at nicer properties. If you are simply looking for a place to sleep, this fits the bill perfectly and you will not be disappointed at all.", "Date": "April 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "California", "Title": "“Nice and comfortable!”", "Author": "BiotechCalifornia", "ReviewID": "UR59466543", "Content": "It is off season and the room was very fairly priced. The grounds are nice, the pool looked nice. We were there to visit a family member. The rooms at all the COurtyards are the same in my travels. SO you get what you expect. HDTV, Nice bed, Desk, clean room. Above average and perfectly fine. The hotel is near a nice shopping center that offers everything from Hair Salons, Dining, Markets-- very convenient.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "nevada", "Title": "“no frills business stop”", "Author": "sikat2009", "ReviewID": "UR35208799", "Content": "good location - healthclub and bookstore next door.next to a strip mall of sorts with coffee shops and quick bites to eat near the biltmore shopping area (high end) relatively safe for Phoenix rooms - adequate.mattressess need upgrading flat screen tv's don't exist here;free internet this is a no frills business hotel,so expectations are just that,but it does an adequate job staff helpful and great", "Date": "July 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco, CA", "Title": "“A good, central location in the sprawl of Phoenix”", "Author": "JetSetKen", "ReviewID": "UR32634050", "Content": "This hotel is great and situated in an ideal location near the Biltmore Fashion Park, the Camelback Colonnade and Town and Country Shopping Center. This is the perfect spot if you are either a casual traveler or business traveler because of the price and location. The service was great and the rooms are well kept. It's located inside the same area of the Town Country Shopping Center so it makes it convenient to any guest at the hotel. They even have a business center with free/included internet access, which came in very handy for me. There's a large pool in the main courtyard and a jacuzzi as well.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Very nice, basic hotel, Great Location!”", "Author": "ep8738", "ReviewID": "UR24226120", "Content": "I stayed here 3 nights in January 2009 using my Marriott Reward Points. Check in was very easy and the front desk staff was very friendly. The location is great (Biltmore area). One block away from the Biltmore Fashion Square Mall, a few blocks away from many restaurants (Houstons, Ruth's Chris Steakhouse, Cheesecake Factory, Black Angus in the same parking lot). Tons of free parking in front of the hotel and a large 2 story free parking garage located behind the hotel. This isn't a fancy resort like most hotels in Phoenix/Scottsdale area, but it was very nice, basic and clean. Swimming pool is heated and the jacuzzi was nice.", "Date": "February 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“What a very nice surprise...”", "Author": "Dorsalfin", "ReviewID": "UR20816294", "Content": "I was responsible for setting up a last minute conference in Phoenix with senior management of my firm. The Biltmore was booked as were a number of other hotels in that area. (I did not know Phoenix and wanted to be within a few blocks of the office complex in which the conference was held). About 10 of my co-workers were going, and upon review of the Trip Advisor reviews I booked us all in here and held my breath. (We're from NY and some of the folks who went are \"beyond picky.\") The whole experience from check in to check out could not have been better. The staff was amazing, right down to the fresh chocolate chip cookies in the evening. They even set us up to have an impromptu conference around the pool side with coffee and snacks at 5am (being from the East Coast and only there for 3 days we did not even try to acclimate ourselves to the time difference). I could not speak more highly of the accommodations and staff. The rooms were immaculate, the poolside area very relaxing. We all left agreeing that if there was any reason to go on vacation to Phoenix (which I really don't think there is) the Courtyard Marriott at Camelback would be a fine place to stay. Two thumbs up.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Hidden gem”", "Author": "ChicagoBeachguy", "ReviewID": "UR16548905", "Content": "So surprising. I expected little on this one night stay before returning from a five day vacation in Sedona. Room was below $90 but had a terrific bed, updated room, great pool, nice grounds, excellent service, and very accommodating in checking me in early and allowing a late check out. I called once from my room since there were no towels at the pool and within 5 minutes, someone deliverded them. That's service! Great location about 10 minutes from a mall with many great diningoptions. 15-20 minutes from Scottsdale mall - very upscale and dowtown Scottsdale. Highly recommended.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Nice Little Tidy Hotel - Somewhat No Frills Rooms”", "Author": "wwills", "ReviewID": "UR15518587", "Content": "Stayed at the Camelback Courtyard on Business. Overall, the hotel is very nice. Very clean and nice lobby, with breakfast (not free) in the morning - and free coffee to go. Pool, simple workout room. It's just down the road from the Camelback mountain, a mountain that really does look like a camel lying down. Pretty scenic as you have a clear view of it down the road. The actual rooms are fairly simple. I attached some pictures. There's a desk, a place to hang your clothes, a small couch with a table. Nothing overly exciting - pretty standard. But it's all very clean. Some rooms have balconies, other's don't. The staff is friendly and attentive. It has free Internet - wired in the rooms, wireless in the lobby. There's a small snack area in the lobby. There are ice machines on each floor, but no drink machines. The best thing about the hotel is that it's very near a mall (walking distance) with shops and restaurants, a bookstore, a Chili's, etc. And it's within about 2 miles of a trendy mall-like area with upscale eateries and department stores. Just a block or so down the road is a new AMC movie theatre with an upscale fish restaurant (McCormick's and Schmick's). The rooms are quiet with easy access. There is covered mall parking (free) next door to keep your car out of the hot sun. I would recommend it as a nice place to stay in Tucson on business or for short vacations. Related: Traffic in Phoenix is terrible. It's not that there's congestion, but that there are many, many traffic lights on all of the streets and avenues - and they are not in synch. You literally miss every single light. A drive of 5 miles takes 20 minutes. Be prepared for a slow traversal of the city.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Excellent”", "Author": "leex", "ReviewID": "UR8111756", "Content": "Stayed here on business in July 99. Very nice hotel with great facilites. Nice outside pool area. Had a suite with seperate living area. Food was good - buffet breakfast. Staff were very polite. Location was also good. Was adjacent to a shopping centre and some other restaurants. Would definitely go back.", "Date": "July 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Very Nice Experience”", "Author": "Pamaha", "ReviewID": "UR7545696", "Content": "Stayed for one night for a business trip. The staff was very helpful and friendly. The room was clean and fresh and the bed comfortable. I had a suite with a king bed - and it was very roomy. My only problem was my internet connection didn't work (free access). I'm sure I could have called someone for help - but it wasn't an emergency for me at the time. The breakfast buffet was very good and the wait staff excellent. It is in a retail center, across the parking lot (a few strides away) is a nice Greek restaurant. There is no restaurant on premise (to keep costs down) but they still have room service through a 3rd party. Amenities are limited - a bar of soap and shampoo only (again, cost cutter) but you can ask the front desk for toiletries that they will provide for free. All in all, a very good product and I would definately stay here again when in Phoenix.", "Date": "May 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Laguna Niguel, Ca.", "Title": "“It Is What It Is, a Business Persons Hotel”", "Author": "sorgan", "ReviewID": "UR5503619", "Content": "Pros: Very Comfortable King Size Beds New contemporary room fixtures Free coffee pot and coffee/tea service in room Away from the main street so noise is minimal Walking distance to small shops and restaurants in Town and Country outdoor mall Chain restaurants close by. Black Angus and Chilis. Comforatable lobby with Wired internet access and shared printer Free USA Today Newspaper delivered to room each morning Various breakfast options available - for a price Free coffee in lobby 24 hrs Wired Free Internet access in room Cons: Noisy box air conditioners Not much to do if you don't want to watch TV in the lobby or hangout by the pool Priceier then most business hotels in area No complimentary breakfast - local restaurants don't open til late morning Wired Internet access only, no WI-FI available in whole Hotel or conference rooms Minor Peeve - TV changer was slow and you could not go directly to TV channel. You have to scroll through each channel until you get to desired station. I've stayed at better, I've stayed at worst. This hotel met my objectives, since I was at a week long conference at the same location. Recommended for buisness, but not for weekend getaway or family fun trip.", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "2"}, "AuthorLocation": "San Francisco", "Title": "“Overpriced”", "Author": "A TripAdvisor Member", "ReviewID": "UR4358827", "Content": "This Marriot pertains to be recently remodeled, however: -- the shower diverter valve leaked -- the tub wouldn't drain with the plug in the upright position The prices are indicative of suites and the rooms are small. They could not provide me with a receipt on checkout and promised to FAX one by Monday -- today is Tuesday and still no receipt. They charge $10.51 for breakfast that is rather poor even though the room rates are high -- it should be free. Loacation is very good -- close to many good restaurants and the Biltmore Shopping Center", "Date": "January 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "minnesota", "Title": "“great location--walk to anything you need”", "Author": "dmotl", "ReviewID": "UR4156430", "Content": "They had just finished extensive remodeling when we arrived. We had a room on main floor just off pool. Pool and hot tub were good. Free coffee was good. Within two or less blocks. Numerous good places to eat with cheap happy hour snacks and drinks. Grocery store, public library with free internet accesss. Numerous specialty stores including Trader Jacks, a high end used clothing shop,ethnic cafes. We had a rental car but never used it. Disappointment was the small room. $10 breakfast buffet was overpriced for the offerings. Dan and Ginny", "Date": "December 1, 2005"}], "HotelInfo": {"Name": "Courtyard by Marriott Phoenix Camelback", "HotelURL": "/ShowUserReviews-g31310-d74826-Reviews-Courtyard_by_Marriott_Phoenix_Camelback-Phoenix_Arizona.html", "Price": "$90 - $204*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2101 East Camelback Road</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85016</span></span> </span></span></address>", "HotelID": "74826", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d8/e2/d8e2d079c9c71a28a309ba1746267e476large.jpg"}}