{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Summerfield, Florida, United States", "Title": "“Great Hotel”", "Author": "John L", "ReviewID": "UR140003010", "Content": "Great hotel and a great price. The room was very clean and the staff was very friendly. Super location right on the beach and great location for near by restaurants. Will stay there again later this year. For people that live in Florida this is a short drive from Ocala or Orlando and is a great weekend get away spot.", "Date": "September 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great little hotel”", "Author": "Bethcjax", "ReviewID": "UR139528116", "Content": "Perfect location right on the beach. Staff was very friendly and helpful. The room was clean and had a little fridge and microwave. We will be staying there again. Prices are very reasonable and there are restaurants and gift shops all with in walking distance.", "Date": "September 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greenfield, Massachusetts", "Title": "“Great small Inn”", "Author": "Frank D", "ReviewID": "UR139254181", "Content": "Very quiet clean room with a beautiful view of the ocean. The room had a very comfortable king size bed. A 2 person hot tub and a nice balcony. You could see the ocean from the bed and the hot tub, nice! All this for $79.00 a night! Would stay there again.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Got the job done! :)”", "Author": "katrinawaller", "ReviewID": "UR139147881", "Content": "The location was perfect!! The pool was basically ON the beach. The ramp for car access was right next to the inn. We had a courtside view room and it was quite smaller than I was expecting but we didn't come for the room. The one thing we were most disappointed about was the bed. It was extremely hard. But the beach totally made it easier to deal with! :)", "Date": "September 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Casselberry, Florida", "Title": "“Somewhere In \"Time\"”", "Author": "Bill C", "ReviewID": "UR138685055", "Content": "It brought me back to my childhood vacations when these were the hotels of the times. Privately owned, very tropical, clean rooms with the little amenities such as the small individual soap bars and bottles of shampoo. The hotel staff was very friendly and most accomodating. Pool area has a very beautiful setting and plenty of lounge chairs. Very quaint and quiet. Loved the many varieties of hibuscus throughout the hotel grounds.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Green Bay, Wisconsin, United States", "Title": "“Don't be fooled.”", "Author": "Jim F", "ReviewID": "UR138609998", "Content": "Don't believe the hype, just because it was on Hotel Impossible. There is still allot of work that needs to be done to the rooms and property. My wife and I were going to stay two nights. We only lasted one. Room was dirty, smelled like insecticide and not ready when we got there. Woke up to a cockroach in the morning. The only positive was, we were given our money back. I guess the insecticide didn't work. There are better hotels in the area. Too many other things to list.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Perfect”", "Author": "Don R", "ReviewID": "UR138609997", "Content": "I was looking for a small time mom and pop type motel and I found it, with its original retro tile in the bathroom to its updated fixtures in keeping with the retro style This facility had well kept rooms every thing was clean and nicely staged. The outside is well landscaped and taken care of. The pool was a little dirty but understandable with the storms that came through. The staff was very helpful and accommodating letting us book in early. I would recommend this to anyone looking for a great motel experience this will help jog the memories of the past. But with all the modern conveniences of course.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Perfect”", "Author": "John M", "ReviewID": "UR137632194", "Content": "Just what we were looking for. Very nice old style beach motel. Very clean and well kept. Pool area is right on the beach and well landscaped. The rates are very reasonable. When I booked the room, there were no ocean view rooms available. When checking in, I asked if one had opened up.. I figured what the heck, right? They had one and put us in that one. I was more than willing to pay for the upgrade, but they didn't ask for a single penny more. Try getting treatment like that at a big hotel. I live only an hour north and it's great to know I've found a perfect place to escape to. I'll be back for sure. Oh, older motel doesn't mean they're behind the times: free WiFi", "Date": "August 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Savannah, GA", "Title": "“Hope the new look is maintained”", "Author": "Newseniors", "ReviewID": "UR137126629", "Content": "Enjoyed our stay at Dream Inn in August of 2012. Nice weekend with new look at the poolside and pleasant color scheme. Room was very clean upon arrival. Arrived late and manager had key available to us in a safe. Beach chairs provided which was nice. House keeper was overworked so rooms cleaned in the afternoon rather than mornings. Hope management can maintain the new, clean look after recent renovation. Trash cans around pool should be emptied daily and flowers needed daily care in the extreme heat. A sign on front of building with street exposure would be a plus! Would stay here again if it is kept at the level the renovation provided.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Lancaster, Kentucky", "Title": "“Lovely, friendly, old style Florida hotel”", "Author": "jdrdhd", "ReviewID": "UR136781354", "Content": "I was down at your place, for bike week, March 2012. We really enjoyed our stay! Steve, who worked the front desk, as well as everywhere else, was a super nice guy! But, he seemed spread a bit thin. My only negatives, were the carpeting and the clingy type blankets. But I would stay here again! We really enjoyed our stay. I saw a special, about the property being updated, and, even though I wouldve been back anyway, I hope my next stay, to give it an all 5 stars! Ps: The bright yellow was how we picked it out of the crowd of the gazillion pastel colored hotels, when we were looking for it, as we rolled down the beachfront road! lol. But the blue is ok. Not too worried about color, as long as the place is clean and friendly! :)", "Date": "August 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Savannah, GA", "Title": "“A Precious Little Gem”", "Author": "garedsoxfan", "ReviewID": "UR136471781", "Content": "I stayed at the Dream Inn in Aug 2012. We were greeted at the desk by a very friendly young woman. She was very helpful and wanted to make sure that we would have a nice stay. Before we got to our room, we were amazed at the beauty of the garden area of the hotel. We stayed in a Courtyard room. We entered the room and found a room that found a room that was charming. It was very clean and comfortable. You get a little sitting area in front of your room that allows you to enjoy their garden area. The room contained a refrigerator, microwave and a coffee maker. The bed was comfortable to sleep in. The area was very quiet at night, which made it nice to enjoy the garden area in the evening. The pool was very enjoyable. They keep it heated all year, which makes it very comfortable to get in. It also makes it nice for an early morning swim! The chairs around the pool make it comfortable to sit around the pool and relax. Being on the ocean, you are steps away from the Beach to be and to be able to enjoy the amenities of the beach right outside your hotel, without having to pay the rates for being on the ocean. We will definitely stay at the Dream Inn again.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent location, steps from the beach.”", "Author": "greeneyesjax", "ReviewID": "UR136437799", "Content": "Steps from beach. Beautifully landscaped courtyards. Rooms large and clean, with comfortable bedding. Plenty of restaurants with in walking distance. Throughly enjoyed our stay here. Pool has comfortable cabanas, tiki tables, and lounge chairs. Grills also available. Friendly staff!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great place for a family on a budget with kids!”", "Author": "mmbm31", "ReviewID": "UR135775617", "Content": "We were twelve steps from the beach with an ocean front room in a cute little beach style mom & pop hotel! If you want to be waited on & eat continental breakfast & swim with hundreds of other people stay some where else. If you want quiet, relaxing, peace & convenience to the beach stay here! We got a room with a full kitchen, so we brought our own food & saved a bundle. The pool is small & cute. Never crowded, overlooks the ocean! We will be back next year!", "Date": "July 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“A hidden jewel?”", "Author": "Rob S", "ReviewID": "UR135657013", "Content": "It looks very unassuming when you drive by but I think my family just found the place we will return to every time we visit Daytona. We had a rotten first night at a hotel in Ormond Beach and this place saved our trip! The only negative was spotty WiFi service but that was very minor compared to the value we received! Helpful staff works hard all day on the grounds!", "Date": "July 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "orange park, fl", "Title": "“family time”", "Author": "cheryl h", "ReviewID": "UR135648308", "Content": "My husband and I went down to the hotel with our grandson, and we had a great time. It was close to the boardwalk, putt-putt, beach, and even a place for turtles to recovery near the lighthouse. My daughter and her husband went down a few weeks after we had, and they had a great room to look out at the beach. The staff is so nice, the place is not too expensive, but it is very comfortable. We all had a great time and I'm trying to plan another weekend get away before school starts. The pier is close and this hotel is now on our list of places to go and share with the family.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gainesville, Florida", "Title": "“Small, charming, clean, excellent location”", "Author": "Cathleen B", "ReviewID": "UR135233677", "Content": "My husband and I were looking for a smaller, charming, family owned hotel in the Daytona Beach Shores area. Normally we stay at the much larger Hilton or Ocean Walk Resort area but wanted a change. The Dream Inn is a cute little property, with a lovely landscaping and very nice clean pool right on the beach. Our room was clean. And for the price, exactly what we expected. But the air conditioner in room 131 was so loud that we couldn't sleep, at all. I suspect that other rooms may have different air conditioners, or maybe this one just needs servicing. In the hotels defense, we did not complain and give them a chance to fix it, since we were only staying one night. But we wouldn't be able to book this hotel again without knowing that the other rooms are quieter. All of the staff we were in contact with checking in and out were pleasant and efficient. Because the ONLY complaint we had at all is the air conditioner noise, I'm giving this hotel a Very Good rating. Because in fact, it is very good with the exception of the air conditioner.", "Date": "July 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Looking Forward To Our Next Stay”", "Author": "Austin S", "ReviewID": "UR135022050", "Content": "My wife and I decided to visit Daytona for a much needed romantic getaway. At check in we were greeted by a nice young lady who had just recently moved to Daytona. She was very pleasant and helpful in offering recommendations for dinning later that evening. We were very impressed when we opened the door to our room. We had a great view of the ocean. Every part of the room was extremely clean. I loved the in room hot tub and my lovely wife and I enjoyed wine and the view while using it. We had called the front desk to request more towels and the friendly young lady at the desk was knocking on my door shortly after hanging up the phone, now that's service. They are eager to please and want you to make their motel your home away from home. I am looking forward to staying here again whenever I visit Daytona. Thanks Dream Inn staff for making our stay and are getaway a warm and memorable one.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "florida", "Title": "“Great place!”", "Author": "shelbys96", "ReviewID": "UR135000314", "Content": "My husband and I stayed in the jacuzzi/oceanfront room for a one night stay. The room was wonderful! It overlooked the pool and had a great oceanfront view. The motel pool was exceptional-it was very large and the perfect temperature! Our room was clean and very spacious. My only complaint was that we couldn't hear the ocean when our AC unit was on (it was very hot, so our AC was on continuously!).", "Date": "July 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Live Oak, Florida", "Title": "“Ann Marie”", "Author": "Ann Marie B", "ReviewID": "UR134522165", "Content": "This place is wonderful !!!!! ...its clean, location is great, service is wonderful, slept like a baby...and just off the sand....When we frist got to daytona we had a reservation elsewhere....THEY CANCELLED IT without us knowing !!!!!! Dream Inn took us in an on a moments notice...King room with kitchen and balcony. Im am coming here every time we go to daytona now....You can bank on that !!!!", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winter Haven, Florida", "Title": "“Our favorite place”", "Author": "sawilson50", "ReviewID": "UR134294609", "Content": "My husband and I have been coming to Dream Inn for over 10 years. We absolutely LOVE it!!!! We always get the same room. The mile or so walk to the pier is always on the list of things to do while we are there. Love Crabby Joe's. I also enjoy a nice run on the beach down to the pier and back in the morning during low tide. The rooms are always clean and the staff is helpful and courteous. The beach is amazing and since the makeover, the pool and patio furniture is lovely. The only thing that would make Dream Inn better is if they updated the BBQ grills and added a few more. They are in a very good location for restaurants and Publix is only about 2 minutes away.", "Date": "July 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“4th of July ON the beach”", "Author": "Rodney S", "ReviewID": "UR133644096", "Content": "My wife and I just spent five days over the 4th in a King room w/ kitchen. It was, clean, quiet and just steps away from the beach. There was plenty of room to relax on the beach deck in the evening. We would like to bring our adult children and grand child back for a family vacation. John and his son were great hosts.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tutukaka", "Title": "“Fantastic value for money”", "Author": "NZSailfish", "ReviewID": "UR133620988", "Content": "We were not sure what to expect as it looked more like a motel than hotel. Just needed 1 night so our expectations were not high. Boy were we pleasantly surprised. We arrived early and it was no problem Friendly staff checked us in, parked next to our room and unloaded. they had a coin laundry on site which was a blessing as we had been traveling for 2 weeks. The room was spotless, we sat and looked over the beach with a picnic dinner bought from the supermarket nearby. Next morning we wandered across the road to IHop for a great and inexpensive breakfast and then checked out. I highly recommend this establishment. It's not 5 star but then nor is the price. Great value for money.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas, United States", "Title": "“family get away”", "Author": "Cheryll R", "ReviewID": "UR133556915", "Content": "We all loved this place. We enjoyed every minute there. The pool was clean and relaxing, the places to sit and relax was plenty, the rooms were clean and cool and relaxing, the beach was steps away. We even bar b qued one night.. Lovely place.", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vero Beach, Florida", "Title": "“75th Birthday”", "Author": "Jerry T", "ReviewID": "UR133528157", "Content": "Spent July 4th in an Ocean Front room with a private balcony. This recently renovated Ma and pop motel can't be beat for the price. We arrived early (before noon) and were given a free upgrade to the best room in the Inn. We will return again.", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shepherdsville, Kentucky, United States", "Title": "“Dream of a time.”", "Author": "Tom M", "ReviewID": "UR132665093", "Content": "Spent an awesome seven days at the Dream Inn. The staff was awesome and went out of their way to make sure we had wonderful stay. Highly recommend.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Our 20th Anniversary 2nd Honeymoon”", "Author": "Marie P", "ReviewID": "UR132347028", "Content": "Our original arrangements with another hotel fell through. I just walked in the Dream Inn, told the owner the situation. He immediately gave me choices and quotes and then took me to view the rooms for me to chose from. WOW What great choices! We ended up with a king size room with a jacuzzi for two, a large balcony, and the most gorgeous view of the property, pool, and ocean. The price was reasonable, too. I only wish we were able to have gone here on our first honeymoon 20 years ago! Our weekend stay was wonderful! We ended up cancelling all our plans for the rest of the day and the next morning because this was the most relaxing and fun hotel we've ever been to and wanted to spend all our time at the Dream Inn. We will definitely be back!!", "Date": "June 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westfield, Indiana", "Title": "“Excellent stay”", "Author": "Lonna S", "ReviewID": "UR132148353", "Content": "We stayed 7 nights at the Dream Inn & it was a great experience! The staff is amazingly helpful & the rooms are very cozy. We had a slight problem due to renovations but it was taken care of immediately. They went above & beyond to make sure we were satisfied. We stayed in an ocean front room with an amazing view & private balcony. We go to Daytona Beach every year but this was the first time we stayed here. This is a gem of a hotel & our new favorite place to stay. Will definitely stay here again next year. Thanks to the all the staff for a wonderful vacation!", "Date": "June 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fishers, Indiana", "Title": "“Very affordable hotel with excellent staff!”", "Author": "Beth V", "ReviewID": "UR131440905", "Content": "My boyfriend and I stayed at the Dream Inn for a week and it was amazing. The price was so affordable and the rooms were very clean. The staff was very friendly and were so helpful, especially Steve. When we wanted to go to a certain type of restaurant they knew the local food joints that we really enjoyed. The hotel was right on the beach and was in walking distance to restaurants and one of the piers. We really enjoyed the amenities including the fridge, microwave, grills, and the cheap price of renting out beach chairs and boogie boards. We enjoyed every minute of our stay at the Dream Inn and would definitely come back and recommend this hotel to our friends and family.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lake Wales, Florida, United States", "Title": "“Wonderful family Memorial Day”", "Author": "Karen C", "ReviewID": "UR131044183", "Content": "We had about 9 family members ranging from 4 to 54 visit Dream Inn over Memorial Day weekend for 3 nights. They all LOVED IT and can not wait to go back again. We rented what they call the 4 bedroom villa that sits over the office. All the rooms were connected in one way or another. If we could have moved in we would have. It is a very reasonable priced and clean hotel for being right on the beach. I have stayed a few times at this hotel last year and loved it then also. It is not a fancy hotel but a unique Florida style hotel. I think beach when I think of the Dream Inn. It is on the South Daytona side that is not as busy as other parts of Daytona Beach. We could stretch out on the beach and not bump into lots of people. We had lots of space to set up tents, chairs and to play on the beach. I had seen bad reviews last year on this hotel but tried it anyways. Loved it from the beginning. Love the yellow color. We will not stay anywhere else when we go to Daytona Beach now.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Everything was great, even the Internet!”", "Author": "KellyandBJ", "ReviewID": "UR130674338", "Content": "Being a native floridian, I've grown up going to the beaches; 98% of the time to the Atlantic side. For the past 7-8 years we've stayed in condos or houses using vacation rental websites. To be honest we've enjoyed staying in props like that and have shunned hotels/motels. HOWEVER, lately I've had a change in perspective. After a recent inquiry from a vacation home rental site, their quote included a: $39 booking fee, $40 non-refundable damage waiver, a $100 cleaning fee and 12.5% sales tax. OUTRAGEOUS! A $100/night prop ends up being $160/night. Unacceptable. That brings me to the Dream Inn. After doing a cursory web search on Trip Advisor I located this little jewel. This is a small motel right on the beach. Current marketing specialists would probably categorize this as a \"boutique\" property. With less than 50 rooms. We had two other friends coming with us to stay and another couple that lived in nearby New Smyrna Beach that would day visit. The property is clean, comfortable and conveniently located. With a private pool overlooking the ocean, two grilles (charcoal fired), and a separate lounging area oceanfront. We booked the 3 bedroom \"villa\" that came with 2 complete bathrooms. It is not oceanfront but has an oceanview. 2 bedrooms had king beds and the 3rd room had 2 queens. While the two king rooms are separate, the room with the queens is not private. So if you had 3 adult couples, there may be a privacy issue, great if you had kids though. The room with Queens serves as the living room in this configuration with a 4-seat table, another small table with two chairs is in the kitchen. There is another 'lockout' door that could you add a 4th bedroom and full bath to a make a 4/3 configuration. There was a 2 burner cooktop, two microwaves and two mini-fridges in our configuration. We like to cook some meals so the cooktop was a must have feature for our trip. As indicated earlier, all our rooms were clean, the furnishings were in good condition and the decor is quite 'tropical' As indicated in another review, the sheets were pink! Wow! Let me assure you, as a man, I was more concerned with if the bed was comfortable and that the sheets were of good quality, soft and smooth. I was not offended by all that pink. Give me a break. We had no issues with the Wi-Fi, for our laptop or phone. They actually have two gateways to access it, one on each end of the building. The staff was friendly, efficient and helpful, telling us about local dining deals, discounts and such. There is a pizza joint directly across the street, a IHOP in the next building, a Subway next to them and a Denny's a block away; all offering a discount (show your room key) A full grocery store (Publix) is less than a mile away and most importantly, an ABC liquor store is also less than a mile away. If you're a fisherman, there are two bait shops about 1 mile away. Ultimately, we had a great time staying at this property. We had a concern it would not meet our expectations since we were used to renting private condos or homes. Happily we were not disappointed. Their prices are fair and we will be coming back.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Everything but the most important thing”", "Author": "Bobbi f", "ReviewID": "UR130585139", "Content": "A few of us family members stayed at Dream Inn over the last week (May 17-21) and LOVED everything about it .... the beach right there ...lovely pool ... plenty of outdoor \"hang\" areas for impromptu picnics and cigars ... friendliest and most attentive staff, one of the best prices for rooms at the beach etc ... BUT NO internet WIFI even though it was advertised. We told the staff who were well-aware of it and had reported it to the owner in the past - but apparently nothing has been done about it. My brother-in-law is an executive and had to stay in touch with his company ... and my nephew had a medical exam to study for.... and each had to go down the road to establishments like Barnes and Noble to get online. UGH! But honestly, that was the only thing wrong. Yet it can be a huge setback. Thanks to the sweet staff though for accommodating our every need and whim.", "Date": "May 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Wonderfully quaint”", "Author": "Therese F", "ReviewID": "UR130300207", "Content": "We had such a fun experience at this little place. We had an oceanfront room on the main floor. It was so quaint and eclectic. The room was very clean and the staff made a great effort to have the public spaces cleaned also. The pool was heated and well kept up. This is not the place to stay if you want a new and modern hotel; BUT if you want a unique and homey experience on the beach then I recommend this place to you. We will most definitely be staying here again. J & T", "Date": "May 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“relax trip”", "Author": "Harleynic", "ReviewID": "UR130012398", "Content": "Very clean, directly on the beach, staff was friendly and very helpful and the price !", "Date": "May 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great!”", "Author": "THEPTEAM", "ReviewID": "UR129540901", "Content": "I had read some negative reviews about this hotel before booking, but that was not the case. The room was clean and on the beach. It included a working air conditioner, fridge, and microwave. What more could you really ask for at this price! The staff was helpful and friendly. As a matter of fact in contrast to the reviews complaining about the office not being open 24 hours, I did manage to lock myself out of my room at 9pm (it was my own fault) and I called the emergency number they have and was back in the room in minutes. When coming back to visit my family this will surely be the hotel I choose! It is small, easy to find, has parking and was right on the road you drive onto the beach.", "Date": "May 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cape Coral", "Title": "“Wish I could rate this higher”", "Author": "funtravelingwithme", "ReviewID": "UR129419232", "Content": "Let me start with the pluses. The fellow at the front desk (don't know name - dark hair) friendly and helpful. Second plus is a plus with some reservations - the location directly on the beach. I say with reservations because the access to the beach is shared with a public entrance for cars to and from the beach - cars are coming and going as you are walking down or up the ramp. I would be wary if I had small children with me. Third plus - the room was relatively clean. Now the downsides. We had a garden view room; more a parking lot view than garden. The room was very small. The bathroom was the smallest I have ever seen - smaller than the \"standard\" on cruise ships and that means really small. When using the toilet I rammed into something at every turn - sitting down I hit my leg on the toilet itself. The towel rack was so close to the toilet I hit my shoulder on that. When I went to flush the toilet I hit my butt on the handle going into the bathroom. I am not very tall or extremely fat, nor am I clumsy. Hate to think what it would be like for a 6 foot 200 pound large guy. The A/C was at the back wall of the room. It did not cool the entire room very well (towards the front small table) but it sure gave you a blast of arctic air when you were at the frig or entering the bathroom. Very uneven cooling because of where the A/C unit was located. Also the room was musty and both me and my husband experienced allergy symptoms while in the room. Now the following is I'm sure a matter of personal taste but there was way too much pink. The sheets were pink as well as the pillow cases. The bedspread had an awful lot of pink. Even the blanket was pink. I'm female and all that pink was bothering me - don't know what some macho guy might think of it. The TV reception was awful for the first 25 channels or so - mostly snow. After about channel 25 the reception got better. Had no one to complain to since the front office closes at 6:00 p.m. Now, I have never stayed at any hotel or motel that did not have an ice machine (unless it was a suite or condo that had a full size frig with automatic ice maker). There is no ice machine here. Be prepared to have to walk across the street to the Seven Eleven and pay about $3.00 for a bag of ice. I don't know, maybe the ocean front rooms are much better (not available when we booked). I just know that me and my husband were very uncomfortable in the room and could not wait to leave. For the money there are much better options in the Daytona Beach area. After our stay here we went to the Days Inn about a half a mile away. That was lovely and about the same price range. Based on what I experienced, I would never stay here again.", "Date": "May 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greeley, Colorado", "Title": "“Front desk help and housekeeper”", "Author": "dazzle353", "ReviewID": "UR129314953", "Content": "I have no idea who will see this but I would like to share what a wonderful time we had at this motel thanks to the front desk help Steve and the housekeeper, Courtney. We don't get the opportunity to travel very much normally but on this road trip we stayed in numerous motels. Steve and Courtney stood out. They were not only extremely pleasant to talk with, but very helpful and courteous and made our stay even better with all their attentiveness. I was amazed at all they were doing throughout the day when time allowed, including grounds keeper! I would come back to this motel anytime when in Florida. Hope someone shares this with the two! Kudos to Steve and Courtney!", "Date": "May 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lakeland, FL", "Title": "“Nice Find”", "Author": "rosestar", "ReviewID": "UR129143965", "Content": "We found this place to be just as others had said. It was clean, right on the beach and everything one needed. Decent bed, nice little kitchen, windows that open and right next to an entrance for driving on the beach. Owner very helpful. Even showed me how to use my laptop with wireless connection which was helpful for the rest of our trip. The place is old, but they are fixing everything up--new fixtures, sink top, etc. The one bad thing for me is there weren't grab bars in the bathroom--I forgot to request the handicap room. Would I go again? You bet. I have been going to Daytona for many years and the big places are used very hard--two years and they look ten years old. This was probably one of the old mom and pop places that has survived.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Longwood, Florida", "Title": "“Another GREAT weekend getaway!!”", "Author": "LadyW900Ldriver", "ReviewID": "UR128619404", "Content": "My husband and I love the Dream Inn!! We always get a king oceanfront jacuzzi room so that I can sit in the tub and watch the ocean. The Inn is small, quiet, and in a perfect location for R & R. The bed was so so comfortable, with ample pillows. They provided very nice complimentary toilitries and coffee for the full-sized coffee maker. (You may want to bring extra coffee and filters from home!) The microwave and fridge were clean and operated fine. The TV was nice, flat screen with lots of accessible channels. The shower in the bathroom had the double rainhead like my husband enjoys. Nice pool and common BBQ areas with ample seating for guests in the courtyards. All the comforts of home, and they make you feel like that's where you are. A great little place that my husband and I plan to return to many times.... and can't wait!!", "Date": "April 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana, United States", "Title": "“Nicest People Ever”", "Author": "Laura E", "ReviewID": "UR128011783", "Content": "This place has been the best hotel experience I have ever had. I really only saw the skinnier man and the maid all week, I don't know if anyone else works there but those two could run it themselves if they don't already. The hotel itself was not dirty at all! It is just perfect for a couple. I am unsure of the bigger rooms since we stayed in a one bedroom but it was just great! The people were the reason I would come back. Most hotels staff are nice in a \"trained\" way by knowing the correct things to say, speak when spoken to, and all of that other typical customer service you get. These people were genuinely nice. They were around everyday. I ALWAYS saw them doing some sort of work or walking around checking on stuff. They would strike up a conversation with you like you had known them for awhile, but they were still super professional. The room always looked nice once she got done in there and we had no problems. I could go on and on about how nice and wonderful this place was. Honestly, if you are not wanting to stay in a super expensive hotel then you need to stay here. Don't go to holiday inn or wherever else is a little more expensive than Dream Inn because you will not get the same curtesy or welcomed feeling as if you were here. I cannot recommend it enough! It is right on the beach, right by a pizza place, subway, red lobster, gas station, Denny's, & IHop. There were 2 sinks one for all my make up and girl stuff and one for my boyfriend. There was a safe, nice walk-in shower, queen bed, wifi, table, chairs, tv, & anything else you could want and need on vacation. No continental breakfast, but honestly you can only eat those so much, and with IHop across the street with delicious food and nice people as well, you are missing out if you do not stay here.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Central Ohio", "Title": "“Location, location, location”", "Author": "friendlyflyer84", "ReviewID": "UR127890056", "Content": "I stayed at the Dream Inn during the first week of April. We were able to get courtyard rooms for $49.95/night. This is a nice mom and pop motel located right on the beach about 5 miles south of the Daytona Boardwalk. We didn't really need the ocean front room because we could see the ocean as soon as we walked out of our room door. I did get to see the oceanfront rooms and it does appear that they have been updated more recently then the courtyard rooms and appear a little nicer. The property that the Dream Inn sits on kind of small lot but it is beautifully landscaped. Steve was working on the landscaping everyday we were there. There were several charcoal grills available for guests to use as well as several concrete patio tables. We ate at these several times during our stay. The pool was excellent. It was heated and very clean! The lounge chairs were a little worn but still comfortable. One room with a kingsize bed (rm 130) and the other room with a queen size bed and a kitchenette (rm129). The rooms had a small door adjoining the rooms together; the door isn't even big enough to move a chair from one room to another but was able to allow access for us to move from room to room. The rooms were clean and had tropical bedspreads. The bathrooms were clean but dated. They had a watersaver type of showerhead in the showers (our rooms had large showers, no bathtub). My girls really liked it as it increased the water pressure giving a more forceful shower. The airconditioning worked extremely well in both rooms. The only problem was the location of the air unit. In room 129 the a/c unit is in the kitchenette area so you either had to turn it off while cooking or feel it blowng directly against you. Same thing in room 130 except it was in the area of the blow dryer. The rooms had a safe in them to secure your valuables. I liked the fact that I was able to set my password to a number that I could remember. Room 129 had a flatscreen tv with a dvd player attached. That was an extra special treat. We made all of our meals in our room using the kitchenette. The stove worked great. The oven got hotter than the actual temperature on the dial. It only took one time to find that out. I also followed the advice of others and brought some of my favorite cookware. (I know Steve would have gotten me what I needed if I asked however it was easier just to bring what I know I needed and liked). The sink in the kitchenette is the size of a bar sink. I would have liked it to be a little larger or at least provide a strainer so that food particles wouldn't get stuck in the top of the drain. The worst part of the kitchenette was the size of the fridgerator. It was the size of a bar fridge. I believe that most guests stay at the Dream Inn for longer than two days. We used the refridgerators in both of our rooms and still needed to use a cooler for drinks. Hopefully when, and if, they do more renovations it will include a larger fridge, even an apartment size fridge would have been appreciated. The hotel does offer free wifi but isn't very accessible in the room because of the concrete walls. It would be better for them to offer wired internet access then wifi. We didn't usually use the internet until evening time and would have been nice to use the internet inside the room instead of having to go outside into the courtyard. Steve was helpful and did offer to reset the system if we were having problems with the wifi. Parking is included but is very limited. Steve was good about making sure that cars were towed if there weren't spaces available for guests. Guests could have done a better job of parking between the lines but obviously not a hotel issue. Public transit is available and you could get an unlimited pass for pretty cheap. 7/11, Ihop, and pizza place are conveniently across the street from the hotel. Cross at your own risk as drivers don't seem to care for pedestrians. I would recommend this hotel to my friends and is definately a deal for the money. Thanks to Steve and Courtney for their help making our stay enjoyable and making us feel at home.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "DeLand, Florida", "Title": "“Another great weekend!”", "Author": "Niceandcozy", "ReviewID": "UR127563970", "Content": "We have been coming to the Dream Inn for over 5+ years and we always have a wonderful time. The courtyard is great for cooking out and the kids just love it!!! The new double headed shower heads were an added bonus. As always we will be back!!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa Bay, FL", "Title": "“Great little hidden gem!”", "Author": "lucy0076", "ReviewID": "UR126737101", "Content": "We had a great overnight stay, next time we will definitely stay longer. The location is perfect and no matter what room you stay in you are a few steps from the sand! We had 1st floor oceanfront and the downfall to that was a semi-closed in patio but that is a minor inconvinence when you consider price and location. Another bonus is that there is a lifeguard on duty on the beach outside the hotel so if you have little ones you can have an extra set of eyes out there! We will definitely be back!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clermont, Florida, United States", "Title": "“Our Stay here”", "Author": "Dana L", "ReviewID": "UR126695232", "Content": "I live in Florida and have stayed at many hotes on the beach. This was my 1st time at this facility. I will definitely stay there again. It was clean, very convenient and right on the beach. We stayed there for 2 nights.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Clermont FL", "Title": "“Bike Week”", "Author": "TeeBeeClermontFL", "ReviewID": "UR126315909", "Content": "Was able to book an oceanfront room at last minute for the last night of Bike Week. Liked location a little removed from all the noise and action for some relative peace and quiet. Jacuzzi tub was a huge bonus after a long day on the bike!!", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brattleboro, Vermont", "Title": "“Party of 3 for the races”", "Author": "Randy B", "ReviewID": "UR125542685", "Content": "We've been going to Daytona for the races the last 5 years and the Dream Inn is the first place we've stayed that I want to go back to next year. Very reasonable rates and a great value for the money, Friendly staff, Clean rooms with doors that shut tight, Discounts at a few local restaurants, Easy access to everything we needed. I highly recommend the Dream Inn, A great place to stay! We will surely be back next year!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Clifton Park, New York", "Title": "“Daytona Rocks!”", "Author": "nikki v", "ReviewID": "UR125369654", "Content": "I stayed at the dream inn while visitimg Daytona briefly and I cant speak enough about what a wonderful experience I had while staying at the Dream Inn!!!! The customer service when booking my stay was excellent! (Thanks to Steve!) Once we arrived into our destination at the Dream Inn, it was a little earlier than our check inn time and once again \"steve\" was soooo accomidating that he said we could have our room by 12:30 ish........he absolutely made the experience at this hotel by far the most welcoming and friendly experience i have spent on vacation! Prior to our night at the Dream Inn we spent $250 to stay at the Holiday Inn in Clearwater Beach with just as beautiful views....but......quality and service stands above and beyond for me at Dream inn for reasononable fees!!!! I even forgot something small but important to me and steve sent it to my home free of charge! I love this place and i will recommend it to anyone!! PLEASE make it a point to visit the Dream Inn in Daytona Beach!!!!!!", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Des Moines, Iowa", "Title": "“Dream Inn Vacation In Daytona Beach”", "Author": "Scott W", "ReviewID": "UR124538823", "Content": "Our family has stayed at this motel on and off for the past 50 years. It was originally called the \"West Indies\" and my Grandparents would spend entire winters. We have watched it go through good times and bad. It had fallen on hard times until the Kinberger family bought it and brought it back to the wonderful family facility it is today. You will not be disappointed with your stay. The rooms are clean and well maintained, and the staff is friendly and attentive. Just steps away from the beach, you can have the time of your life. Also one of the best bargains in the area. Enjoy!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great location and on site staff”", "Author": "judy155004", "ReviewID": "UR124531979", "Content": "We are a retired couple escaping the northern winter. This place turned out to be a little gem for the price we paid for two weeks. Right on the beach so great spot if you want to walk the beach. Grocery, drug store, 7-11, family restaurants (IHOP, Dennys, Subway, Red Lobster), church, Sunglow Pier all within easy walking distance (within a mile). 60s era hotel but the owners appear to be continuously updating (door lock and kitchen taps were updated while we were there). We were pleased to have an in room safe and hair dryer. Room was clean, and no bugs (monthly pest control visit happened while we were there). Our courtyard room was small but functional. There still is some painting that could be done (kitchen cupboard door and bottom of bathroom door) and kitchen utensils (such as the can opener) could be improved. On site staff, Steve and Courtney, were very very helpful and responsive...and keep a watchful eye to ensure all guests follow the rules and don't disturb others. Thanks! We would stay here again.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cadillac, Michigan", "Title": "“ANOTHER PERFECT STAY AT THE DREAM INN”", "Author": "WandaAnne", "ReviewID": "UR123318532", "Content": "Stayed at the Dream in again in December. Still one of the best ocean front family owned motels we have found. Rates are still very affordable with no surprises. In each of our stays, rooms have been spacious and clean with comfortable beds. I would say what we like best here is the fact you can really sleep as it's nice and quiet at this motel. We have regular business trips to Daytona Beach and found this motel by accident with a cheap internet reservation. I'm sure glad we did.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Longwood, Florida", "Title": "“Our favorite romantic getaway destination!”", "Author": "LadyW900Ldriver", "ReviewID": "UR123032518", "Content": "Dream inn is small, quiet, beautifully decorated and the perfect getaway. Loved the king jacuzzi suite! My husband and I are looking forward to a return visit in the very near future!!", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jacksonville, Florida, United States", "Title": "“Very quiet, relaxing stay.”", "Author": "Kristen J", "ReviewID": "UR122972672", "Content": "We were very pleased with our stay. Steve and the room stewart (never got her name) were very friendly. Helped us with local attractions to visit and getting things for our room. We had a courtyard room, many people have been complaining about the courtyard view and I somewhat agree. Its not much of a courtyard, but all you have to do is turn your head to the left and you see the beach. So I was not disappointed about that or the location of our room. For the price, I was very pleased however there were a few things that could have been better. The electrical outlets are too big for plugs. I'm not sure if its because they have been used to so much but it was difficult to keep the plug in the outlet. It kept falling out. The TV had no RCA hookup. But the biggest disappointment was the \"kitchen\". The website says \"The kitchen includes a refrigerator, stove with oven, microwave, coffee maker. with coffee, toaster, and complete with dishes\"...So we took a trip to walmart to get groceries to cook for the week and once arrived to the hotel realized alot of things we bought we could not cook. Eggs had to be flipped with a spoon (no utensils), and no baking sheet. There were 2 small pots, one small frying pan, 4 plates, and ONE knife. So if you are planning on cooking you may want to bring your own utensils and baking wear. Other than that I have no serious complaints! I WILL be back. Thank you Dream Inn for a great vacation!", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Port, Florida", "Title": "“rj”", "Author": "Robin W", "ReviewID": "UR122779189", "Content": "Had a great time at the Dream Inn, heart shaped hot tub was a lot of fun. The beach was right there, could open the sliding glass door and hear the seagulls and look out at the ocean, while hearing the surf roll in. The room was just the right size, with a fridge and microwave. The lanai was really nice to just sit outside and relax.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We stayed 2extra days”", "Author": "ziggyzoo2", "ReviewID": "UR121465620", "Content": "Wonderful place for beach lovers couldn't be happier...excellent will come back. Very nice owner", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brooksville, Florida", "Title": "“Great Experience”", "Author": "ed m", "ReviewID": "UR121314294", "Content": "We stayed here for Thanksgiving weekend and had a great time.It was wonderful to go to a Family owned motel and receive excellent service. There was a slight problem with our door and we were immediatly upgraded to a better room. Try that at one of the chain motels. We are definatly going to stay there in the spring.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vero Beach, Florida", "Title": "“Just Perfect!”", "Author": "Theresa M", "ReviewID": "UR121168475", "Content": "The Dream In was perfect for our Thanksgiving getaway. We had a king jacuzzi suite right on the ocean--the view from the tub was amazing! The hotel is definitely dated, but in a fun, retro style. Everything was clean and we were very impressed with the service, especially for a holiday. Not one negative from us BUT--if you're looking for cookie-cutter modern, this is not the place for you. An appreciation for old-Florida is a must, and you won't be disappointed.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Petersburgh, NY", "Title": "“I love Dream Inn”", "Author": "Ann L", "ReviewID": "UR120756282", "Content": "For me, the Dream Inn is just what I was looking for-an old-fashioned beach motel. There aren't many left. My room had delightful tropical decor, and was clean and comfortable, complete with a fridge and microwave.The owners John, Cindy & Jody Kinberger were very pleasant and helpful. There is a courtyard which is absolutely lovely-a thick carpet of grass, umbrella tables, lots of chaises and lots of palms providing shade and also screening the parking lot a few steps down- a beautiful place to relax and escape the ocean breezes. Through the causeway one passes the ocean front rooms, and steps out to the terraced area above the beach with more palms, umbrella tables, chaises and, of course, the ocean beyond. I loved my stay here and am already looking forward to a longer stay next year.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burkesville, Kentucky", "Title": "“Rode out the storm but enjoyed our stay”", "Author": "Linda S", "ReviewID": "UR119631445", "Content": "We picked this hotel off the net. We arrived prior to a 3 day tropical storm but had a chance to get into the pool and walk the beach. Our down the coast trip was delayed but, Steve at the front desk took care of all our needs and constantly checked in with us to see if were ok in our oceanfront room. Both he and the maid service was excellant. Even though our room was older style, we liked it alot and will be returning to stay with again soon. thanks John, Linda, Kaddie and Timmy from Burkesville, Ky.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“1000 words vs internet pic”", "Author": "BPJones", "ReviewID": "UR118869191", "Content": "Unfortunately, we must say the 'bargain' (compared to neighboring NEWER motels/condos) was due to LOCATION! We occupied 1 of 6 or 8 rooms last nite, and just opening the door we knew we'd made a mistake, then on to the bathroom - YIKES! 70s, with all the sand/dirt since, apparently, in the tub! A/C was iffy. Fridge didn't work at all, but the freezer did??? The clientele was a bit iffy, so we felt gypped for the $100 nite! BTW, no breakfast, or coffee. The only redeeming quality that counteracted the yucky rugs and bath was the comfortable bed, and relative quiet.... Not a dream, more a nightmare; but obviously the owners are holding onto the past, as ALL the 'old' 2-story motels from that area are gone or going.... Sad.", "Date": "October 2, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“A sweet little vacation”", "Author": "nancyI", "ReviewID": "UR118133314", "Content": "We have been here a couple times already and love the down home atmosphere. This is an old beach inn from the 60's or so. They work at updating regularly and always look forward to what is new. The grassy garden area, the pool and the beach are all close,well maintained and inviting. It is such a relaxing vacation we look forward to it every year.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "2", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Mount Dora, FL", "Title": "“Once was enough.”", "Author": "kw0412", "ReviewID": "UR118076162", "Content": "It looked NOTHING like their website pictures. The \"courtyard\" was a plot of grass that led to the parking lot. The deck was old and dirty, a new paint job would have done wonders. The pool was no better. I can't really think of anything good to say other than it was nice the ramp to the beach was right there and I am thankful we only stayed one night.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“WORST TRIP EVER!!!!!!!!!”", "Author": "teresa P", "ReviewID": "UR116603464", "Content": "We arrived at Dream Inn. It did not look like the web site. We had booked an oceanview room when we went in our room, it was sooo very small and we had to share the deck with another guest. The deck was not that clean!!!! We spoke to the frront desk and moved to another room.The second day I noticed bites on my chest and back of my neck, they were bed bugs bites( bed bugs can be killed by high heat not spray). I went to the front desk ,showed them my bites and was brushed off. I was so scared that night, I checked my bed during the night and found a bed bug in my bed. I checked the room and they were coming out of the head of the bed wood area. Front desk was told and we were moved to another room. In that room there was hair in the bed, the shower floor was old and moldy and the toilet did not flush.,And was told they had sprayed for the bugs earlier. We checked out i was soooo uncomfortable. I will wear the bites for a little while, but the horrible thought of this place forever!!1 They do clean this place daily ,but poorly!!! They they are badly in need of repairs and need to be cleaned better,that is why they charge you a fee, that you owe them two nights if you cancell. This place is a scam all the bad reviews I read are true. I have seen them with my own eyes. I will tell all my friends and family and tell them to tell their friends and family not to stay here. No one has to suffer from this place like I did. I will never be back, I mean never!!!", "Date": "August 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Never again!!”", "Author": "10acmel", "ReviewID": "UR116280664", "Content": "This motel has so much potential; very charming little garden area, nice location with several restaurants in walking distance, an old Florida feel. The reality was such a disappointment. Never would I suggest this place to anyone.. No customer service. Office closes ridiculously early each night. How can you expect to serve your guests when you close @ 6? And the folks at the front desk are unpleasant..maybe if you don't want to be in the business & go home early every night, find another line of work. Dirty, dirty. Nothing clean about this place. Moldy bathroom. Dirty windows. FILTHY pool & grounds.cigarette butts & cans there on our first day were still there 5 days later. Never saw anyone clean pool or grounds.Maid service erratic & seldom full service. Bathroom sink stopped up our entire stay,despite 2 repair attempts. We were very unhappy and youmay ask--why didn't we complain? First, it's our vacation, and I don't want to spend a second hassling with problems. Second, our room was paid up front & no cancellations are allowed. Was it going to be any different for us? Third, the front desk didn't seem to be the kind who'd be receptive to complaints. They've already got the money. Why bother? Read these complaints & you'll see the same stuff over & over again. All these people can't be wrong, and the owner needs to read this stuff, get off this board with their petulant defense, and get to work improving the place! despite 2 trips from front desk to repair.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Deltona, Florida", "Title": "“Cute, quiet, needs some improvements..”", "Author": "twags", "ReviewID": "UR116179912", "Content": "This is actually a really cute place. Not very large at all. Staff was nice. Man at the front desk....ehhhhh...attitude a little iffy but everyone has a bad day. Room was small but had what we needed. My only complaint is the light outside our room at night (don't remember if it was a light next to each door. Couldn't have been the parking lot lights) was so bright it did not allow the room to become fully dark. It was very annoying unless you managed to hang something over the door way to keep the light out. Pool really wasn't all that clean and I was iffy about whether or not to go in. Pool could have used a good scrubbing. Also they may want to check the pool ladder. My BF was floating on his back in the pool and accidently bumped into it and when he floated up right and accidently rubbed up against the ladder, the ladder cut a pretty good scratch in his shoulder.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "debary", "Title": "“WE LOVED IT WILL GO BACK”", "Author": "kittyDebary", "ReviewID": "UR115794606", "Content": "Friendly management. Clean rooms. Close to beach Loved the pool", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Saint Augustine, Florida", "Title": "“Disappointing. Inconsiderate and rude owners and staff.”", "Author": "TheLoot", "ReviewID": "UR114790301", "Content": "We had a king room with a jacuzzi. The hotel ad said \"See the ocean from your jacuzzi.\" Yeah, during the daytime, maybe! But at night the pool security light shone so brightly that the ocean could NOT be seen from the jacuzzi or even on the balcony over the light. How romantic, instead of an ocean coastal view we had a huge secutity light to sit under, I suppose that was a substitute for a romantic full moon. The photos also show extra towels on the edge of the jacuzzi. None exisited in our room. The window in the sliding balcony door had not been washed in ages, the morning dew hightlighted the dirt specks instead of the sun coming up over the horizon. Out on the balcony the underside of the wall mounted air conditioner was rusted and dripping, no drainline. The whole room and balcony were painted right over rust and dirt, no paint preparation. On the second day no room attendent showed up until I stopped one in the hallway late in the afternoon to ask for newcomplimentary coffee set ups. He brought us just the pre-bagged coffee, no sugar or creamer packets. The inn is old and held together with bubble gum and duct tape while the rude and overbearing owner and family pocket easy money. The pool filter was not on and there were dead bugs as well as tree parts floating. High prices, low, low, low quality. Unfortunately a cancellation is required weeks in advance or there would be no stay at all after inspecting the room. Now we know the reason for that policy. You will enjoy the lengthy list of prices for missing or stolen items that will be added to your credit card if discovered after check out. And the heavy handed notice of a $50 fee to open your room if you lose or demagnatize your key card also add the \"congenial and welcoming attitude\" of the owners. They have a lot to learn about treating the public. DO NOT STAY HERE AND RUIN YOUR VACATION!!", "Date": "June 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "DeLand, Florida", "Title": "“Love this place!!”", "Author": "Niceandcozy", "ReviewID": "UR102576519", "Content": "We have stayed at the Dream Inn many, many times and love it. We enjoy the quaint small property, not crowded with so many people. The courtyard is great for cooking out and gathering with our friends. Cindy and her staff always make us feel so welcome! And the pillows are the BEST I have ever slept on. If you want a nice, clean, small hotel for your family, you will not be disappointed!", "Date": "April 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“Easter weekend tradition, wouldn't spend it anywhere else!”", "Author": "teachfish70", "ReviewID": "UR102286921", "Content": "The staff is like family, Cindy goes out of her way to accommodate us every year! The hotel is quant and feels like home. We spend every Easter weekend there and wouldn't have it any other way!", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva, Florida", "Title": "“Beautiful Location”", "Author": "TheCapozzia", "ReviewID": "UR101777085", "Content": "My husband and I took our two boys for two nights last week. I requested oceanfront plain and simple. No high rise for us down the hall far away from pool and ocean. That's what we wanted and that's what we got~~second floor with balcony. We were very happy that is was an ideal room for us. Not fancy just simple and quiet. We could easily see boys in ocean and pool. Beach was perfect~~not so very busy and lifeguard right in front. Room had a small kitchen area w/refrig. stove, and microwave if you want to cook and also many restaurants in area for eating out. I enjoyed the garden area around property. Seemed others did also. This provided alternative places to sit in shade or sun. Table and chairs all around property made it very convenient. We enjoyed our stay very much and plan to return.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cadillac, Michigan", "Title": "“We always stay at Dream Inn when in Daytona Beach”", "Author": "WandaAnne", "ReviewID": "UR87408739", "Content": "Nice motel right on the Atlantic Ocean beach. Affordable rates and there are no surprises like extra charges and the like. In each of our stays, rooms have been spacious and clean with comfortable beds. It's nice and quiet at this motel so you can sleep well. We used to stay at other motels as we have regular business trips to Daytona Beach, but tried Dream Inn due to low price on web search. Glad we took a chance the first time and have stayed at the Dream Inn every time since.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Worst Ever”", "Author": "lovemybaby33", "ReviewID": "UR86844131", "Content": "We booked a Oceanview suite with kitchen and balcony only to arrive to a queen courtyard view that was smaller than my bathroom. Not what I had paid for! We were to arrive by 6pm to avoind cancellation....the front desk called and said they were leaving at 5 so we needed to call back if we wanted our room. What!!?? When we realized it was not the room we booked, we tried calling....no one there and no after hours emergency number. I broke out in hives by just sitting in the room. Had to leave and find another place so I wouldn't wind up in the ER. Fighting them now for a refund. DO NOT STAY HERE!!!!", "Date": "November 12, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Toronto/Lauderdale", "Title": "“Does Not Honor Advertised and Confirmed Price”", "Author": "Number6Fan", "ReviewID": "UR84619301", "Content": "I booked with this hotel and received a confirmation stating $39 per night. Jody then phones me and tells me the price is wrong they made a mistake, it is actually $175 per night. Just a little increase!!! I understand people make mistakes but he was totally unwilling to even negotiate a compromise. Any other industry would honor the price advertised and confirmed, but I guess this owner feels they can do as they please, charge whatever they want, and change pricing after the booking. I will be contacting the BBB as other reviewers have, and seeking legal advice.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palatka, Florida", "Title": "“it was worth every penny..wonderfil place to stay:)”", "Author": "dnolan45", "ReviewID": "UR73831069", "Content": "went for my husband's 48th birthday and i had a ocean front room with the zacuzzi in the room and it was as beautiful as the picture show's online, the courtyard was very pretty as well..the only thing i could say the hotel could use is a elevator for easier access of having to carry luggage up stair's especiall for people with a disability that can't harly walk not along having to walk up a flight of stair's. the manager was very helpful to me on that part by helping me carry my luggage to the room due to my husband not being able to help me..so overall i would have to rate the hotel with the highest rating there is. thank you dreaminn for making my husband's birthday a memorable 1.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Orlando, Florida", "Title": "“NEVER AGAIN !!!”", "Author": "cbeaz4626", "ReviewID": "UR68438002", "Content": "Customer service is unheard of at this hotel. Their website says this: \"Enjoy southern hospitality by Louisville, KY owners that endear themselves to guests with a brand of charm and personal attention that sets the Dream Inn apart from others.\" The woman I dealt with on the phone before ever arriving should have sent me running. She was rude, short tempered, and at times condescending. If this is their \"brand of charm and personal attention offered...I DON'T WANT IT. I came very close to picking another hotel but thought I would give the Dream Inn a try. The gentleman that checked us in was cordial, but not overly inviting or friendly. We got to our room, on the surface things looked fairly clean so we immediately got dressed to go to the pool. Once at the pool I was very disappointed. The water in the pool was so cloudy that I refused to get in. I would not have been able to see my feet in that water.....gross. We stayed on the beach for a while then returned to the room. Once I returned and began really looking at the cleanliness I was disgusted. Their website says this about their rooms.... We are a unique small property with the luxuries of a large resort. Dream Inn is located in Daytona Beach Shores Florida. The use of the word luxuries is laughable. I understand that this is a small property, I have stayed at family owned, small places before and they were not at nasty as this one. The shower was old, cracked and moldy. They tried to make it look newer but they just painted over the mold and stains. I wore my flip flops in the shower and in the room at all times. The window unit air conditioner was not strong enough to cool the room appropriately so my husband had to purchase a fan to help with cooling the room down. The bathroom linens were old, tattered, and mismatched. Even the toilet paper sucked, thank God I have learned over the years to bring my own when I travel, which I did in this case. We went to dinner and then got ready for bed. I pulled the covers back only to discover HAIR everywhere. Long black hairs, pubic hair, etc. The sheets were stained....I don't want to imagine what the stains were. Needless to say I stood for much of the night. Had we not had plans for breakfast in the morning with friends I would have driven home that night for sure. I was not able to ask for a different room or that the sheets be changed because after 5:00 pm there is no one in the office. If you call them and ask them to come back because of a problem there is a $50 FEE and it could take up to an hour !! If you have friends who are coming to visit you at the hotel there is a fee for them per person. In the morning I wanted to check out immediately however, there was no one in the office until 9:00 am. We left our keys in the room and left anyway. I would not pay a dime ever again to stay at this filthy, disgusting hole of a hotel. Trust me, it was awful.", "Date": "June 23, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Summerfield, Florida", "Title": "“Not like the Pics!”", "Author": "Linko38", "ReviewID": "UR68430720", "Content": "My Husband and I booked the room after seeing their facebook page. I reserved a courtyard suite. What a joke! The court yard was yard with a few lawnchairs and plants. The place was so out dated. The bathroom was so small. The pic does not show the bright yellow concrete wall hiding the ocean view. Not Happy! ps the parking lot is horrible!", "Date": "June 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Loxahatchee", "Title": "“\"Can't Review the Room I Reserved\"”", "Author": "maneryder", "ReviewID": "UR67808646", "Content": "I always check Trip Advisor before choosing a place to stay no matter where we decide to travel, and I've never been steered wrong. So after carefully reading the reviews for Daytona Beach, I chose Dream Inn . I reserved a room well in advance, requesting a second floor kitchen room with private balcony and two queen beds. I called the day before we arrived and confirmed that request as well and was assured that is what we were getting. Upon check in, we were told we had a first floor unit and the second floor with private balcony wasn't available, only for one night and we needed three. The \"balcony\" we had on the first floor had a big glass window in front of it which was filthy and there were tables/chairs just on the other side of it, so when people were sitting there they could see directly into our room. We kept our blinds closed most of the time! The man checking us in (son?) was very unfriendly and was quite rude. Of course we couldn't cancel at that point, we would have been charged anyway. And by the way, there are signs EVERYWHERE about all the extra charges for everything, from early check in charges, to late check out charges, to charges for not washing the dishes upon checkout, internet charges, for charges if you needed to call them to come open your room if you lost your room key after hours. Yes, the hotel is old, which would have been OK if had been CLEAN. I kept flip flops on the whole time because I didn't want to walk on the carpeting; there was mold in the bathroom tiles in the shower/tub; I had to ask the housekeeper to actually come vacuum my room and I asked her to do the change the sheets, which she did NOT do. You need to wash dishes before you leave, which means the dishes you provide DO NOT get washed again by the housekeeper and when we pulled out some dishes to use when we got there, they were SLIMY and not clean. So whoever was there before us just basically put them in the cabinets to look like they washed them. YUCK! We didn't even use the pool, as the water was the temperature of a HOT TUB and had no desire to be HOT in the 95 degree summer temperatures - they could probably save alot of money if they DIDN'T heat their pool in the summer! I asked for beach towels and had to go to the office to get them, and they were even unfriendly about that! Anyway, I'm not usually one to complain about things, but this terrible place doesn't deserve a good review from our visit and hopefully someone else may think twice about staying there. I knew it wasn't the \"Hilton\" when I reserved a room, but I certainly didn't expect it to be as awful as it was. Good things:walking out of our room and going directly onto the beach, cold a/c, & the tiny little Italian place across the street that had delicious pizza. But I would highly recommend that you go somewhere else - there are plenty of places to stay along the strip there!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Clermont, Florida", "Title": "“Nice Beach Inn”", "Author": "Loper051", "ReviewID": "UR65962787", "Content": "The Dream Inn is not the place to go if you like the typical little amenities a traditional hotel room offers; HOWEVER, it IS the place to go if you like the atmosphere of a local beachside inn. The Dream Inn isn't fancy. What it is is affordable and clean having a FABULOUS beachfront location. It has a nice pool and is close to everything in Daytona. We look forward to staying there again!", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "oshawa, ontario", "Title": "“very nice place ,clean,people very nice”", "Author": "bruceeoshawa", "ReviewID": "UR56823029", "Content": "stayed there for 3 weeks in Dec. and Jan. place very clean people very nice had a great time only problem was the interent..had to pay for it.bu day, week, or month we took the month rate for $29.95 from SKYRIM for 1 month and they keep billing me for Jan to Feb then from Feb20, to March. we left Jan 7,2010 canot get ahold of them they will not answer call or emails and have tried over 20 times spoke to people on repair but never got anywhere with them.........BEWARE OF SKYRIM..overall the motel and people are very nice..would stay there again with out interent...", "Date": "February 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Great Location and Good value for money”", "Author": "Gilllian", "ReviewID": "UR53599231", "Content": "This hotel is right on the beach and close to most things. It is clean and pretty well maintained, we just had one issue with the tap in the bathroom.. The rooms were clean . The price was really good for its position, we booked on their own web site (dreaminn.com) , they have special prices on there. The staff were friendly and helpful.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cleveland", "Title": "“HEAVEN”", "Author": "alabamajoe", "ReviewID": "UR51743671", "Content": "We found this place on the internet and thoght it looked nice. I was extremely surprised when we arrived for the price we payed I don't think we could have got a better place 29.95 for a room just steps from the beach and the pool is directly on the ocean. what more can you ask for.", "Date": "December 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kentucky", "Title": "“Perfect get away!”", "Author": "kentuckysunseeker", "ReviewID": "UR51458238", "Content": "We have visited the Dream Inn on several occasions over the years. It is always our choice to return for a peaceful get away. We love it because it is small, quiet, and the perfect place to get away for a lazy visit to the beach. The rooms are nice, clean and comfortable. The pool is wonderful- refreshing and clean. The staff is superb. Always available and ready to chat a few moments or take care of your every need. Great concierges too. They always share the best places to eat, the best things to see, places with the best prices and value for your dollar. If you want more excitement, the Dream Inn is convenient to many of the tourist attraction and provides some wonderful quiet sanity to retreat to at the end of the day. Sometimes during our visits we do the tourist thing, but we always love coming \"home\" to the serenity of Dream Inn.", "Date": "December 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bardstown, KY", "Title": "“What more could a family want.”", "Author": "PattyBardstownKY", "ReviewID": "UR51186582", "Content": "Right on the ocean, close to Orlando and the Theme Parks, NASA , Daytona Race Track, Shopping, Golf and Miniture Golf. Daytona Flea Market and some of the best Resturants. Dream Inn Hotel is very clean, friendly. We can't wait to go back. We had so much fun, everyone in our family was so happy. The value of our stay let us do alot more than we planned. Thanks to Dream Inn and everyone there for a wonderful time.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Right on the beach with all the relaxing sights & sounds of the ocean”", "Author": "Wolfsburg74", "ReviewID": "UR50943293", "Content": "It was a very cozy hotel right on the beach. We had a spectacular view from our 2nd floor balcony, perfect for watching the sunrise or listening to the waves breaking on the beach. We were close to restaurants, miniature golf, a movie theater, and the beautiful lighthouse is just minutes down the road. There is plenty of night life nearby as well, I highly recommend a visit to the outside deck at the Inlet Harbor restaurant as the sun goes down, it makes for a great evening. Our stay made for one of the most relaxing, laid back vacations that i've ever been on. I will definitely be back for more of the same!", "Date": "December 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kentucky", "Title": "“Wonderful Time”", "Author": "KentuckyRetired", "ReviewID": "UR50807788", "Content": "Thoroughly enjoyed my visit. Great atmosphere. Loved the hometown feel of the facility. Grounds and pool are well kept and inviting. Rooms are clean and staff is very accomodating.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisville", "Title": "“We will be returning to Dream Inn in the future.”", "Author": "Campersmom", "ReviewID": "UR50521408", "Content": "I would recommend staying at the Dream Inn to anyone who wanted a quiet, relaxing vacation with their family and small children. We will be returning to Dream Inn in the future. Although it is small, it is clean and quiet. Pool overlooks the ocean. Very friendly staff.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "gainesville", "Title": "“Great!!!”", "Author": "heavenlycent100", "ReviewID": "UR28589765", "Content": "After reading all the reviews my husband and I were a little unsure about booking. We went to daytona for a weekend getaway. After we checked in we were a little surprised the room was clean, a little older hotel. But its beach front and you can't beat the value. We took a chance and it paid off we stayed in room #130 it's 1st level courtyard those seem to be the best!!! We also took advantage of the casino cruise which the hotel gave us free tickets. The shuttle picked us up right in front of the hotel. Can't beat it!!!", "Date": "April 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Ontario", "Title": "“Needs help- lots”", "Author": "JNJOntario", "ReviewID": "UR26524555", "Content": "DO NOT BELIEVE THE INTERNET!!!!! The pictures are at least 10 years old!. I am sure at one time this was a very cute little motel, but unfortunately no one has taken care of it for years. The peeling paint on the balcony railings, rust and mold running from the a/c, the mold on the ceiling of our room, the lack of reliable maid service ( and when we did get it , it was sketchy to say the least,) the lack of heat in the \"heated pool\", the sand in the bottom of the pool (plus the fact that I only saw the owner cleaning it once in the week that we were there), the non-existence of front office staff, the total lack of care for the courtyard or any of the plants or lawn on location, the lack of sweeping the pool area of cigarette butts, empty beer cans etc., or the straightening of the pool deck furniture (I did it myself one night), the ripped bathroom screen and \"extras\" in the bathroom when we arrived, tells the story. A fellow guest,, whom we met on the pool deck commented that it was all he could do to stop himself from putting on his tool belt and start plastering. John the owner was pleasant, his wife Cindy although chatty would not show us the room when we arrived as we asked , before we paid and told us right away there is no refund for any reason. While we were there an older gentleman arrived with his dog for the night. After signing in he sat with us when the owners son came up and asked him if he had a dog. The gentleman said yes and said the dog sleeps in his car. The owners son told him he would be fined and he would have to leave. There were many angry words exchanged and finally the gentleman got his money back and left. However, yesterday we saw the owner himself with his dog on a leash relieving itself in the courtyard. I guess if you are the owner its okay to have a dog. This left a very bad taste in our mouth. We explored the area and my husband and I have found a wonderful, clean and much less expensive location for next year. Try one property north and two properties south. If possible, if you haven't inspected the property yourself, only stay with the recommendations of people you know. Was it a good value for our money - NO Would we recommend this location. -NO Will we ever return - NEVER!", "Date": "March 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Germany", "Title": "“Needs To Be Bulldozed and The Owner Put in Jail!!”", "Author": "MochiRabbit", "ReviewID": "UR26261688", "Content": "\"I did this without my mind\"....what was I thinking?? The place is worse than discussting!! My husband and I flew from Germany where we live to get some sunshine in Daytona for a week. I was so upset with the room that we pleaded with the owner to give us our money back four days early. We agreed to pay for the nights we had stayed. She would have none of it, she lied numerous times and has no idea what customer service is. I told her that we did not have a cell phone that worked in the U.S. but she insisted that we call from Orlando. She also insisted that we fax her some form with our signature on it?? After she had already billed our credit card. Come to think of it - she never did give us an itemized bill. My husband kept wondering who is serving whom here? The room was full of mold, dirt, hair from who knows, the 'clean' towels had lipstick and makeup from previous guests. My hairdryer wouldn't stay plugged into the sockets. The pool is filthy. I was afraid to sleep in the bed as I would catch some deadly disease. The shower leaked - it was so gross that I was afraid to get in it. The last night we were there someone was beating the door down above us. The owner claimed a woman was ill and she called the ambulance - we never saw any flashing lights?? Why would EMT workers have to beat the door down if she called them?? Her pictures are totally false advertisement!! Her customer service is non-existent and her 'Dream Inn' is a 'Hitchcock Nightmare'!!! Needless to say we left Broom-Cindy's place and drove up the coast to St. Augustine to a much nicer hotel with cheaper prices.", "Date": "March 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chicago, NW burbs", "Title": "“The place that time forgot (but somehow, the cost has kept-up).”", "Author": "gewf631", "ReviewID": "UR24085617", "Content": "This is an OLD 2-story motel, with maybe 20 rooms total. The rooms were small enough, but they somehow added a kitchenette (sink, small fridge, several cabinets, a microwave, and some cook surface), making the room even smaller. Did it mention it was old? The tub is worn so smooth, that you almost have to wear shoes to stop from slipping. It's an OK location, but there's 100's of other beach front locations, so it's far from the only one. Given it's small size, you'd think the office staff would be very accommodating - but that's not what we found. Shortly after arriving, we realized our mistake and asked if we could only say a few nights (instead of 2 weeks) - no deal. Bottom line, unless you can get one of these rooms for significantly less than a room somewhere else, avoid the Dream Inn!", "Date": "February 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "ct", "Title": "“disgusting”", "Author": "globetrotterCt", "ReviewID": "UR17127328", "Content": "This place was a total rip off my girl and i payed 150 a night for dirty mold infested room. The only nice thing about this place was the beach. The ocean front balcony was filthy with dirty chairs and mold running down the ac unit. The shower had pubic hairs and mold and filth everywhere. The pictures on line are totally bogus. The pool is tiny with beach sand on the bottom of it. Staff was rude and seemed uninterested. No staff on most of the day had to ask for room to be cleaned because wasnt cleaned by 2pm. The rug had an iron burn on it. Dirt built up in jacuzzi one it was turned on. This placed should be honestly condemned and the owner should be sued for false advertisement. Also sink in room was clogged had to have owner come un clog it. It was so bad we left 2 days early and stayed at a hotel for half the price in orlando. This hotel was 100 times cleaner. I just want everyone to know to not to be fooled by the pictures on line. The grass looked dead and probably hasnt been watered in ten years and grounds were pitch dark at night. I want to thank the owners for ruining my first and probably only time in Daytona. Ps. my girl is still upset at me for picking this place.This place is downright disgusting and depressing.", "Date": "June 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "western pa", "Title": "“Nice, but....”", "Author": "buster1029", "ReviewID": "UR13553983", "Content": "The Dream Inn is inexpensive, in a nice location, close to attractions & restaurants, and overall is a decent hotel for the money. It is right on the beach, with some rooms overlooking the ocean. The rooms were simple, but reasonably clean and nice. The grounds are pleasant and fairly well cared for. There were a couple of problems, though. One is that there is often no one at the front desk. Someone is there only during a few hours each day and you might have to call someone to get help, if needed. Our biggest problem was a sprinkler system that came on during the small hours of the morning, spraying our door and window (instead of the grass). It made a terrible noise and kept us awake most of two nights. We like quiet, peaceful hotels, not ones with a lot of racket! If you stay at this place, be sure to get a second floor room or one on the ocean side. We're not sure if we would stay there again or recommend it.", "Date": "February 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“disgusting,unsanitary,gross place to stay!!”", "Author": "gkoneski", "ReviewID": "UR8467595", "Content": "We booked the Dream Inn for the time of 8-8-07 to 8-17-07. The room was disgusting. The shower had not been cleaned in sometime. I have a video of the slime buildup on the shower walls, with my finger slicing through the grime. The carpets where filthy and they never gave us soap after the first bar! We had to go buy some! There was a spot on the sheets of one of the beds that was there EVERYDAY! This was proof that the sheets were NEVER changed the whole time we were there! (5 DAYS!) There were cigarette butts and garbage EVERYWHERE by the pool, and in ALL the plants. You could not even enjoy the pool without getting cigarette butts stuck to your feet! I'm an ex-smoker and it grossed ME out! The pool also got dirtier as the days went on so buy the 5fth day it was turning to sand water. You couldn't see the bottom. It was also never cleaned. There was what looked like a condom by the pool on the cement...that was never picked up. NO ONE cleaned at ALL. The balcony of our room was filled with filth and rust, and could not be enjoyed. There was what looked like bird feces on the drawer handle in the kitchen. In my opinion it was inhabitable. The manager rarely ever there to complain to. Being on vacation we had things planned, we refused to wait around for the times he felt like being there, as it would have destroyed our appointments, and further ruin our vacation. I finally got to leave a phone complaint on an answering machine after several attempts at that, being told their mailbox was full! THEY SHOULD BE ASHAMED TO CHARGE THE PRICES THEY CHARGE FOR THIS DUMP! And the post they put on this site about the other customers pictures being posted before the hurricane cleanup is a joke! Its well after hurricane cleanup. They should sell and put a nice condo there. DONT STAY AT THE BAD-Dream Inn!!!!", "Date": "August 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando,Florida", "Title": "“great fun place!”", "Author": "puffpup", "ReviewID": "UR7571551", "Content": "Just got home today and had today 05/07/07. Had a great time! Staff is freindly but unobtrusive. Property is clean! Owners are very nice. Its an older property, but full of charm. If you like kitcsh and old school Florida. This is a great place. If you are on a budget,even better. The rates are fair. Its a place to sit back and enjoy!", "Date": "May 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alabama", "Title": "“A Pleasant Surprise”", "Author": "Hueytown", "ReviewID": "UR7239381", "Content": "We had a very nice spring break at Dream Inn. My sister and I went on our first \"Sisters Trip\" in nearly 20 years. This hotel came up while I was browsing AOL's travel site. The price and location were good, so we booked a king room with ocean view. From the street, the Dream Inn is unimposing. It is older and is built in the 1960's style: A low, concrete block row of rooms. But it immediately proclaims itself as unique by the bright yellow paint job and the replica Statue of Liberty statue outside the office, many dolphin statues, creative tile work, and is a study in bohemian decorations. The building, pool area, and grounds are immaculate. There isn't even time for sand to be tracked into the beach access causeway between rooms before it is swept away! The room we used contradicted the exterior design. All of the fixtures and furnishings in the room were sparkling clean and new. We especially liked: 1. Private beach access 2. Cleanliness 3. Good air conditioning 4. Location 3 miles from frantic city center 5. Sweet manager who seems to care about guests and hotel 6. COLD refrigerator that kept canned sodas frosty 7. Cigarette-smoking happy dolphin overlooking pool 8. Yellow \"home base\" is easy to find again from the beach 9. 10% off with room key at Denny's across the street 10. Easy free parking 11. Security (room safes, special room locks, well-lit grounds) I recommend this hotel to anyone seeking a sane stay - neither chaotic nor boring - in crazy Daytona Beach during spring break.", "Date": "March 28, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "florida", "Title": "“Dream Inn was rude even when I made the reservation”", "Author": "florida111", "ReviewID": "UR5955441", "Content": "We wanted to stay in a small Florida hotel and Dream Inn looked perfect. We made our reservation online and received our confirmation. Then a representative from the hotel called us, wanting us to sign a form which she would fax to us to guarantee that we would pay for our stay. We thought this a little unusual since we had already booked online with a credit card. We didn't receive the fax, and since our reservation was in two days, we didn't think much about it. We received another phone call from the inn the day before our reservation. Again, they wanted to know where the fax was. When we explained that we hadn't received it, it became confusing as to whether we had a reservation or not. In addition, since it was a weekend day, there was no way for them to fax us another form without great inconvenience for us, since we have no fax machine at home. The experience put us off. The lady from the Inn was confrontational and patronizing in her tone, making it hard for us to imagine being comfortable in her hotel. It just didn't seem like a good way to treat a customer. In the end we cancelled our reservation and went elsewhere.", "Date": "October 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Augustine, FL", "Title": "“The Best... Dream Inn!”", "Author": "Freeum", "ReviewID": "UR5911592", "Content": "Carrie and All, This is the best place I've found to stay in Daytona Beach...I just wanted to tell you what a great time we had at the Dream Inn..the rooms were wonderful, the staff fantastic, and the weather, perfect. Dream Inn has a real \"Florida of Yesterday\" quality that is so lacking in the mega Hotels and Resorts. I'd come again in a \"heartbeat\" and actually plan on another stay in the near future. My thanks to you all for a memorable vacation. SIncerely, L Gagne", "Date": "October 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wabash Indiana", "Title": "“great relaxing stay”", "Author": "julielutton", "ReviewID": "UR5699750", "Content": "My hubby and I stayed at the Dream Inn in Aug. 06 for 4 nites. I had stayed at this property before but it had been several years ago. We found the room spotless and very nicely appointed.The bed was very comfy(this is very important to us) The grounds were in great condition. The pool was very clean and we really enjoyed all the lounge chairs and palapas in the pool area. The pool area overlooks the beach. This property is small and does not have a restaurant or lounge but that is no problem for us as we like to go out for meals on vacation. The room had a refrigerator, microwave and coffeemaker. We purchased snacks and drinks and just relaxed and really enjoyed ourselves. The staff was helpful with any request and took care of requests very very quickly. I am a travel agent and can be hard to please but if you want a small intimate clean property with great service this is a gem.", "Date": "August 22, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Great Stay...”", "Author": "A TripAdvisor Member", "ReviewID": "UR5339392", "Content": "My husband and I stayed at the Dream Inn June 4th thru June 7th, 2006 and loved the motel. The rooms are very clean and the staff is wonderful. We loved the small, intimate feel of the motel next to other giant impersonal hotels. The grounds were beautifully done and we felt like we were in a tropical retreat. We look forward to staying there again as soon as we can.", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Something to remember”", "Author": "A TripAdvisor Member", "ReviewID": "UR5331905", "Content": "Was fabulous, I had a lot of things to remember ….", "Date": "June 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Dream Inn - May 2006”", "Author": "A TripAdvisor Member", "ReviewID": "UR5187308", "Content": "We stayed at the Dream Inn just a few days ago. I read mixed reviews on this site so I wasn't sure what to expect. First of all, we got a great rate - about $55. The rooms were clean, the staff friendly. There is a nice area for relaxing in the sun right on the beach. The pool was small but just fine. It wasn't a luxury resort by any means, but taking into consideration the low rate and size of the resort, we were very happy with the stay. We will stay there again if we make it back to Daytona.", "Date": "May 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“great”", "Author": "A TripAdvisor Member", "ReviewID": "UR5036041", "Content": "Very nice family run motel with a great location close to restaurants and right on the ocean.", "Date": "May 5, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Rooms": "2", "Service": "3"}, "AuthorLocation": "Unknown", "Title": "“Low to marginal hotel needs lots of updates.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4968030", "Content": "Hotel needs lots of items to be updated. Bath and shower faucets barely worked.Towel rack was broken off wall.Rooms very small. Left phone cord in room and staff wanted $25 service charge plus mailing cost to send $2 package.", "Date": "April 12, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Illinois", "Title": "“Dream Inn and think about staying somewhere else”", "Author": "VacationMomFor2", "ReviewID": "UR4774118", "Content": "We saw pictures of the Dream Inn online and thought it looked like a nice place to stay. The rooms looked nicely kept and tropical and the pictures of the pool made it look inviting. We drove to Florida for Christmas to visit family and had to call the Dream Inn to let them know that we were going to be late for check-in. The woman at the desk said that we could arrive when we wanted but the front desk would be closed after 7 pm. She assured me that our room would be ready and not to worry. She also let me know that since the desk was closed they would LEAVE OUR KEY UNDER THE DOOR MAT!!! Was that a joke? Once we arrived the first thing I thought was get me out of here. And sure enough, our key was under the mat! Anyone could have known that they leave keys under the mat and gone in our room. The room, needless to say, was not tropical. It wasn't even typical. The carpet was dirty and the room had a musty oder. The ceiling was patched up and the bedspread was brown and old. When I called the woman to explain we were unhappy with the room she said they had just updated the decor and that we wouldn't be able to see her until the next morning. Her son was supposedly staying on site to handle any emergencies. They were not willing to refund any money and offered no appologies explaining it was a clean and safe place to sleep. They also explained it was safe since the police often sat in the lot across the street to monitor. We ended up staying at the Days Inn next door, thank God they had an open room.", "Date": "March 30, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Nightmare Inn”", "Author": "A TripAdvisor Member", "ReviewID": "UR4598645", "Content": "Place is a dump. Does not look like the facility advertised on their web page, maybe 20 years ago! When we arrived we were very unhappy and the owners weren't interested. They told us we could go somewhere else but we weren't getting a penny back. They were opening the office late, closing early and never around to address any of the problems. Our room was under construction, missing wall tiles, major water leak in the room, carpet was soaked and very bad mildew smell, bathroom sink was clogged, electric outlet in bathroom did not work, smoke detector was missing from room, fire extinguisher was over a year expired, I could go on and on. Their website states \"Enjoy southern hospitality by Louisville, KY owners that endear themselves to guests with a brand of charm and personal attention that sets the Dream Inn apart from others\" What a CROCK! Trust me, you don't want to stay here, you will regret it immensely. They offer NO REFUNDS no matter how unsatisfied you are and guarantee NOTHING. Days Inn, right next door, would be a much better choice in comparison.", "Date": "March 10, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Be afraid, be very afraid”", "Author": "A TripAdvisor Member", "ReviewID": "UR4254785", "Content": "Don't stay here. The owners do not honor their stated reservations policies, and have a misleading website, in terms of the accommodations. My dream became a nightmare - I filed a complaint with the Better Business Bureau.", "Date": "December 21, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "melbourne, fl", "Title": "“Not very good”", "Author": "jifjifjif", "ReviewID": "UR3796656", "Content": "This hotel is very average. Hard tile floors, brick walls inside the rooms. Pool is small. Front desk staff is impossible to get a hold of. Their rules and policies are very strict. Overall, not good at all. For the same cost, you can get a room at the Ocean Walk Resort which is brand new and two steps from everything to do.", "Date": "August 22, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“All lies! Should be called the Dream On.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3704621", "Content": "Took my wife here for Mothers Day weekend. Cost us a bundle to spend one night checking out early because the place was not what was shown and described on the website or by the owner on the phone. This place is a dump. Was \"completely renovated in 2005\" so the website says. Nice photos too. Wonder where they took them because it can't have been Dream Inn property. All lies on the website and words on the phone from the owner. We had a jacuzzi suite complete with black mold in the kitchenette and bathroom. Renovation consisted of adding a jacuzzi tub in the small bedroom space and about 10' x 10' of new cheap carpet. We were told we could walk out of the room directly onto the beach. Right, if you go around to the court and down the public access street. When we went to check out explaining we were mislead and didn't appreciate the conditions we were told people were waiting in line for the room we had. Odd we didn't see any of them. WARNING. Don't go here if you like cleanliness, space, polite staff, bang for your buck. Who am I to judge this place? Just a business man who spends about 100 days a year in paid lodging around the continental U.S. I am telling all my friends and even enemies this place should be avoided at all costs. Next renovation should be from the ground up with new ownership.", "Date": "July 27, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Avoid Dream Inn!”", "Author": "Joasia", "ReviewID": "UR3614491", "Content": "After reading some negative comments about Dream Inn in Daytona Beach Shores, FL I proceeded very cautiously to make reservations via email - I was quoted $100/night (despite a $69 fall special I saw earlier) and instructed to call Cindy. When I did she gave me a higher price and dismissed the quote I was given saying the correct price is $110. Per their policy (1/2 cost of stay upfront) I sent her a check together with a copy of the emailed quote for $100 saying out of decency they should honor it. She called me when she received the check demanding that I call her back. When I did - in a raised voice she told me I will not teach her how to run her business and inquired if (despite her being unapologetic) I still want to stay there. She said she's The Owner and it's her internal problem that the price keeps going up - NOT the customer's concern. She made it clear who the boss is (called me \"honey\" but kept talking in a rude raised voice) and pushed me to reconsider...I did and canceled. What a creepy experience!", "Date": "June 27, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Deceptive website”", "Author": "A TripAdvisor Member", "ReviewID": "UR3494048", "Content": "The oceanfront ground floor rooms do not have a private balcony. You have to share it with the room next door. There is a small wall with a large glass window between the balcony and the ocean, which needed washed. My nephew's room faced the pool, oceanfront, but he had a cement picnic table in front of his window that was mostly in use by loud guests. He didn't even open his curtains. Everyone could have seen into his room. The woman owner was rude when I called to get the hotel's local phone #. She said it was on the phone, it wasn't; it was in the hotel's black book; it wasn't. She hung up on me after giving it. There are signs everywhere about charges if you do this or that; not washing dishes, using the dead bolt for a door stop, taking towels, etc. The rooms on the website with the 2 queen beds, oceanfront, are not the rooms on the ground floor that we rented.", "Date": "May 23, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Perfect place for honeymoon”", "Author": "A TripAdvisor Member", "ReviewID": "UR2202115", "Content": "The Dream Inn is a gorgeous place to stay if you're looking for the complete honeymoon getaway. The jacuzzi in the jacuzzi suite was clean and looked as it did in the magazine pictures. Our suite was right in front of the beach, which was a beautiful oceanfront view. The desk people were rather pleasant and they took care of a couple minor problems within minutes, day or night. Plus, this hotel is perfectly positioned between the craziness of downtown and the serenity of Port Orange and Ponce Inlet. Last 2 nights we did stay in courtyard room (reg. room). That was pretty plain, but still good air conditioning and nice seating area right outside our door. Definite vacation spot, planning to return soon.", "Date": "June 18, 2004"}], "HotelInfo": {"Name": "Dream Inn", "HotelURL": "/ShowUserReviews-g34172-d75061-Reviews-Dream_Inn-Daytona_Beach_Florida.html", "Price": "$59 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3217 South Atlantic Avenue</span>, <span class=\"extended-address\">Daytona Beach Shores</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "75061", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/8a/f0/ba/view-from-oceanfront.jpg"}}