{"Reviews": [{"Content": "A littel piece of heaven       Heart  arrow made of flowers on our bed!", "Date": "Jan 10, 2009", "ReviewID": "UR736355027", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "huggybearDublin"}, {"Content": "Best staff in Bali We spent 6 days at Alam Anda and loved it!! The staff in this resort are by far the warmest, most welcoming professionals we had come accross in our many accommodations in Bali. Bad time of year for divers though, as the weather was most unusual - strong winds and buckets of rain and the seas were choppy to say the least. Big chunks of retaining wall surrounding the hotel fell victim to the crashing waves and eventually collapsed. The place was however beautifully maintained and very clean.Great food and once again, amazing personnel.The management team could use a little warming up though. Giving guests the time of day (good morning? good evening? bon appetit? have a nice day?) would be a nice start and I don't think too much to ask. Don't worry, I don't want to become your best friend, but it is the hospitality industry after all. The Indonesian staff are spot on and it would be nice if senior management could pick up a tip or two from them.", "Date": "Feb 27, 2008", "ReviewID": "UR887657668", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kaksMontreal"}, {"Content": "Wow! This place is beautiful and so relaxing Alam Anda is a beautiful place suituated on the North coast of Bali over the hills, mountains, rice paddies and volcanoes from Denpasar. Although the journey takes about 3 hours from the airport, there's plenty to see on your way with many beautiful views. Just ask the driver and he'll stop for you to take photos.The hotel is nothing short of excellent for couples/adults. The individual and well spaced bungalows around the immaculately kept gardens are just stunning. Everywhere is so clean. The staff could not be more friendly. All are very kind and helpful and cannot do enough for you to make your stay more relaxed and enjoyable.Breakfast (included in your room rate) is a buffet with unusual fresh fruit juices such as Papaya and Watermelon along with fresh fruits, bread, some cereal plus some warm food (usually Balinese). There's also eggs which will be cooked for you to your liking. Of course, coffee and tea are also available.Lunch and dinner are off the same menu which are cooked fresh and there are daily specials based on the local cuisine.We ate a good variety off the menu and specials in two weeks and certainly did not get bored or at all disapointed by the choice. The portions are also quite large. In short the food and service is simply outstanding.If you think this place is going to be expensive, think again. Not only are the rooms excellent value, we found it very difficult to spend 拢15 per day on food and drink.The spa is very good value with a variety of massages available and skilled staff with the sole aim of ensuring you leave completely relaxed.A very big thank-you to Sigi the manager of the hotel who made us feel very welcome.Now onto the very well run (Werner Lau) scuba diving centre. We did a total of 15 dives each, including 3 on the house reef (one night dive). First dive was a little strange because of the dark (volcanic rock) sand. It looks a little dirty and the light appears a little darker than normal. It's just a bit odd the first time.The diving and divercity is simply unbelievable with many species you would either never see or find it very hard to see anywhere else in the world, e.g Ghost Pipefish, Seahorses, Mimic Octopus, Harlequin Shrimp, many Nudibranch varieties and lots of macro life like small finger nail sized Lion Fish and Frog Fish.There are some boat dives leaving from the hotel but the majority of dives are shore dives with a journey by road (from 45 mins to a few hours). All dive sites are remarkably very different with deep (30m) wreck, beautiful coral reefs, cool blue water (Sun Fish territory) to sandy shallow dives. The dive staff are brilliant, with the guides being helpful without being intrusive. The dive centre was managed by married Danish couple Ulrik and Rikke who very clearly know how a good dive centre should be run. A big thanks goes to them again for there friendliness and excellent standards.", "Date": "Nov 7, 2007", "ReviewID": "UR287959182", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "beakynb"}, {"Content": "Sehr sch枚nes Hotel       Sonnenuntergang", "Date": "Jan 27, 2008", "ReviewID": "UR333222315", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Sasse"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g951339-d776567-r23442763-Alam_Anda-Sambirenteng_Bali.html", "HotelID": "776567", "Price": "$68"}}