{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado, United States", "Title": "“A Good Stay”", "Author": "Art S", "ReviewID": "UR126362734", "Content": "If you're looking for a fancy hotel, this is not the place. The building is obviously old, but the inside is being renovated. However, I enjoyed my stay here very much. The location is great with plenty of restaurants, a grocery store, and a Walgreens all within walking distance. Public transit is plentiful including the Vermont/Wilshire subway station which is just one block away. This allows quick and easy access to most of LA including Hollywood and downtown. The staff was friendly and helpful. My room was nice sized and cleaned daily. The breakfast wasn't that great,but there is a Denny's and an IHOP within 1 1/2 blocks. For the money, I would highly recommend this facility.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Vail, Arizona", "Title": "“Disgusting Hotel”", "Author": "bgibsonaz", "ReviewID": "UR126000498", "Content": "My bad... didn't read all the reviews before making reservations. Stayed here for the PAC-12 basketball games at Staples Center. We reserved a king bed but upon arrival they only had 2 doubles. The online photos do not show how disgusting the rooms and overall hotel are. Breakfast is a joke. The neighborhood is quite scary, so from now on I will contact the local police department to find out the safety of the location. Paint peeling from walls... water leaked from shower all the way into the sink area. Just be warned... the price may be nice but in the long run I'd much rather pay more and have a clean safe place to stay.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Can't be beat for the price”", "Author": "cobbson", "ReviewID": "UR125488299", "Content": "Stayed at L.A. HoJo's the last weekend in January, 2012 to attend the LA Fitness Expo. Was travelling alone so just needed an inexpensive place to rest my head. I was pleasantly surprised. True, the place was a bit shopworn, but my room was clean and included a fridge, working TV, ironing board and iron, hair dryer, coffee maker with supplies. Everything worked, no problems. The continental breakfast included coffee, donuts, cereal and milk, danish, bagels & cream cheese, bread , butter and jellies, assorted juices and a toaster...What more could you want? I don't understand the comments about the free continental breakfast. It was much more inclusive than most. The parking was indoors just adjacent to the hotel (no need to walk outside). The young lady that checked me in was most helpful and there was plenty of ice in the hall ice maker. No problems with my bed or anything else. I live in Las Vegas where for the price of my room ($74.00) you can stay at a luxury resort during most of the year, but for Los Angeles, this place is a steal. Close to the Convention Center and a zillion Korean restaurants to explore. Also a short ride to Lafayette Park for some R&R. It's a Wyndham hotel, so if you join their rewards program, you can get free nights in any other Wyndham hotels. I'll be staying there next year on the same trip.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“great deal for $67!”", "Author": "guolankun", "ReviewID": "UR123337570", "Content": "great location. Conner Walgreens. walking distance restaurants plenty. few miles from any major parts you want to visit in LA.in the middle of everything. staffs few, but super nice and helpful. better Than some five star ones like Hilton I stayed. I am tourguide, over 200 days a year I am in hotels. this is great deal if you want inexpensive good location clean bed motel. rooms are old. bed and towels are clean. free internet, slow. free parking, great . free breakfast, simple but not bad. room spacey.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oceanside, California", "Title": "“Nice Stay”", "Author": "TheUglyPhotographer", "ReviewID": "UR119661180", "Content": "I like this hotel the staff was friendly and the room was clean and large. The surrounding area was very quiet and the hotel is located near two metro redline stations. I will stay at this property next time I am in LA. I had an enjoyable stay.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Overrated”", "Author": "ice_latte", "ReviewID": "UR119611185", "Content": "We decided to book this hotel because of the good review. We regretted it. The lobby was a bit shabby. the lift was a bit old and small. It fit two people with 2 large luggage only. The room was a bit gloomy and the toilet was very small. The bed cover seemed like old and dirty. The heater was full of dust. The furniture was a bit old. The parking was a bit cramped but it's free for the guests. Location was ok. breakfast was so-so. We're glad we only stayed for 1 night.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very good for the price”", "Author": "kalyan b", "ReviewID": "UR118616417", "Content": "The place is neat, near to the pier strip and also has good break fast. If you are considering for a motel in budget and without any issues, then this is the place to be. I loved it.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Guanajuato, Mexico", "Title": "“This place is awful”", "Author": "gypsyiz", "ReviewID": "UR118395114", "Content": "The motel is infested with bed bugs. It's disgusting and the staff doesn't seem to care.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect if you need a budget bed and aren't expecting luxury.”", "Author": "Groovyseg", "ReviewID": "UR117423483", "Content": "We were dreading our stay when we read reviews on Tripadvisor, when we arrived we were surprised. Check in was easy, we were given a massive corner room on the 3rd floor. The sheets were clean, the floor was clean, towels were clean. The only gripe we had was the brown stained bathtub that others have mentioned before. The shower itself was pretty powerful and quite good!! The location is great, right around the corner from the Metro and Wilshire Blvd (a straight road that takes you out to Santa Monica). If you need somewhere to crash and aren't fussy, this place is fine. We would stay again, there was nothing wrong.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Sacramento, California", "Title": "“In regards to the “All this hotel is missing is bed bugs!” post....”", "Author": "p r", "ReviewID": "UR116785243", "Content": "You can now say that it does have bed bugs. I have about 50 bites all over my body thanks to this nasty place. On another note, they dont even have enough parking for all of their guests so you are forced to park out on the street somewhere when the garage fills up.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“It is a good location!”", "Author": "carolynnangjk", "ReviewID": "UR109605882", "Content": "We had the room on 5th floor which happens to be the only room on the floor so somehow it create privacy and the room was large! Not sure in comparison to other room but surely the entire building is not new but overall we are satisfied - we get lots of room space for our stuff. The location is great! so near to Metro, bus stops and free car park (more space than most value hotels in LA i believe) and we always get a good parking lot from the help of the kind and helpful security officer. The breakfast is not the greatest spread but it gives a satisfied simple meal for our stomach - decaf coffee, reg coffee, juice, bread, doughnuts, muffins, and cornflakes etc. We returned to stay at the same hotel after 1 week (having return from San Frans) after experiencing the nice hotel. Hotel was also kind to let us put one luggage behind so we do not have to overload our luggage on plane till we return. The lift buttons were not the best but the building is only 5 storeys high, so no worries unless you have luggages. you get coffee machine in room and a big bed. free newspapers! it is at Korean town so no worries on food, walk out and you can find food and even groceries nearby. If you drive, it is near to HW and so far we did not get into bad traffic. Close to chinatown and central LA.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Avoid even if it's free!!!”", "Author": "Sabrinaachka", "ReviewID": "UR109574632", "Content": "When our friend checked into their room there was mold all over the ceiling. They complained to the front desk and were offered another room which was also unclean with stains all over the walls. The third room they received looked great, until they saw hair all over the shower and a HUGE roach on the wall which they took a picture of. Our room seemed decent but the shower looked horrible. My boyfriend has allergies and after an hour he started coughing and wheezing - probably due to the mold in our room as well. Its not worth staying there, the comfort inn nearby is way better and on a whole other level.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“Definitely worth the money! Pleasant surprise.”", "Author": "Camillacci", "ReviewID": "UR103498355", "Content": "After reading the reviews on this page, I was dreading staying at the Howard Johnson hotel in Los Angeles. However, when I arrived at the hotel, the staff (reception & housekeeping alike) were all very welcoming and genuinely friendly. I was checked in quickly, and given my room key. I got in my room, and was so happy with the quality of the room, and the amenities. Not only did the room have a big comfy bed, it had a small fridge (larger than a minibar), an aircon unit, proper shower & everything was clean. The room and the fittings were old, but nothing was at breaking point or dirty. The housekeeping ladies cleaned my room daily, changed the bedding, vacuumed, dusted, pretty much everything you could ask for! My flight back to the UK left around 5 pm, and so I had plenty of time between handing back my roomkey at 12, and having to be at the airport around 3. While handing back my roomkey, the man at the reception (can't believe I didn't find out his name!) called the houseleeper and asked if I could keep the room until 2 without any extra charge. This the housekeeper agreed to, and I got to stay in the comfy room until my flight, rather than having to sit in the lobby or go out wandering by myself. Excellent service from beginning to end, couldn't have asked for more. Will definitely be staying with them again if I'm in LA, excellent value for money!", "Date": "April 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Mississauga, Canada", "Title": "“All this hotel is missing is bed bugs!”", "Author": "lukaszzzzz", "ReviewID": "UR98645911", "Content": "So first of all, I would like to start off by saying that my trip to Los Angeles was one that I wanted to be a decent price. I chose this hotel because it looked decent (All that I was expecting was decent), however this hotel was by FAR the worst hotel I have ever stayed at! When booking the hotel my only expectations were that it would be clean- that was it. This hotel however was by far the dirtiest, and most ruined hotel I have ever seen- I would not think they would use this as a homeless shelter let alone let people stay here and pay for it! To keep this short, I will just list some of the things that were wrong with this nasty hotel: FIRST and foremost was the bathtub- it was so old and clearly never cleaned that it had turned yellow mixed with black- it clearly needed replacing. Me and my friend were disgusted to even step into it- we had to put a towel down when taking a shower and once we were down the towel had turned a brownish color. It had also been obvious that the shower rod had been replaced after failing (or most likely reused in a different spot, because they didn't even bother to patch off and paint over the huge holes it help after assumingly falling down. Secondly, the top of the TV cabinet had NEVER (seriously!) been dusted, the dust on top of it was permanently stuck there and would have to be scrubbed in order to get it off. Thirdly, the bed sheets smelled like sweat- when we got to our floor the first thing we noticed was that alot of people doors were open the entire time, and there would be \"ladies of the night\" coming in and out all the time. Fourth- the bathroom sink was outside in the bedroom (alright, no big deal) however there was paint chipping from the sink which had clearly been painted with regular paint as opposed to actual sink paint. Not only that, but there was a HUGE rust hole in the sink that you noticed when looking into the mirror, it was very gross. Fourth- the old tube style TV we had in the room did not turn off, we were able to turn the screen off by turning off the receiver but the TV never actually turned off, so we had to listen to the buzzing noise from the TV all night. Fifth, all the walls were REALLY dirty, cracked, and had paint chipping everywhere, especially the bathroom. When we first got to the hotel our toilet paper was all blue after being soiled with what I am assuming was toilet cleaner. One morning, my friend stepped on something in the hotel lobby that injured her foot ( she was wearing sandals), and the hotel didn't even have a bandaid to provide her with. Also, I would never even think of making coffee in the coffee maker, it was so dirty and had coffee burned into the warmer, very gross. Overall, all I can say is that I wasn't expecting much, no frills and a clean room, but this was just ridiculous! I would NEVER recommend this hotel for ANYONE, and I am EXTREMELY serious about this place being a dump. Please DO NOT stay here, I really am the type of person who doesn't need frills or anything but this was disgusting. O and by the way, the \"WiFi\" this hotel offers will load one page in about 10 minutes and then will stop working.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“great location great for your money”", "Author": "dryank", "ReviewID": "UR95133913", "Content": "i stayed here in oct 2010 we had 2 rooms it was 6 of us we had a great time it is in a great location free parkin ihop a block away room was clean they always changed the towels always had new toilet paper slept great tv has cable so we watched the mlb playoffs, my veiw faced the back of the hotel but that didnt bother me if your a picky person and wine about everything this hotel is not for you but if you need a nice place to stay good sleep good shower i would recommend this hotel", "Date": "January 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“If location is your priority”", "Author": "moulin829", "ReviewID": "UR90053925", "Content": "It was okay because of the location for us, it is near Griffith Park and the observatory, and not too far from Santa Monica Pier, our two destinations for our one night stay. The inside of the hotel is not exactly attractive, but it served the purpose for our trip and we actually got a pretty good deal, so in our case it was worth it.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“horrible”", "Author": "yehyeh512", "ReviewID": "UR82263323", "Content": "where to start if you are looking for a reasonable priced hotel close to the universal studios, staples centre this is the way to go. But for the price of $60 per night for a hotel that is not clean and looks like it's where the bed bugs live it is not worth it surprise nothing bit me. i had to change rooms 3 times and every room was filthy was not as clean as i would expect it to be it just looks like they come in change the sheets if not just fix the bed sheets and change the towels and your off. room 213 airconditioner barely works. the keys for every room seem to always deactivate on its own. So i'd always have to ask for 2 keycards. The higher the room is the less if not no internet connect/wifi available, it barely works on the the second level where we were told was the best place for proper wifi connection nope. that didn't really help either. what you can see in the pictures that's exactly how it looks in person. We were never told where \"the continental breakfast room\" was located let alone they even had one. hallways also doesn't look like its been vacuumed. There's fast food just walking distance from the hotel other than that I do not recommend this place at all.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sacramento, California", "Title": "“Welcome to the un-Quality Inn”", "Author": "SactoGamer", "ReviewID": "UR76515445", "Content": "Calling this hotel the Quality Inn is like calling SPAM a gormet dish for only the rich and the famous. The Mid-Wilshire Quality Inn is anything but quality. While the hotel was affordable (I payed in the mid-$50's), you get less than you pay for. Sure, the room had the standards (bathroom, coffee, bed, television, free wi-fi), but the quality of it all was so poor it's hard to imagine that the place was even allowed to be open. The bed, while fairly comfortable, was about the only visually clean thing in the room. Everything else, however was either broken or permanetly dirty. The carpet was stained and had a few rips in it. The ceiling had water stains. The television would not turn on. The Wi-Fi was hit-or-miss. Worse yet, the bathroom was virging of filthy. The shower curtain was hanging on to only a couple of rings, having been torn off of most all of them, and the shower curtain rod was threatening to fall off of the wall. The toilet wasn't well-installed into the floor and had a slight wobble to it and the toilet seat had way too much play in it. After two nights in the hotel, I had enough and found a room in Glendale (which is much farther away from Downtown LA where I needed to be) at an Econo Lodge for the same price and it was much, much better. Until this place gets its act together, avoid at all costs.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“Know what you're getting into before you book”", "Author": "writerguy33304", "ReviewID": "UR70546362", "Content": "It's vital that you know what you're getting before you book this hotel. There are several positives for this property. The location is great if you're using public transportation. It's a mere 2-3 blocks to the Red/Purple subway lines. My room was clean and I never heard my neighbors. Also, the bed was comfortable and their TV carried at least 60 channels plus free video-on-demand. Lot's of negatives: - U-shaped building means interior facing room have no view and no privacy (5 yards from my window to my neighbor's window) - Staff seemed annoyed that I interrupted their conversation when I tried to check in - My shower was leaking and despite me reporting this, it wasn't fixed in the 3 days I was there - There are many homeless people within walking distance of the hotel - The property is in Korea-Town...nothing wrong with that, except many of the Korean businesses around the hotel only had signage in Korean. This isn't the hotel's fault; but, I found the neighbornood very unfriendly to anyone not Korean. I had a ridiculously low rate, so I'd say I got what I paid for. I'd never, however, pay more than $50/night.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Montreal, Canada", "Title": "“Terrible hotel”", "Author": "JSRtrip", "ReviewID": "UR69595470", "Content": "This hotel is in a part of LA called Koreatown. Most surounding commerce banner are written Korean and not translated. We booked this hotel because it was close to our car rental. What a mistake. Room was discusting (I even found hair in the ice bucket). AC stopped working during evening so we had to change room after having unpacked luggage. Don t go their with kids, neiborhood and some customer don t look safe. I even saw a black woman who I don t really thing was a female (see where I m gooing). So much other bad thing to say but I will stop there", "Date": "July 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "TheLovells", "Title": "“What more do you want from a 2 star hotel??”", "Author": "TheLovells", "ReviewID": "UR55207945", "Content": "We stayed at this hotel having gotten a great deal through ebookers for our holiday. Despite the ‘bad reviews’ and no frills 2 star accommodation it isn’t a bad little hotel to stay in. Firstly the area isn’t much but you are only 6 miles from Hollywood, a very short drive indeed. You are in a good central location to do all the parks from Knotts Berry Farm and Disney to Six Flags Magic Mountain. The parking is free and a security guard is usually present so we had no worries with the hire car. The rooms are spacious, have a mini fridge, air conditioning and heat if needed. The bath rooms really have seen better days but are clean and we found the water pressure to be so great that it was like having a power shower, although the showers were fitted for short people, not so good for my hubby who is 6’6. LOL There is also a coffee maker and the supply of coffee, tea and sugar is topped up daily. Bedding is always washed and daily maid service very good. You also get a good sized TV with many channels. The breakfast is fine as long as there are not too many people already in the breakfast room, not many seats mean you could end up having to take your breakfast back to your room. Getting up early is advised! The breakfast consists of tea, coffee, juice, water for your drinks. To eat is white and brown bread, cream cheese, jams, butter, croissants, donuts, mini muffins, yogurts and fruit. There are two toasters and a microwave that you need to time with your watch as the timer is broken and any food you bring will explode if you forget the watch.  There is a TV in the breakfast room and free papers just outside. A washer and dryer on the 3rd floor which takes 25 cent coins, a dollar for each wash or dry…very handy! Free WI-FI in all rooms which is good for those on business or for those with an internet phone. The manager is very nice and friendly and the breakfast room and cleaning staff are lovely, they really do a great job. The lady that usually does the breakfast in the morning couldn’t have been nicer to us, she needs a raise! ;-) If there are any problems like a blown light bulb or something not working the staff are quick to fix the problem. You only need ask. On the whole this hotel is a little dated but clean and friendly, well located for those with a car or not afraid of the bus. I would recommend this hotel to anyone who can look past décor. Thanks to the staff for making us feel welcome and we hope to see you again some time.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Actually Okay All Things Considered”", "Author": "CTBCalifornia", "ReviewID": "UR54639876", "Content": "I read the other reviews so was prepared for the worst, but it really wasn't that bad. The neighborhood isn't great, but I knew that already from past visits. My room was really large, it was clean, and the bedding was nice. The bathroom shower curtain rod was barely attached to the wall, but I was careful and it didn't fall off so no problem. There were some hard water stains in the tub, which didn't drain really well, but thats a small thing. Yes the hallway had a disinfectant smell, but the room was fine. Located 1 block from a Metro station, and 2 blocks from my training class, I was able to travel back and forth from the airport for $5 each way, and walk to my meetings, with a room price well under $100, it was all in all quite acceptable to me. Note that I am a low frills person, I prefer camping & hostels to room service, so this hotel may not be for you, but ok for me.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Location": "2", "Rooms": "1"}, "AuthorLocation": "New Marlborough, Massachusetts", "Title": "“Perfect for your enemies”", "Author": "zebrafeet", "ReviewID": "UR52447648", "Content": "We had 2 rooms for 6 people. One room had an ant infestation: we asked that it be taken care of daily. Since it was New Year's they were sold out and no services until Monday (we left the day before). Um. Ok. Room #2, had spiders. Patched ceilings, stained chairs, 1/2 of the electrical plugs working, ice machine? a joke. AC units didn't work in either room. No front desk after 12. 2 pluses: guarded parking and free internet (tempermental).", "Date": "January 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Alexandria, VA", "Title": "“Disgusting - Stay Away”", "Author": "cindel25", "ReviewID": "UR26337135", "Content": "Ok, it wasn't THAT bad but for the price they're charging you, you think they would at least update the paint or carpet. First off I had trouble finding the place; I took the metro as it was just a block away but it was BEHIND the metro despite what Google maps told me but I disgress. Second, the front desk tried to peel the sticker off my bank card. I kept telling him that you can't do that as it's a bank issued card but I never had a problem. I even offered to pay in cash or if he was really worried, he could charge it and call the bank to verified. The lobby was small and the elevator goes up but not down; had to take the stairs. The hallways look like a seedy 80's motel in those campy porn movies with the chicka chicka bow wow music in the background. I could not turn on the light in my room. I had to hold the door open to find the lamp. Safety issue much? Anyhoo, the chairs and desk were run down and there was a ugly disgusting fridge underneath the sink. (I didn't use it). The bathroom was DISGUSTING. The tub was yellow and there cracks above the shower. Good thing I was only staying for one night.", "Date": "March 17, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Orange County", "Title": "“Don't Take the Risk - Beware - Lost Money and Time - Choose Another Hotel”", "Author": "HonestlyOrangeCounty", "ReviewID": "UR15283801", "Content": "I personally contacted the hotel manager to book hotel for two employees who were to stay overnight in LA. We provided our drivers liscense, credit card, names of employee, proof of payment, and signature to make reservations. When the two employees got to the hotel that night they were told that no reservations had been made. Even with paperwork in hand, our employees were told they did not have a reservation. Interesting how they recieved all our vulnerable personal data...and we did not receive a room in return. When I called to let them know that we had lost close to $600.00 dollars in lost wages, time, and transportation expenses at their mistake, they said they never input the reservation and wanted to offer a 15% discount on a nights visit in the future. That totals $19.00. That's customer service for you. Truly, don't take the risk...your investment is better secured elsewhere.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "North Carolina", "Title": "“Disgusting!”", "Author": "GenieK", "ReviewID": "UR8716877", "Content": "I booked my stay at this establishment through Choice Hotels. Upon my arrival the cart I retrieved with which to hang my clothes for entry, was literally falling apart. The rack to hang the clothes upon, was hanging itself...off the side of the cart! As I entered, the snack bar area was covered with wiring and padlocked. The elevator barely moved and took forever to move from one floor to another....not to mention that the buttons for 'up and down' were literally cracked and bursted! The carpeting in the hallways was filthy...and the carpeting in the rooms not much better. There was a foul odor. The continental breakfast boasted muffins, coffee, doughnuts, cereal etc.... They actually included two loaves of bread ! My telephone directory was in Korean and when I asked for one in English I was told I would have to come to the lobby and use the one attached to the pay telephone. I would not begin to walk outside alone and was confined to my room for days! I used points that I had accumulated for a portion of my stay and was appalled that Choice did not reinstate these points given such an experience!!!! Of course for the price I did not expect the Venetian that I had just left in Vegas, but I DID expect clean, and safe with everything repaired and in working order. My ONLY positive comment might be that the staff was courteous.", "Date": "September 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“nice for the price”", "Author": "xxray57", "ReviewID": "UR7853066", "Content": "Hotel is clean and secure, and easy to find. In Korea town, it was right where we wanted to be, one block off Wilshire. Staff was very pleasant. Continental breakfast was just that-- don't expect a sous chef. Room was adequate, beds comfortable. There was peeling paint in the bathroom, and the tub needed re-finishing and drained slow. Great water pressure though. There is a fridge in the room and free HBO. Free Wi-Fi in lobby. If you're some hoity-toity type, don't stay here, but if you just want someplace clean to sleep while you conduct your buissiness, this is a good deal!", "Date": "June 15, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sacramento, CA", "Title": "“I should have heeded previous reviews!”", "Author": "DDWSacramento", "ReviewID": "UR7705437", "Content": "The year old reviews stated that the place smelled bad and that the exercise room did not exist as advertised. I didn't read the reviews until just before our stay. Well as of May, 2007 the exercise room was still being \"renovated\" and the rooms still smelled bad. I rented two rooms for myself and my accompanying staff and both rooms were supposed to be nonsmoking, but smelled of stale tobacco or mold. We reserved for three days and wanted to check out after the first. Because of the delay of finding alternate accommodations and being in our continuing education course we checked out about one hour late, were dinged for 50% penalty! Front desk clerk cold, rude and blunt in an asian sort of way. We certainly got what we paid for, but I think there must be other motels in this price bracket that smell better! My toilet was clogged before its first use, the bathroom door wouldn't close all of the way because of numerous coats of paint, sink was rust stained and stains were poorly concealed by coats of paint. This place was BAD!!! Dennis D Wong, DDS Sacramento, CA", "Date": "May 27, 2007"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Terrible Experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR5047139", "Content": "After considerable discussion with the hotel staff, they confirmed my reservation for May 9, 2006. When my wife and I checked in at about 4 p.m., we were shocked beyond relief to be told by the reception that the hotel was overbooked and they would find me an alternate hotel! That put us into considerable inconvenience. I chose to cancel the reservation and put upwith the inconvenience. The bottom line is no matter what the excuses were, this hotel is staffed by unprofessional ones who do not care for the customer comfort and convenience. This is my last visit to this terrible hotel!", "Date": "May 10, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "San Diego, CA", "Title": "“Hoped for the best.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3698730", "Content": "We had asked for a non smoking room and the first one that they put us in had ash trays all over the room. Not only that but there was cigerette burns in the bedspread and the carpet. The worst part was that the door didnt close right and the chain on the door was put on backwards. So the chain didnt work. That was the worst part because we werent staying in the best part of town. So we asked for a new room. When we went to the next floor up to our new room i noticed that all the doors said non smoking on them. That was a good sign. When we opened the door the room was gross. It hadnt been cleaned yet and it was 5 in the afternoon. Also there were more ashes on the desk. But I do have to say that after the room had been cleaned this room was so much better. I was disappointed to go up to the whirlpool and find it empty. Its was the cleanest room i had seen so far. Next the whirlpool was the sauna. It was a little to scary for me. It was so small and I get claustraphobic. And the gym consisted of 3 pieces of equipment. But what we paid for the room it wasnt that bad.", "Date": "July 25, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Manchester, UK", "Title": "“Low Expectations Are Key...”", "Author": "jalu", "ReviewID": "UR3512534", "Content": "I'm fairly self sufficient when it comes to hotels so I didn't mind so much that the Mid-Wilshire had low-ish scores - it was cheap and close to the metro red line (which, by the way, can save you a lot of money if you use a trip planner before automatically leaping in a cab) and, here's the key, had free wi-fi access. Sadly, it all fell apart on the first night. I couldn't find the hotel and phoned them up, only to find they had no idea where the Metro station was and couldn't guide me. The Wi-Fi wouldn't work - I phoned them up and was told \"Yeah, sometimes it doesn't work,\" and when some of the lights didn't work properly and the taps constantly dripped, well, I wasn't entirely happy. Plus the hotel managed to lose one of my parcels -after they signed for it- meaning presumably Mr Lee is now wandering around showing off a Homestar Runner t-shirt - good for him. He won't see my business again. If you're literally after a room and don't need to deal with the hotel staff AT ALL, you should be OK. The rooms have pretty good cable (including FX, Shield fans) but the staff are terrible and really bring the place down. Also worth noting was the fact the \"Best Western\" part of the big sign outside the hotel was painted out - very telling. Comedy moment? Watching the reception staff call the boss to ask what Expedia was and why someone was saying they had already paid...", "Date": "May 31, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“Interesting Stay”", "Author": "DirtyDiva", "ReviewID": "UR3495564", "Content": "I stayed at the Mid-Wilshire Plaza while I attended E3 this year. I was pleasantly surprised by the size of the room. It was clean and well kept. Things changed the next day when the air conditioner stopped working and the toilet stopped up. The showers seemed to be made for people under 5 feet tall so be prepared to do some yoga to wash your hair. The continental breakfast was fine. They offered cereal, toast, donuts, juice and coffee. I didn't expect more. The staff was very accommodating and so were the local \"professionals\" who seemed to be occupying the rooms around us. It was just funny, I didn't feel in danger. They do provide parking spaces with an on-site security guard. The area might initially scare someone used the backwoods of TN but anyone who is used to city life will find the Korea Town area safe and mostly enjoyable. Denny's and Ihop are a short drive away as are several local Korean restaurants. All in all, it was a comfortable hotel but nothing fancy.", "Date": "May 23, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Seattle", "Title": "“You get what you pay for”", "Author": "singingcoach2003", "ReviewID": "UR3173963", "Content": "I recently stayed at this hotel. Request an inner room if you do not care to hear the load street noises. There were bugs(silverfish) in my bed. Had three days of cold showers. The doughnuts(continental breakfast) are fresh daily. The front desk will not address your complaints.", "Date": "February 9, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Plainfield, IL", "Title": "“Bring Ear Plugs...”", "Author": "A TripAdvisor Member", "ReviewID": "UR2362007", "Content": "A convienent location is about all that is good. Located in Koreatown about 1 block away from Metro Red Line Subway makes it easy to get around when you don't feel like dealing with traffic. Big Rooms that could be refreshed. Very noisy if you get a room facing the street, which is likely since it sits at a busy intersection. It was hard to sleep between the noise from the air conditioner and the street noise all night long. Front desk girl was not friendly at all. Secure parking and cheap room along with good location is worth it if you remember your ear plugs...", "Date": "August 2, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“what pool?”", "Author": "A TripAdvisor Member", "ReviewID": "UR2122814", "Content": "We chose this hotel for the \"indoor pool\" - it was empty. Continental breakfast apparently meant a coffee pot and instant coffee packages in the room. Gunshots outside the window. Front desk clerk would not look up a phone number for me. At least it was cheap.", "Date": "May 27, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Beware of extreme noise”", "Author": "A TripAdvisor Member", "ReviewID": "UR1222113", "Content": "This is a very utilitarian Best Western hotel -- rooms were clean. The on-site parking is small but well attended by helpful security personnel. Biggest problem is that the rooms on S. New Hampshire side face a bar with LOTS of noise from patrons. We found that we could drown out their voices by running the air conditioner full tilt so we could sleep. This method also helped diminish the sound of most traffic other than sirens and heavy motors on the busy intersection of S. New Hampshire and 6th Street.", "Date": "August 11, 2003"}], "HotelInfo": {"Name": "Howard Johnson Los Angeles", "HotelURL": "/ShowUserReviews-g32655-d77740-Reviews-Howard_Johnson_Los_Angeles-Los_Angeles_California.html", "Price": "$65 - $83*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">603 South New Hampshire Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90005</span></span> </span> </span> </address>", "HotelID": "77740", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3d/e9/3de9314af8acdee3f6a3cee388a0ae584large.jpg"}}