{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Great location, clean and comfortable”", "Author": "C T", "ReviewID": "UR127238378", "Content": "While taking a train trip in mid-March, I spent one night at the Metro Plaza Hotel. I was confident in staying here based on previous recommendations and I am here to say that my experience was great. The location is perfect in many ways. It is within walking distance of the Los Angeles Union Station. It is across the street from the locally famous Philippe restaurant and one block from the bus lines. Around the corner is Olvera Street, a short, one-block street that is home to authentic Mexican history and street vendors. The hotel lobby was clean and the staff was professional and friendly. They voluntarily upgraded my room to a large suite with a separate kitchen area with microwave and refrigerator. The room was clean, the bed was comfortable, and the linens were nice. It is an older hotel so expect furnishings to be comparable. They offer a continental breakfast, which I cannot comment on, only because I wished to dine at Philippe. Overall, I got a great value and would stay here again. I searched other hotels in the immediate vicinity; none were close to my travel budget nor had the great location. You will not be disappointed if you choose to stay here.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Southwest", "Title": "“Comfortable stay in a good location”", "Author": "RubyWanderlust", "ReviewID": "UR127156457", "Content": "I stayed here for one night after an overnight trip to LA. Check in and check in were fast, and the desk staff were friendly. The room was a good size, with an excellent bathroom. The hotel hallways were unusually cold and the temperature control unit in our room didn't work, so I wasn't able to make the room as warm as I would like (it was a chilly day in LA). The location is great, very close to Union Station, and there are plenty of places to eat very close to the hotel. I didn't feel unsafe at all in this area of town, but I am used to cities. The continental breakfast was just fine: bagels, toast, fruit, cereal, and juice were available. I had plenty of food to fill me up for breakfast. I would stay here again.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bloomington, Illinois", "Title": "“Pleasantly suprised”", "Author": "mark z", "ReviewID": "UR126154831", "Content": "Stayed here on business. Hotel is on the outskirts of downtown near Chinatown and is slightly seedy, but not bad if you're an urbanite. Was given an upgrade to a suite for no extra charge. The hotel is old but very well-maintained, quiet and clean. The room was huge and comfortable. The bathroom seemed original and had a very large tub with a good shower. Free wireless which was slow, but tolerable. The clientele was very diverse. This is a great place for the budget-minded. There is also an old cafe called Felipe's around the corner which is an LA institution. Great, cheap breakfast and atmosphere.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Petaling Jaya", "Title": "“Convenient located.”", "Author": "aarontanek", "ReviewID": "UR125177273", "Content": "Big room and walking distance to UNION station, Olvera Street and China Town (nothing much here), and City Hall. Breakfast and WIFI internet are free; however we have to be in lobby to get the WIFI connection. There's a small mart, SUBWAY, and a Mexican Restaurant beside the hotel.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkeley, Ca.", "Title": "“Good experience at the Metro Plaza, with a few flaws”", "Author": "wanderer", "ReviewID": "UR123471332", "Content": "I stayed two nights at the Metro Plaza and was generally pleased. My room was large and decently featured. It had plenty of light in the daytime and was quite dark at night. It looked out on a curious feature of the property--a kind of low intensity strip mall at the back of the hotel's second floor. My room was near a bend in the building, so it was important to keep the curtain closed when I wanted privacy. The neighborhood is very busy during the daytime, but there was no noise at night. The bathroom was huge, though it didn't have any heat source and could be rather cold, at least until it got steamed up. For some reason the bathroom door wouldn't stay open, even when I wanted it to. The bathtub also didn't hold water, it drained out slowly, so I had to take showers. The only major facilities problem was that the internet in the building was not working for much of the time I was there. It didn't matter that much, except that it prevented me from printing out a boarding pass in a timely fashion. A minor problem was that the chain had slipped on the door and didn't work, though there was a deadbolt. As someone who advocates car-free traveler, I have to give the Metro Plaza props--it is the only hotel in Los Angeles I have ever seen with the Metro transit system posted in the lobby. Of course, being a block from Union Station, it is right at the heart of that system with numerous trains and buses available. There's the non-stop Flyaway bus from Union Station to LAX airport. The Metro Plaza is really a good choice for a car-free traveler who's looking for a budget (by LA standards) hotel. The Famima quality convenience store in Union Station stays open 24 hours a day, so you need never starve! Otherwise the neighborhood gets pretty quiet at night, though not dangerous (you are likely to see some homeless people sleeping on the street). I only ate one meal nearby--at Nick's Diner on the edge of Chinatown. I've eaten at Phillipe's, a few doors down and at Homegirl Cafe a couple of blocks away, which is part of a re-entry program for gang kinds. There are also lots of daytime/early evening eateries in Chinatown, which the hotel is adjacent to. One of these years I'll eat at the beautiful Traxx restaurant in Union Station. So despite flaws, a good experience.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Best choice for sightseeing tourist”", "Author": "SwarleyBravo", "ReviewID": "UR122141791", "Content": "We stayed here for 4 nights, the purpose of our trip was to see as much of LA as possible. For those who aren't familiar with the geographic layout of LA, everything is very widespread and unless you feel like paying triple figure's for taxi's public transport is your best option. Which is why the Metro Plaza was perfect, it is located within a 2 minute walk from Union Station, which is the central transport hub for LA (Amtrak train to Disneyland, bus to Santa Monica, trains to Hollywood, Universal Studios). The room is more than adequate, nice comfy bed, modern amenities, everything was no fuss. We barely saw staff as we left early and came back late, our room was always serviced to our liking. Some people have commented on the location being scary, I didn't experience this. While there are several homeless people in the area they are harmless and a friendly no when they ask for change is all you need. All the areas near the hotel are well lit and populated, including the path to Union Station. Tip: check out Olivera Street, the historical birthplace of LA and Mexican cultural hub, I no longer feel like I haven't been to Mexico, great experience.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Biggera Waters, Australia", "Title": "“Location,Price & helpful friendly staff.”", "Author": "GoldCoastFarang", "ReviewID": "UR121180264", "Content": "We picked this hotel by location only.Its very handy with Union Station and bus service to everywhere in LA.....Fast food franchised outlets on ground floor with China Town and Mexican Historical market and church nearby.Staff were extremely helpful and friendly.Good Value for money....would definately stay there again", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rome", "Title": "“Mediocre but well located”", "Author": "Cris-Traveler-Brazil", "ReviewID": "UR119998783", "Content": "Stayed at this hotel for 4 nights. The best feature is the location, 2 blocks from union station (bus flyaway from airport) and metro red line to all touristic sights. It is located in chinatown and you can find good restaurants with sea food around. Staff were friendly. On the negative side, the room was smelly, not 100% clean and only few chanels in English available on tv. It was quite noisy. Towels were not very soft and over bleached.", "Date": "October 31, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Scotland", "Title": "“A good surprise”", "Author": "Tingvorl", "ReviewID": "UR119485730", "Content": "We'd streetviewed the locality before we decided to make this our overnight stay between Amtrak trains from San Francisco to New Orleans. In fairness, we weren't expecting too much other than the convenience of its location to Union Station. However, the room was clean, if a little worn, and the bathroom was excellent. The staff were helpful and the light breakfast was OK. It's possible to walk the short distance from the station to the hotel even with large roller suitcases but it's true to say that there are quite a few people down on their luck roaming around the streets. We had time to kill in the morning and the Mexican market, restaurants and entertainment in the square opposite the station (it was a Sunday) and 300 yards from the hotel were superb. All in all, a good choice for our short stop and value for money.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sonora, California", "Title": "“Perfect for this need”", "Author": "jasonxreed", "ReviewID": "UR119279230", "Content": "Walk from AMTRAK Union Station. WiFi included; very light breakfast. Loved it.", "Date": "October 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Convenient Location”", "Author": "AussieBushSally", "ReviewID": "UR118174061", "Content": "The best thing about this hotel is it's proximity to Union Station. The staff are friendly and helpful. The rooms are satisfactory, but nothing special. The free breakfast was very basic, but it was FREE!", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Tesimo, Italy", "Title": "“Perfect within this price segment”", "Author": "hons82", "ReviewID": "UR114855009", "Content": "We had booked 2 rooms for 5 people for 4 days. Actually we arrived one day earlier and instead of looking for a best western or a something inn, we decided to ask if we could extend our stay in the hotel. The guy at the reception was really friendly and could even arrange that we could get 2 rooms next to each other which where the same ones as for the already booked nights. So we had not to check out at 11am and wait till 3pm to re-check in into other rooms. In addition he gave us immediately a lot of info about the city and where to go. The rooms had two queens, TV, AC, refrigerator andeach one its own bath room, so nothing to complain. In the lobby you can take free coffee 24h a day, so if you like me don't need any breakfast except a cup of hot coffee you could even sleep longer than the breakfast time which ended at 9am i think. The breakfast itself is quick small, so it has coffee, tea and some juices and to eat mainly toast bread and marmalade and beagles. We decided to take this hotel beside its economical prices mainly because it is just a few steps from the union station away, from which each part of the city is reachable, even if the metro system in LA is quite difficult to understand. At the end I would say that our main focus in these days was around the hollywood bvld so it would have been better to take a hotel in that zone, however there are a lot of interesting places even reachable by walking directly from the hotel (chinatown, little tokyo, toy district, downtown) and some of the far away destinations like Santa Monica beach, which is definitly a must see in LA, depart only from the union station (big blue bus) Fazit: The only reason for not choosing this hotel if you are looking for a cheap stay would be to stay nearer to hollywood which makes you independent from the metro which stops working at 1 or 2 am, and by the way it takes quite a long time from hollywood to downtown using the metro. that's it basically. Stay at this location and have a wonderful time in LA like we had", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Piscataway, New Jersey", "Title": "“Great Place to Stay”", "Author": "Shirshendu", "ReviewID": "UR114708608", "Content": "The hotel is really very near to Union Station from where you can go almost anywhere in LA by public transportation. My next plan was to catch the Go-to bus for Grand Canyon tour. The location was very near as well from hotel. The room was clean, drinking water was available for free (in the lobby), and the coke machine was really cheap!! So very nice experience. Definitely recommend this hotel if you want to explore LA by public transport.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Palm Springs, California", "Title": "“Very good!”", "Author": "Maryathena", "ReviewID": "UR101045866", "Content": "This hotel is very clean. I can overlook it being out of date a little. Especially for the price it was great. I did smell the subway in the elevators, but not in the room. I found the staff friendly and helpful. Everyone complaines about continental breakfast, it was what you would typically find in the U.S. in less you stay at a $200 or more room. My only complaint was the T.V. had about seven channels and three were in Chinese. I will stay again for sure.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Two Rivers, WI", "Title": "“Good Location, Ok hotel.”", "Author": "TRWisconsin", "ReviewID": "UR99468583", "Content": "Stayed for one night on a layover in between Amtrak trains. The hotel is within easy walking distance of Union Station, about 2 blocks. For LA the rate was pretty low, but the room was good for the price. I had a room with a single king bed. The bed took up most of the room so there wasn't a whole lot of space. The room was a little dated, but still ok. There was a phone on the wall next to the toilet which I guess could be a positive. The breakfast was average cereal, fruit, juice, coffee, bagels, toast.... For a one night stay between trains the hotel was adequate and had a good price. I would stay here again if in the same situation.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“not a very pleasant stay”", "Author": "zippy18", "ReviewID": "UR87172566", "Content": "The rooms were spacious and bathroom clean. I was charged extra for the teenagers room as they had two seperate beds and the logic was that it would take longer to clean!!. the safe wasnt working.Breakfast in polystyrener plates was very disappointing! Never have we been served any meal in a hotel in paper plates!! not much variety in the cereal! the croissants were not fresh at all. Staff could be more friendly. The area is not very nice the only thing good was the Union station nearby.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Arizona", "Title": "“Do not stay here, service is TERRIBLE!!!”", "Author": "snorris98", "ReviewID": "UR84925411", "Content": "Traveling with 1yrs old son and husband for an event downtown. Neighborhood is not good even if we did not have the baby. Yes there is a fee of $4 a day for parking and room was roomy but nothing great. We booked 2-nights but ended up leaving with in minutes at 1:00pm the next day. There was some kind of festival going on and they allowed those attending to park in their VERY SMALL garage (which they often double park as they can make extra $ daily) we tried their second level parking and was told I could not park there. Also there is a Subway next door in which the baking bread you can smell ALL DAY AND ALL NIGHT long..ugghhh!! Continental breakfast is sad, banana's were bruised and other then bread nothing more to choose from.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Modesto, California", "Title": "“Good, no frills hotel 2 blocks from Union Station (Amtrak)”", "Author": "RDHOnTheGo", "ReviewID": "UR84579116", "Content": "I have stayed here a few times and have been quite satisfied. This is a good, basic, no frills hotel with nice size rooms and baths. My rooms have been clean and quiet. TV channels are very limited. For the price, this is a great value in downtown Los Angeles an easy walk through Olivera Street to Union Station. There is a nice Continental breakfast offered at no extra charge in a small room off the lobby. There are restaurants and fast food outlets nearby.", "Date": "October 23, 2010"}, {"Ratings": {"Overall": "1.0", "Location": "1"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Pathetic Service”", "Author": "MatildaAus", "ReviewID": "UR83783114", "Content": "My partner and I stayed at Metro Plaza Hotel for part of our honeymoon trip through America. I had nothing but difficulties through the entire process. The reservations manager Henry Woo made multiple mistakes with our booking which I had made through their online booking system. It was difficult to get him to fix these problems from back here in Australia. My partner and I emailed the hotel, and Mr. Woo 11 times before they corrected the mistakes. They overcharged my account and I had to fight with them to refund the overcharges. The location, yes it is great. But is it worth risking your accommodation and your money?", "Date": "October 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Not bad at all”", "Author": "chas118", "ReviewID": "UR79426750", "Content": "I was passing through LA arriving by train at Union Station and wanted a hotel within easy walking distance. The staff was friendly, the room was fine and the continental breakfast better than average.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“not as bad as i thought!”", "Author": "ching_wa", "ReviewID": "UR77833811", "Content": "After seeing the mixed opinions on the hotel, I prepaid for one night just to test it out. The area is a bit sketchy, since it is right by Chinatown, but I felt alright walking around even during the evening. I think the homeless jut minds their own business and won't come and bother you. The price is really good and there was also complimentary breakfast. The best thing we found was that a water fountain with good tasting water was on each floor, this saved us a lot of money for buying water! The rooms are a bit old, but clean. I would stay at this place next time I visit because of it's great location, so close to Union station, as well as the friendly staff. If you are not looking for something fancy, this is a good choice for you.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Santa Barbara", "Title": "“as advertised, but...”", "Author": "anemonefish", "ReviewID": "UR72071467", "Content": "The Metro Plaza is close to City Hall (3 blks.), Union Station (1 blk.), historic Olvera Street (diagonal), China Town, and much of the LA downtown cultural scene adjacent to the 101. If location and price are primary, go for it. Just know that the neighborhood can be urban rough, as well. In-house covered parking at $4/day is a bargain. The hotel offers a conventional continental breakfast bar with numerous restaurants nearby, ranging from Philippe (a classic and home of the French dipped sandwich) to Mexican, Chinese, seafood, barbecue, fast food (adjacent), etc., etc. Also grocers handy. Rooms offer a fridge (as opposed to mini bar). Hot and cold water dispenser along with ice and cola machines. No in-room coffee maker, but free coffee in the lobby 24 hours. Staff was friendly enough. Housekeeping was good. A few loose tiles in the large bathroom - clean grout. Linens adequate. King bed was thin and firm, bordering on hard. Air was via a trusty Friedrich cool/heat unit installed at floor level - windy & noisy cycling. Some rooms have large windows facing the streets, others on the back are built around 3-sided mini-air shafts such that one window faces the adjoining bedroom, the other a parking lot. TV is a weak spot if you plan to spend much time in the room. Only a few local channels on offer, plus a couple of Chinese and Spanish language options. No cable news, business, etc. Probably the worst selection we've encountered at a hotel in a major western city. Two fire alarm glitches during our stay. The Metro Plaza is serviceable. The price is fair. You can upgrade significantly for $20-30 dollars/day, but the location has a lot going for it, especially if LA cleans itself up.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Southport, Australia", "Title": "“Spend a bit more and get something nice”", "Author": "dottie0845", "ReviewID": "UR68779748", "Content": "I chose this hotel due to its location. Admitdley its close to Union Station where the Flyaway bus from the airport arrives and departs from. The hotel is in the midst of Chinatown, the streets between it and the station are full of homeless people begging. Its not a safe part of the city to stay and there is no way we would have ventured out at night.The only restaurants are Chinese or mexican at a nearby market. When we first walked into the foyer of the hotel there was the most horrible nauseating smell. My husband and I both looked at each other and thought where do we go now. Having paid up front weeks before we decided to see what the room was like and if the smell was there we would imediatley go somewhere else as it was so bad we could not have tolerated it. We asked the owner where it was coming from and he said from the Subway restaurant next door. Our room was on the 4th floor thankfully on the opposite side to the subway restaurant and the smell slowly dissipated by the time we got to the room. The room itself was just OK old air con very noisy good sized bathroom and at least it was clean. So we decided to stay but when you were going out it was hold your breath for as long as you could and get out as fast as you could. If our room had not been where it was there is no way we could have put up with the stench as it hit you in the corridor going to the lift and inside the lift itself it was putrid. Breakfast was pretty ordinary just cereal toast and bagels a banana or two. It was served just off the foyer which of course was where the smell was the worst, but early in the morning before Subway was in full swing it was just bearable. My advice go somewhere else where its safer.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Fine if no car”", "Author": "BJPToronto_Canada", "ReviewID": "UR64152416", "Content": "We were looking for a place near Union Station so that we could catch an early morning train. This place fit the bill nicely. It was a 5 min walk with suitcases door to door. The Subway sandwich shop opened really early in the morning so you can pick up your lunch on the way to the station. Breakfast starts at 6:30 at the Metro Plaza, so that was perfect. Another budget hotel in the area did not serve breakfast that early so that is something to consider if you are taking a train. The room was very small and dark. But hey, it was only for a night. The bathroom, however, was very large. The internet did not work when we tried it, but I am sure that had we taken the laptop to the front desk, they could have straightened us out. We really did not need it for that one night. The breakfast room had a suitable number of tables. The continental breakfast was basically two cereals (and when did you ever see CocoPuffs as one of the two choices?), juice and white toast and fruit. I have two main complaints about the hotel. One, our room overlooked a restaurant (I think) that starts revving up at 5:30 am. The sound was like a garbage truck making it's collections,except it never ended. Now, this did not bother us as we were getting up then for our early train. But had we been planning to sleep in, we would have been concerned and probably asking for another room. Our other complaint was the parking. I pulled up to the hotel and wanted to park in the garage for a few hours till it was time to take the rental car back. But the young lad would not let me into the garage as they were renting out the spaces for the Cinco de Mayo festival which was being held in the park next door. There was also no place to stop in front of the hotel to unload luggage either. I was in a real dilemma as I was alone at the time (my husband was coming in on the train) and did not know what to do. After a few times around the block, I found a parking lot that would let me \"rent\" a space for 5 minutes while I dropped our luggage. The front desk insisted that there was room in the garage and I could park there, but obviously they were not telling that to the parking attendants as I made it clear I was a guest and I was still denied admission. But I was able to drop off my suitcases and then change my plans and take the car back to the car rental place early, just to get rid of it since the hotel had no space. But I think if I were to stay here another time,with a car, I would call the hotel first and ask if there were any special events in the area planned for my stay. If I were traveling on the train, I would not hesitate to stay here again as the location is wonderful for train travel. I am not sure if I would stay here for an extended visit though. But for what we paid and it's location, it was fine.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Nice hotel, good location”", "Author": "kathiejmie", "ReviewID": "UR63188527", "Content": "The hotel is located just a few minutes walk from Union Station, which is very convinient, because you can get practically anywhere in the city by bus or metrorail. The hotel itself is very clean. Our room was huge, the biggest room I ever stayed at. The hotel offers free wi-fi and breakfast (very simple though). There was just one small problem. There were three of us sharing the room but the staff kept forgetting that and left only two sets of towels and blankets. And we had to ask for the third set every single day, which was annoying. Other than that, everything was great.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Lovely, clean hotel near Union Station”", "Author": "freddo56", "ReviewID": "UR61970937", "Content": "Service was excellent, arrived early morning and a room was ready for us before the usual check in time. Quiet, clean room with adequate facilities. Simple breakfast included but very welcome. Handy to Union Station for train connection.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Subang Jaya, Malaysia", "Title": "“Very convenient location”", "Author": "janza2005", "ReviewID": "UR60280951", "Content": "During our recent visit to Los Angeles my wife and I stayed at the Metro Plaza. We chose this hotel because it was the nearest point for the drop-off of our coach tour to LV/SF. We didn't regret it. The room was comfortable and clean with all the main facilities provided, the breakfast was sufficient, local buses and trains are a stone's throw away, various types of food outlets are close by (no MacDonalds though which was a blessing) and above all this the General Manager Mr Henry Woo and his staff were most helpful. We enjoyed our 4 nights there and should we visit LA again in the future we will not hesitate to stay there. All said and done you can't expect too much for a hotel in central LA charging about $100 a night.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Canada", "Title": "“Good value; a clean hotel with continental breakfast right by Union Station.”", "Author": "sleepercar", "ReviewID": "UR54703898", "Content": "My partner, my parents, and I stayed in the Metro Plaza for two nights around New Year's Eve, 2009/10. Our rooms were spacious and extremely clean. The hotel was very quiet. We had self-serve continental breakfasts with plenty of choices -- fresh fruit, cereal, bagels, toast, danishes, donuts. The price was great -- I think we paid $80 per room, per night. The location was superb -- a block from Union Station (we were travelling by train), and across the road from Olvera Street. On New Year's Eve we had a delicious and very affordable meal at the Regent China Inn next door. But a budget hotel is rarely without its downside. In this case, the heater in the room was loud and could not be left on at night if we were to get any sleep. As a result, our room was cold. Bring a warm set of PJs if you go in winter! Overall, I would recommend this to anyone who is not fussy and is not in pursuit of luxury.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Jersey, Channel Islands, UK", "Title": "“Good Location, with parking - clean but a little dated”", "Author": "OlafB", "ReviewID": "UR49382656", "Content": "I was looking for a relatively cheap hotel (i object to paying high hotel prices) in a good location; I found it at this hotel. First, there is ample parking for which there is a small fee which is a great advantage in LA. Thankfully there was none of that valet nonsense which annoys me (I am quite capable of parking my own car). The staff were helpful despite their English being a little limited. The hotel was well located and it only used to take us about 15 minutes (if that) to get to the main attractions in the city. It was clean and perfect for what I needed; basic, clean, good location. Breakfast was adequate (bagels, rolls, cereal, etc). the hotel is right next to china town and union station. All in all, I was happy.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "MELBOURNE AUSTRALIA", "Title": "“Good hotel in great location”", "Author": "SUSANNAHOPE", "ReviewID": "UR46053235", "Content": "In September I was travelling with my partner in California. In Los Angeles we stayed in the Metro Plaza Hotel which is opposite Grand Union Station. It was a good price - under A$100 (including taxes, room charges etc.) per night - including breakfast. It is nothing fancy - but clean and comfortable - staff very helpful - and from outside the door can catch bus or train to anywhere. We were able to go to Disneyland for $1 each (seniors fare) and 85c to Hollywood, Santa Monica and loads of other places. 10c for around LA in the bus called DASH. Breakfast was good - lots of room - and tea and coffee available in the foyer 24 hrs. There is a Mexican market nearby, open every day and evenings, we had yummy Mexican food for approx $5, and were able to browse and buy souveniers. Also there are Chineese and Janapese resteraunts which are frequented by locals - good food at a good price. Don't go walking in the park, as unfortunately there are quite a few homeless people about asking for money.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Cicero, IL", "Title": "“Pricy for bare room, no perks, and gross housekeeping”", "Author": "EmmyT", "ReviewID": "UR33897621", "Content": "I chose this hotel, because of the area, discription, and parking. Well...The area is nice to visit, on the corner of Olivet Street and Chinatown, but we did not want to be outside the hotel after dark. Very shady area. The discription made it sound like a nice, higher-end hotel, but for 110 a night, why was it completly dirty and old? If you have an problem with old dirty bathrooms, do not stay here. The bathroom smelled really odd. The bed felt like 3 springs covered with cardboard. The parking? The valet parking that we paid extra for? Well, it was us parking it in a garage, and leaving the keys in the car. We were not given anything to verify we left a car there, or even which car was ours. It was such a mess, that there was no way we were going to leave and come back and park. If we had any idea where we were, we could have left, and stayed somewhere else. I can't belive we paid so much for that room.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Good location, good value”", "Author": "WStaso", "ReviewID": "UR32077728", "Content": "I stayed one night at the Metro to answer a jury summons at the federal court. The hotel is just a couple of blocks from the parking lot for the court. It is in a business area with a lot of local traffic but it was quiet inside the room. The subway downstairs was open late and was busy but clean looking. The room was relatively inexpensive, had a helpful person at the desk and an equally helpful security man. The parking area, under the hotel, seemed reasonably secure with cameras. The room was clean, the bed was firm, and the only noise I heard all night was from the air conditioning unit. The continental breakfast was basically cold cereal, bagels, and juice; but the breakfast room has plenty of tables and free copies of USA Today. The other hotel guests I encountered looked like upstanding people. I would stay there again under a similar situation.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Not bad for price but not great either”", "Author": "terminator33", "ReviewID": "UR32003090", "Content": "I have stayed in this hotel 3 times in the last five years when doing business at the federal building. Previously the Days Inn and now the Metro Plaza. The good points are location and price. Its only about a five minute walk to the federal building, right next to historic Olivera Street, and near Union Station. Its one most affordable hotels in downtown LA. Free internet, cheap parking. About half the price of the nearby Kyoto Grand. I paid about $80 a night mid-week. The rooms are clean but aging and in need of a makeover. At least they seem to do a good job with housekeeping, much more now as the Metro Grand than when it was a Days Inn. The walls are also fairly thick and soundproofing is decent. It is mostly quiet at night. Most rooms have connecting doors which I normally don't like, but the doors are thick, solid oak doors that don't let in noise from next door. I had a few problems connecting to the internet but the front desk staff was friendly and helped me correct the problem. The downsides are the area is kind of shady, especially at night. In their defense, so is most of downtown LA. I've been approached by beggars outside the hotel on all three trips over the last five years, but none appeared overly threatening or violent. The architecture is kind of weird also, as hotel is located in a type of strip mall. Their are walkways outside the 3rd floor windows, so you don't feel safe unless you keep your windows locked, and the stairwell doors on the third floor were propped open on my latest visit. Don't know for sure but it gives the impression that some of the homeless from outside could just wander in if they wanted to. Wouldn't recommend this hotel for women traveling alone, the young or the elderly, but able bodied adults probably could live with this hotel for a few days for the price if they need or want to be in downtown LA.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Convenient for Union Station Railway Station”", "Author": "hm192", "ReviewID": "UR31207397", "Content": "I stayed here in May 2009. It's about a five minute walk (with suitcases) from Union Square - this may well be it's chief selling point. It's clean and functional - A-OK for an overnight stay if you have to catch an early morning train. The staff were friendly and helpful.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Not A Bad Choice”", "Author": "mrae16", "ReviewID": "UR31027451", "Content": "We arrived around 2 p.m. and were promptly given a room. The room was a nice size. Although none of the furnishings are new, the bed was comfortable and everything was clean. Very minimal amenities, but that is what I expect with the price I paid. The young man at the front desk was very helpful when we had any requests. Not many places to eat nearby but we did eat at Philippe the Original's which is a must do and ate at a Mexican food place on Olevera St. in El Pueblo de Los Angeles. Yes, we did walk a few blocks, but that is not an issue for us. Well located for Union Station travel and we took the subway to Hollywood for a quick tour. Breakfast was adequate and fresh.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Menlo Park CA", "Title": "“Excellent Deal in Downtown LA”", "Author": "Gcruik", "ReviewID": "UR30208795", "Content": "Reasonably priced hotel in LA. With $4.00 covered parking. Very close to Union Station, a must see for its interior beauty. Traxx restaurant is worth a visit too. Evening desk person is clueless. Day time seemed to be better.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“A bed for a night before catching train”", "Author": "SafariMan149", "ReviewID": "UR24398340", "Content": "All I needed was a bed for a night after flying in and before catching a train from Union Station. Great location for Station but little else. Dispite being 6'2\" and large, wouldn't feel safe in area at night. No decent resturant at hotel or near by. Room clean(ish)", "Date": "February 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Not sure about quality vs. price and services”", "Author": "SkyTravelPRG", "ReviewID": "UR22925361", "Content": "I stayed in this hotel for 4 nights in December 16.-20.2008. Property has good locations, max.10 minutes from Union Station L.A. I got a room with two double beds with street view. Beds and carpets old. I expected something else according to hotel photos, which are on their website. Reality is regret much different. Hotel provide wireless internet for free. Regret PC with internet access is paid, 2 USD per hour, 1 printed page - 0,50 USD. I paid 89 USD for single room/night + 14% tax. Breakfast was limited. Two kinds of cereals, bagels, toasts, butter cake. Cream cheese, jam, butter.", "Date": "December 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Boston", "Title": "“Solid value, clean rooms, & quiet”", "Author": "BlueEyedMavrick", "ReviewID": "UR20472476", "Content": "I booked this room through Expedia with the same room rate as they quoted me over the phone, but Expedia gave me a $50 gas card, so I booked through Expedia. I paid $89 per night. There were no additional fees charged by the hotel beyond this room rate (for example, no additional taxes that weren't included with my Expedia payment). I checked in late on a Sunday night for 3 nights. Check-in was smooth, and I was assigned the same room type as I had requested, a nonsmoking room with a king bed. A few weeks before I arrived in LA, I sent an e-mail to front office manager listed on Metro Plaza's website. The site said to e-mail that manager if you had any special requests or questions. I had some of both, but I never received an e-mail back. That was disappointing. As a former front office manager myself, that somewhat irritated me, but because it is a value hotel, I don't expect personalized service. Regardless, I had room 331. The view was a rooftop, but I didn't mind. It was a quiet room, and I never heard anybody else in the hotel. The room size was appropriate, and beds, though not new and fancy, were comfortable and the linen was clean. The TV was a bit on the smaller side, and the reception was iffy on many of the channels. I would say there were only a handful of English channels, possibly 10 or 12 tops. The minifridge in the room was quite large, and was clean. The bathroom was appropriately refreshed every day, with my towels being replaced even though I had hung them up to dry. The bathroom was quite large, and looked much like the photos other people have posted. Parking was convenient, and I parked outside in the lot, instead of in the garage. I believe it only cost $4.00, which is incredibly reasonable. I went down to the desk the night before check-out to see if I would be able to get a late check-out. The man was quite incredulous that I asked to check out at 2 PM, instead of the standard 12 PM, which I didn't appreciate. I nice apology and a \"no, unfortunately I cannot extend your check out\" would have sufficed. He was rather curt upon my request. Breakfast each morning was sufficient. Mid-quality muffins, bagels, english muffins, bananas, coffee and juice. It begins at 6:30 AM but sometimes I got down there earlier than that, and the breakfast was out by 6:20 AM, which was much appreciated. Overall, fantastic value. If you seek something flashy and impressive (perhaps if you have friends or guests you wish to entertain,) I would go elsewhere. But for the budget-minded traveler who wants a clean room at a good price, I would *definitely* recommend the Metro Plaza Hotel.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Atascadero, California", "Title": "“Not happy.”", "Author": "Bill-and-Laura", "ReviewID": "UR19173371", "Content": "Like all the prior reviews I read of the great location and general consensus of hotel/room condition, I do agree. I was okay with everything until walking into the dark bathroom, flipping on the light and seeing a bug scuttle across the counter! A kleenix box was setting on the counter, I grabbed it and smashed the bug ... to discover that it was a cockroach! I did not sleep well even tho I didn't see any others or evidence of others, but doubt we will stay there again. I did add two photo's showing proof of it on the bathroom counter and I did compare to online photo's to confirm before submitting this review.", "Date": "August 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“It really ok, great value, great location”", "Author": "GratefulDave", "ReviewID": "UR18260037", "Content": "I would clearly recommend it. Its no frills, clean, right next to china town and Olivera street (Mexican food and some historical stuff), across from the train station and the California Endowment. I have stayed here twice for business (free wireless and breakfast included). I had a deluxe suite for 149 per night, it was large, had kitchen, nice bathroom. can't complain. No room service. Health Club or exercise room is very limited I could easily stay in big fancy hotel in downtown hotel and have stayed at the Biltmore and grand Whilshire (I am not paying for the room), but I prefer this place. Downtown is so boring at night. This is a real good deal. In my terms, I would rate it \"just fine\".", "Date": "July 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Central Coast of Cali", "Title": "“Good Place to stay in Downtown LA”", "Author": "jaggirl30", "ReviewID": "UR18054785", "Content": "I stayed in this hotel because I was summoned for Jury Duty service at the District Court nearby. The location is perfect if you are as \"lucky\" as I am and have to go for Jury Duty. There are lots of good places to eat - there is a Subway Restaurant right outside the front door, and several Mexican Food Restaurants across the street on Olivera Street. As for the room itself, the carpet had a few stains, the curtains were fading and worn from the sun, the furniture wasn't the newest, but for the price it is worth it - the sheets are clean, the people were very friendly, and the wireless internet service worked great. The second night I was in town the hotel was booked and I had to go somewhere else where I spent double the money and the accomodations were the same. Parking is only $5.00 per day, the cheapest I could find anywhere around. I will be staying here again!", "Date": "July 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, BC Canada", "Title": "“Good value at the Metro Plaza”", "Author": "EmRob", "ReviewID": "UR17229883", "Content": "We stayed at the Metro Plaza while in LA for a conference. The room was large and the bathroom very large. The window was minimal and there was little air circulation but the air conditioning worked well. All if the hotel appearaed clean. It is an older hotel without any extras, but convenient to the Union Station and the MetroLine and the price was good. My only complaint would be that the air conditioner was too close to the bed and sent out a chilly blast. There was a table and three chairs, but no lounging spot except on the bed. Its situation next to Chinatown was interesting to us too.", "Date": "June 25, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Location, Location, Location in LA”", "Author": "SineNomine69", "ReviewID": "UR17216396", "Content": "I \"Googled\" the Metro Plaza Hotel and was taken to Booking.com to make my reservation. I chose it mainly because of its proximity to LA's Union Station as I was taking a round-trip private dome car rail excursion to San Diego the next day. Driving in from the Ontario Airport, the Metro Plaza was easy to locate off the I-10 and CA 101. One of its best features is very reasonably priced in-house parking (I paid an average of $6/day!). The hotel's lobby is on the ground floor with rooms on the 3rd and 4th floors. The desk staff is Asian, helpful, and eager to please (I was immediately given a tube of toothpaste as the TSA Nazis in Kansas City had confiscated mine). The building has a number of other commercial ventures on its first floor and is convenient to several Chinatown restaurants as well as Phillipe's, (a big favorite of mine and LA folks owing to the terrific French dipped roast beef sandwiches) and that little, touristy Mexican \"village\" rife with restaurants and gift shops. My room had two queen-sized beds, a mini-fridge (very important as I need to chill my insulin), a table with 2 chairs, a built-in desk with chair and a portable room safe on which I could mount my Bi-Pap machine. The maid had inexplicably left the drapes open during a heatwave (108 degrees when my plane landed) and it took the air conditioner almost 3 hours to adequately cool the room. However, once cooled, it was very comfortable. I paid a rate of $89/night plus taxes and parking which, for downtown LA is a bargain. No, it's not the Biltmore, the Bonaventure, the Marriott, or the Omni, but it's clean, has the basics (an abundance of towels in the very large bathroom) and is convenient to public transportation (two Dart lines and the Red and Gold lines at nearby Union Station to say nothing of standard bus lines on the corner). The halls were quite stuffy, but again, there was a heat wave.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Location, Location, Location!”", "Author": "Travelswithmutts", "ReviewID": "UR16628092", "Content": "If you are looking for a comfortable, inexpensive hotel near great public transportation (that puts you near most everything in the greater L.A.-area), the Metro Plaza is a really good bet. I just returned home from a 3-night stay there and was pleasantly surprised. I didn't want to hassle with a car, so upon arriving at LAX, I went to the curb outside the A.A. terminal and waited for the FlyAway bus that goes directly to Union Station for $2 each way. Once at Union Station, walk through the tunnel to the front (train side) of the building, take a right and walk half a block to Cesar Chavez Street. Take a left and walk half a block and there you are, right in front of the Metro Plaza. My check in was uneventful, my room on the 4th floor was quiet, clean and had GREAT A/C and good shower pressure. The bed was comfy and HBO was included. Free wi-fi is included in every room, a nice bonus. The continental breakfast, from 6:30-9:00 a.m., is basic, but just fine. Muffins, bagels, bananas, juice and coffee, along with a free USA Today. Olvera Street, the original L.A. settlement is right across Cesar Chavez and offers lots of good low-price Mexican restaurants. China Town is up Cesar Chavez going in the opposite direction. Take a right on Broadway and walk under the giant dragons, you will definitely know you have arrived. Within easy walking distance from the hotel are Thai, Vietnamese, Chinese, Mexican and a Subway restaurant. About 3 blocks away is City Hall and other governmental buildings. From Union Station, the metro will take you anywhere quickly, cheaply and safely. I really can't think of any negatives...the Metro Plaza is good basic accommodation, no frills but very comfortable. I would not hesitate to stay here again.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Jose, California", "Title": "“Good location/hotel depending on your interests”", "Author": "lipsticktraces", "ReviewID": "UR16478861", "Content": "This hotel is a good value and choice for those who are interested in seeing downtown LA (including Olvera Street, Chinatown, Union Station) and saving money. If you don't have a car and have a short stay focused on the above sites, this hotel is perfect. You can walk to everything (Mexican/Chinese/other restaurants), and the Red Metro Line stops out front and goes to Hollywood. However, if you are not comfortable in urban environments with homeless people on the sidewalks, etc., this is not a good choice. If you have a car, this is still a good choice -- parking is only six dollars a day, and freeway access is excellent. I plan to stay here again. The wi-fi was great, the room clean/safe, and the staff was friendly.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Santa Monica, California", "Title": "“Older hotel but still comfortable”", "Author": "alwaysbetraveling", "ReviewID": "UR16158686", "Content": "The hotel is easy to find (with a GPS) but the unloading luggage or parking is a little challenging given the minimal space in front of the hotel. Parking is $4 which is a garage on the 1st floor where you enter through the \"EXIT\" sign. The front desk staff is nice, but communicating may be a little difficult. I tried many times to ask for the code for the free internet wi-fi but finally had to obtain the printed code in order to understand the specific letters to enter. Check-in and check-out was quick. The room was large (I had a corner room which seemed larger than the others on the hotel layout). There was a desk and a dining table with 4 chairs. The bathroom had a jacuzzi tub. The ice machine was on the same floor down the hallway. The surrounding area was not great, but close enough to good Chinese restaurants within walking distance. The included continental breakfast was basic, but decent. I stayed in this hotel for an interview the next day. I would recommend this hotel for budget minded travelers and business.", "Date": "May 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ne washington state", "Title": "“excellent hotel very near union station”", "Author": "yarr0w", "ReviewID": "UR13261397", "Content": "excellent location, hotel, room ,service and continental breakfast for the price. very near union station for amtrak and public transportation in l.a. area.", "Date": "February 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Worn and Ragged...Barely Worth 2 Stars”", "Author": "smub", "ReviewID": "UR12367734", "Content": "Since most reviews here said the place was Ok, we decided to book this place for our last night in LA. Well, this hotel is definitely not a lovely place. The lobby is probably the most updated. Our room was VERY worn, the wallpaper had stains on it, the bed was potato chip thin and the nail polish stained dresser looked gross. We felt very itchy all night long and couldn't wait to check out the next day. It is right near the train station..that is true. But the neighborhood leaves alot to be desired too. If you are looking for a place near the train, you might want to take the rail to union station and then take the metro (red line) to hollywood. Much nicer hotels there! If you don't care what your hotel looks like or where you stay. But if you like to sleep calmly and feel at least a little comfy on your vacation - then spend a bit more and go somewhere else.", "Date": "January 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“everything you'll need”", "Author": "blackhabbit", "ReviewID": "UR12311225", "Content": "pleasantly surprised. best deal in area. two block walk to union station. all day come and go parking for only $4 for my two day stay. big mini fridge. huge bathroom. neighborhood is fine, no worries.", "Date": "January 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NH", "Title": "“Location is great!”", "Author": "NHgal922", "ReviewID": "UR11296981", "Content": "We stayed at this hotel for 3 nights and thought it was great. You can walk to Union station and get any train or bus. Great if you are not renting a car. It's only $4 to get to and from LAX - BIG plus. As two woman, we felt safe here. The neighborhood is lit up at night. Our room was spacious and clean. There is a bit of a language barrier with the staff, but not too bad. They were helpful and pleasant. The breakfast is basic, but has what you need (fresh bagals, cereals, juice and coffee.) We checked in a few hours before we were supposed to, and our room was clean and ready. We had a problem with our safe, and they sent someone up to look at it within 5 minutes. Most of the tv channels are in asian or spanish. Kind of a bummer if you want to watch tv. But we were out most of the time, so it wasn't a big problem. There is a security guard on duty all the time, but he mostly sleeps in a chair. Overall, good stay and we would stay there again.", "Date": "December 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Beat value in LA”", "Author": "Persia69", "ReviewID": "UR10741066", "Content": "We have stayed in LA many times and this would have to be the best value and best location. Caught the Flyaway to and from from LAX for $4 each way to Union Station then a five minute walk to the hotel. Used the Metro from Union Station on a $5/day pass to get around on buses and the subway and saw everything we wanted to. Clean, neat, convenient, good value with breakfst included- can't beat that.", "Date": "November 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "East Granby, CT", "Title": "“Shaky Start But Only Got Better”", "Author": "dopplersmash", "ReviewID": "UR10045916", "Content": "Well, after reserving on the hotel's own website months before, I was not happy to arrive at the front desk and be told that there was no record of my reservation. Fortunately, I had my confirmation e-mail with me. It all worked out as I was given an oversized corner room that I probably wouldn't have otherwise. From there, everything smothed out. The property was clean, conveniently located near Union Station (note that it is margially walkable with luggage even if you are in reasonably good shape) and a short taxi ride from Dodger Stadium (plan on $7-$12 each way depending upon traffic). The continental breakfast was nothing fancy but more than adequate, and a hotel staffer was continuously on duty to clean and monitor the food. All in all, for a city hotel at a moderate price, I was pleased with the accommodations itself. You might want to confirm your reservation, however, prior to showing up.", "Date": "October 6, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Holland", "Title": "“Good for 1 night”", "Author": "MarluHolland", "ReviewID": "UR8240189", "Content": "We (my girfriend and I) spent 2 nights here after a long flight from fiji. The hotel is only 5 min away from union station and the flyaway bus service. In essence we agree with the previous review. The rooms are big and clean and the beds are comfortable, although the airco is making a lot of noise while not cutting the job (e.g. get the temp. down in the room). The location is good if you have your own car or do not mind a 5 min walk to union and taking the sub for 20 min to Hollywood. Now the bad stuff: First of all the staff is indeed really rude. Not even a smile when checking in and my girlfriend is claustrophobic and asked to use the stairs, but to do this you first have to take the elevator to the 3rd floor, walk back to the 2nd to open up the backdoor to let her in. The owner/manager was really disrespectful of this and actually yelling to her about it. So really do not expect any good service/hospitality from the chinese, they are just after your money. Secondly, the breakfast is a joke. Just some toast and bagels/muffins, a banana and some cereals, cheese and marmelade. On both mornings, cleaning staff were eating from the buffet as well and on both mornings they were vacuumcleaning the hallduring breakfast, which was very annoying. During this, the manager got into a loud argument with one of the arriving guests..... We would reccommend this hotel just for one or two nights because it is cheap and conveniently located from the airport and downtown/public transport. Hope this helped, Regards from Holland, M&L", "Date": "July 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "-", "Title": "“Room is clean, but very loud and some unfriendly staff”", "Author": "Hotelnutzer", "ReviewID": "UR7800352", "Content": "the most important thing first: the room is clean. but forget the customer service. the whole front desk staff was very unfriendly during the check-in. and the worst event was the renovation at subway next door at 6.00 am!!! we were sleeping and suddenly the firealarm went on and on because of the working at subway. the alarm was so loud that we couldn't sleep anymore and went down to eat breakfast. and after we asked the owners chinese wife what was going on, all we got was only an evil laugh from her. that was really disrespectful! so if you stay here, don't expect too much service. the room was loud too because a gas station and big junction with trucks were in front of the hotel. the good thing is, you don't have to walk much to reach union station. unfortunately hollywood is approximately 45 min. away. this hotel only offers valet parking (4$ per day) in a real small garage. so it happens that the valet parking chinese girl has to search your car between all the other cars which stand in front of yours. in summary, if you stay for a few days, it's ok.", "Date": "June 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "5", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Hannover - Germany", "Title": "“It is a hotel only for one night”", "Author": "Sissi70", "ReviewID": "UR7477048", "Content": "The Lobby and the most of this Hotel are smelling from the Subway Restaurant, which is beside from this hotel. I had room 430 and it was not smelling, but very noisy from outside. I booked for 6 days. At my second day in this hotel I saw one cockroach. The cockroach tryed to follow me in my room from the floor. I killed the cockroach and thought now, it is over, but the third day I saw a new cockroach on the wall in the near of my bed. I caught the cockroach and brought it to the reception. But the staff ignore the cockroach and throwaway it. The hotel was outbooked and I could not change the room. But I think, it is not only the problem in my room. I tryed to find another Hotel, but they was all to expensive for me. Now I caught dayly one cockroach. And at my last day I found one in the bathtub. I was happy to leave the hotel early in the morning. When you will stay in this hotel let your baggage closed and check all by leaving the hotel. The good thing is, that the hotel is very near by all attractions and Los Angeles is very nice. The hotel staff is helpful and gives much informations for tours and the staff is very fast to repair things in the room. The hotel room is clean and I wonder, why cockroaches in this room / Hotel. Or is it normal for a downtown hotel. Sometimes I thought, that I am to sensitive????? I will not come back to this hotel.", "Date": "April 27, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Great location if you don't have a car and are coming by train”", "Author": "travelcommons", "ReviewID": "UR7365559", "Content": "I rate this property a 5 because of it's super location, amenities and unbeatable price... - Location Bonus #1....My girlfriend and I arrived 4 hours late on our Coast Starlight Amtrak. Instead of arriving at 9pm, we arrived at 1:30am. The hotel is a 5-7 minute walk 2 blocks away from the main entrance of Union Station. It is located on a busy street, so even late at night we didn't feel unsafe or worried because there was plenty of light and a Chevron gas station was right next to the hotel (bright lights!). And with all of our luggage, the hotel's location was a lifesaver since the subway system was no longer running and we didn't feel like spending money on a taxi. - Location Bonus #2.. Cheap restaurants are less than one block away, including a Subway, multiple Chinese restaurants (with lunch specials for only $4 including rice and soup!), a BBQ joint ([--]), and the Original Phillipes, which is recommended by the Frommers guidebook. - Location Bonus #3.... you are one block away from Chinatown, and one morning we took a 90 minute walk around by following helpful markers that map out the route and provide detailed history about the area. It is also located across the street from Pueblo de Los Angeles Historical Monument, which is a pedestrian-only street with vendors, restaurants, a church and a museum. All free too! - Location Bonus #4.... since we didn't rent a car, we bought Metro Bus Day passes that work on the lightrail/subway, the regular buses, and the DASH buses. If you want to forgo buying the bus pass, then for only 25 cents you can ride the DASH bus that will take you all the way to the heart of LA, and from there you can connect with other DASH buses. DASH buses are great because they are cheap and they run every 5-10 minutes on fixed routes. And with a stop so close to the hotel, you can't go wrong with relying on the DASH. - Amenities. There is an on-site parking garage for people that have a car. I think that the rate is maybe $8 a day? Can't be sure though, just call them. The continental breakfast was an added surprise, fresh and sufficient. You have 2 types of cereal, milk, coffee, tea, apple juice, orange juice, donut bars, bananas, bagels, english muffins, jams/jellies, cream cheese. No waffles or anything hot like that, but it did a good job of holding us over until the late morning and the nice thing is that it runs from 6:30AM-10:00AM. The 2nd floor of the hotel has a fitness room that wasn't too small and looked fine. There is also free cold/hot water dispensers located next the elevators on each floor, so it was great to fill up your water bottle before heading off. Check out was 12pm. -Accommodations/Price--totally fine. Nothing fancy. It was clean, there's a few cable channels but no premium channels like HBO or Showtime. The room came with a small fridge and toiletries like soap and shampoo. Real hangers in the closet. Nothing much else, it was perfect for our 2 nights and at only $75, it just can't be beat. I saw a sign that at the front that also offers 10% off to AAA members, so if you have your card, Show It! Didn't have much interaction with the staff. We were checked in quickly at 1:40am in the morning. Check out was quick. They do take your credit card at the beginning of your stay and put a hold of like $50 or something. One last thing is that they have racks of tourist brochures, including $8 off Knott's Berry Farm. Plus maps for the LA Fashion District, Hollywood, Santa Monica and more. The front desk also has walking tour maps of Chinatown and information for catching the bus to Santa Monica. This was a good visit and I would not hesitate one bit to stay here on my next visit to LA, especially if I don't have a car to get around.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Clean Room, but some Unfriendly Staff”", "Author": "Garrance", "ReviewID": "UR6230937", "Content": "Two issues: Cleanliness & Customer Service. Cleanliness: My room was clean, and that is very important to me. The lobby area was also clean, but a bit drab.... it would serve them well to spruce it up a bit., and make it more cheerful. The elevator, however, had a stale odor, which I told the staff about. Customer Service: The woman at the front desk, who mainly works mornings, was cold, unfriendly, and unhelpful; in a nutshell, very unpleasant to deal with. On one occasion, I asked if she had a cup, so I could make tea, and she barked at me that there were cups in my room. I told her those cups were for cold beverages only, and wouldn't work well for hot water. Besides, I was running late to meet a friend, and didn't feel like going back up to my room for a cold beverage cup, especially when they had a restaurant in the hotel, and it would have been easy for her to allow me to get a cup from there, or get one for me. Instead, she gave me a dirty look, then went into the back room behind the front desk and got me a Styrofoam cup, which was dusty, and didn't look fresh. I had to rinse it off. I couldn't understand why she was so unaccomadating and miserable. On another occasion, when I was using their computer down in the lobby, I asked her if there was an outlet so I could charge my cell phone, and, with an obnoxious tone in her voice, she frowned at me and said: \"there are outlets in your room, why don't you charge it there\". So, I told her since I wanted to use the computer, it would be more convenient to charge it in the lobby while I was on the computer.. and also because I was expecting an important phone call. She gave me a dirty look and just pointed to an outlet near the computer. I could not believe how disrespectfully she treated me, it was unbelievable. So to summarize, she should not be working in the hospitality/hotel industry, because she has no clue what Customer Service is and has NO people skills whatsoever. Additional Comment: On a positive note, the night front desk clerk, who worked from 10 PM to 6 am, was a very nice man, very helpful, and friendly. FINAL THOUGHTS: Although I liked the room and the location was convenient to buses and trains, the customer service I received from this woman, was the worst I've ever had.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NSW Australia", "Title": "“Good Location for Tourists”", "Author": "G'day bill", "ReviewID": "UR5825546", "Content": "A good 2 star hotel, we found the staff accomodating and gave us a room at 9am after our 13 hour flight from Australia, The hotel is located 5min walk from Union Station which is were we got on the Red Line to Hollywood and Amtak to San Diego. We stayed two nights and only had the complimentary breakfast once, it was basic but satisfying.", "Date": "September 22, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Location": "2"}, "AuthorLocation": "Arizona", "Title": "“What a NIGHTMARE!”", "Author": "MyTrip2", "ReviewID": "UR5523491", "Content": "We had chosen this property for its proximity to the Union Amtrak station. \"Walking distance,\" What a joke! Yeah, it's a couple of blocks and could be walked if you had minimal luggage. But absolutely not if you are on an extended vacation and have two check-on bags each! So there was a taxi expense. Then there is the car parking expense even if you are an overnight guest: $4 per night and $5 per day in advance if you park your car during your trip. We got lost trying to find the hotel in downtown LA and ended up touring Skid Row. Calling the hotel for help was a joke. They were giving me wrong directions in broken English. This hotel is right in Chinatown. I was not prepared for the culture shock. Then, although the room was old but clean, the air conditioning unit was not working. When they sent the owner up, he sat silently looking at it and replied after a few minutes that the hot roof had made the large room hot and that it would take awhile...the room never did cool completely and we sweated out the night. Upon the eve of our return while still onboard, I realized that Amtrak was running 11 hours late and would not arrive in time to check into this hotel. So I called the hotel directly and was treated very disrespectfully by the hotel owner's wife. She said \"too bad\", I made the reservation and did not call 24 hrs in advance to cancel. Nothing could persuade her to have mercy and not charge us for a room that we could not possiblly check into due to circumstances beyond our control. So needless to say, I would not stay here again under any circumstances. I will catch the train anywhere but downtown LA, like Simi Valley or even Van Nuys, or perhaps San Diego where accomodations are hopefully more reliable.", "Date": "July 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Babson Park, FL", "Title": "“Second stay here”", "Author": "rplove5662", "ReviewID": "UR5461826", "Content": "This was my second stay here and I was pleased once again. It is convenient, affordable, and clean. The bed was very comfortable. The only problem was an additional $10 for my fourteen year old daughter (which I thought was ridiculous) and they wanted to charge us a parking fee for dropping off our luggage in their parking garage. They did take it off finally. The staff was professional but I felt like they did try to add on additional $$$. Breakfast was so-so. I would stay here again as it is convenient to Amtrak, food, the bed was very comfortable, and it was spacious and clean.", "Date": "July 13, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Anaheim, California", "Title": "“Super convenient”", "Author": "seaspecimen", "ReviewID": "UR5458232", "Content": "We stayed there to go to a party in the downtown area, about 2 miles from the hotel. We returned to the hotel at 3 am and had to be let in to the garage because they keep it locked at night. Comforting to know our car would be safe. The room was nicer than I expected for the price. The hotel is clean. The night staff a little slow. From our 4th floor room we could see the end of Olvera street and Union Station on the other side of that. Very nice. Quiet. Breakfast is just carbs and dairy but if you want protein there are taquerias on Olvera St. For LA the price is relatively good and it isn't a dump. If you care more about value and convenience than fancy frills that cost extra then this is the place.", "Date": "July 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Bakersfield", "Title": "“stay here”", "Author": "allady", "ReviewID": "UR5423961", "Content": "This hotel has everything for the budget tourist. Close to public transportation. The DASH bus is $.25 and leaves Union Station every 5 minutes to downtown. Take the Metro to Hollywood and save the gas and parking fee. The hotel (room 401) offers large, quiet room with 2 beds, small fridge, large tiled bath with heat lamps, working A/C, windows that open, clean, friendly staff, $4.00 a day parking, free breakfast and close to cheap food and nice restaurants. This is not a luxury hotel, but offers good value.", "Date": "July 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Washington, UK", "Title": "“Quite a good choice”", "Author": "pwelch", "ReviewID": "UR4581274", "Content": "This hotel surpassed my expectations, I arrived early (around 10am) and it was no problem to check in and get my room. The rooms were quite spacious, very clean and tastefully decorated. Whilst the hotel did not have any luxuries (coffee maker or mini bar) it did have a fridge in the room. Its location was reasonable, a good place to access public transport the Metro and buses are available from Union station. There is a Subway next door and a petrol station over the road - so at least you won't starve. The management were helpful and friendly.", "Date": "March 4, 2006"}], "HotelInfo": {"Name": "Metro Plaza Hotel", "HotelURL": "/ShowUserReviews-g32655-d77829-Reviews-Metro_Plaza_Hotel-Los_Angeles_California.html", "Price": "$95 - $188*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">711 North Main Street</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90012</span></span> </span></span></address>", "HotelID": "77829", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f1/fd/f1fd251baf34439573e316828f3015d16large.jpg"}}