{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Indiana", "Title": "“Lucky to find it but glad I did!”", "Author": "Soushi", "ReviewID": "UR126036203", "Content": "Husband had a routine surgery that was to be same day surgery. However, there was the unexpected need to keep him overnight. I was without a room and hotels near by were full. One of the innkeepers called Clarion and they had rooms. It was very, very difficult to find as there is massive road construction going on all over the area. However, it was a haven when I finally reached it. Staff was so nice. I mentioned that my phone as dead as I had to call family. Hadn't brought a charger as we thought we would be home that afternoon. The person at the desk(wish I could remember her name) immediately offered to look for a charger. She did find one and I was able to recharge my phone. Great people! Room was nice, very comfortable bed.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Springfield, Illinois", "Title": "“COMPLETELY RE-DONE and LOOKS GREAT!!”", "Author": "flyers1255", "ReviewID": "UR123260051", "Content": "The Clarion has been completely re-done, my family and I have recently stayed here and enjoyed the waterfront view and great access to downtown! The staff was very friendly and helpful. I definetly recommend this hotel!", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Indianapo", "Title": "“New managers and staff are working to provide a great place to stay”", "Author": "David B", "ReviewID": "UR121950010", "Content": "I attend a retreat each December with about 400 in attendance for the weekend. The pool, spa, atrium, and meeting rooms are all important. This year it was a new staff and they all responded quickly to requests.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Columbus,in", "Title": "“Great staff”", "Author": "Bob O", "ReviewID": "UR121627255", "Content": "The staff at this property are one of the few who genuinely care about their guest's comfort without it being forced by corporate policy", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Louisville", "Title": "“Getting Better”", "Author": "LurchLouisville", "ReviewID": "UR119606264", "Content": "We have stayed at the hotel many times due to conf. over the last 10 years. This year without a doupt they have made great improvements. There is still alot that needs to be done but do keep up the good work and in the near future you will have a hotel to be proud of.", "Date": "October 22, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Michigan", "Title": "“Horrible”", "Author": "lucasklcs", "ReviewID": "UR118016209", "Content": "We had trouble finding our room because the room number was lying on the floor next to the door. Our non-smoking room curtains had burn holes. Went to use the hair dryer and it fell off the wall. The TV remote was non working. Knob in bathroom for the overhead heater was not flush exposing a possible electrical hazzard.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Missing maintenance”", "Author": "Enanita", "ReviewID": "UR117605449", "Content": "We went there on Aug 28 for the Moto GP race. Area is not bad, nice lake in front, lobby was alright until you got to your room.... Lack of maintenance for this hotel is the main problem. After reading the bad reviews I was concerned but I figure it must be not so bad. After 14 hours of driving and 85 degrees outside the only thing we needed was a/c and a clean room. A/C was not working, room was as clean as an 25 years old hotel can be. Spending one night there was more than enough not a place that I would recommand neither wlll stay there again. The cloudy pool didn't look much inviting either.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Not worth the money !!”", "Author": "Maria V", "ReviewID": "UR117397539", "Content": "Our stay was not good. There were spider webs,on inside window and a huge one on outside window.The rug was so dirty my white socks turned black.My Mom killed a roach on the 2nd day. I complained to the evening desk counter. Desk person was not skilled in customer service,she apologized but that was it.When we checked out, I spoke to the manager and she apologized and gave me half off 2nd night. The front lobby was exceptional clean.Althought the manager gave me a discount, I still would never stay there again.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great Value...”", "Author": "lovelyshital", "ReviewID": "UR115636704", "Content": "We stayed here for the races, and it's conveniently located close by the speedway (3 miles.) The staff was very friendly, and although the property is a little old, the rooms and lobby were well maintained. We all (including the kids) had a great time hanging out at the pool in the atrium area. All in all, it was a great stay for the price and we would recommend it to anyone.", "Date": "July 22, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Had a great time – Will stay again”", "Author": "LMcdonald12", "ReviewID": "UR115333483", "Content": "I don’t know what is up with the bad reviews. My family and I had a really nice stay at this hotel while visiting friends in the area. The rooms were large and clean and my kids and I had a blast at the pool. The price was really reasonable and we will definitely stay again.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good experience Come back again”", "Author": "travelingadvisor92", "ReviewID": "UR114848508", "Content": "I don't know why this hotel gets bad reviews. This is the hotel I stay at when I visit Indy. It has a nice pool. Good value for the price.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Elizabethtown, Kentucky", "Title": "“Old and wore out, needs refurbishing! Won't be back to this one!”", "Author": "indyzdanny", "ReviewID": "UR111345064", "Content": "My family stayed here to be near the Indy Motor Speedway on Qualification Weekend. Photos on line looked great, but those photos must be 10 years old or more. It is very worn! We got a non smoking first floor room. The room smelled smoked in for sure and our window to the outside did not have a lock on it. My wife complained about that and the front desk attendent brought us a stick to put in the track to keep it from opening. Our bedspreads were stained and a bit dirty. Overall the room was pretty crappy. The pool area is all cracked up, the trees in the atrium are overgrown, the skylights have numerous cracks and appear to have been repaired with duct tape! I expected much better from a Clarion hotel, was very disappointed and won't be back unless they do a complete makeover to the property. One nice thing to say...their breakfast was very good!", "Date": "June 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Iowa, USA", "Title": "“Terrible hotel”", "Author": "Dave3249", "ReviewID": "UR110744682", "Content": "This place needs to be shut down and renovated. We stayed over Indy Race weekend. The only pro for this hotel is that is about 3 miles from the track and very convenient for race fans. But, the place is nasty and run down. No water pressure. Grout in bathroom was filthy. Bath fan made a screeching noise when you turn the light on. Bed comforter was stained. Carpet was filthy and worn. Furniture in rooms are old, worn, and dirty. Ice machines didn't work. Entire hotel smelled like a combination of smoke and mold. We had another night reserved after the race on Sunday night but left early. We would rather drive through the night to get home then stay at this place another night. Clarion should be embarrassed their name is on this hotel.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Very old and tired!”", "Author": "weedwakr", "ReviewID": "UR108466724", "Content": "I was surprised that Clarion would have their name on a hotel like this. I think it is an old holidome hotel that should be retired. Not clean, carpets stained and rooms smell like old smoke. The pool area and hottub area was nice for hanging out but this place is not a place I would return to.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Urbana, Illinois", "Title": "“Terrible--don't stay there”", "Author": "afrients", "ReviewID": "UR108347578", "Content": "First of all the lobby smelled like a urinal. The key card reader on the outside door did not work well. it took several (12) swipes to get the door to unlock. Also, the door would open partially when locked. The room was tiny. It needed new doors, trim and new shower enclosure. The roof over the pool had cracks that had duct tape over them. I will not stay there again.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“The worst place EVER!”", "Author": "Aniyababy", "ReviewID": "UR101006199", "Content": "Wow....... I don't even know where to begin, it was that BAD! I was trying to have a nice birthday for my daughter and we were going to swim and have a nice time and the manager informed me that only four kids could swim, unless I bought two more rooms which is what we ended up doing. SO we could get enough bands to swim. We used two of the rooms we rented and the third room we did not use at ALL and I called corporate and she did not care at all and said we did use the rooms by using the bands to swim. The manager was very RUDE and UNPROFESSIONAL! There were kids running all over the halls, banging on windows and doors that were not being supervised. The rooms were not very clean, the tubs were rusted around the rim of the sink hole.People were next to the pool drinking and drunk being very loud, which our room was very close to so we had to listen to that until a little after 11 p.m. I could of went to Motel 6 and had a better time and it definitely would of been less of a headache. I will never ever in my life go there again and spend my hard earned money at Clarion Hotels ever again! Don't go there!", "Date": "March 21, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Howard Lake, Minnesota", "Title": "“Terrible Sanitation”", "Author": "EmilyM7", "ReviewID": "UR87320320", "Content": "Goo dripping from the ceiling, gunk on the walls & a bug in my bed were just a few of the nasty encounters I had at this hotel. On the other hand service was good", "Date": "November 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“As school organizer, service/cooperation was great; school attendees were less satisfied.”", "Author": "hreyburn", "ReviewID": "UR86553751", "Content": "We selected this hotel because of the amenities at a reasonable cost to our organization. We appreciated the cooperation of the staff to meet the needs of our week-long school with classroom space, rooms for kilns, special food requests and individual requests for services by school attendees. Transportation service to and from the Indianapolis airport was appreciated. Some school attendees thought their rooms could be cleaner. Early school registrants were unhappy that they got rooms on the second floor rather than on the first floor. School attendees would have appreciated restaurant/food service on Sunday and Monday night. The hotel was not totally prepared for the electrical kiln needs of the school especially when it was needed on the first day of the school. Food service (breakfast and lunch) in the atrium was enjoyed by all.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Willow Springs, Missouri", "Title": "“Tired but they do try”", "Author": "chiett", "ReviewID": "UR75848407", "Content": "Have stayed here 5 times. Have not gotten the room reserved 3 of those times. Hotel is a convention type hotel with a nice lounge. Breakfast is at best sad. Rooms are decent but most often in need of some minor repair. Good hotel for the area (the area is so-so). Close to some eating places and the track. Front desk service is hit or miss but mostly friendly. getting the room for between 60 to 80 is standard (King smoking) with AAA discount.", "Date": "August 18, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Why are the windows fogged!!!”", "Author": "fgman10", "ReviewID": "UR75312833", "Content": "Room windows as well as conference room windows nasty looking!!!!", "Date": "August 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Baltimore, MD", "Title": "“Musty smell; friendly but tired and broke down”", "Author": "Zorro98", "ReviewID": "UR60350221", "Content": "The staff are friendly and helpful. The beds were comfortable and the room was clean. The free breakfast was OK. The indoor pool and hot tub are nice. A LOT of details need attention at this hotel from the loose light switches to the frayed carpet on the stairway to the evidence on the ceiling of obvious roof leaks. The worst thing: a very musty smell throughout the corridors and the room (perhaps related to the leaky roof?) which was made much worse by turning on the air conditioning system - it's like they've never cleaned or changed the filter. I read the other reviews and agree with most of the negative reports here. The only reason we stayed in this hotel was because rooms were so hard to find that week end (The Final Four was happening). You can do worse than this place but you can do a whole lot better. Shop around for better.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Cocoa Beach, Florida", "Title": "“Needs work to be a 3 star hotel”", "Author": "ngtybtnice", "ReviewID": "UR38659644", "Content": "We were at this hotel for two nights to attend a conference. The rooms were shabby, the beds were rundown, the \"fitted\" sheets didn't fit.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "davenport, iowa", "Title": "“This place is awful.....”", "Author": "indyfan58", "ReviewID": "UR36024911", "Content": "You will not want to walk on the carpet without your shoes. Bathroom door was warped and wouldn't close. Damage to the door from a dog locked in. Tub floor was disgusting. Water glasses and coffee mugs were filthy. Awful musty smell comes out of a/c unit. Light bulbs missing and hair dryer stays on for 10 seconds and shuts off. Good location to the speedway, but that's the only plus. Continental breakfast is a joke - go to the nearby Denny's.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Akron, Ohio", "Title": "“Icky, go elsewhere”", "Author": "NMD_Ohio", "ReviewID": "UR28861393", "Content": "Rooms and public areas were shabby--this is okay when clean, BUT, my room had black mold all over and the whole place smelled stale and nasty. There was mold all over the AC outlet in my room (I cleaned before using), and when I took a shower, the moisture revealed the appearance of black mold on the grout around the tiles and all over the shower curtain. ICK! I was locked into my first night with 72 hours required for cancellation and the place sold out (?!?), but moved to a nice clean hotel elsewhere the next day. AVOID this place!", "Date": "April 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Kansas City", "Title": "“Creepy”", "Author": "PopStop", "ReviewID": "UR18183389", "Content": "We arrived in a storm, so we would have understood some problems -- but ick. We reserved a smoking room, the tired and put-out desk clerk gave us a non-smoking room that involved a half-mile walk to the room then back to get a smoking room. While my husband waited in the non-smoking room, he saw that the door had been jimmied. Then we were put in shabby rooms at the back of the hotel, everything was damp -- the sheets, the floor, it was just gross. Apparently those dreary little rooms are the smoking section of the hotel, but nothing was really right. Reminded me of the Shining, just creepy. I will certainly never stay there again.", "Date": "July 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Medina, Ohio", "Title": "“Weird accomodations”", "Author": "Metoer1962", "ReviewID": "UR17147776", "Content": "Strange mix of good and bad. Like, our room had TWO hair dryers but no microwave or fridge. There were dogs running around in the movie theater. Carpet has a strange design and very outdated. Things were ripped from the bathroom door leaving holes. All the pop machines broke or empty. The buffet in the restaurant is $11 and you don't get a beverage! They only have water. I'm not kidding. Only 1 working jet in the hot tub. One the upside: staff was friendly, public restrooms clean, a/c was pumping good, cold air, they cleaned our room super fast, and the mini shampoos are high quality.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ohio", "Title": "“Don't stay here”", "Author": "MAtraveler22", "ReviewID": "UR15000143", "Content": "Based on the pictures we thought it looked nice- boy were we wrong. I do nnot know how people are saying this was a nice place. The first floor rooms had windows that did not lock with only a small piece of dry rot wood to act as a lock. The walls were a white painted stucco with too many finger prints, black marks and dirt to mention. There was hair in the bathtubs, hair on the toilets, bugs in the rooms and yellow stains on the sheets. Not sure if they were just cleaned insufficiently or not cleaned at all. There were signs on the windows at each door stating there was 24 hour video surveilence as well as an armed guard stationed at the desk- this made us feel it must not be a great part of town. All of the rooms we were in as well as the hallways smelled of cigarette smoke even though it was posted no smoking. We had a group of people we were traveling with who all had the same expierience. The only plus was the rooms manager who allowed at least 4 of us to check out with no charge. She asked us to please fill out a comment card because when she tries to tell upper management they do not believe her. This hotel needs to either tear down and start from scratch, or advertise as a $50 a night hotel.", "Date": "April 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "MidWest", "Title": "“Run Down - NOT 3 stars!!!”", "Author": "justravlin", "ReviewID": "UR13919274", "Content": "This Hotel is NOT three stars - the rating needs to be changed to Two Stars. O.K. Bed and pillows but all else was very dated and worn. Gross stains on the chairs; The In-Room AC/Heat unit was filthy and delivered poor quality smelly air.; The in room refridgerator was broken. The dining area where continental breakfast was served was also really worn and tired. Again, stains and cigarette burns on all the seating areas. Just NOT a comfortable stay.", "Date": "February 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Evansville, IN", "Title": "“Clarion sucks”", "Author": "jdick357", "ReviewID": "UR8395865", "Content": "Stayed two nights in early August. Toilet ran every 10 seconds all night. Bathroom was shabby. One poor soul working the front desk at 5:00pm, trying to answer phone, book reservations & check in guests. Beds were set up on a 1\"x4\" board \"frame\", one bed fell into the frame as I slept. Called desk at 10:00pm to get hand towels & wash cloths, because housekeeping had left none, called again at 12:00am & was told that there were no towels or wash cloths to be found. Lawn care person drove in front of us as we were going to our vehicle to leave, blowing grass all over us & suitcases, then turned around to blow grass & dirt on our van, at least he didn't throw a rock at us, not that anyone who worked there would care. NEVER AGAIN! Not here, not Clarion, not any Choice Hotel franchise", "Date": "August 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Illinois", "Title": "“Good Accomodations, GREAT Hospitality!!”", "Author": "familytravelfun2007", "ReviewID": "UR8357339", "Content": "We just had our family reunion with 30 people from 4states. The hotel was what we expected. Not luxurious, but clean and comfortable. The atrium pool and hot tub were well kept and clean. The sales office which we made the reservaitons through was wonderful!!! Doris was a pleasure to deal with and bent over backwards to meet all the different needs of 10 families. Marissa, the general mgr. was very accomodating when some of the originally reqested room types were unavailable. She spent at least 20min rearranging and looking for rooms so that every family ended up with a room type and location they wanted!! I was very impressed with all the hotel staff that went out of their way to make sure our stay was pleasant. The only issue we had was with some of the housekeeping staff who only made beds, did not clean the rooms. Otherwise, I would highly reccoment this hotel, especially for families!!!", "Date": "August 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Don't stay here”", "Author": "westwriter", "ReviewID": "UR8266993", "Content": "We stayed here for the Indy 400, so the $200 room rate was nonrefundable once the reservation was confirmed. For that rate, we got cigarette holes in the sheets, awful beds, a room we didn't request (a double instead of a king), and a non-functioning toilet. Drink machines in the halls didn't work. The hot tub didn't work. The whole hotel is outdated and tired.", "Date": "July 31, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Torrington, CT", "Title": "“really good hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5013452", "Content": "Hotel staff was very friendly, the manager was really nice as well, the hotel was clean, breakfast was wonderful, It was more then I expected.", "Date": "April 27, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ankeny, IA", "Title": "“Stay Away!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4158549", "Content": "Here are the top 8 reasons we will not stay at this property again: 1) All common areas reeked of cigarette smoke. 2) The room was over 80 degrees when we entered. 3) No stopper in the sink - s small problem for those with contact lenses. 4) Clock radio found on the floor behind the night stand - with the time set one hour ahead. I'm guessing the room had not been used since the time changed. 5)The light fixture on the wall between the beds didn't work. The reson was that the cord had been cut and the plug was missing. 6) Property in general is old and has not been renovated for years. 7) When an attempt was made to discuss these problems, the front desk clerk walked away without any response. 8) The room we were given could only be reasonably accessed by a flight of stairs since the elevator was at the far end of the building. There couldn't have been more than 10 rooms in use and we could have easily had a room very near the elevator. This property is rated 3 diamonds by AAA and is by the far the worst property we have ever experienced. Do not even think about staying there!", "Date": "December 2, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Kalamazoo, Michigan", "Title": "“The WORST hotel ever!!!”", "Author": "lipsforchrist", "ReviewID": "UR4084973", "Content": "We stayed at this hotel with our 3 young children. We are seasoned travelers, with alot of time overseas so we are used to things being sometimes icky, but what we experianced at this hotel was unacceptable! They had no crib or playpen on site for our baby. They did not have towels in the pool area despite the fact that they were not busy, our room had NO ironing board or iron. Our tile in the bathroom was horribly moldy. The tub was not clean, and the corners of the floor had PILES of dirt, wall plaster and rust. We needed a couple extra pillows and blankets and had to wait until almost midnight until we got them. To kick it all off, our TOILET would not work and everytime during the night we needed to flush it we had to fill it with our ice bucket. We tried to work with the staff on each of these things separatly and was told each time \"Not at this time,Ma'am/Sir\". They were not willing to fix any of their errors including the toilet! We paid $80 a night and according to a card in the room our stay was 100% guarenteed or our money back, but we have yet to see a refund. Honestly, this hotel was worst then ANY we have been in overseas. We certianly expect at least a working toilet for almost $100.", "Date": "November 3, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Hamilton Ohio", "Title": "“Terrible Hotel!!!”", "Author": "Verbatim", "ReviewID": "UR2438884", "Content": "The hotel was terrible!! There were bugs in the room; table was broken; kiss lips imprint on the window glass; not all lights worked in room; and some outlets didn't work. We stayed for the Brickyard 400 weekend. We got a great price thank goodness or we would have been more disappointed than we were.", "Date": "August 10, 2004"}], "HotelInfo": {"Name": "Clarion Hotel & Conference Center", "HotelURL": "/ShowUserReviews-g37209-d78887-Reviews-Clarion_Hotel_Conference_Center-Indianapolis_Indiana.html", "Price": "$80 - $99*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2930 Waterfront Parkway</span>, <span class=\"extended-address\">West Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46214</span></span> </span> </span> </address>", "HotelID": "78887", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bb/d3/bbd36cd1871e72c6b31d4b6dcfae27463large.jpg"}}