{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“wunderbar!”", "Author": "brenda a", "ReviewID": "UR126959697", "Content": "It was a very comfortable and happy stay here. It was also very close to the fair grounds and to other amenities. We liked the services and the staff was very helpful and friendly. Breakfast was not very good in that we did not have much choice but for the price we paid, we thought it was reasonable. We might try other hotels in our next visits to Berlin but I would certainly recommend this to any first time tourist to Berlin.", "Date": "March 30, 2012"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "el paso", "Title": "“Pretty good if you want an inexpensive room for a couple of days.”", "Author": "chukarhead", "ReviewID": "UR115005842", "Content": "This hotel is a little weird but it is reasonably priced and very close to the U-bahn stop that takes you into the interesting parts of town. The ride to Potsdamer Platz is about twenty minutes. Like another reviewer has stated, the hotel does not provide parking so you must find parking on the street in the neighborhood. We parked for free about two blocks away after unloading our luggage in front of the hotel. The hotel is one floor of an apartment building. The street level door is locked so you must ring the bell and be buzzed in or use your room key. When we were there the elevator worked but we had a broken cold water faucet in the shower which was fixed the next day after we reported it. You will not find any luxuries at this hotel. But the breakfast was free and it was the basic stuff- hardboiled eggs, breads, coffee. The neighborhood was safe as far as I could tell. The Italian restaurant on the corner was good.", "Date": "July 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Warsaw, Poland", "Title": "“You get what you pay for”", "Author": "goldhorn", "ReviewID": "UR103451391", "Content": "Hotel is reasonably positioned to Brandenburg gate and area. Elevator did not work and probably doesn't often so remember that your room is two flights up from street level if you have a lot of luggage. Room was neat and tidy. Two single beds...quite small so move them together so you don't fall out of bed if you roll over. Mattresses were hard. If you're over 45, you might have a sore back in the morning. Breakfast room is small. We arrived at 8:45 and room was full. We had to wait 1/2 hour before we could eat. Parking can be a problem as it is only street available. At the end of the day, for 59 Euro, not bad but we will probably not return.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Great location and price, clean”", "Author": "paym01", "ReviewID": "UR14969578", "Content": "This hotel is very reasonably priced (40 Euros/night), located right next to the Kaiserdamm U-Bon (U2 line), and 5 minutes walk to MESS NORD ICC S-Bon (S41 & 42 loop). I had a clean twin bed in my room, newly remodeled, and spacious bathroom. The breakfast is included, but nothing to write home about. Great location very near central and downtown areas of Berlin using either the S-bon or the U-bon. No internet in the hotel or near by that I could find.", "Date": "April 11, 2008"}], "HotelInfo": {"Name": "Amelie Messe ICC", "HotelURL": "/ShowUserReviews-g187323-d796582-Reviews-Amelie_Messe_ICC-Berlin.html", "Price": "$51 - $104*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kaiserdamm 29</span>, <span class=\"locality\"><span property=\"v:postal-code\">14057</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "796582", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c4/b0/c4b0e03100757f41729fbd3a530e33843large.jpg"}}