{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice, clean room”", "Author": "martigold", "ReviewID": "UR124251542", "Content": "The rooms in this hotel are small, but clean. We loved the location (near Piazza del Popolo) and walked everywhere in Rome. The hotel has a charming cage-type elevator. A delicious breakfast is included in the cost of the room. Hotel offers free access to two computers for use by guests and we were able to upload photos.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“A great find!”", "Author": "mls_82", "ReviewID": "UR123628232", "Content": "We stayed in a balcony room. It had a beautiful roman view and a lovely courtyard to sit in to share a bottle of wine and some cheese. Note you do have to walk up the last 2 flights of stairs for this room. The balcony is shared with the room next door, which posed no problems for us. We loved the charming old feel of the room and of the hotel. The breakfast buffet was very nice, and we appreciated the touch of espresso coffees. The hotel is close to the high end shopping street and spanish steps, which has a great busty feel in the evenings. The hotel itself was very quiet and we slept well. Plenty of nice cafes and restaurants nearby. Close for walks along the banks of the river. 20min walk from the Vatican. Tip, buy your tickets online for attractions and go in the morning- the crowds seem to come out lunch time to evening. Close to the Borghese gardens, which in addition to the Vatican, was our favourite place in Rome. This was the only place I felt like I truly got to see how Romans live, picnicking and riding bikes with their families on the weekend. The best thing about this hotel was the price. This hotel gave us a great experience of Rome.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Accomodation”", "Author": "Ioanna T", "ReviewID": "UR123393699", "Content": "Generally a good choise! Clean and comfy rooms, good breakfast but the best of all was that this hotel is 1 minute walking from Via del Corso, and 4' from Piazza den Poppolo and Spanish steps!! You can find many good restaurants in the area!", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Great Hotel, nice staff and best location”", "Author": "MRAMIREZDC", "ReviewID": "UR121301826", "Content": "We loved this hotel. The staff was great, the room was good and the location was the best. If you want to be on the center of Rome and the Vatican for a great price, this is the place to be. Only bad thing... The shower was really small, you will feel like in a submarine, but it is because we are used to big showers in America and Latin America. Realmente es una excelente opcion. Recomendado 100%", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Laid back feel but well run”", "Author": "trenchfoot", "ReviewID": "UR121093803", "Content": "Apart from being close to the Spanish steps, the Centrale is a few hundred metres from the underground station just across Piazza de Popolo. Buy a three day ticket (the machines are easy to use) and you have great access to the Vatican area a couple of stops away and, changing at Termini, to the Colosseum. The stations are clean and well signposted. We didn't bother with the busses although the three day ticket covers them too. Breakfast is surprising: lots of variety but the food is dotted around the room! The coffee is great, but I agree with other reviewers that the ersatz orange juice is a bit of a let down. The rooms are inevitably small given the age of the building, but the building is well maintained and kitted out. The showers are a tad small so if you are well upholstered a different hotel might be wise. The street noise at the front is evident but truly Italian. Our air con didn't work ( moved air but didn't alter the temperature) and the front of house staff didn't seem fussed. This wasn't an issue in November but could be a stressor in summer. The staff were friendly and helpful. The lift (elevator if you're from across the pond) is classic old Europe: small with spy movie sliding grille doors. On closer inspection it seems well looked after. Beware the occasional idiot that leaves it on the top floor with the doors open so it can't be called to the ground floor. This is a characterful, memorable small hotel in a great location for tourists. It is in a very safe area. I would heartily recommend it to anyone wishing to see Rome who doesn't want to stay in a corporate clone hotel.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Farmingdale, New York", "Title": "“Good for the money”", "Author": "MoreTrips4me", "ReviewID": "UR120873232", "Content": "My husband and I stayed at the hotel for 4 days and were very happy with our stay. We got to the hotel at 11am the first day and were told we'd need to wait until 3pm to check in. A few minutes later, they told us that they had a room for us after all. We got in the elevator (which was extremely old looking and didn't feel like it would be able to lift our weight) and went to our room. The room was really nice and much larger than what we were expecting. The bathroom had a full tub with a glass door which only extended half way (so the other half of the tub had no door at all). This made for very messy showers and water went absolutely everywhere. The bathroom also had a toilet whose seat was not the same size as the toilet itself, and a bidet. The main room was nice with high ceilings. The room was also all digital (lights would stay on when you put your room key card into a slot and press the light button). We liked it a lot, though it took us a little while to figure it out. The hotel provided free internet which worked pretty well. The only thing is that we had to specifically ask for the internet username & password - they weren't provided to us automatically. I think this might have been a mistake on the hotel staff's part (or possibly a result of our checking in early). the hotel was about 5 minutes walk from the Spanish Steps. We were really happy with the location and would definitely stay there again.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great value in an expensive city with unbeatable location”", "Author": "pipja", "ReviewID": "UR119767719", "Content": "Went to Rome with a gal pal for a few days, and booked into the Centrale as it seemed like a good price. Firstly, the location is unbeatable. Just a couple of minute's stroll from Piazza de Popolo, and the Spanish Steps, sandwiched in a small street between the main Via Corsa and some of the smartest designer shopping streets. From there, we walked everywhere including to the Colosseum and The Vatican, but it's also close to a metro station. Secondly, the staff were extremely welcoming and friendly, with good English. Thirdly, a good continental style breakfast with plenty of rolls and croissants, fruit, cereals etc. They serve till 10am so you can have a nice lie in and still get your breakfast! Fourthly, the rooms whilst on the snug side, were inpeccably clean with plenty of wardrobe space, and extremely comfy beds with good quality sheets and pillow cases, plus very effective air conditioning ( which you seem to have to pay extra for in other \"budget\" Rome hotels). Overall, we felt that the Centrale represented extremely good value for money in what is a very expensive city, hotel wise. It was a terrific base for our 4 day holiday and I would certainly go back and stay there again.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Hope to be back soon!”", "Author": "Loveliness_11", "ReviewID": "UR118654546", "Content": "My husband and I stayed at Hotel Centrale last May. We were actually more than satisfied with the amenities the hotel offered, mainly because we were expecting something less. A look at the pictures in the hotel's website gave us the impression that it is a very old hotel. In reality, it was a newly renovated small, homey, comfortable, accessible hotel. Location is perfect. So near the tourist and shopping spots, yet not near enough to be too noisy. Rooms were bit small, but layout certainly very efficient. Bathroom is kinda cute too, but since we're not of big build, we could fit in comfortably. Staff was most friendly and very helpful at giving advice. Metro station is very near. Several good restos within the vicinity. We had a really good time. Without doubt, we would recommend this hotel to our friends! Keep up the good work.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "South Africa", "Title": "“Disappointed”", "Author": "neoprene", "ReviewID": "UR118374027", "Content": "It was more expensive than others in walking distance and offered far less in service, breakfast. Although my room was larger than expected the double bed for which I was paying was only two single beds pushed together and covered by a double sheet. The divide was very noticeable so I still only had the use of a single. Breakfast was okay, enough said. I have often read \"the shower was tiny\" well now I know what they meant. I could not bend down, I had to squat to pick up my toiletries. Okay I am 6.3' so maybe I'm picky. I also experienced an onslaught of bites around my ankles. Not sure what they were but they itches like crazy.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Everything was fantastic but...”", "Author": "Remmyf", "ReviewID": "UR118319540", "Content": "Prior guest had smoked in the room we were staying in and it smelled horrible. The room was spacious and comfortable. The bathroom was small but seemed standard for European hotels. Freah towels were supplied everyday. Wifi was available which was a huge plus for us and easy to find off the Spanish steps metro stop. the breakfast was great and fresh cappuccinos to order. And the computer was nice and accessible with a printer. I would reccomend even though the room smelled like smokey. The reception was super friendly as well!", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moscow, Pennsylvania", "Title": "“YES! I loved it. I am ready to be back!”", "Author": "vs-versus", "ReviewID": "UR117028097", "Content": "Very good value for money. Pleasure to stay. Great staff!!! Many thanks for double expresso with milk every morning and \"buonanotte\" at the evening!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Surrey UK", "Title": "“Very pleasant hotel in an excellent location.”", "Author": "deccrv", "ReviewID": "UR116351305", "Content": "Just spent three nights here with my wife and 17 year old son and would find it difficult to call out any major issues with this hotel. It's perhaps a little expensive for a three star and the breakfast could have a bit more choice but other than that it was perfect for a short break in Rome. Location is excellent, just a short walk from the metro and the rooms are very comfortable. We had room 14 made up asa triple so it was a bit of a squeeze but it would make a fine double, with a good size bathroom. Air conditioning works fine although it does rumble a bit but I guess that is expected as the hotel wasn't purpose built with it in. The staff were friendly and pleasant although we never really had to put them to the test. Whilst we used the metro, there's plenty of sights within walking distance, such as, The Spanish Steps, Trivoli fountain, Pantheon and we even walked back from the Vatican, which was very pleasant along the river. The area is lively at night, with plenty of shops and restaurants but we didn't here any street noise as we were at the back of the hotel. All in all a good little hotel, cleanly presented and ideal for a short break in Rome.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Stockton, California", "Title": "“30th Anniversary”", "Author": "erms", "ReviewID": "UR115916724", "Content": "A wonderful vacation and a nice enough hotel but we opt for the suite and to be honest for the money I expected more. There is no coffee in the room, which I think is typical but downstairs in the small dining room the coffee is shut down. The desk clerk offered us cappachino but failed to tell us there was a charge. The charge was not the issue, just not being informed and when we checked out that is when we were told unfortunately we didn't have any small bills and the manager waived it... felt like we were put on spot. Anyway, I would not hesitate to stay there again but not the suite. It is a great location and you can walk to many places. Maybe I should tell they have a resident mouse.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Woodbridge, Ontario", "Title": "“Great Location”", "Author": "W00dbridge", "ReviewID": "UR115845617", "Content": "Close to a lot of the main attractions which was very nice. The room was very small with barely enough room to walk around. The bathroom and the shower were small and uncomfortable.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Excellent Value for the money”", "Author": "sacro69", "ReviewID": "UR115574668", "Content": "3 couples stayed there for our wedding anniversary. The rooms are small compared to american standards, however clean and quiet. We barely stayed in the rooms, since there was so much to see and do. Quite frankly, if you're portly, you will never fit into the bathroom. I'm 5'6\" and my knees hit the wall on the commode. Great breakfast in the morning, and Donato was very helpful in confirming our pick up. Excellent location with a pharmacy, grocery store piazza del popolo, spanish steps and trevi fountain within easy walking distance. Our room was not ready when we got there, but it was made immediately after we informed the front desk. The elevator is small and will only fit 1 person with 2 suitcases. My only complaint is that the power only works when the key is in the slot in the room and the windows are closed. Which means the AC and fridge only run when you are in the room. So if you have to charge camera batteries do so overnight when you sleep. Other than that minor complaint, I would stay there again.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "saskatchewan", "Title": "“Great Location!”", "Author": "Bella44-1", "ReviewID": "UR109107221", "Content": "My husband and I stayed in Rome for two nights. This hotel was within waliking distance from every sight. It was very clean and the front staff was extememly helpful. The only down fall of this hotel was the size of the bathroom it was very small but did the job. I would recomend this hotel to my friends.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“Comfortable hotel and well positioned”", "Author": "mariaoct", "ReviewID": "UR82538402", "Content": "Clean and quiet location, breakfast was good. Beds were a bit hard but that is probably the same for most Rome hotels. Very close to everything and staff were helpful.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Perfect....”", "Author": "Smithy008", "ReviewID": "UR82215932", "Content": "Excellent location close to all the main attractions. We found our room although not large it was comfortably sized and clean. The same to be said about the bathroom. Loved the shower. One night we came in late (we were in Rome for an event) we asked on reception if we could get a coffee, not only did we get a much wanted coffee we also got danish pastries, a lovely gesture. I really do not have a bad word to say about this hotel or the marvellous staff.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oakland, California", "Title": "“Good, clean hotel, with big rooms.”", "Author": "TheGermanSalami", "ReviewID": "UR82130605", "Content": "Two nitpicks, then to the compliments. #1 - the comforter had two spots on it. It was promptly changed upon request. #2 -Bed sheet quality are not those of the US but I think that is being a little too picky. The place is clean with the exception of the comforter incident, which was promptly resolved. HUGE rooms for European standards. Bathroom was huge, too. Breakfast was good. The meat quality was A+. The prosciutto was awesome The market next door is great place to pick up daily fruit, water, and pack a sandwich. That part was key for us since you can pay ridiculous lunch prices in the toursity spots. Location is closer to Piazza di Popolo than Spanish Steps, so take that Metro stop instead of Spagna. In retrospect, I wish we stayed a little closer to the Pantheon or Piazza Navona, which is more centrally located, and closer to the nightlife of Trastevere. But if you want to be near some fancy shopping and the Spanish Steps, this is a great spot.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "scottsdale, AZ", "Title": "“Great hotel, even better staff”", "Author": "studentAZ", "ReviewID": "UR53022497", "Content": "This is the perfect location for anyone traveling to Rome. Walking distance from sites as well as good shopping and restaurants. This hotel is very clean and I felt very safe (I am a women solo traveler).", "Date": "January 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "La Crescenta, CA", "Title": "“excellent stay-friendly, helpful staff!”", "Author": "tcardona", "ReviewID": "UR47594927", "Content": "We stayed two nights at the Hotel Centrale. The location was great, you could walk ANYWHERE from there. The Spanish Steps were 1 1/2 streets away. The staff couldn't have been anymore helpful and friendly! Breakfast was great, exellent coffee. The rooms are not glamorous, but clean, tastefully decorated. I would recommend it to anyone.", "Date": "October 23, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Oxford", "Title": "“Perfectly postioned, very friendly small hotel”", "Author": "DoctorOxford", "ReviewID": "UR47297707", "Content": "This hotel has its drawbacks - some very small rooms and not cheap! But it has a welcoming atmosphere and all the staff are friendly and willing to help. Perefectly placed just down from the Piazza del Popolo, it is ideal for a shortish city break. Breakfast is OK, but if you want better coffee the bar next door sells excellent espresso for just 50 eurocents. The narrow side-street on which the hotel is located can get rather grubby - but this is Rome ...", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "milwaukee", "Title": "“shabby little Gem in Rome”", "Author": "houstonwi", "ReviewID": "UR46580873", "Content": "I liked this hotel because it is really small, sort of shabby, and great location close to Vatican, actually close to everything if you like to walk. I typically stay at 4 star places, this is what I am going to think is a 3 star definition! Cant go wrong", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Small but central!”", "Author": "ItalyLover2008", "ReviewID": "UR44319993", "Content": "Hotel Centrale was a great place to stay in Rome- such a convenient location, right near Piazza Del Popolo, a short walk to the Spanish Steps and all the ritzy shops, close to lots of restaurants, a metro station and taxi stand! You can't ask for more than that! Well, maybe slightly larger rooms- I banged my leg a few times trying to squeeze past the end of the bed and the wall to get to the bathroom, and then again on the bidet as i tried to get to the toilet! But don't let that put you off, because all of the benefits far outweigh a little squeeze on your way to the bathroom! The staff speaks English and are lovely- they let us leave our bags behind the desk when we arrived too early to get into our room (6am) and had to run off to a tour at 8.30am. The breakfast has good variety and the breakfast room is lovely. Definitely recommended for those hard core travellers who sight-see all day and only come back to their room to sleep.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great location and friendly staff.”", "Author": "GandMGlasgow", "ReviewID": "UR43106317", "Content": "We stayed at the hotel for 6 nights and it was very clean, very central with very competent and approachable staff. Very good value for money.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Fabriano", "Title": "“Central, though no bullseye”", "Author": "SJWilson", "ReviewID": "UR43025140", "Content": "Probably all that needs to be said about the Centrale has been said in the other reviews - friendly, helpful staff, very central, tiny rooms, adequate breakfast etc - and I'd only add a couple of other slightly negative features - that the bathroom door lock kept falling out, that the air conditioner was a bit grumbly (so we switched it off and opened the window, since this was September, but being central the all-night street noise was almost as bad). So I mean, if I was a large-boned American family looking for a place to sprawl out for a week, probably not the best choice, but for a quick two nighter it was ok. One thing though, take the night clerk's cheerful suggestion to dine at the nearby restaurant \"Al Vantaggio\" with a pinch of salt...after the depressing affair was over, my wife said sighingly,\" That was the worst meal I've ever had in Rome.\" Then, more thoughtfully, \"No, in ITALY.\" And she was born there!", "Date": "September 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Terrible by ALL Standards.”", "Author": "Sarsar2000", "ReviewID": "UR38551585", "Content": "My husband and I travel to Europe often and our experience at Hotel Centrale was terrible by ALL Standards. Breakfast is very disappointing and usually laid out at 8AM, even though breakfast begins at 7AM. It consists of stale bread, stale danishes, machine made instant coffee (in Italy!), sugar-water disguised as juice, yogurt, and stale salami. Pop music is blasting and the staff shout at each other throughout the morning while you're trying to eat. The staff are not helpful and in one instance were completely RUDE and gave us wrong directions. The standard rooms are very small, even by European standards. The bathroom was so small that the best way to use the toilet is side-ways. The television worked sporadically and we ended up plugging+unplugging in order to make it work. The rooms were not cleaned properly and we found ants on our last night. Finally, location is NOT ideal. It is a very long hot walk to Piazza Venezia, Piazza Navonna, Trevi, etc. The metro does not reach those areas and the buses aren't on schedule (this is italy!). It is better to stay nearer to Piazza Navonna / Pantheon, especially considering the low quality of service for the money at this hotel. Seriously, there are better deals.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Northwest CT", "Title": "“A Gem in the Center of Rome”", "Author": "Traveler4833", "ReviewID": "UR35311814", "Content": "This 21-room, boutique hotel is ideally situated just five minutes from the Spanish Steps and less than a minute from the Plaza de Poppolo. My wife and I always familarize ourselves with the staff and this multilingual team was very friendly and outgoing; knowledgeable and ready to lend a helping hand, as well as to have a chat if they are not busy. The breakfast room is well-stocked each day with fresh rolls and pastry, cold cuts, yogurt, coffee and cappuccino, fresh fruit and cereal. Refurbished in the last few years, the hotel has marble floors, an elevator, free high-speed Internet access and a 24-hour front desk. We had one of the smaller rooms, which we found totally acceptable, but if you are bit claustrophobic, choose one of the larger rooms. We can't speak highly enough of our experience at this property and of the staff, too. If you are friendly, this will be like a second home while you are in Rome.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "New York City", "Title": "“I should have read other reviews...”", "Author": "MikeSNYC", "ReviewID": "UR32613301", "Content": "I think my title says it all. Ladies and Gentlemen when reading reviews please notice the city/country of the other reviewers. It really helps to know the culture and preferences of the European travelers versus American travelers. I can tell you that size and amenities of the hotels do mean much more to Americans than to the Europeans. With this preambule let me begin. Our trip to Italy started on May 18, 2009 when we landed in Leonardo Da Vinci International Airport in Rome. Since I have been in charge of booking hotels for us and have used \"en venere.com\" for all reservations I have managed to book the limo from the airport to the hotel. I'm far from novice in international travel and the cost of the limo was the same as the cost of the regular taxi. Since I hadn't been in Italy in 20 years and I was seeng Rome from completely different perspective. Yes, Rome itself is Eternal and it will take take more than mere 20 years to change anything (except the prices). To make long story short we arrived at Hotel Centrale. Don't try to find it on Google Street View since via Laurina is so narrow that Google van probably couldn't make it through the street. The hotel from outside looked just like another store front. We were greated very warmly by the front desk clerk who told us that our room was ready and we could go upstairs. Here came the culture shock!!! I have forgotten how small the staircases were in Italy an since this building was converted from a regular appartment building it had the same convenient staircase that was considered to be adeqate in Roman times but a little to narrow and steep for a modern man. Alas, thank all the Roman Gods they managed to build an elevator inside the staicase shaft. The elevator, when I managed to fit myself and one of our medium size suitcases and manually close both the outside door and the interior (WOODEN) doors, took me to th 3rd floor where our room was located. From the hallway the door to the rom looked wide and substantial, and that was the only normal size feature in the otherwise most tiny and crammed up room I have ever set my foot in. If you can imagine the room that requires you to wait for your partner to sit on the bed so you can safely pass to the other side of the room without knocking down the chair you will get an idea. Now for the best of the best!!!! The bathroom!!! When I have opened the white bi-fold door to try and stow suitcase in the closet I discovered that I am looking at the bathroom sink and seeing my own reflection in the vanity mirror. You can imagine my reflection and especially amazement when I have strarted to take it all in. Imagine wall closet running alongside the whole length of the room. Now try to fit the toilet bowl, the bidet, the bathroom sink and the shower stall into a space 10 feet long by 3 feet wide and you will understand my reflection. Yes indeed the for the whole lenth of stay the size of the bathroom was the source of our private jokes. In order for one of us to get to the sink the door had to be open otherwise you were unable to fit in the space in front of it. All in all, I think it's the cultural shock that did it for us. We and I mean us - Americans are spoled by the amenities and comforts of our hotel chains and fortunately for us we can stay in hotels designed for our tastes and needs.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location - decent hotel”", "Author": "DrJohnDublin", "ReviewID": "UR31949617", "Content": "Perfectly located near the Piazza del Popolo, this hotel is located in the quiet Via Laurina that links Via del Corso to Via Babuino. It can also be easily accessed from the Metro station Flaminio. Just walk across the beautiful piazza and either walk down Via del Corso and turn left, or walk down Babuino and turn right. Next door is a cheap but very nice café bar. In the piazza itself can be founfdSanta Maria del Popolo church containing Caravaggio among other paintings. There are several other Caravaggio works in other churches located down along the Via Ripetta. Back to the hotel; nice staff, quiet overall, breakfast adequate but coffee from an automatic machine. You can order better coffee from the bar if you want. Price was reasonable enough for Rome. Air-conditioned rooms with en suite, including hair drier.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "AnthonyUSA", "Title": "“Excellent quality/price Hotel”", "Author": "AnthonyUSA", "ReviewID": "UR31830962", "Content": "Hotel Centrale was a real find for us. It suited our needs regarding location (minutes away from Piazza del Popolo) and other points of interest. The room was large, airy and well appointed, especially with the adjoining terrace. The staff was exceptional, especially Massimo.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Walk or Easy Metro from Quiet Hotel”", "Author": "ChiWind", "ReviewID": "UR30639995", "Content": "Centrale is easy walk from Spagna Metro Stop (Spanish Steps) if arriving at Termini, Rome's large train station but sidewalks are narrow on the busy shopping street of Via del Babuino. Location of hotel on Via Laurina is very close to Piazza del Popolo, so if you end up walking north on Via del Corso toward Popolo you will get there. My room was small and very dark - lighting is not great if you have to keep the window closed. Water pressure good, AC worked, linens clean and bathroom amenities fine. Breakfast room very nice; yogurt, juice and coffee, cereal and plenty of fattening pastries as well as lots of fresh fruit to select from. Free internet computer available for use off the breakfast room was greatly appreciated. At Reception Carla and Max are both very helpful and friendly. There is a pizza bar across the street for an inexpensive slice and beverage if you are too tired to walk further afield. When booking my 3-Night stay in May I had asked for top floor to have views and daylight, but did not get that. It was easy for me to hop up and down the stairs just one flight to my room, but I was given one of the smallest rooms in hotel. The bed dominated the space and there was nowhere to sit, so I sat down in the lobby during rainy weather when I wanted to read materials. There is a nice filtered water machine in the breakfast room where you can fill up your water bottle, so that was a big plus for me after long, hot walks in the city. You can walk to Vatican Museums in about 20 minutes from hotel. I walked to Colosseum but you might want to take Metro to save your energy for the extensive walking around Palatine Hill. Hotel also convenient location to Borghese Galleries/Garden.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago", "Title": "“Perfect Location -- Safe, Clean and Friendly”", "Author": "KittyCH", "ReviewID": "UR27086297", "Content": "I spent 6 nights at Hotel Centrale in March 2009 and would stay there again if I return to Rome. The location is unbeatable, on a quiet street off the via del Corso. Three blocks from the Spanish Steps, a few blocks south of the Piazza de Popolo, minutes from the Villa Borghese, two A-line subway stops (Flamineo and Spagna) within a few blocks. I walked to Navona or Fiori every morning for the market, but the breakfast at the hotel is lovely if you need it. The cinema is a block away, and the Lion Bookshop if you run out of reading material, as well as wonderful cafes for every budget nearby. The staff is very helpful (always more helpful if you start with a little Italian) -- and took excellent care of me. I was on my own and felt completely safe. You can explore the whole city with this terrific boutique hotel as a home base.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Location Location Location”", "Author": "tommco", "ReviewID": "UR25338663", "Content": "The name says it all -- central to everything; in a very good part of Rome. Tucked away on a little side street (so no street noise), but only half a block from the main walking strip, Del Corso, Hotel Centrale is a quaint little hotel. Though the rooms are nothing to write home about, and on the smallish side, they were also clean and comfortable with good bathrooms. About my only suggestion would be that they get heavier drapes -- there is a fair amount of light that comes in from the street at night, and the thin curtains don't cut it. On a side note, Massimo, the night manager, was particularly friendly and helpful. He really made us feel welcome.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Great location, very clean hotel, friendly staff”", "Author": "boggg", "ReviewID": "UR24509058", "Content": "We stayed at hotel Centrale for four nights and found the hotel perfect for our trip. We intended to visit as much of the wonderful city of Rome as possible, and hotel Centrale suited our purpose very well. Its location is perfect, just 2 minutes from Piazza del Popolo and 5-6 minutes from the Spanish Steps, so the hotel was a great starting point for our walks toward the main attractions of the city. The rooms are indeed very tiny, especially the bathrooms, so if you intend to spend much time in your room this might be a problem. On the bright side of things, the room is very clean, towels are changed on a daily basis, there is an LCD TV, a minibar and other useful amenities. Breakfast was OK, it excelled in sweets, and the staff was extremely friendly. We hope to return soon to the beautiful city of Rome and the hotel Centrale", "Date": "February 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Great service, perfect location”", "Author": "benny76", "ReviewID": "UR22146875", "Content": "We stayed 4 nights in Hotel Centrale. Our double room was great. Good size, clean and with a french balcony. Those in our party having booked single rooms got very small rooms, but were happy still, as the rooms were functional og big enough. The two rooms on the top floor share a roof top terrass which, if you stretch up, has a view that gives associations to the movie \"Moulin Rouge\". Breakfast was ok, but not great. The front desk service was awesome. I spoke with three different receptionists, Massimo, GianPiero and and third whose name I don't know. They were all very helpful and friendly. I will stay here if I go back to Rome.", "Date": "November 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belleville, Michigan", "Title": "“LOVE the Hotel Centrale-the LOCATION is great!”", "Author": "mat'sgirl", "ReviewID": "UR20915143", "Content": "My husband and I recently stayed at the Centrale Hotel for one night while awaiting a flight home from Fiumicino Airport to the States, following extensive travel in Europe. This was our third trip to Rome and by far, the BEST hotel in Rome that we have ever stayed at, given the price. What can I say but \"location, location, location.\" This great little hotel, which provides the best in personalized service, is situated in one of the best areas in Rome. The hotel, which is on the Via Laurina, is sandwiched between the Piazza del Popolo and the Spanish Steps. The Centrale is also within walking distance & close proximity to many of Rome's finest attractions including the Piazza del Popolo, the Borghese Gardens, the Villa Borghese, the Trevi Fountain, the Via Veneto, the Via del Corso and many other Rome attractions. Additionally, as mentioned above, the Centrale is less than a 5 minute walk to the Metro stop located at the Spanish Steps. The hotel is small and personal, appearing as little more than a double-door glass entrance off a very narrow side street between the Via del Corso and the Via del Baubuino in the north end of the historic city center. Our check in went smooth and easy, as we were allowed to enter our room several hours early upon returning to Rome after a long journey. Our room was a HUGE surprise, as it appeared to be a small Roman studio! Our room was quite large by any standard with space for a queen size bed, a small table with 2 chairs, a setee that converted into a twin bed, several side tables, a few decorative tables, an armoire and even a fireplace! Our room was on the 5th floor, which could only be reached after taking the little lift to the 3rd floor and walking up two flights of stairs. Our unit had its own private patio, which had a great view of Rome facing east. My husband and I couldn't believe how warm and cozy our room was upon entering. The bathroom in our room was HUGE by Roman standards and included several toiletries and added ammenities. The bath tub included whirlpool jets and was appointed with a hand held shower attachment that worked very well. One touch I really liked was that the bathroom had a HUGE window that opened to the outside, allowing lots of fresh air to move in...it was great! The staff was beyond the best! From Franco (the day clerk) to Jean Francois, the evening clerk...to the housekeepers and porters...everyone was friendly, accomodating, helfpul and friendly. One couldn't ask for more, in my opinion! Despite our brief stay, the staff gladly made transportation arrangements for us (for the airport in the morning), gave us several suggestions for dinner reservations, offered to make us early morning coffee and chatted for long periods with my husband and I, tolerating my horrible use of the Italian language! While my husband and I needed to leave the next day way before breakfast was served, the staff offered to make us a fresh pot of coffee before we left for the airport...I couldn't believe how sweet & kind that was! Finally, I just loved the location of the Centrale Hotel. While the area is a bit pricey, my husband and I ate dinner at a great little Trattoria on the Via del Corso with our meal costing around $40 Euro. After dinner, we strolled to all the main sites in Rome and settled down at the Spanish Steps with gelato, just as all the local Romans do after their busy days. Without a doubt, my husband and I will definitely stay at the Centrale Hotel when we return to Rome in the future.", "Date": "October 15, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Not Bad”", "Author": "RichNY62", "ReviewID": "UR20228910", "Content": "I'll break this review down into two parts. First, the \"Good\": Cleanliness - The room was very clean, particularly and most importantly, the bathroom. Staff - As noted in other reviews, the staff was very friendly and personable. Upon our arrival a few hours early, Eric was very professional in trying to accommodate a twin room request and have it ready within a half hour instead of several hours. One of the overnight desk clerks wasn't overly friendly but that was made up for by all other hotel staff including the breakfast matron who was always greeting guests with a smile. Hotel decor - The Centrale's common areas are well appointed from the small yet classy lobby to the tasteful colors of the breakfast room to the nicely painted halls and stairwells. Again, all was spotlessly clean. Location - The Centrale is in a great location for sight access, either by foot or subway. The Spanish Steps are a brisk 5 minute walk. If you are into walking, you can walk all over the city center from here. A few blocks north of the hotel is Piazza di Popolo, a beautiful square with one of the city's largest obelisks and nice fountain. There are a number of ristorantes and trattorias in the area , maybe not as abundant as in other parts of the city, but still adequate choices. There are two subway station options, each about a 5 minute walk from the hotel. The \"So-So\": Room size - The room was small. True, from experience, I realize that rooms in Europe are usually small, but our room was one of the smallest two-person rooms in the hotel (based upon a review of the emergency floorplan) and it had the smallest bathroom. There was about two feet of space on the side and the front of the bed. The wall facing the bed housed the neighboring room's bathroom, so every time the toilet flushed the sound was quite loud. The hotel is a year old, but the room couId have used a quick coat of paint to cover scuffs obviously caused by people navigating within the small space. If you book here, be sure to request one of the larger rooms and you should be OK. Room lighting system - The room uses a control panel for the lights that requires insertion of the room key. OK, I'm fine with that, but the illumination settings had a mind of their own. Breakfast - I don't expect eggs and bacon at European hotels (I don't eat them anyway) but I didn't expect chocolate cake (!)served either. An overabundance of sweet pastries made breakfast an odd experience. They did have some cereals and yogurt however, which I usually eat for breakfast, but nice crusty rolls which only came out one day, would be nice every day. Maybe add some hard boiled eggs and croissants and the breakfast issue is fixed. Automated wake up call system - This did not work. A request to the desk clerk seemed to be a good alternative, but the next morning he did not call either. Oh well, bring an alarm clock. I would still recommend the Hotel Centrale as it is a nice little hotel with relatively reasonable rates, especially for the location. I did a lot of research online and was basically satisfied with my hotel choice. One note: if you plan on taking a taxi from/ to the airport, call ahead and use the car service the hotel provides. The taxi we took rom the airport was more expensive, and half of these guys are crooks. The car service was a better choice for the return and in a nice Mercedes. Enjoy Rome!", "Date": "September 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Staffordshire", "Title": "“Great location, great little hotel!!!”", "Author": "Sarah16981", "ReviewID": "UR19110353", "Content": "Great location, major attractions within walking distance - but if you dont want to walk you have 2 metro stations within 5-8 min walking distance. We found the staff very helpful and were willing to help us out with local information. The rooms are small but are spotlessly clean, with fresh towels and cleaning service very day. In the rooms is a fridge, TV and ensuite. The decoration is really nice with a 1920's theme to the main areas of the hotel. The breakfast is basic (i.e. cereal and pastries), but when the location and price is so resonable you would not expect a banquet! Would definatley recommend people who want a good central base at an affordable price to go to this hotel.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hillsborough, North Carolina", "Title": "“Phenomenal Hotel near Spanish Steps and Great Restaurants!”", "Author": "turnersc", "ReviewID": "UR18312032", "Content": "The service was phenomenal and the staff a delight. They are incredibly professional and take good care of their guests. Book one of the rooms with a shared or private roof top terrace and you will not be disappointed. It was a joy to have our own little outdoor sanctuary from the hustle and bustel of Rome. The decor is very clean, tasteful and lovely. The balcony had pretty plants and flowers. The breakfast is typical Italian hotel breakfast with a good selection of fruit and sweet treats. There is a good Alimentari (Grocery/Deli) next door where they will make you a sandwich to take for a picnic lunch.", "Date": "July 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Surprising Great Hotel”", "Author": "deepc55", "ReviewID": "UR17067188", "Content": "Surprising great new hotel. Amazing friendly people and the rooms are great. The location even better just a 7 minute walk to the spanih steps. Would go back anytime.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Wonderful new hotel!”", "Author": "schk", "ReviewID": "UR15754109", "Content": "Hotel Centrale is a wonderful new hotel that opened in November 2008. We were initially hesitant to stay here because of the limited feedback, but were delighted by the hotel. We found our room to be new, clean, and well maintained though slightly small, which is to be expected in Europe. The staff was also very friendly and attentive. Upon checking out we learned that rooms on the top floors (for the same price) have their own private terraces and views of the Spanish Steps. Something to keep in mind for next time! Overall a wonderful experience!", "Date": "May 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent”", "Author": "lin", "ReviewID": "UR15372864", "Content": "Clean and well maintained in an excellent location, from here we walked to the Vatican, Spanish Steps, Trevi Fountain, Piazza Venezia, Colosseun and the Pantheon. Two minutes from the Piazza del Popolo - climb the stairs for wonderful views over Rome. Plenty of resteraunts nearby - we only had one and a half days and walked everywhere. Room was clean, quiet, good shower, no bath-but we prefer to shower anyway. Our room was on the top floor off of a little terrace. Staff very pleasant, helpful and spoke good English - breakfast = cereal, fruit, juice, pastries, cakes, rolls etc....and hot drinks - from a machine but still good. Will stay here again", "Date": "April 26, 2008"}], "HotelInfo": {"Name": "Hotel Centrale", "HotelURL": "/ShowUserReviews-g187791-d798666-Reviews-Hotel_Centrale-Rome_Lazio.html", "Price": "$100 - $261*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Laurina 34</span> | <span class=\"extended-address\">Centro Storico</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "798666", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/f4/43/98/junior-suite.jpg"}}