{"Reviews": [{"Content": "super alternative to a hotel My husband  I stayed in the Spa Suite December 13 - 15, 2008. It exceeded every expectation. Our room was on the second floor and was actually three seperate areas. The bedroom had a wonderful king sized bed that was very comfortable. The galley-type kitchen was fully functional - microwave, oven, dishwasher  refrigerator. The fridge was stocked with wine, cheese, quiche, milk, oj  water. Bagels, danishes, oatmeal, coffee were also right there at your fingertips. The bathroom was simply unbelieveable! Jacuzzi tub, sauna, seperate shower and a fire place. If you're looking for a romantic getaway - this is your place. The moment you walk into the house, you feel as though you're in your own private home. The Inn is in walking distance to the subway  neighborhood restaurants. It was just such a delightful alternative to the standard hotel. We really felt special and are looking foward to returning. The inn-keepers have thought of every detail.", "Date": "Dec 29, 2008", "ReviewID": "UR529499161", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "gottatip"}, {"Content": "It's Still Heaven On Earth This was our third time staying at the Inn. We stayed in the Library Suite for 8 days. I cried when I left. But one day into our stay we booked for next year. There aren't enough acalades to describe how we feel about the Inn, the way it's run, the ambiance and the owners - Ruth and Ellen -- it's absolutely incredible. Everything at the Inn is first rate - truly - from the decorating to the cleanilness of the suites and attention to detail even down to the way the towels are folded are top shelf. We have suggested in the past to go to their website to see what we're so excited about every time we stay there. We literally got home about three hours ago, unpacked and wanted to make sure to we didn't forget to do our trip advisor note because everyone deserves to feel like a superstar celebrity at least once in their lives. Believe us, if you stay at the Inn, you will. Enjoy.Joseph and Diane from Florida", "Date": "Dec 18, 2008", "ReviewID": "UR394161926", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "FLA-JOE-DI"}, {"Content": "Fantastic time at the Inn New York City I celebrated a special birthday this year and as a treat to myself decided on a trip to New York. Found the Inn New York City quite by chance when browsing through Trip Advisor, thought it looked excellent and booked in for 3 nights to the Vermont Suite.It did not disappoint! A beautiful apartment a haven from the hustle and bustle of days of sightseeing and shopping! Once the door was closed it was probably the closest to New York living experience ever! The apartment was very comfortable, spotlessly clean and all the personal touches provided - home baking waiting for us when we returned every evening, bedding and towels changed every day - I cannot praise the Inn enough! Position was within walking distance to all major attractions, weather was fantastic whilst we were there and you did not mind the walking, although it was chilly. Central Park, John Lennon apartment, Ghostbusters building they were all within 10 mintue walk.Would thoroughly recommend for a totally different way to vist New York.", "Date": "Dec 6, 2008", "ReviewID": "UR825525958", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "maxcleo"}, {"Content": "A very nice find This is an unusal hotel in that it is extremely small and well appointed. The price point, although high, is justified if you want a pleasant yet not as tourist experience in a much less traveled part of New York. My daughter (15) and I shared the Library Suite and it was ideal for us. However, there is no food service on property so you have to be comfortable with being in a neighborhood, taking the very accessible subway, and being a distance away from the action of Times Square. It felt like I was staying at an Aunt's apartment in New York for the weekend.I would recommend the Inn of New York and plan to return.", "Date": "Dec 1, 2008", "ReviewID": "UR145898562", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "3"}, "Author": "cyberi"}, {"Content": "Romantic Hideaway in the Big City Even after reading all the positive reviews, Inn New York City exceeded our expectations. What a unique and comforting spot within short walking distance to The Met, Central Park and access to the Subway.We stayed in the Spa Suite and completely enjoyed the big tub and sauna and fabulous rain shower. The Suite was uniquely decorated with all the comforts anyone might require.. Miss Ruth was a charming host and even taught me ( a Southerner) to put on my winter scarf New York style!The yummy treats in the kitchenette were quite delicious and we especially enjoyed the quiche with cheddar cheese and the wonderful fresh fruit. I am someone who needs peace and quiet to enjoy a vacation. Too many people stress me out. This wonderful Boutique Hotel allowed me to enjoy the energy and excitement of the big city knowing that a quiet space was just steps away. We also found that we could spend just a little $$$ at one of the amazing gourmet food stores just up Broadway (Fairway  Zabar's) to have a delicious and quiet meal.. Inn New York City kitchenette had all that we needed to utilize the markets.Hope that we may return soon.", "Date": "Nov 25, 2008", "ReviewID": "UR503109644", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Yvonne12345"}, {"Content": "A \"home away from home\" on a wonderful honeymoon in NYC We stayed in the Vermont suite for 5 nights during the coldest week in NYC history (for a November anyhow!) It was so nice to know that our home was waiting for us all warm and inviting after a hypothermic day sightseeing!The Vermont suite is the cheapest option of the bunch probably because it's on the ground floor (with its own entrance) and the bedroom is below in the cellar (with little natural light of its own). This just added to the ambience and character of the suite making it more homely during the fall/winter months. I may prefer to be in one of the other suites during the summer though.Ruth is very welcoming and the housemaids are fabulous. There are a veriety of foods provided from fresh produce to bagels, croissants and cakes that were replenished each day.The kitched was small but perfectly functional for our needs. I dare say you could cook a full thanksgiving roast in there if you wanted to but most of the time we just eat out locally up around 86th street area or during the day while siteseeing.I wouldn't recomend this specific suite to anyone who may have trouble with a metal spiral staircase as although it was gorgeous to look at and fine for us 30 something honeymooners, I can imagine it might be a bit of a handful for some less able guests.I would definatley recomend this hotel for a honeymoon or special occasion, or those of you with dollars to spend who only want the best that NYC has to offer. I really think that this probably is the best most luxurious place you can find in NYC, and even more so if you don't want all the hussle  bussle of a normal hotel.Finally, I personally think the location was very good. Its just a few minutes walk to the subway and then only another block or two to central park. We used the subway and busses most but did walk down to Time Square from the hotel once, and it was a nice walk via Columbus Circle down Broadway and although I cant remember exactly I guess it probably didn't take much longer than 30 minutes.", "Date": "Nov 25, 2008", "ReviewID": "UR853343769", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "-1", "Location": "4"}, "Author": "Dean32"}, {"Content": "Perfect Inn New York We stayed in the Spa Suite and found not only the room to be excellent but the service as well. The room is better equipped than our house with a tv, cable, an iron and ironing board, a kitchen stocked with complementary snacks, air conditioning, and of course a spa bath and sauna.The hotel is one block away from the 72nd Street Subway station and close to Central park we had no problem getting around and loved the location.We were treated extremely well at this hotel with exactly the right mix of privacy and informal professional service. We will most definitely be returning on our next visit to the Big Apple.", "Date": "Nov 6, 2008", "ReviewID": "UR593449308", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "BandA30"}, {"Content": "Brilliant! We had four days at the Inn with my wife and two teenage children aged 14 and 16. If you you want times sqaure hustle and buslte, sterile square rooms and magnolia walls, forget it. This place is real New York. The apartments we stayed in (the Library Suite) was amazing with wonderful decor and something new to spot every time we looked around. The beds were comfortable and the apartment was spotlessly clean. This place has real charm. The owners of the apartment did everything they could to make our stay a pleasure including providing fresh bagels and juices and the like everyday for breakfats or snacks. Even going so far as to tailor the food they provided based on our likes and dislikes. Everyday something home baked would arrive and it was always good for the tastebuds if not the figure!Our only regret was not being able to spend more time in the apartment and appreciate it better. This was our first time in New York so we were out everyday exploring. The location is in a great spot on Upper West Side and a two minute walk to the subway station with an express train straight to Times Square. There are plenty of shops and eating places nearby and we always felt safe walking around upper west side even at 11 at night.Thanks for a great stay Ruth  Elyn .", "Date": "Oct 17, 2008", "ReviewID": "UR963048563", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "sherburn_gang"}, {"Content": "Perfect My wife and i stayed 5 nights in the Vermont suite which was wonderful. The Inn New York City is situated on West 71st Street which is a very quiet residential area, but only 1 block away from the subway on 72nd street, so very easy to get to the main areas of NYC.The suite we stayed in was wonderful for relaxing after a hard day of sightseeing. it is a duplex apartment with a kitchen and lounge area, the downstairs is a lovely bedroom and bathroom. It is like having your own home in NY. Each day, the housekeeper would leave us cakes/cookies/pies and other goodies. The fridge was always stocked with milk, orange juice etc. We also had fresh fruit and Granola.The area around the Inn is very safe, with lots of good restaurants within easy walking distance (try Cafe Luxembourg on 70th and Amsterdam Ave). Central Park is only 2 blocks away, the Lincoln Centre is also close by (great place to see opera/show), plus there is an IMAX cinema on 69th/Columbus if you fancy a movie one night. If you prefer to have breakfast at a traditional diner, try out the one on the corner of 72nd/West End Ave, the blueberry pancakes and maple syrup are wonderful.I would recommend the Inn New York City to anyone visiting NY, it is the perfect place to come back to and unwind, rather than being in a small hotel room (which is generally what you get in NY)", "Date": "Oct 15, 2008", "ReviewID": "UR429067024", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Mark17"}, {"Content": "okay hotel hotel was decent, would recommend it to others", "Date": "Oct 14, 2008", "ReviewID": "UR444910739", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "hank234"}, {"Content": "Wonderfully Different Inn New York City is a unique experience and one that should not be missed. The accommodations in a converted townhouse are luxurious, the woodwork is beautiful and functional, and the amenities and staff exceptionally thoughtful. It would be the perfect place for a honeymoon or other romantic trip. This is not a good place for small children, and one must be able to climb stairs, as there are no elevators. If you need a break from standard hotel layout and furnishings, you will love the Inn. The location is on the upper east side, so it is not near the theater district, but it is a short walk to Lincoln center, central park, etc. We had no problem getting taxis in the neighborhood. There is no identifying sign outside, only the address on a small marquee over the front stoop. If you catch a taxi to get there, be sure to tell the driver that the block is between Broadway and West End.", "Date": "Sep 16, 2008", "ReviewID": "UR283238239", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "heronblu"}, {"Content": "A Sanctuary!       Main Entrance Hallway", "Date": "Sep 4, 2008", "ReviewID": "UR616762342", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Casserole"}, {"Content": "As expected We spent four nights at Inn NYC, and shared the excellent experience of other guests. It's not like a hotel at all, and the better for it (for me, hotels feel like work). The area (upper west side) is lovely. Right by the park, and plenty of restaurants. Quite a hike for the stuff we had to do in Greenwich/Noho, though. Service and attitude delightful. Only one negative, and an unavoidable one: The Vermont suite, the only one available when we booked late, is in the basement/cellar over two levels. This means very little natural light. We'd book one of the higher ones if we were to return.", "Date": "Sep 1, 2008", "ReviewID": "UR270454932", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ParisMarsella"}, {"Content": "Highest level of customer service from Ruth and Elyn On cancellation of the room we had booked months ago,due to unforeseen circumstances, Ruth and Elyn, where truly very impressive, without any questions only with lovely emails, our deposit was refunded within two days. These Lady,s are true professionals who really look after theircustomers even the one,s like us who cancel. I cannot say enough about their high standard of customer service, other than you would be mad to stay elsewhere.", "Date": "Aug 21, 2008", "ReviewID": "UR107719459", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "katerina7"}, {"Content": "Quite Unique Everything others have written is correct, but from our perspective, here is another angle. If you are wanting a 5 star big bustling hotel with concierge, valet, health spa, pools, entertainment, nightclubs, shops on premises, people watching, restaurants and noise, this is not for you at all.If on the other hand, you want to experience 4 rooms only, no noise and with great shops, restaurants and everything NY has to offer, virtually within walking distance and also where the locals go, this could be right up your street. Excellent housekeeping, unobtrusive, helpful when asked and always on call if needed.Extraordinary place for people who want and expect something different. Stayed in the Opera suite with my wife from the 3rd to the 7th August which although slightly on the dark side, has a private terrace which made it for us and is virtually unheard of in any NY Hotels. It's not for everyone, it's for people who demand class from another era without all the hoi-poloi that usually is associated from a top snotty hotel. We will definately return when next in the area. Thx Elyn and Ruth. PF.", "Date": "Aug 8, 2008", "ReviewID": "UR805721261", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "selecthotels"}, {"Content": "I just loved it This hotel is a little piece of peace in New York !!It's Very quiteIt's very convenient because the subway is 5 mns from the hotelThere is a great Citarella Supermarket (5-10 mns)The people are so niceI will come back for sure", "Date": "Jul 28, 2008", "ReviewID": "UR898884660", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "wbohm"}, {"Content": "Perfect Stay at the Inn New York City!       Fireplace and mirror", "Date": "Jul 15, 2008", "ReviewID": "UR407597001", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "gatchamark"}, {"Content": "Wonderful stay @ the Inn We stayed for 5 nights in the Opera Suite. Our stay couldn't be better! Here are some words to describe a stay at this oasis in the City.Luxury stay Perfect service and attention to detailQuiet (but central) neighborhood - subway is just 3 minutes away!...Your personal home in New York CityWe will definitely go back!", "Date": "Jul 5, 2008", "ReviewID": "UR989771489", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "sunny8494"}, {"Content": "The Place to Stay! We have just returned from a five-day stay at the Inn New York City. I hesitate to write this review, because once the news is out that this is indeed THE place to stay while in New York City, we suspect it will always be booked and we'll have a hard time getting reservations ourselves!That having been said, however, this is truly a fantastic boutique hotel on the Upper West Side of Manhattan; a short walk to the Metro and just another block or two to Central Park. The owners are two wonderful ladies who go to every length to ensure that your stay is comfortable and memorable, right down to the freshly squeezed orange juice, delicious munchies from Zabar's, and fresh flowers and chocolates. Make sure you ask their advice on the best places to eat and people/celebrity-watch!Our first trip to New York City found us in the Library Room, ample room for the two of us and our two teenaged sons.We stayed in the Spa Suite this second time around which was perfect for just the two of us.We look forward to enjoying the remaining two suites available (the Vermont and the Opera Suites).We encourage anyone contemplating a trip to New York to visit the website of the Inn New York City and choose one of their four rooms to have a truly New York experience! You will not be disappointed.", "Date": "Jul 2, 2008", "ReviewID": "UR313963025", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Nosoup4u"}, {"Content": "Total Luxury We knew before we went that Inn New York City would be fantastic and we weren't disappointed. Ruth and Elyn made it their job to see that we were totally comfortable and had everything we needed. The treats in the kitchen were wonderful and very welcome - there was no having to think about how much milk, bread, orange juice etc there was left, everything was restocked every day! The Vermont Suite was always beautifully clean,including the bed linen. At night it was quiet, which we appreciated. We felt safe walking around the neighbourhood night and day.The nearest subway was only a short walk away, and if we caught the express train we were in Times Square in 5 minutes. We strolled to Central Park (10 minutes), which was a fabulous oasis of green. My husband even hired a bike for a couple of hours! As first time visitors to New York we knew we would love it, but finding Inn New York City was the cherry on top of a large delicious cake and we hope to visit again very soon.", "Date": "Jun 11, 2008", "ReviewID": "UR561936094", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "donnyfan42"}, {"Content": "A Fantastic Anniversary Treat Having trawled many websites looking for the perfect hotel for our silver wedding anniversary celebrations we happened upon Inn New York City. We booked the Vermont suite for 5 nights and had a fantastic stay. It was such a pleasure to be able to head back to a quiet little oasis, put our feet up and relax without the bother of lifts, keycards, etc. Ruth was very helpful and the suite was spotless - all linen changed every day. We enjoyed our leisurely breakfasts and, an added bonus, the 72nd St subway at the end of the road was on an express line to downtown so travel was amazingly easy. Central Park was a short walk away as was the river in the other direction. Altogether great accommodation in a wonderful location.", "Date": "May 15, 2008", "ReviewID": "UR400659766", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "CV58"}, {"Content": "Return visit to the Vermont Suite We returned to Scotland today after 5 nights at Inn New York City. We first stayed for 4 nights in the Vermont Suite in October 06 and adored it so when we decided to visit New York again there was absolutely no question as to where to stay- it had to be Inn at New York City. Ruth and Elyn ensure that the welcome, accommodation and attention to detail are all exceptional. 266 west 71st is an ideal location for the city yet extremely peaceful-perfect for both young and older romantics!", "Date": "May 6, 2008", "ReviewID": "UR462652209", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "IshbelScotland"}, {"Content": "Perfection! We just returned from our 3rd stay at the Inn New York City. As always it was perfection! If you want to experience this city like a true New Yorker, this is the place to stay. From the moment you climb the steps of the townhouse, you feel like you are entering your own apartment. The kitchen is stocked each day with wine  gourmet snacks and the rooms are spotless. The Upper West Side neigborhood is quiet and clean. It is so quiet that you forget there are other guests in the building. This place is a true gem!", "Date": "Apr 27, 2008", "ReviewID": "UR424887720", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Tulips0919"}, {"Content": "A Romantic Find We were looking for the most romantic getaway in Manhattan, and we found it. There is no commercial sign out front --it's that perfect. We felt at once comfortable and luxurious. We slept under down covers with a window cracked open for spring air. the service began before we arrived. We asked, and Ruth let us know by e-mail where to find the best fish  vegetable markets in the neighborhood. We cooked swordfish and pasta in the well-equipped galley kitchen and ate on a nook-like table for two. The glass-wall shwoer is also for two, as is the hot tub -- we were in the Spa Suite. Ruth and Elyn live downstairs and are awlays available, except late at night. Agnes slips in magically to restore order but never disturbs.  Only the most remarkable sourpusses would not think a weekend here is like a honeymoon. Howard  Annie", "Date": "Apr 20, 2008", "ReviewID": "UR125603189", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "hkohn"}, {"Content": "Beloved Inn Ruth made our stay wonderful. Attention to detail, impeccable service. Both the room and the location surpassed our expectations by a long way. You do not find many Inn in Upper West. This is a little gem. My wife and I stayed for three days. We hate big, anonymus, chain hotel. We love to feel home everywheare we are. This place we started to call it home the same day we arrived. And we are still. Just to make sure we are not overrating the place, we will mention two minor drawbacks: first, we did not get the room we wanted and the room we got in (Opera Suite) was a little too dark; second, the stereo in the entrance is playing opera music day and night too loudly. But again, those are peanuts. We will be back soon, Ruth.", "Date": "Apr 14, 2008", "ReviewID": "UR367620647", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Sam1961"}, {"Content": "Loved \"Inn New Yok'' and Ruth  Staying at Inn New york was booked as a surprise present, and what a fantastic surprise present it was! . Having stayed at a great many hotels in New York, Inn New York is incomprable! We stayed in the Opera suite, very glamarous and spacious, with your every need taken care of through the thoughtful touches of Ruth and Ellie, both of whom are around to offer up some if NYC's best kept secrets, such at the excellent sunday flea market at Columbus Ave. between W. 76  77 St. (Upper West Side - highly recommended. We can't wait to go back!", "Date": "Apr 14, 2008", "ReviewID": "UR435919386", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "claremont2006"}, {"Content": "What an Incredible Place! I brought my girlfriend to NYC for the first time. She had no idea that I planned on proposing to her when we first arrived. After a spectacular engagement in Central Park, I shared with my fiancee that we were not staying at the Sheraton, but in fact were going to a cozy BB on the Upper West Side. When we arrived, she didn't even realize that the Inn was tucked away in a quaint residential neighborhood. Our stay was phenomenal. We enjoyed four nights in the Spa Suite, enjoying all it had to offer. The galley kitchen was a nice convenience, although we did not spend much time there because we wanted to take in all the fantastic food in the area. Each night we came home early enough to relax in the Jacuzzi tub with a glass of wine/champagne. This was by far the best part of the Suite.Like the other reviews mention, this is an ideal location. It's one block to the nearest train, which can take to you to every where you need/want to be. The cafe at W 71st and Amsterdam is great for a quick bite to begin or end your day, but the 72nd St Deli just another block away has some great bagels and pastries.I think that this trip will be tough to beat for my fiancee and I. I went over-the-top for this trip and it was well worth it. I would and already have recommended Inn New York City to most of the people I know and will definitely return for years to come.Thank you to Elyn and Ruth, who made our stay so wonderful. Your home and your hospitality are truly amazing.", "Date": "Apr 13, 2008", "ReviewID": "UR322420118", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "EngagedinNYC"}, {"Content": "NYC brownstone! Because my partner and I were relocating to New York City, we thought this place sounded perfect for the two weeks we would need to find an apartment. We were hoping to find something that would feel more like a home than a hotel and Inn New York City was just perfect for us!The Inn is basically a brownstone on the Upper West Side of Manhattan. The owners see to it that you are well taken care of, but do not interfere when they are not needed, so you really feel like you have your own apartment in the city, and they even do your laundry upon request.We ended up staying in the Opera Suite on the main floor as it was the only one available for the entire 2 weeks we would need. We were very pleased with the arrangement of the suite. There were no stairs to climb (other than the steps outside), which was helpful for us at the time. Inside the suite we had a lovely firm - and very comfortable - queen sized bed facing the fireplace. We only used the fireplace one night, but Ruth, one of the two owners, needs to come and light a firelog due to too many mishaps of guests in the past, but it was lovely all the same. You do need to be aware, however, that the owner needs to be notified in the afternoon if you would like a fire in the evening. We also really loved having a kitchen with everything you could ever need to cook and we enjoyed preparing some of our own meals from time to time. They also leave fresh sweets, fruits, and flowers every afternoon along with some basics such as juice, milk, and quiche in the fridge.Our suite also had a baby grand piano in it along with many piano books and opera magazines - great for the classical music lover!The only downside for me is that one night I fell terribly ill with food poisoning and was not able to get a hold of anyone in the inn as it was the middle of the night. There was an emergency contact number for the inn by the phone, but nobody answered. As we were new to the city, we were hoping they could put us in touch with an emergency doctor. I did eventually find a house doctor online who was able to come to the inn the following morning - which was a lifesaver!Overall we were very satisfied with our stay here as it was greatly helpful in our transition of moving to the city. I would highly recommend it for anyone visiting the city looking for something more personable than a hotel.Oh, and the Inn really does look exactly like the photos on their website, so no need to post any of my own.", "Date": "Apr 8, 2008", "ReviewID": "UR592986676", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "midwestern_wanderer"}, {"Content": "Unbelievable - just the best in NYC Superb. In every way this is superb and amazing. This is the best place to stay in NYC. Forget the penthouses in the name hotels 鈥?this is luxury with quiet and personal service. We had the library suite. It is the top floor 鈥?yes floor of a townhouse. The pictures on the site are accurate. The kitchenette (with clothes washer/dryer) is functional and the hosts stock it for you. The stained glass in the ceiling is beautiful. There is also a 3-fold pocket door for separation to make the living room more intimate. Two fireplaces, large and very comfortable oversized queen bed. It cannot get better than this in NYC. No more impersonal hotels for us. This is it forever when visiting NYC.", "Date": "Apr 6, 2008", "ReviewID": "UR245386282", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Ralff"}, {"Content": "A residence for life's travellers Living in the Opera Suite is akin to staying at the New York pied-脿-terre of a graceful, thoughtful but racy Aunt who might have just popped out for an evening at the Met. You would not expect 24-hour room service from your virtual Aunt, and you will not find it at Inn New York City. But the merits of this elegant, genteel establishment far outweigh and compensate for the lack of facilities on offer in more renowned hotels.Ruth, the owner, operates a discrete and mannered refuge on the Upper West Side. There is no hotel sign and the Inn both looks and acts like a polished private residence. Residents and owner are quiet and take other guests into consideration: guests in the Opera Suite are asked not to play the baby grand piano after 10pm as the residents of the Spa suite upstairs similarly refrain from using their whirlpool tub after hours. Ruth asks for a discreet buzz on the button at the bottom of the stairs as you leave, so that the housekeeper can go into your room, and is willing to come at any time up to 9pm to light the fire in your bedroom. The d茅cor is eclectic, part art deco, part French, part Edwardian, part 1950s floral chic: not quite over the top, but lovers of minimalism should look elsewhere. The Inn鈥檚 website has four lovely short films with piano music to illustrate each suite and the anticipation they create does not disappoint. There are heavy drapes and wooden New York shutters. The house feels loved, polished and personal. Aged graceful wooden cabinets have style, even if they creak a little with age, along with some floorboards. There is a small but full kitchen, again slightly aged but utterly charming and with more utensils than you will ever use during your visit, all of which looked as they had been gathered with care at antique markets. Fabrics have been chosen with care and thought, as have the individual pictures, lamps and soft furnishings. Opera magazines, old copies of magazines, sheet music, soft throws and books are scattered throughout the suite. Wardrobes and individually chosen armoires reinforce the feeling that this is a residence rather than a hotel. As the day fades into darkness, the Opera Suite comes alive with gorgeous dimmed lighting, and the fireplace. Make sure you take someone with you who can play the honey-tone baby grand, preferably slow jazz or melancholy chansons. The subway is one block away, taxis are always available as are private cars if you need one. The coffee shops, restaurants and upmarket boutiques on Columbus are a few minutes away, the Lincoln Centre and cinemas five minutes walk, Central Park no more than seven. Ruth fills the Suite each day with pastries, cakes, cheeses, crackers, chocolate, fruit and a myriad of little treats. Basic supplies are provided, more than enough for breakfast each day. If the weather is warm enough, you could breakfast outside on the shrub-filled terrace. An antique writing desk adds elegance to the room and the wifi worked flawlessly. The phone line is direct but there is voice mail and the line will ring through to the office is left to ring. Residents have their own keys and Ruth lays little traps of sweet jars throughout the hallway, to distract you from the flowers and the sherry she has left out.I saw no other residents during my stay but you do hear them. This is an old house, and it has all the gentle creaks and footfalls which that entails. The bathroom in the Opera Suite is on the small side and both it and the kitchen might eventually benefit from updating of fittings. But please, Ruth, keep the worn and loved elegance. I adored all the eclectic pots, plates and dishes in the kitchen cupboards and the bathroom was piled with soft towels, toiletries and robes. This is not the place to stay if you have children with you, even though there is also a sofa bed. If you leave the kids elsewhere and want a romantic, quiet, gentle time to concentrate with a loved one, eat out at leisure, take in something at Lincoln Centre and wander around on foot, this Suite is more than perfect. It is a residence for life鈥檚 travellers rather than tourists.", "Date": "Mar 31, 2008", "ReviewID": "UR367153289", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "AlmostBlue"}, {"Content": "Peaceful, private -- and fun! Unlike any hotel room, for a few days it was our own incredibly comfortable and completely furnished apartment in a nicely restored upper west side brownstone with parking nearby and a manageable walk to the theater district. We stayed in the Spa Suite, with historically ornate detail and modern conveniences -- and thoroughly enjoyed the plush atmosphere, sauna, spa tub, and unique glassed shower while celebrating our 30th wedding anniversary. A satisfyingly stocked kitchen encouraged us to lounge around for a quiet brunch before heading out on the town. Overall a great treat, certainly suitable for a special event.", "Date": "Mar 21, 2008", "ReviewID": "UR485849606", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "mikeyct"}, {"Content": "Great Spot in NYC Just returned from a two-night stay at Inn New York City. My daughter and I stayed in the Opera Suite -- lovely room, spotless, comfortable, and filled with interesting stuff. Enjoyed the kitchen and the treats. Wonderful touches throughout. Our Opera Suite had a very nice terrace to step out on. We liked the location a lot, very convenient, but on a quiet street. We really loved our stay! Thanks Ruth!", "Date": "Mar 18, 2008", "ReviewID": "UR398074591", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "elrae"}, {"Content": "super place to stay Perfect location, lovely suite - so nice to come back to your own warm, welcoming appartment after a day out shopping and sightseeing in nyc. The Inn is a unique and very worth while alternative to the corporate hotels - relaxing and a real NY experience. The upper westside is a great place to stay - great restaurants on the doorstep and central park only a short walk away.Ruth is a lovely hostess - everything is thought of to make your stay perfect. Thank you to her and to all the previous reviewers who recommended the Inn - we had a fabulous time.", "Date": "Feb 21, 2008", "ReviewID": "UR303596592", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "acaLondon"}, {"Content": "Just Perfect My wife and I decided to celebrate our 20th wedding anniversary by staying two nights (26/27th Jan) based on other reviews in Trip Advisor. We were not disappointed. If you are looking for a flash hotel with in house restaurants, bars and a spa, then this isn't for you. If, however, you want the perfect, romantic experience where every detail is taken care of, then this is just what you are looking for.Other reviews paint a great picture of what the Inn is like, but for an idea of the service - what about this. American Airlines lost our bags. We had our special dinner booked with barely anything nearly good enough to wear. We managed to get by with what we were wearing, but what about shoes for my wife. A night at Daniel just isn't the same wearing sneakers!! The solution - Ruth managed to find a pair of hers that did the trick. A catastrophy averted!!!A great home away from home.", "Date": "Jan 30, 2008", "ReviewID": "UR670406334", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "gspence"}, {"Content": "\"Exceeded our expectations!\" My wife and I just spent 2 nights in the Spa Suite over the weekend of Jan 18-20. Our expectations for a special place to stay were somewhat set after reading all the reviews here prior to making our recent booking. Well, our expectations were actually exceeded. We both totally agree with ALL the positive comments made in previous reviews, so it's difficult to think of anything new or unique to add. We have traveled extensively for both business and pleasure over the past 35+ years. We've had the pleasure of staying at many very fine hotel and resort properties, and even some really good BB's both in the States and abroad. But I can say that we found staying at The Inn NYC to be more like staying at a good friend's place. Sharing not just a room, but part of their home. We 've already booked the Library and Opera suites for December '08. My wife and I will be taking our son, daughter, spouses and 2 grandsons for 4 nights after Christmas through New years Day. We're convinced that it's the perfect choice for a special and memorable holiday-time place to stay in NYC. My wife and I have already told friends and family who travel to New York regularly about how impressed we are with Inn New York City. Unfortunatley, I think bookings may now become harder to come by. I know my wife and I plan to stay at Ruth's Inn on ALL our future trips to New York City. But since we're not aware of anyplace like the Inn new York City elsewhere, we'll have to settle for just another hotel when traveling to any other city. Thanks, Ruth for your hospitality. You and your daughter have created a truly special place. We're already planning our Christmas-time trip and are looking forward to another relaxing and wonderful stay at your place.Jim  Sue M. Fort Worth, TX", "Date": "Jan 23, 2008", "ReviewID": "UR386335305", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "mestells"}, {"Content": "Deserves to be Number 1 DATE 21/01/2008REVIEWER NEIL UKMyself and my wife booked the Inn on the strength of its reviews on here. We are so glad we did.The Inn may not be cheap but its worth every penny. The Hosts cannot do enough for you but are never intrusive. Fresh Breakfast Pastries and Croissants are constantly available in your room. Never ending nibbles, chocolates, fruit, juice, water and fresh ground coffee are always there for you. Wine was in the fridge on our arrival as was a magnificant Chocolate Cake on my wife's birthday. There is no way you can eat everything that is available to you!!The Spa Suite was luxury. Great bed, pillows, huge jacuzzi, sauna, everything you could ask for. It was great to get back to the Suite to unwind before heading out again for the evening.We cannot think of anything negative to say about the place. We will definately stay there again.", "Date": "Jan 23, 2008", "ReviewID": "UR518317858", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "stewie25"}, {"Content": "The Real New York'ers life!       Bedroom View 1 of 2", "Date": "Jan 11, 2008", "ReviewID": "UR832666774", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Dodonian"}, {"Content": "Wonderful home away from home My family spent the Christmas holiday week in the Vermont Suite. The reviews were all on target. The accomodations worked well for our family with the separate living room and downstairs bedroom. The bedroom was so quiet...the walls must be so thick because we heard none of the neighbors or street traffic. It was very nice to have the small, but well stocked kitchen available. We ended up eating breakfast at home everyday. My sons and I loved the quiche and pastries provided, which along with orange juice and milk, started our day off well. There were lots of goodies provided...we especially enjoyed the chocolate cake and apple pie that were waiting when we returned after a long day of sightseeing. The location of the Inn is perfect. We bought 7 day passes for the subway/buses. The subway stop is closeby on 72nd, but we opted to take buses in order to see the city (which is very convenient to the Inn as well). There are loads of wonderful places to eat nearby. We enjoyed Citrus (Cuban with an Asian twist)---they had a tasty brunch on Sunday. Also, stop by Buttercup Bake Shop (on 72nd between Broadway and Columbus) if you haven't had enough sweets at the Inn. The cupcakes were delicious and the peanut butter cookies were so good! Within a short walk are shopping, an AMC theatre, Barnes  Noble, Lincoln Center...I could go on. We walked to The Metropolitan Museum of Art (through Central Park) and the Museum of Natural History. The best part about the location is the quiet. Just spend some time in Times Square or walking in crowds on Fifth Avenue and you'll appreciate the fact that you are staying at the Inn. My only suggestion...and only negative comment...was mentioned by another reviewer about the bed in the Vermont Suite. I found it a little too stiff and sometimes awoke with aches if I slept on my side. Perhaps switching to a Select Comfort AIr Mattress or similar type of mattress might be an option considering logistics of moving a mattress up/down the steep spiral staircase. Other than this one negative, the stay was just perfect. I would recommend Inn New York City to anyone who wants to experience living in New York rather than staying in a hotel room.", "Date": "Jan 11, 2008", "ReviewID": "UR727104446", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "CAGIRL401"}, {"Content": "Yes - it is as good as the reviews below!!       Vermont Suite Downstairs", "Date": "Jan 5, 2008", "ReviewID": "UR383960418", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "SimSkye"}, {"Content": "Inn (heaven in) New York City Inn New York City is extraordinary. I cannot recommend it highly enough. Its owners, Ruth and Elyn Mensch, could not be more welcoming and helpful. As Elyn put it the evening we checked in, they are as invisible or as available as their guests want them to be. We spent five days in the Library Suite from December 27, 2007 to Jan 1, 2008. The Suite has a lovely bedroom, a huge living room, high ceilings and stained glass skylights. It is full of visual surprises, including a sled, a propeller, a book-filled ladder and a displaced staircase cum towel stand. (This description does not do the Inn justice--please refer to the Inn's website. A picture = 1000 words.) in the Library Suite, there are, as you might expect, books everywhere; the shelves include current best-sellers and classics; the tissue box covers are book-shaped; an instruction manual on ironing for men is hidden in the ensuite laundry area. When we arrived, a quiche, bagels, brie and a bottle of pinot grigio were just some of the items waiting for us in our kitchen. There were chocolates on our pillows. Orange juice, more bagels and fresh pastries mysteriously appeared each day. Fresh fruit was always available in the front hallway. Housekeeping was unobtrusive and meticulous. The Inn has no street-front sign, which gives guests the pleasant illusion, when entering or exiting the building, of being residents rather than tourists. We loved the Inn's location. It is on New York's Upper West Side, just two blocks from Central Park, one block from the subway and five blocks from the Lincoln Center. The Inn is surrounded by cafes, restaurants and shopping. I cannot claim to know Ruth and Elyn Mensch but having spent five days at their inn, I think I can safely say that they know hospitality, interior design, good food and, as the Inn's name might suggest, whimsy.", "Date": "Jan 2, 2008", "ReviewID": "UR474908402", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "AHWanderer"}, {"Content": "Cosy, beautiful and welcoming       The opulent jacuzzi in the Spa suite.", "Date": "Jan 2, 2008", "ReviewID": "UR629634047", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "trellism"}, {"Content": "Everything was perfect . . . We went to New York for a week for my 40th birthday. Inn New York is brilliant!We stayed in the spa suite. Elyn and Ruth could not do enough to make our stay enjoyable and Elyn was always available to answer any 'stranger to New York' questions! These ladies clearly pride themselves on providing a high standard of, well, everything really! We felt very pampered and spoiled. The location is perfect, the suite luxurious, the fridge filled with a variety of delicacies with a surprise or 2 everyday. Our only regret is that, as eager sightseers, we didn't have more time to take advantage of the luxury of Inn New York.Yvonne and Euan, Glenrothes, Fife, Scotland", "Date": "Dec 22, 2007", "ReviewID": "UR930743941", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Bertie67"}, {"Content": "Home Away From Home Ruth and Ellen share their home so that we can experience living in a brownstone in New York city. Antiques, chocolates, gourmet teas and snacks, private balcony, whirlpool tub, quiet neighborhood - all add up to gracious living. A wonderful experience I will never forget!", "Date": "Dec 4, 2007", "ReviewID": "UR101724712", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "hrtracy"}, {"Content": "Attention to Detail, Amazing       Birthday Cake for my girlfriend. Waiting on our arrival.", "Date": "Nov 22, 2007", "ReviewID": "UR907048333", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "thewires"}, {"Content": "So sorry..... ....that we couldn't stay longer! Surprised my husband for his birthday weekend here and we could not have stayed at a more delightful place. What can I say that hasn't been said before? We had the Vermont suite which is two levels and had everything you could possible need, and was warm and cozy in the city's November chill. The neighborhood is lovely and near the subway and walking distance from Lincoln Center, Museum of Natural History and Central Park, lots of nearby restaurants and shopping yet the street itself is very quiet.The furnishings were rustic elegant, and yes the staff provided many special extras for us. It was hard to tear ourselves away for the activities we had planned. We will be back, hopefully longer next time. This is truly a very special place!", "Date": "Nov 20, 2007", "ReviewID": "UR754380482", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Queensnative"}, {"Content": "Its Beautiful Inn New York City My husband and I stayed in the Spa Suite on for our anniversary. We really enjoyed ourselves, I was amazed that our hosts had thought of every possible thing we would want in our room. I have never stayed in place so luxurious, quaint and wonderfully located in NYC. The Inn is a real find, and I'm sure I will recommend it to anyone looking for a special experience.", "Date": "Nov 13, 2007", "ReviewID": "UR895665100", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Java10990"}, {"Content": "fun weekend Had the best long weekend. Decided to go to the city and loved the place! Will definately go back! Thanks Tripadvisor for the best advice!", "Date": "Nov 13, 2007", "ReviewID": "UR407799095", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "travelboyLa"}, {"Content": "Great Bday Surprise I surprised my husband for his 40th. We loved it! The Opera Suite was amazing and spacious. Everyone was courteous. Enough food for breakfast. Great location. Awesome fireplace and an abundance of privacy. If you have the money- stay here. Also the price is comparable to many of the other hotels in the city.", "Date": "Nov 12, 2007", "ReviewID": "UR419205095", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "GivemeaTfortravel"}, {"Content": "$600 for stained sheets and no hot water! I stayed in the Spa suite with my wife, and was extremely disappointed to find stains on the sheets. We arrived late and didn't want the hassle of having them changed, so we decided to just grin and bear it. The following morning, we waited until 11am to use the jacuzzi (as per the regulations of the hotel), only to have luke-warm bath. After inquiring, we learned that this was normal and we just had to wait for the hot water to return. After waiting an hour or so, the water failed to remain hot, and the resulting bath was once again luke-warm. We decided to leave, and checked out around noon after staying 1 of 2 planned nights. We were once again disappointed when the owner informed us that we would not be refunded any of the money we spent, even though the room was not up to par.  When paying $600 a night, we expect clean sheets and hot water in the Spa. Also, we expect the staff to be a little more professional and courteous.", "Date": "Nov 5, 2007", "ReviewID": "UR930362098", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "climacus79"}, {"Content": "Great eccentric hotel This is a unique hotel. We (two adults and two children) stayed in the spacious library suite. The suite was the complete opposite to a chain hotel, with lots of antiques (eg a wooden plane propellor, a sledge, old leather suitcases, plus lots of furniture). The food provided for breakfast was varied and plentiful, and the service friendly.", "Date": "Nov 1, 2007", "ReviewID": "UR821854557", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "Tongariro"}, {"Content": "Absolute perfection!       View of the Opera Suite, with piano", "Date": "Oct 13, 2007", "ReviewID": "UR377550455", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kat2551"}, {"Content": "One of the very best My wife and I stayed for two nights at this wonderful upper west side property. We were in the spa suite which surpassed our expectations in every way.Elyn was a most gracious and welcoming Innkeeper who was happy to allow us a late check in following our flight from the UK.Our suite came with a great choice of of breakfast goodies, wine and a fully equipped kitchen. If we had wanted to eat in this would have been possibleThe general ambience was very New York in a kind of Victorian way. Very athmospheric! Furnishings were very comfortable and there was plenty of space to spread out. Only thing that we struggled with was the front door locks, which I think would need some practice to master!. However the door was answered instantly when we were forced to ring the bell.We sat in the double Jacuzzi after a long day walking and shopping with a bottle of champagne. Absolute bliss..Living in this wonderful residential neighborhood with a full array of shops and restaurants gave us a little taste of what actually living in NYC could be like. There is ready transport to mid and down town manhattan via a very local subway station.We have always used hotels when visiting previously but never again. If Inn New York is available we will book it!", "Date": "Oct 3, 2007", "ReviewID": "UR277919952", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Roadfreak"}, {"Content": "Inn New York City is heaven! Absolutely beautiful Westside brownstone. Every luxury imaginable is waiting for you. We had 3 of the 4 suites (for daughter's wedding in NYC) and each was beyond our expectations: 12' ceilings, spectacular furnishings and linens, goodies from Zabars, woodburning fireplaces, ornate tin ceilings and oh, the woodwork! Pure luxury but comfortable, right-at-home luxury.Proprietors are onsite and always available but unintrusive. A truly lovely couple. One note to travelers: it is a brownstone so stairs are part of the bargain. However, the Vermont Suite (street level) is wonderful and requires only one stair step to the suite (although the bedroom is one beautiful circular staircase down.) I personalIy love the westside and this Inn makes you feel part of the neighborhood. No problem finding cabs for venturing anywhere in the City. I can't think of a single feauture that I would change. Just plain wonderful! Can't wait to go back.I don't have photos at the moment but can say that the Inn's website pics don't exaggerate. Even more beautiful in person.", "Date": "Oct 3, 2007", "ReviewID": "UR942294644", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "chirichp"}, {"Content": "The Inn - Exceptional, Spectacular       Inn New York City - entrance", "Date": "Sep 25, 2007", "ReviewID": "UR540846998", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Kyle_and_Lisa"}, {"Content": "This really is a special place My mom and I were in New York for 5 nights (4 of them at the Inn New York City) for the US Open. We started the weekend before the Open doing tourist things around Manhattan and then spent the last 3 days going out to Flushing Meadows. This place was perfectly suited for both functions.I read all the reviews of this place before I booked and wondered if it could be as perfect as all these reviewers say. The answer is yes and no. My first reaction was that it didn鈥檛 quite live up to the reviews, but by the time I left, I had changed my mind. No place is perfect, but the positives of this place so far outweighed the negatives that it still deserves the 5 rating that I鈥檝e given it. Reviews up to this point have few details. I鈥檒l probably give too many! I鈥檒l break it down into sections: location, problems, and amenities. LOCATION - I don鈥檛 think you can get any better than this!鈥he location is on 71st almost at West End. It dead ends at the beginning of Riverside Park. You get a great view of the Hudson at the end of the street. Because of the dead end, you don鈥檛 get much street traffic. 鈥t鈥檚 a block to the 72nd subway where you can pick up a 1 local or a 2 or 3 express. Using the 2 or 3 trains gets you to midtown in minutes. We used it the express trains get to the 42nd street station and Penn Station with ease. 鈥he subway station is at the junction of Amsterdam and Broadway which is really a thriving place 鈥?banks, shops, and fast food restaurants galore. It just seems so unreal to be in the middle of all of the hustle there and step onto 71st.鈥?1st is absolutely gorgeous. It鈥檚 shaded by the buildings with lots of trees and little gardens and flower boxes by the residents. I didn鈥檛 realize how shaded it was until I walked over to 72nd which is much wider and sunnier.鈥here鈥檚 a 24-hour Duane Read a block away on 72nd.鈥airway Market is 3 blocks away. With the kitchen and accessories this place has, this is a real bonus and a significant way to cut down expenses. You feel like a local between shopping at Fairway and then preparing it in your brownstone kitchen.鈥uttercup Bake Shop is a couple of blocks away if you are craving cupcakes. The vanilla butter cream were great; the red velvet not so great.鈥e picked up the M5 bus uptown at West End and 72nd and, man, was that an incredible drive. You have Riverside Park to the west with the Hudson and gorgeous brownstones on the east for over 30 blocks. This was one of the highlights of our trip.PROBLEMS鈥he toilet paper is really thin. I know this sounds picky, but you would expect something nicer at a place like this so concerned with the details.鈥he towels were so worn they were threadbare. They were huge, though, so you can tell that there was care made in the decision to use them. They just need to be replaced.鈥ou can hear the guests walk around upstairs. There鈥檚 no creaking of the floors (that will drive me away from a place), so it wasn鈥檛 that bad.鈥he shower head is pretty but not very functional. On the positive side, the hot water comes out instantly and is plentiful.鈥he bed is lumpy, but I don鈥檛 see how they could replace it. You couldn鈥檛 get a mattress down the staircase without taking the staircase out. My mom suggested maybe a foam mattress cover would even out the bumps.AMENITIES鈥V with the full selection (through 300 something) of digital channels including HBO鈥? distinct living areas in the Vermont Suite which can become 2 bedrooms: bedroom with queen bed and bath downstairs and living room with sofa bed and kitchen upstairs.鈥o street noise鈥oft feather pillows even with the sofa bed鈥he owner is wonderful. She is there as much or as little as you need her. 鈥resh flowers both upstairs and downstairs鈥hone with a direct number, free local calls, and voicemail鈥here is wood every where! The antiques in this place give it such a beautiful touch.鈥ou really feel like you are coming home every night. We came in one night at the same time as the guy at the same level next door. 鈥he a/c is in a window, but it鈥檚 strong! You can move the airflow where ever you want it.鈥he sheets are so soft both on the queen bed and the sofa bed.鈥here are lamps and lights every where. You can tell that it鈥檚 intentionally set up for many reading spaces.鈥he amount of food included every day is amazing. I tried making a list of all the different choices and stopped at 20 leaving out plenty. We made breakfast every day out of it plus the occasional lunch, part of dinner, and dessert. It cut our expenses down significantly which helped with the price of the room.鈥e awoke daily to that day鈥檚 New York Times.鈥he kitchen was smaller than I expected, but it is so well planned. We made a few meals actual meals in it boiling corn, eggs, etc. My mom is on a strict low sodium diet, so we cooked in as many meals as we could to control her sodium intake. I know NYC is famous for its restaurants, but there is something so pleasing to come home and enjoy a leisurely dinner bonding over the day鈥檚 events. This kitchen and the beautiful drop-leaf table really allow you to do that.鈥he sofa bed was really comfortable 鈥?almost to the point of being like a real bed.This place is truly like having your own beautifully furnished apartment with so many extras in an incredible location. I know I鈥檓 forgetting so many things because it seemed like every where we turned there was yet another wow! reaction. I鈥檝e decided that I want to come back next year and have already started looking for another perfect place. Since I started searching so late this time, I thought I could find a better place that was booked at the time. I have not been able to find anything that can equal the combination of the amenities at the Inn, the beauty and accessibility of the UWS location, and the reasonable price.", "Date": "Sep 11, 2007", "ReviewID": "UR465945363", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "catherp"}, {"Content": "Sophisticated, Elegant, Exceptional My wife and I just returned from a wonderfully memorable stay at this lovely Inn. The thought of an inn in bustling New York City may seem a bit incongruous, but although Inn New York offers a comfortable haven from city stress, it isn't a rustic country bed and breakfast. Inn New York City offers a graceful, elegant and sophisticated ambiance, created with great care and a generous spirit. The attention to detail, the tasteful and original decoration, and the many thoughtfull touches make one feel exceedingly comfortable. The combination of experiencing the carefree convenience of being in a hotel while at the same time feeling as though one is relaxing in one's own pied de terre, is exceptional. This property is an exquisite contribution to the City of New York, and I say bravo for a job well done!Rex and Michele Oppenheimer", "Date": "Aug 31, 2007", "ReviewID": "UR936706855", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "rexwriter"}, {"Content": "Perfection, Nuanced, Gentle Surprises! Our king-size bed was soft but firm. Sheets were delicious. Gratis food and drink everywhere. The suite was huge. The bathtub would fit 7 but we were only a couple. Took the first bath together in years ;-)The neighborhood is excellent and convenient to everything. Ruth (the proprietor) was attentive and gracious. This was worth the price of admission. Why stay at the Ritz or Four Seasons when you can have so much more at this BB? Five Stars!", "Date": "Aug 10, 2007", "ReviewID": "UR134146375", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "yetanother"}, {"Content": "Outstanding in every way When visiting NYC there are so many places to stay that it may seem that the best, and certainly the simplest, option is to settle for a chain hotel. Granted, better hotels have a lot of different amenities to offer but at the same time what they all offer is a sameness, so that you really can't tell if you're in NYC, Detroit, or Peoria. But you do want something different, don't you? If so, then I strongly suggest staying at the Inn New York City.As the name suggests, not only are you right in the city, you are right in a west-side neighborhood. Located just a few blocks from seveal good restaurants (we liked Fiorelli's and Luxemborg best) Central Park, Lincoln Center, the Museum of Natural History, the Metropolitan Museum of Art, and an MTA station, the Inn NYC consists of a traditional multi-floor brownstone separated into several rental areas. Notice that I didn't say rooms, as each area consists of more than just a bedroom and a bath, but instead each is a unique area on its own (be sure and check out their website for lots of good photos of each). Bottom line: if you want a great location with some unique charm, this is your place.We took a 30 minute cab ride from LaGuardia to the Inn ($30 + tip) where we were greeted by the owner, Ruth, and shown to our room. We stayed in the Opera room, which is located on the ground floor, while the others are upstairs. Guests are given a set of keys to the two front doors right off 71st Street and to the door to your area, so immediately it feels like you're staying in someone's home and not in a rental property. Ruth and her daughter, Ellen, run the Inn and are both wonderful people who truly seem to want to make your stay all it can be. Have questions or need a suggestion for lunch or shopping? They're right down the hall or just call them. To get around town, the MTA station is only a block away and taxis are plentiful.So, here are your choices the next time you visit NYC: another hotel room or something different and wonderful like the Inn. Take my advice and make your trip even better by staying at the Inn New York City. The level of comfort and personal attention will be very hard to beat!", "Date": "Jul 22, 2007", "ReviewID": "UR455354984", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Johlke"}, {"Content": "Inn New York City - The chilled out side of the city! My wife and I stayed at Inn New York City for a week in late May (20th to the 27th May). When first entering the Vermont Suite, you feel like you are transported into your own little world. The duplex style suite has everything you need and is furnitured so elegantly. With this suite having it's own separate entrance it feels like you are experiencing New York from your own place in the Upper West Side.After spending the days in a variety of places around New York, it was always great to get back to the peace and tranquility of our place, before freshening up for the evening.I can not recommend this place more highly. The owners are there as much or as little as you need, the pantry is refreshed everyday and the facilities are first rate.What makes The Inn even better is that it is just a couple of blocks away from Central Park and there is a metro stop at the end of the tree lined street (so you can get around the city so easily). I would highly recommend the $24 seven day ticket (or other metrocard options) as it is an excellent way to navigate the whole area.With this being our first trip to New York, we will definitely be back. We would definitely stay at Inn New York City!", "Date": "Jun 5, 2007", "ReviewID": "UR590039059", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "MattALeamingtonSpa"}, {"Content": "Superb stay at the Inn My husband and I stayed at the Inn New York City in April for 3 nights. It was a special birthday present for me. We were in the Vermont Suite which upon entering was so charming and elegant. There were so many nice touches. The refrigerator was well-stocked and replenished every day. There was a delicious bottle of white wine and a Best Wishes chocolate cake upon our arrival. The service made us feel so special. The bed was so comfortable and I loved the fact that all the bed linen was changed daily, including the down comforter. Housekeeping was excellent! The Inn is located on a quiet street on the UWS very convenient to the 72nd St. subway stop. It felt very safe walking in the area late at night. One of our pleasant NY experiences was getting a Gray's Papaya hot dog one afternoon. The hot dog stand is located at 71st and Broadway, just up the street from our Inn. I love NYC! The people are so friendly and warm. Elyn, the manager of the Inn was very helpful and professional. My only complaint is that our stay was too short. Loved, Loved, Loved Inn New York City!", "Date": "May 8, 2007", "ReviewID": "UR724473417", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "regisyoung"}, {"Content": "We loved the Inn at New York City We has a glorious time during our 2 night 3 day stay in NY at the Inn New York City. All previous reviews say it all. This was great accommodation, owners and staff very friendly and helpful before and during our stay. They went the extra mile to ensure our short break was memerable. We had to amend our booking arrangements at the last minute and this was dealt with very efficiently.We stayed in the Vermont Suite perfect for us but not suitable for people with special needs or young children as this was a two floor suite and had a very steep staircase.The location is not central for downtown Manhatten but not a real issues for us as we used the Metro from 72 Street, this provided speedy transport to all the tourist attractions that we visited. We used the daily Metro Ticket at $7 - a bargain!The Inn provided us with treats beyond our expectations.We will definately stay there again, hopefully for longer next timeBernie  Pauline - UK Chris - Conn USA", "Date": "May 6, 2007", "ReviewID": "UR218386397", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "BerniePaulineUK"}, {"Content": "Exceptional ! Exceptional ! Exceptional ! We stayed for a week at Inn New York City. It is hard to write a review that will do justice to it.Comfort? Tops; Beautiful old house in more than pristine order.Suites lovely with real individual identity.Location? Great; close to Cental Park, Lincoln Centre just down the road, new Time Warner centre just next to it, after that the city is yours. We love to walk but subway 100yds.Price? Whatever you pay for this is a bargain. I have mourned The Drake since it passed, but finding Inn New York City makes it all worthwhile.The truth is, it is like staying with your favourite aunt who happens to live in a beautiful property, in where it is happening now in New York City. She is your favourite aunt because not only does she know how to look after you, she is cool enough to let you have all the space you want.My only problem with this review is this; the place is so small, only four suites, why am I telling you?", "Date": "Apr 15, 2007", "ReviewID": "UR349593556", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "voyager62"}, {"Content": "Surpassed our wildest expectations Ruth and her team made our stay a wonderful experience. The attention to detail, the service provided, the helpfulness of all the staff surpassed our expectations by a long way. This little Gem comes Highly Recommended. My Family, Friends and i stayed in the three available suites. So i had the fortune of viewing all 3. Each one offers something a little different, whichever you choose you won't be disappointed. Perfect retreat after a days hard walking around New York. Close to Central Park and therefore wonderfully located. Thank you very Much", "Date": "Jan 8, 2007", "ReviewID": "UR416616287", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "The-L's&P's"}, {"Content": "Excellent!   showReview(5924037, 'full');", "Date": "Oct 7, 2006", "ReviewID": "UR850390395", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "srg22"}, {"Content": "Always a treat!   showReview(5762201, 'full');", "Date": "Sep 2, 2006", "ReviewID": "UR433523168", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "TravelGirl0716"}, {"Content": "A true gem!   showReview(5327614, 'full');", "Date": "Jun 9, 2006", "ReviewID": "UR974039997", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Bouldergal"}, {"Content": "Why stay anywhere else?   showReview(5316503, 'full');", "Date": "Jun 6, 2006", "ReviewID": "UR412788387", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Near Central Park and Broadway   showReview(4110656, 'full');", "Date": "Nov 14, 2005", "ReviewID": "UR868871436", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent   showReview(4093087, 'full');", "Date": "Nov 8, 2005", "ReviewID": "UR749746543", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "tefargo"}, {"Content": "The Definition of Luxury...   showReview(3997501, 'full');", "Date": "Oct 6, 2005", "ReviewID": "UR460819198", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Travlin'Prankster"}, {"Content": "Wow!!! An absolute gem!   showReview(3232182, 'full');", "Date": "Feb 26, 2005", "ReviewID": "UR679759028", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "g&z"}, {"Content": "Fabulous gem   showReview(3213005, 'full');", "Date": "Feb 20, 2005", "ReviewID": "UR248938244", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Temptationgirl"}, {"Content": "Excellent value   showReview(1499017, 'full');", "Date": "Nov 26, 2003", "ReviewID": "UR569486425", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Die ersten Flohbisse nach 5 Minuten!!   showReview(16052455, 'full');", "Date": "May 15, 2008", "ReviewID": "UR438358263", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "Janikind"}, {"Content": "Merveilleuse adresse   showReview(15733758, 'full');", "Date": "May 6, 2008", "ReviewID": "UR623049329", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "fred2783"}, {"Content": "J'ai bien aim茅   showReview(12953410, 'full');", "Date": "Jan 24, 2008", "ReviewID": "UR605717255", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Geewiz100"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60763-d80092-r23081760-Inn_New_York_City-New_York_City_New_York.html", "HotelID": "80092", "Price": "$560"}}