{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Deltona, Florida", "Title": "“It was okay. Hospitality needs improvement.”", "Author": "juliadeburgos47", "ReviewID": "UR126355521", "Content": "We arrived 10 mins before check in time 3:00pm and was told we would have to wait utnil 3:00pm. We sat in front of the front desk and it was 3:00, 3:05, 3:10 and 3:15 and the young ladies were chatting way and completely ignored us until I got up and ask if the room were ready. After another 15 mins we finally got our room. The young ladies need a refresher course on customer service. Other than that first impression the accommodations were okay. The room was okay and it was located in reasonable distance to the malls and major highways. Would I stay there again? I don't know. Would I recommend it? I don't know.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Caracas, Venezuela", "Title": "“Not the best option just a regular one”", "Author": "andrea r", "ReviewID": "UR126016152", "Content": "I have read previous commemts about the shutle from airport and for me it was the same I arrive to Miami at 1 pm when I contact the hotel and asked for their shuttle they told me that the service would be available at 3 pm so that would mean to wait 2 hours at the airport I had to pay for a cab to get there, when I wanted t check in the system was down and their onky option was for me to wait in the lobby for almost an hour and a half I had to asked several times if the system wasworking again since no one from the staff was interested to solve it some how. Generally speaking the cleaning at the room was so so the carpet looks really dirty and so the towels they put at the bathrooms, the rest of the hotel lookd really clean, the gym is on good conditions. The breakfast is quite good they try to add more options comoare to other chains sometimes they have pancakes, sausages etc. Their laundry room is not good the dryer takes like 3 hours to dry the clothes otherwise you need to put really small amount of clothes several times so it work. The staff at the hotel in genera is not polite at all even at the front desk they are quite moody. Location wise its the only great thing really close to a good supermarket, restaurants, cvs and in a good spot to move around in Miami after my stayed I wouldnt stay here again I rather La Quinta hotels always have a good experience there.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Bayfeld", "Title": "“Not That Convenient to and from the Airport”", "Author": "Jerry H", "ReviewID": "UR125810908", "Content": "Don’t let them fool you about this being an airport hotel. They are at least 8 miles away and, although they have a shuttle, they don't tell you that it stops at 10 p.m. We arrived at the Miami airport at about 10:20 and ended up shelling out $43 in taxi fare and spending over 20 minutes getting to this place; which, by the way, wasn’t worth the drive. There are a number of better hotels located right at the airport for anyone wanting a stopover between flights. Don’t be fooled by the word ‘airport’ in this hotel’s name.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Rochester, Minnesota", "Title": "“Beware of shuttle”", "Author": "BRL79", "ReviewID": "UR125658273", "Content": "We waited almost an hour for an airport shuttle. After getting to the hotel, we asked the front desk about whether there was a bus that goes to the nearby mall (1.5 miles away). We were told the hotel shuttle could just take us. After we got in the shuttle and started driving, the driver told us we had to pay him $15! What a scam!!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“\"Airport\" shouldn't be included in the name - it's misleading”", "Author": "Stewsview", "ReviewID": "UR125642705", "Content": "If you are seeking accommodation close to the airport, this isn't it! The hotel is 25 minutes from the airport terminal - if the traffic is light. Even if there hadn't been an accident just as we exited the airport (! no one's fault, but we didn't move for an hour, truly) it would have taken us at least an hour during rush hour traffic at 4:40 pm. When we arrived at the shuttle area, we had a long wait of over an hour. The shuttle finally came after other airport hotel shuttles passed us 3 times. The staff were friendly and welcoming. The furniture in the room had seen better days and the room could have been cleaner; the bed was comfortable and the room a good size - but far from sound proof. Nice outdoor pool. LOTS of hall noise in the middle of the night. To add to the misleading 'airport' hotel impression the name of the property gives, the shuttle doesn't start running until 6 a.m., and that was cutting it too fine for us, so we ordered a taxi (unexpected additional $35.00 expense). A van saying 'airport transport' showed up at the appointed hour, but said it had to wait for another couple before taking us to the airport. Didn't fit our definition of a 'taxi'... and we were struck by how we weren't told it would be a shared vehicle.... leading us to believe it's a great way to get two fares (at least) for one trip. We won't use Best Western Plus at Miami airport again.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lake Leelanau, Michigan", "Title": "“One night stay before cruise”", "Author": "mary ann p", "ReviewID": "UR125349669", "Content": "Pretty exterior, Shuttle service very, very poor. We, were a family of 11. The youngest being i yr. old. We called as insructed after we gathered our luggage. We waited over one hour, The shuttle never arrived!!! We made several calls to the Hotel and they said it was on it's way It never came. We ended up with all of us taking cabs which cost us 90.00 dollars. The carpets in the rooms were very dirty. Our feet were black.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "St. John's, Canada", "Title": "“Terrible Hotel Don't Stay Here”", "Author": "T S", "ReviewID": "UR125037412", "Content": "We just stayed at this hotel for 1 night after our cruise on Feb 19 and it has to be the worst hotel that we have ever stayed at. To start with the elevator was broke so we had to carry our bags up to the fourth floor with no assistance. The first room we had smelled like a dirty old basement so we went to the front desk and asked for different room when she offered to spray perfume in the room but we refused. We finally got a new room which smelled better but upon flushing the toilet it overflowed so we called the front desk. The clerk told us they had no maintenance on that we could come down and she would give me something to clear the toilet myself. I refused to do this and after a couple of hours someone came to fix it. I would only ever stay at a hotel like this if I was totally desperate.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ypsilanti, Michigan", "Title": "“Worst accomodations I have ever experienced”", "Author": "Carol V", "ReviewID": "UR124556525", "Content": "We arrived at around 8:00 p.m. after being on the road all day. Our first impression of the hotel was okay. However, upon entering our room the carpet was filthy, with large spots right at the door and on into the room. The furniture had not been cleaned as there was still wads of hair and dirt clinging to the upholstered chairs. We went back to the front desk and was told there was no cleaning crew for the night. The young man working the front desk followed us back up to our room and agreed that it had not been cleaned. When you pay so much for a room you expect the basics. We sat in the front lobby for probably an hour or more waiting for him to hear back from the owner, who never called him back. We couldn't get another room because they were booked! I will not stay at this hotel again. Even some of the guest we spoke to said their rooms were less than satisfactory. I sure hope they get their act together or they won't be in business very long. Beware of this hotel!!!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Great Choice!”", "Author": "Mary H", "ReviewID": "UR124261411", "Content": "My daughter and I had a business conference to attend at a Miami airport hotel; we planned to stay 5 nights and wanted to stay at a more affordable hotel near by. I had no idea what a great choice I made selecting this Best Western! We were running very late, so while a few hours out, we called the hotel to let them know we were still on our way; when we arrived, they knew who we were, checked us in quickly, updated us on breakfast hours, WIFI access and gave us directions to the conference hotel that reduced our exposure to rush hour traffic. Our room was a King Suite; it was tastefully decorated and the high ceilings gave it a spacious feel. The sitting area looked like the one in the hotel photos and had a long desk, plenty of power recepts and a large open area that allowed easy access for our suitcases. The kitchenet had a bar type sink, microwave, frig and single cup coffee / tea maker. The FREE hot breakfast was terrific; hot waffels, eggs, bacon or sausage or ham, cereal, yogurt, fresh breads and pastries. This saved us both time and money every day. Now the location, for such a reasonable rate, I didn't expect it would be close to much of anything. Ends up, for our needs, it was close to everything. The conference hotel was less than 5 miles away and everything else was less that 2 miles; Dolphine Mall, International Mall, large grocery and drug stores, all types of American and International restaurants (Peruvian, Argentinian, Korean, Japanese, French, Cuban, Italian, Greek, Brazillian, etc, etc) , fast food and bakeries, gas stations, banks, access to high speed roads (Turnpike, etc), everything we needed. If I have another meeting anywhere near this hotel I will definitely stay there again. I made a Great Choice!", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm", "Title": "“Good value”", "Author": "MRBENGTStockholm", "ReviewID": "UR124248829", "Content": "We have stayed here a couple of times, either directly after arriving from Europe, or the night before our departure. The hotel is value for money, reasonably priced and even have a swiwingpool in the back that you can use (unlike BW Premium airport hotel). OK breakfast and rooms. The hotel have no restaurant, you can find restaurants within 5 minutes walking distance. The pick-up from the airport is free but very time consuming, I recommend you to take a taxi. However please use the transport if departing, normally the driver departs the hotell every hour on the hour (except 2PM).", "Date": "February 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Recife, PE", "Title": "“COMPUTER STOLEN”", "Author": "Monteiros B", "ReviewID": "UR124230777", "Content": "I went to a conference at this hotel, left my new macbook air in the room and it was stolen along with a few other minor items. And the hotel said they don't take responsibility so I just have to deal with a 1000 dollar loss.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Only O K...”", "Author": "TOtravlr", "ReviewID": "UR124015946", "Content": "We stayed here one night post cruise. We sailed out of Port Everglades, but decided to spend a day and a half in Miami. I picked this hotel for the price, and since it was close to Dolphin Mall and not too far from the Everglades. The lobby was decent and clean, and check-in was fast and friendly. We got up to our room and the decor was nice, but the rug was extremely dirty. It turned everyone's socks brown after a short time of walking on it! The bathroom was clean, but when my husband went to shower he said the drain was backed up. We didn't bother to complain since we were only here for one night, but these things affected our impression. Free wifi was nice, and they had a business centre in the lobby where I was able to use the computer and even print my boarding passes (complimentary). The free breakfast in the morning was very busy, and we usually can't stand the selection of most hotels' free breakfasts and this was no different. Dry looking pastries and bagels. They did have a waffle bar, yogurts and cereals though (but didn't try any so can't say whether it was good or not). We only ended up grabbing a few oranges for the kids to tide them over, and instead drove to Versailles bakery on Calle Ocho for some cuban pastries. Boy was I glad that we did because these were well worth it. Highly recommend the Pastel de Guayaba (recommended on Best Thing I Ever Ate by Aaron Sanchez) and another sugary looking one with cheese inside...these were all fresh and even still warm! Check-out was slow. I was paying with a gift card I purchased on bestwestern.com, so I'm not sure if that's why, but it took wayyyy too long, and there was only one person at the desk, so a line started to form. I'm not sure if we just got a bad room, since most of the reviews on here seemed positive, but because of our experience I probably would not stay here again. I saw a Courtyard at Dolphin Mall, so if I was ever in the area again I'd probably choose that.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Spacious, spartan rooms decent breakfast, busy and crowded”", "Author": "01dFo1ks", "ReviewID": "UR123850650", "Content": "The hotel is extremely busy. The staff can get overwhelmed, but are very helpful. The internet service is slow, unreliable and extremely difficult to use. The breakfast is decent with hot entrees every morning and a waffle maker. The breakfast area is much too small and extremely crowded. The maid service is prompt and efficient. The hotel could use better maintenance and the bathroom fixtures are low-end. Most rooms have a small refrigerator and microwave. Good location. Restaurants and grocery store within walking distance. Close to two major malls.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Weston, Connecticut", "Title": "“You get what you pay for...”", "Author": "TOWestonCT", "ReviewID": "UR123619317", "Content": "I arrived at the Best Western figuring it would be an average hotel at best, and that proved correct. The lobby is as austere as could be imagined, though they did have an inclusive breakfast and drinks throughout the day. I jumped in the pool, which is wedged in between an industrial building and a parking lot, and I nearly had a heart attack it was so cold. Yikes. The rooms were big, which was good, but the TV appeared to be from the 1980's, a Zenith, which might have been salvaged from another hotel. The phone message light stayed on, and there were messages from six months ago that were still not erased. The bathroom was small but adequate, but they had installed the doorstop in a place exactly where you would step coming out of the shower, and I stepped on it three straight days, much to my discomfort. All in all, a low priced hotel, near the airport, with few amenities. The hand towels in the rooms were paper (yes, paper) and the bath towels looked like they had been bought from a car wash - old, crusty, and small. Look, it's a bare bones place that is reasonably clean and is about what you might expect for the price. I made a mistake trying to save some money and would not do it again.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manaus", "Title": "“Good choice in the price range”", "Author": "wladfb", "ReviewID": "UR123368425", "Content": "The hotel is small but nice, located in the Doral area, itÂ´s near the airport and International Shopping Mall. The rooms are spacious and along with the king bed there is also a queen sofa bed, a refrigerator and a microwave. I had the impression that it was renovated recently, but they seem to have forgotten to replace the carpets, for they looked dirty and let the soles of our feet black if we walked barefoot in the room, not a very good cleaning. Although the breakfast was included, the area was very small and we always had to wait for a table stand, as the hotel seemed crowded all the time. Internet access is free and has a good speed in the lobby, though the connection in the rooms is very slow and often it falls. It is a good choice in the price range.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Not an airport hotel.”", "Author": "jef88ftlauderdale", "ReviewID": "UR122127242", "Content": "To be completely honest there is nothing wrong with the hotel other than the location. It's a best western, so for the most part, clean, nice helpful staff. The location is what killed me. I had a 12 hour layover in Miami. After a 10 hour flight and another 5 the next morning just wanted a close hotel to get cleaned up, relax and get some sleep. Took a cab from the airport, with a tip 40 bucks. The room cost 100, round trip the cab was 80. My wife booked the hotel so I kept my mouth shut. She didn't know and either did I. The biggest thing is the name is deceiving. We passed at least a dozen hotels on the way to this one(by the way you have to get on the turnpike to get there). I would much rather pay more for the room and less on the cab.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Paramaribo", "Title": "“Not bad at all, close to malls”", "Author": "Surilady", "ReviewID": "UR121404949", "Content": "I stayed there on 28-30 november. The worst I can say, is the hotel is a bit dated, furniture, towels etc are old but clean. You can practically smell the laundry detergent on them. Nothing is adjacent to it. No wake up calls etc. BUT rooms are clean and spacious, bathrooms spacious with good toiletries, the breakfast is free (you can even make your own pancakes) the coffee is free 24/7 and is great, ( with int'l delight creamer!) staff is friendly, although not fluent in English, but helpfull. Free parking, free wifi! It is close to both, international and dolphin mall (10$ taxi) 2-3 blocks walking distance there are lots of options for food, gas stations, and stores, CVS, Wyn-Dixie. It is not a 5 star hotel, so don't expect it to be one. But it is a great, quiet place for short stays between flights. Airport shuttle is on time to take you to the airport, from the airport to the hotel, save yourself some time and take a taxi or super shuttle to get to the hotel", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Port Coquitlam BC Canada", "Title": "“OK for a night”", "Author": "wanderlust1971", "ReviewID": "UR119677093", "Content": "We were on a layover so this was a nice clean hotel for a stop over. There is really nothing around to do per se. If you want to go to the Dolphin Mall to shop it is roughly a $70 round trip. We found a corner grocery up the road as we had forgotten to bring tooth brushes. We bought some beer for our fridge. We ate at Burger King and got short changed by $9. The breakfast is good in the morning but go early as it fills up. People who linger over their coffee while their are lineups for tables drive me nuts. Rooms are nicely decorated and the beds are comfy.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Not an airport hotel”", "Author": "Clive M", "ReviewID": "UR119456291", "Content": "This was a one night stopover having arrived from London and driving up to orlando the next day. Firstly this is not near the airport. At least a 25 -30 minute drive away. The worst thing was that the shuttle from the airpot only goes once an hour. We waited 55 mins to get to the hotel. So poor when my family was so tired. The hotel has no dining facilities. All we wanted was a pizza or burger. Had to buy a pizza from a delivery company for which we waited half an hour. Our room was disgusting. Carpet filthy and bathroom was unbelievable. The enamel was peeling off the bath. Also sheets were grey and creased and the towels were so grey. A bug of some kind was crawling up the wall. Don't ask me what it was. Our room was on the ground floor and as the hotel was not at All full I thought we might have been given a better room.", "Date": "October 18, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto", "Title": "“Great little hotel. I've stayed there several times.”", "Author": "ScubaJoolie", "ReviewID": "UR117771503", "Content": "I've stayed there about four times, as I can book through my Aeroplan airmiles. I mostly do shopping, so it's suburban and close to the malls (Dolphin Mall, etc). Breakfast is standard continental. Good hotel for the money.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "boston", "Title": "“Suitable for a quick overnight stop”", "Author": "meleetyme", "ReviewID": "UR110813718", "Content": "We stayed here during an escape from the east towards the Caribbean. We left our home ahead of a snow storm and had to wait overnight to get to the Virgin Islands. We jumped on a plane headed to Miami with no place to stay the night. After looking for reservations at various hotels on line the Best Western was one of the only places that had a room for the evening. The person at the 800 number gave us a rate lower than the published rate. I was vary apprehensive as I had never stayed at a Best Western before. We were pleased with the cleanliness of the hotel and of hte rooms in particular. The shuttle is not convenient. We waited for about a 1/2 hour at the airport (at 11 p.m.) to get on the shuttle. However we did not have to wait on our way back to the airport the next day. The hotel offers a free continental breakfast which is disgusting. Worst \"eggs\" I have ever tasted in my entire life. Gag! The staff however was very friendly (save for the stafff around the food area who seemed to not be pleased with having to work or serve others). Overall good room, decent price.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Juneau, Alaska", "Title": "“Plan on Waiting a Long Time for the Undependable Shuttle”", "Author": "Rosementko", "ReviewID": "UR99571899", "Content": "We spent one night at this hotel. The tone of our stay was set by the shuttle service. We called the hotel to ask about the shuttle. They told us the pickup location and that the shuttle would be there in 15 minutes. We waited and waited and called and called. It was over an hour before the shuttle arrived. When we arrived at the hotel, there was no apology or smoothing over of the issue. We were greeted with arrogance. The desk clerk wanted to argue that their website says that the shuttle runs once an hour. Well, we did not make our reservations on their website. Hmmmmm. I am still steaming. Needless to say, the rest of the hotel experience was overshadowed by our welcome or lack of one. I would say that the staff needs training in customer service and the hotel should not advertise that they have shuttle service. It is not dependable. Even when we asked for directions to a place to eat, we were given mediocre responses. Luckily, we went to the Bruschetta and Co. for dinner. It was the highlight of our stay", "Date": "March 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Kidderminster, England", "Title": "“Do not Book this Place !!!!”", "Author": "DavenJane", "ReviewID": "UR98250068", "Content": "Arrived at Miami airport after a flight from London. Found the courtesy bus only to be told that he was full and could not take us. He promised he would return. 1hr and 15 minutes later he still had not returned. We took a taxi to the Hotel which cost us $40.00 so as you can see it is not very near the airport. We explained to the check in and were dismissed, no offer of a refund on the taxi or even a good will gesture. The next morning we checked out again asking if a contrbution to the taxi fare could be made (To no avail). We had booked and paid for this hotel in advance through a company called Octopus Travel. On our return to the UK we found that the Hotel had also taken payment for the room on a Credit card impression that they asked for on our arrival. We contacted Octopus Travel who said it would take 28 DAYS !!! to investigate the error. When all they had to do was e mail the hotel and ask them to refund it to my card. 2 Lessons learnt here.. Do not give this Hotel your Credit Card and do not use Octopus Travel.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Vancouver BC", "Title": "“Stay somewhere else”", "Author": "joemama15468", "ReviewID": "UR95528852", "Content": "Stayed here to be close to the airport and utilize shuttle service. Shuttle only comes once an hour and when it came the driver initially sent us away as he did not understand English. After my husband dragged our luggage to another shuttle, that driver directed us back to the first one and then we were flagged onto the first shuttle. The driver said nothing to us. The hotel is about 25 minutes drive from the airport, certainly not very close. There was lots of black hair in one corner of the bathroom - yuck and the towels felt wet. I think it was that they just weren't dried properly. Shuttle left following morning 10 minutes late which is signifcant when you are trying to catch a flight. I was very disappointed for a Best Western.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“a good value for an airport overnight”", "Author": "jayjl", "ReviewID": "UR92687489", "Content": "this is a good choice for a MIA airport overnight. The staff was very friendly, the morning breakfast was more than ample, and the nightly rate was reasonable. I would stay here again if I had reason to be overnight near MIA...", "Date": "January 12, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Houston, Texas", "Title": "“Too far from airport + infrequent shuttle”", "Author": "manuchao17", "ReviewID": "UR91600817", "Content": "The shuttle operates at 1 hr intervals and the ride takes 20-30 minutes. The room was decent enough, but if may be worth paying a little more not to have to wait around at the airport for up to an hour.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "POS", "Title": "“Very Pleasant”", "Author": "Angelsen68", "ReviewID": "UR87575410", "Content": "I stayed here the weekend of November 5th and I must say I was pleasantly surprised, the room was lovely, the staff was very courteous, but never got the shuttle to pick me up from the airport to take me to the hotel, I used the airport shuttle service which cost me $21.00 as opposed to a taxi which would have cost me $30.00. The hotel is between the airport and Dolphin Mall and International Mall. There is no shuttle service to the places. The cost of a taxi from the hotel to Dolphin Mall and Wal Mart is around $11.00. Nice and short.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Vancouver,Canada", "Title": "“Ok hotel while waiting to catch a flight- could have been cleaner”", "Author": "Happyone69", "ReviewID": "UR87515787", "Content": "Outside appearance nice, lobby nice, eatting area clean, shuttle service great Sheets looked slept in-missing towels-no extra blankets, carpet very dirty, dirty couch, pool so cold could not use-paper floating in pool-grounds around pool looks like it gets litte attention. Room quiet for us as we were on 2nd floor-main floor near conference room had lots of noice. Busy lobby area. Staff so -so friendly-limited english at times. safe area-WinDixie arcoss street with some resturants-40min walk to Dolphin mall-walk was long but easy. Mall excellent- cab back $12.00 including tip. Ordered Pizza in Poppa Johns-great. Great price and we could use our airmiles gift card so that was a bonus. Breakfast included and was great", "Date": "November 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Placencia, Belize", "Title": "“Best is definitely Worst Western”", "Author": "CaptCabral", "ReviewID": "UR74348422", "Content": "We arrived around 10pm, had to walk what seemed like miles through the terminal after cross-country flight, got to shuttle pickup area and watch all the other hotel vans go past but no sign of the Best Western shuttle. We finally called them and found out the LAST one for the night had picked up the LAST passengers and would not come back for us. We then went to the jam-packed taxi stand downstairs, finally got a pretty nice taxi guy who took us what seemed to be the long-way there, then were told we had to get up at 5am for the 6am shuttle for a 10am flight...NEVER AGAIN WORST WESTERN!! NEVER AGAIN. We too booked through hotels.com. Maybe they should alter their description...Just saying.", "Date": "August 8, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Sarasota, Florida", "Title": "“They lied about their airport shuttle--It's not 24 Hours!”", "Author": "lionelkaufman", "ReviewID": "UR65403052", "Content": "I booked a hotel room at this hotel through www.hotels.com. Before I booked it, I called the hotel and spoke to the desk clerk. The desk clerk told me that the hotel has a 24-hour airport shuttle. Since my flight was arriving around midnight, I thought this would be a good hotel to stay at. Also, their ad on www.hotels.com advertises a 24-hour airport shuttle. When my flight arrived, I called the hotel to order the shuttle and the desk clerk said their shuttle service was closed for the night. My only recourse was to go to another hotel for the night. When I tried to get a refund from the hotel on my credit card, the hotel, as well as hotels.com both denied me a refund and I was stuck with paying two hotel bills for the night.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Fair”", "Author": "babybass", "ReviewID": "UR64851998", "Content": "Nice newer hotel but I booked a 2 bed room and got a suite with a bed and a sofa pull out bed, when I went back to the front desk to request to change to a regular room with 2 beds they said that they were 100% booked for the weekend so we got stuck with the pull out bed. I think they could have suggested swapping a 2 bed room with another guest traveling alone or being more condescending with the situation. Also the hotel staff could improve on the poor complimentary breakfast. The hotel is nice and clean and almost new but the staff (excluding the housekeeping staff) wouldnâ€™t certainly bend over backwards to accommodate your needs. The bottom line is that there are better options in the area for the same price.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "5", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Newfoundland", "Title": "“Old & Smelly”", "Author": "BMHNewfoundland", "ReviewID": "UR62194350", "Content": "I am glad that we only had to stay one night at this hotel as a overnight after our cruise. I knew when I booked it that it wasn't a 5 star hotel . Overall the hotel wasn't too dirty but as soon as you left the lobby and got off the elevator you got the old smell and it continued right into your room. Thank god for windows. The hotel is old and is in desparte need of replacing their carpet. The staff were friendly and helpful. It's also not as close to the airport as you think it is.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Finland", "Title": "“Don't rely on the shuttle - copy that”", "Author": "tommypee1", "ReviewID": "UR60669874", "Content": "Like the title says: Don't rely on the shuttle. We had to take a cab from the airport, because didn't want to wait like 1 hour 45 min for the shuttle to arrive. Cab was something like $45 to the hotel, kind of long trip. We booked a \"shopping package\" what included a suite, transfer to Dolphin Mall and dinner at some Cuban restaurant at Dolphin Mall - can't remember the name. Check-in gave us a basic room with no shopping package and didn't still believe me when I showed the reservation I had printed. But after some minutes, we did get a so called suite and shopping package. Front desk gave us also a password for WLAN, it didn't work. Tried it like three times, didn't work. But they gave us a cable and then it worked ok. Kudos for that. Everyone in the front desk spoke the worst english I have heard in USA. That was a minus. Location was ok, two malls in cab distance and few stores (grocery, hamburgers etc) in walking distance. Fitness Center was like one bike and nothing else. Parking seemed to be free and there is lot of parking lots. Room was oldish but spacious. TV had green picture. Would not recommend this to a friend, excpet for a very good price.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Whidbey Island, Washington", "Title": "“Desperate need of renovation”", "Author": "SeattleCat", "ReviewID": "UR60272178", "Content": "After a long cross-country flight, I arrived at the Best Western with the intention to stay there for 3 months. I lasted one night. Arriving at the hotel, I noticed that it was on a lot surrounded by construction, and the area had a skeevy feel to it. The check-in was painless enough, although the desk was staffed by high school kids. I got to my room on the first floor, and was greeted by the powerful scent of \"old lady\"- musty, moldy, and heavy on the Lysol spray. The furnishings were old, and were worn and dirty. I scraped the coverlet off the bed, and if it wasn't for the fact that the room was freezing, I would have taken off the nasty blanket as well. The sheets were old and worn, and the bed was slightly less comfortable than a brick patio. Trying to get internet was an adventure, no where in the visitor/hotel information did it say that you needed an access code to use the internet. So after 30 minutes of rebooting my computer, I called their internet help line. That service was so helpful that it borderlined on psychopathic- they called me 3 times to make sure that I was all set! It wasn't the worst hotel I've ever stayed in, but I would never go back.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Great Hotel - great value!”", "Author": "TravelAddictCA", "ReviewID": "UR58806442", "Content": "We were on Royal Caribbean Cruise and needed a hotel in Miami for overnight stay with a breakfast (we were travelling with little kids), Cruise port shittle, and not expensive. Suprisingly it was hard to find. So when we found this hotel offering Family Package with breakfast, shuttle and even lunch voucher for only 120 USD we were very happy. It was too good to be true. After all the hotel was great, the breakfast was just perfect, no complaints about room. We're party of 15 people and everybody left happy and satisfied!", "Date": "March 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Alameda", "Title": "“Don't rely on the shuttle”", "Author": "AlamedaRambler", "ReviewID": "UR58146658", "Content": "The shuttle comes only once an hour, and with afternoon traffic it took two hours to get from the airport to the hotel. The choices of food to order in were cardboard pizza or inedible hamburger.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“cozy hotel, close to airport .”", "Author": "panerai1966", "ReviewID": "UR56715681", "Content": "we stayed here for two nights, before heading towards our cruise in port of Miami, definately recommended hotel, breakfast was apperantly included in the our price wasnt told so until arrival, pretty packed hotel since it was the super bowl final in Miami at the time we stayed, good experience with the spanish staff there. sawgrass mills, n the colonade outlet malls wasnt to far either, very convient dining around the area for sure.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Winnipeg, MB", "Title": "“Housekeeping and Customer Service were extremely poor”", "Author": "WpgJake", "ReviewID": "UR55602818", "Content": "Room had very dirty/gritty/greasy carpet, tub did not drain, no face cloths in room", "Date": "February 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "halifax NS", "Title": "“Not to Shabby!!!”", "Author": "kgreen12", "ReviewID": "UR50375343", "Content": "Im a travel agent and i travelled to Miami for an overnight before i left for a cruise for our honeymoon .. and i liked this hotel i did book it thru points on travelocity and it was a good value hotel we ended up delayed on our flights so were late like 1am arriving in but i called the hotel and they saved my room , when i checked in they were polite and gave us our room keys our room was a good king size with a view of the pool and we had a living room and all not bad for 85.00USD the next morning we went to the breakfast they offered and it was a hot continetal breakfast but it was good i made myself a bagel breakfast sandwich then we took the free airport shuttle back to MIA airport to meet up with my cruise transfer , overall a good night stay", "Date": "November 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "ottawa, ontario", "Title": "“there is MUCH better in Miami for a one-night stopover”", "Author": "pinkjupiter", "ReviewID": "UR32449283", "Content": "I stayed here for 1 night on the way to another destination. This hotel is the ONLY hotel in Miami where you have to call in advance to let them know you need an airport shuttle...THE ONLY ONE!!! every single other hotel picks you up at the airport..this shuttle DRIVE BY YOU when you're waving your arms and the security guards at the airport are trying to flag it down...of course getting there took about 2 hours.. the room itself was large, but there are SO MANY other hotels that for 100$ a night this one was a PIT! breakfast doesn't start until 7, so the complimentary breakfast wasn't ready before we had to leave..its about 30 min away from the airport, so hardly an AIRPORT hotel..and the only thing to eat around there is quiznos and pizza hut..TERRIBLE LOCATION!! please do yourself a favour and stay at the Wyndham (read my review for there) or somewhere else...If I had known what i'd get in this hotel, I wouldn't want to pay more than 50$ and i'd want to rent a car..even for 1 night!", "Date": "June 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good for a one night stopover”", "Author": "brady33", "ReviewID": "UR29118510", "Content": "We are a family of five who stayed for night after fying in from the UK. The main reason we chose this hotel was because we got a fairly reseasonable rate on the internet and they had an airport shuttle. I did try and contact the hotel via email twice to ask whether we could all stay in one room with a rollaway bed however, I did not get a reply and I has no choice but to book two rooms. We arrived in the evening and called the hotel on the airport phone and was told the bus would be there at 8.20pm. The bus eventually turned up at 8.50pm. which would not have been a problem in itself if we had been told it would be later as we could have got some drink/food. It would appear that there is only one bus an hour and if there is traffic (which there would appear to be at all times) the trip will take longer.. The other german couple who we picked up on route appeared to have waited even longer and they were definetely not happy. Anyway we eventually arrived at the hotel and booked into our two rooms which were nice and big. They appeared to have everything that we needed and I have no complaints regarding the room . There was a funny smell in the hallway, which I am still trying to decide what it was but at least it was not in the room. As the kids were hungry they called the pizza delivery companies (whose leaflets were pushed under the door) for some food as nobody could be bothered to go out to find a restaurant. Next morning we were all up very early and ate the buffet breakfast which was fine. The kids did not make use of the pool which looked nice as the morning was overcast. We therefore decided not to hang around as we had originally planned and decided to go early to pick up our car.. The shuttle bus left on time and took us back to the airport. I feel that this is a good quality, reasonable value hotel, which is good for a one night stopover. It appeared to be in the middle nowhere (I may be wrong here as I don't know the area) and a 25 min drive to the airport.", "Date": "May 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wisconsin", "Title": "“A very nice hotel with nice surroundings”", "Author": "icutgreens", "ReviewID": "UR26074020", "Content": "We stayed here for 1 night before we went on a cruise. Found this hotel while using Google Earth. It is located in a very nice neighborhood, so do not be afraid to walk to the nearby restaurants, grocery store, liquor store, or drug store. There is a strip mall about 2 blocks north of the hotel, where the liquor and grocery stores are located. Checking in was a breeze, and they even asked me if we needed a taxi the next morning to take us to the port. The rooms were very clean as were the hallways. They have a self-serve breakfast in the morning, that had milk, coffee, ceral, fruit, eggs, sausages, just to name a few. The only problems that we encountered were when we first called them (at 1PM) to have the shuttle come and get us, we were told that it would be there about 20 minutes. At 1:45PM, I called back, and was told it should be there in 10 minutes. I called again at 2:10PM and was told that he was stuck in an \"accident\" on the tollway and he should be there in another 20 minutes. He finally showed up at 2:30PM, and we were at the hotel in about 15 minutes. The next morning, the taxi was waiting for us at our scheduled time, and we were at the port in about 25 minutes, total cost for trip, $50.00 including tip. Since this hotel is about 5 miles west of the airport, there was no jet noise. I booked this hotel, in August, 2008. In November, I saw the price dropped $30, and when I called the hotel I had no trouble rebooking at the new price. In Jan., 2009, I saw another price drop, and this time, the hotel reservationist gave me a hard time, stating that I would have to take the chance to cancel my existing booking, and the try to rebook, and she could not guarantee me that I would get a room. F.Y.I. If by chance, you are going on a cruise, and are going to smuggle some alcohol onboard, and you go to the nearby liquor store, beware the some of the bottles are not a full 750ml. We bought a bottle of Captain and 2 bottles of Absolute, and the Absolute were only about 500ml, but we paid like we were getting 750ml bottles. So be aware.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Seattle WA", "Title": "“Not as close to the airport as it sounds but good value”", "Author": "vhoeven", "ReviewID": "UR25710013", "Content": "My friend booked this room for a quick night stay before our cruise. Our flight got in late so we wanted something close to the airport. The webpage said it was 5 miles from the airport. Well, it was a 25 minute drive to get there so just plan ahead for that. We thought we had reserved a 2 bed room. When we checked in the price was a lot lower than quoted, so we thought we just got a good deal. But it turns out we got a smaller room and they did not have any larger ones (like we had reserved available). It would have been nice if they said that when we checked in, instead of waiting for us to discover this fact. The room was clean and the bathroom fine. However, 3 of the 4 lightbulbs were burned out. Like I said, it was late so we just made due with it. THe sofa hide-a-bed took all three of us to pry from the couch. Once it was finally open, it slanted so much from a bent bar on the front that we had to prop up the bottom with a sofa cushion. Also, don't expect a bar or restaurant here. There is a GREAT Italian restaurant across the parking lot (called Ciabata or somtething like that). THe breakfast was actually very good, with lots of options that included fresh fruit, waffle bar, lots of cereals and other goodies.", "Date": "March 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newark, Delaware", "Title": "“Excellent Hotel--A five star rating”", "Author": "jillzee00", "ReviewID": "UR20851211", "Content": "The best hotel! The location is excellent and allows you to not only do the Miami residental area and city area, but also the beaches. The location is close to many attractions, malls and within driving distance to the beaches. The Dolphin Mall is right down the the road across from the International Mall. Going in the opposite direction you will pass a huge field with cows grazing! I belive the hotel is actually in Doral. It is not in a noisy location by any means, but very relaxing. The staff was very helpful and extremely friendly. I looked forward to seeing them every day and having a little friendly exchange. They were warm, friendly, polite and very helpful. The staff is bilingual at the desk and they take their time without rushing you. I had a great time as I would ask to learn some words in Spanish and they took the time to teach me! We had a few laughs, of course! The rooms are clean, big and kept beautifully. They provide shampoo, conditioner, lotion, shower caps--and a TON of towels--even a towel to step out of the shower with. We had enough towels to use for the pool even! The blow dryer was new and powerful. They provided a microwave, refrigerator, ice bucket, ice, iron, t.v., nintendo, phone, table with two chairs, sitting chair with ottoman, coffeepot with coffee--you name it. There wasn't anything I needed to ask for--they had it already there. The breakfast was very nice. Each morning it was a little different and they had both a combination of a hot breakfast and a contininental breakfast. There was always plenty of coffee, tea, and hot chocolate--even throughout the day. The pool was kept immaculate. There was a nice garden and plenty of seating--lounge chairs and tables with umbrellas. When you first came out into the pool area, there was even a covered veranda with a couple of tables there. In the evening, we sat in the lounge/breakfast area where we played cards and watched t.v. Since we were the only ones there at that time (in the eating area which was well lit and where you could play games at tables), we asked if we could watch our NasCar race and they were really kind and let us! I would definitely use this hotel again and wouldn't think of using any other. I really miss it and I have not even been home a day! It became our home away from home!", "Date": "October 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Be careful with your credit card!”", "Author": "BusinessTraveler65", "ReviewID": "UR16818370", "Content": "My credit card was charged even when my stay had been prepaid by my company. When I checked out, I made sure they did not charge my credit card, they told me everything was fine, but once I get home, I checked my statement and the charge was there.", "Date": "June 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Edmonton", "Title": "“Great accomodating stay!”", "Author": "ckachur", "ReviewID": "UR16805258", "Content": "We stayed overnight here on a trip home from Turks and Caicos. I was slightly hesitant at some of the reviews we read but thought it was a good deal by using our AMA points to book. Upon arrival at the airport the shuttle was there on time and the driver was very polite and a pleasure to deal with. We arrived at our hotel and check in was a breeze. The staff were friendly and as we arrived late also gave us brochures and suggestions as to where we could get dinner. Upon check out the next morning the breakfast was fine, waffles made to order, cereal the usual continental breakfast items, nothing over the top but it got you through the morning none the less. Staff was friendly upon check out and the use of the business centre was good. They could replace one computer and could have had more paper as needed, as I had to get some from the front desk but whatever they were great about it. Overall I would say the room was clean, sufficient and things went quite well so we couldn't complain at all. I would stay here again for an overnight stay if I had to. It's a ways away from things but if overnight is all your looking for then you get value here. Give it a try, I'm sure you won't be dissapointed. Carrie Edmonton, AB Canada", "Date": "June 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "sheffield", "Title": "“Its a airport hotel... Nothing more nothing less...”", "Author": "SUIUHTB", "ReviewID": "UR16413906", "Content": "Stayed here for a night during a recent vacation to the US and US Virgin Islands. We felt it was a fairly nice hotel but not somewhere you'd want to spend a lot of time in. We used it as a stopover to break up a flight from the UK and a onward flight to the US Virgin Islands. Clean comfortable with everything you would need for a single nights stay, Breakfast was excellent, nothing special but a decent way to start the day when you are heading out on a long onward flight. We also highly recommend \"Olivos\" restaurant across from the hotel...i never knew Argentinian steak houses could be this good!!!! Overall we would highly recommend the hotel for a night but possibly not anything else, its too far from Downtown or South Beach to make it anything other than a airport hotel.", "Date": "May 26, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Northern California", "Title": "“They need to run a tighter ship”", "Author": "BirdingIsFun", "ReviewID": "UR8357540", "Content": "I stayed at this hotel because it was reasonably priced and only 2 1/2 miles from the Dolphin Mall. When I checked in, the front desk staff couldn't tell me if the room I'd been assigned to was in the quiet location I'd requested, away from the elevator or ice machine, but they assured me they'd change it if I didn't like it. So, with all my luggage, I rode the slow elevator up 4 floors and discovered that one wall of the room was the wall of the elevator shaft, and then I rode back down and got a new room, and then I slowly rode back up... The staff was courteous, but clueless - they didn't seem to realize that it was poor customer service to make me, the guest, go through this exercise. Why don't they know where their own rooms are? The public areas of the hotel were sloppy - trash and newspapers lying about, an open office door behind the counter revealing a lot of clutter. This kind of thing makes one wonder how clean it all is. The room I ended up in was quite large, with a king bed and TV on one side and a sofa and desk on the other. You couldn't see the TV well from the sofa. This is a relatively new hotel, but the carpet was worn and patched. The mattress slanted downwards on one side - I had to sleep on the other side to feel that I wasn't rolling out of bed. The room was quiet enough and everything worked properly. The hotel would be a nicer place to stay if they ran a tighter ship and paid more attention to details. I would stay someplace else next time.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quakertown, PA", "Title": "“Good Location”", "Author": "Booch", "ReviewID": "UR7667609", "Content": "Stayed here after driving from Key West to catch an early flight the next morning out of Miami. (May 19 - 20) Booked a room with a king size bed and it was huge but the bathroom was tiny. Thought they could have given up a couple feet in the room to make the bathroom bigger. It had mini frig, sink, and microwave. The pool area was tiny but personally didn't matter for me or spouse as we were just there for the night to be close to the airport. The room was clean, staff was friendly and answer questions about how to get to the airport and some restaurants in the area. Near dolphin mall which has a ton of places to eat and shop if you want to get out of the room for a bit and get something to eat. It would have been easy to get to the airport but NW 41st Ave and La Juene rd (the area around the airport) is under major construction and when it rains it floods and we barely got the rental car through 3 ft of water. The signs for the rental return coming from the hotel were taken down due to all the construction and we passed it....the signs were up on the other side of the highway when we turned around. Aside from the hotel, it's a nightmare to return a rental car at the Miami airport right now. It was the worst experience we have ever had. The whole area is under construction!", "Date": "May 21, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "CancÃºn", "Title": "“loved it great staff”", "Author": "Esteph", "ReviewID": "UR7194986", "Content": "My family and I stayed there we went shopping it is great, near dolphin mall and there is a shuttle with a small fee to sawgrass mills, which I totally recommend it. The continental breakfats was excellente, eggs, bread, cereal, juices and coffes. The coffee is all day and since we went in january it was very cold so when we arrived each day at night a coffee is great, the staff excellent, and rooms clean and secure.", "Date": "March 20, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Atlanta, GA", "Title": "“not so great”", "Author": "JasAtl", "ReviewID": "UR3893751", "Content": "on the good side: check-in and check-out were very smooth; free airport shuttle; breakfast included (not overly impressive, but ok for a quick bite) on the bad side: the bed was very low quality - downright uncomfortable; not very close to the airport (they have a shuttle, but there are places closer); Best Western is a premium brand in Europe and Europeans are disgusted by the quality in the US", "Date": "September 11, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Stayed here twice-- both times great experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR3421865", "Content": "We stayed at this hotel twice, once in Janurary 2005, and once in April 2005. Both times, the hotel was clean, comfortable, and new-looking. Our only complaint (hardly worth making) was that the elevator was a little slow. It is not far (10 minute drive) from some good mid-class restaurants like Chili's, Doral Ale House, Applebee's, to relax and dine late after an evening flight to Miami. Back to the hotel -- our room was spacious and well-appointed. The hotel staff was very polite, and the free breakfast (I had waffles and sausage) was great. My only complaint about all hotels in this range (not just this hotel) is that the coffee is always very weak and barely overcomes the need for caffeine. (There is a Starbucks close by, however.)", "Date": "April 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "South Africa", "Title": "“Great airport hotel”", "Author": "vickam", "ReviewID": "UR3376676", "Content": "This hotel was fine for an overnight stay. It is miles from anywhere but perfectly clean and comfortable. They have a free airport shuttle service which was convenient, but we did have to wait quite a long time for collection. We were very impressed with the room amenities which included a fridge and microwave. The room was modern, clean, quiet and comfortable. Perfect if you just need a place to stay before a flight.", "Date": "April 19, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Raleigh, NC", "Title": "“Poor service, fair accomodations”", "Author": "A TripAdvisor Member", "ReviewID": "UR3240735", "Content": "We stayed here for one night while on vacation. The rooms were shabby, the mattresses were lumpy, and the climate control was noisy and didn't work well. We needed extra towels and blankets, and the front desk made us come downstairs and get them instead of bringing them up--which would have been fine, but it was after 10 p.m. and we were all ready for bed. They were also not very accomodating when we checked in, and seemed nonchalant at best. The continental breakfast was satisfactory. Overall, I would not recommend this hotel to anyone wanting a good night's sleep.", "Date": "March 2, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Washington, DC", "Title": "“Pretty Nice”", "Author": "A TripAdvisor Member", "ReviewID": "UR3173756", "Content": "We stayed here before a holiday cruise (December 2004). We arrived pretty late after a really had flight and I was pleasantly surprised. The hotel staff greeted us kindly and could tell that we were beat up from our trip and made sure that we comfortable. We were traveling with 3 children (2 young, 1 teenager). The room was very clean and it was actually a good size for an overnight trip. The decor in the room seemed to be up to date. The lobby was also very nice. It was nice for a quick stay at a Best Western. The staff was helpful in assisting us with ordering food for the children and the hotel offered free use of its business center which was helpful because I had some last minute arrangements to make regarding our trip. The next morning the hotel offered us free breakfast. It was cereal, muffins, fruit, etc. but it was decent especially when traveling with small, picky children. The morning staff was also quite helpful, directing us to a local shopping center for last minute cruise items. When we were ready to leave they helped us get a cab to our cruise ship. My only complaint is that the hotel referred us to the Best Western Miami Beach for our post cruise stay. THAT WAS A NOT A GOOD SUGGESTION (see my review of that location!!). Other than that, it is a good hotel to stay in if you are passing through Miami. I didn't see any real action in the area so if you do stay here for an extended period of time...Rent a car!", "Date": "February 9, 2005"}], "HotelInfo": {"Name": "BEST WESTERN PLUS Miami Airport West Inn & Suites", "HotelURL": "/ShowUserReviews-g34438-d80264-Reviews-BEST_WESTERN_PLUS_Miami_Airport_West_Inn_Suites-Miami_Florida.html", "Price": "$91 - $173*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3875 Northwest 107th Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33178</span></span> </span> </span> </address>", "HotelID": "80264", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5c/5c/5c5c4ea77917bb9d4a71a97215a1e31e5large.jpg"}}