{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Hidden gem”", "Author": "Irene N", "ReviewID": "UR120395827", "Content": "We visited Sydney for a friends wedding and were looking for somewhere that was centrally located, within walking distance to shops, restaurants and public transport and was self contained. This property ticked all those boxes. The staff were very friendly and went out of their way to ensure we had an enjoyable stay and give us pointers on places to visit as we were unfamiliar with Sydney. Rooms are modern and clean and although there was some street noise, we were expecting this, being the city. We will be returning.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Superb location, great value.”", "Author": "Jennifer M", "ReviewID": "UR120240473", "Content": "We stayed here when we first arrived in Sydney and booked it again for our return. It is superb Value for money, great location and very helpful and friendly staff. Our apartment was very clean and our bed made every day. The location makes it so easy to get to everywhere, 20 mins pleasant walk to The Opera House. Yes,on some occasions there was a lot of outside noise but this could happen anywhere, you're in a city! Noise happens! even in some 5 star hotels, I always travel with ear plugs! Our relatives came with us when we first arrived and couldn't believe how nice it was. It was great value for money and had everything we needed. Thanks Laura for staying late and waiting for us when our flight was late...you're a star..", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great experience”", "Author": "Alex M", "ReviewID": "UR118586129", "Content": "We stayed here for 7 nights in early September. We were attracted to the hotel because the rooms were self contained and we could prepare a quick meal if we felt like it. We were pleasantly surprised when we arrived and found our room to be spacious, light and modern. While there is street noise in the area we were expecting this being an inner city area. Overall we found the staff to be friendly and helpful and the housekeeping staff efficient happy to assist with any requests.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Annam accom/stay”", "Author": "Michtw13", "ReviewID": "UR104132123", "Content": "This is a very centrally based apartment which is conveniently located in the heart of Kings Cross and near to all amenties, Coles supermarket is practically on your doorstep, if you needed to stock up on anything, in this self catering apt, which i found to be regularly cleaned and towels where changed very regular to. Staff where extremely friendly & helpful. Yes at night you will experience the nightlife of bussling Kings Cross which is to be expected, however it was bearable. I liked the fact that the apts where easy access to all transport links taxis/buses/trains so was ideal, this was my first time in Oz and would happily return to this accom again, really pleased with overall location, cleanliness and friendly staff, hope to return back again one day.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Do not complain and live with it - this is Kings Cross”", "Author": "ice46200", "ReviewID": "UR98186089", "Content": "This is a good service apartment if you do not mind 24-hour of non-stop noise like drunk \"mates\", cars, police & ambulance sirens, bats etc... from the street even though windows are shut. Well... you can see the feedback on noise from others. Well... it is true. I will describe how it really is for those wondering between conflicting feedbacks. The window frames are a little loose and basically you are hearing the noise directly from the street. Just consider it as you are sleeping on street as far as noise concerned. But hey this is Kings Cross, the true center of night! If you are one of them (here to make noise), why would you complain about the noise from others. If you are looking for a peaceful nights, KIngs Cross is very wrong place to start with anyway. So, having all that said, hotel management takes your \"feedback\" with smile when you complain about the noise, and you will surely get some free ear plugs from them. To be fair, \"apartment features\" like the washing machine, kitchen, space... are OK. I would not call this a great service apartment compared to decent ones like Medina and Panthill, but if you got nothing else available for the time, just go for it with ear plugs. There are nice restaurants around the corner, too.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London (sojourning)", "Title": "“Sleepless in Sydney”", "Author": "SS_Aussie", "ReviewID": "UR98162945", "Content": "Really budget accommodation - just not worth it, find the extra $50 a night and stay somewhere decent! The place is horribly noisy, despite being put in a 'quieter' room. I mean, it's on a constantly noisy road and sounds as though the windows are open. Rooms - they're fine - plenty of space, decent enough bed, good enough kitchen etc Cleanliness - poor - someone's hairs through the bathroom (unpleasant) Location - it's really Kings Cross and, ultimately, a dodgy hole that noone should experience Cost - it's cheap - I mean, you probably get what you pay for but I wouldn't allow my cheap-as company to put me up in such a poor place again. Staff - nice enough but they know very little about the restaurants etc around the area. Don't do it.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Friendly staff and good value!”", "Author": "neilhop76", "ReviewID": "UR96513632", "Content": "Stayed at Annam for 2 weeks. Courteous and friendly staff. We were welcomed and made to feel very comfortable. The apartment was clean and well appointed. The apartments are situated close to Kings Cross - so there was some noise at night but nothing as bad as described in the other reviews! We travelled with our 15 month old daughter. Although the apartment is not specifically designed for children the management provided a good quality travel cot. The only problem was that, as the flat was a studio type flat, we had to be very quiet once our daughter had gone to bed - so the tv had to be kept on a low volume. I would heartily recommend!!", "Date": "February 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Darwin, Australia", "Title": "“Lovely room, friendly service, great value - just ask for earplugs”", "Author": "Mr_McNoob", "ReviewID": "UR89293768", "Content": "I only chose Annam apartments because for the period I was staying in Sydney for a conference (5 days), it was literally the last hotel left with a room in my allowed budget ($100 - $200 per night), and within walking distance of the CBD. After reading the other reviews on this site, I was not looking forward to my stay! However, my stay there was so pleasant and convenient that I wanted to write this (my first) tripadvisor review. Provided the rates continue to offer excellent value, it will probably be my first choice when I next visit Sydney. The Good - Rooms are pleasingly modern, well-appointed and furnished - The manager (Adam) was friendly, courteous, and accommodating - Pleasant 20min walk to the city - Great cafe ('Uliveto') around the corner (which I visited on Adam's recommendation) - Free, fast and flawless wi-fi, which was very much appreciated The Bad - The noise levels at certain times: road noise during peak times and in the evenings, and the shouts of revellers leaving nearby pubs late on Fri & Sat nights. However: After my first night, I asked for earplugs from reception, and the rest of my nights I slept very soundly. Honestly, I believe that wearing earplugs completely negates this 'bad' point. Overall: A hidden gem that many people will pass over because of the noise. Ask reception for earplugs, and you'll have a wonderful stay.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Noisy, apartments has defaults, rude staff”", "Author": "sydneycbd333", "ReviewID": "UR87943918", "Content": "Firstly its soo loud you can hear everything down the street, its horrible my partner didnt sleep at all I got sleep but was cranky and very unsettled the whole time I was there. The lights kept breaking every day we had showers in the dark. The next morning the toaster was broken. The maintenance guy walked in and let himself in the room while I was still there alone. I called the front desk to let them know the problem is the whole switch board as the kettle wouldn't work either. I asked if I could move into another room and he said no chance and the only option was to check out.. without any apologies for the ongoing issues ( I even bought my own light globes to fix the bathroom after the emergency line wasn't answered at night when it broke) I was treated with no respect and called 'darling' and it seemed it was a hassle for them to have me stay the whole week when really it was a hassle for me to deal with the ongoing issues of the apartment and disgraceful management. I am appalled by the conditions and the staff even the management was rude and unhelpful. It is a scam and a joke. Do not stay here.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Stay here if they give you a high floor and a good discount!”", "Author": "wasimmehr", "ReviewID": "UR87456296", "Content": "The quality of the rooms is decent and even the studio that I stayed in was pretty spacious. Basic amenities are included. The only concern as mentioned by other travelers is that the hotel is located at a very busy crossroads and does not seem to have any sound insulation. As a result, when someone walks past and is speaking it seems as if you are next to them downstairs rather than in your room. The traffic noise is pretty disturbing as well. I wouls suggest taking this room if you get at least a 30% discount off their advertised price and can prenegotiate a higher floor, at least 3rd floor. Also, for some reason it took me over an hour to get a taxi! Internet quality was poor.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "All over Australia", "Title": "“Cool and comfortable”", "Author": "Ecrad", "ReviewID": "UR53805794", "Content": "I found these apartments online on a discount site, and picked up a cheap deal to stay for a week. At the discount rate, I feel as though I got a great bargain and have no complaints. Having lived in Sydney before, I was aware that Potts Point *IS* Kings Cross, so I was aware I would be staying in the middle of a busy area. My spacious studio was on the top (5th?) floor, and I had no trouble whatsoever with noise. I have stayed at far noisier and more expensive hotels in Sydney. In fact, given the location, one block behind \"the Coke sign\", I felt that it was relatively quiet. There is a great cafe around the corner for breakfast, and KC station is about 3 minutes walk away. Given that I had commitments in both directions (in Sydney's beaches, the CBD and in the inner west) this proved to be the perfect location for me. Unlike previous reviewers, I found the wireless internet to be faultless and an appreciated free service. Kitchen facilities were great and well appointed although seldom used by me. Bathroom was equally good and the washing machine much appreciated. The staff were friendly and helpful, without being intrusive. If I could pick up a cheap deal again I would definitely stay here. I would probably request to have a room on one of the higher floors again.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Brisbane", "Title": "“Beautiful, cheap and convenient, pity about the noise!”", "Author": "AJB1976", "ReviewID": "UR29683654", "Content": "I had read the reviews on this site before staying at Annam Apartments, so I thought I was prepared for how noisy the room was. I was wrong! I stayed on a Saturday and a Sunday night. The Sunday was fine, no problems at all. Saturday night it was almost impossible to sleep before about 4am due to the constant stream of drunk and very loud revelers from Kings Cross walking past. Having said that, the rest of the room was amazing for the price, including an in room washer/dryer, bath robes and very comfortable and large bed. Being so close to public transport and the city made this even better. Perhaps plan a mid-week trip and you'll be set! Don't stay here on a weekend if you plan to sleep.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Good for Holiday not for Business/Relo.”", "Author": "Sean_Owens", "ReviewID": "UR22416444", "Content": "I stayed here for 3 weeks, while on business in Sydney. The Apartments are in a good location, quite close to Public Transportation, and a $15AUD taxi ride to CBD. I stayed in a 1 Bedroom apartment on the 4th floor. I believe they have bedroom suites, 1 bedroom and 2 bedroom apartments. Not much of a view, but amenities included Flat Screen LCD tv, Cable, and phone. Wifi is available, but I received extremely poor reception in my room, which did not improve during my stay, after several discussions with the front desk crew. If your in town on business, and work in the evenings, such as I, I wouldn't recommend this apartment building. However, if they improve the Internet connectivity/access, I'd recommend for the business travelor and change my rating to an 8 or 9. If I was in town on Holiday, and had no need for Internet, it's good to go. Location is just north of Kings Cross, which is always hopping, and noted as the debaucherous area of Sydney. The Kitchen area is okay, offers a Collegiate style fridge, and electric stove top, no oven. The premises are quiet, and the front desk staff are attentive. Daily maid service, Overall I'd rate it, a 7 out of 10.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Melbourne, Victoria", "Title": "“H...E...L...P”", "Author": "lipglossandchaos", "ReviewID": "UR19757372", "Content": "I am currently still staying at the Annam in Potts Point. Firstly, it's not actually Potts Point but technically Kings Cross. The area is dodgy if you travel alone I really don't recommend it. Reception won't take debit cards, credit only. And she tried to demand a $1000 charge off our cards each that would be \"refunded at end of stay\" yeah right. The receptionist was rude and her behaviour was downright disgusting - she treated us poorly from the moment there was a problem with us only have debit rather than credit cards even though we paid upfront. The bed sheets are scratchy and the pillows are like little lumps of cotton wool. The rooms are NOTHING like the photos on the website. The internet connection doesn't work. Buzzers from the intercom in rooms are disabled so you need to go downstairs to let your guests in and the reception is VERY inqusitive - she has asked both my friends who they are visiting and their full names - even though it's a 'serviced apartment' not a posh hotel and I believe thats not her business. The 'balconys' are 3 inches big.... you can't actually stand out on them. The doors don't shut properly and windows don't shut properly either so noise and cold comes through constantly. My room has a dodgy hallway thing that has a cupboard and creeps me out like someone is hiding down in the end of my room and the wind bangs against it constantly waking me up. I will NEVER stay here again. I have paid a $200 deposit and my stay in full for the next 3 days and I am afraid I'm just going to have to leave and not get anything back as I cannot stay in a place like this ever again. I'm missing home and a clean bed terribly. Do not stay here - the price is NOTHING at all worth what you are getting... I'm certain that for what we paid we could have gotten much better as I previously have stayed at Vibe, Grace, etc etc and loved it for the costs. Bad recommendation from a friend and I wish I checked here first.", "Date": "September 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "canada", "Title": "“Too much noisy”", "Author": "sleeper83", "ReviewID": "UR15623153", "Content": "-Very noisy and worst at night when people get out of the bars. Windows are bad and let the noise enter the room. Like if you sleep directly on the street. Bring earplugs if you want to rest a little. Don't worth the price cause of this problem. -Fine for the rest.", "Date": "May 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“Very noisy, poor parking and internet service”", "Author": "dashyou", "ReviewID": "UR15140069", "Content": "I should have taken previous reviews to heart, but was swayed by the promise of free internet and parking. However, the internet was sporadic at best, disconnecting every few minutes. And the \"car stacker\" is so poorly implemented that an alleged 12 parking stalls really only allows for 3 or 4 cars at best. As well, the suite was extremely noisy from traffic from about 6am until 1am or 2am on weeknights. Staff seemed unconcerned about these issues, and were unable or unwilling to resolve any of them. A very disappointing stay.", "Date": "April 19, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Nice apartment - good location. Not bad at this price - some issues.”", "Author": "pommie01", "ReviewID": "UR13561998", "Content": "I have stayed at another Annam Suites place in Sydney before - so I knew what I was up for/against. At least this place had a 24 hour checkin desk - but it was all a little amateur, in a totally unairconditioned room, and run by german backpackers (that's a good thing BTW!). I found that I could book this place for $190 per on needitnow even when the rest of Sydney was fully booked. The location is pretty close the the \"action\" centre of Kings Cross, 2 or 3 blocks from the railway station - so everything is pretty close. These are very modern, very well equipped one bedroom apartments, with full kitchens, washing machines etc. All brand new. The bed was very comfortable, bt very hard to control the temperature in the bedroom. TV very good - 32inch LCD HD - nice but a weird combination of channels. There is a hifi system too. There is a nice enclosed balcony with a day bed in there - would have been nice of I'd been here during the day. Really - not bad for the price and location. Apartment was well decorated - probably more to an asian taste. But quite well done. Some problems: - As per the other Annam suites place - they skimp on the aircon.While this place did have a split system. It appeared to be very old, and totally inadequate on a steamy sydney day. The bedroom was still very hot even after the aircon had been left on all day. - While there was a washing machine/dryer thing. There was no iron and ironing board. Where is the logic in that ? - The shower was not good. The hot water is very spotty - so sometimes you are boiling and other times you are freezing cold. - The dishwasher had a fault - and at some point in the day had spewed water onto the livingroom carpet. \"Oh yeah sorry about that sir, but this was our last room\".", "Date": "February 15, 2008"}], "HotelInfo": {"Name": "Annam Apartments", "HotelURL": "/ShowUserReviews-g255060-d804678-Reviews-Annam_Apartments-Sydney_New_South_Wales.html", "Price": "$160 - $233*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">21 Ward Avenue, Potts Point</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2011</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "804678", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a3/50/a35031b0cfea4624ff8234a68c873b5e1large.jpg"}}