{"Reviews": [{"Content": "Fine, close to attractions, but needs some TLC We stayed at this hotel for one night. My friend and i were headed to a conference and we decided to get there a day early so we wanted central accommodations. This place was good for $59.00. It is about 2-3 blocks from Union square to the east of Union Square. There is a Starbucks two doors down to the left and a Jack in the Box two doors to the right, a theater in front of the hotel and some great Chinese restaurants next door, along wth Colibr铆 Restaurant also next door, but it seemed a bit to pricey for Mexican food.The hotel is tiny, but everything works well. We checked in quickly and they were nice. When we got off of the elevator, there was a smell of the Chinese place next door, but our room didn't smell. The bathroom had a faint smell of having been cleaned with a dirty washcloth (that was the best description we could find for the smell), but it was clean. Truthfully, the hotel rooms need a good painting, but we did NOT experience any bugs. I'm big on checking the mattresses for bed bugs, etc, but there were thankfully NO issues.The only thing that I disliked was the ceiling which needs repair. When I was working on the desk in the corner of the room, a tiny piece of drywall fell on my head. No biggie, but there is water damage.Overall, if you're going to San Francisco to see the sites and want something cheap in the center of town, this is a great option. My friend and I agreed that we would stay there again if we didn't care about any luxury. Closest BART/station was on Powell about four blocks away.By the way, the next night we moved to the MArriott on 4th and Market, and paid a reduced rate (which was truly a bargain for SF accommodations) of $130, so, in comparison, the Union Square is a bargain for the place.Finally, because this is downtown SF, you WILL see many beggars on the street. Just keep your distance, don't be rude, and they'll leave you alone.", "Date": "Jan 3, 2009", "ReviewID": "UR953781087", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "shell_217"}, {"Content": "Great location but the rest is not great If you're in a town like San Francisco you are out all day and you just need a central room to spend the night. In that respect, this hotel is a good deal.Pro: great location, good priceContra: the cockroaches in our room...", "Date": "Nov 2, 2008", "ReviewID": "UR148145106", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "TravelgirlHamburg"}, {"Content": "Needs a ton of work - Caution Advised A pretty ordinary hotel. I am used to staying in budget accommodation - especially on a weak dollar - but this was pretty ordinary even by those standards. Room was clean and the blokes on the front desk for the early morning shift and the night shift were pretty friendly and helpful. That is about the best that can be said. The day shift front desk bloke was unhelpful. Seemed more interested in his iPod than attending to guests. Room was incredibly noisy - so much so that I had to brave the San Francisco beggars and run up to the pharmacy at midnight to buy earplugs. The room had no remote for the TV and no alarm clock. The hot water was temperamental at best and there is no air conditioning. There is no room directory, the phones have no little sticker on them to assist you with dialing out or room-to-room, so I had to run down to a pay phone on occasions. Needs more than a lick of paint and the elevator is so slow that it's quicker to take the stairs! Dodgy locks on doors. Will take considerable work to get it up to acceptable - even complimentary ear plugs for the rooms facing Geary Street would be a start! I'm sure they can be bought in bulk...Definitely would not take a family there. Okay for young single people.", "Date": "Oct 27, 2008", "ReviewID": "UR305043728", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "Bruiser101"}, {"Content": "Exactly what we wanted....and expected!! If you are in San Francisco to be a traveller and see what the city- not just another hotel room- has to offer, look past the worn carpet and the walls that need a coat of paint!! My boyfriend and I just had a great 6-night stay in the epicenter of San Fran activity - so convenient to all forms of public transportation as well as within walking distance of everything! It IS an older hotel, but we chose to see the charm in that. The elevator was out of commission for an overnight, but was quickly back in order the next day. That was the only issue during our stay. Our room was clean, comfortable and quiet; all that we were looking for in a place to sleep. Walgreen's is a block away to purchase shampoo, conditioner, lotion, etc. Starbucks is next door for those of us concerned with immediate caffeine intake in the morning. For under $90 a night, it allowed us to spend A LOT more money on the fun things! We would absolutely stay there again.", "Date": "Oct 20, 2008", "ReviewID": "UR271490969", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "KDeer"}, {"Content": "Great price/value I was in hotel for 3 nights and You got what You paid except the location. Location is great and our room was on the side that was quiet whole night. Hotel is great for young people who want to spend just a night to sleep. In front of hotel are many stores, open 24/7. Rooms are not too great but thay are clean. If you want to explore the city (or something) and be all day outside the hotel, just to came to sleep is't great deal.", "Date": "Oct 18, 2008", "ReviewID": "UR941529237", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "SerZeljko"}, {"Content": "Great location for price. For the price this hotel was fine. We had read the reviews and therefore expected the rather tired level of decoration. The room itself was probably better than the communal areas. The location was excellent. At the end of the day you get what you pay for and I would recommend it as a place to stay to people who just want a convenient and value for money place to sleep.", "Date": "Oct 15, 2008", "ReviewID": "UR416811007", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "EnnaH"}, {"Content": "GREAT LOCATION ok the hotel is not the ritz, but for what we paid, we had an excellent stay. even met the owner nice chap! the hotel is located in an excellent location and the staff are extremeley helpfull. dexter being one of them. the hotel does look worn, but as i said for what we paid it was fine.", "Date": "Sep 30, 2008", "ReviewID": "UR822052269", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "ajx"}, {"Content": "What do you expect for the price? Booked this online the night before we arrived in SF while passing through. $90 inc tax for the night but a few yards from Union Square, so we hardly expected the Ritz. More like a hostel than a hotel really, though the bed (small) was quite comfortable. A couple of cockroaches paid a visit to us in the shower in the morning and rather let the side down, though they did appear quite friendly. Car parking is at an underground and rather dodgy garage a few blocks away - the hotel said the rate was $20 overnight but strangely we were charged $25 and they expected a tip (in vain!).You think the car is being parked there, but in fact it is driven to a lot elsewhere in town, as we caught them out. Central location for hotel but rundown area rife with assertive beggars - my wife waiting with our luggage outside the hotel was hassled/propositioned 5 times in the 15 minutes it took to retrieve the car from the garage, and had to take refuge back inside. Sad really as SF on our last trip a few years ago was so great. This was the low point of a long tour of the States this summer.", "Date": "Sep 18, 2008", "ReviewID": "UR615742771", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "2", "Rooms": "3", "Location": "2"}, "Author": "Junius"}, {"Content": "Don't Bother I do not recommend this hotel. The room was SO loud. There was a garbage truck dumping below our window all night. They messed up our reservation. Something bit my boyfriend ALL OVER, leaving him with bites all over his body. The rooms were tiny and beds were not comfortable. Don't even bother paying the money, it is not worth it!", "Date": "Sep 17, 2008", "ReviewID": "UR735910043", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "mdavitak"}, {"Content": "Great price but needs a lick of paint For $80 per night one block from union square this is a bargain. Any other hotel charges atleast $120 from my hours spent esearching online. The hotel is very conveniently located. We were a bit wary walking down the corridors as the carpet looked in dire need of replacing. The room itself was clean and had a tv that worked fine. I wouldn't recomend turning right out of the hotel and walking more than a couple of blocks as it gets quite rough very quickly in that direction however walk the other way you are right in the centre of san francisco and near a lot of major bus routes. The staff on front desk although not the most chatty were very freindly and helpful. If your looking for a cheap night in a hotel in the middle of san francisco this is perfect just don't expect it to be the Hilton!", "Date": "Sep 6, 2008", "ReviewID": "UR756708290", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ctg85"}, {"Content": "Not worth ruining your holiday for! We travelled around America and had no hotel problems until this one. We are pretty hardened travellers but this was rough!Very poor customer service. Fire alarm ripped off the wall, noisy pipes running through our room, no remote for T.V (smaller issue but irritated us that they didn't care!). When we complained about fire alarm he told us not to smoke in room - very indifferent attitude. He refused to move us into one of the empty rooms. The pipes kept us awake most of the night and therefore, we were tired during the day. Not worth ruining your holiday by staying here - trust us!", "Date": "Aug 30, 2008", "ReviewID": "UR766372489", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "BritTravellerEngland"}, {"Content": "Okay for the price       Room at Union square plaza hotel", "Date": "Aug 10, 2008", "ReviewID": "UR143157055", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "Elver_8"}, {"Content": "Never again! This is the worst place I ever have stayed in. There was no air conditioning and the window opened up to an alley that was used for trash, to say nothing of myriad homeless doing their business, etc. The shower did not work and the deadbolt did not lock. The TV was a Panasonic and the remote was for a Zenith! The one thing I will say is that the bed was comfortable (although I admit I was hesitant to get in there) and except for the constant noise in the alley below, I managed to get a few good hours of sleep. If some care would be taken, this could be a very nice place, or at least neutral/average. I would not recommend staying there - you get what you pay for. By the way - the front desk was of no assistance at all (commenting on a previous entry), although they certainly were friendly.", "Date": "Jul 10, 2008", "ReviewID": "UR349052431", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "pider1"}, {"Content": "Upgrade rating, please Thanks a lot to people workin' there, very kind and helpful.Helping me by keeping luggage after check out, till late at night, waiting for my flight back to Italy. Great location, very close to Bart's Station @ Powell  Union Square for buses  cable carsSafe neighborhood, even if you're travelling by yourself as I did. The main door it's locked at night and ther's always someone at reception.No frills, but rooms cleaned every morning or afternoon if you'd like to sleep a little bit more. To have breakfast there's a starbucks three doors on the right.I've been there twice at the beginning and at the end of my california trip and the only risk is if it becomes more expensive.Great value.I'll be back for sure.", "Date": "Jul 2, 2008", "ReviewID": "UR528731072", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "NathanZuckerman"}, {"Content": "If you are as clueless as I was and in \"zeit not\" I had very little time and not much money to organize a memorable trip to SF for me and my parents (not from US) - and I knew nothing about SF and had no experience with organizing trips. I went nuts reading mixed reviews on hotels and safe/unsafe areas until I was forced to book something immediately for there were only a few hotels left with rooms available - I booked a room at USPH because it is very near Union Square, because they were cheep and they offered not more or less than what we needed in a room ( two beds and a private bathroom - we were visiting the city, not the hotel room) and because they were the only people that didn't try to make me book another room for myself or pay extra for a third person in a 2bed room (odd number travel groups are discriminated big time :-)LOCATION:The hotel is on a perfect location (for tourists that care about, both, shopping and site seeing). If you go just a block farther away from Union Square, you are getting too close to Tenderloin area which I wouldn't call dangerous but not a pleasant area to have to walk through either, especially with kids or elderly people.Union Square is a couple of minutes walk from the hotel and that's where all the stores are (and the entrance to China Town). There are bunch of breakfast places around and you'll be on a perfect start point to walk to the places you should definitely walk to/through/around or take a ride to the places you鈥檒l have to take a ride to anyway.If you don't care about shopping, still try to find a place east of Van Ness (even Hyde) and north of Geary, excluding Tenderloin - the Union Square area is very shopppingtouristy but other areas are too residential to me. If you really hate touristy avoid Fisherman's Wharf like plague. And one more thing about locations: I don't think you should avoid hotels on Market Street if you find a good deal - that street seems to be dividing fancy from sketchy, but it is still half-fancy and steps away from completely fancy.HOTEL:The hotel itself is ridiculously worn out. Yet, the room was surprisingly decent: it didn't smell like a garden in bloom, the windows have never-ever been cleaned, but the bathroom was clean and I didn't see any insects or stains on sheets and towels (honestly, I didn't search for them either, but I didn't see any). To cut the long story short, I was not afraid I was going to get a disease from a little dust on the joinery. The rooms have no AC (July/August???). It is also very noisy (it is down town), but we were so tired from walking that it didn't bother us at all.The hotel stuff is rather strange - they were not unpleasant but they are not professionals either, kind of like locals that you ask for direction on the street, very casual :-)If you organize months in advance (unlike me) you could find a cute bb or a nicer hotel for the same or a little more money and in a nice city area. If no, this hotel should do fine.In conclusion, my clueless fellow travelers - BOOK WAY IN ADVANCE, STICK TO THE UNION SQUARE AREA IF POSSIBLE (even if you are an anti-touristy adventurer), don't be afraid of this hotel and ENJOY SAN FRANCISCO!!!", "Date": "Jun 25, 2008", "ReviewID": "UR823561299", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "RubyRemorker"}, {"Content": "Very convenient, friendly staff, basic amenities I stayed at the hotel whil attending a conference. As a student, I wanted something cheap but convenient. The Union Square Plaza was perfect for that. Okay, I did not have a woderful view, but it was quiet, the room was bright and big and even though the hotel does need some renovations, still it was clean. The great shops of Union Square are 5 minutes away, the subway, the trams, the buses within 2 minutes walk. It was extremely easy just to get anywhere and the ocean about 15 minutes walk away!There is no restaurant in the hotel but who cares? So many great places to chose from just around the hotel. The theatre accross the road is great too if you fancy a night of culture and all the galleries and antique shops are nearby.The staff were very friendly. On my check-out day my flight was in the evening and they let me keep the room with No extra charge till I needed to leave for the report.Great, eh? Which big, chain hotel would let you do that?I cannot wait to go to SF again and stay at the Union Sqaure Plaza!", "Date": "Jun 23, 2008", "ReviewID": "UR927704405", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "ailLondon15"}, {"Content": "Needs some TLC I wouldn't stay here again. First room was totally inadequate for 4 adults and a change had to be made at our insistence. Windows absolutely grotty inside and out. So noisy we got no sleep. hallways stunk and the carpets threadbare and dirty. Room itself was comfortable. Great location though to Union Square and transport to Fishermans wharf.", "Date": "Jun 18, 2008", "ReviewID": "UR719537603", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "-1", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "Cinders27"}, {"Content": "Give this hotel a break, part 2!       Our nice room", "Date": "Jun 10, 2008", "ReviewID": "UR530274464", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "fashion_victim409"}, {"Content": "Cheap but not worth it The hotel was cheap. The bed and bathroom were clean and the floor clean.However, the decoration of the hotel was poor (it looked like it was prepared for painting months ago, but no work done on it), and other parts of the room (ledges, window etc) were covered in dust. I would not stay there again. I would find somewhere else and pay more if necessary.", "Date": "May 19, 2008", "ReviewID": "UR697228282", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "GRKLuton"}, {"Content": "good location we arrived at the hotel late at night after wandering the wrong way from powell st. BART and walking through the tenderloin....avoid this area!!! easy check-in and the room was big, on the front overlooking the two theatres opposite. it was a bit noisy (traffic , sirens, loud people etc.) but this didn't bother us. the staff were very friendly and helped us with maps  directions. the room was very clean and the maids were in daily. the bathroom was adequate and we had a tv with quite a few channels. locationwise , for us it was brilliant, a few yards away from union square, shops/theatres/restaurants/pubs/cable cars etc. the price was excellent for our 11 day stay. overall we had no problems and would stay here again.", "Date": "Apr 27, 2008", "ReviewID": "UR671188050", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "tomthecat"}, {"Content": "Give this hotel a break! My partner and I have just spent 2 weeks in SF and we stayed at this hotel. No Ritz we would admit. But if you want a clean basic room at an almost unbeatable price this hotel will not let you down.The other two main points about this hotel are its friendly staff and location.Ignore the petty complaints by others, they, I bet had paid as much as we did! Save your money and stay at this hotel, leaving you to spalsh the cash all over this great city!John and Havard", "Date": "Mar 30, 2008", "ReviewID": "UR257235297", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "CheekyMonkey1971"}, {"Content": "Hot, Noisy, but Cheap       Hallway", "Date": "Feb 19, 2008", "ReviewID": "UR967901154", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "3"}, "Author": "jenmito"}, {"Content": "You Get What You Pay For I decided to take a long weekend trip for my birthday to San Francisco since I had never been there before. I found a great deal for this hotel and read from other reviews that it was a nice clean hotel and great for the price. That was not the case. This place was extremely filthy, noisy and not so safe of an area. When I first walked into my room, I was greeted a roach! The only good thing that I can say is that the front desk staff were amazing. They tried to help as best as they could by giving me a different room, the only problem was that the room faced a parking garage and a dumpster that had to be emptied every other day at about 5 am! Next time I go I will spend the extra money to guarantee that I'm staying someplace that I know I'm going to be comfortable.", "Date": "Jan 31, 2008", "ReviewID": "UR438025713", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "melisan626"}, {"Content": "great location This hotel is in a great location near Union Square. Although the rooms are quite dated the place is clean and reasonably priced.Well worth a visit if you need cheap accomodation right in the heart of San Francisco within walking distance of Trolley cars and MACYS.", "Date": "Nov 1, 2007", "ReviewID": "UR711008481", "Ratings": {"Service": "-1", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "tMCL"}, {"Content": "Honeymoon from hell We new we were booking a budget hotel but didn鈥檛 expect what we got. We have stayed in Hostels all over the world and this Hotel made the hostels seem like palaces. I have read the other reviews and can let you know, the closeness to the Bart  Muni is exaggerated. But Union Square is right on your doorstep. So if all you want to do is shop, this is the right area to stay.We were met by 3 different concierges, 2 off which were rude; the third a man was the only thing we liked about our Stay in San Francisco. He had afternoon shift and was there till 11pm at night. He was very helpful, upbeat and pleasant.The room we were put in was filthy and the windows are black with dust and soot. The ceiling had a huge hole in it. Cause no doubt by the rusty looking damp patch that surrounded it. The carpets looked like they were moving they were so badly faded and they smelt rotten. The bath room was the same and in serious need of disinfection. The walls  roof are rotten and yellow  rusty with damp ant it smelled like an overfull men鈥檚 urinal, even after house keeping had been. The Curran theatre is directly across the road and various Art Galleries in the same block as the hotel but directly next to the hotel is a pizza place a Chinese and A burger place and a Mexican Restaurant. If you think this is a good thing your wrong as you are constantly harassed by the homeless sitting  sleeping in the doorways. We were even chased into the hotel lobby by a couple trying to pry the food from our hands. The noise at night from the traffic makes the entire room vibrate the windows rattles like they might fall out. The late night parties with music and people singing on the streets were like having a mobile disco in bed with you all night long. The restaurants throw there bottles  rubbish out at 2am every morning and the bin men empty the bins every morning at 5am. The noise from both of these is also deafening. So you are sure you will get no sleep. And since The homeless people are so plentiful in this area around the hotel you dare not stay out to late we never felt safe.So in conclusion, we felt like this hotel was the same as a filthy, prison and we were Stupid enough to pay far to much for it.", "Date": "Aug 9, 2007", "ReviewID": "UR729584801", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "ClareZiggy"}, {"Content": "Loved this hotel This hotel was booked on a budget but it was the best hotel we have ever stayed in. It was located right next to cable cars, MUNI  BART station, shopping, restaurants and nightlife. Staff were very welcoming and helpful, maid service every day, rooms big and spacious with hairdryer, iron, shower, telephone and queen size bed. Everything was fantastic and we would recommend this hotel and indeed San Francisco to everyone - a very unique experience.", "Date": "Jul 23, 2007", "ReviewID": "UR922404374", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "susbar"}, {"Content": "The thing I remember.... The thing I remember most about this hotel is the lasting smell. Upon returning home and opening my case, the smell of the hotel room wafted out and up into my nostrils. Ugh! Having said that, if you are looking for a cheap no frills hotel, this place is okay. A large room with clean bathroom and a TV that worked, although furnishings a little shabby. The room was made up and cleaned every day. At night it was quiet in the halls, although I do recall the bins in the lane below being collected at one point. Fortunately, my mattress didn't have the plastic covering referred to elsewhere here, but a friend encountered that in their room. The location of the hotel is excellent, not far from Powell Street and Union Square. People on the desk were friendly and helpful.", "Date": "Jan 11, 2007", "ReviewID": "UR564019049", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "RJT"}, {"Content": "Spend most of your time out of the room ! This hotel has a great location, it's so easy to get to the Powell cable car line and Market street for the BART and Muni. We felt safe walking around at night not too many beggars, but if you go towards Japantown or the Civic centre that all changes. The room was old, hot  a little smelly but not unbearable considering we didn't spend much time in the room. Poor water pressure in the shower, small towels and the hair dryer was a waste of time. The first night we stayed on the Geary st side of the hotel, which was a bigger room with a wardrobe but the street noise was too much to get a good night rest so we moved to the other side of the building. This was much quieter, but a smaller room with only a view of the alley. The staff were OK, they didn't go out of their way, but did all that was required of them. We overheard a couple of the front desk staff rubishing the hotel one night and calling it a dive, so that doesn't give you a lot of confidence in the place. For a cheap place to crash in a great location this would be fine, but we will be spending the extra $$ next time for somewhere else.", "Date": "Oct 15, 2006", "ReviewID": "UR802926306", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "5"}, "Author": "Dingo_Starbucks"}, {"Content": "Seedy but good location I stayed at the Union Square Plaza for a fun trip with friends and because we were not in our rooms too often, it was fine. It did not ruin the trip, but it was SEEDY. I would never stay there again. My friend had bed bugs. She woke up with mysterious bites everyday. My room was a tiny single overlooking an ugly alley in the back of the hotel. The light was dim and depressing. Room smelled musty and was not cleaned well; pretty dusty. TVs could be heard blaring throughout the night. The walls are paper thin. Creepy to see some worn-down looking people roaming the halls that might have lived there? A few of them looked homeless. We loved San Fran- but this place was more like a hostel. The only good thing was consistent hot water in a new bathroom. And don't get me wrong- this place COULD be charming in the European sense. But it is NOT, by any means. Sad and seedy was how I felt about it during my stay. It totally lacks charm and warmth. It could be cool if they redid the awful rugs, updated the lighting, replaced the delapitated, broken furniture, cleaned the haphazard stains everywhere, and fixed the peeling paint. AND- I thought the guys at the front desk were very ODD, I don't know why anyone is raving about them. I've stayed in some very low budget b  b's, hotels, and hostels all over Europe and am not a snob when it comes to hotels - and this WAS a great price for that area. That being said, this place was one of the worst places I've ever stayed in. I will never stay at the Union Square Plaza again...Pay a little more if you can and stay somewhere decent.", "Date": "Oct 9, 2006", "ReviewID": "UR729103168", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "Facci"}, {"Content": "Great Value Good Location-just a few minuites walk form the BART Powell St. station, easily accessable from the airport.Large room- at first i thought rooms are small because of the price, but actually much larger than expected.Friendly staff- I have stayed at many economy class hotels,and some people are really rude. But here, they are nice.Surely you get what you pay for, but considering the locationand the price, this is a great place to stay.", "Date": "Sep 29, 2006", "ReviewID": "UR804395260", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "darsheep"}, {"Content": "What a Shame... Well the saying is certainly true you get what you pay for and we absolutely found that to be true at the Union Square Plaza Hotel at $79 dollars a night in this very sought after very expensive SF district. I knew it wasn't a boutique hotel or anything close to that but I thought it would be crust free. We (my hubby and I) were in SF for 4 nights, had reservations to stay 3 at the USPH, we decided to stay an extra night but at a different hotel the last night , couldn't take the grim anymore. It's such a shame too cause the front desk staff and location is so wonderful. But if you want an overall more pleasant experience you'll search for a little nicer hotel in this area. I know I know I said the same thing We won't be spending very much time in our room, there's so much to do in San Fran and we can save money for other things if we get a cheaper room. But you do want a clean room right? Shabby but clean would be just fine right? I'm just going to say it, this was the dirtiest hotel i've ever stayed in and i'm no snob i'm not snooty,fussy or a high maintainance traveler and I'm certainly no neat freak at all ( for me to complain you know it was pretty bad hahhahahahah!) but our room was covered in filth and crust. from the floor to ceiling on the walls and counters. ewwwwwww! I am young and I don't mind staying at 1 to 2 star hotels. I mean that's usually how we travel. but my gosh this place forgot to do it's spring/autumn/winter/summer cleaning. It was hot. So hot we had to go buy a small fan from Walgreens. I asked for a fan but they said we have already given out all of our fans, we even had to go buy a few more. Well la dee da for the guests that beat us to it, but it didn't change the fact that we were sweltering. Yes sweltering in San Fran. I have proof!! and they have no fans or air conditionion in their darn rooms and we had a street front room I pity the folks who had an alley room.....Ewwww I have to say it again their rooms were dank nasty!!! Shabby we can handle, rundown and just old looking we can take, but grimmy and dirty and hot was too much to bare. 30 minutes with a sponge and some windex, bleach and a fan is what that room needed and I would have been fine. We still had an awesome, wicked, rip roaring time in SF, SF is a wonderful city. It was so filthy it was comical to us after a while( sounds kinda gross but we didn't wanna hassle with cancel fees and finding a new place and packing our stuff up so we just dealt with it). So do yourself a favor and stay at a nicer hotel. not a foofy expensive one but at least a clean one. Well I must say again the front desk staff was very helpful and kind, so kind I almost feel bad writing a bad review., but not bad enough cause their cleaning crew needs to be replaced or payed more to do a better job or something. So whether or not you choose to heed my warning or not, travel safe and don't let the dust mites bite.", "Date": "Sep 29, 2006", "ReviewID": "UR907660646", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "5"}, "Author": "StarZip"}, {"Content": "Great value for the money, excellent location I have stayed twice at this place in the last 2 years now, and have been very very satisfied. Here is a quick summary:PROS:1. No frills, simple place. Clean beds and bathrooms. 2. Great location, 2 blocks from union square, nice breakfast and indian places to eat all around3. Great price ! 4. Nice big TVs, spacious rooms5. Excellent customer service.6. You can request a refrigerator, and they will give it to you for free if they have itCONS1. Might feel a little rundown to people who are used to staying in the hiltons.2. Carpet is clean, but feels funny on bare legs :)I payed $80 per night, which is much much better than the more expensive places around that area.", "Date": "Sep 15, 2006", "ReviewID": "UR986313233", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "ekmainaur"}, {"Content": "Cheap, clean, you get what you pay for I had no problems with this hotel. If you want the Ritz then go stay there. If you want a cheap place that is clean, has a decent size bed, television and bathroom then stay here.The staff were SUPER friendly , giving me local knowledge. This is in a great location, walk to Union Square, jump on a street car, walk around town, close to bars and great diners.There are many worse hotels than this for same price. Yuppies wont like it, normal people will.", "Date": "Sep 15, 2006", "ReviewID": "UR808645922", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "aussietravellerboy"}, {"Content": "Good location, shame about the hotel We stayed at Union Square Plaza for 4 nights from our 3 week travel around the west coast of America and it was by far the worst hotel we stayed in.The hotel is really dirty and our room was so smelly we needed to buy scented candles just to make it bearable.We could not use the sink the whole time of the stay as there was a problem with the pipes and there was constant dirty water with dead insects in the sink coming through from the pipes.Me and my husband are in our mid twenties and have stayed in other budget 2 star hotels in Europe that have been really good so we're not being picky. We did not take pictures as we did not want to be reminded of how awful the hotel was we tried to spend as much time away as possible.I would not recommend this hotel for couples with children i dont feel its safe to walk around in the area the hotel is in at night there are alot of tramps and they really do bother you and it can be quite scary.The only advantages of this hotel is that it is in a decent location (if you want to be right next to union sq) and is very cheap. If you are doing alot of sightseeing then being near union sq is not essential as nothing is within walking distance apart from shopping. You still need to use public transport to get around the best form is probably the bus or tram. Therefore it is worth spending a little more and staying in a nicer area like fishermans wharf this hotel is only good as a last resort.Also the hotel staff are helpful with directions. The problems with the hotel is not the fault of the staff.", "Date": "Jul 24, 2006", "ReviewID": "UR132381279", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "sheetalchawla"}, {"Content": "I'll Be Back This hotel was terrific considering what you pay and where it is. My room (#606) was clean with a comfortable bed and a bathroom that looked like it had been remodeled. Towels were plentiful, the TV worked fine, and there was a mini fridge and microwave oven in the room. Some reviewers whined about the water pressure -- it was fine. Checking in and out was a breeze and I was not charged for some local calls that I made. The location is ideal, and right across the street from the theaters. The only negative, sort of, is that while I was there, San Francisco was unusually warm, and there were no fans or air conditioners (I didn't ask for a fan, though). If you want a great view from your hotel window, go elsewhere, but if you want a decent room at a great price in an area where everything else (including the diners) are horrendously expensive, this is the place for you.", "Date": "Jul 22, 2006", "ReviewID": "UR985584266", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "East_Coast_Andy"}, {"Content": "Great value for money       Plastic mattress cover", "Date": "Jul 21, 2006", "ReviewID": "UR456990027", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "misinger"}, {"Content": "Unsatisfied       Room with opening", "Date": "Jun 4, 2006", "ReviewID": "UR715425985", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Happy with Union Square Plaza Hotel For the price we paid, (very reasonably priced {in fact cheap}) we definitely did not expect a luxurious hotel. However the location is superb; close to all modes of public transport, excellent shopping, many types of eateries and restaurants, and all of the sights and sounds of San Francisco. The room was quite large and the bathroom was also large and very clean. We had four large suitcases with us and we found no trouble storing them and still having plenty of space around the room.This is a very old building and it shows. There is a 'dank' smell throughout, especially in the corridors. Water pressure is non-existent and aesthetically it's not great. However, in my opinion, you get what you pay for. My partner and I stayed four nights at this property and we enjoyed our experiences there. We found the bed (king size) to be very comfortable indeed, and we slept well every night. We were awoken early each morning by sounds of traffic and the general goings on down on street level. But this was not a bad thing for us and we were grateful to get an early start to each day.The staff on the front desk were always friendly, chatty and helpful. Check-in and check-out was quick and easy. The desk was 'manned' by three different gents that we saw throughout our stay. When we were leaving for the airport the man at the desk organized a shuttle for us and gave us a $10.00 discount voucher for the shuttle service, so it only cost $20.00 USD for the two of us (about $4.00 USD more than getting the train, which is how we got from the airport to the hotel when we arrived).All in all I would recommend this hotel to people who are planning full days out and about in San Francisco. We really only spent an hour or two each night in the room before we went to sleep, so for us it was terrific value.The only negatives we found were:-Water pressure is terrible (although I doubt if it could be helped in such a large, old building).-Towels are tiny and only two are provided (a girl needs a separate towel for her hair!!!)-Pillows are small and very thin. I'm sure more could/would have been avaiable had I asked, though.-TV reception is not great.In conclusion we were very happy with the price, location and service at Union Square Plaza Hotel.", "Date": "May 23, 2006", "ReviewID": "UR644773653", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Gkets"}, {"Content": "Great, Convenient and Decent Hotel in SFO This hotel should be choosen by those on a budget but at the same time looking for a good time stay at a prime district located less than 5 min walk from Powell St. Everything from the reception to the day of checking out, it was truly smooth, friendly and pleasant. The receptionist took great initiative to provide a brief introduction on the points of interest in SFO upon our arrival. The hotel room is simple and yet does not compromise basic comfort. Its not as small as I expected, not especially when we can place 4 big luggages and I am still have space to do push ups in the room. Great room for young couples on a budget to experience SFO. I strongly recommend this to everyone. And finally, I will be back for sure end of this year...", "Date": "May 13, 2006", "ReviewID": "UR867984351", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Much better than expected After reading the reviews, I decided that I wasn't going to stay at this hotel. I booked with a 4 star hotel at Fisherman's Wharf. Then I decided that for a savings of $140 a night, that I would take a chance on this hotel. I'm glad I did. When my wife and I checked in, the front desk clerk was very fast, friendly and efficient. So we went to our room, and I held my breath as I opened the door. To my relief, the room was wonderful! This hotel is a block away from the cable car line, and within a 5 minute walk to China Town. The front desk clerk was helpful anytime that I wanted a recommendation for a diner, or directions to somewhere. I noticed a lot of complaints about the homeless in the area, but the entire time we were there, we only had problems with one homeless person, the rest left us alone. And even when we were down by the four star hotels in fisherman's wharf, there was homeless on every corner.Bottom line, if you don't need fancy luxory and want to save a bundle, do yourself a favor and stay here! This hotel was great for us!", "Date": "Mar 23, 2006", "ReviewID": "UR764927164", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great location at a bargain price My husband and I spent four nights at this hotel while he attended a conference at the Hilton nearby. This hotel is not fancy, but an historical old building in the middle of downtown. The front desk staff was helpful and friendly. The room was small, but the bathroom was newly updated, clean and the bed was comfortable. (There was no sign of the vinyl mattress cover mentioned in other reviews.) Bring your own toiletries, as the only amenity supplied is bar soap. Good coffee is available in the lobby and there are lots of restaurants nearby. The location cannot be beat, just a block from Union Square and the trolley. The neighborhood is noisy, especially the garbage pick up during the wee hours. If you have the windows open, it will be disturbing. Another drawback to the area (certainly not the fault of the hotel) is that you will have to deal with panhandlers on every corner. Keep in mind that the Union Square Plaza is on the same block as the Westin St. Francis and less than two blocks from the Hilton. If you want to pay $180 more per night, you could stay at one of those places, but if you are on a budget you can comfortably stay here. Save your money for eating out--you will need it!", "Date": "Nov 1, 2005", "ReviewID": "UR947029663", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Value What a great value in the city!This is probably not the best choice if you generally stay at 5 star , $300/night+ hotels. However, if you're traveling for vacation  want to spend the bulk of your money on other things, check it out. Our room was clean  comfortable. All of the essentials were in great shape. The linens were obviously fresh and clean. The bathroom was clean  everything worked well. Sure, the hotel could use some fresh paint  floorcoverings. Brand new furniture would be nice, too. However... with it's location and charm, these items could easily double the nightly rate. Another travler complained about noise from the traffic below and the mattress cover. I sleep with ear plugs, so I didn't notice. I must say that not all hotels have the mattress covers like this one. But I kinda like the idea of the mattress cover. As far as the traffic below: welcome to the city. With the money I saved on the room, I didn't mind paying $20/day to park the car. I had plenty to buy coffee  breakfast at Starbucks (there's one on every corner, it seems). After that, I still had money left over to shop  have fun. For me, that's what vacation is for. Public transportation was easy to find and the front desk staff were very helpful with any questions we had and offered no problems or hesitation when I requested 2 extra pillows. I'll return for sure.", "Date": "Sep 6, 2005", "ReviewID": "UR658459087", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "worfle"}, {"Content": "Better than the Hilton a block away.", "Date": "Aug 13, 2005", "ReviewID": "UR977240213", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "UltimateRoadWarrior"}, {"Content": "within stumbling distance----not worth it!   showReview(3726374, 'full');", "Date": "Aug 1, 2005", "ReviewID": "UR714378220", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "If Only the Beds Were as Great as the Staff . . .   showReview(3707411, 'full');", "Date": "Jul 28, 2005", "ReviewID": "UR712225726", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "You get what you pay for   showReview(3389640, 'full');", "Date": "Apr 19, 2005", "ReviewID": "UR908317447", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The Bare Basics Leave Ya' With W.A.M. $$(Walking Around Money)   showReview(3307253, 'full');", "Date": "Mar 28, 2005", "ReviewID": "UR759875442", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not too bad   showReview(3286715, 'full');", "Date": "Mar 19, 2005", "ReviewID": "UR400384466", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "tigerlily300"}, {"Content": "Exceptional Value   showReview(2703788, 'full');", "Date": "Oct 14, 2004", "ReviewID": "UR926684983", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "edm7583"}, {"Content": "Cheap but kind of crappy - you decide   showReview(2478664, 'full');", "Date": "Aug 20, 2004", "ReviewID": "UR842132146", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "2", "Location": "-1"}, "Author": "bf1966"}, {"Content": "Could not ask for anything more   showReview(2171079, 'full');", "Date": "Jun 8, 2004", "ReviewID": "UR917886589", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "San Franciscos Best Value   showReview(2078976, 'full');", "Date": "May 19, 2004", "ReviewID": "UR938978401", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "cwbyht"}, {"Content": "Very European   showReview(1659198, 'full');", "Date": "Feb 17, 2004", "ReviewID": "UR361424546", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "BSMet94"}, {"Content": "Lage optimal, aber das ist auch schon alles   showReview(20986143, 'full');", "Date": "Oct 18, 2008", "ReviewID": "UR314699291", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Hennemarc"}, {"Content": "Einzig die Lage war gut.   showReview(20243591, 'full');", "Date": "Sep 21, 2008", "ReviewID": "UR840433495", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "Tastenkroko"}, {"Content": "Nie wieder   showReview(19946968, 'full');", "Date": "Sep 10, 2008", "ReviewID": "UR881155158", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "4"}, "Author": "vrouweelizabeth"}, {"Content": "bella posizione   showReview(20554220, 'full');", "Date": "Sep 3, 2008", "ReviewID": "UR748312821", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Zentral und g眉nstig   showReview(17431146, 'full');", "Date": "Jun 3, 2008", "ReviewID": "UR331441862", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Super Lage, freundliche Rezeption, Zimmer sind ok!   showReview(16589666, 'full');", "Date": "May 19, 2008", "ReviewID": "UR391267507", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Scarafaggi   showReview(16589668, 'full');", "Date": "May 17, 2008", "ReviewID": "UR953336689", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottimo per qualit脿/prezzo   showReview(16589667, 'full');", "Date": "May 15, 2008", "ReviewID": "UR490685349", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Excellent rapport qualite/prix   showReview(15568432, 'full');", "Date": "Apr 27, 2008", "ReviewID": "UR377567566", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Bof bof bof... M茅diocre   showReview(15568430, 'full');", "Date": "Apr 13, 2008", "ReviewID": "UR495560774", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "bonne situation et bon rapport qualit茅-prix   showReview(14989484, 'full');", "Date": "Apr 12, 2008", "ReviewID": "UR575834557", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Manu083"}, {"Content": "molto economico   showReview(15568431, 'full');", "Date": "Apr 12, 2008", "ReviewID": "UR896019978", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Das Beste am Hotel ist seine zentrale Lage!   showReview(13201287, 'full');", "Date": "Jan 11, 2008", "ReviewID": "UR897117067", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bien situ茅 et tr猫s bon march茅       chambre", "Date": "Nov 10, 2007", "ReviewID": "UR103221265", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "pogz"}, {"Content": "Cher, affreux, horrible, la seule chose bien c'est son emplacement dans SFO   showReview(10079950, 'full');", "Date": "Oct 15, 2007", "ReviewID": "UR974616593", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MisterGe"}, {"Content": "Union Square Plaza   showReview(11659951, 'full');", "Date": "Oct 12, 2007", "ReviewID": "UR126870302", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "un hotel passable mais tr猫s bien situ茅   showReview(11659950, 'full');", "Date": "Oct 9, 2007", "ReviewID": "UR337354580", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne Wieder   showReview(14734639, 'full');", "Date": "Sep 28, 2007", "ReviewID": "UR262537909", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr茅s bonne situation   showReview(11437659, 'full');", "Date": "Aug 22, 2007", "ReviewID": "UR795161481", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "h么tel commun 脿 san francisco   showReview(11437658, 'full');", "Date": "Aug 17, 2007", "ReviewID": "UR267955362", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Sale mais tr猫s bien situ茅   showReview(11399108, 'full');", "Date": "Mar 22, 2007", "ReviewID": "UR925481077", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bien situ茅   showReview(11385234, 'full');", "Date": "Jan 7, 2007", "ReviewID": "UR809433142", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Sauber und keine Fl枚he,,,   showReview(11368390, 'full');", "Date": "Oct 11, 2006", "ReviewID": "UR370334262", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Zentralgelegen   showReview(11354685, 'full');", "Date": "Sep 26, 2006", "ReviewID": "UR374097258", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Gut und g眉nstig   showReview(11354684, 'full');", "Date": "Sep 26, 2006", "ReviewID": "UR870974646", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Tres tres bien et un accueil vraiment hors du commun.   showReview(11354683, 'full');", "Date": "Sep 6, 2006", "ReviewID": "UR612653585", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "tr猫s bien situ茅   showReview(11339796, 'full');", "Date": "Aug 12, 2006", "ReviewID": "UR229929009", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d80806-r23221856-Union_Square_Plaza_Hotel-San_Francisco_California.html", "HotelID": "80806", "Price": "$93"}}