{"Reviews": [{"Content": "Terrible experience!! Having read the recent reviews for this place i cant belive the amount of people that have been lied to by the staff at this Days Inn. After a wonderful experience in another Days inn on our road trip we were delighted to find another that was located pretty close to the Warf. The staff told us we could have the room for three nights and then in the morning said it was no longer available and swore he never said anything about three nights. We had the inconvenience of trying to find an alternative and ended up having to cut our stay in San Fran short as a result. Very rude and abusive staff and the place wasn't great either", "Date": "Dec 30, 2008", "ReviewID": "UR325807195", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "henryglynn7"}, {"Content": "This is a place NOT to stay in SF! Sometimes when you find a place, a little hole in the wall place, a place you can count on time and time again--it's the right price, located in the right place even includes free parking and free Internet, you take for granted that it will always be this place. But nothing is forever... and once it stops being that place, it's hard for it to ever recover. Because once trust is betrayed there is forever doubt...This is a story of such a place that betrayed our trust. And because they made it so miserable for us, challenging us by saying things like, tell whoever you want, we never want for business! we would like to remind people that such betrayers of trust are defiantly out there! They think we the people are powerless against them and their poor service, that we don't have choices, that our voices won't be heard nor our warnings heeded! Full commentary (we even have a PowerPoint to illustrate the point) at irasciblechef dotcom--IrascibleChef", "Date": "Aug 8, 2008", "ReviewID": "UR561395784", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "4"}, "Author": "irasciblechef"}, {"Content": "Great Neighborhood We actually explored the neighborhood a iittle more this visit, and found it to be full of restaurants and markets and movie houses. It was great. And the hotel was fine. It was clean and you could get a free banana and coffee in the morning. I had enough towels, and they gave you shampoo and lotion. I didn't have much interaction with the staff, but the front desk was helpful when I needed them to be. I'd stay here again in a heartbeat.", "Date": "May 20, 2008", "ReviewID": "UR410583792", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "TooFarNorth"}, {"Content": "A bit out of the way. We stayed only one night at this motel and it was quite ok. The room was small, but clean and the staff was friendly and helpful.We chose this motel mainly because we needed a place with a parking space. The location is not ideal and we ended up having to take a taxi when going out at night. In retrospect it would probably have been just as easy to find a hotel with a parking space more centrally located and the next time I am in SF I will choose a hotel closer to union square. Like most motel chains the breakfast was poor, but there is an Ihop just across the street so we ate there instead.", "Date": "Mar 7, 2008", "ReviewID": "UR156351315", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "loves-to-travel76"}, {"Content": "Great Location, Good Service, Nice Room All the bad reviews that this place has been given did not deter me from keeping an open mind. My companion and I were comfortable, treated fairly and cordially, I made several requests that were attended to immediately with kindness and overall, it was a very very good stay in a convenient location. Go in with an open mind and gentle heart and you will be treated well, and enjoy your stay at this location. We paid $70 and I didn't bother to check for lower rates but at San Francisco prices I think it was a good value.", "Date": "Feb 25, 2008", "ReviewID": "UR520934675", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "WallDruggie"}, {"Content": "Worst Experience Ever After having a satisfactory experience with the Day's Inn on our road trip, we had the misfortune of staying one night at this location. The location is definitely not to acceptable standards. It was dirty, old, moldy and in poor repair. The attendant was rude, lied to us and unpleasant in his demeanor. I would not recomend this location to anyone. I have also advised the Day's Inn Head Office people of our experience and I would advise other travellers to do the same.", "Date": "Feb 1, 2008", "ReviewID": "UR959615917", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "3", "Rooms": "1", "Location": "3"}, "Author": "AlloPrairies"}, {"Content": "The worst experience ever We booked through Days Inn directly, and for a good rate, pre-paid with a no cancellation policy. The experience was the worst in our 30 years of traveling. We were lied to, the place was filthy, my wife was called a whore. We had been regular customers at another Days Inn in the city with generally good treatment, but this particular place is unique --in the world. We complained to the company; it referred us to the motel directly; we got in contact with it; it bumped us back to the company. And so forth. Avoid at all cost.", "Date": "Nov 25, 2007", "ReviewID": "UR871226401", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "bobbybey"}, {"Content": "Excellent Location There are a lot of complaints about this hotel in Trip Advisor Reviews and as a result we were very nervous about staying here. We found the reception staff very pleasant and helpful. They had our reservation at the price we expected and when we wanted to book again at the end of our stay in the USA they were very obliging.Whilst the hotel is undoubtedly quite old, with paint peeling off the walls in some areas, the room was clean and more than adequate for our family.The breakfast advertised was disappointing and you should not make your choice based on this inclusion. However, excellent restaurants are located only a very short walk away. There are also small grocery stores around where it is possible to buy breakfast cereals etc.Overall a good choice for the budget minded traveller wanting a hotel in an excellent location. This hotel does not deserve all the bad press.", "Date": "Nov 9, 2007", "ReviewID": "UR396939949", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "MIB000"}, {"Content": "This motel gives Days Inn a bad name Pretty much the same horrible experience as other guests. The manager lied about our confirmation. He was rude. And yes, the poor service, we also had to get our rollaway bed. Rooms were dirty. The front desk area smelled. All in all, it was one of the worst lodging experience in my 30 years of travelling. Wish I had read the reviews before booking. Days Inn franchises their hotels/motels to private parties, so there is no quality control. I will also avoid staying at Days Inn.", "Date": "Oct 23, 2007", "ReviewID": "UR839009495", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "flower_ho"}, {"Content": "Bad smell, old torn furniture, unfriendly personnel - why stay there? I have not much to add to the reviews you can read below. I can confirm the bad reviews entirely. It started with a completely ignorant hotel manager.I had a reservation for a king, he gave us a double queen with the remark that the 2nd bed was free. What a [--].If you want to share a bed with your girlfriend a double queen is not the same as a king. Anyways prices for both any of those two arrangements are mostly the same wherever you go. This guy thinks he is funny. The room was equipped with old torn furniture, old mattresses and there was an intense bad smell in this hot steamy room.We decided not to stay there and pay anyways (advance rate, not refund).Worst experience on a 3 week trip through CA, AZ,NV.The Days Inn on Sloat is a lot better. We stayed there 5 nights.", "Date": "Sep 24, 2007", "ReviewID": "UR142778352", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "TravellerfromGermany"}, {"Content": "Very bad experience We reserved two rooms with two beds. The owner told us we only booked room with one bed. It is impossible. I booked with my colleague together. He did not tell the truth! We have to get another bed from storage room ourselves. Room not clean and bad smell.Never book Days Inn anymore!", "Date": "Aug 17, 2007", "ReviewID": "UR293574569", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "bria123n"}, {"Content": "Scam - Beware! At checkin they refused to honor my confirmed reservation (via email), saying they were booked solid. I did not receive notification that it was bad before I got there. After looking the place over and seeing the street noise and quality of the building, I was relieved, even though put out at suddenly not having a room. They sent me down the street to an Econo-Inn that was worse, at a significant upcharge. Days Inn customer support put me on perpetual hold - I never got through.", "Date": "Aug 17, 2007", "ReviewID": "UR448809471", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "-1", "Location": "-1"}, "Author": "markinirvine"}, {"Content": "Not so bad, but... We chose the Days Inn, Lombard Street for several reasons. Firstly we have stayed at Days Inn in different cities and it always seemed to be the best value for money (Cheap, clean, sometimes pool and full continental breakfast included)Second, the situation on Lombard street seemed quite centraland third, the parking was free.However, the rooms were slightly smaller and shabbier than on earlier occasions. There is no pool. The parking is free but very small and tight. The distance from the hotel to Fisherman's Wharf is actually very far. It can be walked but too far for us. There is no direct bus to the Wharf, so we took two busses.(For the evening, there are a lot of restaurants at the Wharf that, if you eat there, you get 3 hours free parking right at the waterside (eg. Pier 39 parking lot) )The breakfast was here only bearbites (pastries) and tea/coffee, nothing else.The worst thing was the smell of Indian cooking all day long at the reception area. The management (doing the cooking) was not very professional. Tried to help us with a room change but ended up making quite a mix up, even giving us the wrong room key which gave us access to someone else's room where we could have stolen anything we wanted. And on the second morning, we wanted to make an early getaway but the reception and breakfast area didn't open until 8am although it was supposed to open at 7am. A sleepy receptionist (owner?) let us in saying that it was normal because they didn't open until 7:30am!All in all, budget minded people will have an enjoyable stay here, but the mangagement should get a serious shaking up by Days Inn", "Date": "Jun 19, 2007", "ReviewID": "UR267859754", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "3"}, "Author": "frenchkiwi"}, {"Content": "They were wonderful! I booked another motel on line for Christmas week. It was terrible, so I started looking around and found the Days Inn about 2 blocks away. They were so nice! Even arranged for me to check in at 11:00 AM after my one nights stay at the other place. The room was large, clean, and the staff went out of their way to be helpful. When I went next door at ask a question of one of the maids, I found her on her hands and knees vacuuming under the bed. That is going the extra mile! Manger explained the bus routes for me, drew me a map, and even gave me his cell number if I were to get lost. I WILL certainly go back there.", "Date": "Feb 16, 2007", "ReviewID": "UR543367223", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "-1", "Location": "5"}, "Author": "WarriorforChrist"}, {"Content": "New owners doing their best to run service into the ground The person I stayed with here has been staying here for a dozen years at least. It's perfect for coming up from the South Bay and dining around this amazing neighborhood for the weekend.However, the ownership changed three months ago, and after our first night with the new people, we will never go back. They are rude, combative, and let the cleaning staff steal whatever is left behind. I went back for something and was actually told that there was nothing they could do if the cleaning staff had been by. Of course, my item was missing and the owner just shrugged.Our toilet didn't flush, our door didn't lock, and our things were stolen. All of these things were our fault according to the management. They told us to come get a plunger, just shut the door tightly, and tough luck for leaving anything behind.When we said we'd be writing a review on my site, he said go ahead. He didn't care that he'd lose loyal customers because, We never lack business.Read the entire review on[--]", "Date": "Oct 17, 2006", "ReviewID": "UR322259497", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "Mindimer"}, {"Content": "dirty moldy room, free parking, great location The room was gross with alot of street noise, but its cheap and parking was free. Its also within walking distance to fishermen's wharf etc. so if you just need a place to crash its ok. The hallways are outdoors and are cat-walk like, so expect noise when others walk by.", "Date": "Oct 14, 2006", "ReviewID": "UR210775247", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "5"}, "Author": "wup"}, {"Content": "Will never stay at Days Inn I never actually stayed at this hotel, but I must let others know about my unfortunate experience with this specific hotel for future reference. I made a reservation to stay at this hotel with my travel agency, AAA. I cancelled the reservation four days in advance and was given a cancellation #. While I was in SF on my trip (and staying in another hotel) this Days Inn held money on my account because they claimed that I did not cancel the reservation. This money (almost $80) was later taken out of my account by Days Inn. When I provided them with the cancellation number, they claimed I would have to wait until they could investigate it. I must add that the entire process of dealing with the hotel was awful. I dealt the a manager who was very rude named Jack. He told me this was not his problem, never once apologized for the inconvenience of erroneously taking money from me, and hung up on me. My husband had to call him back and talk to him because he was so rude to me. After numerous phone calls to corporate office, I was told I would have to make a claim. I was also informed that since this specific hotel was privately owned, corporate Days Inn couldn't really do much about it. I was then told I would have to wait 10 days to give them time to investigate it. Waited 10 days and was then informed that my travel agency was the guilty party and that they had made a double reservation, which is highly unlikely because I watched the agent make it. So, instead of just reimbursing me money that I was owed for a false charge made by them, they now want to place the blame on AAA. So now AAA is going to reimburse me the money because its easier than dealing with Days Inn. So this unprofessionally run Days Inn gets to keep my money that they wrongfully took from me and that rude manager never gets to learn from his error. No justice. Hopefully this awful experience is useful for someone someday!", "Date": "Jan 6, 2006", "ReviewID": "UR575727253", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Disneyjunkie"}, {"Content": "Good location, room very musty This is one of a number of inexpensive hotels/motels in the Marina District of San Francisco. The room I got had a strong mildew odor, could have been either the carpet or the shower area, I forget which. Otherwise the room was OK, not spectacular. On the other hand, the neighborhood is very lively and safe. Lombard St. in this area is a major arterial street, mostly full of fast traffic, fast food and other cheap hotels. But you can walk two blocks north to Chestnut, or a few blocks south to Union and find yourself in a very nice shopping/restaurant area. Access to public transit (Muni and Golden Gate buses) is also very good.", "Date": "Jul 12, 2005", "ReviewID": "UR494114358", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "Temporary"}, {"Content": "Would recommend Stayed here for three nights while exploring San Francisco. While the hotel is not located near any of the major sights (well, the Golden Gate Bridge is a short 10 minute drive away), I enjoyed my stay here. I got an excellent rate of $55.00 a night plus free parking. Since I booked this hotel in advance and knew what the rate was, I was a little worried that it would be a rat trap for being that cheap in San Francisco. As soon as I got into my room (all rooms were outside corriders, which I don't really care for), I checked it over completely to make sure everything was O.K. - no bugs in bed, clean sheets, water was clear, not brown and dirty, and the air conditioning/heat worked. Satisfied that everything was O.K. I unloaded my car and enjoyed staying there the next three nights. I didn't have any problems at all. The area was pretty safe as there were plenty of other hotels and a few restaurants close and the hotel is located off of a major street (Lombard, which is also Highway 101 a major street that cuts through San Francisco). The hotel was pretty far from most attractions, but was along a bus route (though I never used the public transportation in San Francisco so I don't know if it is any good or not). One night after dark I walked back to my hotel from Fisherman's Wharf, thinking that it wasn't that far away, and ended up walking 2 miles! (I drove the same route the next day and clocked it to see exactly how far away it was.) I would definetly stay here again when in San Francisco based on the price and the fact that it wasn't a complete rat trap for that price.", "Date": "Nov 24, 2003", "ReviewID": "UR189204654", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Horrible Horrible service, the attendants were rude and unprofessional. When we arrived, they payed little attention and gave us a hard time when we asked for help. We've even said good morning without replies except with cold glances. We were extremely disappointed by the manners of staff and the rooms did not have hot water constantly. I would definetely not recommend staying here.", "Date": "Jul 1, 2003", "ReviewID": "UR603047076", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "bon rapport qualite prix   showReview(13197079, 'full');", "Date": "Jan 2, 2008", "ReviewID": "UR378761951", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Muy bueno   showReview(10652149, 'full');", "Date": "Nov 6, 2007", "ReviewID": "UR882809350", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "AlbaIris"}, {"Content": "Nie wieder dieses Motel!   showReview(10014238, 'full');", "Date": "Sep 28, 2007", "ReviewID": "UR620134448", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "4"}, "Author": "reise123"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d80950-r23116060-Days_Inn_Lombard_Street-San_Francisco_California.html", "HotelID": "80950", "Price": "$85"}}