{"Reviews": [{"Content": "Not bad It was an ok experience...the service was good (just that there was none in the lobby after 9 pm the lobby was on roadside....they showed up only in the morning.) The rooms were big and nice. They had a free parking space too. Bus stop is just outside the hotel for golden gate bridge and 1 block to 30 number bus which can take you to union square/chinatown, etc. so a good location .walsgreen just in front . ATMs and Banks 2-3 blocksNot bad for the price.", "Date": "Dec 6, 2008", "ReviewID": "UR116776042", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "amkibu"}, {"Content": "Smelly Building and No A/C! This was not one of the best overnight places to stay in S.F.The building had a very bad smell, my husband described it as having an onion in a headlock. Luckily there was a Walgreens across the street and we were able to buy some disinfectant/air freshener spray. We stayed at this place because a representative from AAA recomended it. I have two small children and our room had large windows with no screens. I was very tense about having a toddler in this room because she kept wanting to look out the window. Also Lombard Street is very noisy at night making it hard to sleep.There was no A/C so the room was very stuffy. Another family we came with had no hot water in there room for about 20 minutes. There was no continental breakfast in the morning only coffee and juice.Our family was very disappointed and will never stay at this place again.", "Date": "Aug 6, 2008", "ReviewID": "UR285556828", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "Lolo05"}, {"Content": "Horrible Customer Service!! Horrible room!! My wife and I arrived the evening of June 13th only to find a hole in the ceiling of our room with water dripping from it. I went to the front desk to inform them of this and request another room. I was told flat out in a very rude tone that no more rooms were available and if I didn't want that room I should go somewhere else. I was also told that, for the rate I was paying, what did I expect!! Unbelievable!! I told them that the room was totally unacceptable and, since it was late and we didn't know the area at all, I asked if they would help us find another room. I was immediately told a flat out NO and that we should leave in a very rude tone again. After a very brief shouting match concerning their totaly lack of customer service, we left. Fortunately, we found an excellent room at the Chelsea Inn just a couple of blocks from where we started. They had fantasic large rooms and unbelievable Customer Service at only a few dollars more than the dingy, dirty Alpha Inn and Suites. Finally, we ended up getting a refund thru AOL@Travelocity after they called the Alpha Inn and Suites to confirm our complaint....", "Date": "Jun 25, 2008", "ReviewID": "UR857444988", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "tfourment"}, {"Content": "Terrible       disguting chair", "Date": "Jun 7, 2008", "ReviewID": "UR551801986", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "puce3"}, {"Content": "Bed bugs bed bugs bed bugs!!!!!       My elbow", "Date": "Dec 11, 2007", "ReviewID": "UR951158626", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MissKeely"}, {"Content": "Comfortable stay We stayed at the Alpha Inn and Suites (previously Econo Lodge) for 3 nights, and overall it wasn't bad! The guy on the front desk was friendly and helpful (even if English wasn't his first language), and he gave us a huge room, from which you could see downtown, Golden Gate Bridge and Alcatraz.The main building is accessed via a locked gated door which you access using your keycard. The room was clean and had a comfortable bed, walk-in cupboard, bathroom, TV, telephone, fridge, microwave, table and chairs, 2 sofas, and coffee maker. It was about 4 times the size of the hotel room my husband stayed in last time he was in SF. The noise wasn't too noticeable considering we were on Lombard Street! The main negative for us was that there was no safe, despite the website saying 'safe in every room' and the keycard saying 'keep your valuables in the safe'.Some other things to note: There's no lift 鈥?so make sure you can carry your luggage up and down 3 flights of stairs! Breakfast consisted of 1 small chocolate muffin. However, there's a Walgreens right across the road, and a diner further up Lombard. If you're not a fan of thin towels, bring your own!The area seemed fairly safe, and the location is good 鈥?just walk down Divisadero and you end up at the marina district. If you're feeling energetic you can have a very pleasant walk 2 miles to the Golden Gate Bridge (turn left), or Pier 39 (turn right). Having researched SF hotels on Tripadvisor, we weren't expecting to get a lot for our money (especially on Fri/Sat, booking only a few days before our stay). While the whole place would undoubtedly benefit from a spruce-up, we had a comfortable stay. However, if you're the kind of person whose holiday is ruined by chipped furniture/mismatched decor, I would recommend looking elsewhere...", "Date": "Oct 22, 2007", "ReviewID": "UR442029912", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "starmist"}, {"Content": "Horrible and stinking. DO NOT STAY THERE !!!       The broken sofa bed", "Date": "Oct 5, 2006", "ReviewID": "UR384277279", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "Yoda_Hapatish"}, {"Content": "Avoid at all costs!! We called this hote at 5:30 pm and aksed if there were any rooms available. We were told there was one left at $139.00. We booked the room and gave the lady our credit card number. We told her we were driving into town and would be there around 8:00. After negotiating through downtown traffic, we arrived at the hotel at 8:20. We buzzed the door and an older man came to a small window. I gave him my name and said we had reservations for that night. He looked on a sheet of paper and said we were not on it and then turned around and walked back into the back room and would not come out again when I buzzed again. I returned to our car and my wife called the hotel. This same man answered the phone and told her that they had canceled our reservation because we were not there at 8:00. It was only 8:20!NEVER AGAI!!. People, read these reviews and heed the warning. This place is to be avoided.", "Date": "Aug 20, 2006", "ReviewID": "UR874833177", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "-1", "Location": "-1"}, "Author": "Hanrahan"}, {"Content": "Great Stay! My husband and I stayed at this motel previously and had a good experience. This time was no different. We booked a king suite for one week. The room was very large and had a couch, arm chair, coffee table, small dining table and two chairs, microwave and refrigerator. The room also had cable TV and free high-speed internet. For summertime this place had the best price in the area and I booked several months ahead. It was clean, the staff was friendly, and the location is amazing. It is located about a 10 minute walk from the waterfront, 10 minute walk from the Palace of the Arts and 5 minute walk from the Presidio, 5 minute walk from Chestnut street restaurants and pubs and 5 minute walk to Union street shops. Parking does fill up quickly in the afternoon and most of the parking spaces are tiny but this was not a problem for us because we walked everywhere. A bus stop that is right in front of the motel will connect you to anywhere in the city. I don鈥檛 have a single negative thing to say about the Econolodge, San Francisco.", "Date": "Aug 10, 2006", "ReviewID": "UR706247548", "Ratings": {"Service": "-1", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Aronnax"}, {"Content": "So much for service Crappy service, rude employees, dirty musty broken down rooms and not enough parking. Can't get back any property accidently left, even if you ask them to send it postage due. Top it off with being overcharged. Don't stay here!", "Date": "May 29, 2006", "ReviewID": "UR359694486", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "It was ok... The room was good, big, big TV, high speed internet, very clean. I had to buy a Shampo, because they had a bad one. But for my next visit to SF (which I hope will happen soon) I'll go there again...", "Date": "Aug 23, 2005", "ReviewID": "UR437120283", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "Idan_net"}, {"Content": "Basic This is a budget hotel, make no bones about that. The pool was empty and had some work done recently. The room was clean and tidy and adequate for what I wanted. It is very near the 30 bus route to Fisherman's wharf and Downtown. In reach of the bay for walks along the Marina. Opoosite a 24 hr Walgreen's Drug Store for late night snacks!As an alternative there are plenty of other motel literally within 5 mins walk of this hotel. I should have tried them as an alternative.The traffic is quite noisy as Lombard St is en route to the Golden Gate Bridge", "Date": "Mar 8, 2005", "ReviewID": "UR139499221", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "David_Avery"}, {"Content": "Does not Honour Online Booking There is always a first time for everything - Refusal of Service.Arrived at 6:30PM at night, showed our web reservation printout and was asked for name three times before saying no reservation under the name. He takes a look at the web reservation sheet of ours and tells us that the rates are all wrong (too low). However, he was willing to accomodate and put us in a room although the hotel is full. Hands us a sheet with no explaination (apparently guest registration sheet), asked us to fill out information and sign first before he starts filling out the length of stay and room rates (which of course were higher than the web reservation). When I mentioned that the rates (only approx. 10 dollars more for two days in comparison to web reservation ) will not be accepted by us and that this is a problem he should take up with EconoLodge Headquarters, he said plain and simple ...then go away, we don't serve you, you are rude, go away! Leave now! At no time were we rude. At no time did we agree to pay more regardless of the amount. We asked for the registration sheet to be torn up and he refused. Bottom Line:1. Poor Language Communication Skills (hard to understand his Enlish)2. Poor Attitude (at no time did he make a phone call/use a computer to verify the validity of our web reservation)3. Does not understand the concept of customer service Side Note: There are about 12 parking spots for big cars and about another 12 spots for compact cars (for compact cars, 2 inches from the mirror of each side for a Toyota Corolla is the space you are left with if you are confident enough to steer into that space)", "Date": "Feb 16, 2005", "ReviewID": "UR561256517", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Avoid Was all set to say that this place is a good option for budget stay in SF, despite the central pool empty of water and filled with mud, crooked electrical outlets, and world's worst in-room coffee. Then, when I was checking out, I asked the owner if he could store my bags while I was out, and he refused to store them in the office. He said he could store them in the laundry room across the hotel complex. I asked him if he could show me where that was and he refused. When I said I was uncomfortable leaving the bags somewhere he would not show me, he tried to assure me that it was locked except when the employees were doing laundry (this did not seem all that secure). I asked again if he could store my bags in the office, and he refused, and then said, Now I won't store your bags at all. I said What? He said, Take your bags with you, I won't help you. We went back and forth like this a couple more times, until finally I had to beg him to take the bags, and even then, I had to lug the bag with my computer in it all around with me, since I decided only to leave my garment bag. In the end, the laundry room seemed semi-secure (although it was across the parking lot in the back, and it would have been easy for someone to take something out of a bag outside the sight of the manager or desk clerk). This owner does not understand that there is a minimum standard he has to provide; otherwise his hotel is all but useless to travelers.", "Date": "Dec 7, 2004", "ReviewID": "UR793530783", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "doc11"}, {"Content": "Location, location, location (Safe) Stayed June '04 for 4 nights (2 Adults and 2 Teenagers). Never visited SF, LOCATION WAS THE KEY. AAA price $56 a night. We we able to park Free every night. Pool is being redone. Rooms clean, older but clean. Didn't spend much time in room, so this was ideal for a budget. Easy walk to Mel's Diner-A Must.", "Date": "Jul 4, 2004", "ReviewID": "UR675027570", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good for price, but short on parking space We stayed there on april of 2004. This is what we got for 48$us per night: King bed,mini fridge,coffee maker, fog horn noise from the Golden gate bridge, tight space or non-existent parking, and ghetto-like room neighbors. If you think about using the pool, DON'T. They should think about burrying it and putting more parking space over it. It was very dirty. The room was clean but had a strong smell of carpet deodorant floating around, but we vented it out quickly by opening the window. This is a good hotel for the budget-oriented traveller because of the cheap rates and because it's located in a good neighborhood (Cow's Hollow). You could access everything by using public transit, but much easier with a car.. Bring lots of quarters for metered parking when you visit the city!!!", "Date": "Apr 12, 2004", "ReviewID": "UR780429090", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Bitte buchen Sie dieses Hotel unter keinen Umst盲nden!   showReview(18199547, 'full');", "Date": "Jul 24, 2008", "ReviewID": "UR338490719", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "thwolf008"}, {"Content": "Un peu vieillot les chambres.   showReview(18537240, 'full');", "Date": "Jul 23, 2008", "ReviewID": "UR750487036", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "tres bon motel, downtown san francisco   showReview(18537242, 'full');", "Date": "Jul 20, 2008", "ReviewID": "UR783041129", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Nella media, per il prezzo pagato v脿 bene   showReview(15573312, 'full');", "Date": "Apr 25, 2008", "ReviewID": "UR941463319", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Disons que c'est un hotel avec...   showReview(14593269, 'full');", "Date": "Feb 20, 2008", "ReviewID": "UR139633954", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d80978-r22507240-Alpha_Inn_and_Suites_San_Francisco-San_Francisco_California.html", "HotelID": "80978", "Price": "$113"}}