{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boulder", "Title": "“30-31 March 2012 - Family from Boulder, CO USA”", "Author": "W H", "ReviewID": "UR127608292", "Content": "Very nice hotel, with friendly and helpful staff, and good, full breakfast. We reserved a family room for four since our children are grown. Both the bedroom and bathroom were large and comfortable. The hotel is located conveniently on a quieter side street, but still within easy walking distance to everything. We would stay here again should we visit Venice in the future. WGH", "Date": "April 10, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Basel", "Title": "“Good value hotel.”", "Author": "Ramdas P", "ReviewID": "UR127539226", "Content": "We were a family of 4 and the single family room was fairly spacious, clean and comfortable. The staff in the hotel were courteous and helpful and the breakfast was surprisingly better than what we had experienced in several other hotels in Italy. The only issue was that it was a struggle to locate the hotel, especially as the directions in the hotel webpage were a bit erroneous. However we did enjoy our stay and will consider coming back to this hotel.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Vienna, Austria", "Title": "“Clean, but poor reputation! Will never come back again!”", "Author": "Pete T", "ReviewID": "UR127023676", "Content": "when i first checked-in, the reception was hard-core mean! They were in a bad mood, no cozy welcome as you would normally expect from a 4-star hotel etc.) And, the internet costed 10 EUROS (14 USD)!! However, the internet didnt work at all, and a red-haired receptionist (woman) was the worst. In the morning when i woke up, they didnt show me the way to the breakfast room, cuz i couldnt fine it. They didnt bother. The same (red haired woman) simply pointed towards a certain direction. And last but not least, the beds were rock-hard never returning!", "Date": "March 31, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“good hotel, good position”", "Author": "Joost Z", "ReviewID": "UR126751948", "Content": "The room was simple but providing enough for a city trip. For a Italian hotel 4 starts means: regular, proper and suficient. Nevertheless the staff was was not very supportive. No suggestions, no effort to make your stay extra pleasant. The breakfast was american style and simple, but your in Italy so run off to the first small barrida around the corner! The location is perfect, in the middle of the San Marco region, although it is a little hard to find and a small walk from the local bus-boat stops. Clean bathrooms, good housekeeping and during our stay perfectly quiet. the staff was was not very supportive. (no answer to our request of information for transport to the airport, information about opera shows etc.) simple breakfast (not a big deal)", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Malta", "Title": "“Very good !”", "Author": "emikaw", "ReviewID": "UR125651082", "Content": "Just got back from a fab weekend with my mum. Location was good, just 10 minutes to Piazza San Marco. And the most important thing with the hotel was that it was very clean and breakfast was excellent ! Staff were really really nice !! Room was big with a very nice big bathroom always warm since central heating was on every time! Would really recommend it since I'll visit some other day for sure :) The only draw back was the mattress since it probably was worn out but can't really complain! And no lift but no big deal since we only went up once a day ... and you kinda get used to it with all the steps and walks we had all through Venice and it's islands !", "Date": "March 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Worst ever”", "Author": "b m", "ReviewID": "UR124845405", "Content": "If youÂ´ve never had a chance to see a drunken Hotel Manager screaming at you in the middle of the night, choose the Hotel Ca Alvise in Venice. I was there in February 2012 for a couple of nights as a family with children. The second night the music from a party down stairs was so loud that was impossible to sleep. I went to the reception to complain just to find a receptionist telling me that thatÂ´s Italy and he can do nothing before 11:30 PM, then his young drunken boss (apparently the party host) came over and started to shout at me. Of course they finished after 1AM in huge noise of shattered glass. It was the first time when I felt insecure for my family. But thatÂ´s maybe not whole Italy but definitely Ca Alvise (and probably its sister hotels).", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "imola", "Title": "“nice and small”", "Author": "luca g", "ReviewID": "UR124301457", "Content": "next to Piazza San Marco, it's cute and confortevole.the room had a chandelier in Murano glass and bath idromassaggio.good breakfast, nice to ask if we wanted to leave your luggage at the hotel after check out to enjoy venice without even packing. Only bad advice for restaurants to go eat in the evening. :-)", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "LONDON", "Title": "“clean and nice”", "Author": "LondonHassan", "ReviewID": "UR123827337", "Content": "just spent the weekend there with wife and two kids, although I dont agree with the 4 star rating it is a very nice clean friendly and well located hotel, just needs hot drink facilities in the room, but altogether would recommend.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Terrible”", "Author": "Vanni R", "ReviewID": "UR123440850", "Content": "They never answered my mails asking to review the price, paid to Groupalia (a group discount organization), which has been 75% higher than their normal rate in January. I had anyway to use my Groupalia coupon, and so I decided to book the hotel, even at this very higher rate. Arrived at the hotel, after 20 minutes walk with luggages, they told me that they decided to give me an accomodation in another hotel (Ateneo, three stars, instead of fours), because they use the roulette formula(?), which give them the right to do so. So I walked to this hotel, not far away, which has no elevator, it has old and dirty rooms and it is quite noisy. I have to mention one positive performance: their personnel was very kind and helpful. I will not forget them, even if I will forget about these hotels and their organization.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice hotel, great room and excellent location to explore venice!”", "Author": "NadjaZ", "ReviewID": "UR122672355", "Content": "We stayed in hotel Ca' Alvise for 2 nights. Our room was big and just beautiful! Breakfast was international but there were also a lot of italien specialities (like for example brioche). The location of the hotel is perfect. It's near the Rialto Bridge & near to different vaparetto stations. It makes the exploration of venice easy and uncomplicated. We were very happy with our choice to stay in hotel Ca' Alvise!:-)", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Good location near to Grand canal and San Marco”", "Author": "thai v", "ReviewID": "UR122495702", "Content": "We stayed for two nights in the classic family room. After our Europe trip, Paris, Venice, Florence and Rome I asked my kids which hotel are they like the most. They said Albergo Ca'Alvise in Venice. We really like the decoration in the room also we got 1 king bed with 2 twin bed. I strongly recommend the traveler with children to this hotel. The breakfast is fine but can't compare to hotel in Florence and Rome.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice hotel for your vacation in Venice”", "Author": "Ndhieu", "ReviewID": "UR122422954", "Content": "Everything is fine. Nice hotel staff, good internet connection and the location is better than expected, just a few minutes walking from Rialto water bus station.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bucharest, Bucuresti, Romania", "Title": "“Good hotel perfect location”", "Author": "Roxana C", "ReviewID": "UR121521584", "Content": "Hotel Ca'Alvise is quite intimate, with romantic entrance and venetian decorated rooms. The location is very close to Piazza San Marco but on a quiet street. Room and bathroom are medium sized and look nice. Bathroom had jacuzzi but did not work. The matress of the bed is a little sagging especially in the middle, if you are a couple you cannot sleep close to each other. Breakfast was ok for us -we had a 3 nights-stay- more days we would get bored of it. Breakfast room is small and this ws not a problem as we went in extraseason but probably during holidays it gets crowdy. Staff was ok. Everyday we found our room tidy and beds made. We stained the sheet with juice and we found new sheets. Overall a good hotel and we had a pleasant stay. Roxana, Bucharest", "Date": "December 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Florence, Italy", "Title": "“Good hotel near Piazza San Marco”", "Author": "Antonio G", "ReviewID": "UR120733780", "Content": "the hotel is nice, but the service is not the best, I would have liked more attention and courtesy by the staff. The service offered is not appropriate to that of a four-star hotel. The breakfast is not great, because it is served in a small room and the tables are too close to each other. The hotel has asked for a deposit of 100 euros for the room. In the room there is a continuous noise due to air conditioning.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Quite Good Hotel but no Attention to Details”", "Author": "Ellieee22", "ReviewID": "UR120520533", "Content": "The hotel is quite good, excellent position but it is not a 4 star-hotel in my opinion: services and facilities are poor (no lift in the hotel!), personal is not always professional like it should be in a 4 star hotel and ther's no attention to details: in our room fornitur was damages, walls had some damp patch. In any case the room was clean and large,breakfast was good. At last the hotel is quite good but it hasn't the level it should have and it's not value for money.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cordoba, Argentina", "Title": "“good hotel, bad service”", "Author": "Ramon Q", "ReviewID": "UR119674003", "Content": "The hotel is conveniently located within 5 minutes walk from Piazza San Marco The facilities are good, in general, but have no interest in solving problems. We had a room with Jacuzzi, but did not work, and also had a water loss. They did not worry about this problem and offered no compensation at the time of payment.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "sydney", "Title": "“Venice Hotel Ca'Alvise”", "Author": "kathleen88", "ReviewID": "UR119162380", "Content": "As we entered the Lobby, an overwhelming, terrible smell engulfed us all until we reached our room. There was no lift, but fortunately we were on the first floor so we didn't have to walk up too many flights of stairs. Yes, at first sight the rooms looked dark and gloomy and others cheap and old but that was not the first of our problems. The baths were dirty, the towels were probably used by Cleopatra and there was not one tissue in the whole hotel. Only shampoo was provided- no body wash or bath gel. There was only a cheap, sticky soap cake. The beds were extremely low and there was hair all through the sheets. Plus, the beds were all infested with bed bugs - we have bites to prove it. The pillows were only large chunks of foam in a pillow case - the cheapest kind of pillow you can get. The ceilings were covered in yellow and brown stains. The TV was in Italian but not all programs had an option to change the language. The skirting boards were falling off and we could nearly pull them off the wall. The views from our rooms were of brick walls and old windows. Not only did we not have air conditioning but we had no heating as apparently it would only be turned on for the whole hotel in 3 weeks. We were absolutely freezing. So for our two rooms, we asked for a heater each but there was only one available for the whole hotel. Then, when we asked, we were not allowed an iron as it was apparently European law that no hotel guest could iron in the hotel, without supervision as a building had burnt down from an ironing accident previously. Instead, we had to pay for our ironing to be done by the hotel (it was very expensive) which was not even done properly. At the Stucky Hilton however, we were allowed to iron ourselves in the rooms and the rate was below half price of Ca' Alvise. After being thoroughly disappointed with the hotel, we went down to Reception to complain. We asked if we could get a refund if we moved hotels but the lady said no and did an evil chuckle. This hotel was a terrible price for the quality we received and does DEFINITELY NOT deserve it's 4 star rating. It should be a 2 star hotel and we are being generous with that rating. It was a nightmare trying to get around as we were quite far away from everything and the hotel was extremely hard to find as it was tucked away in a little corner. Do not book this hotel unless you are prepared for a major disappointment. Please do not take this risk because you might be in for the worst stay in Venice of your life!!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good (in some aspects)”", "Author": "HotelCooler", "ReviewID": "UR118693231", "Content": "This hotel has new installations, so you might prefer it if you don't like vintage hotels. Well situated. 5min walk to St. Marcus sq. or to Rialto. Not far from the bridge to the Accademia in order to cross to the opposite Sestiere. Next block to the \"La Fenice\". Close to many options for lunch, dinner and coffee. The room was spacious, but... The furniture was vintage-like with post-modern Kitsch feeling. The same was the black&white dinning room, featuring a gold colored safe! The bathroom was modern, with a mixture of classical elements. I didn't find any amenities other than shampoo and shower gel. No bathrobe, no shoe polisher (look for the electric brash at the seating room), no slippers, no shower cap, no cotton pads... Even the plastic bag for the laundry was missing... Just the laundry price-list was in place. I appreciated the large safe at the room that accommodated my laptop, ipad and valuables. I didn't like the fact that the door was not properly locking and wasn't fixed even after I reported it. It was a nightmare to master the TV, with two remotes and Sky satellite service. Expect WiFi Internet upon a fee. The room was on the way to the reception and all the hotel guests paraded in front of my door, making noise early in the morning, to go for breakfast or check out. Not mentioning that the reception phone was heard as if it was in my room. The breakfast was of limited variety and low quality. The juice was no other than colored water and the American coffee was horrible. Ask to have an espresso prepared for you. The personnel was quite friendly and polite, even though some of them could try to be more helpful. Don't forget add the new Venice-city tax while calculating your accommodation expenses. (â‚¬4 per person, per day, I think). Expect â‚¬70 water taxi from/to train station and â‚¬105 water taxi from/to airport. Water taxi dock just a block north to the hotel. I was expecting more for a 4 star hotel and with such prices. You could try it if you think that it worth your money. I will probably try somewhere else next time.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Gillitts, South Africa", "Title": "“Venice hotel Ca'Alvise”", "Author": "Tarryn S", "ReviewID": "UR118471369", "Content": "We specifically looked for a hotel in Venice that would offer a good view, preferably of the canal, but of the sea, or Venice courtyard would have also been nice, and since we were spending only one night there, we were happy to spend a bit more on the room for that reason. When we found this hotel on booking.com, it offered a Junior Suite which offered, and I quote from the website, a \"Large suite on one the higher floors with rooftop views, free newspapers and sparkling wine\". The views this room offered, and I quote again, were \"View (sea, garden, landmark, etc.)\". When we were shown to our room, it was on the 1st floor with a view of a wall. If we stuck our head out the window, we could see a long narrow street, and only the wall of the building next door. When I asked the reception about this, he said that for the good view you had to book directly on their website. When I showed him our booking confirmation saying the view we were offered and had paid for, he said, our \"higher\" floor was higher than the ground, and the views from our room were panoramic of the street. Our booking was non refundable, which I think is absolutely disgusting, as we were promised a whole lot from this hotel, but when we got there, no promise was kept. For booking a Junior Suit in a supposed 4 star hotel, we were expecting greatness, and the most luxurious hotel on our four week tour of Europe. This was the worst experience of our trip and the most expensive. Although we got this room at a discount for last minute booking, it was said to be marked down from 1020 euro. With a price and promise like that, you can only expect the best. I think it is shocking that a hotel will lure you in with promises of everything you want to experience in Venice, make it non refundable, and then not follow through with what you have paid for. To show you our view, see the attached photo of what we saw from our window! Will not recommend this hotel and will never go there again! Also, the staff at breakfast were extremely rude and made you feel like you were getting in their way, and the cups they set on the table, if you took one to use, they huffed, went to the kitchen to get another and slammed it back on the table behind you. To say as well - there was no where else to get a cup, other than from the table.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "dublin", "Title": "“Very good hotel...would recommend everyone!!”", "Author": "thisisatin", "ReviewID": "UR118165170", "Content": "hotel was very nice and tidy with good facilities and above all excellent value for money.. only negative point (if any) i can point is the location, could be bit hard to find in the beginning specially if u have to carry heavy luggage over 3 bridges... but would still recommend to everyone..", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vodice, Croatia", "Title": "“We truly enjoyed it and we'll be back! After all, this was our fourth stay at Ca'Alvise.”", "Author": "Simona S", "ReviewID": "UR117273850", "Content": "We have stayed at Ca' Alvise in Venice four times so far. It is an excellent hotel in the centre of Venice (San Marco), close to all the most cherished tourist attractions. The rooms are magnificent, clean and air-conditioned, the staff is polite and helpful. Breakfast is truly a pleasure and keeps you going for a long time. True, the price of stay is high, but it is worth every cent. We look forward to our next stay at Ca'Alvise in Venice next year.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“very nice and clean”", "Author": "ritu s", "ReviewID": "UR117078037", "Content": "we liked the location of the hotel .you can walk to all the major attractions.Staff was very nice and friendly.we are family of four we booked family suite which was very nice clean and comfortable .only down side is no tea and coffee making facility in the room.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Brilliantly Baroque”", "Author": "tubz50", "ReviewID": "UR116359152", "Content": "Fabulous hotel, excellent service, prime location. Wonderfully decorated room with lots of interesting features. We loved it!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "2.0", "Value": "2"}, "AuthorLocation": "Potomac, MD", "Title": "“we didn't like it”", "Author": "strinchi", "ReviewID": "UR116289078", "Content": "We were there before (2 years ago) and we were happy. This time I found my room on the third floor without elevator ( it was OK for us, but I think the customers should have known that in advance) and a very old mattress that cause a terrible back pain. I told the reception immediately but nothing was done about it.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Paris, France", "Title": "“I will never come back to this hotel”", "Author": "youssrysaleh", "ReviewID": "UR116008980", "Content": "I was realy shocked, how it comes the bath rooms of an hotel 4 stars without any comfort didn't present anythings except soap which make me feel that i am in one star hotel. the confort in the hotel was very poor. The staff of the reception were aggressive , careless, not welcome , the breakfast was below the averge of any hotel 4 stars. Im very sorry to choose this hotel.", "Date": "July 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Definately overpriced”", "Author": "fionaotoole", "ReviewID": "UR115778133", "Content": "Good location. v clean. staff could have been friendlier one in particular v abrupt. Breakfast not great then again I suppose ok by continental standards. Stayed in mondrian on sunset in LA for less than price of this hotel standards between 2 hotels non comparable. Definately this hotel over priced. However venice is an unbelievable experience and really enjoyed our stay there", "Date": "July 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“They took our booking and full payment for a diamond suite for 8 days, then when we arrived they rudely told us we were to be re”", "Author": "ak47melbourne", "ReviewID": "UR115689179", "Content": "Worse hotel service experience in more than 30 years of travelling - management lacks honesty and integrity, taking our credit card and passport details and only after processing these proceeded to tell us we were to be relocated for the first night to a different hotel. When we told them we didn't understand why they believed this was appropriate treatment, given our booking and payment had been made more than 3 months in advance, they became aggressive and rude. Strongly recommend avoiding this hotel.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“The hotel is very good and I hope we will be back!”", "Author": "SonterOK", "ReviewID": "UR115663703", "Content": "The service and rooms in the hotel are very good! The food should be a little bit varied! And the Wi-Fi should be free!", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "New Mexico", "Title": "“Soured our Venice experience”", "Author": "Jessejac", "ReviewID": "UR115030288", "Content": "This hotel ranks a big \"zero\" with it's staff. In general, they were rude, condescending and overall not helpful. Our children were afraid of the staff, particularly one gentleman who would never greet as they walked in front of the check in desk. When we left, we got no \"we enjoyed having you here, have a good journey back, hope you come back, etc........\" In my humble opinion, the staff at this hotel feel like they can treat people poorly (and get away with it) because of their location. They have obviously lost touch with reality in realizing that people expect to be treated nicely for $500.00/night, especially in todays economy. I truly wish that they read this and other posts. Would i stay there again. NO. On the upside, the location is great and the rooms were very clean.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lannion, France", "Title": "“Very pleasant stay”", "Author": "chouchen22", "ReviewID": "UR115007696", "Content": "4 days in a pleasant room in a Venitian style very clean, large bathroom a canal with gondolas at the windows very quiet Hotel, located near Fenice Theater breakfast was good (even if I prefer french baguette and croissants ;-) Employees very pleasant and helpfull", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "West Linn, Oregon", "Title": "“Very pleased”", "Author": "ibkimo", "ReviewID": "UR114720599", "Content": "This was a great hotel. The location was perfect. The staff was very friendly and so helpful. Our room was huge for European standards, and it was clean and nicely decorated. The breakfast was wonderful! I cannot say enough about this hotel. We highly recommend it and will definitely stay here again. Only negative is that there is no Internet in rooms unless you want to pay 15euro per day...kind high in my mind. Otherwise a great hotel!", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Ashburton, New Zealand", "Title": "“A great place to stay”", "Author": "jack311326", "ReviewID": "UR114585648", "Content": "While on an organised tour of Italy we really enjoyed our time at the Ca Alvise Hotel in Venice. The staff on the reception desk, Simone, Dania and David were so friendly and obliging. Their very good understanding of English made life easy for folk who didn't speak Italian. The rooms were comfortable, clean and convenient. Breakfast was served in the very nice dining room. The food was excellent with a good variety to choose from. We were able to choose our dinner from one of the many restaurants nearby. The hotel is ideally situated in the old part of Venice beside a canal. We were able to watch the gondolas passing by. St Mark's Square is a short walk through the attractive little streets and over humped bidges in an area with pleasant surprises around each corner - a fascinating place to explore. I recommend the Ca Alvise as an excellent place to stay.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Caracas, Venezuela", "Title": "“Not good , cost vs service”", "Author": "wael196178", "ReviewID": "UR110703103", "Content": "a 250 euros room by night, old matrix,dirty,insect,no free wi.fi , 15 euro 1 day !!! a very poor breakfast, need better maps en web site,and recpt. desk, to help guest find the way faster frome tren or boat stop, no warm welcome,agresive personal, treart guest vey hard short and acid way,using not nice voice, it was a lot of money 4 this service, instalation,and services..and its 4 star hotel..but..its notehing more than 2 star hotel...dont be a excited traveler, look every way 1st. B 4 U BUYanything, price will be dif frome street to next one,GONDOLA servie is very expensive 100 euro for only 40 mints. is the same way you can walk it, food not so a great ,services very basic, small plats ,drinks extremly expencive, water 2 euro small siza, berr 4 euro frome market 7 to 9 en restaurant..MURANO is shipper en the city than tha factory..!! be carful about falsification, the city is full of MADE EN CHINA glass...no need for using water taxi , and public transport U can walke it ,very short distance but en map seem like very far so thy tell u to take a boat..just tu Murano island or lido you need transportation..go to LIDO ONLY IF YOU WANTE TO USE BEACH..there nothing to see or do there ,the same thing for other shors.. dont be a over excites visitor, be calm think it objective way and you will save money..", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bologna", "Title": "“Cheap luxury”", "Author": "SiriBologna", "ReviewID": "UR109108321", "Content": "Not easy to be reached by a tourist (street not easy to be found) but very close to Piazza S. Marco. Unfortunately no elevator (for old customers it is quite tiring). Staff not so helpful to old people (tired to make escalators).", "Date": "May 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Definitely not a 4 Stars hotel, find another hotel!”", "Author": "JOJOELLE", "ReviewID": "UR108681173", "Content": "We booked this hotel from the website as we thought they are located in th prime area near San Marco Piazzo and it's look nice from the website and they said they are 4 stars hotel so we thought it was the right choice but we encountered many problems which do not give us a good memory of this poor serice hotel at all and I do not recommend this hotel to anyone, better do more homework and choose another. -The location is quite hard to find as Google Map was wrong so we were having some difficulties find it. -The Hotel has a very poor layout as our room is in the first floor but we have to go upstair, downstair and then go upstair again in order to find the room! -The air conditioner/heater doesn't function although they were in the hotel we tried to open it but they are not working and we called the reception and she respond that she doesn't know whether there is an air conditioner in the room! So when we check and call back she said it's out of order.... The whether in Venice is nice but in the hotel room it's a bit hot so we were sweating and doesn't have any comfortable nights -There were bad smell in the toilet especially after maids clean up -When we finished booking and already paid for room services and got the voucher from the agent the hotel send us an e-mail that our reservation has been registered but not confirmed so we have to write them 2 times until they confirmed (as I read from another reviews by other guests, this hotel is part of chain so sometimes they tried to move guest to other hotels in the nearby area to fulfill other hotel capacities) SO BEWARE OF THIS ITALIAN TRICK! -THE WORST THING IS THEY ARE RUDE! When we checked in I tried to help the porter with the bag but one of the receptionist yell at me \"PUT THE BAG DOWN\" in a very loud and orderly voice! -all receptions should go to a serious SERVICE training as they are quite rude and doesn't seem to care hotel's guests at all. -Lights bulbs in the room are very hot and they could burn your finger and also increase the room temperatutre as I accidently put the hand towel near the light bulb and the towel was burnt and got a small hole in it and the hotel charge us 20 euro for this tiny small hand towel. -At night there are always noise in ther nearby area so you can't have a great comfortable night here. -They claimed to be 4 stars hotel but I think they are 2 Stars at MAX. SUMMARY: Unless the hotel management do something about their POOR and RUDE Service then DO NOT STAY HERE!!!! -", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Excellent location, good value for money”", "Author": "silke_moss", "ReviewID": "UR106473398", "Content": "This hotel is situated right in the middle of the San Marco district, but yet it is quiet and we were never disturbed by noisy crowds. The rooms are not very big, but no hotel in Venice has big rooms, but perfectly adequate for our needs, even with a very tall teenager. It was clean, the breakfast was buffet style with plenty of choice. The only thing that may be could be improved is the quality of the bread !!", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whitby, United Kingdom", "Title": "“Venice - all we expected, and more.”", "Author": "Iain1050", "ReviewID": "UR104031713", "Content": "The hotel was ideally situated for our sightseeing visit. Comfortable, quiet and friendly, it offered great value for money, good service, and well presented buffet-style breakfast. Our room overlooked a small canal, giving us views of passing gondolas. We needed an early check-out on the day of departure, which was delayed because the staff on duty couldn't process our final account promptly, in spite of us having made enquiries regarding this the previous evening. Allow plenty of time to get the water bus to return to the airport - we caught an earlier one to allow for any delays, and were glad we had.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Nightmare to find but OK”", "Author": "nickb1968", "ReviewID": "UR103758466", "Content": "Firstly this Hotel is a nightmare to find with any ease. My advice, especially when arriving with luggage, would be to use the Vaparetto stop at San Angelo and ignore the directions shown on the hotels web site. The hotel will tell you to use San Marco but this involves crossing 3 bridges and is a less simple route where you can get easily lost. You can take the Ailaguna (Orange line) direct from the airport to San Angelo and the hotel is a very straightforward 5 minute walk away over just 1 bridge. Secondly this hotel is ok. You get what you pay for and it is no different here. Our room could have done with a lick of paint but overall it was fine. Sadly even though it was very hot, the hotel were apparently not allowed to switch on the air conditioning so our room was fairly hot. Opening the windows unfortunately led to midges/mozzies coming in our room (this is probably a problem with Venice in general - slow moving water and insects sounds like great place for biting things to live and breed !!!!) and taking chunks out of us !!! Oh and don't think that you'll be able to iron any crumpled clothes - irons are a fire risk and the hotel will not lend you one (the place is built on water for goodness sake !!!) On the plus side it is very well located and once you get your bearings you will find everything on your doorstep.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bracknell, United Kingdom", "Title": "“the perfect hotel for the perfect stay”", "Author": "lilly1969_11", "ReviewID": "UR103662865", "Content": "Magnificent from the start to the end. The experience in this hotel is second to none. I booked from Uk and i left notes about preferences like stay on the first floor because of my young son or having a nice room as fist time in Venice and guess what? all was given! The staff was very helpful and the room was beautiful.The location was between Rialto and St Marks Square and surronded by locals shops full of delicious cakes and tipical local food. The breakfast had loads of choices but mostly continental and not enough english cooked breakfast (as my husband said) but overall ok to be full by the time you leave for the day. There is also a kettle in the room but not coffee so bring your own but tea is always present.The bath with Jacuzzi is to die for and my kids had a whale of a time. I would def reccomend this hotel and i am def coming back to it.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riccione", "Title": "“The ideal location for visiting Venice.”", "Author": "lelep", "ReviewID": "UR102744701", "Content": "Excellent hotel.Lo staff is friendly and professional. The location is excellent. Recommended.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vicenza, Italy", "Title": "“Very quite place and very well located”", "Author": "francesco_negrin", "ReviewID": "UR100927790", "Content": "The hotel has a beautifull location, very close to San Marco. The place and moreover the rooms are very quite. The quality/price ratio is very good and I would recommend the hotel.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rouen, France", "Title": "“a nice hotel but not easy to find it”", "Author": "italienne049", "ReviewID": "UR98667171", "Content": "a very nice decoration and a beautiful breakfast, but we disagree there not any indications in the streets to find it and also the welcome no smily when we arrived.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Brilliant hotel. Room and breakfast were great”", "Author": "Latinquarter", "ReviewID": "UR97333406", "Content": "Ca'Alvise was a great place to stay. Very central to everything, even though it took some finding. Make sure you have a very detailed road map of Venice and know exactly where the hotel is on the map. We spent alot of time getting very lost! It was great value for money and the rooms were lovely, large and comfy. Also a great power shower. The continental breakfast was a perfect start to a long and energetic day. Everything we needed was supplied (even umbrellas ona rainy day) Maybe could have done with an English TV channel or two for the evenings but we had plenty of Venice guide books to read so no big deal. Overall loved the hotel. Perfect for a action packed, enjoyable trip to Venice.", "Date": "February 20, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Cambridge", "Title": "“Please Avoid - Dreadful Service”", "Author": "OutandaboutCambridge", "ReviewID": "UR96712834", "Content": "To put this review in context we are a professional couple who travel frequently. We had a paid reservation at this hotel which was confirmed by the receptionist and on our associated paperwork. However we were told that we didn't have a booking but were being moved to a partner hotel? When we questioned this we were shouted at and told to sleep in the reception as they didn't care (on reflection this will become a wonderful dinner party story, however at the time they were extremely rude and aggressive)! To make matters worse we were not the only bookings that were 'bounced' to other accommodation - TWO other couples were moved that I saw - I presume that they must overbook and move 'guests' elsewhere when it backfires! Anyway ended up in a lower star hotel in another part of the city and am pursuing the matter from the UK. Be warned a confirmation holds little value and you may well find yourselves seeking alternative accommodation in a busy city!", "Date": "February 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Olbia, Italy", "Title": "“excellent location and good price”", "Author": "laucroft", "ReviewID": "UR96050088", "Content": "I'd like a good italian coffee or a cappuccino for breakfast... being in Italy! I usually prefer a modern style but it is appropriate for Venice", "Date": "February 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "bolton", "Title": "“A nice surprise”", "Author": "BoltonMonkeyfish", "ReviewID": "UR95656557", "Content": "We actually didnt book this hotel for our stay in Venice but we where so pleased that our origianl hotel wasnt available and would choose here if we where to come again. We where dubious about the location, as all the reviews seem to indicate that the hotel is hard to find, it isnt honestly. Although we did get lost once, but then thats Venice, you just need a good map. The hotel could be reached from a number of Vaperetto stops, Raialto, St Marcs Valaresso, St Angelo and Academia. None of which where more than a 5 to 10 minute walk away. The hotel itself is quirky, the furnishings can not be called modern, but they do look authentically venitian, think old school Italian decadance. On the plus side the room was huge, we had a \"gold room\" which was really big, a huge surprise for such a central hotel. The bed was comfy and the room warm enough considering we stayed in January.We even had a dressing room between our bedroom and bathroom which consisited of a wardrobe, dressing table and sofa. As mentioned the jacuzzi baths are great, and the bathroom was clean and roomy. Breakfast must have improved since older reviews as there is a great choice. They had coffee, tea, 2 choices of juice, bread rolls, 3 types of croissant, jams and chocalate spread, ham, salami, cheese, bolied eggs, 4 cereals, fresh friut and yoghurts.A good choice for a continental breakfast we thought. The only negatives where that as mentioned the hotel does not supply milk, though there are facilities, kettle, cups etc. We just took our own tea bags and sugar and bought milk there, the room has a mini bar fridge to keep it in so its not really a problem. We didnt have much to do with the staff to be honest, but check in and out was fine, no problems and breakfast staff where O.K. We would stay here again definately, Im not sure I would rate at 4 star, but 3.7 ish. Our room although near the stairs was relatively quiet too, though we did ask for a low floor room, as mentioend there are no lifts and 4 floors I think, so beware if you have lots of lugage or due to mobility.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberystwyth, United Kingdom", "Title": "“Fantastic location and interesting decor”", "Author": "Chrissiemorris", "ReviewID": "UR95262914", "Content": "We had a fantastic stay. The hotel is centrally placed within comfortable walking distance from St Marco, several water bus stops, the Rialto and the Accademia bridge. The room was warm and clean and well serviced with an excellent large bathroom with jaccuzzi bath, bidet, shower etc. The breakfast was okay too, but get down early- ish for the best hot coffee. Only one English breakfast teabag in the room, plus some herbal teas. Would have liked milk , better tea and instant coffee. Local greengrocer sold milk though. We were in a diamond room. More detailed directions from the water bus would help. (Find La Fenice theatre, stand with your back to the little bar opposite and Ca Alvise can be seen down a narrow alley, just over a little canal bridge.)", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Fantastic Venice, Fantastic Hotel in a great location”", "Author": "ScouseManKent", "ReviewID": "UR95252160", "Content": "Our original hotel was not available so we didn't have a lot of detail about this hotel. But we had nothing to worry about. This hotel was great - friendly staff (especially as my wife was ill on the day we left and they let us stay past the normal check out time), room was very good and the breakfast was also good. But the best point about the hotel has to be the location. We are already talking about going back!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "bastia", "Title": "“Very nice hotel, clean, comfortable, personal very efficient, good breakfast”", "Author": "sapato", "ReviewID": "UR93508385", "Content": "Very nice hotel, the bedroom was very comfortable and clean, we apreciated the jacuzzi, and the large bathroom, the breakfast was completed and very good ! Personal available night and day. Thank you for all!!!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Not good but also not horrible”", "Author": "DeaSR", "ReviewID": "UR93248228", "Content": "Unfortunately our choice for a hotel in Venice was not that good. This hotel was sort of well located (close to La Fenice theatre) which compensated a little bit the drawbacks: the room was not very clean and the staff was not very helpful specially at the breakfast room. Breakfast itself was shameful with bread and croissants not baked well. My mother, my sister and I reckon that we could have found another hotel with better service for the same price.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Venice nice but not this hotel”", "Author": "MarcoTrovato", "ReviewID": "UR92628940", "Content": "Bed was uncomfortable and the shower was so small that the hydromassage was barely used. So getting a platinum room is a waste of money. Moreover the bathroom got flooded all the time we took a shower. However Venice was very nice", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great hotel in perfect location”", "Author": "dgt123", "ReviewID": "UR88283930", "Content": "We stayed here between 19th-23rd November 2010. I agree with the recent review about the dodgy decor! OMG! It's mind boggling that anyone would think this was nice! It didn't spoil the trip though because the hotel was clean, comfy and the staff were friendly and efficient. Who comes to Venice to spend time in the hotel looking at the decor anyway?!! Check in/out were both hassle free. The staff that we spoke to all spoke English which is a good job since my Italian is embarrassingly poor! The breakfast was a reasonable continental breakfast consisting of croissants, toast, yoghurt,ham, cheese, cereal, coffee, juice, fruit etc which was fine for the 4 days we stayed there. I think I might have been sick of it after a week though! The location is perfect - 5 mins walk from St Marks Square and the same to Rialto Bridge. Couldn't ask for better. It's not the easiest to find though, especially if you're carrying suitcases! The room was clean and comfortable. There was a kettle, but it only came with a seclection of fruit tea. Some coffee would have been nice during the long wait for my other half getting ready! The bathroom had a jacuzzi bath which was a nice touch after a long day on the move. The room also had a mini bar which was expensive but not a problem as minibars are always expensive. I've read a few complaints about no English channels on the tv - I found 2! (well, 1 1/2!) CNN news and MTV (mix of English and Italian). Who wants to watch tv when in Venice anyway?! On Venice itself...a wonderful place for a short break. Very expensive, but if you expect it and avoid the main tourist areas for food it's slightly cheaper. November is a great time of year to go - I can imagine it's a nightmare in the Summer as it'll be hot and extremely overcrowded. The vaparetto (water buses) are excellent, as are the trains out of Venice - much better than the UK! A gondola ride is an extortionate essential for a first visit to Venice! (Budget 100 euros for this). Overall i'd return to this hotel next time i'm in Venice and would recommend it to a friend without hesitation.", "Date": "November 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“A nice place sith a good location”", "Author": "christine195804", "ReviewID": "UR82824440", "Content": "I did get a room in a building a little bit away from the actual hotel and its reception. The room was great, very large, nice bathroom and clean. It also had a little balcony aboove the canal with gondolas passing by. Very good location (2 minutes to St Marks square). The breakfast room was in the same building. The breakfast was good and the staaf friendly. The only thing that felt a bit peculiar was that there was no hotel reception in the building.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rimini, Italy", "Title": "“excellent location, really nice stay”", "Author": "romi_gar", "ReviewID": "UR77930451", "Content": "we enjoyed our stay very much, very nice and friendly staff, comfortable room, good breakfast service few minutes walk from san marco square and other amazing places in venice", "Date": "September 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "England", "Title": "“Hotel ok but great location”", "Author": "Trudyhiggy", "ReviewID": "UR76945471", "Content": "The hotel was ok, but i would probably give it a 3* rather than a 4*. It is clean enough but bathroom was very smelly. NO english channels on the tv. Not much variety at breakfast, very small and dark room. The location of this hotel was very good.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sparkyblb", "Title": "“Ca'Alvise”", "Author": "sparkyblb", "ReviewID": "UR76581023", "Content": "We had been travelling for nearly 3 weeks when we arrived at Ca'Alvise. It was wonderful to walk into a lovely family room with comfortable beds. Breakfast was good. While it isn't easy to find for a 1st time visitor to Venice, it was very convenient to Rialto or St Mark's square and in a quiet location. We had a luxury family room on the 1st floor, which we were surprised at how large it was given we were expecting small rooms in Venice. If coming from the station or bus terminal, I would recommend you catch Line 2 to Rialto rather than S Angelo. By the way, the takeaway pizza store around the corner was fantastic. Only downside was you had to pay for internet usage.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nice, France", "Title": "“very nice”", "Author": "laurent1515", "ReviewID": "UR71933227", "Content": "very nice hotel, team members very helpful, hotel is close to St Marco (less than 10 mn walk) and then is a very good alternative.", "Date": "July 22, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose", "Title": "“Very cosy and whimsical”", "Author": "TravelNormad", "ReviewID": "UR71709214", "Content": "Stayed for a night at the hotel, must say was very surprised at the size of the rooms and decor. Loved the venetian style rooms with ornate chandeliers . Jacuzzi was a good additions. Breakfast room can get crowded but it did not matter to me. Was easy to find.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Nice place, but as most places in Venice is hard to get there.”", "Author": "Cachirulo64", "ReviewID": "UR70375636", "Content": "Plan carefully on how to get there, otherwise you will end dragging your luggage around endless little plazas, tiny streets, bends and stairs. If your using the Vaporato, the San Angelo is your closest dock. It would be nice if someone offered baggage transfer between airport/train station and hotels.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“Romantic and classy”", "Author": "miltiadisK", "ReviewID": "UR69290267", "Content": "Room 114, maybe not fit for over 65 but romantic and spacious, very clean and with a perfect double bed. Breakfast was not something you looked forward to If possible ask for a room that doesn't face the interior yard", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "APO", "Title": "“One of the best hotels in Venice”", "Author": "inqster21", "ReviewID": "UR68610448", "Content": "I read the other reviews posted and went with this hotel....absolutely no regrets. We traveled with small children and it was one of the best hotels we visited in Europe. We were expecting the breakfast to be poor based on the other reviews but we were pleasantly surprised to find out the breakfast was just fine. Of course, it is a typical European breakfast so if your not used to that then you may not like the breakfast. We will definitely go back to this hotel. The staff was great. They even made life very comfortable for our dog!", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coffs Harbour", "Title": "“Superb location and style”", "Author": "rider53", "ReviewID": "UR68499581", "Content": "My wife and I and her sister and husband stayed in this charming hotel and can't praise it highly enough. It is located centrally to all the tourist areas like the Rialto bridge, St Mark's square etc.. Great rooms, great service, great staff, great everything!!!", "Date": "June 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Africa", "Title": "“Highly recommended - very hard to fault - keep it up !”", "Author": "paulvw57", "ReviewID": "UR68179581", "Content": "Great location near to popular San Marco square, well appointed (recent refurb), very clean, friendly polite professional service offering good local advice (thanks Silvia), good breakfast, overall great value. I will definitely return in future visits to Venice.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“A good hotel in a great location”", "Author": "Fenster_no2", "ReviewID": "UR67448107", "Content": "Whilst nothing spectacular, Ca' Alvise provides a decent value for money stay in a fantastic location. Less than 10 minutes walk to St Mark's Square and the Rialto Bridge cannot be sniffed at. The decor was a little dated but everything worked as it should (although the bathroom door had to be persuaded to function at times). The staff were helpful, breakfast adequate and given Venice's expensive reputation, a sensibly priced stay. I would recommend it to others. Given how long you'll actually spend inside a hotel whilst in Venice, I see no need to spend more than you'd be charged here.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quirky little hotel in the heart of Venice”", "Author": "Alistairio", "ReviewID": "UR64485969", "Content": "This is a great little hotel in a fantastic part of Venice, near St Marks Sq. It is very difficult to find, so make sure that you get very clear directions from the best boat stop before you arrive. I foolishly followed google maps on my blackberry which took me to the wrong place. Decor in the hotel lobby was pretty bland, but our room was very individual with old Italian furniture - a nice change from the corporate hotels I seem to find myself in too often.", "Date": "May 18, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Jyvaskyla, Finland", "Title": "“Did not even get to the hotel and the \"service \" was terrible”", "Author": "Kauno02", "ReviewID": "UR64102172", "Content": "I booked this hotel well advanced since I vanted to be shure weÂ´ll get a good room. 2 weeks before our trip the hotel informed us that they can not make a payment-reservation on our creditcard. Gave them another card; same thing. Called bank, they said that there are no attempts to make a payment-reservation on either cards. Gave them a 3. card and called the hotel. Matteo on the desk couldnÂ´t care less!!! Asked them to keep the reservation till I try to find out whats the problem. Soon I got an email telling that our reservation has been canselled. The bank told me that still there were no attempts to make a payment-reservation on any of the cards. Either the frontdesk canÂ´t do them or they had an overbooking situation and they just got rid of Finnish customers who usually donÂ´t even complain. Well, the rudeness of the frontdesk- people was so unattractive IÂ´m clad we didinÂ´t get the room!!!", "Date": "May 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Nice Hotel let down by the staff”", "Author": "stimpyscotland", "ReviewID": "UR63818583", "Content": "Just back from the beautiful city of Venice. The hotel was in a great location 5mins from both the Rialto Bridge and St Marks Square. Our room was really spacious and had all the mod cons. Breakfast was fine. Only down side was the Reception staff, in particular one young man with a beard (not sure of his name) was particularly rude and obviously unhappy with his job. Apart from that had a great time. Would still reccomend the hotel, I'm sure the bearded receptionist want last too long.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“No Real 4L Stars Hotel, But A Good 3 Stars Value”", "Author": "Venice2010", "ReviewID": "UR63779427", "Content": "Bad Part: - No real big bed for two, but two little beds joined as one - Poor and tasteless breakfast - No lift inside Good Part: - Location (Walking = 5 a 10 minutes from the \"Piazza San Marco\") - Price for de room - Bathroom with â€œJacuzziâ€�", "Date": "May 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Clean, comfortable, quiet, friendly, well located small hotel”", "Author": "BelsizeLondon", "ReviewID": "UR63226710", "Content": "This trip - a birthday present from my wife - was the first time she or I or our two friends had visited Venice. We are all experienced travellers and were all very satisfied with the accommodation provided. The hotel is quiet but well located providing easy access to the main attractions. The staff, Simon, Sylvia and Michael are extremely friendly and helpful, the service is good and the rooms which are clean and comfortable are decorated in traditional Venetian style. The continental breakfast was more than adequate. The value for money was excellent and we wouldn't hesitate to recommend this hotel.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Ca' Alvise - Great location”", "Author": "Abeyta_CLD", "ReviewID": "UR61784265", "Content": "Venice is a tricky place to navigate if you don't have the correct map. Once we found the hotel, it was easy to get to all the time. Ca' Alvise has a beautiful boutique feel from the second you enter it. Clean and classy and welcoming. Our room was on the third floor and without an elevator, our luggage was a bit of a chore to get up the stairs (the third floor actually means 4th floor because ground floor where the lobby is is on 0). The room was very tight for 4 people . . . just beds and a bathroom. Outlets were hard to find to charge our equipment. The windows gave us the ability for a nice cross breeze. The bathroom was actually quite large welcoming. The outlet in the bathroom had a US (110v) and Italian (220V) outlet so that was nice. To promote Murano, the hotel offered a complimentary water taxi to the island which takes you directly to one of the glass production facilities. There was no obligation to buy anything and there was a full demonstration. To get back, you either took the vaporetto or paid â‚¬50 for another taxi back. There was a comfortable lobby down stairs so you could just sit (as the bed was the only place to sit in the room). The breakfast buffet was simple but delicious and bountiful. Staff was cordial. When arriving to the hotel, it is wise to know which vaporetto stop to get off on and please know the address of the hotel. I only have one picture of the hotel. My photos of Venice can be found at http://www.flickr.com/photos/labeyta/sets/72157623748802311/. Contact me with any questions.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Barcelona", "Title": "“Great Hotel! CÃ¡ Alvise has everything that you expected from a good hotel.”", "Author": "claudioversiani", "ReviewID": "UR54862963", "Content": "Great location, very clean, safe. And the most important, friendly and nice staff. Especially Silvia and Simone at the front desk. Simone is the right guy at the right place. Thanks for a great and pleasant week. Claudio and Maria LÃºcia from Barcelona.", "Date": "January 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“A fantastic break in a beautiful city in a lovely hotel”", "Author": "Jake1959", "ReviewID": "UR53391936", "Content": "My husband and myself visited Venice in February 2009 for four nights. We had a lovely time the hotel was excellent and staff very friendly and helpful. It was very central and catered for all our needs. The room was lovely - nicely decorated and very clean.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“OK considering not where planned”", "Author": "PO2", "ReviewID": "UR39055917", "Content": "This was where we were moved to. Not on the Grand Canal but staff was good. Other than location our only complaint is that the bathroom had mold", "Date": "August 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Toronto", "Title": "“Not what expected”", "Author": "torontogirl2009", "ReviewID": "UR34025023", "Content": "Overall I was unimpressed with this hotel. The front desk staff were very nice and helpful and the breakfast was good with alot of variety (but very 'European' so if you eat alot for breakfast, you may go hungry!). The location was quite close to St. Mark's Square which was nice. However, for the cost of the room I thought it was outdated and unimpressive. There was absolutely zero counter or sink space in the bathroom, which was a tad frustrating. When I return to Venice I may look for a hotel that offers a little more for the price.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "england", "Title": "“not a four star hotel”", "Author": "bluebellengland", "ReviewID": "UR32985943", "Content": "Very hard to find if you follow hotels instructions. rooms clean and good size but shabby and in need of a paint. No hot water, hotel staff rude and hostile when i complained about the lack of hot water. Breakfast ok but nothing special. Lists coffee making facilitys but no coffee, rooms not sound proofed as discribed. Much better 3 star accomadation availabe in Venice for less money. location off the track, but within walking distance but you need a good map and a very good memory. staff give very incorrect information about water taxies etc.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "From Miami", "Title": "“Very centric......”", "Author": "TravelersFromMiami", "ReviewID": "UR30558439", "Content": "This hotel has an excellent location in Venezia, we spent there only one night, but it was very convenient. The room was decorated in a typical venetian style , very ornate and rich looking , the bathroom was excelent, modern , it had a jacuzzi, which we enjoyed very much, very confortable, spacious, place. Breakfast was served also in a very elegant place, a very enjoyable atmosphere. When we arrived our lugagge was kept until it was time to check in, which was very nice of them. The only regrets was , that the hotel does not have a lift, the beds are not all that confortable and the AC was not all that good. Other than that, Ca' Alvise has a lot to offer.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Wonderful hotel to celebrate a special birthday”", "Author": "GizmoMisty", "ReviewID": "UR28611916", "Content": "My husband booked this hotel to celebrate a special birthday for myself as a surprise birthday present. Arrived early evening to find that the hotel had overbooked and we were moved to an adjacent hotel for the first night. To our delight we had a spectacular room, complete with balcony overlooking the canal and wasnâ€™t put out in any way. The hotel staff arranged for our bags to be transferred the following day and we were then delighted to learn that we had been up-graded to a platinum room for our inconvenience. Hotel was very clean and comfortable having recently been renovated. Rooms were spacious and one of the most comfortable beds weâ€™ve ever slept in!! Bathrooms were a good size and an added bonus having a Jacuzzi to soak your tried body after walking all day. Room had a flat screen TV which had satellite but unfortunately we were unable to find any English speaking channels except for MTV. Our only criticism was that for all the modern facilities the hotel had, we would have liked a docking station for our ipod and although we had tea making facilities, unfortunately no coffee sachets were available. Mini bar was adequately stocked and at a reasonable charge to say you are in the heart of Venice. The continental breakfast was very good with a wide range of food and drink to put you on for a busy day ahead. The hotel was in a super location which was in a very quite part of San Marco but only a few hundred yards away from the bustling streets off St Marks Square. As a wonderful gesture from the staff at Ca Alvise we returned to our room on the day of my birthday only to find a complimentary bottle of champagne to my delight! Nothings better than to sip champagne on your birthday whilst in a Jacuzzi in Venice. Most enjoyable. Overall we had a most enjoyable stay at Ca Alvise, staff very polite and friendly. We wouldnâ€™t hesitate at all returning here in the future or recommending this hotel to anyone else. Thank you for making my birthday very special.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cambridge", "Title": "“A very enjoyable anniversary week at Ca' Alvise!”", "Author": "Happyholidayer09", "ReviewID": "UR27865415", "Content": "We had planned a romantic week for our 25th Wedding Anniversary to visit Venice and we booked this hotel on line with only the information given to go by. I carefully printed out map details from Google before we went and we found the hotel quite easily after a couple of wrong turns. It is in a very quiet location next to a small canal and bridge and near to selective shops. It has been totally renovated recently as stated in the brochure. We arrived early but the staff let us leave our luggage there to allow us to go off and explore. Also, we had an upgraded room at no extra cost. We found the room very pleasant and spacious with a large bathroom with a shower but no bath. This was adequate for us â€“ my wife was pleased to have a hairdrier and a very clean bathroom. The bed and furniture were comfortable and the room was cleaned daily. We had a very enjoyable week even experiencing the spring flood in St Mark's Square and the hotel's location is ideal for visiting the centre of Venice . Our room had all mod cons with flat screen TV with Italian channels(reception not perfect) but also had a satellite receiver which was set up for the continental Hotbird channels(not Astra for UK) but we were still able to find some English speaking programmes to watch. We also had a very good mini hifi with CD player which we used when we bought a CD from the Opera House during a visit there. And, we found the minibar fridge very useful and at reasonable cost. Plus, a good buffet breakfast kept us going each day. Overall, we had a very enjoyable stay at Ca' Alvise and look forward to returning there again in the near future, if pricing remains reasonable, and have no hesitation in recommending this hotel to others.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Fantastic hotel...in a fantastic city”", "Author": "crt77", "ReviewID": "UR27806140", "Content": "A friendly and welcoming hotel...the rooms have recently been renovated and have been done to a high standard. I travelled with 2 friends and we shared a family room. It had plenty of room and a great ensuite bathroom...even with a Jacuzzi! My only moan about the room was the lack of tea making facilities. Breakfast which was included was continental and organised by a hard working team. The hotel organised trips for us out to Murano which was an added bonus. We thoroughly enjoyed our stay and with it being only 200 metres from St. Marks, it is the perfect location f", "Date": "April 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Yalding", "Title": "“Great Hotel - Excellent Location”", "Author": "addickted", "ReviewID": "UR27704644", "Content": "We've just returned from three nights and four days in one of the most beautiful cities in the world. We would recommend anybody who wishes to visit Venice to attempt to stay in the centre of everything - and this Hotel is certainly within 10 minutes walk of virtually everything you would possibly want to see, yet is set in a quite area with nothing but the pleasant sounds of the adjacent canal to send you off to sleep. The Hotel itself is very comfortable and very clean. We chose to upgrade to a Platinum room for an extra 10 euros a night. Both the room and en suite were large and more than adequate - the jacquzzi was a bonus. About 20,000 satellite TV channels - though most English speaking ones were scrambled. It would have been nice if the bar could have stayed open later than 8pm! Breakfast was the usual continental smorgasbord, fresh and plentiful.", "Date": "April 9, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "baileys50", "Title": "“Venice and all its bridges”", "Author": "baileys50", "ReviewID": "UR24223015", "Content": "stayed at the Ca Alvise 4 star hotel not sure how stars are awarded but this hotel is good clean nice buffet breakfast rooms are class only the night porters we met refused to serve us a drink after 8 pm . the mini bar better check it cause some of the contents are empty and you will be charged. Restaurants vary in prices and might close earlier than what is written on there windows.", "Date": "February 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Clonmel", "Title": "“Good Location, Ok Hotel”", "Author": "Tippguy", "ReviewID": "UR19540768", "Content": "The room was ok what we expected and the hotel is central enough.. Staff were ok but they were not able to deliver the breakfast quickly enough not warm enough. The tea was even cold. Venice is truely a great town..", "Date": "August 30, 2008"}], "HotelInfo": {"Name": "Albergo Ca' Alvise", "HotelURL": "/ShowUserReviews-g187870-d809807-Reviews-Albergo_Ca_Alvise-Venice_Veneto.html", "Price": "$182 - $714*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle della Verona 3673</span> | <span class=\"extended-address\">San Marco</span>, <span class=\"locality\"><span property=\"v:postal-code\">30124 </span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "809807", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/18/63/1863c07df91aafc50a0f2815212d432e1large.jpg"}}