{"Reviews": [{"Content": "The Worst Hotel Ever! This was the worst hotel I have ever stayed at! The front desk peple were very rude! The 1st night someone was trying to check in late at night while we were sleeping,  no one was at the front desk so that person just kept honking their horn! There were bugs in the room, the bathroom was disgusting, the pillows were harder than a rock, it looked like it was 2 pillows sewed together! I had to go to a store and buy a new pillow just so I could sleep! The next night we were awaken at 2:00 A.M. by screaming, profanity, cars screaching in parking lot, people running and stomping above us. It was alot of people partying extremely loud until 4:30 in the morning. We tried to call the front desk but noone answered, so we called the cops. The cops didnt even show up to do anything.We payed $75/night, later we heard the Hilton by the airport was charging the same rate! So we will definately stay there next time.I wouldnt recommend this hotel to my worst enemy!", "Date": "May 18, 2008", "ReviewID": "UR429899916", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "jenshine"}, {"Content": "Avoid this motel at all cost We booked a two bedroom apartment for four people for just one night. We arrived to find it was a motel rather than a hotel, with some very unfriendly guy at the reception. We wanted to have a look at the rooms first, but he declined, pay and get to look at the rooms or leave. Then, he found out that we have a dog with us. No dogs, he tells us, only to leave to the back, return and tell us that the dog would be OK for $50 extra. We gracefully declined, and two of us went on to use the apartment, we were to leave with the dog to find some other property. The receptionist actually followed us to the parking lot to check if we really did leave with the dog !! The two people staying at the Motel then told us that rather than a two bedroom apartment, they found some cheap room with two double beds in it. For the same price we paid at the Mission Inn, we spent the night at the Hilton SF financial district with great bay views rather than the Mission Inn in a run-down neighbourhood.", "Date": "Nov 13, 2007", "ReviewID": "UR736924430", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "AriGold444"}, {"Content": "Scary Motel We were in town for a long weekend and thought we would save some money and stay at the Mission Inn. Oh My God!!! We stayed one night there- I slept in my clothes, the bed was so gross. There was hair onthe walls of the shower BEFORE any of us got in. This motel is in a HORRIBLE location. We checked out after the first night (they did give me my deposit back, but I honestly didnt care at that point) andwent to another hotel. Ended up paying $400.00 per night at our new hotel at Fisherman's Warf - but we didnt care about the money, thats how bad this place was. There were these young thugs having a party in a room close to us....there was some scary stuff going on over there. This is NOT in a safearea at all.Cause we wanted to try and save some money - we ended up paying about $1,200.00 on hotels for a 3 night since we had to pay for the Mission up front, but at that point it didnt matter. Pay the extra money and stay someplace safe.", "Date": "Oct 16, 2007", "ReviewID": "UR291059186", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "trizz96"}, {"Content": "Worst Hotel Ever I am all for cheap hotels but the Mission Inn was very dissappointing. I was late for check-in and because of that I was forced to sleep in my car and I was charged for that night. Nobody was at the front office until the next which they arrived late. On top of that they have bad customer service and feel it's a priveledge for you to stay at their hotel. I would highly advise against booking this hotel.", "Date": "Oct 1, 2007", "ReviewID": "UR358495095", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "psoto82"}, {"Content": "The worst place to spend a weekend - dont go there       Mission Inn", "Date": "Jun 30, 2007", "ReviewID": "UR680312873", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "floathegreat"}, {"Content": "Liars and Cheats On May 25th we booked our reservations at this Mission Inn for two nites May 26th and May 27th. We drove all the way from Bakersfield California and finally reached the motel. We walked into the front office and there were two people behind the desk, a man and a lady named Josie. We tried to check in but Josie said that they never received our reservations and there were no vacancies anyway. We showed her our confirmation for the room via email but she profusely shook her head and looked away. She said she could not help us.We finally was able to obtain another room in San Francisco and finish our vacation (we're from Hawaii). Once we got home we found out they charged us for the room which we have never received. We called and demanded a reimbursement and they hung up on us!Recommendation: If you are planning a vacation don't travel to San Francisco!!!!!!!", "Date": "Jun 16, 2007", "ReviewID": "UR149986376", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "cardoHawaii"}, {"Content": "Best Place in San Fransisco This Inn has to be the best place in San Fransisco, the entire area and room was spotlessly clean, friendly staff to welcome you to San Fran,Ample parking and the complementary breakfast was excellent. Many thanks for a great stay at your Inn.Noel  Lillian ... Ireland.", "Date": "Jun 15, 2007", "ReviewID": "UR293589427", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "carbootseller"}, {"Content": "STILL HORRIFIED from this ROACH infested NIGHTMARE of a motel We booked on HOTELS.com just to find out when we get there that the motel had canceled relations with HOTELS.com and did not have our reservation. In line ahead of us was an irate guest demanding her money back and we know why now. We ended up taking THAT room thinking we would just grin and bare it. We would get some much needed rest, a shower, and save a little money to go back to the city and see some sights. But it was AWEFUL...it smelled like an old dirty ashtray....when you turn on the heat roaches come out EVERYWHERE...there is mold on the walls....stains on ALL linens...smells and pubic hairs galore....sunken in beds....remote control did not work....burnt out light bulb....asked for a new one and manager said they would bring one up and never did....SO i could go on and on but that should be enough to hopefully sway you to spend a few dollars more and stay in ANY other place but the HORRIFIC Mission INN...ACK I WANNA VOMIT just thinking about our experience !!!! Brian and Adina from Sacramento", "Date": "Jun 12, 2007", "ReviewID": "UR803011746", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "cityseekers"}, {"Content": "You get what you pay for.       what is this?", "Date": "Jun 4, 2007", "ReviewID": "UR283902124", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "traveler90210"}, {"Content": "BED BUGS  The fact is that they might change the towels (MAYBE)--but that's about it! This place was so gross, I had to get my money back. We came in on 4/20/07 and got a room with a faucet that leaked all over the bathroom. I turned it on in the first place because I notice a long piece of hair (not mine) in the faucet, so I ran the water to clean around the area. Only to discover my sox were drenched. I tried to let that slide but when I was going to take a shower, I noticed that there was hair inside the shower too, pubic and scalp (I am sure of it). I Called Clay the owner/manager but he did not pick up so I walked down to the front office, he was difficult and was asking me to pay money to be switched rooms!!! Though he knew of this leak but had acted at fist as he didn't. I told him I would not pay more money and that I wanted a refund to which he agreed to switch me rooms so I gave it a second chance. The second room was just as dirty. Housekeeping did not even bother to discard of the shampoo bottle and soap that were inside the shower. If you care about your health--don't stay here. This place is really gross, that's not an exaggeration. Dish out a few more bucks and take care of yourself instead of trying to save a penny and end up with infections and the like.", "Date": "Apr 24, 2007", "ReviewID": "UR574645149", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "mixyourmusic"}, {"Content": "Don't stay here!!! Horrible, discusting, rude, and dangerous. This place is in a very bad area. I had booked online as it was the closest place to where my daughter was going to school in S.F. The manager would not refund any of our money. We paid and left and went to stay at a safe and decent place.", "Date": "Jan 31, 2007", "ReviewID": "UR895626337", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "jklrk"}, {"Content": "Beware online reservations The manager was very helpful, but I made the reservations for a large party for 3 rooms online and they did not have the 3rd room reserved. The Mission Inn did not have available the room with the kitchenette that was advertised and reserved online. If you make online reservations, be sure to call the managers prior to arrival to be sure they have your reservation and the correct size room reserved. I did not find the area to be a bad side of town in SF. It is almost in Daly City but has much traffic.", "Date": "Apr 20, 2006", "ReviewID": "UR730850539", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "4", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Horrid in every aspect possible This hotel would possibly be the worst I have ever stayed in. The manager was rude and very surly even to the point of swearing at me. They will not open the door but make you stay outside to conduct business even though the sign says open from 7am to 11pm. The shower is disgusting when you have a shower the bath does not drain and you end up ihaving your shower in a bath full of water. The maid that cleaned my room left a bag of rubbish in my overnight bag. Don't book over the internet as this means nothing to this rude individual. The area itself is not what I would call safe with gang types hanging around the street corners.", "Date": "Oct 10, 2005", "ReviewID": "UR816119379", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Do Not Stay Here! 1) This Hotel is a Dump2) It鈥檚 in a TERRIBLE Ghetto-y neighborhood. I observed gang members and prostitutes.3) The manager, Jossie, is a rude scheming liar, pretends not to speak English, and will go out of her way to attempt to rip you off.Here鈥檚 my story:On July 27 I called the Mission Inn to confirm that someone would be able to check my aunt and I in around 2AM as we would be driving up from LA. I was advised, by Jossie, that there would. I stated I would book the room on the net and would be arriving early on January 31st. We were visiting my sister who was in the final weeks of her pregnancy and not doing well, which added some urgency to the visit.After driving over 8 hours, and being awake nearly 24, my aunt and I arrived at the 鈥渉otel.鈥?There was a HUGE neon 鈥淥PEN鈥?sign in the window of the lobby; however, the lobby was locked and no one responded to our repeated plying of the night-bell, knocks on the door, and windows.After 20 minutes of these shenanigans standing in the cold  fog, exhausted, being eyeballed by four, bald-headed, baggy-pantsed gang member-looking types, we decided to find other accommodations. We left a note in the night desk window stating we had arrived to check in to no avail, and would be back in the morning for a full refund as my credit card had ALREADY been charged. They charged me for a room I did not, nay, could not, stay in.Long story short, it took me over three months, and many phone calls, to get my $225- back from the Mission Inn. I had to contact their parent company, Pegasus, in Dallas, Texas, and eventually had to threaten legal action to get a refund, which I did not receive until April, 2004. Each stated the other had my funds. In short, a nightmare, and I will never book another Hotel online. I booked this at cheaphotels. I don鈥檛 recommend them, either.RUN, do not pass Go, do not stay at this hotel!", "Date": "Jul 30, 2004", "ReviewID": "UR126262452", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Awful. Terrible service Our visit to the Mission Inn was horrible, to say the least. The resident manager, Jossie, is a conniving liar who forced our party to wait outside for over an hour and refused to check us in, even though she had stated she would accept a faxed credit card authorization from the person who made the reservation. In fact, Jossie required us to make a cash deposit and agree to an extra person charge of $5 per person despite the fact that: (1) we had never been told about this prior to arrival or notified in any way and (2) the charge applied to two toddlers, ages 2 and 4. The rooms stank and the floors were just plain dirty (it blackened the bottom of my son's socks!). I would never go back to this motel and would definitely NOT recommend it to anyone, unless I hated them.To make matters worse, when we wanted to stay an extra day, Jossie stated that it would be higher rate because it was a Sunday night! But when you try to book a room through other avenues, the rate is the same for EVERY SINGLE NIGHT. We had to pay because we had no where else to go and feel that Jossie took full advantage of us.", "Date": "Apr 15, 2004", "ReviewID": "UR229410321", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "correct mais loin de San Francisco   showReview(19641212, 'full');", "Date": "Aug 21, 2008", "ReviewID": "UR292044971", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "El recibimiento dejo mucho que...   showReview(16730993, 'full');", "Date": "Apr 28, 2008", "ReviewID": "UR414443556", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "0", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d81150-r16182725-Mission_Inn-San_Francisco_California.html", "HotelID": "81150", "Price": "$113"}}