{"Reviews": [{"Content": "Great Value If you are looking for a clean, safe, friendly front desk place at a great rate, this is the place to stay. We have stayed here numerous times and have never had a problem. Parking is free which is a $50 savings alone. Easy online reservations and close proximity to the the wharf area. Ballpark is a short cab ride away. Its no Fairmont but if a decent hotel at a dirt bottom price is your goal, this is it.", "Date": "Jan 9, 2008", "ReviewID": "UR636001837", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "AimlessJ"}, {"Content": "good cheap motel easy friendly check in, paid about $90.00 + tax for the room which was very small but clean and updated. My big mistake was not waiting for a room away from the street, the noise was terrible. These rooms should be sold at a discounted rate. Free internet was nice as I was on a brief business trip and needed to spend time doing email before my meeting.", "Date": "Nov 11, 2007", "ReviewID": "UR642709311", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "nick341"}, {"Content": "Cheatting! We booked a room with king bed on their website. However, when we checked in, they gave us a queen bed. We went arguing with the person at the checkin counter, he said according to his computer, that's the room assigned to us. Even though the price shown in his computer is exactly the price for king bed on their website, he refused to change the room for us and told us if we want to change to king bed, we have to pay more. Since we don't want to pay more, we stay in the same room.When we checked out, we said since we were staying in the queen bed room, we shall only pay the price for queen bed. Still, the person insisted that we have to pay the price shown on his computer (the price for king bed) and we have to call the manager for the adjustment when the manager come back a few days later.So, please be careful. Their website is a cheat! And their personnel is not helpful.", "Date": "Jul 13, 2007", "ReviewID": "UR439247070", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "3", "Location": "5"}, "Author": "kaiDC"}, {"Content": "Good Price for the Location This is a great location for the price, but be sure you're in shape to do some walking. Everything is close, if you consider 8-10 blocks of up and down close, but this is San Francisco.There is some street noise in the front, which can be overcome by running the in-room fan.Rooms were very clean, they have in-room coffee and donuts to get you started on your heavy walking.WIFI was hit and miss.", "Date": "May 9, 2007", "ReviewID": "UR540982910", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "PictownBuckeye"}, {"Content": "Great for the price You get what you pay for. Great reception, room OK - clean and tidy. Make sure you book a room near the back of the motel as the front could be noisy being on a busy road. Breakfast is pastry's (fresh) and orange juice which you go down to reception and eat sat on a chair in reception - but for the price this is a great way to start the day. Busy road. But Ok to get to tourist attractions.", "Date": "Dec 4, 2006", "ReviewID": "UR117446241", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "Cassie78"}, {"Content": "The Star Motel a Great Find! This little motel is modest and very clean. We stayed here for 5 days. The motel is located on Lombard Street, just 6 blocks away from the crooked part. You can walk to Fisherman's Wharf in about :15. Of the many positives, I would have to say that their BEST attraction is that they offer free parking to overnight guests. The majority of the hotels and motels we researched charged anywhere from $15-$30 a night just to park your car in their parking lot! With parking in San Francisco being difficult to find, we felt this was an amazing plus.There are two great shopping districts within walking distance. One to the west of the motel and the other to the east. The area isn't ritzy and has a ton of motels, but if you're looking for low price with cleanliness this is your place. Also, the customer service was outstanding and the housekeepers did an EXCELLENT job at keeping our room extremely clean.", "Date": "Sep 7, 2006", "ReviewID": "UR202823480", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Chrysanthemum1"}, {"Content": "Free Parking, Clean Rooms, Great Shower Pressure We have stayed at the Star Motel on at least 6 different trips to San Francisco. It is located in a good neighborhood (felt safe walking around with young daughter at night). The staff is always friendly and helpful. Rooms are always clean  the shower feels like a nice massage after walking around all day.", "Date": "Jan 4, 2006", "ReviewID": "UR905535480", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "taken advantage of. The staff at the Star Motel quoted me a price of $90.00 and this place was recommend by friends. When I saw the Motel I thought it was a little over priced. (It was too late to book anywhere else)I asked a few other guests what the price of their rooms were and most of them told me $70.00. I saw a walkin also get a price of $70.00. They took advantage of me I'm very up set and I feel cheated by the STAR MOTEL. I could of stayed in Union Square at any one of the Joie De Vivre hotels for the price I payed. Never ever stay there.", "Date": "Aug 29, 2005", "ReviewID": "UR652808377", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "-1", "Location": "-1"}, "Author": "slickdog"}, {"Content": "Star Motel excellent choice Located in the Cow Hollow section of San Francisco, this motel is nicely located for excellent restaurants within short walking distance,longer walk to Ghiradelli Square and Fishermans walk,accessibility to public transportation.  The well-maintained rooms are larger than most motels, with separate closets, sturdy plastic coffee cups (not styrofoam) better-than-usual amenities, good maps and guides.The front desk was genial and accommodating. Some of the free parking was under shelter. The price was reasonable by S.F. standards. A good budget choice.", "Date": "May 20, 2005", "ReviewID": "UR804428490", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "jhmenlopark"}, {"Content": "Cozy Place, Would Return I normally stay from motels but this one had a very subtle charm to it. The rooms were clean, basic, and comfortable. Our coffe maker wasn't working, called the front desk about it and they sent over a replacement one withing 15-20 min. Good neighborhood since its on a major street but not noisy. Bargain rate for a great time.", "Date": "Jun 14, 2004", "ReviewID": "UR350375694", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d81383-r12471036-Star_Motel-San_Francisco_California.html", "HotelID": "81383", "Price": "$99"}}