{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kelowna, Canada", "Title": "“location and staff are great - rooms are dated”", "Author": "rojo-amigo", "ReviewID": "UR127264632", "Content": "Bruce, Nicky and Talyor are the staff that we dealt with and they supply good info for SF. The location is great. Only a couple blocks to catch the bus to major attractions. Only a block to 2 good restaurants and 5-6 for many eating places. Only a couple blocks to water and parks. The rooms are dated and could use paint and upgrades. It looks like the furniture is new. Breakfast is very limited. Cereal and muffins. Parking is very limited, but one should not have a car in SF anyways.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monroe, New York", "Title": "“Warm, friendly and good quality stay.”", "Author": "Tmark9", "ReviewID": "UR127176939", "Content": "The Travelodge at The Presidio is a unique accommodation. It is an historic hotel (has always been a Travelodge since being built in the 1940’s) and its 4 public faces (Taylor, Raymond, Bruce and Nikki) are courteous and welcoming. From the beginning of our communications with them, we were impressed by their readiness to help us in any way a hotel could. The accommodations are humble, clean, of good size (many hotels in SF have very small rooms) and offer what anyone would need to have a good sleep and be ready for a day in town. If you come to SF to look for a luxurious accommodation, look elsewhere and be ready to spend much more. This is intended to show respect to the establishment, as when we travel, we are going to there to experience the culture of the location, not wallow in luxury and spend all of our time in the room. If you are expecting a big breakfast with designer coffee, you’ll need to find a local establishment, several of which are only a few blocks away. We requested a dark room, which translates to a corner room that has no window to the front walkway/balcony. We could have asked for another room- possibly because of a slight feeling of claustrophobia, but we dismissed that almost as quickly as we thought of it. There is a circuit that will trip if you have the bathroom fan, three floor lamps and the television on when using a hairdryer, but we don’t “throw the baby out with the bathwater”- we mentioned it, they reset the breaker and we worked with it. Then we met Raymond. One would not expect the wealth of information that this Midwest transplant readily and enthusiastically offers. Almost anybody we encountered in SF was engaging, pleasant and ready to offer their TIME (unlike where we are from), but Raymond has this in abundance. As much as the other 3 had the aforementioned SF qualities, Raymond brings the “desireability” of this location to another level. In his few years living in SF, Raymond has gathered enough knowledge about how to get around town, where to go and what is available to you- according to YOUR desires and to any level of expense. The Travelodge’s location was optimal for accessing transit buses and a major road into SF. For those who want to leave their car at the hotel, Raymond showed us 4 bus routes that can get you to all major locations in the city. Once you get the hang of the buses and know what places to avoid (3 or 4 areas, more so at night), you can really find your traveling groove. Parking at the hotel may get competitive, but they will help you. Depending on your reason for going to SF, we recommend the Travelodge at the Presidio. If you research as much as we did and find something comparable, you are fortunate and even the staff at the Travelodge would be happy for you (!). If you’d rather not do a lot of researching, then decide on this place- you won’t be disappointed.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chobham, United Kingdom", "Title": "“Second time staying here, just as impressed”", "Author": "DR7301", "ReviewID": "UR127171659", "Content": "We're from the UK and this was the second time my wife and I have stayed at this hotel. Great location, great service and staff and a great price too. We booked over the phone with the GM Tyler Shanahan and he gave us a very good rate which would have been hard to beat.This time we were actually blessed with 4 days of sunshine and warm temperatures which made a great difference. Thanks again to Tyler and all the staff, we'll be back I'm sure.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lawton, OK", "Title": "“Great Stay”", "Author": "Colin D", "ReviewID": "UR126638375", "Content": "I stayed here for three nights this past week and found myself very satisfied with my visit. Seeing as the hotel isn't as expensive as many in the area, I found myself with fairly low expectations. I was very pleasantly surprised to find a very nice, spacious hotel with a great mattress, TV and bathroom. The location couldn't be better. I walked all over the Marina and Presidio without even needing my car. I found the complaints about lack of parking space to be somewhat unfounded. Every night I managed to get a spot, even after returning as late as 11 PM two nights. There's a little bit of neighborhood noise at night from a bar around the corner and a preschool next door means children yelling at 8 in the morning, but those are minor complaints. Also, I found the neighborhood to be exceptionally safe, even late at night. That can always be somewhat of a concern when staying in a city. It's very residential around the hotel. It would have been nice to have a mini-fridge and an iron in the room. Another highlight of the stay was the very helpful and friendly staff. Bruce (I think) checked me in by name and was very welcoming when I arrived. The concierge, Raymond Archer, also was exceptionally knowledgable and helpful every morning. I'm fairly discerning about where I stay and while there are definitely cheaper options in the area, but I can confidently say in terms of \"value\" i.e. what you get for the price, this hotel can be considered a smart choice.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great value, nice location and very helpful staff”", "Author": "MightyTree", "ReviewID": "UR126311825", "Content": "We stayed here for a 4 night stay in February. It was not overpriced so good value compared to most other hotels in San Francisco, but had everything we needed and more so an ideal choice. We asked for a larger room because we had a lot of luggage and got it. Lovely big comfy bed, large TV and decent size room. Shower was good. Has a in-room safe big enough for a laptop too, but at an extra charge of $1.50 a day. Breakfast was great to have thrown in and Wi-Fi was fast. The general manager, Tyler, was fantastic throughout our stay and made us feel more than welcome, giving us plenty of great advice on eateries, bus routes and places to go, so thank you Tyler! More than enough maps and things at the front desk too. Location is close to Golden Gate bridge and nice quiet residential part of town. About 5 mins walk to the bus stop to get the bus into town, which takes about 20 - 25 mins. Ok so you could stay somewhere nearer in town, but it'd be noisy, you'd pay a lot more and probably get less for your money - bus service is perfectly good if you don't have a car, which you don't really need in this city but would be useful if you're short on time. Definitely recommend and can't wait to come back to San Francisco, which is a fantastic city! A quick tip for the cable car - if you're going on the main Powell/Hyde route, it is usually very busy after about 1pm and you will be queuing for a while. Go in the morning when it's quieter.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“A place to visit again”", "Author": "Shrimp2", "ReviewID": "UR126307621", "Content": "Our stay at this motel was enhanced 100% by the manager Tyler that bent over backwards to make our stay as pleasant as possible. As well he gave great bus directions and restaurant suggestions and things to see and do. It was easy to get around by bus from here to see this great city. We would stay at this location again and have already recommended it to friends.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Great place for peace and quiet in the city!”", "Author": "morenmsunshine", "ReviewID": "UR124943005", "Content": "We have stayed in San Francisco multiple times. It is a rare occasion when we find a place where it it totally quiet. We found it at the Travelodge near the Presidio. It was a good price, a great location and the best part - we got a wonderful night's sleep! It wasn't fancy but all of the \"creature comforts\" were there - very comfortable bed, great pillows, clean bathroom with soft towels and a friendly, helpful staff. We were on the 3rd floor and there is no elevator so be aware of that. The helpful desk person did offer to help us with our bags, but we were fine carrying them ourselves. They do offer a complimentary breakfast, but we were eating with family so we passed on that. Parking is first come, first serve so be aware of that, too.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Great Pet Motel”", "Author": "tastydelight", "ReviewID": "UR123881368", "Content": "My friend and I, along with my little dog, enjoyed the clean and comfy,large,quiet room with a two minute walk to the Presidio Gate, where little Katie could do her business. The staff, Bruce, Nikki and Oliver were very helpful with directions and advice about dining, etc. The price was very reasonable and little Katie got a large bag of doggy treats and my friend and I received a free coffee cup. How great is that?", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cerritos, California", "Title": "“My Mini Vacation”", "Author": "Raquel D", "ReviewID": "UR123074741", "Content": "My name is Raquel. I stayed at the Presidio with my Doberman Pinscher for two days, Tuesday, January 10, 2012 through Thursday, January 12, 2012. Overall, I was very pleased with my stay. Upon check- in Tyler also gave me a treat bag for my dog, with a few dog treats, that was really awesome!! I was greeted byTyler, Raymond and a few other members of the hotel numerous times. They were always very helpful, and knowledgeable of the area. Parking was not an issue, they were able to accommodate if necessary. Very close to nearby attractions, especially Fishermans Wharf, Golden Gate Bridge, Castro Street. I fell in love with San Francisco and the overall staff and hotel environment made it ten times better. I'd definately recommend this hotel and I'll be coming back in the near future!! The only thing I didn't care for was having to pay an extra $20 a night for my Dobie but I received a 20% off, mid week special, since I made my reservation online which helped. Thank you Presidio!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great option for free parking and pets”", "Author": "FBFandCo", "ReviewID": "UR122996607", "Content": "Reviews said the place was clean and staff was helpful, so we tried it. That was our experience--staff was friendly, parking was always there, and it's a great place to stay with a dog, since you can walk right over to the Presidio. If we had to bring a car to SF again, I'd stay be willing to stay there.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best location to stay with your dog”", "Author": "Sdtimothy", "ReviewID": "UR122925282", "Content": "Excellent location, just two doors from entrance to the Presidio. Perfect spot to walk the dog. Bruce and staff at the front desk were wonderful.", "Date": "January 11, 2012"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Apple Valley, California", "Title": "“Excellent customer service”", "Author": "Dave B", "ReviewID": "UR122781435", "Content": "there was an employee here named Nicki that just went above and beyond for us. You could tell that she took great pride in doing the best job possible. If I was running a business this is exactly the kind of person I'd want working for me. Promote! Thank you Dave and Michele Bauer", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orange, California", "Title": "“Superb Hotel in a Great City”", "Author": "RogerRamjett", "ReviewID": "UR122341112", "Content": "We made our annual foray to the City and there is no place we would rather stay... 20 years and counting. Nikki's friendly check in, Bruce's warm morning welcome and Ray's kind answers to our many questions... it was like seeing old friends. Tyler the Mgr makes it all hum smoothly, These people seem as if they like what they are doing, and each other. The newly-remolded rooms, flat screen TVs and the quintessential location; walking distance to the Bridge, Walt Disney Museum inside the gorgeous Presidio.... make this is the best point of departure for North Beach, GG Park, and Napa... The rooms are clean, have a fridge, are very quiet for being on Lombard and plenty of parking (Hey it's SF) Thank you again for a wonderful time in a great city....", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fresno, California", "Title": "“Great Location and Terrific Staff”", "Author": "cyndie m", "ReviewID": "UR122262184", "Content": "We stayed on two occasions in the fall of 2011. It was a great experience for us as it was quiet and we felt safe. Although parking is limited we always got a spot. What is really outstanding is the customer sevice. The staff was friendly and very helpful, especially Nicky. Our thanks goes to Nicky for handling our reservation and making sure we were comfortable during our stay. Also, she is able to answer any questions you have and so nice just to talk to. We will always stay at the Presidio Travelodge when we are in San Francisco.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern California", "Title": "“Presidio Travelodge perfect for my needs”", "Author": "Jeff L", "ReviewID": "UR122246562", "Content": "Complements to Presidio Travelodge. Perfect, quiet location adjacent to The Presidio. Warm, caring staff. Free parking. Most important; fair price. I am an \"Mid-week\", off-season traveler, and this property was perfect for my needs. Mid-Week Internet rate of $99 discounted 15% for Tripadvisor members (Taxes/City tourism fee added another $14 but proprietor can not do anything about that. You will be paying that no matter where you lodge). Room and bathroom/shower clean, beautifully laid out, and filled with a warm decor. 5 Stars. Guests will not be disappointed. A very pleasant experience. The pleasant, courteous, and friendly front office staff gave the whole experience a very personal touch.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chico, California", "Title": "“Great Location, good service, adequate room - A Bargain!”", "Author": "Marvey42", "ReviewID": "UR121700496", "Content": "Finding a safe, quiet, reasonably priced hotel in a walkable location for four older women on a Museum Tour was a challenge. This Travelodge was perfect. They were able to give us two rooms with two beds (not easy to find) and on-site free parking. (Arrive early as the lot fills quickly). The bathroom showed its age but then so do we. All was clean and comfortable. The staff helped us find our way around the neighborhood, a great walking district (Chestnut St.) and we loved our stay. Convenient to the Legion of Honor and the De Young Museum without have to hassle Downtown. We'll be back.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“amazing customer service”", "Author": "glenn k", "ReviewID": "UR121531883", "Content": "can't say enough positive things about the front desk staff. raymond gave us a long list of great restaurants, sites and directions to get to candlestick park. the hotel is in a great neighborhood and everything is in walking distance. raymond also saved us a small fortune, when he recommended the american airporter shuttle service. staying in the presidio area, the hotel is a very strong value. if we return to san francisco, we will stay at this location again.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Won't stay here again”", "Author": "uclabruin19", "ReviewID": "UR121208951", "Content": "After reading all the great reviews, I expected something entirely different. The towels looked extremely dirty in the restroom, we hesitated showering and used as little towel as possible. I woke up throughout the night, wondering if there were animals scurrying throughout my room. We parked down the street as the parking was full, not a problem for us, but others might find this annoying. In the morning, we wanted to grab some coffee, but one look at their kitchen and we decided to buy coffee. The kitchen looked filthy, the door should have been closed. The staff was very nice and friendly, but I wouldn't stay here again.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Simcoe, Canada", "Title": "“Great customer service!”", "Author": "Sierra C", "ReviewID": "UR120892195", "Content": "Location was awesome. Far away from busy and noisy streets - we had no problem sleeping. The staff was very friendly and helpful. Raymond and Bruce were great - knowledgable, firendly and seemed to genuinely enjoy their jobs :) The room was nice. Average hotel room, with a newly remodelled bathroom -- only downside being that there wasn't a bathtub, just a shower. Overall, a great place to stay - well worth the reasonable rates. We wouldn't hesitate to stay there again!! Thanks for a great time :)", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Better than most of the other comperable hotels in its area.”", "Author": "JFJman", "ReviewID": "UR120862884", "Content": "Good rates, good location, clean, friendly service, free decent continental breakfast. Unfortunately I wasn't able to stay at this hotel on my last visit to San Francisco because I booked my trip on Hotels.com and got stuck in a dingy hotel down the street.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Little Gem”", "Author": "Wingtravel_10", "ReviewID": "UR120373926", "Content": "This small hotel is right at the main gate of the Presidio on Lombard Street. Although the rooms are not huge, they are spotless. Cleaning service is excellent and considerate if you want to sleep in. The front desk people couldn't be nicer and if you need local information, they have it. Great little deli/sandwich shop and pizza place right next door if you get hungry. Honestly I have been in top name hotels which didn't offer half the cleanliness or helpfulness of this treasure. If there's one downside, it's parking. Like most places in SF, the free parking lot is small and you could end up parking on the street if you get there late. That said, there is every bus imaginable right at the corner and the desk staff will be glad to provide maps and directions to any destination you might care to visit. Personally when I return to SF, I'll be staying there again!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Friendly, knowledgable, and helpful staff.”", "Author": "Brs5tettba", "ReviewID": "UR120347561", "Content": "Nice room, wifi was easy to set up. Taxis drive nearby, some nice restaurants within walking distance. $15 cab to/from BART.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gatineau, Canada", "Title": "“Small rooms and renovations needed”", "Author": "guayaba_11", "ReviewID": "UR120028621", "Content": "The hotel staff is excellent--friendly and very helpful. Five stars for the staff member who took care of us upon arrival. For the final price of $150, the quality was lacking: the room and bathroom were small and somewhat shabby, mold around the outside of shower stall; a general repair and paint job would help. The shower worked well but the hair dryer had low power; shelf for toiletries was directly over toilet. We expected more after reading the tripadvisor reviews. If we had paid half the above rate in this part of SF, we wouldn't be griping!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Basel", "Title": "“Affordable hotel with great staff - free parking”", "Author": "Bebbi77", "ReviewID": "UR119920915", "Content": "We arrived late morning and the room was already done. We could deposit our luggage and park the car without any problem. The staff was extremly friendly and helpful - one could see that they love what they do. The other plus is the free parking. The hotel is easy accesible if you arrive from north taking the golden gate bridge.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“An Excellent Choice!”", "Author": "ColinandJane", "ReviewID": "UR119339273", "Content": "We arrived later than planed due to a nightmare drive through SF due to getting lost just after coming over the Golden Gate Bridge. Tired and slightly testy we were warmly welcomed by Bruce who carried both suitcases to the third floor at the same time! He also advised us to go to Liverpool Lil's for our evenings food and drink which is literally just around the corner which was very good - see separate review. The room was excellent and the bed was great. Breakfast was juice, coffee, tea, cereal, apples & muffins in the hospitality room which had a huge map for you to pin your home town into. Also around the corner is the local bus stop which made it easy to get into town and back. If you're lucky you may get a lady bus driver who sings and gives out lollypops to good passengers! Lombard Street carries on past the hotel and into the Presidio and this is a great place for a early morning walk. It's only about a mile to the cemetery just past the Main Post - it took us about an hour walking slowly and taking photo's to get their and the view of the Golden Gate Bridge is great, it's also interesting to have a little walk in the cemetery itself. Also worth a visit is the Pizzeria Avelino next door. Finally down Lyon St (turn right at the top of Lombard) and across the road is the San Francisco Palace of Fine Arts - also worth a walk.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Coquitlam, Canada", "Title": "“Great staff”", "Author": "avalon20013", "ReviewID": "UR119263514", "Content": "Me and my sister stayed here for a few days this past october. Room was a bit snug, but was nice. Location was great. Best part is the staff. Everyone was friendly and super helpful, tons of good suggestions for meals and tips for getting around.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“FINE CHOICE”", "Author": "Harry C", "ReviewID": "UR119078253", "Content": "Great staff especially manager Tyler Shanahan. good beds with double sheets, nice continental breakfast, a block from the Presidio, easy access to transportation - a good experience all around.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hemel Hempstead, United Kingdom", "Title": "“Good location, lovely staff”", "Author": "MichaelaChris", "ReviewID": "UR119020957", "Content": "This is in a good location, a short walk away from the main buses and excellent places to eat. The room was clean and quiet with everything you need including a safe. The star of the stay has to be Raymond at the front desk (who I notice has been mentioned in other reviews!). He was very welcoming and incredibly helpful giving us valuable information and recommendations for the area. He spent a good 10-15 minutes with us showing us a map drawing up the bus and cable car routes and recommending places to eat. We went to a few of these places to eat and we weren't let down! I hope it doesn't get him in trouble but he even allowed us the use of some cling film from the kitchen to wrap our sandwiches for the next day! He's definitely an asset to the company! There's free parking although the spaces are limited. The one downside would be the breakfast, there are criossants if you get there early enough but no butter or jam to go with them and limited cereals. All in all we enjoyed our stay here and would definitely stay here again next time we're in San Francisco.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Haaften", "Title": "“Very small rooms”", "Author": "Rosalien58", "ReviewID": "UR119004982", "Content": "We visit several travelodge motels during our stay in the US last summer. But this was one of the motel which was a little disappointing. Our room was extremely small. If you enter the room, you almost walk against the bed. If you place a suitcase, there is hardly any room left to manouvre. When you enter the bathroom, you have to walk in completely to close the door. I booked this motel due to the very good reviews on tripadvisor. But as said I was disappointed especially for the amount of money $135. The two guys at the desk are extremely friendly and helpfull. We had the bad luck that there was a group with motorcycles who left in the middle of nights (two nights) which was extremely loud. You can easily take a bus to the center, just 1,5 block away. Take you to the wharf in about 10-15 minutes.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sechelt, Canada", "Title": "“Great Place to stay”", "Author": "dorinne7", "ReviewID": "UR119003818", "Content": "Our 5 day stay at the Travelodge at the Presidio was wonderful. Great place for the money ... a real good deal. Staff was helpful in helping us find buses and things to do in San Fran. The parking lot fills up fast so get there early. The beds were super comfortable and the Wi-Fi hookup worked great too. The location is close to everything.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leeds, England", "Title": "“Central location with friendly staff”", "Author": "raiderlove214", "ReviewID": "UR118971792", "Content": "This is an older motel which has been well-maintained and is located on Lombard next to the Presidio entrance with easy access to all MUNI buses. There is also an on-site car park. The rooms were clean and comfortable with a electronic safe and refrigerator. Raymond, one of the staff members, is a mine of information on anything and everything to do with the city's sights and restaurants. We found some of his suggestions very helpful. However, the only disappointment was the complimentary breakfast, which was very basic. The croissants were not fresh and there was no jam or butter for the toast. If you want a quick bowl of cereal and coffee, this will do fine, but if not, visit Home Plate up the road which serves exceptional breakfast.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Clean, quiet room, great staff!”", "Author": "nur e", "ReviewID": "UR118849116", "Content": "Quiet neighborhood. Extremely helpful staff. Clean room. The city was foggy during our stay. Raymond helped us figure out when's the best time to see the Golden Gate Bridge by logging on to a live webcam on his computer. He is just amazing!", "Date": "October 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Good location”", "Author": "Jesse J", "ReviewID": "UR118751722", "Content": "My husband and I stayed here for 2 nights, sept. 21-22. We were very pleased with the location. Save neighborhood also for walkin after dark. The motel itself had a small room, don't forget it is a Travelodge. But it has a good overal feel. In a lot of other city's you would pay a whole lot less for a room like this, that is the result of being in a city like SF. Afcourse we tried to spend as little time as possible in our room....Your in San Francisco!! Free parking is a big plus in this city. We did not touch the car in 2 days. Breakfast was typical motelmuffins, you know what I mean and (for us) below adverage. So we left that for what is was and ate breakfast elswere. What made our stay the best is concierge Raymond. He is so passionate about his city! He is willing to explain every detail to you. Took a map and drew out al the different bus and cable care lines, with different colored markers. Dotted in the numbers of the buses. That was great and very convenient. We did not have to worry if we were going in the right direction. And thus able to see and do everything we wanted. Raymond gave such great tips on what not to miss, after listening to our preferences! Also on dining options. He told us he tried more that 350 restaurants. There is a street within walking distance called Chestnut, and there are a ton of good restaurants and coffeeplace (like a Starbucks). We liked that street and the atmosphere a lot. Eat at a very good Italian rest. called Parma. Nice to be by foot so you can drink a glass of wine! Would definitly stay again and Raymond (and the very nice weather, blue skies and warm!!!) made our stay extra special", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Pleasant, convenient location”", "Author": "DinahLee", "ReviewID": "UR118708241", "Content": "My husband and I stayed at the travelodge in August, and recommend it. The location is excellent. It is in a quiet neighborhood across from the Presidio-which a beautiful place to stroll through. It is close to bus lines, and walking distance to Union Street. Liverpool Lil's is a fun restaurant located around the corner. It does have free parking spaces for about a dozen cars. The room is small, but just fine. The hotel offers free breakfast and use of their business center to print boarding passes. What the hotel really has to offer, though, is the most helpful, friendly staff you would want to meet. Both Bruce and Raymond were helpful in giving us bus line info, general tourist information and arranged for a shuttle service to pick us up to go to the airport. They also stored our luggage for us after we checked out.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“San Fran Trip Sept 2011”", "Author": "smeetz", "ReviewID": "UR118517338", "Content": "Bruce and Ramond expertise helped our stay even better! I love the map idea in the breakfast lounge! Everyone should stay at the Travelodge by the presidio! I will be back and will refer to everyone! :)", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“Very Nice, Clean, & Comfortable”", "Author": "Tampa3", "ReviewID": "UR118512721", "Content": "The room was on the small side but very nice and quite. The bed was comfortable and everything was very clean. Easy to get to Fisherman's Wharf by cab or car. We found parking near the wharf for $20 a day. Parking is free at the motel and even though spaces are limited we didn't have a problem. Raymond greeted us on our arrival and showed us where to park. Free continental breakfast was standard and fine for us, but if you want a regular breakfast there is a restaurant near by. We went to Liverpool Lil's right around the corner for dinner the first night we got there and it was excellent. What really makes this motel outstanding though are the people who work there. They are all so friendly and helpful.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location”", "Author": "Toothpick72", "ReviewID": "UR118219035", "Content": "The accommodation is a little small. We are traveling with two children (9 & 11) and with 4 pieces of luggage there was not too much room. Having said that, that was the only downfall of the place. The beds were comfortable and the staff were like family. The moment we check in they were nothing but helpful. Raymond Archer runs a great ship and was a wealth of knowledge on what tours to take and where to eat. Bruce was very helpful too. The hotel has limited free parking, however you can park on the street for free. The wifi is good and the breakfast was basic but nice, coffee, juice, cereal, muffins and fruit. The location is right next to the Presidio entrance and a short walk to some great restaurants and boutique shops on Chestnut Street, defiantly try Mamacita (Mexican) restaurant, it's jumping with great food as well as catering for kids.", "Date": "September 17, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Portland, Oregon", "Title": "“Fabulous!”", "Author": "AllysonPeterson", "ReviewID": "UR118212226", "Content": "For an average for $112 per night this motel was great. Unlike the other motels, inns, and motor lodges located on/adjacent to Lumbard this place was very clean and quite, and it literally 50' from the Presidio entrance. I would feel good having kids here too. This is NOT a down down hotel, but for what it is, it was great. The whole staff was friendly and everyone know the bus system and the best times/ways to get where you wanted to go. Raymond was especially helpful with all the directions we needed. The buses all picked up within a few blocks and their was great food very close. If you are into shopping I highly recommend Chestnut St and Union St - both very close. My favorite restaurant in the area is Parma. Our room was the king over the office, and again, quite. We had a fridge and a parking spot at no extra change, which other places on Lumbard were charging money to use. There was also a simple continental breakfast (cereal, backed goods, fruit, juice, and coffee) in a nice sitting area that was open until 10pm at night. We called last minute to add an extra night onto our reservation after getting burnt out from camping at Yosemite. Raymond booked us and even said he could honor the discounted rate I got from booking so early even though now it was a same day booking. If your trying to be budget savy and a going to SF to see the city, this is a great place to stay. Thanks to the whole staff for making out stay great!", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Arizona", "Title": "“Super Pleasant Stay”", "Author": "LettieRG", "ReviewID": "UR117920784", "Content": "The hotel is very clean and pleasant and the staff go out of their way to be helpful to tourists, with tips on bus routes, what to see, etc. There were 3 of us sharing a room and the first night, the room we were given was a bit small for 3 people to navigate around. So next morning we asked if it was possible for a larger room and they immediately accommodated us and even moved our luggage for us. We had a small problem with the room and when we called the desk about it (9 PM), they took care of it right away. Next day when we returned from the day's outing, there was a box of chocolates in the room along with a note of apology. We were absolutely pleased with the service. The staff there treat you like family. The continental breakfast was OK, - muffins, croissants, coffee, fresh fruit, instant oatmeal, and the usual breakfast drinks. The neighborhood is safe and scenic, only a few blocks from the beach by Crissy Field and the bus stop with a couple of lovely restaurants within a block or two. The rates were very reasonable as well. I would definitely recommend this hotel.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "barnoldswick", "Title": "“not great”", "Author": "tracey b", "ReviewID": "UR117880181", "Content": "Basic accommodation for the price, i believe that the tourist tax on accommodation in San Fran is high so prices are elevated (ie, you get less for your money) the room was ok, a litle aged looking, the bolster cushions i immediatley removed from the beds - grubby! The staff we met were great, very informative and friendly. The breakfast was basic. Car parking available, andspace on the street if needed.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Naches, WA", "Title": "“Another Great Trip”", "Author": "surness", "ReviewID": "UR117472804", "Content": "We have stayed here five times in the past four years and it is always the same! This time it was our honeymoon. This is an old, updated, and well kept motel next to the Presidio in the Marina district, very near Crissy field (and the Sports Basement), and a couple of blocks off Chestnut. The staff is always friendly and helpful, and the rooms are always quiet and clean. Both parking and the internet are free. Around one corner is the Baker St. Bistro and the other direction is Liverpool Lils, and they both offer great food. The Chestnut Bakery and Marina Market are also close by. Public transportation is great. It is a nice walk to GG Park, to the ferries, and the Embarcadero. What more could you want.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Forestville, California", "Title": "“Very nice front desk, clean, comfortable!”", "Author": "KarenKAFVL", "ReviewID": "UR117257647", "Content": "My husband was in the hospital and needed a last minute place to stay. I was pretty tired and stressed because he was in ICU and the front desk was very nice and accommodating. This hotel was quite a nice surprise. We've stayed at the Country Hearth Inn next door and was not all that pleased. I thought this place would be similar but not so! Very nice and comfortable bed, clean room, nice size refrigerator, parking! Was out in the morning before the cont breakfast so can't comment on that. Will definitely stay here when we come to SF for other than a hospital visit!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Santa Sofia, Italy", "Title": "“Dirty and smelly Motel”", "Author": "AleUssi", "ReviewID": "UR117226379", "Content": "We really don't understand how this motel is 35 of 242 hotels in San Francisco in popularity index. The room was small, stinky and fetid. The window in the bathroom was broken. As we arrived we found that the linens and pillows were full of hairs. We informed the Front Desk but he simply replied that they wash the linens everyday... nothing else... VERY BAD EXPERIENCE. We stayed there only 1 night. The day after we changed Motel.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Laval, France", "Title": "“Very good value for money in a quiet location”", "Author": "larix3338", "ReviewID": "UR116989543", "Content": "We stayed 5 nights in this hotel and got the 5th night free. The hotel is located in a quiet and residential area near the Presidio so we had to take the bus to go downtown, but it was an good way to discover the city. A few restaurants and a pleasant pub nearby. Room a bit small for 4 people but very clean. Breakfast included and good services (locker in the room, free wifi...). The staff was very friendly and helpful. We recommend this hotel to people who don't want or need to stay downtown.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mansfield, ga", "Title": "“Bruce at the front desk was awesome!”", "Author": "heartifacts", "ReviewID": "UR116570980", "Content": "This was a great pet friendly motel! Very comfortable and the service we received from Bruce at the front desk was fantastic! He helped us with the public transit and gave us great directions getting out of San Fran to enjoy the Scenic Pacific Coast Highway! We will choose this motel again!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Yorkton, Canada", "Title": "“good location & decent accomodations”", "Author": "Saskadon", "ReviewID": "UR116567705", "Content": "Reasonably priced for being right in San Francisco. If you enjoy walking, it is right outside the Presidio and a walkable distance from Fisherman's Wharf. The room was clean and comfortable, and more spacious that we expected for being right in the city. Breakfast selection is limited but adequate. Staff is extremely friendly and helpful! Only problem was with the quirky a/c & heater, but with some help from the staff it did the job eventually. Parking is available but limited.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Great staff - family friendly”", "Author": "kiwi8022", "ReviewID": "UR116446989", "Content": "We are a family of 4 from New Zealand. This is a great spot for budget conscious travelers who will get a clean room with 5 star service from the best, most helpful staff we encountered on a month long trip up the west coast. Thanks especially to Bruce for the kind hospitality and our hero Raymond who got us a taxi under a tight schedule (and advice about the BEST burgers in town!) It was like having a fabulous concierge at our disposal. Yay Travelodge! We will be back.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Glasgow", "Title": "“Does what it says on the tin”", "Author": "pjmac123", "ReviewID": "UR115953863", "Content": "The Travelodge was not cheap, but then nothing is in San Francisco, so when compare to other hotels in the area it's actually quite a good deal. The room is basic, but had all the facilities we needed including a safe, fridge, hair dryer, TV, Air Con, etc. Staff were friendly and keen to help by providing as much information as they could (some times too much!). Breakfast was ideal - juice, coffee, cereal and pastries, enough to get your day off to a good start. Location is isn't perfect, but you'll pay a hefty premium to be any closer to the centre of the city. The walk from the hotel to Fisherman's Wharf is probably about 45 minutes, but we did it a few times and coped fine. There's so much to see and do in San Fran it's great! We hired a car and the location from that perspective was ideal. Close to the golden gate bridge and the Travelodge provides free parking which we managed to get a space in every time. All in all, we were satisfied with our stay here and would definitely recommend San Fran to anyone thinking of going! :)", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Great location and staff”", "Author": "Oxypete", "ReviewID": "UR115911060", "Content": "Very nice place that I am sure we will stay at again.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bracknell", "Title": "“Wonderful welcome”", "Author": "BBBBracknell", "ReviewID": "UR115745996", "Content": "Stayed for 2 nights after a flight from the UK, staff were very friendly, especially Raymond who went out of his way to show us the best bus routes around SF. Very quiet area, got a great sleep in a great location for public transport. Parking was easy and breakfast was just what we needed. Will definitely stay here again next time. Great pizza place next door. Raymond even let us take away a mug, nice little souvenir !", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Perfect - Clean Room, Great Staff, Great Location”", "Author": "Alybrand", "ReviewID": "UR115637166", "Content": "This Hotel was perfect! Not only did we get a great price, but it was just what we needed. The rooms were small, but we were out wondering the city for most of our visit, so it wasn't a big deal. The room was clean and the staff were amazing. We headed out to a Giants game and found out we are in a great location to take the bus around. Raymond and other staff were really helpful in helping us figure out the best way to get to our destinations. And the FREE parking was a definite plus! The continental breakfast is just the basics but it was nice to have something before we headed out. Would definitely stay here again!", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manhattan Beach, California", "Title": "“Good Choice”", "Author": "Serendipitynme", "ReviewID": "UR115596757", "Content": "When planning our trip we changed our hotel based on what we read on this site and we are very glad we did. This trip could have been a disaster but we have only GOOD things to say about our visit. Found free parking on site when we arrived and that alone made our stay more affordable. Friendly staff showed us how to get around on public transportation and the location was an excellent choice for everything we wanted to do. Used the city bus system for transportation and found it easy to get around. Our room was quiet, clean and comfortable. I have allergies and was concerned that pets were allowed but experienced no allergy issues. Continental breakfast but no restaurant on site. Didn't matter for us because we were out and about all day. Front desk had good suggestions...we were clue-less! We asked for Dim Sum suggestions and received a list. We chose one because they were the highest rated and when we arrived there was a line over a block long waiting to get in. We went elsewhere because our time was limited but I can only imagine how heavenly their food must have been! Have been telling friends about this trip and recommending Travelodge at the Presidio!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Felt Like Staying With Friends/Family”", "Author": "stephnewyork32", "ReviewID": "UR115088591", "Content": "I LOVE this hotel. It's in the perfect spot, has free parking-limited, but there is plenty of safe street parking in the area-Raymond greeted me like an old friend and was really helpful getting me and my small dog settled the day we arrived. He went out of his way to make us feel welcomed and even recommended a few places to grab dinner and gave us extra towels for my dog since it was stormy. Bruce was also awesome and was the one who helped me with my reservations. I highly recommend this hotel, and will be staying here again next time I am in SF.", "Date": "July 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great value coupled with incredible staff.”", "Author": "pettyr", "ReviewID": "UR115050029", "Content": "I came to know of this hotel via some SF locals recommendations. I can't thank then enough as not only was the Travelodge a great deal, they made my time in SF much more interesting thanks to their incredible knowledge of the city. Even if you stay elsewhere, come to the front deal here if you need help with the city. The hotel was also very well maintained and is in a great location. The local bus stops make getting around a breeze as well. Will definitely stay there again.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Drumheller, Canada", "Title": "“I would suggest this place to anyone traveling to San Francisco”", "Author": "doubleu_11", "ReviewID": "UR115018718", "Content": "The staff at this hotel is amazing, the customer service is by far the best I have had. The rooms were very clean. One staff member went way out of his way for us, and that would be Raymond. What an amazing guy, he had so much information about the city it truly made the trip better. He also helped us out on his day off, he actually came to city hall to witness our wedding as we didn't know anyone else in the city!!! Thanks so much Raymond you really made our special day great!! Stand up guy. You are definitely one in a million!!! Thanks again for everything Raymond and the staff of The Presidio Travelodge!!!", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Location, location, location”", "Author": "SubarcticHomebody", "ReviewID": "UR114917610", "Content": "We stayed at this Travelodge after reading the reviews here on TripAdvisor. My husband, five year old son and I stayed here at the tail end of a four day car trip. We are relatively familiar with the area and were only planning a single day of sightseeing in SF. We had a car with us. The Travelodge provided the perfect location. After a long day of driving we were able to cross the Golden Gate Bridge and check in shortly after 3 pm without having to slog through rush hour traffic. We appreciated being able to park for free off the road and in sight of our room. We had a room on the third floor with two queen sized beds. With tax, our cost was about ~$150. We felt this to be an extremely good value. The room was small, but clean and well appointed. There was a desk, arm chair, small refrigerator, vanity, and TV all squeezed into the space with our beds. The bathroom counter and cabinets, light fixture, and mirror all appeared to be relatively new. Our refrigerator door was broken and missing the lower rack, but this did not interfere with our use of it. We neglected to report this to the management. The heating/cooling system for the room was oddly complicated for me. I'm sure the front desk would have been happy to help had we requested it. We also didn't contact them about this. Considering we aren't used to sleeping in an urban area, we were amazed at how quiet our room was. We left the bathroom window open and could hear fog horns in the distance, but that was about it. The hotel is immediately across the street from the Presidio which has lovely walking paths. We enjoyed walking to the Exploratorium at the Palace of Fine Arts. We also enjoyed walking to the Wave Organ. George Lucas' studios are also within walking distance, as are many restaurant choices. As mentioned by other reviewers, Raymond was tremendously helpful and friendly. He was able to suggest activities that might interest our five year old and restaurants that were child friendly and not too far away. He obviously loves his job and takes it very seriously to make sure that each guest has the information needed to enjoy their stay to the fullest. The continental breakfast was drinks, Svenhards packaged danishes and cold cereal. This hotel worked out perfectly for our needs.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "wisconsin", "Title": "“june 2011 stay”", "Author": "jcesar", "ReviewID": "UR114852410", "Content": "this is an average hotel in most respects, but one employee in particular allows it to rise above others in this price range as well as those higher priced. Raymond without prompting shared with us his knowledge of the city and did so with such enthusiasm that i felt i need to leave a review on this site. we had never been to San Fran, and were just going to play each day \"by ear\". Raymond ensured we knew which bus lines to take & where to catch them, what sites to see, what restaurants to hit, how to do all this cost effectively, and SO much more! it was as if we had our own tour guide. the location is great. the rooms and hotel is clean, but Raymond made the stay and the trip! thanks, Raymond!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belgium", "Title": "“Finest place in SF”", "Author": "daviderebellin", "ReviewID": "UR114645388", "Content": "perfect place to stay and visit SF, near to good restaurants and public transport! Rooms are clean and perfect and breakfast okay! A very friendly and helpfull staff : If you have questions about attractions, transport, tours, etc. ask the staff!! they know everything!! We had a wonderful stay at Travelodge Presidio! thx David", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baton Rouge", "Title": "“Thanks for the memories RAYMOND!”", "Author": "bayouself", "ReviewID": "UR114428647", "Content": "My wife and I arrived before check-in time, but we met Raymond and he told us, no problem he could put us in a room right away. Raymond is the person who makes the Travelodge At The Presidio the absolute best place to stay when in San Francisco. He is a wealth of information. He had bus routes and times and where to catch them from the Travelodge. He set us up with a room that I was a bit sceptical about, but after seeing the room we were sold. Raymond greets everyone at the property with a cheery personality every morning, the guy is truly amazing. For the property, the room we had was clean and quite with a super comfortable bed. The maid service was spot on with cleaning, you could not ask for more. The location of the property is good, right next to the Presidio and walking distance to most attractions. When walking was out, you can catch a bus within a block or so with help from Raymond. We have been going to San Francisco for years and have stayed at different locations around the city, but from now on it will be the Presidio Travelodge. We found it to be a great location, easy to find, with great personel. As the title says \"Thanks for the memories Raymond\" we will see you again and again. I promise you cannot do better than the Lodge. Oh, they have a special stay four nights and get the fifth night free. This was especially good.", "Date": "June 19, 2011"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Nantucket, Massachusetts", "Title": "“HUGE Thanks to Raymond and the Rest of the Staff”", "Author": "rachel_reed", "ReviewID": "UR113915966", "Content": "We chose this hotel based on TripAdvisor reviews and are glad we did! The rooms are clean, modern, and comfortable, and the hotel is a perfect base from which to explore San Francisco! My dad and I were in town for a couple of days as SF was one of our stops on a two week roadtrip up the coast, and I definitely think we spent our time there effectively thanks to suggestions and tips from Raymond and Nicole. Their knowledge of the city, from the best Thai restaurants to the musuems with the best photography exhibits, was above and beyond that of any travel agent I have dealt with. Raymond, especially, can recommend any type of cuisine you choose and give you the low down on what seems to be every restaurant in San Fran! They were always waiting at the desk with a smile to answer any questions you might have. Definitely recommend Travelodge at the Presidio to anyone visiting San Francisco!", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Oro Valley, Arizona", "Title": "“reviews were true”", "Author": "Sue and E", "ReviewID": "UR112992214", "Content": "Its age shows but is decent & quiet at night. Rm 201 probably the worst location on street but not a problem as we are early risers. Raymond was FANTASTIC. 3 other staff members were also top notch", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kassel, Germany", "Title": "“IÂ´ve enjoyed my stay very much”", "Author": "Dirk-van-Elsingen", "ReviewID": "UR112354881", "Content": "Since my English isnÂ´t very well,I really appreciate the useful instructions from Raymond (Who was mostly the morning desk during my stay). I feel bad as I havenÂ´t had the chance to say thank you and goodbye to him.....Kudos to Raymond! But everyone does a good job....thank you all!", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful service”", "Author": "NY_LON_Traveller", "ReviewID": "UR111470348", "Content": "I was intrigued by all the positive so I thought I'd stray from my usual downtown hotels and check this one out. It didn't take long to work out where the high scores were coming from: the rooms are modest--typical travelodge stuff-- but the staff are what make this a great value spot in SF. They really, really know the neighborhood (and the city) and they really want their guests to enjoy it. I needed a quick food reco, I got a map and the menu so I could decide what to eat before going. I asked about walking in the nearby park, I was give trail maps so I wouldn't get lost. When I enquired about visiting the submarine at Fisherman'a Wharf I was shown photos of the ship and provided with very clear bus instructions to save me walking in the rain.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Winnsboro, Louisiana", "Title": "“GREAT SERVICE”", "Author": "berock", "ReviewID": "UR111004293", "Content": "â€¢ Staff VERY helpful - didn't mind answering lots of questions. Advised us on eating places, tours to take, traffic, etc. Raymond was especially helpful in answering our questions. â€¢ Parking is free, but is a very small lot. Staff helps get you parked. They even allowed us to leave the car there for the day after we checked out, which was great because parking is difficult in San Francisco! â€¢ Room was very small & crowded, & bathroom miniscule, but clean & adequate. â€¢ Bus stop is about 3 blocks from the hotel. â€¢ Breakfast limited but enough to get you started for the day.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Davis, California", "Title": "“Amazingly Great Place and Staff!”", "Author": "Darby8", "ReviewID": "UR110722425", "Content": "The friendly staff knows S. F. well and will help in every way possible. Free parking! Comfie beds, squeaky clean room, the location is an oasis of quiet right next to the Presideo. A morning or sunset walk on the grounds is beautiful. Simple breakfast available to get your day started. I'll be back and you should try this \"aiming to be #1\" hotel.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "North Vancouver", "Title": "“Great location. Super friendly staff.”", "Author": "NorthCountryFemme", "ReviewID": "UR110418528", "Content": "The room is large and the beds are good. If you're in San Francisco chances are like us you won't spend a lot of time in your room so it's a good, economical option, given the free parking and WIFI. Some places may look cheaper but when you factor in parking costs it's a different story. It's close to everything. We parked our car and walked or use used public transportation everywhere. Two downsides: the bathroom fan is deafening and it's wired into the lighting. You can't have the light on in the bathroom without almost damaging your hearing. Strength of the WIFI is patchy. Sometimes it was slow. Other times it just dropped out.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sittard, The Netherlands", "Title": "“Excellent home base for visiting San Francisco”", "Author": "Fransenco", "ReviewID": "UR109843203", "Content": "We stayed 3 nights in this hotel, which offered us an excellent base for visiting the city. We left our rental car at the parking of the hotel and used our 3-day public transport pass for vistiting the city. Very close to the hotel there are bus stops, giving access to nearly all of the tourist high-lights in the city. There are ample dining options at walking distance from the hotel (e.g Chestnut Street). The rooms of the hotel were clean but quite small compared with the average room in similar hotels at the counry site. Nevertheless, as we used our room only for sleeping and spent the rest of the day for sight-seeing, we didn't consider this as a draw-back.. Breakfast was quite basic but adequate. Service was OK. ng access to nearly all of the sight-seeing highlighs of SFO. Within walking distance there are ample opportunities for dining in the evening", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Wonderful Stay”", "Author": "penguin22358", "ReviewID": "UR109340869", "Content": "We had the pleasure of staying here May 12-16. I can't say enough good things about our stay. The room (one king bed) was roomy, easily handling 4 pieces of luggage, a backpack and a small cooler with plenty of space to spare. The bed was extra comfy, complete with down blanket and plenty of extra pillows. The room decor was very nice and update, complete with a flat screen TV (not that you watch that much TV while in San Francisco). The room was extremely clean, in fact, immaculate. The staff was extremely friendly and helpful, especially Nicolette and Raymond, who are experts at helping with public transportation planning (they actually use the public transportation so they really do know the system and routes). Raymond helped us plan out a route, on the day of the Bay to Breakers race, that would get us to California Academy of Sciences. Nicolette was great at showing us the routes to downtown at rush hour. A bonus is that you can buy transit passes right at the hotel, I believe the only hotel in the city who offers all the transit pass options. We used public transportation for our entire stay and never encountered any problems. Both Nicolette and Raymond were always smiling (as was housekeeping, but unfortunately, I didn't get any names), and they truly wanted to make our stay comfortable and cared about us as guests. The location of the hotel is great. It is in a quiet part of the city, just outside the Presidio. Yet just two blocks down, the city thrives, with so many restaurant options we couldn't count them. The hotel is also close to many public transit stops. We never walked more than 3 blocks to or from any stop. A great bonus of the hotel location is that you can both hear and see the famous wild parrots of Telegraph Hill. The birds seem to like the trees at the Presidio. We really enjoyed watching them and hearing they as the flew over. I even managed to snap a couple of pictures while two of the birds chatted on power lines right next to the hotel. The only possible suggestion I could make to the hotel would be to expand the continental breakfast; fresh fruit would be a nice addition. I highly recommend this hotel and hope to have the pleasure of staying here again.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“An inexpensive hidden gem in an expensive city”", "Author": "erskine49", "ReviewID": "UR109119600", "Content": "Just a superb experience. A great room with all the facilities of a much more highly rated hotel...OK, so it's a bit dated and needs a bit of a 'tart-up'...but the service is absolutely first class and you'll want for nothing. Learn the bus timetables and you won't need a car...you're so conveniently close to the city. Just cant wait to get back there. Hint...no elevators so request a ground floor room if needed.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shipley, United Kingdom", "Title": "“Great location, outstanding service, slightly let down by housekeeping”", "Author": "ClamchowderUK", "ReviewID": "UR109047831", "Content": "We stayed at the Travelodge Presidio at the end of a 2 week US road trip in May. We found Raymond and his colleague (who's name I'm afraid escapes me) to be very welcoming and helpful. Raymond in particular, whom we dealt with most during our 2 night stay, really allowed us to make the most of our short stay in SF by providing us with clear and concise guidelines for traveling round the city, excellent recommendations for things to do/see, and generally helping us to hit the ground running. Really first class. There were a couple of minor things which let this motel down unfortunately: the cleanliness was generally good apart from right in the corners. Guys: if you have don't have a 'crevice tool' on your vacum then you probably ought to get a new one. Also the sheet on the bed, whilst perfectly clean, had some unsightly stains on which were a little off-putting. For the price of a new bed sheet and 5 minutes extra with the vacum I'd have had no complaints whatsoever about this place. For the money though, I don't think you can fault it, and I'd certainly recommend it to budget conscious friends.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Excellent value for the money, clean and comfortable”", "Author": "slaintenh", "ReviewID": "UR108561918", "Content": "Really enjoyed my stay here, all of the staff I encountered, Ray, Bruce,and Nicolette were amazingly helpful to a first-time San Francisco visitor like me, pointing out all of the major sights and activities, plus the modes of transportation needed to get to them. Room was very clean, comfortable, and the aforementioned staff also went out of their way to assist with a couple of minor room issues. All in all, stay here when you come to San Francisco, mark my words, you won't be disappointed!", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“so worth it”", "Author": "lisawesley13", "ReviewID": "UR108324448", "Content": "This place is a little bit away from the main area of san francisco but only takes 45 minutes to walk to fishermans wharf and union square. the public transport system is right out side of the door, so you never have to worry about getting to and from any where. the rooms are clean and tidy and serviced daily. Next door there is a little shop where you can buy milk or things that you need. Raymond the concierge is amazing. I arrived early and he let me in my room straight away, he was so very helpful in day tours or free walking tours and also gave me a map with all the bus routes on it and explained how to get to and from places. If you needed anything Raymond was there to help. Bruce and nicolette were so helpful aswell, everyone greeted you with a smile and a hello. I will definately be staying there again..", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Nice place, great location”", "Author": "underneathy", "ReviewID": "UR107999615", "Content": "I decided to stay at this particular Travelodge mostly because of it's location. I'm very familiar with San Francisco and knew that it would be a great spot in the City to stay. The staff is really nice and helpful and the rooms are immaculate so it was all a bonus. The bed almost takes over the whole room but it's very comfortable. Within walking distance is the Presidio, lots of bars and cafes, and Palace of Fine Arts. I plan on coming back here next time I'm in town.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Santa Barbara, CA", "Title": "“Clean, Comfortable and Cheap”", "Author": "avodoc", "ReviewID": "UR107676351", "Content": "They got all the basics right: Quiet, clean and comfortable at a reasonable price. Although the rooms are tiny, they are appropriate for what you are paying. The bathrooms had been updated and the shower was nice and hot. I skipped the breakfast, which consisted of cold cereal, pre-packaged danish, pretty awful coffee (I did try that), tea and OJ. There are plenty of good restaurants nearby, we particularly like the Baker St. Bistro around the corner. Raymond, as reported, is a bundle of positve energy and a font of knowledge about San Francisco. One small complaint is that their parking lot fills up very quickly, so if you get a spot, it would be best to use public transportation if you want to keep your spot.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ft Worth", "Title": "“Best resonably priced hotel in San Francisco!”", "Author": "FtWorthBeagle", "ReviewID": "UR107426731", "Content": "I have stayed at the Travelodge at the Presidio twice this past year. Once with family, once alone. Both times the staff were exceedingly pleasant and helpful. They answered any questions I had about what to see or do and how to get there. They made airport shuttle reservations for me. The rooms were very clean, pleasant, and quiet. Kudos to the manager Tyler Shanahan and desk concierges Raymond Archer and Bruce (sorry but I didn't get his last name.) Each time I've visited they have done everything to make me and my family feel at home, a rare quality these days. I HIGHLY recommend this hotel. It is convenient to many points of interest and very well run.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Value,Friendly,Very helpful,Close to public Transport.”", "Author": "junee_ferris", "ReviewID": "UR105349990", "Content": "My Brother and I stayed 5 nights,recieving excellent service from the Management thru to All Receptionists. Although about 2 Miles out of the City and Fishermans Wharf, PublicTransport is Good.The Presidio area, is great for walking, and not far to the water front, and beautiful walking tracks. Not many eating places close. Good car parking was available for customers.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth", "Title": "“Friendly & helpful staff, nice accommodations for a low price, great location.”", "Author": "mjhoug", "ReviewID": "UR105249453", "Content": "This was our first trip to San Francisco and we didn't have any idea where to stay but we knew that we didn't want to spend a ton of money on a hotel room that we weren't going to spend a lot of time in. After reading the reviews and searching for deals, we decided on the Travelodge at the Presidio. It was a great choice and I would recommend it to my friends and family or anyone else who is going to San Francisco. The staff is extremely helpful and friendly and are always ready to help make your trip the best it can be. They seem to like their jobs, which makes a huge difference in how they treat their guests.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“PERFECT LOCATION FRIENDLY STAFF!”", "Author": "ashas0", "ReviewID": "UR105219138", "Content": "We stayed here for 3 nights and it was a perfect base for our San Fran experience. The room we had was not huge but had 2 queen beds in it and was clean and comfortable and to be honest we were hardly in there during the day. The hotel is close to Chestnut street which has a whole array of great places to eat. What really made the accomodation were the really helpful staff, Bruce in particular was our favourite, he was full of inspiration for what what to do each day. We walked to fisherman's wharf to do the Alcatraz tour which I highly recommend, and caught a bus to Golden Gate park to do the Academy of science and the De young art museum. Thank you Bruce for making our trip so enjoyable and we hope to see you again soon!", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Naches, WA", "Title": "“Only place to stay in SF”", "Author": "surness", "ReviewID": "UR105156798", "Content": "We try to make the trip to SF at least once a year. Presidio Travelodge is the only place to stay. The staff is absolutely great! The rooms are nice and quiet, and the beds are comfortable. Parking is free. The location is really wonderful, especially if you are a walker. The Presideo is right there, and Crissy Field is right down the street. You can walk all over \"The City\". The Marina Market and the bakery have everything you need for lunches. So you can pack a lunch and drive out to Muir Woods and hike down to Stinson Beach. Public transportation is also really great.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Windsor, CA", "Title": "“Best Motel in San Francisco...”", "Author": "Krisk16", "ReviewID": "UR104799355", "Content": "I live just north of the Golden Gate and my Mom was transferred down to San Francisco for open heart surgery. The hospital provided a list of accomodations with only 2 being pet friendly. I made reservations for the Travelodge and arrived late in the evening. The staff was very warm and inviting, making sure I had a safe place to park and that my 2 dogs (and myself) were welcome. They provided me with 2 doggy welcome bags that contained lots of treats my dogs LOVED and clean up bags too. The motel is perfectly located right next to the Presidio with lots of grass with safe walking. I was only able to stay 2 nights because they were booked for the 3rd night. I had to make reservations at the 'other' pet friendly motel on the list. It was in the Tenderloin (at the same price) and it was so scary. When I got to my room my bed was not even made. I checked out within 5 minutes and spent the night in my Mom's hospital room instead. I have been staying back at the Travelodge ever since. The staff is AMAZING! Everytime I see one of them they ask about my Mom and how she is doing. They love my dogs and ask for me to bring them to the office so they can pet them. I just love Bruce, Nikki and Raymond. I witness every morning over continental breakfast how helpful and friendly they are to all their guests (not just me). They listen to their guests needs and respond with the most appropriate suggestions. I rode MUNI for the first time with Nikki's help to the SF Giants game. The rooms are comfortable and clean. They have flat screen TV's and nicely decorated. I have a mini fridge to hold my leftovers from Liverpool Lil's right around the corner (YUM). Take it from me... I am local and very picky and I couldn't say one bad thing about this motel or staff. Feel free to contact me if you have any questions. I did read some old bad reviews here but the motel has been renovated since with new management and I couldn't imagine any issue that they would not handle in a professional and caring way. LOVE YOU GUYS! Oh and did I mention FREE PARKING in SF? And FREE WIRELESS INTERNET?", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newport News, Virginia", "Title": "“Wonderful STay”", "Author": "Cassie40", "ReviewID": "UR103828008", "Content": "The hotel is located in a safe and prestigious area of San Francisco, the Marina District. We enjoyed our clean, quiet, and large room, with free parking and breakfast. There was a refrigerator in the room, and breakfast was filling with cereals, danish, tea, coffee, and juice. The parking lot was small, but we always found a space. We used the free computer and printer in the business center. The staff was very helpful and gave us good directions, recommendations for food and help with planning our sightseeing. There is a Walgreens a block from the hotel, with food, snacks, etc.. The next block from the hotel is a trendy retail area with nice restaurants and shopping. They gave us a city map with bus routes outlined. The bus stop was only a 5 minute walk from the hotel. The area was safe and we were comfortable walking and using the bus system until late in the evening. There were many people walking outside and using the MUNI buses. We took the #30 bus from our stop to many areas of the city (Chinatown, North Beach-the Italian part, Union Square, and Fisherman's Wharf). We got a MUNI pass that included buses, cable cars and street cars. The adult individual bus fare is $2 each way, and cable cars and street cars are $5 each way. We also took the #28 bus from near the hotel to the Golden Gate Bridge and walked across the bridge and back. Gorgeous views! That bus goes through the Presidio and Golden Gate Park. The street cars follow the waterfront along all the piers to the Ferry Building. It is easy to find the bus stops by the shelters with digital displays for bus routes and times of arrival. The food and patries were wonderful.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Great staff, quiet location, close to Presidio and Marina”", "Author": "outdoorathlete", "ReviewID": "UR101794842", "Content": "I stayed here back in October 2010 for about 10 days while settling into SF for a relocation. The staff, Nicky and Tyler were friendly and helpful while I stayed there. There was an issue with noise in the room beside me and they were quick and efficient about finding me a quieter room. And when i finally left for my trip, they stored some luggage for me until I got back to move into my apartment. I have owed them a review since then and have been too busy to figure out this darned tripadvisor. But now it's done. If you need a budget business travel hotel that's close to the Marina but away from the main traffic noise, stay here.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hermosa Beach, California", "Title": "“Best Location, Best Staff, Nicky Rocks, dont waste your time at any other place!”", "Author": "awais044", "ReviewID": "UR101639283", "Content": "This place is in the middle of the golden gate bridge and fisherman's warf. You can walk to both places and ride the trolley cars.. The staff was so amazing and helpful and even let us park our car behind the hotel after we checked out, which if you have ever been to San Francisco was a really big help! I cannot say enough about Nicky besides give her a raise! The most helpful person regarding where to go and if she didn't know, she told us that. My dad and I did a two day adventure and saw everything we needed to! Thank you! We will be back! Hotel was clean and had everything we needed.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Nice location, good price and great staff”", "Author": "Deyblan", "ReviewID": "UR101541235", "Content": "I read the reviews of the hotel here before I made my reservation and I'm glad I did. This hotel has a great location a couple of blocks of muni and exploratorium. The room was clean and and had all I needed, the bed was realy comfy and the space was reasonable. There was a coffee maker wich I was thankful for, specially after a long and rainy day. But the staff was the best thing there, they were more than helpful with tips, directions and recomendations of stuff to do. Thanks so much to Bruce, Nicky and Tyler for all their help to make my visit a success.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bothell, Washington", "Title": "“People Make the Difference”", "Author": "WestofSomewhere", "ReviewID": "UR101430858", "Content": "Trip Advisor reviews led us to this location and we are pleased to pass along the praise! Our intent was to visit the Walt Disney Family Museum, located at the Presidio, and this motel is situated very near the Lombard Gate entrance. For access to the downtown and waterfront sights, we used a MUNI passport and rode the #30 bus everywhere we needed to go, about a 15-20 minute ride to Fisherman's Wharf. Our room was basic and a little on the small side for 3 adults, but was clean and comfortable. This appears to be an older property, but it is well maintained and a good value overall. Have to hand out kudos to Bruce at the front desk, who was more than helpful to us throughout our stay. He arranged a terrific city tour for us, as well as answered a myriad of questions very patiently. Based on his performance, as well as other reviews about helpful staff, it is clear this Travelodge pays attention to customer service.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“EXCELLENT VALUE. EXCELLENT LOCATION. EXCELLENT SERVICE!”", "Author": "KevinMcAllen", "ReviewID": "UR101380630", "Content": "Grohe fixtures in the john. VERY clean comfortable rooms.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Westwood", "Title": "“Best value in San Francisco!”", "Author": "JourneyLady47", "ReviewID": "UR100855040", "Content": "We have stayed at this hotel for years on our trips to San Francisco. The rooms have been remodeled. The staff is friendly and helpful. It's conveniently located near bus stops at the gate of the Presidio. It's clean and the parking and internet are free. It's nothing fancy, but fits our needs perfectly.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia, Missouri", "Title": "“Great location and value”", "Author": "Britty86", "ReviewID": "UR100776930", "Content": "I was a little worried about where this hotel would be located considering the rates at the time compared to all the other hotels. I was greatly surprised. The location is fantastic and central to anywhere you need to go if you are going to be near Fisherman's Wharf and great local eateries within a block or 2. Rooms were very cozy and amenities were nice. The staff member that checked me in was extremely pleasant and nice. If you are there during a weekday, there is a daycare at one of the houses on the left side (if you are looking at the rooms from the parking lot) and when the kids play outside they can get kind of noisy, but I am an early riser, so this was not a big deal for me. All in all, it was a nice stay and I would stay here again.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“You get more then what you are paying for...go midweek 20% discount”", "Author": "secilb09", "ReviewID": "UR100297736", "Content": "Going to be brutally honest, the good and the ok...For the price, worth it. Room was clean, bathroom had a little mold in the grout. But nothing disgusting, there was no microwave but didn't miss it. I am mother of two and the place was perfect. For little little ones the rooms do not have bathtubs, in case that poses a problem for some. We were two city blocks from the wharf, one block from the exploratorium and right next door to the best ny style pizza. The staff is super friendly, helpful and the breakfast is more then adequate. Cheerios, Circle K, Raisen Bran, oatmeal, danishes, orange juice, hot chocolate, and coffee is more than enough for breakfast. We stayed 4 nights and only spent $350 can't find that anywhere in SF, I dare you to try. So helpful and accommodating for medical patients. Nancy and Raymond were wonderful hosts and will definitely stay again. Might request some touch ups in the bathroom but other then that it was clean, quiet and in the most perfect location for the optimal \"local\" San Francisco experience.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Marcos, CA", "Title": "“Best place for the value”", "Author": "ontherios", "ReviewID": "UR100193420", "Content": "We stay here often because the staff and location are wonderful. Staff makes a point to be helpful, current on city happenings and accommodating. They really make guests feel welcome. Raymond anticipates your arrival and caters to your tastes in suggestions. Tyler is a hands on manager. Nikki and Kevin are learning under excellent models of hosptality and are doing a fine job.", "Date": "March 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Starke, Florida", "Title": "“Wonderful Staff, Great Stay”", "Author": "ABlessedLife", "ReviewID": "UR99306946", "Content": "My mother and I went to San Francisco to visit family. We stayed at the Travelodge at the Presidio. Raymond, Bruce and the other staff went out of their way to be helpful to us in choosing restaurants, sights to see and they were so friendly. The room was perfect. Loved that we had a mini fridge. Beds were so comfortable and rooms were very clean. Will definitely stay there again. Will also recommend it to our friends.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lebanon, Tennessee", "Title": "“Good place to stay.”", "Author": "fcmullins", "ReviewID": "UR98804577", "Content": "This was the second time we've stayed there. It's not a 5 star hotel but it doesn't say it is either. The rooms are clean, beds are comfortable, heat and air works well and it's relatively convenient to attractions and public transportation. My only complaints are that the rooms although nice are a little small but that's not something that would keep me from staying there again. I would also like to see a vending machine with Coke products as I'm not too fond of Pepsi. The staff are all very friendly and helpful with tips concerning the city and the best ways to get around and things to see. Should we have the oppourtunity to visit San Francisco again chances are we'll do our best to stay here again.", "Date": "March 3, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego", "Title": "“Excellent staff, great location if you want to be near Presidio, Golden Gate Bridge”", "Author": "MangoTango007", "ReviewID": "UR97770376", "Content": "The staff here is the story. They go well beyond the call of duty to accommodate the needs of their guests. I loved getting \"locals\" knowledge from Raymond, it was very helpful in planning our very limited time in San Francisco. The hotel is located at the entrance to the Presidio; just a block away is a bus that takes you to Union Square. The property is a bit worn around the edges but was clean. Don't expect \"luxury,\" just great service with a smile. I would recommend the hotel -- with conditions. I must comment on something odd that happened while we were there. A man, we're assuming he was the owner of the hotel, came into the \"hospitality room\" where we were seated and proceeded to SCREAM at an employee who was using a computer in the computer room. That was most unpleasant and not in character with the otherwise excellent service at this hotel.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Why can't all hotels offer such great service?”", "Author": "dh1120", "ReviewID": "UR95339403", "Content": "I was in SF over a weekend to see the Van Gogh, et al exhibit at the deYoung. I chose this hotel on the basis of the reviews of its customer service and the relative proximity to Golden Gate Park. While a guest there, I decided to leave my car at the hotel and take public transportation. Both Nikki and Raymond were extremely helpful not only in providing the simplest ways to get to where I wanted to go by public transportation, but also in giving me sightseeing ideas as well. I would stay there again but upgrade to a larger room. My only (minor) suggestions for the hotel based on my experience would be to include an iron and ironing board in every room as well as some kind of protein (such as hard-boiled eggs) with breakfast. Highly recommended!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“A real gem in a great location.”", "Author": "Canadianduffer", "ReviewID": "UR94622797", "Content": "While on golf trips, I've stayed in many places in San Francisco and have stayed here often. I can honestly say this place is above par. Tyler, Raymond and Nicky lead a great team in providing excellent service. Raymond is an excellent source of knowledge on local attractions and how to get around town. It's clean and recently renovated with more to come. Free parking is a huge plus. The location is excellent: a quieter part of downtown San Fran just outside the East Gate of the Presidio. Handy to 3 golf courses: Presidio, Lincoln Park, Harding Park. For the past few years this is where I stay. Repeat guests is highest compliment for any hotel/motel.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Simple, Comfortable with Most Helpful Staff”", "Author": "Mamabear56", "ReviewID": "UR94334029", "Content": "While it is a bit off the beaten path, at the Lombard Gate of the Presidio, it is convenient to several main bus lines to get anywhere you might want to go as a tourist. The beds were extremely comfortable with down quilts and fluffy pillows and it's location made it very quiet at night. Although, I have to say, the bathroom was very small as were the towels, and the floor could have been a bit cleaner. The staff was very friendly and incredibly helpful, giving us tips on how to get around and they made up for any deficiencies of this little, hidden, and very affordable motel.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“FANTASTIC home away from home! A most enjoyable stay!”", "Author": "mia1313", "ReviewID": "UR92832761", "Content": "The staff at this hotel were helpful, extremely knowlegeable about San Francisco and all the avaialble attractions and restaurants. I was very impressed by their enthusiasm and helpfulness and sound advice! Raymond was probably the best hotel manager I have ever met. No request was too complicated or unreasonable. We were travelling from Singapore for a two week stay in SF and the staff made our stay truly terrific -- it was such a great experience for us. The cleaning staff were also incredibly professional, hlepful and courteous but most of all EFFICIENT! My hat goes off the David who took great care of us and our room! Our stay was truly memorable and pleasant because of the great and friendly staff. Their extra effort and kindess made all the difference. The hotel is very basic and very comfortable and even though it was fully booked for most of our stay, we always managed to find parking -- a big relief! A terrific value for the money in a great location! I will stay here everytime we go to SF! HIGHLY RECOMMEND!", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“People makes the difference”", "Author": "Fer196690", "ReviewID": "UR91582140", "Content": "This is a correct hotel but the service is one of the finest I have ever had in my life travelling around the world: Richar, Ray, Nicky, Bruce and Stephen were marvellous. Always with a smile and helping in everything. Tyler the general manager was super-friendly on the phone when we made the reservations and personally when we met him. What a tremendous Team to run a hotelÂ¡Â¡Â¡Â¡ Thanks", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "SCOTLAND", "Title": "“The staff really do make your stay.....”", "Author": "CHOCCYScotland", "ReviewID": "UR91514837", "Content": "We stayed here for 4 nights and found it to be a great place to stay mainly because of the friendly, knowledgeable staff. No matter how many questions we asked we were never made to feel like we were being too annoying! The room we had was nice but unfortunately have to say that the bathroom was a bit grotty but since we spent all our time exploring San Fran then it wasn't a big deal. Also, the breakfast was a nice touch since it was free and enough to keep us going until lunch time. We walked from the Travelodge quite a lot which was a fair walk to the Piers but you get to see the city better that way. Also, there's plenty of places to eat and drink close by. Thanks to all the staff for our stay..", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orange, California", "Title": "“If You Love San Francisco-- This is the Place”", "Author": "RogerRamjett", "ReviewID": "UR91138246", "Content": "We had lived in the area, so we know the City... Both before and after, we have stayed at this Travelodge over 30 years... but not in 10 and so we wondered, but from Richard booking our room like a pro to Nikki who was always there to help (she even supplied an umbrella) it was a delight. Tyler Shannon, the GM, runs a happy and serving staff.... If there were 10 stars, we'd give it. Walk to the beautifully renovated Presidio, Disney Family Museum, National Cemetery, Crissy Field, Palace of Fine Arts and if you're hearty, the Wharf. Close to everything... Rooms are clean, with that superb updated exterior (very SF).....and an excellent value but it is the staff and the location... We cannot wait for our next trip this spring", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Napa, California", "Title": "“Clean, quiet, perfectly located--and excellent customer service”", "Author": "cleverfool", "ReviewID": "UR89452876", "Content": "My girlfriend and I recently stayed at the Travelodge at the Presidio--in connection with our attending a two-day hip hop dance fest at the Palace of Fine Arts. Prior to making the reservation, I spoke with some of the hotel's staff members about the hotel and things to see and do in the immediate area. I wanted to put together a really fun trip, where most everything would be within walking distance, so we wouldn't waste a lot of time driving around in traffic. To that end, the staff, and in particular Raymond Archer, the Front Desk Concierge, was extremely helpful, so much so that he ought to receive a raise--no joke. In most cases, he provided me with first hand knowledge and reviews of Marina specific restaurants, bars, and clubs, including A16, Izzy's Steakhouse, Liverpool Lil's, Mamacita's, and Silver Clouds Restaurant & Karaoke Bar. He even made a point of visiting the Hi-Fi Lounge after work one evening in order to let me know if it was the kind of dance place my girlfriend and I would be interested in going to. Then, he shared a number of websites, including sfstation, sfcityguides, sf.funcheap, and yelp, all of which helped me put together an itinerary around our two-day dance show. In addition, Raymond talked to me about bus routes and tours, including the Presidigo, the Wave Organ (a little known but really cool S.F. landmark near the hotel), architectural walking tours, including Alamo Square, and the Lyon St. Stairs--with some incredible views of the bay. In short, he was very professional and thorough in answering all of my questions and ensured that we had both a great stay at the Travelodge and a really good time in the Marina District. He provided the kind of exceptional customer service that, unfortunately, you just don't see/experience that often anymore. Thanks, Raymond--I really appreciate it.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "McCall, Idaho", "Title": "“TOP-NOTCH SERVICE AND ACCOMODATIONS”", "Author": "libertycabell", "ReviewID": "UR89447778", "Content": "For more than 2 days and nights, the management and staff of Travelodge Presidio provided both excellent service and first class accomodations in a perfect location for a reasonable price, and part of Wyndham Rewards. I will go back there every time, and take my family. Thank you, including Raymond Archer and the whole desk staff, who were most helpful and responsive to the customer! Benjamin Cabell", "Date": "December 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Nice quiet hotel, great location, polite helpful 24 hour office staff.”", "Author": "ssswedishgirl81", "ReviewID": "UR88481354", "Content": "We were very pleased with our room, the breakfast, the comfortable bed. The location was quiet. All of the office staff are super helpful. Raymond and Bruce are enthusiastic about their jobs and the city. They answered all our questions and gave us really good tips about catching the public transit, walking tours, restaurants, etc. We are glad we chose this hotel.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Huntington Beach", "Title": "“Great location, reasonable price and really nice people”", "Author": "guyadams", "ReviewID": "UR88159585", "Content": "This is a great place to stay if you don't need the 4 star type of hotel. The free parking makes it a great deal. While I visited the staff were really friendly and helpful. It was clean and in a good neighborhood close to many good restaurants.", "Date": "November 25, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Amarillo TX", "Title": "“Prepaid Guaranteed Room didn't get me a Room Here”", "Author": "ctex99", "ReviewID": "UR88052769", "Content": "I prepaid for my room through a travel website because I knew that I would be arriving late (Midnight). I even included a note on my reservation indicating that it would be 11 PM at the earliest that I would arrive. To their credit, they called some of the nearby hotels and found me a hotel room that was decent however it was on a major thoroughfare and the traffic noise was horrible. This cost me a day of my 5 day vacation because of the bad first night.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Fortuna, California", "Title": "“Friendly and helpful staff at secluded Travelodge”", "Author": "Columbo077", "ReviewID": "UR88050062", "Content": "Recently my husband, teenage son and dog, (yes a dog friendly hotel in SanFrancisco! ) spent 4 nights at the Presidio Travelodge, not to be mistaken for the other 2 or 3 Travelodges on Lombard Street. This one is tucked away on the West end of the street literally steps away from the Presidio gate. The night desk person who checked us in was Nikki and she made absolutely sure we were comfortable with our room. She brought us an extra light and a doggie treat bag for our dog. She assured us the neighborhood was safe and over the course of the next 3 nights cheerfully greeted us when we arrived back at the hotel, tired from a day of exploring and sightseeing. She even came to our car (we had to park around the corner when the lot was full) to see if we needed help carrying anything or help with the dog. Ray, the day person, helped our son locate places to skateboard and gave us driving directions so some out of the way places. The motel is gracefully aging and the rooms are very small, there was free wi-fi, continental breakfast, extra coffee for the room, and free parking! The fridge and microwave were very helpful as we had taken some food from home to enjoy while on vacation. We will no-doubt return. Thanks again Nikki & Ray for all your help and friendliness!", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“Fantastic Location & Service”", "Author": "Sxottlan", "ReviewID": "UR87640071", "Content": "I stayed at the Travelodge Presidio in late October. After scouring the web for a place to stay, what drew me to this hotel was the mention of free parking. Having never been to San Francisco before, I didn't know parking was such a limited commodity. The free parking turned out to be a huge benefit. It is admittedly a tight fit (I think I counted eight spaces), but I never had an issue finding a spot. I was there three nights and the farthest away I had to park was half a block away. This was thanks in part to the great staff. The woman at the desk (sorry, I don't remember her name now!) was able to do a quick glance at a monitor to tell me there was a space around the corner. She was the same attendant when I checked in and she was very friendly and helpful, even asking for my preference of room. I ended up with a room with no direct neighbors and it was extra quiet. I mentioned the cameras before. It's nice that an eye is kept on the extra parking, but it did not seem I had to worry about the area. The neighborhood itself is beautiful, with many tourist spots within walking distance. My last morning there, I was able to cross the street and wander through the Letterman complex on the Presidio and then stroll over to the Exploratorium. While other hotels just down the road were right on the busy Lombard St., this stretch is just off the main highway and it's surprising how quiet it was. I was there during the World Series and I was even able to walk half a block to a bar full of Giants fans and watch the game. That same helpful attendant told me the bar was recently used for a movie, something that myself as a movie nut appreciated. I can't think of any real complaints. The room had the usual amount of wear and tear. The free web connection was a little flighty at times, but I also don't have a great laptop either. I have already told a number of people that if they ever go to San Francisco, to stay at the Travelodge Presidio.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Hidden Gem”", "Author": "TheRayWatcher", "ReviewID": "UR87294204", "Content": "The hotel location is great. Walking distance to great restaurants, night life, Palace of Fine Arts, and you can almost see the Golden Gate Bridge! We stayed for 5 nights and it was great. They have remodeled some and had a comfy bed. Parking was tight but for ~ $90/night, you can not beat this hotel.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Honolulu, HI", "Title": "“Great place to stay”", "Author": "HI-Garden-Gal", "ReviewID": "UR84911574", "Content": "We enjoyed our stay at Travelodge Presideo very much. Raymond, at the front desk, is \"Mr. Travelodge\" himself. He was cheerful, helpful, friendly and knew so much about the bus routes and things to do in the city. The room was comfortable (a little small, but this is San Francisco!) and we had a great night's sleep. Would definitely recommend this place to anyone.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dana Point", "Title": "“Great Staff”", "Author": "PeterSurf", "ReviewID": "UR84773907", "Content": "Tyler and Raymond went out of their way from recommending restaurants to locating a taxi cab. I would highly recommend staying at the property.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Springfield, Illinois", "Title": "“Very helpful staff!”", "Author": "bikelady_10", "ReviewID": "UR84751416", "Content": "Staff helped with dining and tour referrals and made arrangements for shuttle to the airport. This is the kind of service you expect at higher-priced hotels. We were very pleased and would definitely recommend staying here. Our room was smallish, but we were quite comfortable.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Renfrew, Canada", "Title": "“Close to Golden Gate”", "Author": "cleoder", "ReviewID": "UR84751317", "Content": "This clean motel is located relatively close to attractions. The room was equipped with fridge, coffee maker, flat screen TV king bed & a safe. WiFi connection is free & good. as is the free continental breakfast served each morning. Parking is free but limited to early comers. Restaurants are located close by in the good safe neighbourhood. Tour buses come to pick you up and drop off after. Tyler, the desk clerk, is high on life and can't do enough for you. Every hotel should have a Tyler. The parking area is covered by security cameras. By the way this hotel is located on famous Lombard Street.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saratoga Springs, New York", "Title": "“Location,price and quietness were great for San Francisco”", "Author": "chipjane077", "ReviewID": "UR84248410", "Content": "The location on Lombard st. is one block from the Presidio(a quiet section as Rt.101 turns off Lombard to enter the GG Bridge). The clerk, Tyler was a great help in planning our stay. The price included parking, but there are limited spaces(fewer spaces than rooms) so check in early and take public transit back to downtown.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“This Hotel Was Instrumental To an Awesome Vacation in San Francisco!!!!”", "Author": "SFOLover", "ReviewID": "UR84083806", "Content": "First of all I want to say that Tyler (The General Manager?) was extremely professional, friendly, and helpful with our travel arrangements. He never asked personal questions, but the probing questions that he did ask were instrumental in helping us plan our trip. He was very knowledgeable about the local transit system and sites of interest around the region (from Point Reyes in the north to Santa Cruz in the south). I believe that good managers also tend to hire individuals who are very much like them. All of the other staff members were exceptional. You cannot beat the location of this hotel. We could virtually walk out of our door and walk right onto any city bus. Lots of places to eat, the Presidio, The Golden Gate Bridge, and the Fisherman's Wharf were only 5 minutes away (either by walking or by bus). My wife and I felt entirely safe in the neighborhood. We had a wonderful trip to San Francisco and if we ever return we will definitely be staying at the Travelodge Presidio. THANK YOU!!", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Redondo Beach, California", "Title": "“Can't beat the staff, a great location and nice rooms............”", "Author": "chris90277", "ReviewID": "UR83727383", "Content": "I stayed a the Travelodge Presidio for 7 nights and had a great stay. 8 of us were participating in a sailboat race on the Bay and the hotel's location was perfect for us.... every morning it was a nice walk past the Palace of Fine Arts down to the harbor. I have traveled extensively both in the US and Internationally and have always found that the people make the difference from one location to the next. This was particularly true at the Presidio Travelodge. The hotel manager, Raymond Archer, couldn't have been more helpful or cordial throughout our stay. He really has a passion for his job, and was more than helpful anytime we asked him about where to eat, an attraction to go to, or if we needed help with anything. I think he said that he has sampled over 200 restaurants in SF and countless attractions.... talk about a local resource... he's a wealth of knowledge and has a great attitude. I had a difficult situation arise, and Raymond went out of his way to help me and resolve the problem. In my haste to check out of the room, I left my laptop and didn't realize it until I was about 100 miles south of San Francisco. To say that he went out of his way to track it down is an understatement. He proved to be very resourceful and located the laptop after an interesting interaction with the new guests who were in my room. I know that if it wasn't for him, I would be without my laptop. Great hotel and unbeatable staff.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bend, Oregon", "Title": "“QUIET, park it (free) - transportation to ANYWHERE across street”", "Author": "denisehammett", "ReviewID": "UR83077489", "Content": "All the staff - Tyler, Raymond, Niki, Richard - are very knowledgeable about the city and how to get there. We were here for 10 days due to medical issues but were able to get out everyday and enjoy some of what the city has to offer. We parked our car (for free) and never drove the entire 10 days. All transports across the street. Unfortunately my husband got something out of the car and left a light on and ten days later it wouldn't start...but Raymond came to our rescue and went out of his way to get us up and running all with the best attitude. Iam a very light sleeper but it was so quiet, I slept very well, felt safe, and the location was perfect for need to get to UCSF. Rooms are small but so are they on cruise ships!!!!", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redding, California", "Title": "“I am staying here when I go back to San Francisco”", "Author": "memorylost777", "ReviewID": "UR83027852", "Content": "Tyler the manager was amazing. He was polite and ever so helpful. When I go back to San Fran I will definitely stay at the Travelodge. The service and room and price dominates every other hotel I have ever stayed at. They have a customer for life!", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moose Jaw, Canada", "Title": "“Our stay was a pleasant, memorable experience.”", "Author": "rosewood65", "ReviewID": "UR82877310", "Content": "The location was great and the staff went out of their way to help us out. Our gracious host, Tyler, willingly offered us adivice on where to go, the easiest connections and buses to take, etc, what highlights to see, etc. He was very polite and friendly. We'd go back there again.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“doesn't deserve pet friendly status”", "Author": "florafuerte", "ReviewID": "UR82360410", "Content": "They allow dogs as long as you pay to board the pet somewhere else. They will charge for your pet but that's just where the pet fees begin. All the places in the city close for day care around 7pm so if you plan any late nights say for a show and dinner then you have to board your pet overnight . They made me sign a notice that stated if I left the dog in the room for any reason ( even in a kennel), you know to shop, go to dinner etc., that they would enter the room and take your dog to the pound. None of this was mentioned when I called to book the room which I always do when traveling with my dog, only upon arrival. Of course other people in the hotel with dogs did leave their dogs but I didn't feel comfortable with that risk hanging over my head. I left and went to the Argonaut and both me and my dog had a wonderful stay.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Great nights sleep”", "Author": "Louvul", "ReviewID": "UR79977921", "Content": "We loved the location and the staff was very helpfull. The limited parking spaces were a problem but on street parking was close. Take public transportation once you park. Much easier on both ends. The room was clean and much better than what we read about in other reviews for the price. The Beds were great, the neighborhood was quiet and we slept well. It wasn't fancy but the kids were comfortable and enjoyed being here. We would stay here again, hopefully with enough time to enjoy the area around the hotel more.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bonnyville, Canada", "Title": "“perfectly quiet place to get sleep at end of a long vacation day”", "Author": "bluebear0928", "ReviewID": "UR78390829", "Content": "very quiet - number one thing we wanted - older hotel - so very basic - but don't let that fool you! the location is good - the breakfast - while not much variety - was plentiful and fresh and we did not have to worry about there being nothing left if we were a bit later arriving. The staff was terrific - a special thanks to Raymond at the desk for all his spectacular help! Safe area - convenience store and a couple of food choices right next door. IHOP 3 block walk as well. All in all a good stay!", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Suffolk", "Title": "“Amazing Stay”", "Author": "Duggs", "ReviewID": "UR78102410", "Content": "As mentioned on several previous reviews, the staff at this hotel are fantastic. Both Raymond and his female colleague are the friendliest people you could ever hope to meet. Upon check-in Raymond kindly upgraded us to a larger room having seen the amount of luggage we had in tow and then enquired about what we wanted to do in SF. (Hint: Room 301) He completely arranged a fantastic city tour for us, telling us exactly where to be and at what time. The hotel is tucked neatly down one end of Lombard Street and we didn't hear a thing all night, no traffic noise whatsoever. Beds were extremely comfortable. We travelled for nearly 3 weeks around the West Coast and this was the ONLY location that offered free internet access using their in-house PC. A very nice bonus. Free parking also. The walk from the hotel to Fishermans Wharf will take about 45-60 mins but its a safe and enjoyable one. Note: IHOP is just down the road also, a good stop for a full breakfast etc. Another \"buzz\" for me, as I found out on Raymonds recommended tour, is that the start of the famous car chase in Steve McQueen's Bullet was filmed literally 100yds down the street from the Hotel. (I know as I've since watched it on YouTube). Nothing more to add than to say \"Do your self a favour, save a fortune and stay here\".", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Windsor, Canada", "Title": "“Good value and location”", "Author": "travel9396", "ReviewID": "UR77367762", "Content": "You cannot beat the price and location when looking for a place to stay in San Francisco. It has free parking and the rooms are clean and quiet. You can get anywhere by bus in a short time. When we first arrived we were greeted by Raymond who is extremely pleasant and helpful (as was the other staff). Basic continental breakfast was fine considering the price of the room. We enjoyed our jogs through the Presidio which is right next to the hotel.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Ideal spot for San Francisco stay”", "Author": "DMW1970", "ReviewID": "UR76663825", "Content": "Stayed here with wife and 6 year-old son for two days SF sightseeing. Decent, clean rooms at a very competitive price with free parking. Located on a very quiet end of Lombard Street next to the Presidio with very easy bus access to all parts of the city. Continental breakfast was as expected for similar stays we have had in California - coffee, juice, cereals and a pastry or two. Many thanks go to Raymond, who is extremely knowledgeable about SF, its sights and things to do. He helped us with many aspects of our sightseeing and went out of his way to help us on more than one occassion. We will be staying there the next time we visit San Fransisco, that's for sure.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“You can find no better hospitality staff at any price in the U.S.A.”", "Author": "squ1", "ReviewID": "UR76320096", "Content": "We found this hospitality gem by accident when another motel where we used to stay in the Marina district went out of business: how lucky can you get! We've returned year after year -- not just because of the Presidio/Marina location but because the staff is SO WONDERFUL! No matter what you need to know about the city, Tyler and Ray can give you great guidance. No matter what you need to make your stay more comfortable, they always go out of their way at any time of day or night. Really, you can't pay for this kind of service: these guys are the best!", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calistoga CA", "Title": "“Great location, comfortable, clean and very accomodating staff”", "Author": "HPGHCalistogaCA", "ReviewID": "UR76072540", "Content": "I have stayed at the Presidio Travelodge for leisure travel and my husband stays there regularly for business. The location is a perfect jumping off point for the great restaurants of the Marina neighborhood, sightseeing in the historic Presidio, walking across the Golden Gate Bridge, visiting the Legion of Honor. Also, it is just a short distance from Fisherman's Wharf, Pier 39, The Walt Disney Family Museum, The Exploratorium, and the Cable Car Museum. The rooms are clean and the staff is very accommodating and there to help you with your needs.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Britsh Columbia", "Title": "“A wonderful place.”", "Author": "WestWind12", "ReviewID": "UR75229386", "Content": "My family really loved this place. It's an older building with various levels, lots of stairs, limited and tight parking, smaller rooms compared to a modern hotel -- all fitting the San Francisco area perfectly. The different levels and stairs made for a very interesting building and a cozy atmosphere. This style fits with the buildings around it and added to our San Francisco experience. The parking was tight but we got in and out okay. The rooms all have doors to the exterior walkways. Our room was adequately large for us, with a new large TV and comfortable beds. The bathroom was also small but had a nice craftsman style cabinet. The shower door frame was a bit rusted but that would go with the humid, salty air of San Francisco. The room was clean and the A/C unit was very quiet. Our check in and out was easy and the person was very friendly and helpful. We liked the location because: it was off the main street and quiet, was a nice area to go for a walk from (around part of the Presidio or the Palace of Fine Arts), and was a relatively short taxi ride to the Piers. I would like to stay there again.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California", "Title": "“A bargain in SF”", "Author": "txorig", "ReviewID": "UR74985883", "Content": "Weâ€™ve now stayed here 3 different times and figured we should go ahead and write a review. Our first visit was in May and it was just ok. Family just moved to the Presidio and this hotel is literally walking distance to their place. Bonus for us is the location. It is an older place, but I have to say, it really is kept very clean. The old building and the old dÃ©cor account for the cheaper priced rooms which is without a doubt a bargain. Free parking and wireless thrown in the mix and itâ€™s almost a steal. Forget the breakfast (cold cereal, teeny cups for coffee and packaged Danish) and realize the rooms are not your standard size and youâ€™re fine. The room we got was in the back (306) so the noise of Lombard eluded us. Unfortunately, the room was one of the oldest ones. There were some minor annoyances. The room is small, but we could live with that. The bathroom was very much in need of work with the shower door wobbly, but functional. The window in the bathroom (a bonus to us to have fresh air) would not stay open so we propped the ice bucket under it to hold it open. We were there one night so we didnâ€™t report it (we should have) however they sent us a Travelodge survey after our stay and I was honest about the condition of the room. I got a phone call within a day of filling out the survey. I have to admit they seemed genuinely interested in my feedback. We stayed again this past week and the room we got this time was much better. Still same old dÃ©cor and small, but the bathroom was remodeled with the shower stall new, granite tops and a vanity with some room to store toiletries. We had a problem with noise just as we were turning in for the night and this time we did report it. It ended up being the plumbing in the room above us. They came immediately, but because of the hour they were not able to do anything about the problem. They discounted our room and the toilet upstairs was fixed the next day and we had no more problems. On our third visit we were back in room 306 with the old bathroom. Raymond, the manager, told us that they were in the process of refurbishing all the bathrooms and the next phase will be to replace the furniture. They truly do seem to be upgrading the hotel to higher standards. All in all, you cannot beat the price, location and service.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Great place.”", "Author": "TexItalian", "ReviewID": "UR73488360", "Content": "The place is old and some of the rooms are cramped but the Travelodge at the Presidio is a bargain in an very expensive city. The front desk personnel are all A+ people and the location near the Presidio is relatively quiet. The free parking is a huge plus and the free i-net is fast. The breakfast is adequate but the dining area cannot handle more than about a dozen folks. All in all a very good place to stay.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sonoma County", "Title": "“Good location, free parking, but watch out for group bookings & next-door pre-school”", "Author": "Victoria098", "ReviewID": "UR72576736", "Content": "Good value for a last-minute booking to take grandson to Golden Gate Park museums. Location near Marina/Presidio is nice. Quiet back street. But checked in same night as group of motorcycle riders who used the parking lot to party. All quiet by bedtime but made for a noisy evening -- we left to escape. Don't underestimate the value of the free pkg --it's a huge asset in SF. Rooms are somewhat dated but clean w. good beds & vary: ours was cramped & dark, our daughter-in-law's was light & spacious. Same price. Front desk staff friendly & helpful. Good restaurants to walk to: Baker Street Bistro around the corner exc! As is A16 on Chestnut Street. Either plan to rise early or to enjoy the sounds of children playing: pre-school next door lets kids out to play about 8:30.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sudbury, Canada", "Title": "“Amazing service, great bargain, don't worry about the location.”", "Author": "gb4532", "ReviewID": "UR71800527", "Content": "I stayed for one night on rewards points with some hesitation over the location. I had chosen the hotel owing to the excellent reviews on tripadvisor. I was in town to see Paul McCartney and to go to Yosemite National Park (which they had good advice about). The location was not a problem at all, as long as you are willing to take a bus, most of which are just around the corner of the hotel. Also, it is in a nice quiet location so it is nice to retire to a quiet room at night. The staff is unbelievably helpful, all of whom went above and beyond the call of duty. The gave me a card and told me I could call at any time I needed any advice/help. They also sell MUNI passes which is very convenient for unlimited bus/streetcar travel. I would definitely say this place is a hidden gem if you are looking to save a few dollars (even though I used points, rates seemed cheap), get a clean/quiet room (there was new bedding in ours) and are willing to spend a very short amount of time taking public transit. You can tell just by looking at the hotel website or how they respond to most tripadvisor comments that you are going to get a well looked after hotel. Don't be worried by the Travelodge association if you have had bad experience in the past.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Antioch, California", "Title": "“Nice”", "Author": "jyount328", "ReviewID": "UR71509928", "Content": "Front desk is very friendly and accomidating. They were great in getting a cab \"On time\" very early in the morning. Quick, easy and great service.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“FABULOUS STAFF-GREAT LOCATION-CLEAN- 5STARS!!!”", "Author": "AlwaysTrvln", "ReviewID": "UR71257846", "Content": "I came to the Travelodge with not much to expect, except it was a \"Travelodge\"...however I was INCORRECT. This is a FABULOUS Travelodge. Not just the staff, the location but the ROOMS! They are all upgraded, have flat screen tv's. FREE BREAKFAST! Who does that now-a-days? FREE...something for FREE in this world...AND PARKING...FREEEEE..IN SAN FRAN...go stay at another hotel and you will pay at the LEAST $25 a NIGHT for parking. The staff is absolutely FANTASTIC! Raymond at the front desk, took time to xerox maps from the map book, highlight the areas I was going to be driving AS WELL as printing out the directions from mapquest, or whatever they have on their front desk computers. I was scared to drive in the city b/c of the one way streets, hills, trolleys etc. He directed me in the most simple possible way to get to my destination. Tyler the morning person (at the front desk), was soo kind to me when I called and had several questions as to where the hotel was in radius of other places, parking questions, food/restaurant advice etc...They are both great! Have to say...IF you don't want to be in the crowded city but close enough for a $10 cab ride...STAY HERE..it's quiet, convieniantly located...JUST PERFECT! Thank you Travelodge for a great visit!", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Cruz, California", "Title": "“Great Value, Clean!, Friendly Staff, Quiet and Convenient”", "Author": "GYG-2010", "ReviewID": "UR70340172", "Content": "I have stayed here for business twice and have not been disappointed. It is right next to the Lombard gate of the Presidio and very close to the Marina, Ft. Mason, Palace of Governors/Exploratorium, Disney Family Museum and all the other cool stuff at the Presidio. There are great restaurants, reasonably priced that you can walk to for meals. Richard was especially helpful the last time I stayed. The staff is always courteous and helpful. The motel is NON-SMOKING, all rooms, and they smell fresh. A lot of other places in this price-range say you're getting non-smoking when you actually end up with smoking. I have not stayed here with my family but I would if necessary given the cleanliness and value.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "upstate NY", "Title": "“Great stay and so conveniently located”", "Author": "trvlexprt097", "ReviewID": "UR69476831", "Content": "My mother had booked this hotel for our stay in San Francisco and I was a little sceptical at first being a Travelodge. However, the staff was great, very friendly and helpfull for us. The manager made sure to get us all the applicable discounts on the room even rechecking and crediting a discount that the checkin person had missed. There is free wi-fi in all the rooms and there is a business center in the loby where you can use their computer and even print things. I needed to print my vouchers for our Alcatraz tour and the manager even helped recommend the best company to buy from to get the best deal. The location of this hotel couldn't be more perfect. You are right off of lombard st which is a busy street so being 1 block up from the traffic made the hotel very quiet, we just heard the occasional bus go by but it wasn't bad at all. The hotel doesn't have a huge parking lot but their spaces are free if you're staying at the hotel. This didn't matter too much because you're so close to restaurants and shops that if you don't mind walking a couple blocks there's no reason to drive. Plus in the Marina district, if you drive and try to find a parking space near your restaurant you'll probably end up parking a few blocks from your destination anyways so parking at the hotel and walking is the best bet. You're close to the Marina Green, the Exploratorium and many muni stops. The rooms must have been updated recently and were very nice. Exceeded my expectations for a Travelodge. All in all a great stay. I would deffinetly book this hotel again or recommend.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tucson", "Title": "“Great value and customer service”", "Author": "BeaTucson", "ReviewID": "UR69031277", "Content": "The location is near the Presidio and very quite. The rooms are rather small but adequate. However, the customer service is outstanding. The people on the hotel staff are very friendly, knowledgeable, and extremely helpful.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Friendliest staff and exceptional care”", "Author": "vikkig94123", "ReviewID": "UR67836293", "Content": "During apartment renovations, I had an extended stay at the Travelodge at the Presidio with my pug dog. Tyler, Ray, Nicki, and Andres took great care of me and my dog. Professional, friendly, caring, courteous doesn't even begin to describe their level of service. The room was clean and very quiet. The staff became my temporary family - I still live in the neighborhood and walk my dog over to say hello - she won't let me walk to the Presidio without pulling me in the direction of the Travelodge. I highly recommend it for your stay!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bowling Green, KY", "Title": "“Great Price, Quiet Location Yet Convenient”", "Author": "KatFrazz", "ReviewID": "UR67639363", "Content": "I, too, picked this place after reading online reviews. My sister and I stayed here 5 nights and it looks like they've recently upgraded the rooms (new carpet, bedding, bathroom sink area). There's not a lot of counter space in the rooms, but I loved the thermostat controlled air conditioning. I had to strategically clip our curtains closed to keep it dark in the room, but there was little to no noise! Bed was super comfy. The hotel is about 2 blocks off Lombard Street. About 4 blocks from the hotel on Chestnut Street there are a lot of restaurants and shops to check out. There is a MUNI bus stop right across from the hotel, and one just a few blocks away for a different line. They have free parking (BONUS!) but the spots are really tight! Luckily we were in a Bug. Free continental breakfast was enough for us. I usually skip breakfast anyway. The front desk guy in the mornings always asked how our day was and would tell us about any festivals or cool events going on. He is by far one of the best frontline personnel I've seen (and I work in the hospitality industry!). After shopping for a long time I found the specials on their website were the best prices. There was a discrepancy between what I had reserved (price) and what I was charged. Turns out there is a small fee for use of the safe that you can decline at check-in (I didn't notice it on the check-in sheet I signed) but I emailed the hotel and they refunded the money since we didn't use the safe. I would definitely stay here again.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great Staff”", "Author": "green_beam", "ReviewID": "UR64300390", "Content": "We stayed here for 3 nights as we'd found it recommended on this website. The staff were super helpful with helping us figure out our bus routes, restaurants to see, etc. The hotel was very close to public transportation, which was a bonus for us since we took the bus everywhere. The hotel is located in a quiet, safe area. The parking was free- the spots were a bit tight. The room was fairly average- nothing too exciting. The continental breakfast was also fairly average. We would stay here again for sure.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "canada", "Title": "“quiet location with first class tourism information included”", "Author": "2fortravel_10", "ReviewID": "UR60855300", "Content": "Our stay here was a pleasure due to the personal service provided by the staff -- Ray, Tyler and Nikki all enhanced our stay by offering advice as to what to see and how to get there. We found the public transport easily accessible and many sites and services within walking distance as well.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Marcos, CA", "Title": "“By far, the nicest place for the price, location & staff anywhere in SF.”", "Author": "ontherios", "ReviewID": "UR59871605", "Content": "The quiet street & park access is great. Public transportation let's us park the car for our whole visit unless we head out of the city. It's the staff which really keeps the place humming and provides everything possible for guest enjoyment. They watch out for your belongings [once we left for the day w/ car doors & trunk open which they noticed & locked for us]. They are the best source for local events & info on everything 'city' you need to know. Tyler, Raymond & Nikki get extra cudos for going above & beyond in assistance and pleasant attitude, even at the end of a long shift. If you have a YMCA membership elsewhere, you can get a discount to the nearby Presidio YMCA for $3/day.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lakewood", "Title": "“We found a little gem in a handy neighborhood.”", "Author": "CraftyGrammy4", "ReviewID": "UR59548796", "Content": "The Presidio Travelodge turned out to be close to the sites we wanted to see, namely the Presidio and the trails in the area. The Tuscan decor and newly re-done bathroom made for a pleasant stay. The real jewel at this site is Raymond who can tell guests how to get anywhere in the city because he has been there himself. He could even tell us travel time on public transportation to get from one location to another. If you have a question, Raymond can answer it! A very service-oriented location.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria", "Title": "“An excellent place to stay”", "Author": "PURRRRRR", "ReviewID": "UR59315099", "Content": "For the past few years, I've stayed at this place every Spring & Fall on golf trips. It's clean, well managed and there's ample free parking. Rates are reasonable. I like it as it's just outside Presidio's East Gate and it's central to all the great tourist spots. It's not far from Fisherman's Wharf, yet quieter then staying at hotels on the wharf. Easy access to downtown via city bus (avoid driving in San Fran if possible) and close to a site seeing bus dropoff point at Broderick & Chestnut Sts. The Manager, Tyler and his staff, Angie and Raymond are very helpful and have alot of tips on San Fran. I always stay at this place and highly recommend it.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Place Great Staff”", "Author": "Madysmum", "ReviewID": "UR59297048", "Content": "Nicky and Tyler are very helpful and courteous, the hotel although a tad small for 4 of us was great very convenient and clean , we will definitely be back", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Location, service, price!”", "Author": "Peripatetical", "ReviewID": "UR58449444", "Content": "Those are our criteria and the Presidio Travelodge meets the all. The location is great, a half block east of the Presidio with easy driving to Golden Gate Park or Downtown The staff is unbelievably friendly and helpful. When was the last time a front desk clerk offered to help you with your bags? The price is extraordinary, $100 or under in SF! (look in the coupon book found at rest stops and TICs). The rooms are small by new motel standards, but who spends much time in their room here? The lovely kingsize beds take up a lot of room, but they're worth it. Over the years we've been coming here the facilities have constantly been upgraded. Our room was freshly painted and spotless. The bathroom was new. The only drawback is that there isn't a parkng spot for every room, the place was built before the news standards were adopted, but the staff trys to fit you in. We shall return! PS: try the Baker Street Bistro just around the corner.", "Date": "March 13, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "brooklyn", "Title": "“Amazing Staff”", "Author": "davebrooklyn", "ReviewID": "UR56509042", "Content": "I have to say I was totally blown away by the service here -- Ray at the front desk is truly a 5 star hotel kind of guy. Great that Travelodge has him working here.. Dave", "Date": "February 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mount Shasta, CA", "Title": "“four star service at economy price”", "Author": "oldbrick", "ReviewID": "UR56315531", "Content": "My family and I stayed here for our weekend trip to San Francisco. This Travelodge is located in a quiet area sandwiched between the beautiful park-like Presidio, the upscale Pacific heights neighborhood, the Palace of Fine Arts, and the Golden Gate Bridge. The staff were wonderfully helpful and accomodating, especially Raymond. The rooms were a bit small, but very clean, and equipped with a fridge and a self locking safe. The pillows were new and fluffy and they gave you 2 per person (8 pillows with 2 queen beds). The beds were new as well, on the firm side. I slept well and never heard any of the other guests on the busy Valentine's weekend. We brought our dog and he was greeted with a gourmet doggy treat bag and the same personable treatment by the staff that we received.The high-speed internet was very fast and the connection was excellent. There is a parking lot, but it fills up fast. The neighborhood has plenty of free overnight parking however so that is not a problem. The staff were very friendly, taking care of our every need from calling us cabs to giving us advice on museums and restaurants. I was very impressed. If you stay, ask for Raymond. I will definetely be staying here the next time I am in San Francisco.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Disappointed!”", "Author": "CatmandooMD", "ReviewID": "UR55256368", "Content": "Yes, the front desk staff is wonderful. However, during our four-day stay in late January, the bed was not made once (although the coverlet was pulled over the pillows) nor were the trash cans in the room emptied. The room was small , looked tired, and felt dirty. The continental breakfast was limited to a choice of three dried boxed cereals and prepackaged pastries. Pluses include the hotel's location, right next to the magnificent Presidio, a short walk to great shops and local restaurants, and close to the Golden Gate Bridge.", "Date": "February 5, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Colorado", "Title": "“Great lodging in San Francisco”", "Author": "FriskyfromFrisco", "ReviewID": "UR53637773", "Content": "Stayed at the Travelodge at the Presidio. Great value for the $! The staff was helpful directing us to places of interest. We enjoyed an Evening Alcatraz tour. Toured the Embarcadero and had dinner at Boudin's Bistro. Dinner and a Concert at Yoshi's of San Francisco. Toured the Presidio, Muir Woods. Rode the cable cars and found the mass transit system (called Bart) to be very efficient! This was my first visit to San Francisco and I have to revisit.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wyoming", "Title": "“Friendly and Helpful Staff”", "Author": "spdykyla", "ReviewID": "UR51410747", "Content": "We arrived around 9pm and Raymond Archer checked us in. He was SO enthusiastic about the city that we decided to stay two nights instead of one! He squared us away with maps, directions, bus schedules- everything we needed to get around without taking our car. The room was perfect for us- we had two queen beds for two adults and a ten year old at a reasonable price. We had two great days and nights thanks to Ray!", "Date": "December 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California - North Bay", "Title": "“This was a most pleasant experience during a difficult time”", "Author": "snodog54", "ReviewID": "UR51403057", "Content": "My daughter was having surgery at UCSF and required to stay in the San Francisco hospital for a week. We needed a nice place to stay, with proximity to UCSF Mt Zion Hospital, and not cost an arm and a leg. We found that and more at the Presidio Travelodge. Firstly, the cost was very reasonable and we received an additional 10% off for staying a week, and another additional 10% off because my daughter was at UCSF. The rooms were very clean, comfortable, and well attended. The refrigerator (larger than otehr hotels), microwave, coffee-maker, and continental breakfast really helped us save money on meals as well. There was free and easy Wi-fi that helped us stay connected with concerned friends and relatives. The ENTIRE staff were extremely friendly and helpful, some of the best we've experienced, even from high-priced hotels. We were in and out all hours of the day and sometimes slept during the day. The staff actually left us alone if we put the \"do not disturb\" sign on the door. Moreover, the location is on Lombard Street, but a few blocks from where Lombard is Hwy 101. This makes for a very quiet stay but yet very close to everything. There are bus stops right at the hotel, so you can get to anywhere in SF. There are also a couple of nice pubs within 1/2 block, also a pizza joint and small grocery/liquor store. Though there is free parking, late at night on weekends it can get full and you have to stay on the street, which posed no problem in this good neighborhood. We would definitely would stay here again and recommend it to others.", "Date": "December 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Castroville", "Title": "“The Presidio Travelodge proves to be perfect.”", "Author": "artichokequeen", "ReviewID": "UR50533639", "Content": "My husband and I traveled to San Francisco for a relaxing, romantic weekend and found the accommodations at the Presidio Travelodge perfect. From a free parking spot to gracious hospitality by the staff, we were consistently pleased with the hotel amenities. The hotel staff provided us with a list of current activities, restaurants, and transportation suggestions. I would highly recommend this hotel to any traveler seeking affordable and note worthy lodging, knowledgeable staff and the excitement of being in the heart of San Francisco.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Aptos", "Title": "“Great Hotel to stay at!”", "Author": "SCgirl123", "ReviewID": "UR49518515", "Content": "Tyler the manager is always willing to work with you on room availability. I couldn't recommend a better hotel in the area. Great price, perfect location, highly recommended.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Boston", "Title": "“Travelodge Presidio is well worth the price”", "Author": "Szabby", "ReviewID": "UR48321476", "Content": "We were two adults and a child for two nights in San Francisco. The Travelodge was just what we were looking for. Privacy, cleanliness, sufficient space, and great location. We found them all. Across the street from the Presidio, an easy walk to the Exploratorium, Palace des Arts, Chestnut Street, marina, Crissy Field. And for $150 in the middle of SF, it's a great price. Okay, it's a little tired around the edges, and there were a few holes in the bathroom walls where fixtures were changed, but that didn't bother us. It's easy to get everywhere, and parking at the Travelodge is free. They even let our visitors park in their lot.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“Travelodg Presidio Continues to Impress!”", "Author": "rnet123", "ReviewID": "UR47585729", "Content": "My husband and I have stayed at this particular Travelodge at least a dozen times and always leave feeling rested, happy and very satisfied. Tyler, the GM, and his staff continue to take the upmost care in the property and their guests. From the lovely breakfast buffet to their outstanding customer service, this property is a REAL value!!", "Date": "October 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Huntington Beach", "Title": "“Friendly Staff, close to everything”", "Author": "hbjill", "ReviewID": "UR46380762", "Content": "We stayed here for a weekend in early August. Flew in to SF airport, no good transportation late at night to motel, but we called the desk and were given instructions on how to get there via Bart and a taxi. Next mornig desk clerk was very helpful in getting us bus schedules and directions to whee we needed to go. Bus stop very close to motel. Nice room, older but well maintained. Quiet, even though it is fairly close to main street. Not enough parking, so good reason to not have own transportation.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“awesome staff, great location, free parking!”", "Author": "aussie020", "ReviewID": "UR39971296", "Content": "travelled from Australia and after looking at many other motels, we decided on the Presidio Travelodge for the loctation and couldnt be happier. its in a nicer part of town, near park, and walking distance to Chesnut Street with loads of shops and cafes. the staff were great, especially Raymond, he was a huge help to us with friendly advice about where to go and what to do around the city. its quiet, safe and clean. we would stay again. thanks Ray!", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Santa Cruz", "Title": "“Perfect location, great service and staff, and a clean, upscale room.”", "Author": "laurenkauai", "ReviewID": "UR35791620", "Content": "The manager Tyler was helpful and friendly. My boyfriend and I really appreciated the Judy's breakfast coupon and the great recommendation! The food was awesome! I loved the view from our room and the bathroom remodel job was fantastic. The staff were all personable, yet professional and the location within the Presidio was perfect. Overall, our stay was made comfortable, affordable, and fun all because of this hotel. Again, Tyler was a great manager, very knowledgeable and congenial. Thank you for providing such a spectacular home-away-from-home for us!", "Date": "July 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The location is prime and we were able to walk to most of the interesting places and the service is excellent.”", "Author": "nornie", "ReviewID": "UR34950118", "Content": "Ray Archer, the sales person there is a good man and he went out of his way to help us get around in San Francisco in the most economical way and point out some of the Independence day's events and the best place to be for the fireworks. He also gave us the weather forecast for the day during breakfast.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Great Place to stay fantastic staff comfy beds great internet!”", "Author": "localadelaide", "ReviewID": "UR32338294", "Content": "We stayed here for three nights on our arrival in US and the last two nights before departure, rooms are adequate for the price, the beds are the BEST! Quiet location but still handy free parking and free internet, breakfast included for a very reasonable price. But the most memorable feature are the friendly and helpful staff - Ray and Shelley couldnt do enough for us - nothing was too much trouble - where to go how to get there shopping hours etc - anything you want to know just ask! Leaves you with a nice memory of San Francisco - would definately recommend for the budget traveller and would stay here again! Thanks Ray and Shelley - your help was very much appreciated.", "Date": "June 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Estes Park, Colorado", "Title": "“What a great deal, for a really nice place!”", "Author": "Heatherbrownstone", "ReviewID": "UR29476502", "Content": "What a great location, for starters....just 1/2 block from the entrance to Presidio Park. It's very quiet, being a block off of the busy Lombard thoroughfare. Raymond, one of the clerks, just couldn't have been nicer and helpful, as was everyone we came in contact with. The room is smallish, but we knew that going in. The beds are very comfortable and the maid service does a very good job. We stayed 5 nights and everything was always clean and fresh. I would highly recommend this motel for a short or extended stay....one big perk is the free parking lot. Very safe neighborhood, close to the Golden Gate Bridge and near charming Chestnut St. for great bars and restaurants. Walking distance to the Marina, too. Thanks for a great, affordable time!", "Date": "May 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Good Value, comfortable beds”", "Author": "ce-uk", "ReviewID": "UR29199658", "Content": "We have stayed in Travelodge hotels in the UK so we were not expecting the Hilton. This isn't a new hotel so the furniture is a bit worn, however it was clean, there was hot water and it was quiet. It is near the very end of Lombard street so the busy traffic has turned off at this point. The breakfast was simple - cereal, coffee and pastry - by edible and adequate. The beds were excellent in our room, very comfortable. This was good value for money.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "lynchburg, va", "Title": "“Would never stay there again!”", "Author": "vsp527", "ReviewID": "UR29164715", "Content": "The rooms are small and crowded. The temperature control in the shower is very difficult to control. I turned water on and waited several minutes for the temperature to stabilize. After getting in, the water got scalding hot. There is just a trickle of water and I mean a trickle. It kept changing from hot to cool. The room was supposed to be non smoking but it smelled like smoke. They have 27 rooms and only 16 parking spaces. Parking is a major problem in this city and if you have a car, you may or may not have a parking spot when you come in at night. The parking spaces they do have are very small and only suitable for small cars. They charge you a 20.00 fee when you check in whether you use the safe or not. I still do not have this charge taken off my card even though the clerk told me it would be taken care of. The hotel is not convenient at all and very difficult to get in and out of. The heating/ac unit made a terrible racket all night. The walls seem to be paper thin and we could hear loud people talking on cell phones and arguing in the adjacent rooms. The wireless internet barely works and is very slow.I booked this hotel through travelocity for 5 nights but we checked out after that first night. The clerk offered to change our rooms but there are so many negatives about this place we had to go somewhere else. I would not stay at this hotel again.", "Date": "May 1, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Location": "5", "Service": "5"}, "AuthorLocation": "lake mills, wi", "Title": "“Our stay at this hotel was excellent!”", "Author": "oceanlover15", "ReviewID": "UR28831441", "Content": "My husband and I stayed here over Easter- Thurs. - Monday and we wished we could of stayed longer! The staff was excellent! On Thurs. we went to a ball game at AT&T park and had a 3 day muni pass and we weren't sure how to use the bus system but the man at the front desk printed out a sheet of what bus we had to take and where to go. We wanted to go to a beach and the front desk recommended a beach that you could find whole sand dollars and we did! We were a little scared of the parking but we pulled in at 2pm and found a spot and many others empty. We took our car out, one day and came back and there was still a spot. We will definatly be back on our next trip to San Francisco!", "Date": "April 26, 2009"}, {"Ratings": {"Service": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Location": "2"}, "AuthorLocation": "annabell", "Title": "“Horrible Experience - Rude staff!”", "Author": "annabell7", "ReviewID": "UR24115142", "Content": "We booked our stay through priceline. Even though I had a printed receipt, which showed our reservation had been paid for in full - manager refused to acknowledge our reservation saying it must have been canceled. She also refused to call priceline to confirm our reservation. We called them ourselves and were told there must have been some kind of computer mix-up. Travelodge had a room available but refused to give it to us at the rate we contracted through priceline. We were told we could have the room at more than double the cost. We ended up going somewhere else and paying much less. I can not overemphasis how rude this manger was. She was completely unaccommodating and unsympathetic to our situation. Do yourself a favor and do not stay here. Thankfully, Priceline refunded our money.", "Date": "February 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "sharon ontario", "Title": "“Don't do it!”", "Author": "woodworker_8", "ReviewID": "UR21549403", "Content": "Four of us (2 couples) were on a one month trip in the southwest U.S. We prebooked all our hotels and B&Bs and this was our choice in San Francisco because of the price and the location. We did not expect the Hilton but we sure didn't expect this. We booked two rooms for three nights and the comments apply to both. The room was old, well worn carpet and furniture that appeared filthy in the poor lighting. The bathroom was moldy in the shower, around the ceiling and on the floor. There was no toilet paper holder in the bathroom and when we complained they said it would be done the next day (wrong). I went to the office which was under renovation to borrow a screwdriver to do my own repair in the room and was directed to the maintenance man in the breakfast room. He was sitting at a table with his feet on the table drinking a beer but did manage to find a screwdriver. Needless to say we didn't eat the complimentary breakfast in that room. The bed was clean and comfortable, but that is the extent of the good comments. Parking was another problem and we ended up parking off the premises around the corner at a restaurant as the lot was continually full. We found another hotel and booked out early as we just couldn't manage to stay any longer.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Coarsegold CA.", "Title": "“Enjoyed our stay.”", "Author": "TR4AIRS", "ReviewID": "UR20902456", "Content": "Staff very pleasant and helpful. Very good location. Room a little dated and on the small side but functional. Bathroom on the small side with older fixtures. Overall good experience. Advise you park the car and use public transportation. You will find that parking in SF is expensive and almost impossible to find.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "England", "Title": "“Location is no excuse!”", "Author": "coldmachineUK", "ReviewID": "UR20129572", "Content": "So the location is good but thats as far as i would go. The linen was dirty, the fridge was filthy and falling apart and the room made my skin crawl. Cheap is no excuse for failing to provide basic hygienic conditions. Avoid.", "Date": "September 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Taipei,Taiwan", "Title": "“Will stay there again”", "Author": "mickchiu", "ReviewID": "UR18128167", "Content": "Stay there with my family four nights. Small rooms, old building yet clean and almost everything runs pretty well. The front desk clerks were friendly and very helpful. They did everything they promised. Location is good for tight budget tourists. #45 bus terminal station is only one block away. Not far from the Crissy field and Palace of Fine Art. Hiking to the Golden Gate bridge is also not difficult for young children. My biggest problem during stay is internet access, most of the time it won't work and the manager on duty told me it's the internet service provider's problems, they can't solve it.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "tucson, arizona", "Title": "“great location for the budget traveler”", "Author": "luvtogoanywhere", "ReviewID": "UR17449204", "Content": "Dates 6/24-6/28 Spent four days in san fran and was able to do just about everything on foot from this location. (we are in our early 50's) It is literally at the entrance to the Presidio (which is beautiful). Within walking distance of the marina (view of golden gate) then just up a scenic walk to fishermans wharf. If you walk straight up lombardo (and I mean up) you can access the crookedest street. One night we took a cab from fishermans wharf (too much happy hour) and it was only 8.00! Our room was old, bed linens were comfortable but exceptionally clean. New AC/heating had just been installed. Bathroom fan was extremely noisy so we just used the heating light most of the time. Not enough vanity space so I utilized the coffee area for hair/make up. People at the desk were extremely helpful. Continental breakfast was packaged rolls, cereal, milk, juice and coffee. Low water pressure, lots of hot water. Area felt safe even at night. Got a great package deal via travelocity. Well what can I say-definitely not a ritz carlton but I am sure it saved us a lot in transportation. Parking was not an issue on the days we stayed as we did have a rental car-just never used it. Average budget motel-great location.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Walnut Creek, CA", "Title": "“Nice enough for SF.”", "Author": "Pharmagirl1", "ReviewID": "UR16686512", "Content": "We needed a place for the whole family for graduation. Since living in SF for 3 years, we knew how difficult it would be to place the whole family and make sure there were things to do in a relatively safe neighborhood. We picked the Presidio area because there was the Exploratorium and Golden Gate Bridge for the kids, Chestnut street for food, and the hotel had free parking. The price was decent for SF ~$100/nt. I booked 2 rooms off their website and 2 directly through the staff. Be cautious because if you book thru the website, you can't claim the AAA discount since they are sold thru a 3rd party. The first room we got was in the process of a remodel and smelled like heavy paint. They told us they weren't going to give us that room over the phone in the AM but stuck us with that room anyway...the bathroom was semi-moldy and not done yet. After the first night, we asked and finally got a completed remodeled room which was very nice and comfortable. (2nd floor middle corner room). They have free parking, but only a limited number of spaces so you had to stake your claim early. Breakfast was nothing special, cold cereal, OJ, coffee, cocoa, danishes. At least it was free. I thought the area was safe since it was off the Lombard main drag, but apparently, the hotel was held up the second night we were there. Otherwise, it was very quiet, and comfortable (if you get the right room), but the staff needs to communicate better. A major plus...free wireless internet!", "Date": "June 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marietta, GA", "Title": "“Good Value Lodging for San Francisco”", "Author": "clan4irish", "ReviewID": "UR14123843", "Content": "This Travelodge is located at the entrance to the Presidio, which used to be an Army Post and is now part of the US Park Service. It is very near to the Golden Gate Bridge and is convenient to the attractions in and around the Presidio and the 'Marina' area of San Francisco. The hotel itself looks to be a renovated motel, but it's located in an area off the busy portion of Lombard St. so it was fairly quiet. I spent 3 nights there and slept well each night. I would recommend the rooms toward the back of the complex. The room itself was nothing exceptional but everything was comfortable, clean and functional. The beds were very comfortable with attractive bedding, a microwave and refrigerator were provided and the room (#301) was a corner unit with windows on 3 sides. The bathroom was very small, similar to european B & B bathrooms with no tub just a shower, but everything was clean and in working order. The front desk staff were very friendly and helpful, the housekeeping staff did a good job. A very skimpy continental breakfast is offered at the front desk; juice, coffee and some breakfast rolls which you have to eat in your room or elsewhere. There is no breakfast room but there are many great places to have breakfast. The location offers many unique eateries nearby, and Chestnut St. has a wide selection of cafes, coffee shops, bakeries, restaurants with every kind of dining and grocery stores selling exceptional produce. There are many boutiques and shopping establishments as well. The area had only 2 franchise restaurants that I saw, an IHOP and a Johnny Rockets, everything else is a one of a kind. Parking is available but limited onsite and an overflow lot is around the corner. Street parking and public parking is expensive if you're not from a big city with similar rates. I paid about $100 a night for the room a double/double but found a $74 rate from the Roomsaver magazine. I would not hesitate to stay here again.", "Date": "March 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Honolulu", "Title": "“Perfect place to stay”", "Author": "emeraldhse", "ReviewID": "UR10927762", "Content": "This hotel was absolutely fabulous. The room was spotless, the king size bed was comfortable and the location was magnificent! It was in a very safe neighborhood and within walking distance of great restaurants and shopping, plus the bus stopped right down the street. Gary was a great help in securing our shuttle to the airport and helping us with places to eat. The hotel was very quiet as it was at the end of Lombard street. Great place to stay and the price was right.", "Date": "November 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "South Florida, Florida", "Title": "“Had a Great Time!”", "Author": "CA-FL-TX-FL", "ReviewID": "UR8505780", "Content": "Typical cramped motel room and overpriced ($109). But it was in reasonably good condition, the beds were comfortable, it was quiet at night (being two blocks from Highway 101), we had a fridge and microwave, and there was plenty of hot water. And the best part--the location! Chestnut, the \"main street\" of the Marina District, was just around the corner with plenty of cafes and shops and a real hometown atmosphere. Also, the Palace of the Fine Arts, and the waterfront were nearby, and you can take a public bus to Chinatown and Downtown.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Very Quiet and Convenient”", "Author": "Cauliflower81", "ReviewID": "UR8382845", "Content": "I needed a hotel near the Fort Mason Center, and I needed to get a good night's sleep for three nights. All the other hotels along Lombard St/101 are right on the highway and you can see from the reviews that people have had horrible experiences with noise. The Travelodge Presidio is farther down Lombard, after 101 curves away = quiet! It's right near all the beautiful green trees of the Presidio, and the shops and restaurants on Chestnut Street are a short walk away. My room was clean and the bed was comfortable. The bathroom could use some refurbishing, but again, everything was clean. I never heard a sound from the highway or other guests. The staff at the front was friendly and knowledgeable. I would highly recommend this hotel for anyone on a budget who wants something quiet!", "Date": "August 10, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Jamaica", "Title": "“Excellent Location - Great Front Desk Staff”", "Author": "CConsuela", "ReviewID": "UR7667526", "Content": "This hotel is in the perfect spot away from all the bustle of a big city. The bus stop is right around the corner by the historic Gates of the Presidio. The bus takes you straight into China Town, shopping at Union Square. Beautiful homes on the famous Pacific Heights is one block away with enough steps offering aerobic exercise for those so incline like myself. On the other side, the Palace of Fine Arts is 1.5 blocks away beckoning in all its serenity. Chrissy Fields is across the road from the Palace which is exercisers haven. You can a beautiful early mornign view of the Golden Gate bridge from here... San Francisco is utterly beautiful! Wish to revisit next year.", "Date": "May 21, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Cozy, Quiet + Clean Budget Hotel on the Presidio”", "Author": "orangetime", "ReviewID": "UR4128354", "Content": "We booked a single bed room here as a walk-in with a Traveler Coupon for $77 for 1 night, and the place was fine. Very clean and quiet, and about a block or two from the park. Swank French Bistro on corner along with a deli, and a pub just around same corner. Our L-shaped room was smallish, but very comfortable for a 1 bedroom. There were 2 windows facing the beautiful lush backyard, and the breeze coming thru them was great. I do remember seeing others' bathroom windows facing the balconies, as the previous reviewer had - so ask for one with windows to the back. Bonus was the fridge and microwave. Though there were a few other similar hotels lining these blocks (we didn't check on prices there), the neighborhood felt fairly residential, and thru the back windows you see some great architecture of the houses people live in around here.", "Date": "November 20, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Troy, Michigan", "Title": "“Excellent Hotel for Budget Travelers”", "Author": "CheapButSmart", "ReviewID": "UR3638301", "Content": "I'm giving this hotel a \"neutral\" rating but as a budget traveler my expectations were actually exceeded by my experience there. I was looking for a cheap place that wasn't in the noisy downtown area and that didn't have postage-stamp sized rooms - and I got it! If you're frugal and don't mind not having an elevator, a lobby, or fancy furniture I think you'll be very happy with this hotel. The downside: our room could have used better ventilation. There was no way to open the windows and get the air moving without sacrificing our privacy. The bathroom window desperately needed a curtain as it actually faced into the hallway/balcony. Since the bathroom had no fan(!) opening the window was the only way to keep the steam down while showering so I had to hang a t-shirt in front of the window. Kinda silly. The result was that the room was a bit muggy. Also, as I mentioned, there is no elevator in this kind of hotel so don't stay here if you have trouble carrying your luggage up a flight of stairs. This hotel also does not offer much of a view and as you might imagine -- the furniture, carpeting, etc is not exactly brand new. Also also, HBO is supposed to be included but we didn't seem to have it (But, so what? We didnâ€™t go to San Francisco to watch TV.) The upside: the price was shockingly low. This made it possible for me and my co-traveler to spend our money on more important things (like eating out and shopping). I booked the flight and hotel together through Orbitz rather than through the hotel itself so I would recommend doing that to get the best deal. Our room had 2 queen beds, a microwave, a refrigerator, dresser, vanity, and table -- and plenty of room for 2 people to move around. The location is EXCELLENT. A quiet part of Lombard right next to the Presidio. Very close to 2 bus lines as well as a nice French restaurant and a convenience store.", "Date": "July 5, 2005"}], "HotelInfo": {"Name": "San Francisco at The Presidio Travelodge", "HotelURL": "/ShowUserReviews-g60713-d81511-Reviews-San_Francisco_at_The_Presidio_Travelodge-San_Francisco_California.html", "Price": "$144 - $186*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2755 Lombard Street</span>, <span class=\"locality\"><span property=\"v:locality\">San Francisco</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94123</span></span> </span> </span> </address>", "HotelID": "81511", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0d/2f/0d2fb55ee91b38dd09e1ed1a0c84f4a25large.jpg"}}