{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Joliet, Illinois", "Title": "“Tips for staying!!!”", "Author": "penguinsonfire", "ReviewID": "UR127266233", "Content": "Honestly I think this hotel was WAY overpriced for the regular room rate. I paid a reduced rate for being part of a group but even that was pricey (109per) for what you get. Its just a regular room at a regular hotel. Nothing fancy. I would avoid the breakfast they offer. Its $15 per person and its basically eggs, bacon, and fruit. there is a place across the street (roseys diner or something like that) that has fantastic breakfast stuff for 1/2 the cost. Or there is a supdnuts doughnuts near by (much tastier). also keep in mind they charge you an extra $13 a day to park in their garage. Another tip is be wary of the bar. A member of the party ended up with a $1000 bar tab because he was ordering \"doubles\" at a cost of $25 each. A normal mixed drink was $12 (and described as a tiny glass). Best thing about the hotel was the outside pool / lounge area. The flaming fountain is a nice touch.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“NOISY NOISY NOISY”", "Author": "kjf666", "ReviewID": "UR127002079", "Content": "I am writing this review while a guest at this hotel. I was a guest here one week earlier and got no sleep because of a college group convention that was up at all hours of the night. Now I am here again after being assured at checkout that I would get a quieter room. Last night I heard LOUD band music at 11pm and called down and was told it was a restaurant across the street. They offered me a room change and told me there would only be music again on the upcoming Saturday night. And here I am at 11:49 pm with music blaring in my room from across the street. And it's only Friday....had I known this would be a nightly occurrence I would have switched rooms but now here I am again wide awake listening to some bad bad music. This is really not a place to stay if you want to sleep. It's an old hotel with nothing going for it except location - and with the music across the way that plus is even gone. I am in this area frequently but will not make this my home base when I am here. Old noisy hotel with bad towels. Leaky faucets and lousy tvs. No free wireless even in the lobby. Overpriced parking and Internet access. Not worth the $$$.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Business Hotel....Need Remodeling”", "Author": "RondaJS", "ReviewID": "UR126389119", "Content": "Average hotel that needs a major overhaul. Nothing exciting about the hotel: average staff, average room, average location. Stay here...only if you get an amazing room rate.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“If you need to be in Woodland Hills”", "Author": "thesnurgs", "ReviewID": "UR126234529", "Content": "The hotel is decent. Needs a bit of an upgrade which they are doing soon. Bar and restaurant seem OK. The outdoor pool area is very nice and could be fun in warm weather. The rooms are basic, nothing special but clean and what you would expect.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ridgecrest, CA", "Title": "“Most uncomfortable bed ever!”", "Author": "desertescapee", "ReviewID": "UR125290985", "Content": "My husband and I have traveled alot. We have stayed in numerous brands of hotels. I don't remember ever staying in a hotel, let alone a Marriott, with a more uncomfortable bed. Both of us were waking up every hour because the bed was so uncomfortable. Unfortunately we have 3 more nights of it, hopefully we will reach the point of exhaustion and be able to sleep. I am speechless as I thought all Marriots had \"comfort' \"pillowtop\" type beds, apparently not. Maybe it is only Hilton.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Duarte, CA", "Title": "“GREAT LOCATION AND PRICE”", "Author": "verda", "ReviewID": "UR125264057", "Content": "We arrived at about 2pm and checked into our room. The registration was very easy and quick as we had made reservations. There was a lot of movie equipment in front of the hotel and there was filming going on somewhere in the hotel, but the valet staff were directing traffic to keep it congestion free. We had a comfortable night and a delicious buffet breakfast the next day before checking out. There was a very good selection of breakfast hot foods, fresh fruit, cereals, juices and an omelet station with a lot of choices to make an omelet. All this including valet service for under $150/night.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Peoria, Arizona, United States", "Title": "“PRESIDENTS WEEKEND”", "Author": "Troy M", "ReviewID": "UR124984701", "Content": "Don't like to write bad reviews, but felt I had to...I was told a check in we could get a roll in bed since we brought the kids double beds are kinda small....Find out later (after we chose our room) thats against fire code...OK..I get it....Things happen..Thought with an extra blanket I would hit the floor and momma and the kids would be drama free..till 1am found that the heater was blowing cold air..only 62 degrees in the room..Seriously considered going to the parking garage and sleeping in the suv..the floor is concrete my beanie and jacket wasn't working and the blanket ( too short) only covered me in fetal position and my heat escaped when i rolled over from shoulder to shoulder the only thin sleeping....now back at home in az and all the kids have fevers..but they were sorry and offered us a continental breakfast....save your money..motels are on one floor..you park in front of your room..(not a huge parking garage that you pay a ton of fees and walk a mile to get to..) they are bigger and cleaner..and usually closer to the beach..not to mention half the price and all the service..Troy in az..Have a blessed day..", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Fine, not great.”", "Author": "DetroitBirdy", "ReviewID": "UR124932581", "Content": "Room smelled like smoke. Rooms weren't cleaned until after 4pm. The breakfast buffet was GREAT..made to order omelettes. The Starbucks in the lobby was terrific too. Baristas were friendly and accommodating.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Osos, California", "Title": "“Surprisingly good.”", "Author": "sayitok", "ReviewID": "UR124889688", "Content": "We were there for a presentation at their ballroom and spent the night before. The check-in was smooth, and the desk clerk offered us good advise about parking. The room was standard Marriott, that is to say, average size with a comfortable bed. Our room had a safe which was appreciated. The fitness area was above average with a good number of aerobic machines, and a weight area that had Precor machines. There is an indoor pool. An outside area with a \"fire feature\" looked inviting. The breakfast was standard buffet fare, but there was a made to order omelette bar. The food at the reception was, for a large catered event, very good.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "CSquaredC2", "Title": "“Great location, but not my first choice getaway unless I'm looking to completely disconnect.”", "Author": "CSquaredC2", "ReviewID": "UR123786513", "Content": "I have stayed at this hotel a few times on business, and again very recently. The good things: location seems to be excellent, with a mall right across the street, it makes getting around easy; there are a wide range of chain dining options, the staff is great and pleasant; and the workout and pool facility is a great plus. But overall, I have been disappointed when I stay here as it doesn't suit my needs and expectations. For my overnight experience, my rate was high - but I assume most comparable chain hotels are in the same ballpark. My biggest hangup was that because I was on a work trip, I needed access to the internet - I could not get the service to work on my laptop or iPad at all during my stay. Phone coverage was also poor to non-existent, although I would say I had some luck in my room, but for any place else on the property, getting access to a network was a bust. Attending a few meetings there, I could not get consistent coverage in the lobby, the conference rooms, or even outside in the pool area. Others in my meeting could also get no coverage through Verizon or AT&T. Once in a while, it seemed like you'd get a burst of access and you're email would download to the phone, or you'd get a text message, but when you went to reply or call someone, there would be no service. There was one sweet spot in the lobby where I was finally able to get access for about 30 minutes, but having had to be there for almost 24 hours, I was woefully behind in email and returning phone calls that I had to make up for it later the next evening. I can't say that the access issues is the hotel or the phone carrier, but it just seemed like there was a spell cast over the hotel to prevent access to the outside world. If you're looking to be productive and efficient, just know you may hit a couple of roadblocks and may need to make alternate plans. If you're looking to completely disconnect, then this may be a good option.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Excellent Stay”", "Author": "SuzM1004", "ReviewID": "UR123737391", "Content": "This hotel lives up to the Marriott standard. The room was nice, service was great and quite even though close to several busy roads/streets. The Bell staff was so helpful and polite. This hotel is centrally located and very close to several activities and restaurants within walking distance or a short drive. The only drawback was the parking deck is quite a walk if you do not choose to valet park your car.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Get the right deal & this place is a steal”", "Author": "Mcannie", "ReviewID": "UR123324370", "Content": "Great bell staff & lovely rooms at great prices at weekends make this a fantastic base for exploring LA, Malibu & the valley. Near a good selection of restaurants. Liked the update to the pool furniture, looks quite trendy now.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melrose, Massachusetts", "Title": "“Friendly staff, quiet and comfortable”", "Author": "masstravelerwithkids", "ReviewID": "UR123085659", "Content": "I purchased an advanced, non-refundable rate for $95 a night. Like most upscale hotels there is a charge for everything--wifi, parking, expensive buffet breakfast. This seems to be a disappointing trend. The room was clean and comfortable. The staff was extremely friendly, which really helped because I was in town to visit a sick friend.", "Date": "January 14, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Austin, TX", "Title": "“Great choice outside of L.A.”", "Author": "longtimeresident", "ReviewID": "UR122361826", "Content": "This hotel is located in a great neighborhood. It's across from an AMC theatre, restaurants and blocks from upscale homes, making a morning run a delight. Lobby is in the process of being updated, but was fine. It has a nice indoor pool and sauna. It's more of a business hotel, but because we were there over Christmas, there were many families. The service was good, the room was good and it's right off 101 so it's an easy shot into downtown L.A. A good choice for L.A.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Good stay but overpriced!!”", "Author": "a2wice", "ReviewID": "UR121780210", "Content": "I stayed at this Marriott for one night using my Rewards Points. I liked Marriotts in general. I consider them in the middle of the W and Hilton where they are not as good as the W but better than the Hilton. I gave it 4 stars for the purpose of its service, sleep quality, cleanliness, location and rooms (objectively). Overall this Marriott looks like a 5 star hotel from the outside and inside (lobby). The manager on duty was kind enough to offer a tour of the hotel at check-in. But the hotel is way overpriced for a Marriott. I wasn't travelling on a holiday, nor was I travelling during a peak season and when I searched for the hotel, it was around $260 per night. In addition, there is free parking. My one night stay costed me $30 in parking fee. In addition, the internet (wi-fi) was ridiculously expensive. I knew that California was expensive, but this Marriott made New York seem cheap (and that's a hard sell!). I definitely would stay here again simply because of the quality of stay - but not because I enjoy their pricing.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Lobby is nice. Rooms are outdated.”", "Author": "Jallenkistler", "ReviewID": "UR121683496", "Content": "Lobby is nice, rooms not so much. It's a business traveler hotel for sure. Gym equipment is ok. Good thing it's close to food, cause what's served here is bad.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland", "Title": "“Will stay again when visiting family nearby”", "Author": "TravelQueen221", "ReviewID": "UR120438136", "Content": "We have stayed at Warner Center Marriott many times over the years. Family lives in the area and this is the reason we stay here. I checked the reservation website several times and lowest rates ranged from $135-$245 per night (not sure why it constantly changed). The last time a four night stay came up for $104 per night if you pre-paid. Couldn't pass that up. We knew nothing came with that rate and didn't expect anything more than a basic room. The room was comfortable. However, the weather was cool for LA and for some reason the air conditioning seemed to be on in the hall making cold air come under the door into the room. We just used a towel to block cold air and that worked. Housekeeping was wonderful. I always tip daily and being in the hospitality business I know that this is the best way to get good service. Try it, it works. We ate in the restaurant once and it was good. Found Ruby's Diner across the street very affordable for breakfast and worth the short walk. Lots of great places to eat close by. I will say that when we ordered room service one night, it was very good. Fast service and food was great. We own a hotel & vacation rentals and you can not please everyone. I know how to read reviews. We had a very pleasant stay and the entire staff was always extremely nice and helpful.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Another Customer Service Issue at Warner Center Marriott”", "Author": "Michael D", "ReviewID": "UR120119830", "Content": "After a very long day of travel, I shared with the desk clerk that my priceline rate was to have included parking, internet, and breakfast with my rate. She barely took notice, dismissed this request, and told me that I had room only. When I asked that we contact priceline about the discrepancy, she stated that there was nothing she could do unless I could \"prove it\" and simply kept typing. It took a few moments to pull the info from my iphone, however, a few minutes later, I was able to pull up the priceline page with the inclusions. When I returned to the front desk, the representative stated that these were not communicated with them, and that they could only provide room and tax at this rate. The lady also shared with me that there had been another similiar recent problem with a priceline reservation at the hotel, but they couldn't help the other party either. I asked for the manager. After several moments, the front desk manager, Anthony Elsisi comes out. He tells me that my rate did not include any extras (room only). He said that in order to give me anything, he would require proof in writing. He was not willing to even look at the webpage, pulled up on my telephone, as he stated that I could have \"pulled that from anywhere\". I told him that this was the only method I had with which to \"prove it\". I even shared with him that I didn't really need internet (I have mobile) or free breakfast (I would likely sleep through it), but I wished he could at least cover the parking. Basically, I was asking for a $13 per night ($26 total) comp--something I would have thought fairly minimal. I shared with him that by this point, it was about principle, and I felt as though it was the very least that they could do based upon my reservation. Mr. Elsisi became irritated, then he responded to me that his time was very valuable and he would not speak further with me or help me with this issue. I have to say, this is not about $26. It is fully about being demeaned and berated, called a liar by the front desk manager, Mr. Anthony Elsisi. The funny thing was that the lady said I was not the first person with this issue, I reiterated to them that when multiple people complain about the same issue, they should probably take notice and do something about it. What I find now, after reading through the tripadvisor reviews, is that the real problem is not with priceline reservations, it is truly about a management staff who is not willing to properly care for its customers. Sad, but in this day and age, we have far too many choices to be stuck with such poor customer service. And when I see the managers response to the reviews, I see a bunch of excuses, but I have yet to see any offers of resolution--there's always a reason that they \"can't do anything about it\". Well, if that's how I handled my customer complaints, I wouldn't have many customers. I'll give you one more funny part. After I was incensed by the front desk staff, I searched and found street parking (being of principle, I was not going to pay them). For the next 2 days, I also refused to patronize the bar, gift shop, restaurant, store, or starbucks in the hotel. This would have cost them much more in profit than the $26 for parking. And when I checked out, you'll never guess, but they had placed the parking charge on my bill despite the fact that I clearly shared with them I would not be parking in the garage. Fortunately, someone there removed the charge. And, I did ask for a zero balance receipt just in the case that Mr. Elsisi needs me to \"prove it\". Properly handled, this issue may have cost the hotel $26 cash. Instead, because of the way staff handled this, it has cost Marriott a customer. Thanks for reading.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Not up to Marriott standard.”", "Author": "Heff17", "ReviewID": "UR120036595", "Content": "Stayed here for a wedding, so didn't choose it, and wouldn't stay here again. No refrigerator, no fan in the bathroom to take steam away, ripped shower curtain, dirty breakfast dishes were left in hallway all afternoon and evening (even though our room was cleaned after we saw the dishes at 3 pm). Paid extra for parking, WiFi and breakfasts - nothing is included in the price.", "Date": "November 1, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Santa Barbara", "Title": "“Don't stay here! The worst customer service ever.”", "Author": "mccarthy140", "ReviewID": "UR119598823", "Content": "Stayed here after a customer appreciation night, and I have never been so insulted by a hotel staff in my life. I will never, never, NEVER stay in this hotel again. And I don't plan on returning to my vendor's customer appreciation party next year if it is held at this hotel! The lobby bartender was rude and treated us like we were trouble makers when he was the one causing all the problems. (If you don't like working with people, you shouldn't be in the hotel industry.) Literally all we wanted to do was carry our drinks to our table and the bartender threw a fit. The management and security continued the condescending attitude, offering their fake apologies, but never really trying to remedy the situation...at least not until they realized we were with the group that just spent thousands of dollars at their hotel (and has every year for the like the past 5 years!)...oh, then the manager was soooo accommodating. Moral: As a guest you are unworthy, and subject to the RUDE BEHAVIOR of poorly trained, and hostile workers. Only when you are a big-spender do you deserve being treated like a guest at a hotel. Time to cancel my Marriott Rewards membership. As a side note, their accommodations were completely inadequate for the disabled. Our friends could not get a double room with a roll-in shower (even though that is what they reserved), SO THEIR HANDICAP DAUGHTER HAD TO SLEEP ON A COT. The wheel chair didn't fit in their handicap access room. But no alternative accommodation was offered or provided. Oh, but we did get one of those real nice apologies from the manager. If I would give this hotel a zero, I would. Honestly, and place would treat you better.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Simi Valley, California", "Title": "“Great night sleep, convenient location, recommended!”", "Author": "M3LODI3", "ReviewID": "UR118913950", "Content": "We stayed here for a \"stay-cation\" weekend. We didn't have much time to travel so we decided to stay local and have a date night. The WC Marriott is located in a great spot; walking or driving distance to many restaurants and entertainment. You could walk to the movie theater, PF Changs, or anything in the Promenade Mall. The hotel view was nice, the rooms were clean and quiet, and the bed was so comfortable! The food was reasonably priced for hotel fare ($11-16 on avg). There's a heated indoor pool & spa near the gym, and a sauna in the locker rooms. Self Parking was $14.30 w/ tax...and you can com/go as you please. I would rate this hotel between a deluxe to moderate category. I'd recommend this hotel to friends and family.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“Just a bad experience with Mgmt Staff”", "Author": "Samwise001", "ReviewID": "UR118901606", "Content": "Stayed 1 night back in April on a Sat night Good - rooms fine, standard typical Marriott. Bad - Parking fee. A bit away from central LA area Ugly - Noticed a $250 charge to my card a few days after checking out. Called desk and took a week to get a response that it was for a smoking fee. Said cleaner saw ashes on the balcony and the room smelled like smoke. I told them I don't smoke, had a child with me, and even my Marriott profile asks for \"non-smoking room.\" Email from Mgmt states they will provide one time exception and includes a page worth of notes about where to smoke on the property and their smoking policy. Why do I care and want to know that? How do you charge me for something without my knowledge, then not validate with me as a customer of the finding. I thought the situation was poorly handled and just from this incident alone, I wouldn't recommend it.", "Date": "October 3, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bay Area, Ca", "Title": "“Unmemorable -- but had a great sleep!”", "Author": "Eric H", "ReviewID": "UR118167659", "Content": "I stayed here because Marriott sold their Agoura Hills property to Sheraton and it was somewhat near Moorpark, my destination. There's not a huge amount of choices in this part of the valley. I was on an upper level floor. Lobby, hallway and room decor are unmemorable. The room / bed were clean and comfortable and I had a great rest. Service through the hotel was good. Checkin/out was very quick; valet was super fast for such a large hotel, room service took 20 minutes when they said it would be 40 minutes and the guys behind the bar were friendly. I was not wow'ed by the amenities and decor but I would stay here again for the service and the sleep.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Essex", "Title": "“Recommended;”", "Author": "WelltravelledEssex", "ReviewID": "UR117768682", "Content": "Stayed six nights with family part business/part holiday. This hotel dealt with complaint in very professional manner. Service in restaurant can be a little hit or miss but the food is the best I have had in Marriott. The Executive longue clear breakfast at one minute to nine NO exceptions. The Valet parking service is excellent. Indoor and Outdoor Pools are very good. Good location.", "Date": "September 6, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Average hotel, high prices, disappointing service.”", "Author": "crickettrainer", "ReviewID": "UR116529742", "Content": "My wife and I stayed here because it was the host hotel for a professional convention she was attending. I normally stay at Hilton properties for business travel, but I had enough Marriott Rewards points to burn up to stay here for free (other than the $19 per day for valet parking). I'm sorry that I made this call. First of all, I have a hard time believing the $200+ a night that this hotel charges. There's nothing to justify such a high price. The indoor pool was closed, as were the workout facilities. Although this was obviously a planned renovation, nothing was communicated to convention attendees. If I had known of the renovations, I would have stayed elsewhere. Secondly, the hotel provided a shuttle service to the convention at Cal State-Northridge, which was about 20 minutes away. They had a schedule printed and distributed to convention guests. This shuttle was horribly unreliable. Frequently, it did not show up at all, and when it did, it was either late (by as much as 90 minutes) and/or replaced by a nine-person van-not at all suitable for the 1,600 attendees of the conference. My wife and I were stranded for over an hour not once but twice. When I called the hotel to complain, the manager on duty apologized and promised to call me back. To his credit, he did call back, but it was twenty minutes later and after the shuttle had (finally) arrived. When I asked what compensation would be made to make up for the habitual tardiness, he said that the shuttle was being provided as a \"courtesy,\" but he would ask the GM to contact me. The GM never did. As a result, we ended up driving our rental car to the conference and paying for parking every day for the remainder of the conference. Third, when I asked for more towels one evening, I had an extremely grumpy man deliver them to my door. When I said, \"Thank you,\" he simply turned around and walked away. Even more frustrating was the fact that I could see the nearby Hilton hotel out of my window, almost mocking me for staying there. On a positive note, the valet parking service was the best I've seen in a long time. Also, one of the vendors held a reception in the patio area, and it was quite nice. My dad's college roommate at Notre Dame recently retired from Marriott where he was Vice-Chairman of the board. He always asks me why I stay at Hilton instead of Marriott...unfortunately, I have another story to tell him.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "California", "Title": "“Nice Location!”", "Author": "Annettencalif", "ReviewID": "UR116285726", "Content": "This hotel is older, but clean and kept stylish in the typical Marriott way. There is a Starbucks downstairs, conference centers, indoor and outdoor pool with a an outdoor bar and cabanas. It's next to the park which can get quite busy on weekends with events, but we were still able to find parking on the street to avoid paying the parking fees the hotel charges. Beds are comfortable. We took our dog this time, and he had space on the covered balcony for his small kennel and food. We stayed 3 nights, but opted not to get maid service because of the presence of the dog. It was easy to pick up the towels, etc. that we needed. The weekend there, the hotel had a \"costume college\" going on and guests were wearing period costumes they'd made throughout the hotel, that was an unexpected site. There are four elevators and we never had to wait too long for one even though on the 14th floor. I would stay again. The mall and PF Changs is directly across the street.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Clean & Comfortable with a convenient location”", "Author": "highjul", "ReviewID": "UR115970151", "Content": "I stayed here recently for business and I very much enjoyed my stay. The room was very clean, the bed/pillows were comfortable, had an updated TV (although had signal issues on some channels), and the location was great (right near many restaurants and stores). All of the staff were very friendly and helpful, including the staff at the Starbucks in the lobby. There's a bar/restaurant in the lobby and there's a computer to print boarding passes. I was impressed that I forgot to take my privacy card off of the door when I left for work, so the room didn't get cleaned. When I came back from dinner, the room had been cleaned (between 6:30-8:30pm). I, personally, have never had that happen! A few cons: It was quite a long drive from LAX (a $100 cab fare). The internet is expensive (12.95 for 24 hours), then if you want to print something, you have to pay another $6 to log onto the internet for 15 minutes in the business center. I was placed in a room that had adjoining doors on both sides. Had a bit of unwanted noise at all hours of the day...", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "detroit", "Title": "“We be back for sure!”", "Author": "biggy777", "ReviewID": "UR115461130", "Content": "Great hotel! The service and stay were great! Rooms were clean! Excellent choice if you are traveling to the Los Angeles area!", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Orange, California", "Title": "“Will definitely be back”", "Author": "insearchofyummy", "ReviewID": "UR114838456", "Content": "My son and I stayed here while my daughter attended a Pepperdine team camp. We loved the location and the service. Although there were a couple of glitches during our stay, the manager quickly resolved both of them and went out of his way to not only correct the problems, but made every effort to acknowledge them and take complete responsibility. I can't tell you how much I appreciated that. We will definitely return to the hotel. It was a great place to feel pampered, shop, eat and rest. Thank you!!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sanibel Island, Florida", "Title": "“Great Business Hotel With Good Prices On Weekends”", "Author": "Sanibelle1", "ReviewID": "UR112863560", "Content": "We recently stayed here for 5 nights to attend a wedding and got a great price of $99 per night. We thought the hotel was well situated for our needs but you have to remember that Woodland Hills is not downtown LA. Parking was $13 a night in an adjoining garage and ther is a nice mall across the street (try Ruby's for breakfast or lunch). There is a PF Chang's across the street and Kate Mantilini, a chic LA type fancy diner in the complex, as well as numerous other restaurants from fancy steakhouses to fast food and Chinese. There is a larger upscale mall also within walking distance. This Marriott has a nice little indoor pool and fitness center and an outside pool as well, with a small bar. There is a tiny sports bar inside and a dining room serving breakfast, lunch and dinner. There is a small business center that charges exorbitant prices to use their computers although you can print boarding passes for free. Wifi is available throughout the hotel and you will see many people sitting in the lobby using their computers. Maid service is very efficient and helpful, as is the entire hotel staff. The hotel was an excellent base for our five days here, which included visits to Simi Valley, Santa Monica, etc. You can get around the area very easy, usually avoiding the horrendous LA traffic. All in all, a great place to stay if you want to avoid LA congestion. Calabasas, only a couple of miles away, is a nice choice for a quaint town with good restaurants and shops.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Rapid City, South Dakota", "Title": "“12 ounces = 16 ounce price”", "Author": "msgtp", "ReviewID": "UR108011750", "Content": "Another example of the problems with this hotel. Tonight they opened the outside bar, but the beer that I bought came in a 12 ounce cup and they charged the same as the pint(16 oz.) that I was getting at the bar inside. No problem accept the inside bar was closed.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rapid City, South Dakota", "Title": "“Really not a good Marriott”", "Author": "msgtp", "ReviewID": "UR108004221", "Content": "Second stay at the Warner Center Marriott, and just can't find a lot good about the place. I'm a gold Rewards member but the folks here just don't really seem to care. I wasn't given a room on the club level this trip, the staff seems not genuinely interested in service - they play a good game of it but it seems like they are characters in a play, and not dedicated staff. The only good part of the trip is that it is based on corporate travel so I don't pay for it, but the hotel just doesn't quite make it. It is interesting that it seems to be a really nice hotel that seems to be 1.5 steps out of synch.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Modesto. CA", "Title": "“Beware of the parking!!”", "Author": "JeepModesto_CA", "ReviewID": "UR103828602", "Content": "Very nice Hotel, excellent staff extremely pleasant, rooms are new and clean, there is a coffee maker and fridge, look under the TV cabinet its in there....Internet is way over priced considering the cost of the initial out lay you would think they would include this fee in the booking. BEWARE PARKING I was only there 1 night and left in the morning running late I got to the toll gate and unbelievable they do not take Debit or Cards, the normal rate is $12.50 give or take a few cents, but with no ready cash its $25.60....the real joke is this and it's robbery, they will let you write a check for $25.60 but won't except one for $12.50!! where is the logic in that?? Its wrong on every level.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Above Avg Hotel, Great location”", "Author": "claybrizendine", "ReviewID": "UR98143372", "Content": "I switched to this hotel on a recent business trip as it was closer and better suited to the business I was doing while in LA than the other hotel I had stayed at. I found some great things here: 1) The location was not only close to the business that I was there to attend to, but there was also ample things to do in the area within 1 square mile - movies, restaurants, shopping, etc. Was very close to a lot. 2) My parking was comped at the end of my stay as a courtesy - which I certainly appreciated :) Self parking is in a parking garage close to the hotel and requires an outside walk, which for the most part isn't that bad since you're in LA...but when raining was a little hassle. 3) You could tell that the facilities and rooms had recently been redone - carpets were new, furniture looked newer (not brand new), and furnishings in the lobby looked new. 4) There was a Starbucks in the lobby...always a plus. 5) The fitness center was located within the same area as the pool, and to get to it was very odd. Overall, this was a pretty decent hotel and I would stay there on my next trip to the area.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Better than I thought, nice amenities”", "Author": "travelichigo", "ReviewID": "UR97427067", "Content": "Per other reviews, I was expecting a sub-par Marriott experience but it was actually as good as any other Marriott/JW Marriott experience that I had in my last 5+ years of Marriott gold member stays in both North America and Asia. Here are some updated info for visitors, I will not include Amy descriptions of rooms,etc as it has already been written in the reviews below. For gold and platinum members: Internet in room is free even though you have to click on the $12.95 charge. The receptionist will adjust your bill at the end. This is typical. Executive lounge is on 12th floor and can also be accessed on the 14th floor. Views are ok it's not spectacular. There isn't a 13th floor. Lounge is small and you have to pay for alcoholic drinks on an honor system. Veggie sticks, cheese, crackers, chicken wings, sodas, tea, coffee and bottled water is free. There is a computer with printer for your use. Buffet breakfast is available on the lobby floor in the weekends but you have to settle for the exec lounge on the weekdays. Exec lounge opens at 0630 and closes at 2200. No indications that you get free parking as exec member...but will update if I get comped upon checkout. For other guests: Parking is $12.95 per day. There is a parking structure behind the hotel and is easily accessible. From the lobby to your car, it will take you at least 5 minutes to walk there and you will have to climb stairs or use the elevator. There is a valet available for additional cost. You can probably park for free across the street at the mall, it's about a 5 min walk but you will need to cross a small intersection. Business lounge on the first floor charges $5.95 for 15mins of computer use. Xerox is $1 per page. There is a star bucks on the lobby floor and many restaurants within easy walking distance in the vicinity. There are also many mobile taco stands on Sherman way between winnetka and Tampa where you can get authentic Mexican tacos fr a $1 each. Sketchy at night but highly reccommended if you are taco deprived. Bathroom amenities include: mouthwash, bath and body works lotion shampoo and conditioner. Cotton swabs and cotton balls and soaps. Room has a small fridge, safe and digital 32\" tv. Tea, coffee maker and hair dryer in room. Room has a small ledge that you can walk out to and it's great to get fresh air. Room temp is adjustable, however 82 degrees felt more like 75 degrees. Hotel is very easily accessible to the 101 and about 40 minutes to little Tokyo going east. Going west, it's about 40 minutes to Oxnard. 2small free water bottle in room daily. Newspaper free in lobby (delivered to room for gold+ members). I would come again. Staff was friendly contrary to prior recommendations. I suspect that trip advisor users need to manage expectations prior to traveling.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Good Full Service Marriott”", "Author": "Swamilama", "ReviewID": "UR94098808", "Content": "This is the third time that I have now stayed here. The room is standard Marriott, good bed, flat screen, enough room, small balcony is a plus, lack of electrical receptacles a minus, and the bathrrom door opening onto the sink area is a bit annoying. Some Marriott's have in room frig, this one does not :( . Fitness area is one of the best I've seen - it is great with lots of new machines, indoor pool area, plus an outdoor pool (with bar in summer). Front desk staff has always been very friendly. When I travel to this area I used to stay at the Marriott in Sherman Oaks, but for the same cost this is a better value with many more amenities and close to a lot of good restaurants and shopping. If you stop for a drink at the bar, try the home made chips - they are great.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Excellent Value and Hotel in an OK location”", "Author": "kraigsf", "ReviewID": "UR91467432", "Content": "My partner and I stayed at this hotel for several days over the New Years Holiday along with our dog. The service was really great; the front desk check in was courteous and efficient. After checking in we maybe waited 2 minutes for a bellhop to take our luggage up; someone at the front desk immediately came over and apologized for the wait and promised to call someone for us. We were in our room with our luggage moments later. The room was well maintained with a comfortable bed and lovely comforter. I tend to be a light sleeper and appreciated the well sealed doors/windows; there was absolutely no street noise. There is a lovely city park half a block away, and many restaurants in walking distance as it's across the street from a mall. The only downside of this hotel is its location. If you're doing business or visiting people in the west San Fernando valley, it's great. If you are going to central Los Angeles, plan to be in a car for a long time. As google maps said: downtown los angeles is 35 minutes by car, or up to one hour and 45 with traffic.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Great Hotel!”", "Author": "Sweetgee2", "ReviewID": "UR90351440", "Content": "I stayed at the Marriot in Woodland Hills California for business. This was my 3rd visit and I really enjoyed my visit. I need to store away some diamonds since I was heading to an Award show and you can do this for free at the front desk. as soon as you arrive the door man are very attentive and friendly. The water they offer while you wait for your car is nice as well as the fresh fruit at the front desk. Rooms are very clean. Sheets, bathtub every thing is well taken care of considering the amount of people that use the rooms. The restaurant food is delicious. My collegue used the pool and it was very relaxing. I will return.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great business-class hotel in the SF Valley”", "Author": "4959keeton", "ReviewID": "UR89003412", "Content": "I had a business trip in the San Fernando Valley and found there were not that many choices in the immediate area - particularly among the Marriott brands. This is not prime tourst LA, so unless you have business or friends/family nearby, the location may not be that great. For the SF Valley, it's great and I had an easy (non-freeway) commute to my client. Every staff member I encountered (front desk, restaurant/bar, concierge) was friendly and accomodating. The room was fine and to typical Marriott standards. Another review mentioned the lack of power outlets, but mine had four outlets as part of the TV patch panel near the desk. The TV actually offered hi-def channels. Internet (wired and wireless) maintained pretty good speed. I had a couple of meals in the restaurant and found them to be very good and reasonably priced (by hotel standards, at least). There are plenty of other dining options nearby with some of the mid-upper class chains like P.F. Chang's and Roy's. There is a shopping center and movie theater directly across the street.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“A nice business class hotel”", "Author": "roadwarrior2010_10", "ReviewID": "UR85841834", "Content": "I travel down to the Warner Center quite often and when I do, this is where I stay. It's moderate in price, walking distance to the office, easy access to decent food (Flemmings and Roy's are both just down the road and PF Changs in across the street). Brought my wife and daughter last time to see her mother and the rooms were fairly cramped with the three of us. I would not advise staying at this hotel, or in the area if you are looking for a Southern California vacation spot. Unless for some reason you are centered on SFV. Also, I was unimpressed with the bar and food at the buffet, though the price was right. Starbucks in the lobby if you just need a quick coffee fix. Loved the valet guys. Always had my car in 3 minutes or less. Front desk was fast and pleasant. I'm looking forward to my next stay.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwalk, CT", "Title": "“couldn't have been better, even the parking wasn't too bad”", "Author": "Sheg", "ReviewID": "UR83542842", "Content": "A major priceline BARGAIN. Despite the size of this hotel and the number of events on the 16th floor we heard nothing. Very helpful front desk gave very good directions on how and where to park. Even gave advice on how to find free parking (although we used the self-park option in the connecting lot). Outdoor pool too cold but the indoor pool was terrific. Nice gym, towels and fruit. Beautiful view from the room with a standing room only balcony. Very nice room and very comfortable king bed. Very clean, great bath and body works products for the bathroom. Can't say enough. Would definitely stay again. Very convenient off the highway.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sacramento, California", "Title": "“Where's the Plug”", "Author": "CalCountryView", "ReviewID": "UR83075025", "Content": "The room is exactly the same as many others like it, adequate, nothing special, but this room distinguishes itself by its 1950's wiring. The room was fairly small, with an adequate desk and a computer modem, but no plugs available for a computer or to charge any portable devices. This is annoying and shows an insensitivity to a guest on busness. I have been in like rooms (actually exactly alike) where they were able to place plugs on the ugly red glass lamp on the desk as well as a multiple power strip on the desk, but not here.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Location is not so central, but the staff and food make it worth the stay!”", "Author": "Earthbound-Traveler", "ReviewID": "UR80292565", "Content": "Stayed here for 5 days on business. Good workout room with sauna. Indoor and outdoor pool. Pool bar, restaurant is great service and food! The staff has been very helpful. Just don't try and make a reservation at the front desk. For some reason it must be done over the phone or online. A VERY good deal can be found on priceline. All in all standard Marriott quality, you won't be disappointed!", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Suffolk", "Title": "“Fantastic Stay.”", "Author": "Duggs", "ReviewID": "UR78107556", "Content": "Loved, loved, loved this place. Firstly they were running a special deal involving \"book 4 nights get one night free\" basically. This was a rather up market establishment with the most attentative and helpfull staff I've ever encountered. That said, I though the young lads that jump on you as soon as you drive up to reception were a bit too keen. On most occasions I hadn't had time to switch the engine off by the time a figuare was at my door. ! HINT: Self Parking is a doddle by the way, just in a multi-storey next door. They DO charge for parking but hey...who doesn't in LA ? The rooms are extremely roomy and clean but if you like to sleep with the sliding doors open like we do for fresh air, pick your room carefully. Initially we were facing the front where we got hit by quite a bit of road noise. They helpfully moved us to the back but were then hit by \"air conditioner\" noises but not to the point where it disturbed our sleep. With the doors slid shut you couldn't hear a dicky bird...nothing where-ever you were situated. The pool area was great, especially at night, very relaxing. Woodland Hills, to us, appeared to be an extremely safe place to be, with a large park and Mall near by. Denny's is a short walk away also for a \"cheaper\" breakfast. My STRONGEST recommendation though, when travelling in towards Universal Studios, Hollywood and LA proper is DON'T use the freeways between 7am and 10am or say 3pm to 7pm. they are a nightmare. Ventura Blvd travels paralell to Ventura Freeway, just South of the Marriott and although it took about 45 mins to get to Universal, between several million stop lights, it was well worth it over getting stuck in traffic for hours on the freeway....plus ALL sorts of life is seen on the Blvd...makes for an interest drive ?? The ONLY negative as far as we were concerned is why a large Hotel chain, of this quality, have the gall to charge for Internet access. In fairness the \"Business Centre\" isn't actually run by the Marriott, they just supply the room for a 3rd party to set up and charge guests but for our familly we were extremely disappointed, not least that the 3rd party charge so much ie: 15 mins was about $5.00 PLUS the connection was often quite slow. They REALLY need to get this sorted. All in all though, a GREAT, entirely safe stay. Highly recommended.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“WILL NOT RECOMMEND-STAY AT ANY OTHER HOTEL NEARBY”", "Author": "john666-666", "ReviewID": "UR72747896", "Content": "We stayed at WARNER CENTER MARRIOTT WOODLAND HILLS inJuly 2010 as a FAMILY WITH CHILDREN. Despite asking FOR TWO INTERCONNECTING ROOMS ,We found that the RESERVATION STAFF right from THE BEGGINING were very PUSHY and we were given no option for our reservationwith no repect to our booking and needs AND We found that theRESERVATION PERSON,a lady with no PATIENCE AND VERY UNPROFESSIONAL , RUDE AND UN-COURTEOUS. Every time there was an excuse to trap us for extra payments like breakfast etc although our breakfast was covered in our stay The rooms were not cleaned properly and we found the swimming pool very filthy. Parking was expensive and internet was not covered even paying higher rates for the concierge level i will not recommend this hotel for family and we moved to the nearby Hilton Where we had a pleasant stay and found the staff to be excellent.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Johnson City, TN", "Title": "“Overall good, but restaurant service could be improved”", "Author": "RhiannonsMom", "ReviewID": "UR72652789", "Content": "I stayed here for a 3 day business trip. Everything was great except the service at the hotel's restaurant \"Breeze\" was lacking. There were only a few other customers in the dining room whenever I went, but the food took forever to come and one night we waited 30 minutes for dessert that never came. We all had meal vouchers from the company but we couldn't get a server's attention to sign for the meal or ask about the desserts that never came, so we left our signed meal vouchers on the table and went on our way. They did, however, track us all down late at night to make us sign. I thought that was kind of rude considering we were going to be there a few days and it really could've waited until morning. They did give a few of us a free ice cream a few days later when we asked about the desserts that never came. Everything else was great. They had the most comfortable hotel bed I've ever slept in, had 6 pillows and a down comforter. The exercise room was nice, and the location was very convenient to the Westfield mall and the metro bus stops. I made it out to Hollywood Blvd very easily by hopping the orange line bus and then the red line rail. Something else to consider, you have to pay for internet access, $12 per day I think. In this day and age, I cannot believe they don't provide free wifi, especially at a hotel that caters to business travelers. I'm glad I didn't bring my laptop, but several others in my group were disappointed. It was a nice stay overall, though.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Horrible experience”", "Author": "afmathieson", "ReviewID": "UR69986302", "Content": "On the first night of a three night stay was placed in a nice room on the 15th floor, however the room had adjoining room doors on both sides!! In one of the adjoining rooms a couple was performing extracurricular activities which I could hear clearly and even feel through the wall (absolutely no soundproofing). Eventually I went down to the front desk to get another room. The new room I was provided was approximately half the size of the one I was in with long multiple female (easily noticeable) hairs on one of the bedside tables; on the plus side, it did not have adjoining doors. Really very expensive for the quality. Staff does not seem all that helpful. This is why I prefer SPG properties over Marriott.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“No Complaints”", "Author": "AnnGHartfordCT", "ReviewID": "UR65335020", "Content": "I stayed at this hotel for one night on a business trip. Desk staff was pleasant, lobby very nice and room was clean and spacious. I ordered room service and the food was ready quickly and delicious. Went down to the gift shop for a magazine and was impressed with the variety of items.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Jose", "Title": "“Not friendly staff, pay extra for parking/internet”", "Author": "sjohnSanJose", "ReviewID": "UR56494136", "Content": "Be ready to pay for everything, other than your room rate. No continental breakfast, street parking or pay extra for parking. No free internet. Very rigid front desk staff. The only good thing was the swimming pools", "Date": "February 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“Wonderful hotel in L.A”", "Author": "mary96a", "ReviewID": "UR53618532", "Content": "Comfortable hotel, nice and clean. I stayed four days in the hotel and it was all decorated for Christmas, was very beautiful. It has many amenities like (pool, gym, starbucks etc). The rooms were large, very clean and nicely decorated. It is a good option for those who want to spend a good time in Los Angeles. It's great.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "California", "Title": "“Nice room, but nothing else spectacular”", "Author": "diznykd", "ReviewID": "UR47512476", "Content": "I was there for my 30th H.S. reunion. The food at the reunion was terrible. Everything else was boring, bland and inexpensive to serve. A lot of pasta, beans, rice, fajitas. That was it. They had a carving station with just turkey. I've never been to a restaurant, hotels included where they didn't serve at least roast beef, ham, pork or something other than turkey at a carving station, and quite honestly, the turkey was the only thing worth eating. All of the food in the serving containers was cold, they had only one dressing (Caesar) for the salad, not even oil and vinegar, and they started clearing the tables of all the candles only 2 hours into the reunion, which I thought was really rude, since it was only 9:30 p.m. at the time. I was really disappointed. I thought they would serve better food considering this was a large event with a lot of people. To top it all off, they overcharged my credit card $36.00, which I had to call my bank and deal with that issue. Our room was nice but VERY small. Hardly any room to move around in. Next time I stay in the valley, I'll definitely pick someplace else. I was reading the room service menu, and apparently it wasn't just the reunion. They hardly had anything to choose from for dinner. Literally, they had like 3 or 4 items. No steak, no prime rib, just salmon and pork chops. This isn't a poor part of town. They have the worse room service menu I've ever seen. Needless to say, I won't be back there ever again. Oh and for those of you that don't bring your own computer but need to get online, they charge you $12.00 for 15 min. Every hotel I've ever stayed in gives you access for free, whether in your room or in the lobby.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "daytona", "Title": "“Classy & Plush”", "Author": "daveDaytona", "ReviewID": "UR47154801", "Content": "Met here with friends from all over U.S. and Canada. We were treated like royals and well advised of local attractions by staff. Rooms very clean and comfortable...", "Date": "October 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "ssechrest230", "Title": "“Not impressed”", "Author": "suzzy230", "ReviewID": "UR34475809", "Content": "When I first checked in, they gave me the wrong room type. The staff could not communicate to each other in order to give me the correct room i booked. Once I got my room, it was quite nice. I wasn't happy with the staff and their style, and the Starbucks in the lobby has even worse staff working for them. Its worth it to drive a couple of blocks to go to the nearest Starbucks or Coffee Bean.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Great Hotel”", "Author": "Truebleu11", "ReviewID": "UR30227587", "Content": "It's located outside of LA, 20min drive. However, with LA traffic, it's more like 45min to an hour. The grounds are nice, plenty of open space, and definitely a pet friendly hotel. It's right across the street from Westfield Mall, a movie theater and some nice restaurants. Though I have to say PF Chang's twist on Chinese is definitely lacking. Ruth Chris is a better alternative. Dress is casual at both places. Right around the area of the hotel you can find mostly everything you will need. The gym and pools are nice. Smoking is not permitted in the room, but there is a smoking area by the pool. The balcony is very small, no room for a table or chairs, so there are none. If you are going to have breakfast inside the hotel, do the a la carte, cheaper than the buffet which doesn't really offer a lot. Parking is $13/day, but when you're in LA it's considered a bargain. It's a good getaway from the every day city life, but close enough to get all that you want and need.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Good in general - except for costly additional asides”", "Author": "gonago", "ReviewID": "UR28432734", "Content": "I stayed with my wife and child for 3 nights in early October 2008. Plusses: The room was good and quiet and the beds were comfortable. The food from the restaurant in the hotel was very good: CONGRATULATION to all the kitchen staff ! The room service people were prompt, courteous and friendly. Minusses: I was shocked to have to pay an additional $12.00 per day for parking. I mean, we flew all the way from New York and this was supposed to be car friendly LA after all, parking should come at no extra cost. My wife was justly annoyed that WIFI access in the room came with a $5.00 per day fee. She had to spend a good 20 minutes on her cell phone to get the WIFI charge in the room removed. This was a waste of time for us. Overall, we had a good stay... and as I mentioned above, the food was surprisingly good for a big chain hotel", "Date": "April 20, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Overall, a good Marriott”", "Author": "AThena53", "ReviewID": "UR24014318", "Content": "I stayed at the Marriott Warner Center for 3 nights on a business trip. Good points: attractive, generous-sized indoor pool, although the area with exercise machines was at one end, and all the people using the exercise machines faced the pool so they got to watch you! Weather was a bit too cold to use the outdoor pool, which was smaller. My room was comfortable and very clean, and was equipped with a refrigerator. I was on the top floor so I had a beautiful view of the mountains. Minuses: If you arrive at the Health Club before 7 AM sometimes itâ€™s hard to get a treadmill; they could use more machines. Room service menu was limited (no substantial vegetarian options, just the usual salads) and overpriced. Check out the Food Court at the Warner Center across the street. Itâ€™s not elegant but thereâ€™s a good variety of food types. The high-speed Internet was down one morning out of the 3 and I had to resort to dial-up. Do not use the phone for anything but local calls. You have to give them credit for transparency, but their posted rates for long-distance were awful. The phone had a speakerphone- handy for an early-AM teleconference I had to join. Overall, I liked the Marriott and would stay there again.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ocean Springs, Mississippi", "Title": "“Enjoyable stay”", "Author": "Jolly_Mon", "ReviewID": "UR10373536", "Content": "A recent business trip to the Woodland Hills area was the reason for this visit to the Marriott Hotel on Oxnard Street. In my opinion, this is a very nice hotel to choose in this area. My room was very clean. The hotel staff was professional and courteous as well. It has a very nice restaurant, bar, and swimming pool for the kids. The parking garage is just behind the hotel. If you are visiting the Woodland Hills area, the Marriott Hotel would be an excellent choice to stay at.", "Date": "October 27, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sutter, California", "Title": "“Hotel Near Getty”", "Author": "lavendergirl1962", "ReviewID": "UR6898554", "Content": "I booked this hotel for a room with a King bed because we were staying at Marriots on this trip to Los Angeles for our Marriots Rewards program, and this hotel was close to The Getty. It is about 15 miles away, but it may take longer than 15 minutes depending upon traffic. The rooms are small, but the beds are comfortable. The first room I asked for had cigarette butts and was dirty. They quickly changed us to another room; it was on the sixth I believe. It had been changed from a smoking to a nonsmoking floor when I opened the door it smelled horrible. My daughter was helping us check in since she lives in L.A., but she had to leave because the room smelt so bad. My husband was even bothered by the smell, and he never complains about hotel rooms. I was getting discouraged, but the front desk was really nice about it. Our third room was great! It was still small, but it was clean. The hotel has a nice modern lobby with a Starbucks, and the Mall across the street has several restaurants accessible from outside entrances. This mall had a nice Macys, which was great I did a little shopping at their sale. The Cheesecake Factory is suppose to be close by, but we did not go looking for it. The Getty was easy to access from this hotel, but we thought the 405 would be easier on a weekend, not so. Many of the guests seemed to be associated with events or businesses.", "Date": "March 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Springville, Utah", "Title": "“Smaller rooms, but overall good stay”", "Author": "shanloraine", "ReviewID": "UR6534112", "Content": "We stayed here on Dec 24th, then again Dec 27-30. (We stayed at the Woodland Hills Hilton on Dec 25th and 26th; see my review on Tripadvisor for it.) The hotel overall makes for a good place to stay. Location was decent, as it's located across the street from a small mall and movie theater. Parking costs about $12/day (I think). I thought their valet service was generally very good. Whenever we pulled up out front, someone in uniform was always there to get our doors and help us into the hotel if needed. The most negative thing about the hotel, in my opinion, is that the rooms are smaller than other hotels. I know that when we went to the Hilton for two nights, when we walked in the room there it was like, Wow, this is a much larger room. In reality, the Hilton's rooms might just be standard sized, but compared to the Marriott, the room seemed much more spacious. However, the Marriott does have a balcony (small, only room for standing), whereas the Hilton does not. Be sure to get a room without adjoining doors if you don't know the folks next to you. We found ourselves in that situation and had to change rooms the next day, because we could hear literally everything happening next door. We even could tell we were watching the same movie on television and knew the names of their kids. Once we switched rooms we had no sound problems at all. The best part of the Marriott, in my opinion, is their pool, hot tub, and exercise area. They have an outdoor pool (which no one used while we were there) and an indoor one. The indoor one is heated, and although I've stayed at many hotels where they SAY the pool is heated, this one really is. It was quite comortable. Steps lead down into about 3-foot depth, and it goes up to 5 feet. The hot tub was large and clean and very relaxing. I also really liked that they have a men's and women's locker room right there where you can change (there are lockers; provide your own lock), use the bathroom, even shower (there's one shower, large enough to be wheelchair accessible). And each locker room has a sauna. I would have liked to use the sauna with my husband, but I guess other people prefer it being for men only or women only. I like to exercise when on vacation, so I was pleased with the amount of equipment available. There were four or five treadmills, several bikes and elliptical trainers, plus free weights and some other weight equipment. They provide sanitary wipes so you can wipe down the equipment before you use it if you want. They also have a bowl of complimentary apples if you need a quick pick-me-up. Two complaints about the exercise area: 1) There are three TVs but only one of them seemed to work. And I could never get the remote control (when it could be found) to work. 2) The only mirrors are behind you when you're on any of the cardio machines. So when you're working out you're facing the pool (and the TVs). Overall we really enjoyed the stay. The bed is comfy and the shower was hot and water was plentiful. We only had a piece of cheesecake from the restaurant, but it was dang good (double chocolate). The restaurant seemed a little expensive (the cheesecake was $6.50). The room price was about $119-129/night, but I know you can get in on Priceline for closer to $55, depending on the time of year. I think it'd be worth it.", "Date": "January 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Slightly above average full-service Marriott”", "Author": "vandalby", "ReviewID": "UR6014983", "Content": "I was on a long term assignment in the North LA area and spent 31 nights at the Warner Center Marriott between August and October 2006. I usually gauge hotel stays based on full-service Marriotts, because they are very middle of the road for the business traveler. The Woodland Hills Marriott is just slightly better than average. The rooms match to Marriott standards exactly, right down to the wooden nightstands, the L-shaped desk and famous Marriott green desk chair. Most rooms will also have a comfortable easy chair and armoire with TV. All rooms meet the new Marriott bedding standard as well as down pillows and down comforter. It put it on par with your average Westin bed and I can say that I never had any problems sleeping and always found it comfortable. Bathrooms again are average with granite countertops and a single sink. I never had an oversized tubs - all appeared to be standard sized. For the most part all room amenities are up to date. There are larger rooms and suites on the 17th floor. May be worth asking for a 17th floor room when you check in. Room service at this Marriott was very good. Most orders were delivered within 30 minutes and they took good care to make sure that the order was filled out correctly. I did wish that the menu had a greater variety of appetizers, otherwise it's what you'd expect from a full service hotel - there should be something on there for everyone and they did have a small kids menu. The hotel does have a self-serve laundry facility onsite in the form of 2 washers and dryers - bring lots of quarters or you can get them from the front desk. They do have full laundry service that was, of course, priced high but within the range that you would expect from hotel laundry. As far as the staff goes, I only interacted with the bell, front desk and room service and they were all very friendly and competent. The lobby area of the hotel is nice and up to date including the bar. Most evenings it was full without being overcrowded or obnoxious. Despite all my nights there, I never did partake of the restaurant. One nice feature is the Starbucks in the lobby - it's a full service and is a popular stop for the business crowd on weekday mornings. There is an executive / concierge lounge on the 12th floor which can also be accessed from the 14th. This lounge was above average as Marriott's go. Good space and a good spread. Breakfast had the standard fruit, pastries / breads and cereal fare that you find at all lounges, but also had hot trays of eggs, bacon and sausages. In the evenings there was a hot appetizer early along with crackers and cheese as well as cookies later in the evening. Sodas are free and there was a stocked cash bar. Getting lounge access was pretty difficult and it was obvious that the front desk staff was trained to be pretty strong about limiting access. Even after my 4th week in a row I couldn't get in. Finally, I was checked in by the assistant manager one evening who helped me with the remainder of my stays until I hit Gold status in the Marriott Rewards program. Across the street is the mall (what else would you expect for the Valley?) There is an AMC movie theater and a couple of chain restaurants (P.F. Chang's and the type.) It's all within walking distance, so that's nice. So overall, an adequate Marriott for the business traveler. I had no major problems during my stays, but also never had them go the extra mile to do anything particularly special. In other words another middle-of-the-road Marriott from the chain that owns \"middle-of-the-road\". There is a Hilton right down the street that I had heard good things about too, so you might want to give that a look, otherwise those are going to be your two best choices in the area.", "Date": "October 26, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Luis Obispo, California", "Title": "“Marv!”", "Author": "unoudo", "ReviewID": "UR4741004", "Content": "After a long and weary traffic-laden drive, the staff was marv. I was very impressed and grateful. The minute we pulled up, the valet was there, our luggage was taken away, we were registered in a flash, and into our room within minutes of arrival. The bedding was excellent. We all appreciated the Bath and Bodyworks supplies. I was traveling with three teenage girls, the indoor pool was a major factor in my decision to stay at the Marriott WH. They loved it and were very impressed with the warmed towels. I appreciated the security measure of needing a room key to access the indoor pool and gym area. I would say one of the best deals for the price I have experienced.", "Date": "March 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice location”", "Author": "Susan K", "ReviewID": "UR4326735", "Content": "Just returned from a 3 night stay. Hotel was nice but the rooms were very small. Only 2 double beds for 4 people which I find surprising in nicer hotels today and we could not get a rollaway for my teenager due to fire code (even though they list this as an option on their website). But the beds were comfortable which was a nice surprise. Furnishings were a little dated but clean and in good condition. Pool was warm and excercise area was nice with good equipment. There is a Starbucks onsite and the onsited Hertz rental car was great for renting a car for a day or two to explore the area. Room service was prompt and cost reasonable. Desk clerks were a little snooty and not terribly friendly or helpful. Location was easy to find and there is a small mall across the street with several very nice restaurants, a movie theater, and a Macy's. Easy to walk to with the family for dinner and shopping. A Denny's is down the street for a good breakfast if you don't want to pay a fortune at the hotel. Overall I would stay here again.", "Date": "January 5, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Palo Alto, CA", "Title": "“Very nice stay at the Marriott Woodland Hills!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4068945", "Content": "We had a wonderful stay here - loved the lobby and the atmosphere - everyone was very friendly. Our room was very nice and comfortable. The lotion products they give are excellent - came back and bought some new ones right away. Location is excellent. I would definitely recommend this hotel.", "Date": "October 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "los angeles, ca", "Title": "“Good Hotel, Nice Area, Close to LA tourist sites”", "Author": "traveldudela", "ReviewID": "UR4049432", "Content": "Nice hotel in the LA suburb of Woodland Hills in the San Fernando Valley. Stayed 3 night here for my LA visit and the hotel was pleasant. Room was fairly nice and the bed was very comfortable! The hotel is about 20 minutes from Universal Studios, 25 from Hollywood and about 40 from Disneyland. Not too bad as far as location to the major tourist sites of the LA area. The immediate area around the hotel was upscale and several very nice restaurants nearby including Ruthâ€™s Chris steakhouse (great steaks!), Cheesecake factory (right next door) and a PF Changâ€™s . Overall, it was a nice hotel in a nice location. Yeah, I would recommend staying here.", "Date": "October 24, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Foster City, California", "Title": "“Clean, elegant and nice staff...”", "Author": "TeacherGirl80", "ReviewID": "UR3994661", "Content": "My family and I stayed at the Warner Center Marriott while we attended a wedding (that was not in the hotel) and the hotel was much more than we expected. It was clean, had very comfortable beds (with down comforters), our room had a nice view of the hills, and helpful staff. Everything looked new inside and the sleeping rooms were especially comfortable--we had a standard room-and it was still really nice. There is an in-house Starbucks good for a quick, light breakfast and there is also an on-site restaurant (didn't try the restaurant). There is a large movie theater across the street and a P.F. Chang's China Bistro as well. There is a so-called mall across the street as well with a Macy's but the mall is lifeless with dull stores. The Macy's was OK, it definitely isn't a bustling, shopping hub though. It was close to Burbank Airport and central to other tourist areas and freeway access. I would stay there again if I was in the area.", "Date": "October 5, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "North Logan, Utah", "Title": "“Pretty nice”", "Author": "JHawkes52", "ReviewID": "UR3888911", "Content": "This hotel was pretty reasonable. I felt that we got a little more than we paid for, which was nice. The only downfall was that our check in time was delayed by hours due to a hotel cleaning issue. I felt that the hotel owed us for that inconvenience, especially since we were tired and we'd been traveling all day. The water pressure was not all that great, but the facilities were clean and well taken care of. We went with valet parking because it was worth the extra $18 from what regular parking was. The staff was all very polite and helpful.", "Date": "September 9, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3732029", "Content": "Stayed here for one night halfway through a tour of California. We were at Universal Studios that day and this is only about a fifteen minute drive from there. We didnt stray from the hotel, but it seems like an OK area and there is a cinema and some restaurants across the road from the hotel. Had a deal that included parking, $25 petrol voucher and breakfast. The reception staff were helpful at check in. We had a king room which was comfortable and had everything we needed. The hotel had good facilities including a coin laundry which came in really handy, most of the other hotels we stayed in had expensive laundry services but no self service laundry. There is a starbucks in the lobby which I used and my husband ordered room service which he said was good quality and came quickly. It didnt seem too expensive either. A 20% service charge is added automatically and when he tried to tip the server, the server made him aware of this and tried to refuse the tip. I thought this was really honest. The breakfast choice was good although our server did seem to be more interested in chatting up the single guy at the next table. We had to rely on other staff to get drinks and had to hunt her out to sign the bill. No tip for her. Overall I thought this hotel met our needs and I would recommend it if you can get a good deal.", "Date": "August 2, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Needs a little work”", "Author": "A TripAdvisor Member", "ReviewID": "UR2878778", "Content": "This Marriott is about average as Marriotts go. Not new and not ready to be torn down. The rooms are standard issue and could use a good update. For the rates they charge everything should be marble and granite! The food was good and the staff was adequate.", "Date": "December 13, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Boston", "Title": "“Excellent Stay at the Warner Center Marriott”", "Author": "fenwayman", "ReviewID": "UR2444090", "Content": "Had a great stay at the Marriott Warner Center in Woodland Hills, CA. Spent three nights here. I found the staff fun, friendly, and helpful, and the fascilities were great too. The senior hotel staff, including the general manager, were very visible and actively greeting guests and making sure their stay was good: I've never seen them so present at a hotel before. The hotel is across the street from a mall with restaurants and a food court, and I was pleasantly surprised to see the restaurant food prices IN the hotel were reasonable. I cannot comment on parking since I did not have a car with me.", "Date": "August 12, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Mesa, Arizona", "Title": "“Great hotel, staff needs work”", "Author": "A TripAdvisor Member", "ReviewID": "UR2332809", "Content": "Had a great time at the hotel. Rooms were good as were all the facilities. Good location and easy to find. I had 2 issues that would prevent me from staying here again. The first the charge for parking which was $11 per day. The second was the front door valet and bell staff. I have never seen a more obnoxious, rude bunch of ----- in my life. They were constantly rushing me to leave the area, even while I was trying to load an elderly lady in my car. At one point, one of the fools was standing at my window telling me to hurry up and leave while a car in front was blocking me in with it's open door! Wise up Marriott and start delivering some service at the front door; your valet and bell staff are not making it. A disappointment to an otherwise great experience.", "Date": "July 29, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Atlanta, GA", "Title": "“Average...had to pay $12 to park”", "Author": "snackcakegirl", "ReviewID": "UR2186595", "Content": "The accomodations were nicely appointed and comfortable. The bed rocked. HOWEVER, we had to pay $11 plus tax for parking...and the general public pays $10 w/o tax. Not to sound like a total cheapskate, but when it is obvious that you are paying more to park than the general public and you are staying at the hotel...that is a little ludicrous. Finally, I am still amazed that if you pay to stay somewhere, they charge you for parking. They also were the first hotel I have been to that was seemingly upscale w/o a mini bar. When you just want one glass of wine, that would have been helpful. The toilet paper was also flush underneath the sink to the point I had to bend down on day two to finally find it. I thought for a full 24 hours there was no toilet paper and ended up using tissue paper...sorry, TMI. That was probably my fault for not getting on all fours...I have been to nicer Mariotts, but they are catering to the customer who is going to a trade show, not the person on a vacation so I can see why the little things are missed. All in all, a comfortable place to stay.", "Date": "June 13, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Media, PA", "Title": "“Marriott is top choice!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1840948", "Content": "Stayed here in July 2003 for three days, went to Loews Santa Monica Beach Resort for two days, and returned to the Marriott for the last day of our stay due to lousy service at Loews! The Marriott was clean, comfortable, beautiful, FABULOUS breakfast buffet(!) and friendly staff. Highly recommend it. Room at Loews was twice the price and had a connecting (locked) door to the room next to us. We heard EVERYTHING, including showering and loud conversation at 5 a.m.!! Management did not offer anything other than another room at same exorbitant price after losing two nights' sleep!! Went back to Marriott for last night, even though it was a big hassle to pack and move. Should have stayed for entire week at Marriott!!!", "Date": "April 27, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Wonderful Service, Great Staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR994566", "Content": "Stayed here for the week, everyone from the bellman, to the front desk staff, to the people in the restaurant were incredibly helpful and friendly. Anytime we needed something, they did not let us down", "Date": "May 12, 2003"}], "HotelInfo": {"Name": "Warner Center Marriott Woodland Hills", "HotelURL": "/ShowUserReviews-g32655-d82689-Reviews-Warner_Center_Marriott_Woodland_Hills-Los_Angeles_California.html", "Price": "$122 - $238*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">21850 Oxnard Street</span>, <span class=\"extended-address\">Woodland Hills</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91367</span></span> </span></span></address>", "HotelID": "82689", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/21/a2/7b/exterior.jpg"}}