{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great value hotel. Consistently good every time. Excellent for family trips to San Diego.”", "Author": "Toolmantym", "ReviewID": "UR121875462", "Content": "We have been staying at this hotel 2 or 3 times a year for the past 6 years, and every time it is great. Of course don't expect 5 star luxury, it is comfort suites after all. But the rooms are a good size, enough room for my family of 6. Always clean and well maintained. Good sized swimming pool and jacuzzi. Friendly staff, and a pretty good Free breakfast. Which Is a lifesaver with Teanage kids. Location wise, it's a little bit out of the way I your wanting downtown San Diego, or mission bay. But weighing up value / distance, it's well worth the trek. And the reality is, it's only 15-20 mins from downtown and maybe 30 mins from sea world. Overall a great value family stay. Highly recommended...", "Date": "December 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "LA", "Title": "“Not so great!”", "Author": "lovebug123", "ReviewID": "UR121256630", "Content": "After being in the travel business for a long time, I have had the opportunity to stay in MANY hotels. Everything from the Ritz to Motel 6. I know what people look for in a hotel. My family and I were looking for clearn, affordable and safe while we visited my dad in South San Diego. We knew we would not spend time at the hotel, so we decided to not spend too much money but wanted something clean and decent. This hotel had good customer service. The lady at the front desk was friendly and helpful. The bed was comfortable. The breakfast was decent. That is about the extent of the positive. Now for the real problems: Our kitchenette sink was clogged when we arrived. The room smelled bad. The furniture and carpet was dingy. The manager who came into my room to unclog the sink, left a 12 inch knife ( very sharp) right on the bathroom sink area that my two year old found and handed to me!!!! This was that straw that broke the camels back and mine! I was shocked. His reaction? \"oh. I forgot the knife\" oooops! Then, I called down for a roll a way bed since the couch was so smelly and dirty for my three year old and he said, \"sure no problem\". I only found out later that he would charge me for this without informing me of the price or the fact that there was a charge in the first place. His explanation? \" this is not a cheap motel maam\" Only cheap hotels don't charge for roll a way beds. What? made no sense to me at all. When I saw the knife, I should have just grabbed my family and ran for the hills. The location stinks too! You are surrounded by industrial toxins and huge trucks in line to cross the border. It is way out of the way from anything remotely interesting....( except for Mexico) if you you happen to have your passport with you. The only reason I gave this hotel any credit at all was their nice front desk lady and the comfy bed in the room. Other than that, this hotel is AWFUL!!!", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean and convenient, but thin walls!”", "Author": "Professional_Fan", "ReviewID": "UR109960115", "Content": "We stayed here because we were attending a show at the Cricket Wireless Amphitheater; none of my party drive and we needed a hotel close by. The room was large and clean but smelt old, like it hadn't been aired for years. The beds were very comfy though, and the smell definitely wasn't a reflection on the cleaniness of the room itself. The staff were really friendly, although the woman on the front desk gave us some embarrassing advice regarding a nearby restaurant: she told us it was too far to walk with our luggage (four 'long' blocks) and called us a cab; turns out it was literally around the corner and resulted in a very annoyed cab driver (who'd taken the job after his colleague didn't bother showing up at all) and us over-tipping in embarrassment. The only other complaint we had was that the walls in our room were extremely thin. We could hear people snoring in the next suite along! But overall it was great value for the price (approx. $95) and perfect for attending the concert (about 10 miles in a cab).", "Date": "May 26, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Diego, CA", "Title": "“Exceptional Customer Service: Every Time”", "Author": "DrFrisbie", "ReviewID": "UR84421910", "Content": "If you want a warm welcome after a long day of traveling, arrive at this Comfort Suites, near the border of Mexico in San Diego's South County. We return to this hotel on a regular basis. Suites are clean and comfortable, breakfast is an expanded (deluxe) continental. The property has a fitness center and outdoor pool, and a computer with internet access in the lobby. Free wireless internet is available throughout the hotel and works well. We return here for one primary reason: Exceptional customer service! We've stayed here dozens of times, sometimes arriving on short notice or no notice at all. Without exception all of our stays here have been pleasant and encouraging. The staff really goes out of their way to be welcoming and positive. We love staying here! Many thanks to the management and staff of this clean, beautiful property. As we say each time we check out here, \"We'll be back!\"", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "mesa", "Title": "“a good place to stay in south bay of san diego”", "Author": "jackcheese", "ReviewID": "UR73962508", "Content": "My family stayed here for a couple of days last weekend. They have excellent hot breakfast every day with a lot of choice, clean room with extra space, good service and nice staff. The location is right on the border and kind of away from downtown. IHOP, Subway and McDonald are near by.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "chicago,il", "Title": "“Great Hotel for the value”", "Author": "argonauts52", "ReviewID": "UR65327858", "Content": "Hotel was $60 for the night as we were going to Mexico the next day. Hotel is right next to the border. Rooms were very big and clean. Great staff. The location is kind of lousy because there is not much around in terms of restaurants or things to do. Not really the hotel's fault, but something to keep in mind. Great place for the price to spend the night if you were going to Mexico for a day.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Fukuyama, Japan", "Title": "“gem on the border”", "Author": "ord1454", "ReviewID": "UR59718354", "Content": "the location is not that great, very southern part of san diego. everything in this area shuts down after 6pm. very very quiet. hwy 905 is close, but that was the only noise. hot tub was just right", "Date": "March 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good Value Hotel”", "Author": "SNAFU23", "ReviewID": "UR43201771", "Content": "I recently had business near the border and stay at this hotel. The hotel was a great value for the price, and I would stay here again. The hotel is located in an industrial area, so there is not really anything to do within walking distance. There is an AM/PM service station, and I think a restaurant, but that's pretty much it. The Hotel is very clean and the service is excellent. They have a pool and jacuzzi, which looked very clean. The rooms are large, clean, and nicely decorated. The room also has a separate seating area and a desk. They each have a refrigerator and microwave, but not safe, which would have been nice. The free breakfest was nice, with a decent variety of breakfast foods to choose from. The eating area does get a little crowded but you can always take the food to your room. If I was in the area for business, I would definately stay here again. WARNING - The exit is the last before crossing into the Mexico, pay attention to the exit signs.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“wonderful hotel experience”", "Author": "tomcat33333", "ReviewID": "UR19946962", "Content": "This is a terrific hotel with value prices. Because it is located a stone's throw from the Mexican border -- away from beaches and tourist areas -- it fights hard to win your business. It does so with -- Attentive staff, particulary Juan at the front desk; -- Very clean, comfortable rooms with comfortable beds; -- A breakfast that includes fruit, hot waffles, a hot meat or egg dish, cereal and pastry -- Very nice pool and spa area, with the most effective spa we've ever been in. We paid $83 a night over Labor Day. if you know San Diego, you know you are not going to get that kind of rate on a decent property in an area closer to downtown during a holiday weekend. The drive was well worth it, because we could get to Coronado Beach within 25 minutes or so. The hotel is located in an industrial area which includes a couple of small malls. There's at least one local Italian restaurant located nearby, but it's not exactly gourmet, so you'll probably plan on eating a bit farther away. Negatives? the breakfast room is much too small to handle a full house. Other than that, we think it's great. We're going back in a couple of weeks, and we'll pay $11 a night less for the same quality.", "Date": "September 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Imperial Beach", "Title": "“Great Hotel”", "Author": "Macawluver", "ReviewID": "UR17872690", "Content": "We enjoyed our stay very much. The price was reasonable. The beds are super comfortable and the room was very clean. The breakfast was delicious as well, especially the waffles. The only drawback is that the hotel is located in an industrial area without very many restaurants. Also, it is a pretty good distance from many of the San Diego attractions. We would definitely stay here again though.", "Date": "July 14, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Worked well for us”", "Author": "melement", "ReviewID": "UR16422798", "Content": "My husband and I stayed at This hotel for our weekend trip to San Diego from Vegas. We booked this hotel for the price, we payed 70 a night. I was pretty pleased with it. The drive is kinda far to downtown SD about thirty min, but if you are staying in SD all day its not that big of a deal. The rooms are clean and the beds are comfy we also thought the employees were nice. Downsides, the walls are paper thin. And there is not a lot of dinning options in the area, and the continental breakfast is pretty packed and nothing special. We would definitely stay here again.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Comfort Suites trully is Comfort!”", "Author": "darkcardcaptor", "ReviewID": "UR16410705", "Content": "I stayed at the Comfort Suites because of their low rates, but was astounded when I arrived. The rooms are bigger than average and they are clean. We originally stayed on the 1st floor but asked to be moved to 2nd floor. Yes the location is far from Sea World and other attractions but you cant beat the price and the excellence of the hotel. They have a huge breakfast that has a Waflle bar and various juices and milks. Also the hotel staff is so very, very accomodating. We had so many difficult requests and they were able to grant them all. We needed directions to places and so forth. On our 1st night there we arrived into town, and the front desk agent, Phelipe was there. He checked us in and looked up restaurants that had live entertainment and even called the restaurant and made reservations. He told us how to get to Ensenada for some Whale watching. Amazing service. Housekeepers and all. I would reccomend this place to everyone. The only drawback is that there is no security on weekends....", "Date": "May 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Mountain View, CA", "Title": "“Right on the border”", "Author": "dcree", "ReviewID": "UR8496576", "Content": "I booked this reservation for my husband and son, because my son had a baseball tournament in the San Diego area. My husband said that he was not exagerating when he said you could throw something out the window and it would land in Mexico. Not that this was an issue, however my husband complained that there was not much like restaurants, etc. near the hotel and it took a minimum of a half hour to get to anything. The continental breakfast was descent. They had trouble with housekeeping. One day they had to call and ask for someone to clean their room. Another day they had to call for towels. They staff at the front desk was unresponsive, especially when my 17 year old son was trying to get help. Though they had some of the best rates in the San Diego area, I don't think I would book rooms there again. The location seems to be far from every place my husband and son wanted to be and the service was not that great.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Vancouver, WA", "Title": "“Finally a place to rest”", "Author": "Nilo14", "ReviewID": "UR7417034", "Content": "Nice an clean hotel with a great value. The 30 minutes to San Diego or the beach didn t matter to us,since the place was quite and we had a great sleep there. The night we went to Imperial Beach and a had a great diner. For travelling to Mexico, this is a bargain and a great value. We travel a lot and have miserable experience with Motel 8, and finaly found a chain which offers great and comforable service.Try this one out, even you visit Seaworl or other places. The 30 minutes drive to all attractions are nothing, compared to the rest you and the children will get there.", "Date": "April 23, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "SoCal", "Title": "“Decent, nothing exceptional”", "Author": "Viajero77", "ReviewID": "UR5814392", "Content": "The price is lower at this location because it is in an industrial area next to the border. Lots of tractor trailers hanging out nearby. The rooms are decent size for a normal hotel. But they are a little deceiving as this location calls itself Comfort SUITES. The rooms are generally clean. The rooms seem to be only slightly larger than a standard room elsewhere. *** One important caution: They advertise free Internet in the rooms, but the service is very poor! It is slower than dial-up and most of the time the pages will nto even load. When we complained about this, they acknowledged it was a problem. As they are not in a cable service area, they rely on satellite for Internet, and it is not reliable at all. If you are into the heavy, fattening breakfasts, theirs is ample. But they close it very early so dont be late!!! Also, be prepared to hear the cleaning crew making enough noise to wake up the devil, at around 7am! In conclusion, the place is a very decent value if you happen to be needing a place in the industrial zone by the border and dont need Internet!", "Date": "September 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Mississauga, Canada", "Title": "“if you don't mind driving!!!”", "Author": "travellover72", "ReviewID": "UR5580171", "Content": "The property is nice and clean. Rooms are nice and spacious. Microwave and Refridgerator were nice to have - due to lack of open food choices. Although I would only recommend for short stays, as everything in the area closes early. Hard to find anything that is open late for dinner or fast food, even the Mcdonalds that is 2mins away closes by 11pm. I did have good sense of security considering that it is in a dark industrial area. Hotel is well lit at nite. If you are planning to see San Diego alot this is not the hotel for you. Drive to downtown is 30-40 min. Spend the extra money on city hotel as you will end up spending more money on gas anyway. If you are planning Mexico visits this is the perfect location.", "Date": "August 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Really great little hotel - excellent value!”", "Author": "LA_Larry2", "ReviewID": "UR5039419", "Content": "This is a great little hotel! Really GREAT value - clean, comfortable and quiet and great deluxe continental breakfast. Particularly good if you want a nice comfortable place to stay overnight on your way to Tijuana (TJ) or places further South. It's about a 10 minute walk to the Otay Mesa border crossing, which is so much lower stress and quicker than the much more heavily used San Ysidro crossing. We checked out in the morning, left our car in the parking lot (which management was happy to let us do), walked across the border, and grabbed a cab to where we needed to go in TJ. Coming back to the U.S. later that day, it was a very quick walk through inspection at the border, nothing like San Ysidro. I do agree with prior review that it is a little far out from the main part of San Diego, so you would probably be disappointed if you really want to stay right in the heart of San Diego, but I like this hotel so much that I would consider staying here even if my primary destination were San Diego instead of TJ.", "Date": "May 7, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Too far”", "Author": "Stella", "ReviewID": "UR4559364", "Content": "Nothing wrong with the hotel except for one important thing - location. Unless your destination is Mexico, I will not recommend this hotel for touring San Diego. You do get a nice view of the bordering Mexico, especially at night, but going to the central touristy spots in San Diego is a good 20 minute drive, that is if you are not stuck in the border crossing traffic. Basically the hotel is located one exit from the border. There's nothing much surrounding it except for 1 IHOP, some gas stations, 1 MacDonald, 1 Jack in the Box. It's about 8 miles from the nearest highway. The room is a basic suite, with a queen bed and a separate sitting area. The bed is one of the hardest I have slept on, but it is clean. There is a mini fridge and a microwave. Breakfast is complimentary and is similar to other chains like Residence Inn. They had make it yourself pancakes, biscuits and sausage gravy, bagels, cereal, etc. There is a reason why the rate is so cheap...", "Date": "February 27, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Camino, California", "Title": "“What a value!”", "Author": "Loveourcountry", "ReviewID": "UR3740195", "Content": "We made these reservations for just one night to rest after our 12 hour drive (traffic) from nor. cal. on our way in to Mexico. I warned the family... it's dirt cheap so it could be a dump but we'll save money to afford the resorts in Baja. As it turns out asside from the fact that we had no ocean view this stay was more enjoyable than any of the 3 places we stayed in Baja for twice as much money. We were concerned as it's just 3 minutes from the border and a very industrial setting-area. But the staff was pleasant & helpful. The room was a suite for $69 a night. The swimming pool was treated with Bromine not chlorine so your eyes don't burn, the hot tub was fantastic. We met tons of people who were coming and going from Mexico~great socialization. The rooms were clean and air conditioned. There were tons of casual places to eat around there. and mex. insurance is available in the plaza next door. At check out I was informed of the all you can eat complimentary breakfast buffet. I already thought we'de gotten great value and service, you could even make your own fresh hot Belgium Waffles there! Where we live in Northern Calif. it's $85 for a dump, we were pleased!", "Date": "August 5, 2005"}], "HotelInfo": {"Name": "Comfort Suites Otay Mesa", "HotelURL": "/ShowUserReviews-g60750-d83322-Reviews-Comfort_Suites_Otay_Mesa-San_Diego_California.html", "Price": "$80 - $123*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2351 Otay Center Ct.</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92154-7614</span></span> </span> </span> </address>", "HotelID": "83322", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c5/58/c55856ee0ce133c766b15d086dd7c8dd4large.jpg"}}