{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lima", "Title": "“Nothing to complain”", "Author": "vecareca", "ReviewID": "UR125312140", "Content": "The hotel was ok. The personal is nice. The pool is clean. Rooms kind of old and messy but still ok. The internet is very good", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saint Augustine, Florida", "Title": "“Cozy little place”", "Author": "Eliza5858", "ReviewID": "UR124941218", "Content": "Concierge was very helpful and friendly. Location was excellent for the Coconut Grove Arts Festival. Hotel was only 10 minutes from the airport and 15 minutes from the beach. Coral Gables is a beautiful little city and we were walking distance from the downtown commercial area. There was also a trolley available (for free) right in front of the hotel which we took to the downtown area of the city and all over Ponce de Leon which was the main boulevard off the hotel. Overall...a cozy little place.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“New Years Eve 2011”", "Author": "ronald j", "ReviewID": "UR122514012", "Content": "The hotel is actually in Coral Gables but still close enough to Coconut Grove and downtown Miami Bayfront & Bayside Park! With that said, the traveling experience was made easier for our celebrations and it was everything we hoped for....a great new years 2012! What we did not hope for was to have our reservation go from a king size bedroom to a double bedroom! It allowed us to bring our maltese but were limited to the bottom floor and double beds in every room! Don't misunderstand that it's great that the hotel is pet friendly, but I should have been told I'm paying for a king but getting a double! Happy New Year!!", "Date": "January 4, 2012"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Statesville, North Carolina", "Title": "“hotel chateaubleau”", "Author": "mom2kats", "ReviewID": "UR118181865", "Content": "This hotel is dog friendly. We stayed there during the X-factor tryouts in Miami. We thought that the regestration and the tryouts were going to be at least 8 hours and did not want to leave the dog alone in the room for so long so we boarded him at a vet in the area. The last day we were there we got the dog out early. When we checked out and told him the dog was at a vets for 2 days, and showed him the receipt, he took off 2 days of dog charges. The place was clean, and the staff friendly. The resturant in the hotel was too expensive for us. We read online some bad reviews on this place, however we did not find this to be true. Maybe the writers were having a bad day. As for the X-factor...my old man is a great singer and they blew him off.....i bet they will show bad singers who got through just to get laughs...if you know what I mean!!!!!", "Date": "September 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "DC", "Title": "“Worse than any hostel I have stayed at”", "Author": "KStreetQB", "ReviewID": "UR91641061", "Content": "My room smelled like an armpit, there were springs poking through the matress, the AC unit was off when I arrived, the room was about 80 degrees, and the unit is not powerful enough to cool it down, it isn't close to anything, the wall paper is peeling off of the walls. It's maybe the second worst place I've ever stayed at and I'm a budget traveller.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Pedro Sula, Honduras", "Title": "“ON FILTHY AZZ HOTEL”", "Author": "SFC THOM ABN U", "ReviewID": "UR81919232", "Content": "I stayed there back in 2007. Hope I Never See That Place Again. Rude People, Filthy Room, the Best I can Say about the Hotel is: \"The Beer Was Cold\" But, so were the Waiters and Waitress' and the Majority of the employees working there. BAD NEW JOINT. I have one other thing I would like to tell You future Customers, but I don't want to GROSS YOU OUT and Perhaps You Would Not Believe Me.. SARGE, US Army Airborne, Retired, San Pedro Sula, Honduras", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“For the price, a good place to stay that is near downtown”", "Author": "zbmw008", "ReviewID": "UR60091172", "Content": "A few friends and I traveled to Miami to attend Ultrafest music festival. We needed to find a place to stay just for a night. Most hotels located downtown Miami were more than $400 per night. This hotel provided a good bargain for the services offered. Our room was spacious, clean and had a great balcony overlooking Ponce de Leon Blvd. Some of the furniture was slightly outdated, but overall the staff was very accommodating and if I needed a place to stay near Miami again I would go back.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Washington, DC", "Title": "“Friendly Staff - That's It for Nice Things We Can Say...”", "Author": "unclejohann", "ReviewID": "UR52409535", "Content": "Airline referred us here for a missed connection. Staff is friendlly but hotel is threadbare and doesn't appear to have been updated in a decade or more. First room we've checked for bugs ever. Really can't recommend it.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Santiago", "Title": "“No manners with guests”", "Author": "Cindy-Rox", "ReviewID": "UR16009399", "Content": "Roomy but old, not well maintained. Problem with this deal they have with Carnival Cruises, crew members hanging around at all times and everywhere, using the computer and all the lobby sofas. Used to be an old and friendly hotel but not anymore. Do not recommend it, not even to my worst enemy.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London U.K.", "Title": "“You get what you pay for”", "Author": "thekiwikid", "ReviewID": "UR14206968", "Content": "This is not Best Western anymore. It is a basic Motel with pool. Rooms roomy but a little shabby Make sure you specify non smoking if necessary. No parking probs., despite Car Rental Firm in block. Rooms are large and basic. Cleaning slow but adequate. Location is great for Coral Gables. Front desk variable but just OK. Food basic. You just about get what you pay for but the main problem is they have a deal with Carnival Shipping re accomodation for Crew; this involves a lot of people standing/sittting in Lobby and late night lift noises and slow access to computor. Not for the romantic or fussy", "Date": "March 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Mold & Mildew odors, dirty carpet, lack of service & care of personal safety”", "Author": "tickled1", "ReviewID": "UR13546797", "Content": "Hotel failed to provide transportation, loittering outside at hotel entrance late at night. Mold & Mildew odor so bad had to place sheet over face. Slippers destroyed by dirty carpet.", "Date": "February 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Charleston, SC", "Title": "“abandoned”", "Author": "rodneyfaile", "ReviewID": "UR10915471", "Content": "The ad for this hotel says thay provide shuttle transportation to AND FROM the cruise port. They had no problem taking us to meet our ship, but when we returned the refused to pick us up and we had to take a cab back to the hotel to get or car.", "Date": "November 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "United States", "Title": "“Not great”", "Author": "smithwilde", "ReviewID": "UR7281477", "Content": "Some good and some not so good. The room was very large, but in poor condition. The whole place could use a rennovation. The bedding is old, so I slept in my sleep sack that I bring...the room didn't have a clean feel. Housekeeping was very honest. They didn't even pick up the tip I left for them the first day. The whole room needed to be gutted and rebuilt. The restaurant is marginal. The breakfasts were pretty lousy but the dinners were ok. It was easy to get a taxi and the area seemed very safe. It was convenient. I won't be staying there again.", "Date": "April 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Detroit Michigan", "Title": "“Avoid at All Costs”", "Author": "unkin", "ReviewID": "UR6833431", "Content": "We arrived late on a Thursday/Friday am (after midnight). We had a room on the second floor facing a residential area. Parking was hard as there is a rental car agency on the premises. We had to park on a side street. We were out of the hotel on Friday. When we returned Friday evening (around 6-8 pm), we immediately were aware that the room had not been serviced/cleaned. The beds were not made, and the used wet towels were on the floor. We went down to the front desk, and informed the clerk. He said, \"Do you want some coffee\"? No, we wanted the room serviced. We asked for towels, and he brought 4 bath towels - that is all, no bath mat, washcloths, or hand towels. We were out of the hotel on Saturday, and when we returned late Saturday, the room had been serviced. Sunday, the room was not serviced again, and we went once again to the front desk. After visiting the front desk several times, and leaving multiple messages for the general manager, AND having to put up with a housekeeping supervisor tell us \"we had other rooms to clean, we cannot worry about your room\", and her hanging up on me, the maid finally came to clean the room at 4 in the afternoon!! Sunday evening, the phone began to ring approximately every 30-40 minutes; it was like a constant wake up call. After having the phones acting like this, we finally went again to the front desk at 4:30 in the morning, informed the desk clerk, who then said \"just unplug the phone.\" No member of management ever contacted us, despite provided multiple messages for the manager as we needed to address our concerns. We also provided our cell phone number when we checked out and asked again repeatedly to be contacted. We filed a formal complaint with the hotel chain and were informed that the manager informed the corporate office that we were the ones rude to their staff, not the other way around. The corporate office indicates that the management was not willing/able to provide any type of compensation for the unpleasant stay with the rude staff. We advise everyone reading this to not, under any circumstances, plan a hotel stay at the Best Western in Coral Gables Florida. You will be throwing your money out of the window and into the hands of the management. Even if you have to drive a long distance, find another hotel chain as this one will not address your concerns, and the management does not care. A word to the wise: Read the description on the hotel's website, but be very very very careful on the wording - read between the lines. Beware on staying there, (unless of course, you have money to burn and a penchant for a terrible hotel visit), and are willing to put up with rude staff who are unwilling to assist and a management team who is always \"unavailable\" to address your concerns (except when contacted by the corporate office - then they are willing to make up stories to the corporate headquarters to make the hotel management look good)/", "Date": "February 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Fine for the Price and our Purposes”", "Author": "JustOneBoomer", "ReviewID": "UR5968246", "Content": "We ended up at this hotel when the hotel we had originally booked claimed we had not booked more than one night and could not accomodate us (The St. Michel). We were there for a Parents' Weekend at the Univ. of Miami. We called this hotel from the St. Michel and were accomodated at a price of $80/night (before taxes). We had a large room with a king size bed. This is not a luxury hotel, but unlike some of the other reviews, we found it clean. Our TV was not working and they replaced it immediately. Even though our room overlooked the street, it was very quiet. If you are a non-smoker, make sure you request a non-smoking room. Also, wifi internet was free. (A former review complained of being charged too much for internet access). The hotel is on Ponce de Leon and mid way between the University and the airport---about a 15 minute drive to either. There is a Greek restaurant off the lobby. The breakfasts were so-so, but we had a nice dinner there. The hotel has free parking and a pool. It's your basic motel, but pretty good for the price and location.", "Date": "October 18, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nasty!”", "Author": "chicagotravelgirl", "ReviewID": "UR4220480", "Content": "I chose this hotel because it was within walking distance of a business meeting I had to attend. What a mistake! This is the worst hotel I have EVER stayed in. Camping would be a better choice. The hall ceiling was dripping, the room smelled like vomit or spoiled milk, there were roaches, and the carpeting looked like it hadn't been vacuumed in years - it was so dusty. The hotel is dirty and poorly kept. This is not a deal.", "Date": "December 8, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“Very satisfied”", "Author": "Axwell", "ReviewID": "UR3306528", "Content": "Stayed at this hotel in Coral Gables in January 2005. It's in a quiet safe location that is also convenient for the airport and most of Miami's main attractions are within a 20 mimute drive. Hotel is in good conditon with big, well equipped rooms, well maintained. Restaurant is decent enough (though there are no others within easy walking distance) Staff okay if not particularly friendly or helpful. Internet access costs are outrageous, otherwise it is a good value stay.", "Date": "March 28, 2005"}], "HotelInfo": {"Name": "Hotel Chateaubleau", "HotelURL": "/ShowUserReviews-g34438-d84296-Reviews-Hotel_Chateaubleau-Miami_Florida.html", "Price": "$111 - $167*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1111 Ponce de Leon Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33134-3321</span></span> (Formerly BEST WESTERN Chateaubleau Inn)</span> </span> </address>", "HotelID": "84296", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3f/b7/4a/exterior.jpg"}}