{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Odessa, Florida, United States", "Title": "“Nice family weekend”", "Author": "ArleenL", "ReviewID": "UR137925777", "Content": "Spend the 2 nights at Oceanside Inn with the family. Spacious room overlooking the beach, very clean. Staff was friendly and accommodating. Pool nice added bonus was the Tiki Bar. Will be staying here again.", "Date": "August 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando", "Title": "“Very nice night away, spur of the moment trip.”", "Author": "keithsnumber2", "ReviewID": "UR137679692", "Content": "Super nice staff. The bartender makes one of the best long island ice teas I have had. We had a king room with an ocean view on the fourth floor. Clean room and pool, no smells, simple continental breakfast. I wish that there was a balcony, however, the whole wall of our room was a huge window. Wi-fi was only guaranteed on the first floor and when we tried to use our device on the first floor we could not connect long enough to accomplish the task we were trying to accomplish. Would stay here again with or without the kids. Hubby says that they definately know how to take care of their guests and make you feel welcome. The cleanliness is outstanding.", "Date": "August 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "us", "Title": "“enjoyable stay”", "Author": "s C", "ReviewID": "UR137514211", "Content": "just a quick trip to daytona, had an ocean side room on the 3rd floor that was very nice. free dvd rentals as part of the amenities, good for the 'bored' kids. was an older hotel but in good shape and kept well. hidden taxes were a bummer but not that bad. would stay there again without a doubt. they did not tell us bout the $50 deposit fee that is charged to your card upon check in until you get there. over all a good place to stay", "Date": "August 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ocala, Florida", "Title": "“Nice staff!!!”", "Author": "Dana C", "ReviewID": "UR137057090", "Content": "You get everything from a tiki bar to exercise equipment here! DVD rentals made it nice for my daughter. The pool was big and everything was clean. The room was very nice and tidy as well. We were very happy with our choice to stay at this hotel!", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“We stayed on the beach!!!!!”", "Author": "kimmitch", "ReviewID": "UR136828896", "Content": "I stayed in this hotel as part of a timeshare promotion of 3 days and 2 nights. The room we occupied on the first night was clean but very cramped.The service was excellent. The safe in our room did not work. Once reported, service arrived within minutes. The man was pleasant and the problem resolved immediately. I was able to upgrade for the 2nd night to an oceanfront room. The room, while furnished with older furniture, was clean, spacious, and had a wonderful view of the ocean (but no balcony). The continental breakfast was not the best I have ever had, but it was better than some others we experienced. My children were able to access wi-fi without any glitch. We did not spend much more than \"sleep\" and shower time in the room as we were busy with enjoying Daytona and area. We did not spend much time in the lobby either than as the route to the ocean. Parking was located next to the hotel and we always found a spot in the garage, out of the sun, but close to the entrance. This was the first time I had encountered a policy limiting towels--we had to turn in used towels to get an equal number of clean towels. My children enjoyed the pool without any complaint. Overall, while the amenities were not 5 star, they exceeded my expectations for what I could afford. All of the employees that we had contact with were friendly and helpful. The location definitely compensated for any deficiency in amenities. We stayed \"on the beach\" and not several blocks away!!! I would definitely choose a beachfront room for my stay if I ever have the opportunity to return to Daytona Beach again. Of all of the hotels we stayed at on this trip, this one excelled in service, parking, and location.", "Date": "August 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "augusta, ga", "Title": "“Do not stay here!”", "Author": "msdrea32", "ReviewID": "UR136184694", "Content": "We bought a deal from KGB Deals for $79 for 4 days and 3 nights when we arrived at the welcome center they gave us a set of keys to a room 622 and offered us a time share so to kill time we did it. We were told we could go straight to the room but we stopped by the front desk just to make sure the room was ready. It was not we were switched to 412 and asked to pay $50.00 resort fee which was supposed to be included from KGB. We got out of that once getting to the room the air didn't work the king size bed was sunk in the middle that gave us back aches the wi fi didn't work. We were moved again to 410 better air bed still broke in half wifi worked sometime. Breakfast is a joke cereal and hard danish. Hot tub doesn't work and the pool is old. Wi Fi only works in the lobby, They have several bars that they have drink specials posted for that never open up. The staff has a terrible attitude and are very rude and unfamilar with customer service. Will never stay there ever again. I did enjoy Joe's Crab shack and the rest of Daytona.", "Date": "August 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“VERY PLEASANT PLACE.”", "Author": "terry12338", "ReviewID": "UR136182903", "Content": "I stayed at this hotel july 2012 for 2 nights with my husband, after 4 long days with all the fam at Orlando. Went i first saw the place wonder how would it be to stay here, been that I have timeshares it was a little uncomfortable to stay in a place like this. For my surprise the place was great, they gave us a very nice room looking to the pool and ocean, very quite, the employees were very nice and helpful, can complain, had a great time with husband, i wish I could it stay longer, had breakfast out every morning and Dinner. NO REGRETS. If I have to used it again I will. The beach is great,even the swimming pool was nice, no body bothers with anyone.Had a few nice drinks by the pool.", "Date": "August 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ponce, Puerto Rico", "Title": "“Not what I Expected!”", "Author": "PrPonce", "ReviewID": "UR135933563", "Content": "I stayed there this past July 2012 with my family for 3 nights.A timeshare company offered me to stay there, to try it, not for free,not even cheap,but i took it thinking that they will treat me as a guest and show me the best of their company`s hotel and ammenities.Saddly,I found that this wasn`t what i expected.It`s an old hotel with old appearance from the interior of the room to the outside.Surely was better than Calypso Cay room ,but not what i expected.I don`t like timeshare people that offer you something,make you stay in an old hotel and then try to show you other great resort thinking that you are dumb and you will buy their stuff,please!.People deserve respect.Don`t try to sell using those tricks,shame on you!. The continental breakfast is so bad that not even my dog can eat it,please!The only good thing about this old hotel is the closeness to the Daytona beach- it is behind the hotel.An old hotel means old carpets,bad odors,stains,rust and all the bad things that all old hotels have.If you just like to be close to the beach,then this hotel is for you.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good hotel!”", "Author": "Susann86", "ReviewID": "UR135115050", "Content": "After reading reviews i almost cancelled my booking.. So glad i didn't! Friendly staff. Our room was big, clean and some oceanview! We didn't have big towels in our room, went down to the front desk, they fixed it right away. There's a kitchen as well in the room so you can make ur own food. I'd stay here again! (We had room 910, top floor)", "Date": "July 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“This place is nasty. Don't stay here!”", "Author": "Hello1995", "ReviewID": "UR134148763", "Content": "We checked in and when we got in the hall way from the elevator is smelled. The room was not much better. The tub was dirty and the bathroom needed to be painted. The room needs to be cleaned out then painted and carpet replaced replaced the furniture with new stuff. However when you leave the property and go to the beach and face the ocean with your back to the hotel, it's a nice place.", "Date": "July 11, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Troy, Illinois", "Title": "“Hasn't been updated in years”", "Author": "Expat2005SA", "ReviewID": "UR133896681", "Content": "If you're looking for inexpensive accommodation and not fussy about decor then this place is okay. Its clean but very outdated.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Poor staff service, bugs in room, dirty smell”", "Author": "campbellhale", "ReviewID": "UR133843551", "Content": "We stayed for 5 days, on the second day we found a roach in our room. We complained to management, nothing was done. We were told it was an isolated incident, so imagine my surprise 2 days later when i found another one 3 times the size of the first one. Our room always smelled moldy/stale. The air conditioner sounded like a jet taking off when it kicked on and kept waking us up. The clerk that checked us in was really rude, and almost every time i went to the front desk she was there still rude as ever. We also had to pay a resort fee, and this hotel so didn't warrant paying an extra fee for anything. I was very disappointed with our stay. We will not be returning to this hotel.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Dirt cheap, but still overpriced”", "Author": "TeddyBearFace", "ReviewID": "UR133323177", "Content": "My wife and I stayed here when in a bind and needing a place to stay overnight before we knew how long or if we'd be staying in Daytona Beach. We picked it because we got there late and were leaving early, so we just wanted something cheap. We got what we deserved. This hotel was disgusting, and included disclaimers stating that they opted out of Florida state laws requiring the cleaning of hotel glasses. Other signs included one at the front desk warning to not open the door for people knocking on your door, as it could be unsolicited intruders. We were both appalled by the notices, and were equally as disgusted by the room. While it actually seemed and appeared clean, we did not trust the bed enough to get under the covers. The inconsistent air conditioning unit made for a miserable night on top of the bedding. Our assumptions that it was dirtier than meets the eye were affirmed by the unidentified bug in our bathroom, as well as our checkout, when the front desk was called by another guest. He was complaining about the bugs in his room, only to be met by a nonchalant reaction offering to spray the room when he and his family were out. I would never stay in this hotel again, and I would suggest that, if your budget allows, you don't either.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Strawberry Plains, Tennessee", "Title": "“Not worth the money”", "Author": "Tony W", "ReviewID": "UR132326368", "Content": "My name is Tony W, I took my two kids on a Fla vacation last week and we decided to stay at this Hotel. what a bad idea that was. when I went to check in they couldn't find my reservation,so they put me in a different room than I wanted. I reserved a King room that looked very nice from the pictures on line but I ended up with just a plain room,very small . but I was charged the rate for the king room. after three of our six day stay they moved us to a different room but still not the king room. the wifi didn't work in the lobby, the pool had a salt water filter system on it so the pool was nasty and in the six days we stayed it was not cleaned once. the people at the front desk was rude to everyone they spoke to. this was the worst hotel I have ever stayed in. we go to Fla every year and this was the first time and the last time I will ever stay here. when I went to check out they told me that there whole system was down and I would need to wait four hours to check out, I could not wait that long so I choose to leave, when I ask them to mail my invoice to me they said that they could not do that. and as of yet I don't know when I will get credit for my $50.00 deposit that I was charged above the room rate. the pictures on there web site are out dated this hotel is in very bad condition, my advice to all would be to pass this place up and find some other place to stay.", "Date": "June 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Venice", "Title": "“Couldn't pay me to go again!”", "Author": "dave1027", "ReviewID": "UR130815838", "Content": "I won a 3 night stay here through an auction at my 9 year old's elementary school. We had to go \"check in\" at some welcome center where they signed us up for a hour & a half sales pitch to join their travel company for $13000. We were handed deadbolt keys to the room they owned in the hotel & told to go there & ask at the front desk if that room was clean. We went to the hotel & asked the girl at the front desk if that room was clean & she said yes. My wife asked where the continental breakfast was served & the manager/witch said \"you don't get that\" because \"you're not really guests\". I was really close to driving back home right then but I had a 9 year old girl with me. The next day after swimming in the pool, I wnet up to the desk & asked for pool towels & guess what? I was told \"you don't get towels & I said \"because I'm not really a guest?\" The room was not cleaned for 3 days, no towels, no sheets, nothing. DO NOT GO HERE!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Lakeland, Florida, United States", "Title": "“Worth the money”", "Author": "Katie W", "ReviewID": "UR130728365", "Content": "Hotel in a great location but rooms have not been updated in quite a long time. Beds are old an uncomfortable. Furniture is stained. Wall had holes in it. Great service as well though.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "cincy", "Title": "“dated but clean”", "Author": "cincyedc", "ReviewID": "UR129523109", "Content": "nice cooperative staff. Allowed us to change our room to twin beds easily Clean dated", "Date": "May 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“poorly maintained and not as advertised”", "Author": "fugawe09", "ReviewID": "UR129478671", "Content": "I was looking for a relaxing beach vacation. Maybe I should have known better than Daytona Beach in general... but... the professional photos are taken from creative angles and probably photoshopped a bit. It conveniently crops out the enormous new resort next door that blocks the ocean view on one side. I had a reservation for a king bed with an ocean view. I show up to a room with two double beds and a view of the parking garage - and only the parking garage. Not even city view. Parking garage view. Mind you they first told us that we couldn't even park in said garage, that we would have to park across the highway in an abandoned gas station. My girlfriend tried to protest and the lady at the desk blew her off. I had to really force the issue and got a parking pass and new room. Note that all of the photos on their website are of \"ocean front\" rooms while most of the rooms are actually \"ocean view\" on the side of the hotel. And then there's the beach itself. True, the hotel has no control over it, but the pictures of a serene beach are totally inaccurate. In real life it is packed with big wheel Jeeps parked bumper to bumper for as far as you can see. When I was there, the hotel itself was playing host to a New Jersey couple's wedding - and there was enough drama for a reality TV show. Late night yelling, vomit in the elevator, etc. Again, maybe not entirely the hotel's fault, but that's the clientele that comes here. In terms of maintenance, the furniture is all trashed. It's second-hand from a resort in Orlando. All of it is still stamped with the name of said resort. Part of the parking garage is not useable because the concrete is falling apart. It is literally propped up with 2x4s and caution tape. The housekeeping in the room was sufficient but everything just felt old and abused.", "Date": "May 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Eustis, Florida, United States", "Title": "“I don't like someone else's poo in my supposedly clean room”", "Author": "Judi D", "ReviewID": "UR129312809", "Content": "First let me tell you that I read all the reviews and tried to stay in the hotel next door to this one but they were full, so we had to stay here. We went for a Wedding that was taking place at this hotel and all of the other wedding guests stayed here. When I arrived i was checking in and asked to make sure they had my daughters reservation and could we get adjoining rooms, The desk clerk informed me that they didn't have my daughters reservation. They then informed me that there wouldn't be a room for her and her family. I decided to go ahead then and get a suite which they had one left. She told me it would be an additional charge of $50 a night extra. I agreed and said well then my daughter and her family can just sleep in their with me. The suite should be big enough. When I went in to the suite I noticed that it was a bit run down but didn't seem to be dirty. I unpacked my belongings in the bathroom, but when I went to use the bathroom there was someone else's poo in and ON the toilet lid. I went immediatley to the front desk and told them and she offered to have house cleaning come down but the other clerk then informed me that house cleaning was gone. Then she just said SORRY about that! Now I at this point was livid! I went back to the room and had to clean it up myself!!!!!!!! I got to tell you this will never happen again because I won't stand for it. If I had a choice to be placed in another hotel I soooooo would have gone but they were all booked up. Needless to say I will NEVER go back to that place again. They did end up giving us one nights stay for the discounted rate but even at that this place was no good. No balconies in the rooms to enjoy the ocean breezes, no little extras at all. I hope this will help someone else to avoid the same problems that I had here.", "Date": "May 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great support and service for our large group!”", "Author": "hlc8", "ReviewID": "UR129289813", "Content": "This hotel is right on the beach and offers outstanding support and service. Everything we need is provided with a friendly and courteous response. Jose and the kitchen staff provide the best service around. We've been coming here for years, and have never been disappointed.", "Date": "May 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Orlando, FL", "Title": "“I'd be disappointed if I didn't get a deal”", "Author": "freakyb", "ReviewID": "UR128456368", "Content": "Looking at crashing for the night after a trip up from Orlando. Got an Orbitz deal and glad I did. Big clean rooms with clean bathrooms. Ocean \"view\" is a little deceptive. Yes I could \"view\" it if I stood in the corner of the room. Outside in back of hotel had nice places to sit and watch ocean...and direct access to beach. Overall nice and clean, and if they didn't claim to be ocean view I wouldn't mind the view when I got there...just not what I expected.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Cockroaches”", "Author": "Shellyrubenstien", "ReviewID": "UR128411592", "Content": "I stayed here as part of a timeshare package. The hotel has a nice pool and is right on the beach, our second night we found & killed 2 cockroaches in the bathroom. The continental breakfast is cereal & danish only. Coffee & juice. There a cafe on site with reasonable prices. Have they're own version on Redbox in lobby, 1 free movie at a time with DVD players in rooms. Beds were uncofortable.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ada", "Title": "“Look around before you book”", "Author": "AnnieOklee", "ReviewID": "UR128203769", "Content": "Well, first of all we did not get the rooms we thought we had booked. The standard rooms that were available only had one king size bed per room and we had four people per room. So at the time of booking we were upgraded from the $89 ocean view to the $99 ocean front for the $89 price. We were supposed to have 3 rooms together. Room 1 was on the 3rd floor in the front of the building with no view of the water. Room 2 was on the 4th floor and if you stood at the very back edge of the window you could see the ocean only if a wave happened to roll way up on shore. Room 3 was on the 8th floor on the north side and that did have a nice view of the ocean. The bed frame on one of the beds in our room was broken. There was trash from a previous guest under the bed. On the night we checked in, Brittany, the front desk clerk was not very nice or helpful. We needed a crib and she was unable or unwilling to get one saying we would have to wait until the next day. The next morning we spoke with the manager to figure out the room mix up. He was not the friendliest person and told us we did not book a specific room only the room type. Anyway he wasn't very pleasant for being in a service industry. The \"Continental Breakfast\" is a joke. Stale pastries, fake Cheerio's, raisin bran, watered down OJ, & coffee. The prices at the restaurant are way over the top. Everyone we spoke with wondered what continent they were talking about to call it a continental breakfast. The internet service is poor to below poor. If your lucky enough to get on it boots you off and on continually. We were lucky and guessed the password because they didn't give it to us. One couple I spoke to said that Brittany was a real b**ch to them also. They were so fed up with the lack of internet service and customer service, at the front desk, they were changing hotels. The housekeeping staff was friendly. I think it's the only hotel around without any balconies. There is only one umbrella table by the pool with 4 or 5 chairs. There are a couple picnic tables, one by the pool and one on the yard. I guess it was all the things added together that would make me say I wouldn't stay there again. There are so many hotels to choose from so why should I give them any more business or recommend them to anyone else. Unless the only other option is to stay at one of the little dumpy motels on the other side of the street. Then I guess I'd stay there again.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Okeechobee, Florida", "Title": "“3 on the border of 4!”", "Author": "Nearandfar23", "ReviewID": "UR127178934", "Content": "My daughter does competition cheer and during spring break they have a competition at the bandshell. So usually you would think it would be crazy, but they have a great handle on things. The hotel is older, but very well kept up with. We have stayed a few times now and the staff has always been nice and helpful. The beach is right outside and restaurants aren't far at all. I would say that the complimentary breakfast needs a little work, they kinda force you to eat at the hotel restaurant. The pool was nice also. I would recommend it for a quick stay, family friendly.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "orlando", "Title": "“no continental breakfast just a morning snack”", "Author": "lilouny", "ReviewID": "UR125547028", "Content": "The continental breakfast was made of a pastry and orange juice with coffee...that's all... Kinda disappointing for the 111$ that we paid for a night... Every guests coming to the breakfast place had the same face on seeing this fake breakfast. The hotel is clean and the rooms too. We could hear everythg in the room next to us which was annoying.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“FAMILY REUION”", "Author": "angie t", "ReviewID": "UR125035811", "Content": "Good trip Family reuion 2010 and 2011. entire family liked it both times. would go back again. staff nice rooms ok inside and outside bar good", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“PLEASANT EXPERIENCE”", "Author": "Pam B", "ReviewID": "UR124435142", "Content": "Before my I booked this hotel for my husband and I to spend only two nights, I read a lot of the reviews and had my concerns. Being that it was race week, many of the hotels were booked. I (we) were pleasantly surprised when we walked into the room. Granted, there was no balcony, but the room was very, very clean, very large, included a kitchenette, and for the price, it couldn't be beat. The staff was quite friendly, as well. The breakfast was nothing to rave about, but again, for price, what do you expect? There was an awesome fish tank in the lobby, and checkout was a breeze. I would definitely stay here again in the future.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“MOST BANG FOR YOUR BUCK :)!!!”", "Author": "Snflwrchld555", "ReviewID": "UR123317522", "Content": "I was a bit apprehensive initially with the mixed reviews but didn't have a lot of cash flow and had to spend the night in Daytona...I am definitely glad I found this hotel it was clean, the room was large and had a couch; desk; microwave;fridge;coffee maker; & dishes, you get a movie rental card machine is in the lobby, an it's right on the beach SERIOUSLY all for 95(TAX INCLUDED)!!! Not sure what the bad review people were expecting but I will DEFINATELY be staying here again :)))!!!!!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "huntington", "Title": "“great stay”", "Author": "lorihuntington", "ReviewID": "UR122627753", "Content": "we stayed in a oceanfront room that the front desk picked for us great roomshe did a awesome job picking it we will stay there again next year the only thing we didnot like was their cont/ breakfast donut juice not acont. breakfast", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sevierville, Tennessee", "Title": "“Good Value & Excellent Service”", "Author": "SmokyMountainFinds", "ReviewID": "UR122426550", "Content": "On an impromptu trip to Daytona Beach we decided to stay for a few days and had the good fortune to stop and check room rates at Oceanside Inn. With the local hotel discount book and the beginning of the off season we were able to book an ocean side suite for less than $70 a night. Our suite included a full eat in kitchen, sitting area with seating for 7, two queen beds, two tv's, plenty of storage space and a large bathroom with dressing area and full closets. We were treated to a wall of windows overlooking the ocean from the 7th floor. Our kids loved this as they could open the windows at night and fall asleep to the sights and sounds of the ocean. The room was clean and well cared for. Beds were newer and very comfortable with plenty of pillows for each bed. The staff went above and beyond in the level of service at all areas. The free breakfast is very basic. Cold cereal, pastries, coffee, juice and milk. The hotel offers a good selection of hot breakfast items at a good value. Kids enjoyed the free DVD rentals offered. The full kitchen was great option for anyone who would like to cook and would offer a huge saving option on food cost. There are ample grocery stores nearby. Access to the beach is just steps out the back door and we liked that it is secured with a child safety lock. Very secure parking area that is well lit. We did notice some roaches on our checkout day and mentioned it to the front desk as we were packing up. Before we left they had someone working on it.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Always An Excellent Stay!”", "Author": "sandandseavacation", "ReviewID": "UR120799110", "Content": "We stayed in one of the Oceanfront rooms and just loved it. We managed to get the room next door, as well, for our 2 adult children. We had crab and shrimp that we picked up from a Publix market on the beach. What a great way to enjoy the ocean view, eating seafood. I liked the fact that we could slide open the window to enjoy the crashing waves, but we still had comfortable AC while we had our meals. Our kids hiked down the beach every night for some entertainment by the pier. They could have taken the local trolley, but they preferred to walk on the beach. Our room was very comfortable, as always. We had a king bed studio with all the usual amenities, including tv, kitchenette, and sitting chairs for beach watching. We brought our beach gear in the room, so all we had to do was take our food and drinks out of the fridge, grab our gear, and head down to the beach. The hotel is right on a beautiful beach, so there is no need to pack up the car. I enjoyed the basic free breakfast every morning. Coffee, cereals, little donuts, and juice. And, if you want a made to order breakfast, there is a little sit-down restaurant next door! We also liked the covered parking lot, since the sun is so hot in August. The front desk and the manager, James, were very accomodating to all of our requests. We can't wait til next time!", "Date": "November 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Whitney Poiint, NY", "Title": "“Oceanside Inn is not bad, but would not stay there again.”", "Author": "WPTraveler", "ReviewID": "UR119276613", "Content": "My husband and I stayed six nights in late September 2011 as part of a package deal. The room was adequate and the bed was comfortable. There was a microwave and small refrigerator. We were disappointed that there was no balcony and the window did not open. We like to hear the sound of the ocean when we take a beach vacation. The building appears to have been recently updated. The staff was friendly enough but we had to ask several times before housekeeping serviced the room, finally on the fourth day of our stay. The complimentary breakfast was two choices of cereal, orange juice, coffee and danish. This was fine with us; we brought our own fruit to put on the cereal. There is a restaurant with reasonable prices but we did not eat there. There is a mandatory \"resort fee\" of $5.95 per night to cover DVD rentals and internet access.", "Date": "October 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice Getaway”", "Author": "Andrearf", "ReviewID": "UR118015315", "Content": "Clean oceanview room, relaxed environment. Unpretentious atmosphere and just enjoyed the pool and beach as much as possible.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Plant City, Florida", "Title": "“Great value right on the beach.”", "Author": "samsidoti", "ReviewID": "UR117988110", "Content": "You can't beat the price and value at Oceanside Inn in Daytona Beach Shores Florida. The Building is clean and right on the beach. Most rooms have an oceanview with micro, refrig, and coffee maker. Even though this is an older property it is well maintained. A fee continental breakfast is included but there is a full service rest. also available.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“Not what I expected”", "Author": "eduardo g", "ReviewID": "UR117776605", "Content": "This hotel needs restoration, everything looks old. Bad smell in halls and room. Breakfast include is a fraud (only cereal and coffee). Room service was done after 3 pm. Poor security, anyone can go and have a nice day at the swimming pool without paying (no bracelets required to be in).", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "orlando", "Title": "“Never again”", "Author": "taylor m", "ReviewID": "UR117679461", "Content": "Where do I start? The hotel looks rusty and a bad place to stay.The front desk lady seemed like she was rushing us in the check-in process. We get into the elevator, which smells and is VERY hot. It also stops at every other floor, even if there is no one waiting to get in. It will also go back down some floors, if you are trying to go up. We get out of the slow elevator, and the hallways are HOT! There is no air conditioning in the hallways at all. The rooms were okay. The bed was big. There were no blankets on the bed. We called front desk and they said we had to go back down the slow elevator and get them from the front desk. While down there, we used our \"unlimited dvd card\" they provided for us. There were not good movie choices at all. So, we picked our dvd, brought it back up the slow smelly elevator and popped it in the dvd player. Little do we know, the remote control was broke. It did not switch to the DVD settings. We called AGAIN. A nice repair man helped us with the remote control. The dvd then worked. Pool was small and seemed dirty. Breakfast was not free. A/C worked very good but made a lot of noise. My boyfriend and I actually chose to walk up the stairs at one point. When we were checking out, the front desk lady gave us the \"complementary toothpaste\" and splenda packets. It was pathetic.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Lake Mary, Florida", "Title": "“Wont go back....EVER!”", "Author": "rhondamichelle73", "ReviewID": "UR117055557", "Content": "If your only concern is money then go ahead....but if you care about cleanliness then pass on by. The bathroom was yucky...there was pubic hair on the towel that was hanging on the towel rack. The towels were all hung perfectly with a pub just laying right on top! How could the maid not have noticed this? Also there was one on the shower handle....OMG!!! The hotel also said they have a continental breakfast....um....yes if you have money they will make you breakfast! One guy that was down there actually called before he made his reservation and they confirmed that they did have a continental breakfast. Good grief! The kiddie pool had grass and weird stuff in it. The tiki bar is hardly ever open. One good thing was that the A/C will freeze you out of there which is awesome to have in Florida....BUT PLEASE PROVIDE AN ACTUAL BLANKET FOR US!!!!!! There was a sheet and a very thin foam blanket on the bed....and laying at the end of the bed looked like a comforter....when I pulled it up....IT WAS ONLY 2 FEET IN LENGTH!!! What am I going to do with that???? Also someone at that hotel needs to look up the dimensions of a \"king\" size bed...When I booked the room they asked if I wanted a king or 2 queens...I chose king.....That bed was a double....the mattress in my camper is bigger! And it sunk in the middle so me and my husband were miserable! I know that I could go on and on....but I don't wanna get a cramp!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Missouri", "Title": "“Excellent hotel right on the beach”", "Author": "NYC20th", "ReviewID": "UR116756198", "Content": "When we arrived at this hotel it was pouring with rain! The lady who checked us in could not have been nicer. She recommended restaurants which would deliver lunch for us. Our room was wonderful. it was quite large and was a corner room with windows on two sides and had a fantastic view of the beach and ocean. We noticed on getting settled that we didn't have any towels but it took less than 5 minutes after we called the front desk for someone to bring a nice stack of towels to our room. We had pizza delivered and ate it while we enjoyed the view. The beds were extremely comfortable and the room was very clean. The bathroom was in excellent shape. We did not try the restaurant but did go down the road to eat at the diner and the food was really good! Our room had a little fridge and a sink an microwave. this would have been very handy if we had been staying longer but we only stayed for one night as an add-on to our Orlando vacation. All the dishes were clean as were all the appliances and the sink. I had read some not very complimentary reviews of this hotel but we thought it was great. It is in a good location, is very clean and comfortable and the staff is very nice. One staff member recommended we take a drive to the nearby lighthouse and we did and had a nice couple of hours. There is a very small resort fee which shouldn't be a big deal. We would definitely stay here again.", "Date": "August 15, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Denver", "Title": "“Watch your belongings”", "Author": "freedom124", "ReviewID": "UR116581612", "Content": "The hotel was just fine and clean..no complaints on that side..and would stay again..other than one big problem. When we came back from the beach, i realized my husbands bed was made and mine was not. We found that very odd..because the maid had been there. The trash was emptied, new shampoo and soap ect. Later that evening i went to pull out my wallet and pay for dinner, only to realize that the cash in my wallet was gone..I realize it was my error to have left my wallet on the bed ( hence why it was not made..this way the maid could say she never saw a wallet ..or touched a wallet ) ..however ..there was no way to prove missing cash. BE VERY CAREFUL WITH YOUR PERSONAL POSSESSIONS..by the way ..the maids name was \"Sister \" >>Live and learn...and dont be so trusting..", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Almost Perfect”", "Author": "EgyptJenn", "ReviewID": "UR116518575", "Content": "The location was wonderful and we were satisfied with our room, but our a/c was so loud, we had to turn the tv way up to hear anything. We noticed the loud ac noise right away when we entered our room but we decided we would just deal with it; we were already in a good mood and didn't feel like making a big deal out of it. Well at around midnight while we're cuddled in bed drinking a bottle of wine and watching a movie, we have an employee of the hotel knocking on our door saying they were getting noise complaints from the neighbors. I explained the ac situation and the fact that we couldn't hear the tv if we turned it down so he said that he would have to move us! At midnight, we had to get out of bed and compile all of our stuff and move to another room on another floor. Then the dvd player didn't work in that room at first and we were on and off the phone and the guy and he had to come back up to our room to try and figure out how to get it to work. It was very frustrating as it was late and we just wanted to crawl back into bed and finish our movie instead of dealing with all that. Aside from the midnight ordeal, we did enjoy our stay there.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brandon, Florida", "Title": "“Our 5th year here and counting....”", "Author": "vforce24", "ReviewID": "UR116210921", "Content": "We live on the other coast in Florida and plan an extended weekend vacation getaway to Daytona Beach every year. This was our 5th year staying at the Oceanside Inn and we are never disappointed. The rooms are always clean and very well stocked. We stayed with a group and against my better judgement went with the group and stayed our 1st 2 nights in Daytona at another place down the road. Yes, it was closer to all of the \"action\" but boy was I sorry I had done that. The others left and we spent the next 2 nights at Oceanside Inn. We were glad to be \"home.\" The location is great - right on the beach...the price is right....if you just want to hang out at the pool, it is very well kept. The staff is super nice and accommodating. I cannot say anything bad about this place! We love it and will continue to stay here every year when we return!!", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Average hotel”", "Author": "jedi42", "ReviewID": "UR116031763", "Content": "We stayed here in July, the hotel is okay - like a few others in need of an update, The first thing we did notice is the pool is a lot smaller than the picture - which is taken at an angle, thus it filled up quite quick and so did the area surrounding the pool, Pool towels are available at reception and no problems getting fresh ones. Breakfast is very poor, 3 types of cereal & small doughnuts, fruit juice & coffee, opposite the small room where continential b'fast is served you can order a \"cooked b'fast\" - tried that it wasn't much better and a bit pricey for b'fast, there is a publix not far from this hotel we bought milk,cereal & orange juice (as your room has a fridge) and had a diy b'fast. It has great access for the beach, we walked to the pier which is currently closed for renovations, nearby (to the pier) there is a small shopping mall with a cinema, Bubba Gumps, burger King etc. The hotel offer free DVD hire which was great to come in at night & watch a movie. The Wifi only seemed to work in the reception area. We only stayed for 3 nights but we only seen the bar open once & the Tiki bar at the pool opened about lunch time. All in all the hotel was okay for the money, but I would only go back if there was a really good deal.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“Nice hotel for the price!”", "Author": "DebbieHerczeg", "ReviewID": "UR115982878", "Content": "This was our first time staying in Daytona Beach, FL. The hotel was conveniently located near the Daytona Speedway and, Ponce Inlet. Staff was pleasant and very accomodating to our needs. The room was a typical hotel room, equipped with a microwave and fridge. The room was clean, beds were made daily. Nice size bathroom and plenty of closet space. It had a very large tv in the room, however, the tv was positioned next to the bed so it was uncomfortable watching tv. A better location would be directly in front of the bed where most tv's are located when visiting a hotel. The parking was very convenient, right next to the hotel. The swimming pool was nice and warm. Overall our experience at this hotel was a good one. We would visit again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Kent, Ohio", "Title": "“We had a fabulous time!”", "Author": "adnerblou", "ReviewID": "UR115762036", "Content": "On a trip to visit relatives, we stopped for 2 days at this hotel! The Ritz it isn't, its on the wrong side of the \"tracks\" but we had a fantastic stay! The parking garage was great, the pool and the tiki hut restaurant/bar were awesome. Great burgers and drinks. We bought the kids boogie boards and had a great time in the water. The best! Thanks If you want a large breakfast, go to IHOP its about 2 blocks away!!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Georgetown, Tennessee", "Title": "“Great place to stay.”", "Author": "Beaverj", "ReviewID": "UR115661145", "Content": "Great place to stay.View was great and staff was fantastic.Arrived really early and Scott got us a room ASAP.Had driven all night to get there.Everyone there was friendly and helpful.Room was very good and comfortable.Location far enough down beach to not be crowded but close enough to be convienent to everything.Older hotel but staff always working to keep it in top notch shape.Only draw backs was the tiki bar closed too early and it did not have a balcony but we knew that up front.When we go back next year we will be staying there again. Thanks again to everyone. John B.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Tampa, Florida", "Title": "“And you call this continental breakfast?”", "Author": "lionking05", "ReviewID": "UR115483005", "Content": "We stayed there this weekend. Hotel is an older hotel and needs renovation but is clean. The location is good and the ocean view is great. But I would be ashamed of myself if I advertised free continental breakfast and then offer some store bought doughnuts and two types of cereal. Also when the milk is gone, it is gone. No refill or anything. It was ridiculous.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Bonaire, Georgia", "Title": "“Terrible! Avoid this hotel like the plague!”", "Author": "stkemp", "ReviewID": "UR115222244", "Content": "We booked this online through our timeshare company. The description of the room and rates offered vs what was actually delivered was opposite. I paid for an Ocean View Deluxe with a Kitchenette. What I was given at check in was a small room with two beds, half a fridge and a small microwave. The \"view\" was of the hotel next door and street in front of the hotel. If I strained hard enough through the weather stained windows, I could see very little of the ocean. The mattresses were old and had a huge sag in them. Talk about a back ache the next day. They boast of a pool side Tiki bar that was never open and their regular bar didn't open until later in the evening. You have to wait for a long time to get on the elevator to get to your room. More often than not, you will have to go up to go down or go down to go up. When I confronted the hotel manager about the \"bait and switch\" on the room, he blamed it on the online websites that offer services they \"don't\" carry and said I would have to get any refund from them. He at least cancelled the \"resort charges\" for the movies / amenities that we didn't even use. The free continental breakfast was a choice of cheerios or raisin bran and soggy donuts. That was the only positive experience about the stay at this hotel. We will never go back and highly recommend you avoid this place. My wife and I wonder how in the world it gets \"3\" stars. I only give it one because that's the lowest I can give.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“Worse Ever”", "Author": "DEEDEET", "ReviewID": "UR115069026", "Content": "My family requested two ajoining rooms because we had kids ages 10 and 15 and wanted them to have their own room. This did not happen. We were seperated. The two rooms that we had were so roach infested that we had to spray down the rooms (yes both rooms) on the first night. Roaches were every where. The second night my daughter was awaken by a roach crawling on her in her bed. That did it. We got up, packed out bags and left. We will never go back there. The hotel could be nice, but the roaches got to go. The elevators need upgrading. They are too slow. The continental breakfast could us some uplifting. Powdered donoughts and raisin brand cereal, not much of a choice. Never again.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Just okay”", "Author": "susanwm", "ReviewID": "UR113239928", "Content": "There were mostly young familes and singles staying here. Our room was across from the ice machine and you could hear everything going on in the hallway. (people seemed to be getting ice all night long). The bed was not supportive and the pillows lumpy. On the plus side, the common areas were clean.. Even though our room did not face the beach and had no balcony, we could see the ocean from our window. I was glad that they offered a continental breakfast but was disappointed in the selection offered (a choice of 2 cereals, juice, coffee and mini donuts).", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "West Springfield, Massachusetts", "Title": "“Good value, comfortable, some noise problems (slamming doors)”", "Author": "egleview", "ReviewID": "UR112392111", "Content": "I got this at a discount from Hotel dot com ( their customer service after sales is NIL ) Upon arriving, upgraded with $20 ( a total of $78). The room is spaceious with a kitchenet, microwave, refregerator, toaster, coffeemaker, tv, (free DVDs if you like to see movies of yoru choice), iron and ironing board, a table with two chairs, sofa and a king size bed. This bed has been the most comfortable of the seven hotels that I stayed in last 10 or so days. Not too soft, not too hard; also for the first time I did not have to use my personal pillows! Upon waking up, as soon as I opened the drapes, tadah! A breathetaking Sun rise that you can see right from your bed! This hotel is ten story high, with two elevators. Two small but nice lawns and plenty of louge chairs... The front desk staff ( Charmin ) was extra nice - she even called to see if everything in the room was okay! Maintenance staff is another story. The door does not shut unless you slam it really hard. So I called the reception and she sent over the maintainance guy... His first questions was - how many nights you are staying? ( what does it matter!!! ) He checked the door and said he will need to order parts. ( according to me two drops of oil would have done the trick ) - I told him I do not mind, but if I were the next door neighbor I would be pissed. Guess what! After I went to sleep, bang, bang, bang from both sides of the room. It seems everybody had the same problem! Other than that, it is the BEST VALUE for the dollar....", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Pleasantly Surprise!”", "Author": "cath_cat77", "ReviewID": "UR111898358", "Content": "For the price I paid, I was pleasantly surprised because the staff was extremely helpful and courteous. The room was clean and comfortable! We checked out at regular time 11am and the hotel allowed us to stay parked there for free and hang out on the beach! Free coffee downstairs in the morning AND my room had a fridge, microwave, dishes and silverware! The cleanliness of the hotel makes us for the fact that it is not brand new. I will stay here again!", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Its Acceptable for the Price”", "Author": "rfuchs0917", "ReviewID": "UR111898167", "Content": "My husband and I took our son here to kick off his summer break. Our friends came along too. The room was quoted @ $74 per night, but on checkout I was charged $84. So, just be sure they are charging what you were quoted. I read online that this hotel had bed bugs, but unfortunately I read about it AFTER I booked. The posing was older and I couldnt decide if it was just an angry person trying to harm the hotel. So, I called and let them know my concern. They said, come on down and inspect the place. If it isnt up to par then you dont stay and dont pay! That was acceptable to me. On arrival I did just that. Flashlight and all I gave the room a complete inspection and NO BED BUGS!! I was very relieved. Still this is an older hotel and as such has hot hallways, slow elevators, a small in hotel lounge and restarant. Nothing overly fancy about this inn which was OK for us because we intended to stay on the beach! The are right on the beach with a nice pool area (NEEDS MORE SHADED AREAS!!!) and very small bar outside. On the beach you can rent chairs and an umbrella for $30 the entire day. That was SO NICE!! Anyways, overall it was acceptable for the money. I think I need something just slightly BETTER for next time though.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Listen to the Reviews”", "Author": "OnTheGo0620", "ReviewID": "UR110528116", "Content": "Bates motel, Jr...I am an appreciative person, but I must say that I have had better. I've paid less and had better. The price was reasonable, but the hotel is old. On the outside, it's grimy looking. At first sight, the inside is ok, but if you are a neat freak like myself and look closely, it is dirty. The elevators are VERY slow. Each floor is VERY humid. The room keys are difficult to use. You have to finesse them. The kitchenette was laughable. They said there was a stovetop, no stovetop just a microwave, plates, cups, sink, coffee maker, cutting board, flatware, dish soap, mini fridge, and some kitchen towels. The DVD player worked half the time. Again, you had to finesse it. The windows were dirty so it was difficult to enjoy the view while looking at dirt on the window. No balconies at all. I felt like I was in a prison, as I could not even open a window. The AC was good and cold. The bed was ok, but don't look behind it because you will see crumbs, dirt, and all sorts of things. The pillows are VERY soft so if you are used to a firm pillow then bring your own. The complimentary breakfast consisted of OJ, coffee, cereal, and doughnuts. Again, laughable. The ladies at the front desk were moody. All in all, I am grateful that I had a place to stay because the experience was awesome, but I would not subject anyone to that kind of experience with this hotel.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“DO NOT PLAN A STAY WITH THIS HOTEL”", "Author": "QueenB40", "ReviewID": "UR105986256", "Content": "Not only did they misrepresent their accomodations - but upon arrival and realizing that 5 people couldn't possibly sleep in the room they had \"bait and switch\" reserved in my name - they refused to do anything at all to help my family and I. We were promised a 2-bedroom, 2-bath with full kitchen and living room. We were traveling with 3 teenage girls and 2 adults. What they put us in had 2 double beds and no privacy for anyone. It also smelled like smoke and the furnishings were outdated, dirty and generally not what was represented in their photographs online. There was no manager on duty supposedly and in the inept front desk people wouldn't even attempt to contact one on my behalf. They did absolutely NOTHING to help us - and actually made the situation worse. The beach accesibility was nice, but given the poor customer service and misrepresentation - I'd trade the view for what I was promised any day!", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Location, and Nice Place to Stay”", "Author": "yellachick", "ReviewID": "UR104840585", "Content": "I really enjoyed my stay at this motel. Upon checking in me and my friend recieved a free travel mug, and received a bunch of free samples such as shampoo and toothpaste to name a few, upon checking out. The beds and pillows were super comfortable. The only thing that I didnt like about the motel is that when I got there (I pre-booked through Expedia) I had to give them my card for a $50 deposit, which is returned when checking out as long as no damage was done, and there is a fee of about $14 you must pay upon checking out for dvd rentals and something else, these fees are charged whether you rent dvds or not. Overall I was satisfied with my choice to stay here and would definitely stay again!", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Excellent”", "Author": "juancho64", "ReviewID": "UR101323190", "Content": "Excellent food & outstanding service at the restaurant and at the pool bar.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Worst Hospitality experience ever!”", "Author": "rvwer2011", "ReviewID": "UR100889305", "Content": "When we got there the front desk people did not even acknowledge us and were very rude. We were supposed to have an Ocean view room but got a street and another hotels view. When we enquired about that we were told that if we tried looking at the far left side of our window we would see the ocean! There were other two parties complaining about the same issue as as. The room was DIRTY and smelly...... The hotel should invest in good quality customer service.....smiling front desk faces instead of those grumpy agents (evening shift) will go a long way.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "South Florida, Florida", "Title": "“Not bad, perfect beach view, room”", "Author": "2kayak", "ReviewID": "UR100584089", "Content": "There during college spring break to meet daughter - crowded with kids but had tight security night and day, breakfast only cereal and donuts, service wonderful for anything we needed/asked for, didn't like paying extra for mandatory dvd rental. Ocean view from room, had microwave and fridge, love the pillows! Has a breakfast restaurant, not expensive, and also small evening club/restaurant. Free parking.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Princeton, Minnesota", "Title": "“The Roach Hotel, and I have pics to prove it”", "Author": "Nucknfuts", "ReviewID": "UR100487496", "Content": "Worst hotel stay ever! Looked good on internet, should have listened to the bad reviews. I don't know who would give this place a good review, except smelly trailer trash smokers. First off, it's old and broken down, lobby stinks, rooms stink like, not sure what, old stale coffee mixed with smoke maybe. We were totally paranoid of roaches and tore the beds down to look but none were found at night. In the morning I saw one on the wall just above the bed. I took a picture and showed the front desk while trying to escape this pit and they gave me a whole $17 discount, but after adding several hidden charges I still paid over $110. They did let me out of my second night and I went to the Holiday Inn next door and had the best hotel I've ever stayed at for $130. Run away, right next door to the Holiday Inn, you won't regret it.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Warwick, Rhode Island", "Title": "“RIP OFF”", "Author": "nala54", "ReviewID": "UR100193377", "Content": "The trip there was nice. When we arrived the desk clerk was nice. We were suppose to get an efficiency but when we got to the room, lets just say it was far from appealing. For the difference in price we elected to stay in the regular room. We walked into the room and when I turned on the air, this moldy smell came out. Now, my three grandchildren have asthma.( 11,10 and 8) I figured it may be because the air hasn't been turned on for awhile and the smell would go away so we notified the desk clerk and we went to the pool It was slimey so I slipped and hurt my toe going down the stairs of the pool.Now I should of reported it but I'm not like that. If I had known what I know now I would have. The room also was far from clean. I told the children to make sure they wore their slippers because the rugs were sssssssoooooo dirty. The internet is not free. There was a charge of 5.95 and that was for internet and movies for the two nights we were there. OK no biggie .The big problem came when we left. We checked out and went to breakfast (somewhere else because the breakfast there was a joke)and I thought I left some toiletrys there so we went back within 1 1/2 hrs. We went up to the room and it had already been cleaned. The maid and head maid said they found nothing in the room. OK no big thing. I ended up finding them in another bag later on. We arrived home and the next day I checked my credit card and there was a charge of $266.25 that I could not figure out from the hotel. I called the booking agent. She called me back and said it was because of smoking in the room. OK BUT I DON'T SMOKE !!!!!! My grendchildren don't smoke either. I called the manager several times (Scott Hendricks) and when I finally got ahold of him he said he had to check with the head maid. OK. No call back so I called again several times and when I talked to him he said there was a heavy smell of smoke reported by the maid and he wasn't 100% sure but he thinks there was cigarette packs found in the garbage. Again I don't smoke !!! I explained that to Scott and he said \"This happens all the time\". I tried to explain to him that I don't smoke (again) My grandchildren don't smoke either so how could that of happened.I told Scott I returned to the hotel 11/2 hours later to see if I left some things and the room was already cleaned and NO-ONE mentioned anything like that to me. So here it is months later and I never seen my $266.25. Amagine charging that much money for nothing. So whether or not you smoke if your number is drawn for the smoking charge YOU WILL get hit with it. Unless you can go back to take them to small claims court, you will never see that money again!!!!!!!!!!!!! MY booking agent will never use them again, she knows I don't smoke I will NEVER set foot in that establishment again even if it was for free. I don't want to be in their lottery", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“AWESOME”", "Author": "awilliams33", "ReviewID": "UR98280778", "Content": "They had great service, the place was very clean and big. I would def stay here again and most likely will!", "Date": "February 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Yuck”", "Author": "bmuntz", "ReviewID": "UR96293270", "Content": "This place stinks like smoke and its says its non smoking. There was a nasty bug in my fridge...a roach! Good location but not worth the fear of reaches nesting in your ear.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Hotel experience was better than we expected it to be”", "Author": "Gina039", "ReviewID": "UR95226026", "Content": "Although our visit to Daytona was not for a vacation but to see an elderly family member who had fallen and was in rehab, we thought we would try to find something on the beach so we could take morning walks on it. Based on the reviews we had read, pictures of the hotel we had seen and the low rate offered, we expected the hotel to be at best, a 2-star hotel. We were delightfully surprised to find that the hotel was better than we expected it to be. Although we knew the hotel was full, when we checked in, we were upgraded to a deluxe ocean view room and we really did look directly out onto the ocean from our room. The rate included a continental breakfast but the hotel did also have a restaurant that offered full breakfast choices. There was also a bar area that served limited food items and drinks in the evening, Tuesday - Saturday. In addition, the pool was heated, there were laundery facilities in the hotel, parking was under cover, there was a nice sun deck on the 2nd floor, the towels were not paper thin, the room was a decent size, the beds were comfortable and the room had a small kitchenette in it. The staff was very friendly. My ownly disappointment was, there are no balconies at this property.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "joppa, md", "Title": "“The worst hotel experience ever”", "Author": "jennsyn", "ReviewID": "UR89763591", "Content": "We had three different rooms over a 2 night stay. The first room smelled like mold so we switched into another room. Nothing worked in the second room but atleast it didn't stink. They sent someone up to fix the DVD. He couldn't but said that he would get us another one. He never returned. This seems to be common, the maid also did not show up to clean the room and no I did not leave the do not disturb sign on the door. Even at rat-trap motels, the maid shows up. I would have given it no stars if I was allowed.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“RUN FROM THIS PLACE”", "Author": "GAPeach79", "ReviewID": "UR85517856", "Content": "No bedspreads or comforters on the bed just 2 flat sheets. Pillows that were flat like a bag of cotton balls, I've seen more fluff in a maxi pad. I'm not sure they have house keeping b/c the rooms were nasty. There were smashed bugs behind the glass of the framed art....who does that? All the furniture was cracked and chipped. Chair cushions were black from being dirty and not being cleaned....makes you real grossed out at sleeping in thier beds. Brown spots on the walls that looked to be there a while and have not been painted. The mini fridge was missing racks and looked like the door had been kicked in. The microwave was sitting on top of the mini fridge and was to big to be doing so therefore it was handing off the top of the fridge. The shower liner they had put in over the old stuff obviously wasn't installed correctly because it would pop and give under your feet. There was a fabric shower curtian but no liner. The a/c in the room worked good but the hallways were extremely hot and smelled really strong of old mildew carpet. The elevators scared me, they shook so much the doors would crack open and you can see the markings of the floors as you passed. The continental breakfast was a joke, don't expect them to refill either. Even if its an hour before cut off, if the 2 choice of cereal and a few pastries was gone you were just out of luck. However you could go to the restuarant and pay for the breakfast which was also a joke. The guest guide said the pool was heated, we were here end of Oct first of Nov....pool was so cold that my oldest son was literally turning blue and I couldn't even get in past my knees before I turned around and we left. The fitness room consists of 3 pieces of equipment in a really cramped room. The parking deck was small, poorly designed and hard to get around in. The vending machines charge you $1.25 for a 12oz can of coke. The ice machines, well lets just say bring your own ice. The one close to our floor was cracked, the visible air filter was dirty and the bolts were so rusted it was all over the tray under the ice dispenser opening. Not sure if I would trust that the ice is clean and bacteria free. The only positive things I can say about this place is it was right on the beach, the a/c worked and the wireless internet worked wonderful but you can get these 3 things at a much better place as well and you will be happier.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“Great”", "Author": "gskissimmee", "ReviewID": "UR85456718", "Content": "Great FD staff. Penhouse was clean and stocked. Great Customer Service.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Horrible!!!!”", "Author": "lorizanni08", "ReviewID": "UR82806422", "Content": "My husband and I had planned a vacation to stay in Daytona Beach, FL and chose Oceanside Inn as our hotel. BIG MISTAKE!! We checked in put our bags in our room and went out for dinner, etc. We got back rather late, so we were ready for bed. As we were getting ready for bed I pulled the comforter down and there was a DEAD ROACH on our pillow. After noticing the DEAD ROACH I started looking around and found a trail of ANTS by our bed. We complained and all they did was change all the bedding and supposedly cleaned behind the bed, nightstands etc. Well needless to say we still had ANTs. If you walked down the hallway you would see a roach scoot across the floor. Once we checked out we asked if we could get a discount or at least a one night stay free as we were there for 3 days. We paid $125 a night for this ROACH MOTEL. The manager stated that he could only give us $20 off the amenities fee. We NEVER even used the pool. NEVER we will stay in this hotel again. THANKS FOR A HORRIBLE START TO OUR VACATION.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Baileyton, AL", "Title": "“Literally a roach motel”", "Author": "darkkan", "ReviewID": "UR82466574", "Content": "I booked this after reading glowing reviews about it online. We were on our way to Disneyworld and needed a place to stay for the night, preferably on the beach. I was able to get the room for $60 and it was supposed to \"comfortably sleep 5\". The rate was seasonal, so I thought we were getting an off season bargain. So, we get there lafter dark after passing through anything resembling a touristy part of Daytona. The businesses around it had bars on the windows and I was desparately hoping for valet parking. After unloading our own luggage and parking the car in a dark and scary parking lot, we went in to find a roach scrambling across the lobby floor. I hear someone gasp and say \"Ewww a roach!\". The desk clerk, who seemed to be irritated to even be working, goes \"It's not a roach, it's a palmetto bug\". Regardless, it was gross. Our room was tiny, cramped and the furniture was stained and old. The foldout bed to \"comfortably sleep 5\" was an extra $15 and would barely fit anywhere in the room. Because we were so far away from anything and there was no hotel restaruant, we had to order pizza for dinner. We were weary of going anywhere outside the hotel on foot at night due to the scary neighborhood. I would say to stick wtih a chain hotel 2 miles down the street and pay the extra money to be closer to something to do and a place to eat.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Not Bad For The Price!”", "Author": "ramprat61", "ReviewID": "UR79827579", "Content": "Stayed there for a week , some stuff need to be worked on , but when is free breakfast is cereal and coffee, juice and donuts, if you want a complete breakfast try a dinner a couple of bloacks away all you can eat for a very nice price. overal if you want to pay more for probably less appealing place, be my guess, I will be back here next year... beach is nice, nice salt water pool. need improving on the parking lightning. Alex", "Date": "September 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Pinellas Park, Florida", "Title": "“Not what was expected from the Internet”", "Author": "amybeth470", "ReviewID": "UR79435715", "Content": "This hotel was definitely not worth the going rate. While located in a good spot on the beach, we had nothing but problems upon check in. It took approximately 25 minutes to check in because there was a line and the front desk staff were moving in slow motion. Upon check in, I was informed of additional mandatory charges for so-called \"free internet\" and DVD rentals (regardless of whether we wanted DVDs). They also required a hold on our credit card in the amount of $25 per pool towel. For a family of 4, this meant we had $100 less to spend on our vacation. The room was in disrepair. Our \"deluxe\" room was supposed to be an upgrade from the \"standard\" room, but we came to realize that deluxe translated to a toaster in the room. The furniture was old and tacky. The door did not shut tightly and the bolt did not work at all. We were told maintenance would fix the issue while we were out, but found that after returning late in the evening, it still did not work properly and maintenance was gone for the night. We resigned to pushing a chair up against the door at night for security. We obviously did not feel safe at all. The paint on the ceiling and walls was chipped. We were moved the next night to a nicer room. This room's lock worked, but the toilet seat was loose. The parking was a small covered unit next to the hotel, parking was tight, not well-lit and not secure. The continental breakfast consisted of only two types of cold cereal, coffee, orange juice and store bought mini doughnuts. We were very disappointed with this hotel and would not recommend it to others. The quality was comparable to a Super 8, but a Super 8 would have been much cheaper.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Won't be staying here with our next trip to Daytona Beach...”", "Author": "no-ocean-manitoba", "ReviewID": "UR79292982", "Content": "The beach location is terrific but we were disappointed when we first checked into our room as it did not appear to have been vacuumed & the tables were not wiped. There was food on the table by the window and white powder was also on the floor around both chairs & on the table. There was also a huge beetle-like bug on the carpet at the foot of the bed which terrified my kids but thankfully, it was dead. The breakfast in the morning was sufficient but lacking fresh fruit or yogurt. (the man working in that area was very friendly). The hallway on our floor had areas of sand/grime which was there both days and needed to be vacuumed as well. As mentioned, the location is excellent but the concept of cleanliness does need some attention.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“HORRIBLE HORRIBLE HORRIBLE”", "Author": "beresara", "ReviewID": "UR78546013", "Content": "I've never been as disappointed with a hotel stay as I was this Labor Day weekend. To begin with, its locations is less than appealing. On the water, yes; however, it is a few miles away from the more populated area. The room was nice from the look of things, fair sized bathroom and room, but when we went to sleep on the beds the first night we quickly realized that they sagged in the middle, making it almost impossible to get comfortable, let alone fall asleep. Next morning, we were met at the hotel by my sister in law and her husband, who live in Daytona, who brought along the family dog. A small maltese whom is a big part of the family. When we were through with our relaxing beach day, we walked in through the lobby to get to the elevators ( which shake and will make any person rethink taking the stairs). There is a rude older lady who works at the front desk who tried to charge us $250 for the dog, which was not even staying with us. This lady was very unwilling to work with us and made it impossible to talk to, so we notified the manager ( who was very nice ) and fixed the situation. To wrap things up, to have your room cleaned COSTS MONEY, to get towels COSTS MONEY. their \"\"CONTINENTAL BREAKFAST\" consists of donuts, cereal, 1 juice and coffee. across from this tiny area which can seat maybe 20 hotel guests, is a \"restaurant\" where you can pay for other breakfast items. the hotel bar was not opened once while we were there. Parking is a headache. one of the nights we got home around 1130 and had to park on the corner where the dumpster is because their was nothing left. the front desk has NOOOO CONDITIONER which is almost absurd for a hotel on the beach. I would not have thought twice about staying at a motel 6 compared to this dump. with as many other hotels as their are in daytona beach, STAY SOMEWHERE ELSE !!", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sherbrooke", "Title": "“Best Place To Stay in Daytona Beach Florida”", "Author": "crash55", "ReviewID": "UR76842324", "Content": "I have been going to Daytona Beach since 1972 & stayed in alot of places varrious times of the year.From the time my daughter & I arrived, I was amazed.I called 3 days before to ask for a earlier check-in they said they would try their best.Well we got there at 1:15pm & we walked in said my name & they had our Beach Front room ready.The whole place was better than expected,the complete staff treated everyone as if you were someone very important,The whole layout is perfect,the pool great The Beach area you feel very secure,there is a lifegaurd right in front,the cabana's were very cheap but extremly good.The rooms are extra large the beds were very comfortable,We were there for 5days in that time I never heard 1 guest complain about anything.I rate this a must stay 10 plus THANK YOU OCEANSIDE Your the best & made the end of my vacation perfect", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Why so many negative reviews?”", "Author": "Margo9999", "ReviewID": "UR76487974", "Content": "C'mon, all the negative reviews? Keep in mind this is a condo hotel property...where the owners who care about their property (rooms) work with the management to keep the place nice, and management is more then willing to bend over backwards to assist those staying here. The unit we stayed in (407) had a brand new kitchenette, with white cupboards and a real countertop, nice new furniture, flat screen tv...compared this to another kitchenette room with an older set up, were told by management that this room as well as several other rooms had just been renovated...the place is clean, the pool and beach are great for the price...I don't believe some of the other reviews...", "Date": "August 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Paris", "Title": "“Hotel from Hell”", "Author": "livingthelifeParis", "ReviewID": "UR76202078", "Content": "We checked in. Paid for upgraded room on top floor. 1/3 of the carpet in the room was soaked. They told us to put down towels. We were stuck in the room that night and had several bags had become wet before we noticed the carpet. They changed our room to a regular down graded room for the same price the next day. Wi Fi only worked in our room OCCASIONALLY if you sat on the toilet. .. . .no where else. We were told it was only guaranteed in the Lobby (which is not what it says on their website). If you used THEIR computer in the lobby there was an additional $4 charge. Bed was terrible. . . .sagged in the middle. Continental breakfast consisted of donuts, cereal, juice and coffee. You had to pay for anything else. There is an additional $5.95 daily charge for amenity type things like free long distance and dvd rental. There was a poor selection of dvd's and most that we saw were scratched. That didn't make a huge difference to us because our tv didn't even work until the third day. And ...when we checked out . . .we noticed that they had also charged us $20 for long distance charges (supposed to have unlimited long distance in the $5.95 charge) and $50 for a room upgrade that we never got. We stayed here 5 nights. Several of these days our rooms were not cleaned and we even had to request soap. The only reason we didn't move was because we didn't want to have to move all of our stuff AGAIN after we had already had to switch rooms once. I heard many other guests complaining while we were there. . .. ..especially about the wi fi and wet carpet. There are lots of nice places to stay in Daytona . . . . .don't waste your money on this dump.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“BED BUGS - NEVER AGAIN!”", "Author": "brad298", "ReviewID": "UR75646732", "Content": "Stayed here for two nights. We noticed a bug crawling on the bed. After checking the bed skirt we noticed several more bed bugs. Checked out of the hotel immediately filed a complaint with Flordia's Health Department.", "Date": "August 17, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Texas", "Title": "“Horrible Bed! Old Hotel”", "Author": "swonderfull", "ReviewID": "UR73966775", "Content": "We went for a weekend trip and the rate was not bad, but gee, charge me more and give me an updated hotel. We stayed there because friends suggested the hotel. Would I stay again, probably not. Mattress was old and sunken in and sheets kept coming off.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“DUMP!!!”", "Author": "daytonabeachvisitor", "ReviewID": "UR72933566", "Content": "After I arrived and checked in the first thing I noticed was that the staff was rude as hell! When I opened the door to my room it smelled like mold and mildew. It almost knocked me back out the door it smelled so bad. Later I noticed water leaking down the wall and the carpet was wet. Reported this to the manager on duty and he simply said we are booked and I can't give you another room, soory sir. The second day one out of only two elevators broke down! which made it very time consuming to get from my floor to the ground floor or viceversa. The complimentary breakfast was a joke! Parking was a big hastle! Location was terrible! The only good thing I can say about this hotel is that it is on the beach.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Great All-around experience”", "Author": "Unctarheelz", "ReviewID": "UR72897045", "Content": "Overall the Oceanside Inn was a great hotel. The room and amenities were great. The staff provided us with everything we needed and asked for. The room was clean. The location is great, right on the beach and just minutes away from anything you would want to do at Daytona. We enjoyed the free unlimited DVD rentals. The only thing we didn't like was the \"free\" continental breakfast which consisted of cereal and doughnuts. If you expect anything hot for breakfast, expect to pay at least $3.00 extra per person. Other than that, our experience was great!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“Room was great-large bathroom-Definitly a great place for the price!!”", "Author": "swtgretchen", "ReviewID": "UR71676865", "Content": "My fiance and I ended up staying at this hotel at the last minute because our friends stayed for the weekend and we didn't want to go back home. We paid at the last minute (5pm) $100 for one night, which is pretty decent for the beach. The bathrooms were huge, the bed was very comfy, the room was very clean, and the pool was nice being salt water and open very late. **Only Dislikes**The Elevators are VERY slow AND we decided after bar hopping all night, we would get a hot breakfast and for go the continental. We ate at the little resteraunt they have across from the free breakfast (in the hotel) and it was just awful!! My fiance actually got up and walked out as to not imbarrass me and start yelling. Overall we enjoyed our stay and I actually tried to stay there again this past weekend but they were all booked up!", "Date": "July 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Eustis, Florida", "Title": "“Did not stay”", "Author": "tmstafford", "ReviewID": "UR70372961", "Content": "Booked a room in this hotel on line. Site showed completely different scenario than was here. NO BALCONY?!!? Service staff was rude! We went to our room and it was not what we wanted and they charged us for a night anyway -- we had only been here a half hour. Really not a good experience and it is not for those who are looking to enjoy the beach, the view and a comfortable room. Beware of websites, they often don't tell the whole story.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Worse Daytona Vacation ever”", "Author": "ahadizadeh", "ReviewID": "UR69881425", "Content": "Worse Daytona Vacation EVER If the there was a negative star I would have used instead. Where shall I begin? First of all this must be the only hotel in the entire Daytona Beach that doesn’t have balcony. Trust me if you are traveling to a beach you would appreciate having a balcony. Second the condensation from air conditioner in our instead of flowing outside kept leaking on the carpet inside and the entire room floor was soaked. I tried notifying the hotel service. They told me nothing they can do and it’s like this when it rains. So beside smelly and wet carpet room the hotel service doesn’t care who from the street uses their facilities. We noticed that people who drive on the beach and park in front of the hotel walk up to the hotel and use the showers and restrooms and even the swimming pool. I don’t have any problem with sharing but when I have to stay in like forever so I can use the services that I paid for it makes me upset. Also the hotel has 9 floors and one of the elevators was broken the entire time so imagine constantly waiting for an elevator. The pool rules are simple, no personal coolers, no smoking, and there use to be pool hours. Well what we saw was people bringing their own personal cools by the pool and smoking, Between the smell of alcohol and cigarette smoke you cannot enjoy the pool side. Over all this was not a good Daytona experience for us and we do come to Daytona every forth. I would never ever stay at this location.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ocala, Florida", "Title": "“DO NOT STAY HERE!!!! Dirty & unkept. NEVER AGAIN”", "Author": "awsumgator", "ReviewID": "UR69802754", "Content": "I was sooo dissappointed. **No Balconies**A/C didn't get cold & VERY noisy,**Kitchen was a mini fridge, broken coffeepot, microwave. Plates and cups. **NO WIFI !! I tried for 3 days and could never get on, called front desk many times, they even reset router to no avail.**HALLS smelled of smoke, the carpet was filthy. **Bathroom had some unknown dried spots of something on the walls.**TV remote didn't work, they \"reprogrammed\"it, then it soon went out and the 2nd one soon went out also. It was horrible. We left a day early. There are so many much NICER hotels on the strip (Perry's, Tropical Winds, Coral Beach, Islander.) The board walk was 3 mi. away but saw beautiful fireworks from pier and from race track.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hawthorne, Florida", "Title": "“great cccomodations and service”", "Author": "charley1942", "ReviewID": "UR69787723", "Content": "The motel in general was great and so were the staff. the only negative was a lighting problem in one of the elevators which caused a backup in getting to the rooms.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Williston, Florida", "Title": "“Everything you would need in a hotel, but without the big price”", "Author": "jheckmann", "ReviewID": "UR68119941", "Content": "We got a great deal on this hotel for the weekend. From the outside it does not look as great as some of the neighboring hotels, but on the inside it is very nice. The rooms themselves aren't real modern, but are nice. We had two double beds and they were comfy. You get a DVD player to watch movies on, and there is a DVD rental box in the lobby. There was a mini fridge and there is a small kitchen, along with plates, cups, and utensils. The rooftop garden is actually on the 2nd floor, but it gave a safe place for our 16 month old to run around under our supervision. There is also a place to lay out up there, so my 16 year old daughter and I got some sun up there. The pool is right down by the outdoor bar, which provides food and drinks from noon. The beach area was not too crowded out in front, which I was glad of, especially with a little one. For breakfast, there is a complementary breakfast in one room, but if you want a full breakfast, there is a small dining area across the hall. Overall, we had a great time and enjoyed ourselves. We will return to this hotel again.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cartersville, Georgia", "Title": "“OK stay”", "Author": "gfree123", "ReviewID": "UR67697457", "Content": "We travelled with my two young children (7 & 3). The hotel was just ok. We really liked the large salt water pool, and being on the beach. We also liked the idea of having a DVD player and a DVD dispenser (much like RedBox) where you could get different movies. Unfortunately, our playerdidn't work too well, but maintenance came the next day and fixed it. The beds were pretty hard and uncomfortable, and only had 2 full size beds, instead of queen size. The continental breakfast was only adequate. They had raisen bran, plain Cheerios and doughnuts every day. They did have breakfast that you could buy for fairly reasonable rates. The towel rack in the bathroom kept falling off the wall everytime you got a towel off of it (and don't tell me they weren't aware, because the housekeeping kept putting it back together and hanging towels on it), so that was aggravating. All in all, the best part about the hotel was the pool and being on the beach, and we probably would not stay there again.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Trinity, Alabama", "Title": "“GREAT EXPERIENCE”", "Author": "FoxeyLemon", "ReviewID": "UR67621586", "Content": "We stayed at the Oceanside Inn for 10 days. We had a few legitimate issues with our room but Robert, in maintenance, bent over backwards to get us a new room. He was caring and made sure with the front desk that we were moved to another room. The front desk was very accommodating also. Housekeeping was great. We slept late everyday so left a \"Do Not Disturb\" sign on our door. But if we called before 2:00 pm, they would come clean our room. We always had plenty of towels and each time and always left us shampoo and soap. They left our room very clean. John, the General Manager, took time out of his day and talked with us about surrounding Daytona as we had questions about fishing charters, etc. We didn't partake of the continental breakfast since it was just donuts and two selections of cereal (not on my diet) but breakfast was available for a very nominal free. The outside area of the Inn was very beautiful and someone was always working inside and out to make it beautiful. This was an excellent place to stay and was also glad it had covered parking without a charge. Would recommend to everyone and I can't imagine having a complaint, especially how eager the staff was to make it right!", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johnson City, Tennessee", "Title": "“The hotel was very clean and great price.”", "Author": "r0ss81", "ReviewID": "UR66851848", "Content": "We had a great stay. The rooms were very clean. The kids loved the free movie rental. I would stay here again.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Excellent hotel right on the beach!”", "Author": "inkedtc", "ReviewID": "UR65709210", "Content": "Me and my boyfriend stayed at the Oceanside Inn on Daytona Beach for our anniversary weekend. Our experience there was excellent. We chose this hotel because it is on the beach and allowed guests 18+ to check in. The rates were very affordable compared to the other broken-down motels and filthy hotels in the area. The rooms are super clean. The bathrooms were immaculate. We were very surprised at how clean the bathrooms were since everything is white. All the linens and towels were clean with no signs of prior usage. All appliances and cooking utensils in the room are clean. I want to give a compliment to LORETTA from the housekeeping department for being so hospitable and friendly when we asked for towels. They do have a $25 pool towel deposit per towel when you check in. The $25 are refunded back to you when you check-out and bring the towels back. I don't suggest taking pool towels at check-in since there are plenty of towels in the room, or you could always bring you own towel. The service is great. We came across the General Manager, Scott Hendrix, a few times while we was there. He is very active at the hotel which is ALWAYS a good thing. Both, check-in and check-out, were quick and stress free. There is a DVD rental machine in the lobby were guests are allowed UNLIMITED DVD rentals complimentary of the hotel. Lobby area is very clean and quiet. Agents at the front desk are professional and friendly. Seemed a bit understaffed but they managed to take care of all guests in a timely manner. WIFI is also available in all guest rooms free of charge so that was a plus. Another great addition is the parking garage. Keeps cars safe from rain and blowing sand from the ocean. As for guest safety, all outside doors are locked after 10pm and need a room key to enter the building. The food at the tiki bar was very good and affordable. We did not have the complimentary breakfast. It is a continental breakfast offered from 7am - 1030am. Best part about the hotel is that it is right on the beach. We had an oceanfront view room and it was amazing. Pool is overlooking the beach as well. Pool is open till about midnight and it is heated. It is walking distance from the boardwalk and oceanwalk village. A few restaurants nearby and a grocery store nearby as well. In conclusion, I would definetly stay at the Oceanside Inn again whenever I head up to Daytona. Thanks again to Loretta and all the other employees that made our anniversary stay at the Oceanside a great experience!", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sullivan County, NY", "Title": "“Great value for your money, superb staff”", "Author": "jamesedunn", "ReviewID": "UR65389676", "Content": "Nice motel, good value for your money. Wish it had an indoor pool, and the outside pool open until 10:00.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Suwanee, Georgia", "Title": "“A hotel on the beach with value added.”", "Author": "QRPster", "ReviewID": "UR64383686", "Content": "For this review, the booked rate of $69.00 + taxes & fees = 84.13 / night. At the above rate, my pre-arrival expectation was much lower than what was actually experienced. The hotel lobby & common areas were clean, the staff very helpful and very friendly. The rooms were adequate...(double room adequate for 2 adults, or 2 A +2 small kids) and clean. The air conditioner, although keeping the room nice and cool, was a little more noisy than normal. The bathroom was clean & with plenty of towels, however, the tub obviously had a fiberglass insert which gave under foot and took a little getting used to. The shower curtain was a little worn & tattered. The free continental breakfast was a plus, and for those needing a little more, a small in-house restaurant offering cooked to order breakfast at very reasonable prices. A hotel on Daytona Shores beach, of this caliber, for under $100.00, I certainly don’t hesitate giving it a thumbs-up recommendation. Say “hi” to Tracy at the front desk.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Relaxing”", "Author": "72042", "ReviewID": "UR64311970", "Content": "From my first call for reservations the service was excellent and due to a family emergency we had to change our date or arrival at the last minute and we were able to give them just one day notice before our arrival that was supposed to be a week later. The managers, the staff and everyone we came in contact with were so accomodating and helpful. The grounds were kept immaculate and the beach was just beautiful. There are lots of wonderful places to dine or just have a relaxed dinner. Lots to do and see within a short distance of Oceanside. We will definitely return at a later time. We live in Jacksonville, Florida (35 years) but never stayed on Daytona Beach. It was a really nice experience - TRY IT - YOU'LL LIKE IT!!!!", "Date": "May 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "BUFFALO GROVE IL", "Title": "“Get what you pay for!”", "Author": "SAJ9291113", "ReviewID": "UR63071145", "Content": "I've never been to Daytona Beach before and didn't do any of the family \"research\" for this leg of our trip, so I didn't know what we were getting. First, the location from Atlantic Ave is in the rundown area of town, you have to drive(too far to walk with small children) to the pier or to the main shopping areas. BUT the location on the beach was great; right on the beach without having to deal with the larger resorts number of guests. Second, the hotel appears to have a couple of decades under it's belt and looks to have gone thru a couple of different eras, with it trying to upgrade currently. When walking to hallways to the rooms it looks like a dive, but when we entered our room it was very nice, and clean. Nothing under the bed or smells like other have said on this website. The rooms have 'beach view' if you consider it from the side of the hotel, but the price is great for what you get. Finally, we booked two double beds for our party of 2 adults and 2 children, but when we got there the hotel said that they couldn't fulfill that request because there was a JROTC drill team competition in town and all their doubles were sold out, so they gave us a king with two roll-aways. I would recommend this hotel for someone who is going to Daytona Beach to be on the beach, but if you are going to go for the shopping or posh resorts, move on down the road.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wildwood, Florida", "Title": "“Don't Even Think About It!”", "Author": "Rinsey", "ReviewID": "UR62671290", "Content": "The check-in was fine and the staff was nice, but iwas totally disappointed with the room. There was a smell in the room, If you wanted pool towels there was a $25.00 deposit on top of the $50.00 holding fee (we went a bought towels for less than that). Then there was this sign posted, in a nice way, asking that you use the towels in your room more than once(we had to ask for more towels), the beds were uncomfortable.The pool didn't look so clean, but the acces to the beach was great.The elevators sounded as if we were going to be stuck in them at any minute. I would not visit this hotel again.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "McDonough, Georgia", "Title": "“GM involved in day to day operations”", "Author": "steve4608", "ReviewID": "UR62422534", "Content": "Arrived on a Thursday and checked in around 7PM, the night clerk put us in a room that technically was an ocean view as if you strained you got a glimpse of the beach. Night clerk said the hotel was booked and that was the only room unless I upgraded for a fee of course. Wanting to give my daughter a well needed R&R - so - I upgraded instead of arguing. Over the next couple of days I got to know the GM (Mr. Dion) as he is engaged with the day to day operations as well as interacting with the guests. On one occasion I related my check in experience which he listened and acted on. He called up to the room and said the upgrade was on him and \"it is the right thing to do\" He wanted to assure that my daughter had a good R&R. The facility is well maintained and does not show its true age. The room was comfortable and clean with good daily house keeping. The pool area is nice to lounge around and read by. Access to the beach is good and Daytona keeps the beach nice and clean. This is a good family hotel for both young and old.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lexington, South Carolina", "Title": "“Enjoyed The Stay”", "Author": "boldingc1", "ReviewID": "UR61906058", "Content": "The hotel staff was very nice. The room was decent and we got what we paid for. For the price I don't think you could ask for any better. I would recommend this hotel to anyone who is not high maintenance and looking for a luxurious resort.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "jacksonville, fl", "Title": "“It have been better!”", "Author": "rtcarter55", "ReviewID": "UR61087685", "Content": "Our stay could have been better if the manager Scott ran the place with much concerns of the visitors stay. I called 3 times the week of when I was going to arrive and ask question are there any additional fees that I would need to pay and I spoke with Scott and both times he told me no. Well that was a lie when I arrive on 4/9/10 and had to pay $50 hold and $5.95 per day. Had I known that in advance i would have use cash, but it really inconvient me and my husband of the extra funds. We had trouble with the TV and watching movies, I reported that and they claim they fix it but it was not. I reported in 2 more times and that did no good at all. Than I wanted clean sheets and towels the next day, the towels I recieved but not the sheets. Scott said they dont change the sheets, so I guess they did not change them before we came and probably after we left. When I made the reservataion and also spoke with Scott i requested a king bed, microwave, ice box, dvd player and did it have a bacony. When we arrive I recieved it all except the bacony, so I was very disappointed that put a damper on my weekend. The room was face the ocean, but it was not the same. another issue was the smell when we arrive it was horrible, I started gagging when I got in the room, so we had to leave to go and get some cleaning products and air freshner. also when we was leaving Jennifer and Glenda was very help in checking us out I asked for a receipt for the $50 showing that it will be deposit back, scott comes out and said she does not need that. But the ladies gave it to me anyway. What gave him the right to make such a statement. So over all the serives with Scott was not good at all and at the hotel. So this would be a place I will not recommend to anyone or stay here again. Out of all the places I have stayed this was the worse one.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "wisconsin", "Title": "“This was a family getaway, the location...”", "Author": "winterchic88", "ReviewID": "UR60631014", "Content": "This was a family getaway, the location was great!! My family had a great time!! I will return", "Date": "April 7, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Franklin, Indiana", "Title": "“Very Nice!”", "Author": "DougFranklin_Indiana", "ReviewID": "UR60629270", "Content": "The front staff was awesome. Very clean! Right on beach. A lot nicer than the mom and pop operations on the beach for not much more $. IHOP has a good coupon that will save you a lot of money.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kentucky", "Title": "“A fine experience.”", "Author": "kytraveler_10", "ReviewID": "UR60476580", "Content": "I found the hotel better even than advertised. Though on the beach, the sand problem was minimal. Everything was clean, and maid service was regular. The free DVD's were nice, and the hotel is located within easy driving distance of all major attractions. Plus, it is far enough away from the 'party hotels' so that a quiet stay is possible, if desired. And you can't beat waking up to a beautiful sunrise over the beach. You'll have a hard time beating this hotel for the price. The only (slight) disappointment was the surprisingly small fitness room.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ocala, FL", "Title": "“Fluffy Pillows, thick towels, and a comfy bed”", "Author": "Ocala_FLDiana", "ReviewID": "UR60007382", "Content": "I thoroughly enjoyed my visit. Great room for the price. Would have liked a balcony, but everything else was perfect. I visit Daytona often and will definately return to this hotel.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "thousand Islands, Ontario", "Title": "“Very clean hotel and friendly staff”", "Author": "Razer10", "ReviewID": "UR59535175", "Content": "During our stay at Oceanside for 3 weeks in Feb 2010, we found the rooms clean, comfortable and affordable.The hotel and grounds were kept clean every day by friendly staff. The restaurant food was very good, we would like to thank Hotel manager, Mr. James Dion and staff for the great service and hospitality during our stay, \" WE'LL BE BACK\" ! Ray Harmer, Thousand Islands, Ontario, Canada", "Date": "March 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Not as advertised”", "Author": "Joemama007", "ReviewID": "UR59359088", "Content": "The whole hotel is outdated and the beds are horrible. Hotel fees where unexpected and unwarranted. The 'Complimentary Breakfast' consisted of cold cereal, a pastry and coffee and juice. Conveniently, across the hall is the restaurant with real food. Also, we had to leave a hefty deposit for a pool towel. In my opinion, this hotel is strictly for spring breakers.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Delightful surprise! I will definitely stay there again!”", "Author": "Wandergirl76", "ReviewID": "UR59342350", "Content": "The Oceanside Inn was a delightful surprise. Daytona is not know for it's outstanding hotels, but Oceanside Inn was perfect. It was exceptionally clean, the staff was courteous, friendly and helpful, the room was impeccable, as well as comfortable. To top it off, there is free parking, daily continental breakfast and free DVD rentals for the length of your stay! All of this was for an amazingly low price. Don't miss this!", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "upstate New York", "Title": "“A bargain!”", "Author": "tiki44", "ReviewID": "UR50743587", "Content": "Our room was large, clean and well fitted with a microwave, refrigerator and even dishes and silverware. It was nice to have the ocean right outside the hotel's back door and to have a sufficient continental breakfast at our disposal each morning. I don't think you could ask for anything more for the $69 we paid per night and I wouldn't hesitate to stay at the Oceanside again or to suggest it to friends. I am sure there are more luxurious sites in the area, but not for the price. This is, by the way, largely a condo hotel where the rooms actually belong to someone and are rented out on a space available arrangement.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Oyster Bay, New York", "Title": "“clean hotel, but decor dates back to 70's, needs modernization”", "Author": "getmarshall", "ReviewID": "UR50453238", "Content": "Stayed at the hotel through a timeshare presentation. Was a bit disappointed, the hotel is a far stretch from what could be called the center of Daytona Beach. The area around the hotel is a bit depressed and there is not much within walking distance. The lobby area is decent, the pool area is just ok nothing spectacular. The rooms are very dated and old. The rooms were clean, beds were just ok, nothing spectacular. We did get upgraded to an oceanfront room, but the windows don't open so no way to let the ocean air in, which was disappointing. The continental breakfast is disappointing and should be skipped all together. The hotel staff though was very attentive and nice. Can't say that I would return to this hotel.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Long Beach, CA", "Title": "“Pleasantly Suprised.”", "Author": "JayLewis", "ReviewID": "UR50009565", "Content": "On occasion, my wife and I have taken advantage of the 2 night 3 day stays available for listening to a 90 minute spiel about buying timeshares. Normally the places they put us up in are dumps (in order to show how much better their condos are), but it's worth it in order to travel when we normally couldn't afford to, since we don't spend much time in the room anyway. As we were looking for the Oceanside Inn, we knew it couldn't be on the ocean side of the road, but it was. We knew it would be small and dirty (or large and rundown), but it wasn't. We knew that there would be no view of the ocean, but there was - from every room. What's this? A FULL kitchen in the room, including plates, glasses and silverware? Don't they know that we aren't going to buy a timeshare? How could they make the mistake of letting us stay in such a nice place. We won't ever go back to hear the same spiel again, but if ever in Daytona Beach, we know where to stay!", "Date": "November 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "S Florida", "Title": "“THE WORST!!”", "Author": "NeilSFlorida", "ReviewID": "UR47262252", "Content": "This hotel should have been on the side of a highway and rent by the hour. The location was good, right on the beach, but that is where it stops. The lobby was run down, and the bed was old and had a large sway in it. The middle was 6 inches lower than the edge! That being said, these things could be dealt with, but the roar of the jet engine (air conditioner) was unbearable. I called to switch rooms, but the person at the front desk could not help. He stated that they were sold out. He sent up the maintenence guy who was nice, but could not fix the issue. I left a day early and went to a different hotel...without a refund.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "ft lauderdale fl", "Title": "“we liked this place”", "Author": "marierika", "ReviewID": "UR43819716", "Content": "we stayed 2 nights. it is a very nice place to stay, for an extra $20 you get ocean view. The hotel is closed to the main street and the main shops around, if you want to visit the light house is within a 15 min drive. Continental breakfast is just enough, we did the buffet the first day and it was not too good, my husband liked it, but he was really hungry. they also offer free dvd rental, free coffee 24 hrs and wi-fi in the room for an extra $5. overall, Oceanside is a good place to stay, we though it was gonna be worst because we did the presentation w/ summet bay, the presentation was actually very entartaining, not a waste of time at all, because at 12 am, was very hot outside, and they also gave a gift card to eat in a very nice restaurant, called fresh...the food was excellent!! we a great time there and the gift card helped a lot, the bill was $100 total, but we pay $60, for 4 people. i recommend the hotel and the dinner at fresh.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "west palm beach", "Title": "“not worth the money”", "Author": "boysmomwellington", "ReviewID": "UR41423054", "Content": "We were very disappointed with this hotel. First of all- Ocean view for this hotel means that you are facing the street and if you turn your head just right at the right time of day and at the precise moment- you may see a sliver of beach. There were ants in the bathroom and bedroom, it was very old with smudges on the wall. The couch inside the room was \"crunchy\" when you sat on it. The glass table in front of the couch was greasy and looked like it had not been cleaned. The \"complimentary\" continental breakfast that begins at 7 am was gone by 8 when we got downstairs- the only other option was an $8.00 per person hot breakfast that really did not look appetizing. The outside Tiki bar did not serve frozen drinks and you could not charge anything to the room. This overnight stay cost us about 250 dollars and certainly NOT worth it! Don't get duped the pics online are probably pretty old. NEVER AGAIN", "Date": "September 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "tampa", "Title": "“a great place to stay”", "Author": "megpit", "ReviewID": "UR37608312", "Content": "We are currently on our fourth trip to the Oceanside Inn. We love it. We always stay in room 413 which is oceanfront and much larger than the normal rooms. It has a whole wall of windows with a great ocean view, a little living room, a king bed and a double bed and a small kitchenette. No, it doesn't have a balcony but who cares! It was two windows that open up and you can hear the ocean without any problem. The hotel is very quiet and a great place to relax. The pool is wonderful and has a small tiki bar and grassy areas surrounding it which are always kept up beautifully. There are chairs in the grass overlooking the ocean and picnic tables too. I've read several bad reviews and have no idea what these people are talking about. The halls are somewhat dark but have no smells, the continental breakfast is just that, continental, danish and juice and coffee/tea. Really, why the complaining, I've stayed in many more expensive places that offer no breakfast! I would really recommend this hotel it is quiet yet still fun.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Rochester, NY", "Title": "“Not bad at all”", "Author": "debmags", "ReviewID": "UR34038645", "Content": "I too stayed at the Oceanside Inn through a Summer Bay Resort package. I stayed in room 520 and was pleasantly surprised. I was expecting to find a dump and found a decent place. Our room was clean and had a refrigerator, sink, microwave oven, coffee make and toaster. the grounds were kept up and I enjoyed the pool. A continental breakfast consists of Danish, coffee and juice so I didn't expect more than that, however they only put out about 10-12 small Danish at a time and when there are a lot of people waiting you end up only taking one. I had to sit through a presentation by Florida Sports and Recreation which is a joke, I can get the same prices that they claim they can. Dinner at Julians ( prime rib is excellent ) is awesome.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "The Villages, Florida", "Title": "“mostly better upgrades except for breakfast”", "Author": "bobfitz1414", "ReviewID": "UR31517726", "Content": "The changes to the hotel have been mostly for the better. The $5.99 mandatory charge for services not wanted or used can be accepted but the reduction of the free continental breakfast to coffee, juice and a couple of danish leaves a lot to be desired. The paid ($8.00) breakfast was very poor and places a libility on its reputation. In the past I go to this hotelevery four to six weeks and think I will go back, hopefully the management will reconsider the breakfast. Other than that the cleanliness, refurbished furniture maintenance and painting are a big plus", "Date": "June 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "columbus, ohio", "Title": "“Stinky stinky stinky”", "Author": "abby1123", "ReviewID": "UR31156035", "Content": "Stayed at Oceanside over Memorial Day weekend. The first thing I noticed that I cannot forget is the smell. Mildew mixed with cat pee. It was pretty gross--so bad you didn't want to take your shoes off in the room. Other than that the room was ok. One thing that i thought was weird was upon checkin we were given a list of things in the room. We were asked to go through the room and list if there were any tears in the linens, holes in the walls, broken appliances, etc. We went over our room with a fine toothed comb so as to avoid being charged for anything we didn't break. This was fine and we got our full deposit back. One thing that was positive was our flight came in really early so we got to the hotel around 10:30, checkin was at 4. We thought we would go sit on the beach but it was rainy. They got us into our room right away, no problem, and with no additional charge. That's was awesome. The continental breakfast is a joke. Juice and danishes. The danishes were gross, coffee was pretty bad too. The beach is ok. BRING YOUR OWN BEACH TOWEL. The towels they provide for the pool/beach are tiny=pointless. This hotel is pretty far from everything. To get to Mai Tai bar was $11 with tip. The cabs in Daytona automatically start at $5.20, so you pay about an extra 5 bucks for any cab ride. We were able to walk to Ocean Dec from the hotel, took about 25 minutes.", "Date": "May 30, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "moreno0041", "Title": "“I would never stay here”", "Author": "moreno0041", "ReviewID": "UR31033003", "Content": "I was sent to Oceanside Inn by Summerbay Resorts after being at their resort in Orlando, FL. By the way the Orlando resort is beautiful! However, I was very disappointed when I was sent to the Oceanside Inn in Daytona Beach, FL. The hotel looked okay from the lobby but once I went to floor 9 where our room was I was slapped in the face with the smell of mildew as I got off the elevator. Once I entered the room the view was beautiful but everything else was horrible. the bed linens were damp, the chairs were dirty, and the room had the same old mold like smell. The pool which isn't heated as advertised was dirty looking. I looked around for 5 minutes then checked out. There was no way I was staying there with my kids. I would never recommend this hotel to anyone. If Summerbay Resorts tries to send you to this hotel please refuse!", "Date": "May 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Clinthimself", "Title": "“Not as advertised”", "Author": "Clinthimself", "ReviewID": "UR30601390", "Content": "This place isn't too bad, but definitely not as advertised. No balconies at all and the swimming pool is not heated. Also at check in, there is a $250.00 deposit if your not at least 25. The general manager checked us in and then told us about the deposit. We had called the day before for reservations and nothing was ever said of a 250 deposit under 25. We asked the general manager why balconies were advertised online, and he said it did not. He eventually went in his office, checked the site, came back to the desk and apologized for the inconvenience. He did not mention the deposit again and said that the add would be fixed by that afternoon. I wouldn't want to stay here again. And i don't know about all the floors, but the fifth floor stinks like mold!", "Date": "May 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Kansas", "Title": "“Terrible - Don't stay here”", "Author": "HonestandSincere", "ReviewID": "UR26689837", "Content": "Worst experience we have had with customer service. Front desk lady \"and I have used that term very loosely\" was the most rude and obnoxious person encountered in a while. They also scammed us out of $25.00 for a broken ironing board. We are guys so never touched the ironing board . When we asked for the manager, we were informed that it was in our contract and we should have checked it when we checked in and reported that it would not open from the wall. Front desk was terrible (same lady) when we arrived informed us that if beer was found in our room, we would be asked to leave. Paid in advance, no refund, or would have left. Not worth the price, nothing fancy.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“You get what you pay for and it was ok”", "Author": "kwoolr", "ReviewID": "UR26259160", "Content": "I think for a family with kids this is excellent. It does not have balconies... Just a big plate glass windows ( you can open a window at the top) It has like 1980s color and styling in the room..lots of shell pictures and a little fridge and microwave. We paid 88 a night at the height of spring break...which is really decent fo the time of year we went. It has really good security and you have to have a key to get in after night. The free continental breakfast was ok but for 8 for adults and 5 for kids you can have a real nice hot buffett.The bathrooms are really big and all in all for the money..its really an ok place. The housekeeper was really nice and all the staff is very kind...Its an ok hotel and a heck of alot quieter and cleaner than alot of Daytona Hotels. Its got a nice kiddie pool and like a dated tiki bar.. but the beach was super clean. I didnt see anywhere close to rent things but about hotels down there were rentals", "Date": "March 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Yakima, WA", "Title": "“Great stay, excellent staff”", "Author": "deeharleygal", "ReviewID": "UR25823975", "Content": "We stayed at the Oceanside Inn for part of Bike Week. There were five of us and after reading some of the reviews I wasn't sure this would be the place to stay, but I can say we were not disappointed. The room we had was on the first floor down the hall from the buffet area. We had a one bedroom efficency and it was perfect. 6 people would have no trouble staying in this room, I believe it was room 101. When you walk in the door, you walk into the bedroom with 2 double beds and a very large double closet and dresser with TV, then go into another door and there is a efficenty kitchen with refrigerator, apartment sized stove, microwave and all the essentials needed if you wanted to cook in the room. There is a dining table, couch, loveseat and chair with ottoman, along with a large desk, TV and another dresser. The furniture in this room must have been fairly new as we slept on the hideabed and found it quite comforable. Our traveling companions said that the beds in the bedroom were okay, a bit small since they were doubles and probably new mattresses are in order. But we were quite satisified with the size of the room and the cost was quite resonable even though it was bike week. Maid service was great, towels where large white a fluffy. We never did get a hot shower, but the water was warm and that was okay, since the weather was warm. We did not complain about the hot water, and probably should have, but we were having so much fun it didn't dawn on us to even complain. By the way our room had a large window and door that lead out to the pool area and a beautiful view of the ocean and beach. This room was also very quite even for bike week. Not sure what the noise would be like during the summer around the pool, since we never really saw anyone using the pool, everyone was out enjoying the rally and great weather. Even though we rented a car, we had a couple friends who rode their Harley's down. They had specific covered parking for the bikes and if we could get the car in the same lot we did that too. All in all great hotel and if you can get a room 101 you will not be disappointed. This hotel went out of their way for the bikers staying there,", "Date": "March 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "richmond", "Title": "“Terrible”", "Author": "pooh_9", "ReviewID": "UR24791298", "Content": "The hotel rooms were very oldfashioned and the pool and bar looked nothing like they'd shown in pictures...!!!Piece of advice..never leave any of ur valuables unlocked even if the room is on do not disturb mode...'U DON\"T WANNA LOOSE IT!!!' Because me loosing all my cash in the wallet (when it had kept in the hotel room!!!!) was just a cherry on the top my oceanside inn hotel experience!!!...I will suggest u guys to look out for other options and NOT to prefer staying here!!!", "Date": "February 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Tampa", "Title": "“will look for a better place in the same $$ range”", "Author": "jocker24", "ReviewID": "UR19715086", "Content": "After reading your comments, we decided to book the Oceanside Inn ($69/night)and spend Labor Day weekend in Daytona Beach. Here are our comments: Pros: - large room and bathroom - kitchenette - free continental breakfast - no parking fee - free WiFi Internet Cons: - all rooms are w/o balcony - most of the rooms(at least 75%) are not oceanfront view - hotel and rooms were smelly - room was outdated - tiki bar (good try) - $1/day add charge for safe deposit box - a very long walk to the Pier :} We are not picky when it comes where to stay. Most of our time we are outside, looking what to do next. But, if we have a chance to chose in the same price range, why not?! After cruising around, we saw better places advertised for this price. Next time we go there, we should do a better search for a place where they have an oceanside room with balcony, closer to the Pier and more entertainments in/around the hotel. Have fun!", "Date": "September 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Customer service was great”", "Author": "bigje7373", "ReviewID": "UR19665520", "Content": "The customer service in all areas was excellent. The problem came when we went to bed. The bed was terrible and sagged in the middle. The maintenance men changed it out for another one but it did the same thing. It was a horrible night. ALSO--no balcony so there was no reason to have paid for an ocean front room. After one night we decided we had enough and the front desk was nice enough to refund me for the one night. What I found out about this place is that the rooms are individually owned so the management can't replace the furniture (beds) when there is a problem. The owners have to do that. Makes me not ever want to go to another hotel where individuals own the rooms. On a good note--the rooms were clean and large.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "orlando, Fl", "Title": "“Great week-ends @ Oceanside Inn”", "Author": "mahalo", "ReviewID": "UR19448683", "Content": "We have stayed @ the Oceanside Inn for the past five week-ends. Staff are excellent! Glenda and Felica @ front desk are great. Property is extremely clean and comfortable. Room attendants Kim,Shavon and Ara are all so accommodating. Thanks to Oceanside Inn staff and see you this week-end", "Date": "August 27, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Honolulu, HI", "Title": "“Nice Big Rooms with Nice Big Windows”", "Author": "calebswife", "ReviewID": "UR19284292", "Content": "We enjoyed our stay at the Oceanside Inn. The location was great, the room was bigger than expected, and free breakfast consisted of danishes, bagels, toast, oatmeal, grits, cereal-- not much, but it comes with the hotel stay. It was also a surprise to see a mini kitchenette in the room for the price we paid. We were here during Tropical Storm Fay and we experienced a blackout for a little while. It's was surprising that the hotel did not have a generator nor did they pass out flashlights. The hotel is right on the beach, but most of the hotels in Daytona Beach are. I agree that the bathroom sink did not have much counterspace, but there was lots of space everywhere else. All in all, a good stay. Breakfast could have been better.", "Date": "August 23, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Arizona", "Title": "“Awsome staff!”", "Author": "Like2Stay", "ReviewID": "UR18242870", "Content": "Nick was very helpful! One thing I can say... is for the money what a great place. Yea, there are issues.. our reservation was messed up.. but the curtesy of the staff in helping us resove our issues was immaculate. We made due... And the night guy.. I think his name was Stephen? What a great guy! Super nice and accommodating. Overall, I love this place.. not the Hilton, but I didn't expect that for the price I paid.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Duluth, MN", "Title": "“What a great place!”", "Author": "rolffure", "ReviewID": "UR17696271", "Content": "My wife and I went to Daytona Beach for the first time with our 2 sons-21 years old and 12 years old. We were there for 3 nights and four days and loved every moment of it. Staff was excellent, the rooms great-we were in an ocean view room. (Had fun watching people getting stuck on the beach!) My kids enjoyed the pool, I think its great that it you look out at the ocean as you sit by the pool. Overall we certainly would stay there again.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“Okay, but 5th floor smells nasty”", "Author": "Yanay", "ReviewID": "UR17374167", "Content": "We have just returned from Oceanside Inn in Daytona Beach, Florida. It wasn't the worst thing on earth, but not the best either. To begin with, the hotel staff were nice, I only dealt with the front desk people. The only horrible thing about this hotel in the 5th floor atleast was the smell of it. I wasn't sure if it was the smell of people smoking or the carpet... ewww horrible! other than that the restroom was pretty clean when we came in, and the beds were a little itchy. The breakfast menu I did not attend so I don't know. Like I mentioned above it wasn't the best thing, but it was a sacrifice because they stuck us there with a hotel package.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "FL", "Title": "“Excellent hotel for wedding guests and rehearsal party!!!”", "Author": "momallstar2", "ReviewID": "UR16439509", "Content": "Guests for my son's wedding (at least 22 rooms were reserved)stayed at Oceanside Inn and thoroughly enjoyed it - beautiful ocean views, large swimming pool, great customer service. We held a catered wedding rehearsal dinner there in the conference room and the hotel staff were attentive, professional and accomodating. Great for families! Plenty of parking. I would highly recommend the hotel for travelers - great vacation stay at a great price!", "Date": "May 27, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Kentucky", "Title": "“A++++++++”", "Author": "kygayle", "ReviewID": "UR15733350", "Content": "My husband and I were walk in customers. we were greeted by a friendly, competent desk clerk. we stayed 5 nights. Our room was very large and perfectly clean. Housekeeping personnel were friendly. Our only complaint was that there was no balcony, but our ocean front room had a huge window covering the whole ocean view end of the room. We would gladly stay there again", "Date": "May 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Nice gateway”", "Author": "1ucy", "ReviewID": "UR14639371", "Content": "I stayed only for one night in a suite at the 9nt floor. Check in was fast, courteous and helpfull. View was beautiful and the room was nice and clean for a 3 star hotel. Breakfast was great and included. My only deception was the soundproofing. Our room neighbors was noisy (I assumed they're teenagers on spring break...) but somebody advised them at 23h15, so they stopped.... until 3h am! And woke me up. But the problem was fix again by the head porter. The pool was too cold for a heat pool, but the beach was very nice. Overall I enjoy my stay and recommend this hotel.", "Date": "March 29, 2008"}, {"Ratings": {"Check in / front desk": "2", "Overall": "1.0", "Location": "2", "Value": "1"}, "AuthorLocation": "Vancouver", "Title": "“Left as soon as we could! 1-800-RUN”", "Author": "DebVancouver", "ReviewID": "UR14556599", "Content": "We booked into the Oceanside Inn for 3 nights but left in the morning. The staff offered for us to stay in another room but we opted to find something that did not have ants crawling on the food that was on the floor. It was not super cheap at close to 200 a night (Spring Break) and if there was zero's in the ratings that is what I would give. Our daughter lost part of her toy and when looking under the bed for it we found popcorn, cheerios, grapes, gummie bears and ants crawling on peanuts. Food also on the window ledges, and throughout the room. The staff did not argue when we cancelled the following two nights and left. The website makes it look A LOT better than it is. Must be original photos from many years ago or the webmaster deserves a gold medal for making their site look so good! Did not want to eat breakfast after seeing the bugs in our room. Could not see much out of the windows as it did not look like they had been washed in quite a while. Also I agree with the smell in the outdated lobby. Will never stay there again!", "Date": "March 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Great for a budget”", "Author": "stryder06", "ReviewID": "UR12494994", "Content": "Ok. My girlfriend and I are under 21 years old so it is very difficult for us to get a hotel room due to other people my age going to a nice hotel and distroying and disturbing everyone there. So, we booked the Oceanside Inn because we could check in there. The hotel is pretty gloomy when you first pull up to it. The lobby is pretty nice but had some sort of smell. The staff there was nice. We had a problem at booking where they told us we did not pay the taxes on the hotel and the we owed $200. The problem was fixed immediately. The room itself was pretty large and the bed was comfortable. The TV had full cable, not the normal 7 channels you usually get in a hotel. The free breakfast was substantial and some bit edible. The main problem in this place is housekeeping and construction. Housekeeping is REQUIRED to clean your room every day at about 8 am. Now, this is fine if you eat breakfast, but some days we wanted to sleep in. You cant just tell them to leave, you have to open the door, and sign a paper saying that you didnt want your room cleaned. We had 3 housekeepers and only one was great, with a great attitude, so SHE got a great tip at the end of the week. The hotel is remodeling the 7th floor. Gets noisy early. But honestly, for a pretty cheap hotel on the beach, it was a good stay.", "Date": "January 10, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Hilton Head Island, S.C.", "Title": "“Skip this one!!”", "Author": "dreamer43", "ReviewID": "UR11058278", "Content": "Was impressed when we entered the lobby but the is where the wow impressions stopped! Elevators are small and outdated as are the bathrooms (not enough room to keep your toothbrushes on the sink!. If this hotel has had a recent updating they need to ask for the $$ it cost them back!! The best thing this hotel has is the beds & bedding!!! Large plasma TV but who comes to a resort/spa to watch TV?, I could stay home for less $$ if this is what I thought was impressive. The cable box on the TV didn't work and everything about the TV was inoperable until maintenance came and replaced the box. Shortly there after the new box stopped working so we fixed it our self rather that throw it off the balcony as my husband suggested! Upon checking out the front desk didn't even ask how our stay was (even lower class hotel know enough to ask this ) & when I proceeded to explain our problem hew reply was she would refer it to maintenance as though that would help us!! Even though the money is not the issue we have stayed in nicer and better appointed hotels for less. We had intended to stay another night but chose to go elsewhere.", "Date": "November 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "key west", "Title": "“Clean, good value, nice staff”", "Author": "keywestaxi", "ReviewID": "UR11020971", "Content": "Stayed here during an event in Daytona for $79 for a Jr suite, nice big room with small kitchen and comfy couch. No surprises, no bugs, clean, well appointed room. Bar downstairs has 2 for 1 all the time. Breakfast is all cold stuff but free, as is covered parking and internet, but signal drops quite often, so if you have an aircard, bring it. This won't be free a year from now. Rooms are very soundproof except for door closings in the hall (typical). Hotel is sold out and I haven't heard a peep. No sheer curtains, only heavy, so it's either light or dark. Balconies are absent but plenty of glass. Staff is friendly and helpful and American! Property is immaculate and I saw people outside picking up trash at 0630 in the morning, a good sign. Convenience store across the street for 7-11 type needs. I'd stay here again anytime.", "Date": "November 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "4"}, "AuthorLocation": "pennsylvania", "Title": "“Wonderful Vacation, will be back”", "Author": "cw70", "ReviewID": "UR10113284", "Content": "My family and I stayed there last year and we are planning to come back hopefully soon. The price was good, veiw wonderful, the kids loved the pool as did I. The Tiki bar was nice, they have good chicken and fries. Breakfast was not to bad. They have a beautiful lobby with a huge fish tank the kids loved that also. The rooms were clean, housekeeping came everyday and kept the rooms nice. Over all it was a very nice Hotel", "Date": "October 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shelby, NC", "Title": "“Loved it!”", "Author": "ncemt1759", "ReviewID": "UR8616115", "Content": "Great room, wonderful view. We stayed at this hotel on our honeymoon, and I could not have been happier. The floor to ceiling windows are great to watch the sun come up over the ocean. The attendant at breakfast was hilarious. Would definatley stay here again!", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "new york", "Title": "“Great Visit”", "Author": "jaal", "ReviewID": "UR8213347", "Content": "Stayed 3 nights. Wonderful hotel, great stay. Young lady at front desk was very accomodating and helpful. Nice size room, very clean, beautiful view of the beach. Although our room was located more toward the street, it really didn't matter the view thru the floor to ceiling windows was great. The pool was large and well maintained. Right on the deck overlooking the beach. The free breakfast buffet was very good. Plenty to eat. Free coffee all day in the lobby. If I ever go back to Daytona Beach I would stay here again.", "Date": "July 21, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "cookeville tennessee", "Title": "“great time”", "Author": "mrs_ping40", "ReviewID": "UR8212581", "Content": "had a great time. Staff was very friendly. you can't beat the price. Will stay here again.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Will definitely go back!!!”", "Author": "virginian60", "ReviewID": "UR8019896", "Content": "This is an awesome place to take your family. A very nice location with a great price. Clean facilies with a very nice continental breakfast. The poolside tiki bar makes great burgers for lunch and the kids loved the pool. Nice sundeck and beach location. We will definitely be going back. We were in adjoining units 707 and 708 and the view of the morning sunrise was spectacular. Look forward to next year.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Nice Room on the Beach”", "Author": "jetset1234", "ReviewID": "UR7237911", "Content": "Only a one night stay for us, but next time we hope to stay longer. We will consider the Oceanside Inn, the next time we stay in the Daytona Beach area. Room 905? is on the top floor of this floor to cieling, mirrored windowed hotel. The room was nicely decorated, clean and free of unpleasent oders. The bathroom was a decent size, clean with upgraded light fixtures. A very nice comfortable room, clean heated pool, nice landscaping that you can walk or lounge on along with a clean soft sandy drivable coastline beach makes the Oceanside Inn, a very nice place to stay for about seventy dollors nightly. In the lobby area, we found the basic buffet style eating area, bar and excercise room, we were a little suprised with how clean the common areas were, especially during spring break week. Complimentary guest parking wasn't an issue, there is a two story parking garage available which seems suffient in ralation to the size of the hotel. The hotels location on A1A is good, there are resturants, shops, a large food store, a bar and fueling station that are either across the street or within an easy walk of the hotel. Night clubs, fast food, movies etc. are just north of the hotel. A quick cab ride will put you in the heart of all the action. Parking is limited in this area so there is often a charge for parking or valet parking. A cab ride may be your best bet, it wouldn't cost much more overall, and may just keep you out of trouble. A1A is WELL patroled by DAB's finest. Speaking of which, Daytona Beach's A1A area is looking better and better over the past few years, new pavement and designed brick intersections along with the new and or renovated hotels, minigolf, go-cart and waterpark are once again making this area attractive and fun for families and singles alike.", "Date": "March 28, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Southern Ontario", "Title": "“Don't stay in this hotel!!!”", "Author": "candgk", "ReviewID": "UR6838381", "Content": "The view from the rooms is fabulous, the rooms are quite adequate but our stay was terrible. First of all, they advertise that there is internbet available in the rooms. While I was there, the only place anyone could access the internet was in the lobby. When I complained at the front desk I was told that 1. It was the provider's fault 2. It was the fault of my computer (although no one else could access internet anywhere else, either) and 3.What do you want ME to do about it? Our second night there was a very loud group in the room next to us. They quit about 12:00, but then started up again at 4:30 a.m. When I pounded on the wall, they attempted to open the connecting door. I have never felt so unsafe in a hotel before. There are no instructions in the room on the phone or elsewhere as to how to get an outside line or how to contact the front desk. The lack of sleep and inconvenience we had just isn't worth the view!", "Date": "February 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Pensacola, FL", "Title": "“Not What I Had Hoped”", "Author": "emeraldskye", "ReviewID": "UR6515512", "Content": "When I booked our stay, this hotel was rated a 3 star, now it seems it has dipped to a 2-star rating...and with good reason. I wouldn't say this is an awful hotel, just an average room with average staff. It should have been cleaner. The pillows were very lumpy, and I had an asthma attack for the first time in about 7 years when staying here. (We only stayed one night). Not saying that the hotel definitely caused my asthma attack, but I was not sick in any other way and there was a sudden onset while sleeping that night. However, it seems one previous complaint others have written about has been rectified. Their breakfast was very good, offering several hot selections among the traditional cold breakfast items. Given the choice, however, I do believe I will look elsewhere for my next hotel in Daytona Beach.", "Date": "December 29, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tomahawk, Wisconsin", "Title": "“Nice Place....but”", "Author": "UPMiGal", "ReviewID": "UR5708490", "Content": "My Husband and I stayed at the Oceanside Inn for our stay. It was a fairly nice place to stay... but there were a few issues that will make me consider another place next time to Daytona Beach. During my morning beach walk, I did discover that (I do believe) the Oceanside Inn is the only hotel on the beach without balconies! We had an OceanFront room during our stay, but it was almost a waste of money. There's so much sea salt spray on the windows that take up the whole wall (very nice....but) that you can't get a clear view of the beautiful beach and ocean. the only CLEAR veiw you can get is by standing on a chair and opening the only window in the room, that is about 6-7 feet up above your airconditioning unit. and this \"window\" is only about 3' x 3'. All in all, i was just very bummed that we didn't have a balcony, when every other hotel on both sides had balconies all around. On the good side - the lobby was clean, the room was nice with a kitchenette (but don't expect the maid service to empty your coffee grounds or under sink garbage)- just no balcony!", "Date": "August 25, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Orlando", "Title": "“Very Disappointing”", "Author": "vanner11", "ReviewID": "UR5618041", "Content": "I would not recommend this hotel to anyone I know. I reserved the room online and it looked pretty decent from the pictures and decided to go with it. We only stayed one night but once I walked into the lobby I could tell this hotel was not worth the $100 I paid for it. For the condition of the place you would feel like you're staying at a cheap motel. The air conditioning was broken in the lobby and hallways which isn't great when it's 90 degrees outside. The whole hotel smelled stale and musty and looks run down. The people across from us actually had to switch rooms due to the smell. The room was outdated with mismatched lamps. We were facing the construction site which was only partly blocked because of the dirty windows. Our bed sheets had holes in them. There was also a small alcove in the room that was part of the wall with the window (which served no purpose) but had no shades so the sunlight was beaming on our faces when we woke up. It did have a refrigerator which was nice to have. The breakfast was just sad and consisted of a mini donut, muffin, cinnamon roll and an orange. The apple juice was just yellow water. I could not wait to get out of there and actually checked out early. I would recommend looking into some other hotels further north on the beach.", "Date": "August 16, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "York, UK", "Title": "“Send your mother-in-law”", "Author": "QUARK68", "ReviewID": "UR5032934", "Content": "We arrived at this hotel 4pm 13th April 06,2adults 2 children(7&9).The hotel is dirty has a building site next door & sex shop 100y down road,great place for kids!!! The view of the building site from room lovely,the view of atlantic from poll area great,if you ignor beer swilling yobs parked on beach in fronmt of hotel playing load music and able to put 8 swear words in each sentance.They also had use of hotel toilts----both of them. The party in next room finish 1 am ----then started on their return at 4am,so when construction site started 7am---who needs sleep.On checking out at 9am,after discovering last occupants towels etc... under one of beds,a full refund was paid to us with no problem,they are use to it. The whole south area ,in our shot stay,resembles downtown Bagdad,bagdad may be safer.When rebult mat be nice but for now if your not theren to party all the time FIND SOMEWHERE else!!!!", "Date": "May 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "GA.", "Title": "“Just a 3 stars hotel”", "Author": "Yga07", "ReviewID": "UR5016562", "Content": "This is just a 3 stars hotel..dont expect anything else. We got a good room, it was on the 8th floor (oceanfront) and it had a great view. I recommend oceanfront rooms because \"oceanview\" rooms are not really oceanview...in one side you have the parking lot and in the other side they are building a hotel. So, it's worh to pay a little bit more. The room was very clean, we didnt have problems with that. The front desk was just OK (was NOT the best!), but the venezuelan guy that works in the breakfast and pool (bar) area was very very nice. I would stay in this hotel again.. if i get an ocean front room on a high floor.", "Date": "April 28, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "San Antonio, Tx", "Title": "“Among My Worst Ever”", "Author": "ChrisIsOnTheRoad", "ReviewID": "UR4989375", "Content": "We had originally intended to stay 4 nights. We checked out after the first night. The place was awful. I have stayed in 5 stars and no stars. Not exactly a picky traveller. The staff was smoking just off of the front desk so the lobby smelled like smoke. The room was filthy with unknown \"spills\" on the floor, bedding and furniture. The bed was seriously uncomfortable. We booked an Oceanfront Kitchenette. It was a joke as was the continental breakfast. There was one bright spot. I needed to speak with the manager about adjusting our rate as we checked out after the first night of a four night package. After explaining our issues, she was apologetic and made the adjustments quickly and without a fuss. If you are totally desperate / absolutely broke this place is a maybe. Otherwise, shop further.", "Date": "April 19, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Daytona Beach, FL", "Title": "“Good hotel at a great price”", "Author": "mattyoglet", "ReviewID": "UR4979110", "Content": "Overall This hotel is a great buy in a good location. My only problems with this hotel is their wifi internet access is restricted to the lobby and housekeeping was very late with cleaning our room (5pm) probably because of spring break. Id definetly stay here again. It is nothing fancy however it is clean and good value.", "Date": "April 17, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“Ocean View? Is that what was behind the construction site??”", "Author": "A TripAdvisor Member", "ReviewID": "UR4742429", "Content": "This hotel was horrible! Not even recommended for budget travelers. I realize we were down for spring break yes and I expected the worst but didn't realize what that really was until I checked into Oceanside Inn! I could tell from the minute we pulled up to the place that it was not what I expected. The \"parking garage\" has limited space, you can barely back out to leave, and you can't see around the curve to exit. Our keys worked sometimes. We had to swipe the key about 10 times before it actually opened the door, which would get stuck half way through opening it. Walking into the room it looked nice, somewhat outdated and horrible decorating but spacious. When I opened the blinds to see our ocean view room i was mad.. I know oceanview is not the same as oceanfront but i could barely see the ocean and right in front of our window was this construction site for a hotel that when it's built i'm sure will blow away the customers at oceanside inn. There was no blow dryer, lotion, shampoo in the bathroom that was cramped. your right leg is in the shower curtain while you sit on the toilet. The hotel smelled horribly all throughout and to add to that the second night we were there some girl ended up throwing up in the trash can on our floor. I guess someone thought it would be funny to put it in the elevator. We decided to tell someone about this disgusting act and when we did we came downstairs to the three security guards playing cards in the lobby. When we told them about this they acted like they didn't care and as soon as we walked away went back to playing cards. The smell was horrid and i almost threw up myself because of it. Not to mention the two pizzas that were thrown out someone's room all up and down the hallways. By the way never order from Alfredo's, the food is horrible and made me sick to my stomach. Finally when we asked for some extra towels because the maid never showed up that day to clean the room they told us that housekeeping had left for the night and we would have to wait until the morning. Horrible service! Not worth it! I felt bad for the families on vacation and I was mad that I paid as much as I did, especially with the horrible location.", "Date": "March 29, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "cudahy, wisconsin", "Title": "“Great Hotel, No Problems!”", "Author": "ocblondie22", "ReviewID": "UR4739880", "Content": "My friend and i stayed at this hotel for spring break march 22-26. this is no 5 star hotel but i think people writing reviews previous to this exaggerated quite a bit. we stayed in room 503 and nothing was wrong with it. it was very clean. no mold, nothing. we had a nice view minus the construction next door. this hotel is older but it is kept in nice shape for the price. the beach is very clean with nice white soft sand, the pool area is beautiful, the water is crystal clear and there is plenty of lounge chairs. theres a tiki bar by the pool with drinks and a grill. the food is really good and price isnt bad either. we didnt notice anything bad about this hotel, seeing we were on spring break with tons of college kids in the hotel, of course its gona be messy and loud. we went in tons of rooms and they were all kept clean by house keeping and there was no mold or wear or tare. who really cares about the hotel, if you want excellent book at the hilton down the beach. i dont kno why ppl were writing bad reviews. but i guess ppl always find something to complain about. the only bad thing about this hotel is the \"contiential breakfast\" it is the cheapest. but i guess if they had a buffet people would take advantage of it. but hey they had food and it was free, im not complaining. the staff was very patient with us and very nice esp with us roudy spring breakers. this hotel is one of the nicest on the strip there are alot of hotels hit by hurricanes that are closed. id come back to this hotel the price is good the rooms are very large and clean and the staff is so nice. if you come to this hotel, eat at the ocean deck. its great!!!!", "Date": "March 28, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Avoid terrible”", "Author": "A TripAdvisor Member", "ReviewID": "UR4624811", "Content": "avoid like the plague BLACK mold growing all over the rooms from the walls to the sofa. Eeveryone in my family could'nt breathe, and my 2 year old had to go to the hosp. Manager would only refund half of the monthly rate of $4200, and we were only there for 2 day's...", "Date": "March 15, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Des Moines", "Title": "“It was ok..”", "Author": "ebennett", "ReviewID": "UR4590799", "Content": "I was very very worried about this place, the reviews I read on here did not really give it the best rating. It was nice. The restaurant was never opened though. Housekeeping was not the best at all. When we first got into our room I looked under the coffee table and there was an empty beer bottle there. They never picked it up the whole time we where there, then I was looking over the couch at the ocean from our room, and there was a huge finger nail clipping there! Someone threw it back there and housekeeping never picked it up! There were some stray hairs in the shower when we first got there, that was a little nasty. They totally missed us 1 day they never came to our room. The staff was very nice and friendly. The breakfast was good. The pool was nice. They were building a hotel next to it when we were there, that if we went back we would try that out. I dont think we would stay at the ocean side inn, just cause of the housekeeping. Our room did have a wonderful view of the ocean. Other than that it was nice, I am sure that it was just our room, the others were not like that. It was nice though. Worth the money for it. I though it was probably one of the nicest ones around there. If 1 day you are looking for something to do...go to the pier and rent a 4 wheeler! That was so much fun!!", "Date": "March 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Great Stay !”", "Author": "A TripAdvisor Member", "ReviewID": "UR4385901", "Content": "We Stay at the Oceanside Inn and had a room on the top floor with a great view, The hotel was very nice and off season we ask for a upgrade and it was no problem. Good price for the quality !", "Date": "January 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“OK, but a bit stingy”", "Author": "GoodGuyBob", "ReviewID": "UR4358227", "Content": "About me...I'm in my early 40's and was travelling for business and didn't have any spare time to enjoy the area. For the business traveller, this hotel is lacking. Things I am accustomed to but were absent are: a desk in my room, some form of internet service, a pad, a pen, coffee maker, and illumination (even with all the lights on in the room, it was STILL dim). Also missing from the bathroom are any \"extras\" such as a blow drier, lotions, and conditioner. (Note, you can get a blow drier from the front desk.) Although I didn't get to use any of these things, the pool looked great and the water was nice and warm. There was also a hot tub near the pool. Regarding the continental breakfast, it consisted of up to 4 kinds of mini donuts (powdered sugar, cinnamon, chocolate covered, plain), fresh apples, pancakes, frosted flakes, mini muffins, orange juice, and coffee. Regarding check-in/check-out, apparently you prepay your stay at the BEGINNING of the stay if you have a reservation. Another person was checking out who used a pre-pay hotel reservation (eg hotels maybe), and he was asked for an additional $3.39 which was in addition to the pre-paid amount for the in-room safe of $1.13 per night. I saw this charge on my check-out statement as well. Apparently whether you use the safe or not, this is tacked on to your stay. Regarding the \"ocean view\" room, your view can be better/worse depending on your room's location. The hotel is positioned with it's longest part running from the beach to the road. There are 3 \"ocean front\" rooms with a direct view of the ocean. These room numbers end in 13, 14, 15 with 13 being the largest. (I am going by the floor plan on the back of my door for the fire escape route – I didn't visit every room!) There are 24 rooms per floor, with rooms x01 and x02 being larger rooms facing the street. Then starting from the road is x03, x04 and so on…wrapping around the building and ending in x24 near the road again. Thus room 603 would be the farthest from the beach and would be more like \"ocean glimpse\", where room 612 would be closest to the beach, but not directly facing the beach. The pool is on the southeast corner of the building, so room 612 would have a good pool view and ocean view. The south view (rooms x03 through x12) face a hotel building currently under construction. The north view (rooms x16 through x24) face the parking lot. Only the west view (rooms x01 and x02) have no view at all of the ocean. Also, there are small clusters of smoking and non-smoking rooms as you walk around the floor. Be sure to state your preference at or before checkin. A business associate got stuck in a smoking room. In summary, I would say this hotel is best suited for the budget traveller who wants to be ON the beach and have a nice pool who's main concern is fun and frolick – perfect for the spring breaker, or a family vacation. For the business traveller, you'll probably be happier somewhere else.", "Date": "January 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Awesome”", "Author": "A TripAdvisor Member", "ReviewID": "UR4243786", "Content": "We stayed here for 1 night from 11/12 to 12/12. We had reserved the room some 3 weeks ago from their own website. They reserved the room for us without charging the credit card at that time. We had specified a few preferances at the time of booking. We checked in late-night but they still had kept our room and fulfilled all our preferences namely, higher floor, oceanfront, non-smoking, king-size bed. Front-desk staff was very friendly and everything went smooth. We booked the Oceanfront Kitchenette for $79 per night. Oh was it more than what we expected!!! The room was big with wall to wall carpet, big and cosy bed and sofa, a 4-people dining table and chairs, a nice spacious kitchen area with everything that a good kitchen has sans the food, ofcourse. The biggest surprise was a leather reclining chair with footrest, right by the floor-to-ceiling glass wall facing the ocean, needless to say I enjoyed reclining in that chair looking at the ocean. Another surprise was the cable tv, I pay $50+ every month in NYC for that same cable, it had the same lineup of channels plus a few extra ones, not the usual 10-15 channels of the other hotels, half of which are local channels, I have stayed in. The view from the room is gorgeous, unobstructed view of endless wide ocean from everywhere in the room including the bed. The included breakfast was nice too, for the first time we had pancakes in an included continental breakfast of a 3-star hotel. Pool area is good and you can just walk to the beach from the lobby. In the morning we needed to print the boarding pass for our return flight to NYC, we had a wireless laptop and they have an excellent wireless network all over in the lobby, so we quickly checked in and then asked the front-desk lady to print out our boarding passes and she happily did that and we had our boarding passes in a minute. We had some doubts because of the word \"Inn\" in the hotel name and the low star-rating and that led us to spend just 1 night here and that was our biggest regret, we wanted to spend more time here and we will on our next trip to daytona beach and nearby areas, which I must say has one of the best beach in florida, we went to Miami, Key West, Clearwater, St. Petersburg, Tampa and Daytona Beach on this trip and the beach and water at Daytone impressed us the most. Highly recommended for a family or a group of 3-4 people, room is big and spacious, parking is ample and free.", "Date": "December 15, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Springfield, IL", "Title": "“Loved the Oceanside”", "Author": "Tracytfox", "ReviewID": "UR4071744", "Content": "My Husband and I stayed at the Oceanside in October 15-20. This was the week before Biketoberfest. We had a great rate from Orbitz for about $69 the first three days. We loved the area so much we stayed for 2 more. We would have stayed longer but prices went up sky high (200+) for Biketoberfest. The first night we were in a double room, but after we asked for a King we had it the next night and for the rest of the stay. Rooms were Very spacious, and clean. Housekeeping was very nice, as was the female at the front desk. The men at the front desk were a little short and rude, but we just waited for females to ask for anything. We did not do the breakfast thing, we bought some food and kept in room, so we didn't have to be up any certain time. Pool and beach were Very clean. We've been back a week and I want to go back! I recommend Crabby Joes, ate their 3 times, Inlet Harbour Restraunt ate there 2 times, and Bubba Gumps. Don't listen to bad reviews believe me, I live by tripadvisor. It hasn't let me down yet!", "Date": "October 29, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Lovely Time at the Oceanside Inn”", "Author": "A TripAdvisor Member", "ReviewID": "UR4023237", "Content": "My Husband and I stayed at Oceanside Inn right after Tropical Storm Tammy passed thru (Oct 7-11), and we couldnt even tell it was there. This beach front hotel was perfect! The pool and grounds was clean and maintained very well every morning, the room was comfortable and had a great view of the ocean. The upper sunning deck was flawless, perfect place to grab and book and relax. The free breakfast was a little skimpy, but had hot cakes and syrup and we didnt have to pay for toast like some of the reviews said. Housekeeping staff was always kind, front desk was a little short with us because we arrived so late after driving down from Ontario Canada. Would return again in heartbeat! However, they are building a hotel right next door which in the future could ruin the view of lower number rooms, so maybe try and request a room in the teens. Also, wouldnt hurt to bring along your own pool towels, there never seemed to be enough on the shelf. Overall, a wonderful stay and didnt want to leave. Daytona Beach is beautiful.", "Date": "October 14, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Nice weekend at the Oceanside”", "Author": "A TripAdvisor Member", "ReviewID": "UR3988180", "Content": "My 2 young daughters and I stayed at the Oceanside Inn September 4-7 (Labor Day weekend). Upon arriving at the hotel late Sunday afternoon, I was told that they did not have a double room available - only kings. Since this wouldn't work she upgraded me to the penthouse suite for the same rate I was orginally suppose to pay for a double oceanfront. Very pleased - the room was absolutely amazing. Floor to ceiling windows in a corner room, full kitchen, 2 bathrooms, large living room and bedroom. The lobby was clean but a little outdated. Elevators were a little slow. Hallway carpets could use a good cleaning. Breakfast was average at best as mentioned in previous posts. The pool and grounds were very well maintained. Every morning we would watch them clean the pool, scrub the patio and hose off the sand from area (it was extremely windy that weekend - right before Ophelia). Plenty of chairs and a great oceanfront location. The tiki bar had a good selection for lunch. Nice 2 level parking garage adjacent to the hotel. Overall, we had a great time at Oceanside Inn. Would definetly stay there again.", "Date": "October 4, 2005"}], "HotelInfo": {"Name": "Oceanside Inn", "HotelURL": "/ShowUserReviews-g34172-d84327-Reviews-Oceanside_Inn-Daytona_Beach_Florida.html", "Price": "$73 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1909 S Atlantic Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "84327", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/88/ab/b9/hotel.jpg"}}