{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Seriously lacking in many areas, considering the price”", "Author": "scraphappybabs", "ReviewID": "UR138548702", "Content": "Let me start off by saying this is a condo 'resort' property, not a regular hotel, which means that each room is different, the property is older, and people actually live in some of these units fulltime. On the first floor, the residents tend to 'hang out' on the sidewalks with their front doors open facing the parking lot (and some of them have very stinky condos due to pet odors). Not a good impression walking to the lobby area. The front desk is nice enough and tried to be accomodating to my requests, but I just don't think I should have to go down there every day to ask for towels, bed sheets, etc, if I 'follow the rules' and put my sign out on the door every day. The particular unit we were in had a horrible leak overhead in the bathroom, the patio door could not be locked, terribly uncomfortable mattresses and sleeper sofa (old and flat), the refrigerator wouldn't get cold enough during the 4 days we were there, and the floors were absolutely filthy, even after I complained and they mopped--still gross. Room was incredibly humid, so I kept having to run the a/c even though it made it too cold at times (dehumidifier in the room didn't work). This is also one of those places that expects you to wash the dishes otherwise you will be charged something like $25 for leaving them, and that also means they are 'exempt' from sanitizing the kitchen. Yuck!!! I would have checked out early and gone elsewhere, but they collect all your money up front, so I would've been SOL for leaving early ($100+/night). Only stayed here at the request of friends who have been coming for the last 3 years, so I trusted their judgment--in years past, they had gotten decent service and a different room, but I know this year, they also had to go get their own towels, etc, and were disappointed with their room selection. I've stayed in 2/2 condos for less money and better housekeeping. The only things that were nice about this stay was having an oceanfront balcony on the car-free section of the beach, and the pool was kept up (surprisingly). Sorry to sound negative, but I am stating the facts.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Awesome”", "Author": "Michelle2020", "ReviewID": "UR138453960", "Content": "My husband , I & our dog just stayed here for 9 days, the staff was extremely helpful in making our stay the best, Misty went out of her way to help with the kind of room I asked for(king room with ocean front balcony) & all the staff right down to maids & maintence people were very friendly. The location is perfect along with being dog friendly, I would recommend this to all.. PS. their restaraunt/bar was also very efficient. We will be back!", "Date": "August 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Air conditioner system needs help”", "Author": "thetrouper", "ReviewID": "UR138346638", "Content": "We rented a very nice condo from owners and enjoyed our stay except for the faulty air conditioner.Each condo does not have an individual air unit, and the system is probably very old. We had to hang blankets over the glass balcony doors and the temp stayed at 78 - 80 degrees.This was not a problem exclusive to our condo, as several other guests around the pool were voicing the same complaints . Some had contacted owners and maintenance, but there was nothing they could do to improve the situation. We sure hope they can fix this problem with the air, because we would love to return to Daytona Inn Beach Resort next summer. This was our first stay there, and we have no complaints about anything aside from the lack of cool air. The staff was friendly, the pool clean, and the location was great for walking to eat, drink, and shop.", "Date": "August 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Manchester, Missouri", "Title": "“Lesson Learned”", "Author": "Nick K", "ReviewID": "UR136966110", "Content": "We stayed at the Daytona Inn from July 13 thru July 21 2012. We chose it because we felt it was economical and close to everything we wanted to do and the fact that there are some good reviews out here. We had 4 days without maid service and had to continue to go to the front desk to trade in our dirty towels. Our continued complaints to get maid service went unanswered and so we escalated the issue to the General Manager, Carol. After explaining the problem to her she mentioned she would take care of it that day and also made mention that \"I have been trying to get the maids to do things a certain way for 11 years now\"- Wow and your the General manager? seems maybe you need a different staff. After we left her and went to the beach, we returned to once again no maid service except towels. We realize now that we definitely made a bad decision.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edgewater, Florida", "Title": "“The place to be when you visit Daytona”", "Author": "dstg", "ReviewID": "UR135553637", "Content": "Let me start off by saying the Daytona inn is centrally located. It's managers and staff are extremely helpful. And the staff's knowledge of the surrounding area is impeccable. I would revisit the Daytona in a heartbeat.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Smyrna Beach, Florida", "Title": "“Great place to stay on the beach!”", "Author": "tjane10", "ReviewID": "UR135540088", "Content": "The rate fit my budget. The room was clean and had all the necessities needed for a 3 day weekend get away. I chose an oceanfront room. Noise level was not an issue. A nice stress free weekend. The Daytona Inn Beach Resort is not a new place, but it is well taken care of and managed.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Gainesville, Florida, United States", "Title": "“Most Disappointing Stay Anywhere, Ever”", "Author": "Marci B", "ReviewID": "UR135536049", "Content": "The first room they put us in did not have a working toilet. By the time the third maintenance man came to work on it - and we were told the pipes were so old and they had roots growing in them - I went to the front desk to see what Plan B would be. Plan B was to move us to another room. But then it turned out that room wasn't actually available because some other guests had been moved into that room because the beds in their room were too small, but the change hadn't been put in the computer yet. We went and looked at the room and it was fine. We went to grab a bite to eat and as we were walking across the parking lot, we saw people going into our room. Yes, the room change had not been put into the computer yet so they had sent people up to look at the room to see if it was acceptable to them. The sink in the bathroom did not drain. When the maintenance man came up to look at it, he called me into the bathroom. He told me and showed me that the stopper was too large and we just needed to take it out for the water to drain. Silly world, thinking sinks NEEDED stoppers. We were discussing the beds and I mentioned mine was nice and firm. My friend said something about hers having a slant. When I woke up the first morning, I looked across the room and since the bedspread was no longer just hanging down, I could see the source of the slant. The bed frame was broken on one corner and an ice bucket had been placed underneath the bed to 'fix' it. Except that the ice bucket had shifted and was no longer holding the bed up. The maintenance man gave us a long explanation about how a new frame would need to be ordered, and they didn't know things were broken until someone called about it, that they didn't actually own the room, etc, etc. Whatever!!", "Date": "July 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Aged, Typical Worn out Hotel”", "Author": "Adam S", "ReviewID": "UR135480421", "Content": "This is a typical older Beach front hotel. Had a Ocean front. 10 coats of paint on woodwork. Doors that have had locks changed dozens of times. Balcony door wont close.Parking sucks at night due to the bar. For a 100 a night on a weekday in July it could be better. AIR conditioning or lack of it. Its central air, you have no control, it was cooler at night than with the air on. Looks like an old evaporative type rooftop system.If it wasnt for the ceiling fan. Sorry in July you need a real air conditioner. The elevator did work, counter help was professional. Main pool was ok. I would stay here on bike week, but not again on a family vacation.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Please save your money & DO NOT STAY HERE!!!!”", "Author": "Lauren5457", "ReviewID": "UR135161244", "Content": "We checked in on fri the 20th-23rd so we were just having a mini vaca bc we love Daytona beach & times before at other hotels we have had a great time, however, the elevators at this hotel smell like mold and farts & the parking is awful bc we shared the lot with a sports bar (&apparently them making money was more important than the $$ we already paid for a room bc we were told we could park across the street!) the room we asked for was nothing what we wanted it was dirty, the sleeper sofa was like a freaking concrete block with a crease in the middle (that is fine for little children but not adults) the tvs are awful and cheap flat screens and the staff are rude and did not care that there was no air in one of our rooms and couldn't give us a rollaway bed at all when we asked fri night and never received it. There was people in the Parkin lot with loud music dancing and partying. With kids I can't have that the maids never once came I clean and we were there 3 nights. I had to go out and buy Lysol wipes to clean, THiS HotEL iS DIRTY do not stay here!!!!!!!!! Please!!!!", "Date": "July 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Appomattox, Virginia", "Title": "“Avoid at all costs”", "Author": "Alison P", "ReviewID": "UR134633868", "Content": "Just returned from a stay and it was the worst hotel I've ever stayed at. It was filthy. You could see the filth in the vents. I was afraid to touch anything. The blanket for the sleeper bed had mildew growing on it. Couldn't use the balcony because the door was cracked. Horrible experience! Exterior was also filthy and not well maintained. It's a shame because the location is great and the pool area was well kept.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“My experience at Daytona Inn Beach Resort”", "Author": "Beau5", "ReviewID": "UR133878757", "Content": "My husband and I have stayed at the Daytona Inn Beach Resort for the past 3 years. We both ride Harleys and go every October for Biketoberfest. We have had a wonderful experience at this hotel every time. No complaints at all....", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "KAUG", "Title": "“Home on the Beach”", "Author": "KAUG", "ReviewID": "UR133867980", "Content": "Our second year staying at this property, we love it here! We like 212, just one flight up, clean and with a great view. Its an older hotel but very well maintained with a very friendly staff, a large pool and a cute kiddy pool. You can't ask for a better location. Driving is not allowed in front of this hotel and so much is in walking distance - Main St, The Pier, The Boardwalk, Ocean Shops and The Band Shelter. You can even see the weekly fireworks from the pool deck or your balcony. Dayton Inn Beach Resort has truly become our home on the beach, we can't wait till next year!!", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“This hotel was great!!!!”", "Author": "Traceypalmer", "ReviewID": "UR132089602", "Content": "The staff was very friendly and helped us in every way they could, when we checked in we wanted a bigger room and they gave us that at no extra charge. Misti, and carol were great. The wifi was awesome the only bad is the beds were very uncomfortable for the time we stayed. We only seen the security gaurd one time, and there was an altercation going on our side and it was almost as if he was turning his and walking away,he was not doing his job. It was a great location.", "Date": "June 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toledo, Ohio", "Title": "“I Was Amazingly Surprised”", "Author": "Michael S", "ReviewID": "UR131475398", "Content": "I have to agree with the people who were confused with the mixed reviews on this site. I didn't know what to think, but after calling the hotel they explained that they were a very unique hotel and every room in the hotel was different because individuals actually own the rooms. I knew their location was awesome and decided to take a chance. Boy am I glad I did! When I checked in the front desk could not have been more pleasant or helpful. I have stayed at many big \"chain\" hotels and immediately could tell that this had a total different feel. I told the lady behind the front desk that I was their celebrating my 10 year anniversary and told her I really wanted a nice room for me and my wife. She told me that she had a great room for me with a fantastic ocean view and put me in room 224. When we walked in the room our mouths dropped to the floor. The room was furnished amazingly and completely spotless. Instead of an ugly little bathtub, the room had a great open custom shower. The bathroom amenities were very nice also. The room had a designer king sized bed with one of the most comfortable mattresses I have ever slept on. There was this massive Hi-Def TV hanging on the wall (must have been at least 46\"), and every other appointment one could ever ask for including a kitchenette area with a nice small refrigerator, really nice microwave, sink, granite counters, dishes, glasses and utensils. And I haven't even got to the best part. The VIEW! It was incredible. Direct ocean view overlooking the pool and beach. The ocean was practically close enough to touch it from our beautiful balcony. Nothing but beach and ocean as far as the eyes could see. We stayed at the hotel for 3 nights and I don't have a bad thing to say about it. There was a complimentary continental breakfast everyday and everyone there made us feel like family. The price was very modest for the location and amenities and we can't wait to return!", "Date": "June 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Cool Hotel but very bad beds”", "Author": "Christopher H", "ReviewID": "UR131043299", "Content": "Ok, this Hotel was in the perfect location to the main area of Daytona Beach, it was within walking distance of the peir area and board walk withi minutes. I loved the people and the area but the only thing was that the beds and the pull out sofa had to be some of the worst beds I have come across in my teravels , i will not stay again unless they have new upgraded beds and pull out sleeper sofa's. you could feel every spring . if you can get past that great place to stay", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Smyrna Beach, Florida", "Title": "“Cant beat the price for location on ocean”", "Author": "sobefox", "ReviewID": "UR130807927", "Content": "the price was perfect for our family visiting and it was immaculate regardless of the older style..", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Take it from me, this place is wonderful......”", "Author": "Natalie H", "ReviewID": "UR130630739", "Content": "I read all the mixed reviews before i went to stay. And honestly so terribly confused. But i called the hotel the lady at the front desk reassured me that we would have a great time. If your looking for a cookie cutter hotel with no personality, the hilton is just a couple blocks away, with rooms as fake as there staff. BUT ... The ladies who worked the front desk were wonderfully nice. When we arrived I was in a terrible mood, my boyfriend and i were already fighting and we hadn't even begun our vacation yet.... but before we left to go to our room the two girls at the desk had us both laughing and smiling again. Our room felt very inviting, very real. It is obvious that it is an older hotel and with a couple ruff edges. But very clean and stylish. My boyfriend and i stayed in a studio on the ocean front. We could see the ocean from our bed. The first morning I woke up, i thought to myself \"I never wanna leave this bed!\" So, yes i would definitely recommend staying at the daytona inn. I cant wait to stay again next year.", "Date": "May 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wheelersburg, Ohio", "Title": "“Best Hotel I Ever Had The Pleasure Of Staying At!!!!!!!!”", "Author": "gailh769", "ReviewID": "UR130236608", "Content": "I really enjoyed my stay at this hotel. The rooms were clean and well kept, staff was friendly and helpful. If I had any questions they were more than happy to answer them. They even have a designated area for guests to walk their pets and provide materials to clean up after them as well as a place to dispose of the waste products to keep it off the grounds and out of the rooms. The linens were freshly laundered and soft to touch. The pillows on the beds were comfortable and I wish I had them for my bed at home. I can hardly wait to go back and stay there again. I would recommnd this hotel to anyone who is planning a trip to the Daytona Beach area. There are balconies that are wondeful to sit on and watch the sunrise in the morning.", "Date": "May 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edgewater, Florida, United States", "Title": "“Wonderful Stay”", "Author": "Rachel R", "ReviewID": "UR130231279", "Content": "the rooms are neatly furnished. The staff is friendly and helpful. I would definitely stay again. My stay was very enjoyable!", "Date": "May 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Buffalo, New York", "Title": "“Terrible”", "Author": "Dianne F", "ReviewID": "UR129981914", "Content": "It was the worst hotel I've ever stayed. Old, smelled, dirty, cats roaming the area. Doors bathroom doors stick as well as balony door. Pillows sucked, comforter old & cheap looking. Just bad. I will never stay there again. Ever!!!!!!", "Date": "May 15, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“LOCATION! LOCATION! FAILURE”", "Author": "rocky c", "ReviewID": "UR128235279", "Content": "To be totally honest, I wrote hotel management before posting this review. Their non-response shows me nothing will change. Location, this hotel has one of the best locations in Daytona Beach. The rooms are great size and layouts. This is where the good review ends. My major complaints this year (I have been there many times before) is the condition of the rooms and housekeeping. Rooms this year were filthy. Yes filthy. I had to wash my own floors and balcony. I was running out of socks. They had to be thrown away every day after walking around the room, FILTHY! Hair in the shower inherited from previous guest. Killed a bug stayed on floor for five days, stale tobacco smell in rooms, light bulbs out everywhere. Best response of the week. We called front desk and asked for toilet paper. We used the half roll they gave us. We were told we had to WAIT for room service to get to our room. (Ouch!!)I don’t need to go on. Front desk very pleasant, could see hands were tied by management. I know it’s an old hotel, but like the sign says it's on \"The Best beach in Florida\" Come on folks, spend some money and maintain the place. It can be a gem.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, so worth it.”", "Author": "DspalfromMichigan", "ReviewID": "UR127636385", "Content": "This hotel is not bad for the location. I read the reviews when i booked. They were mised so my expectations were not high. So when going in to the room i booked i was prepared. And it is not that bad. I have def stayed in better but for this location it was totaly worth it. We are walking distance to everything! If you can afford the suits or ocean front i have been told the rooms are better. We stayed in courtside.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Location and Value!”", "Author": "2ENVYus", "ReviewID": "UR127601601", "Content": "For this hotel, it's all about the location! It's oceanfront with no vehicle traffic, there is a bar/restaurant on the premises, and umbrella & chairs already set up on the beach for rental (just grab an available one and have a seat, they will come to you to collect the rental fee, VERY convenient!) Now, don't get me wrong, the unit/room itself was spacious but dated - mostly the appliances, lighting and decor. They did provide utensils and dishes, even dish soap with a sponge and drying towel. The beds were pretty comfortable, the sheets clean and crisp. Our unit had a bedroom with 2 double beds, but with only a doorway, no actual door. Frankly, it didn't really matter.. again, we were oceanfront. Check-in was easy but I recommend that you book DIRECTLY with the hotel, that's what we did and it was appreciated by the staff because they get paid without 3rd party involvement (i.e. Book It, Expedia...) There is a large pool with plenty of lounge chairs. Overall, we will be back, no doubt about it!!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Worst ever....”", "Author": "Eire27", "ReviewID": "UR127549597", "Content": "From bad to worse. Stayed here for one night and could not wait to get up the next morning to get out of here. Initially the receptionist did not have a record of our booking (booked throught booking.com- spoke to them and fully feel the hotel were at fault). We booked a beachfront room and there were none left so we got an \"upgrade\", I wouldn't have wanted to see the cheaper rooms, eventually an hour later we got to our room - unlceaned room, no towels, no sheets, no pillows, no lock on door, so we moved room, bed was damp,the room consisted of 2 rooms, the bedroom was next to the outer door, lot of noise, gap under door that all sorts bugs could climb through, just did not feel secure.Well located on beach, free parking, parking attendant and porter were healpful at least. wifi wasn't working. It is cheap but have stayed in similar priced hotels and I have been to the USA on many occasions and in all my visits to Europe and the US this is the worst hotel I ever stayed in", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Loved it”", "Author": "LoriJohn_1049", "ReviewID": "UR126709948", "Content": "Our second stay. Great location on the beach . Rooms with ocean view you can't go wrong. Short walk to stores & several restaurants. Friendly staff,security at night. Excellent variety of breakfast items in the lobby.Pool was very clean with many lounge chairs available. Perfect. Will definitely be back.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Modesto, California", "Title": "“best time in a long time”", "Author": "chazzz_10", "ReviewID": "UR124436684", "Content": "we had a great time only two days but we will be back the staff was wonderful,helpful and the room had a really nice set up not ocean front but i could still see the beach south of the hotel. love staying here i feel at home yet special.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Forza10", "Title": "“Only adequate”", "Author": "Forza10", "ReviewID": "UR124027689", "Content": "My search for a hotel had two criteria: in-room wifi and breakfast included. This hotel promised both and delivered neither; worse, the management and staff really didn't see a problem with failing to deliver on promises. The web site was clear when I made the reservation: continental breakfast included. When I pointed out that my booking was based on including breakfast, they shrugged it off with \"that doesn't start until the 30th\" (the day after our 4 night stay). They claimed that someone stole the router from our floor, and we had to go to the lobby for wifi--which was slow and undependable. They didn't seem too interested in replacing the wifi or even see that not having it was a problem. Overall: the facility is a bit beat but adequate and seems to be in line with neighboring properties; the management and staff are friendly but clueless in terms of customer service. There is a great little independent breakfast/lunch restaurant in the same building as the hotel but only accessible from the road to the beach.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotle NC", "Title": "“Treated US like Family”", "Author": "Max C", "ReviewID": "UR123333281", "Content": "We took a last minute vacation and found this condo hotel, the kiddies pool was perfect for the little ones and the location couldnt be beat! The guest services treated us like old friends and the rate was super affordable, we will come back..", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Super Location, Great Value”", "Author": "jim w", "ReviewID": "UR121465833", "Content": "We had the pleasure of staying at the Daytona beach resort in November of this year. Older hotel, clean and a super friendly staff. We found that this is a condo motel, so all the rooms are privately owned. We were in room 318, which was very nicely decorated. I highly recommend it.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Greenville, North Carolina", "Title": "“Very damp”", "Author": "Sarah Y", "ReviewID": "UR120496962", "Content": "Stayed here for a conference and wouldn't book this hotel again. The bad: NO internet - the internet didn't work all week and they made no effort to fix it. The room was permanently damp, wet floor, wet sheets which makes for a cold nights sleep. The mattress appeared new (still in plastic cover) but was very uncomfortable, felt every spring and sunken in the middle. There is a strip club across the street. The TV was old and took 10 minutes to warm up before you could see the picture. Requested an iron, which was rusty and left a stain on my shirt. The good: right on the beach, cheap and quiet (we stayed mid-November) This would be a good place for a long term summer let but as a hotel it felt more like I was staying in my Grandma's coal-shed.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Overall Nice Place to Stay, but...”", "Author": "tmbevtfd", "ReviewID": "UR119373986", "Content": "We stayed here for Biketoberfest, 2011. This is an overall nice property, very nice staff and very accommodating to motorcyclists! However, there is a caveat. Each room is owned individually. The property is essentially Condo's and each owner handles their room or suite themselves in regards to remodeling, etc. We booked a suite because we needed some extra space. I can only speak of this particular room because unlike a chain hotel with cookie-cutter rooms, each of these will be renovated differently. I can say this one is in serious need of an update. It was overall, clean, cool and had a nice view. But the bathroom bordered on terrible. Tile in the tub/shower had dirty grout; faucets worn and ready to fall off. Bathroom door knob coming off the door; and the tub was extremely slippery. There is no mat either. The TV's are old, remote didn't work on the bedroom TV. The windows throughout this room were likewise, terrible. Tried to open a couple and they nearly fell out. Cheap cabinets, ancient stove, uncomfortable vintage furniture. We glanced at a few other rooms which were being cleaned and the door was open and several others looked much nicer but weren't suites. Again, it's up to the owner to do this. Basically, I'd recommend this hotel because of the location and staff, plus there is a great bar/restaurant adjacent to the office (run by a different entity). The lobby of the hotel is nice, had soda and water machines, morning coffee, etc. What I'd recommend to anyone staying here is immediately, examine your room and if it's old, outdated and doesn't meet your standards, simply ask for another. The hotel has around 120 rooms, and rents about 90 of them; so chances are you'll get a better room than we did. But if not, just ask for something else. In summary, you'll really like the location and staff. They're great. But since each room is subject to what the owner puts into them, it may be hit-or-miss for a decent one. For what we paid, it should have been much nicer, but Suites are limited in numbers. Had we booked a regular room, I'd have asked for another place based upon what I saw, and the price.", "Date": "October 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edgewater, Florida", "Title": "“Absolutely Wonderful”", "Author": "dstg", "ReviewID": "UR117557143", "Content": "The staff was so concerned with are needs that we would rebook in a heart beat next time.It so close to everthing. The room were wounderful and the view was super", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "2"}, "AuthorLocation": "West Frankfort, Illinois", "Title": "“Do NOT walk, RUN!”", "Author": "Hotwood2", "ReviewID": "UR115467106", "Content": "First, they said 81 bucks online, it was 102 a night... the elevator was scarey and ricketty. The front door has one small deadbolt, no chain, no extra locking mechanism. The bedroom is what you have to walk through first, so if you are the one on the pull out bed you have to walk through the bedroom for the bathroom or to go outside. The bathroom has NO lock, no counter space, the toilet seat is peeling, the tub drips. and the fixtures are so old it is difficult to set them at a comfortable temp. 3 towels in the bathroom with a family of 6 is slightly ridiculous. When I began pulling the pull out bed I saw someone elses nasty old food or disgusting trash under it. there was one pillow for the bed. The curtains and blinds were open, so when I tried to shut them I had to use my hand to 'swipe' the blinds shut, my hands were covered in grime, it was gross. There is a sign at the sink that says if you leave any dirty dishes it will be a 15$ charge. Seriously??? The location is great, otherwise... look around for clean new motel...", "Date": "July 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, older but clean”", "Author": "Linzsays", "ReviewID": "UR115161969", "Content": "It's not brand new, and more of a hotel than a resort. But it's clean, the kids loved the deep pool, and it's right on the beach near the boardwalk.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Deltona, Florida", "Title": "“Know before you go”", "Author": "twags", "ReviewID": "UR114772702", "Content": "This is not a resort. No where on the website did it say that although you book the room through the front desk, the rooms are actually owned by someone and not the \"resort\". Some people actually live there on a permanent basis. The room we booked was the family suite and was like a little apartment with a separate bedroom. Separate bedroom had a small bed and a door that slid closed, no lock. There was a full kitchen and living room with a pull out sofa bed. When you step out on the balcony it faced a wall which was the small strip plaza in front of it. The balcony was a tiny triangle shape big enough for two people only and not even large enough for two chairs. The family suite has ROACHES. Nearly every room if not all of them faces a large parking lot and the walkway so if you plan to seep later forget it because there are people walking with barking dogs, taking out their trash, talking to their neighbors early in the morning, etc. The front desk got pissy because we came in two cars and needed two parking passes. We were told if the parking lot filled up we'd have to park elsewhere. To go to the pool or beach you have to get towels at the front desk. They had none twice or were washing them. They gave us hand towels. The kiddie pool is in need of a resurfacing badly and it was so filthy I wouldn't let any child wade in it. The larger pool was clear but had unidentifiable things floating in it. I would not stay here again.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“All of the rooms are privated owned”", "Author": "Formaggio12345", "ReviewID": "UR114716566", "Content": "For those of you not familiar with Daytona Beach, the Daytona Inn Beach Resort, like most of the hotels in Daytona Beach, is a Condominium-Hotel, a.k.a. Condo-tel. All of the rooms are privately owned by individuals like you and me. But not all of the rooms belong to the rental program that is managed by the front desk. What this means is that you can rent some of the rooms out by dealing directly with the rooms' owner, and you can rent some of the rooms out by dealing with the front desk. When you rent your room from the front desk, you get all of the amenities you'd expect from a hotel: reprogrammable keys, toiletries, clean sheets, maid service, housecleaning, maintenance crew, etc. It's just like your traditional hotel service. On the other hand, if you rent your room directly from one of the owners, you don't get the amenities provided by the front desk. You get whatever the owner promised you (if anything) when you made your arrangement with the owner. Since most owners don't live onsite, there's a good chance you won't receive much in the way of personal service, compared to the dedicated onsite front desk staff that works for the rental program. So, for example, when you read a post here from someone saying that the front desk didn't help them out, it's most likely because the person rented a room directly from an owner who doesn't belong to the rental program. Owners on the rental program pay a fee to the front desk to take care of their rooms for them and provide all of the comforts you expect from a hotel. It's not that the front desk staff is being rude or unfriendly, but rather it's not their responsibility to take care of rooms that don't belong to them. Owners who rent their rooms out themselves must also service their rooms themselves. So, by all means, stay at the Daytona Inn Beach Resort. But make sure you reserve your room through their official company website, their phone reservation system, or through one of their travel agents. Don't rent from an owner directly. If you do, you are on your own.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ocala, Florida", "Title": "“THIS IS NOT A TRUE RESORT! Looks like a run down $40 a night motel.”", "Author": "Buffi2002", "ReviewID": "UR110626915", "Content": "I was so excited for this trip. My spouse and I went away for the weekend for the 1st time in 7 years. This trip was for our anniversary. When we got there, check-in was rather quick and no problems. But then I stepped into what they called a \"room\" and that is where it all began. THE ROOM WAS TERRIBLE! The blinds were twisted and you could see through sections of it. The curtain would not cover the window completely and part of it was broken. The \"kitchennette\" was nothing I would want to use. The items were old and looked unclean. Then I got into the bathroom. I had to step down into the bathtub...are you serious! The ceiling was chipping away in the bathtub area. Outside the window, we could see broken brick and rocks (horrible view). THIS WAS SUPPOSED TO BE FOR MY ANNIVERSARY! My husband went to the lobby and asked for a different room and they said they were booked and there were no other rooms available. However, the sign showed 'Vacancy\" when my husband and I left for dinner. Thank goodness I booked my stay through AAA. I called them and they contacted the \"resort\" and next thing you know, we were in a different room. it was better than the first, but still not worth what we paid. I will NEVER stay there again! Oh...I forgot to mention, we could only stand 1 way in the shower. We were lucky that 1 of us could fit in there. If you are going to Daytona Beach for any reason, you do NOT want to stay here. One more thing, the bed was sad. My back was hurting each morning when I woke up. I thought I was going to be staying at a resort...lol!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Irmo, South Carolina", "Title": "“Photos were DEFINITELY taken at a different hotel!!!”", "Author": "scythe33", "ReviewID": "UR107054385", "Content": "When I first saw the pictures in this hotels brochure, i couldn't wait to go. When we entered the room, it was horrible. The weren't there 5 minutes and we already needed room service. The beds were made sloppy and the carpet was disgusting. We found a lot of bugs in are room. The pool was small and mega dirty. When I saw the brochure we were given and compared the pictures to the sight of this piece of crap, I knew that these pictures were without a doubt taken at a extremely better hotel. I couldn't wait for this vacation to end. Please do not go here! Know the place you're about to go. I know now to do my hardcore research before I head anywhere as dishonest and repulsive as this place!", "Date": "May 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“TERRIBLE place”", "Author": "emilysb89", "ReviewID": "UR103052285", "Content": "We arrived at Daytona Inn anxious to check into our rooms and exhausted from a long drive. We were greeted by rude and unprofessional staff. We waited four hours to get into our room only to find out that because it is privately owned, the hotel staff have no way of getting into it. That would have been nice to know when we checked in four hours earlier. We were told \"It's not my problem\". How rude!! We came in two vehicles as well without being told that you can only park one vehicle at the hotel and the other you have to pay to park daily. We left to find a place to park and could not find one. The hotel staff then wrote a parking pass. What a waste of our time. It could have been a nice stay from that point on BUT our vacation was interrupted when we found SEVEN cockroaches in our room in one night. We were told by several staff members that they were not cockroaches and were just palmetto bugs. Duh...palmetto bugs ARE cockroaches and NO ONE wants to deal with them when they're on vacation! The staff was not cooperative at all and seemed to not even care. We also spent the entire week trying to avoid people soliciting in the parking lot and on the beach, ANNOYING! Our room was nonsmoking as well but the smoke from the room next to us filled the bedroom. I could hardly sleep at night because it was suffocating. If you want a relaxing vacation where you will be treated with respect by the hotel workers.....do not go to Daytona Inn.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not bad considering price & location”", "Author": "YourFavThings21", "ReviewID": "UR102660587", "Content": "Rooms are owned by individuals and decorated individually. Pets are welcomed. Has nice pool & kiddie pool, great location right by boardwalk, salty dog surf shop, good restaurants, & entertainment. It's not the hilton but was clean but a little dated, could've stayed at the Hilton for twice the price and same location.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beachton, GA", "Title": "“What a relief to find this place!!”", "Author": "lohpc2007", "ReviewID": "UR90508804", "Content": "It was an absolute nightmare to find a last minute hotel room on Daytona beach that wouldn't empty our wallets.. My boyfriend and I, being on a tight budget, drove around to various hotels late the other night hoping to find an off season good deal at a beach front (or across the street) hotel or inn. Every clerk that we asked the prices for was RUDE and very unhelpful. Even at the Hampton and Hilton Inn, we were treated like absolute crap, the clerks being short and snappy. We finally found the Daytona Inn Beach Resort where the clerk was friendly and smiling and we were pleased to find out that it was just over 40 dollars for the night. The desk clerk even gave us an ocean front room for the side room price! The room was clean, BEAUTIFUL furniture, big TV and fresh towels. This was such a nice quiet place to stay. I recommend for any travelers, college students or family.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Henderson, Kentucky", "Title": "“Beware of Towing During NASCAR Race Weekend”", "Author": "Terry_in_KY", "ReviewID": "UR90413211", "Content": "Returned from race to discover no parking spaces. Security indicated that parking was available across the street until 2am. Unfortunately, the bar/nightclub does not close until 2am. I looked out at 2am to see if parking spaces had opened to find a tow truck hooked to my car in the lot across the street. It cost me $75 to drop the car. Security could still not find me a parking space, so they asked me to park halfway on the city sidewalk. I won't be staying there again - you've been warned - beware of towing during race weekend. The hotel will do nothing to help.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bowling Green, Kentucky", "Title": "“Wonderful Hotel, Great Experience”", "Author": "melissatcc772", "ReviewID": "UR75903291", "Content": "We have stayed at the Daytona Beach Inn Resort three times. Each was great! Rooms can get a little damp from time to time, but it is on the ocean and we like to leave the door open to hear the waves crashing. There is no heat in case you are traveling in the cool months, you might want to ask for extra blankets or bring a space heater. Kitchenette works splendidly! We prepare our meals before we travel, stick them in the cooler, and eat in the room everyday. We saved so much money that way!! We love this hotel so much we want to buy a room!!", "Date": "August 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Central Florida", "Title": "“It could have been a great weekend”", "Author": "Susanne6853", "ReviewID": "UR74824538", "Content": "If we had been lucky enough to get one of the nicer units, it could have been a really nice weekend. Unfortunately, the unit we ended up with was well worn, obviously decorated with thrift store purchases, and barely clean. The mattress on one of the beds was so hard, we might as well have been sleeping on the floor. It's a good thing there was just the two of us, I can't imagine anyone being able to sleep on it. There was a very nice balcony, but the only furniture on there was two very cheap plastic \"dollar store\" chairs---a small table to hold a drink while enjoying the view would have been a nice touch. Apparently some of the units are privately owned and some owned by the Inn. From talking to other guests we ascertained that many of the units are beautifully cared for. The lucky folks in them were enjoying accomodations comparable to the Hilton; we, on the other hand, were bunking in a room more like a neglected Motel 6. On a scale of 1-10 I'd rate the cleanliness a 6; a little sand in the corners doesn't bother me much---after all, we were at the beach. But it does show an inattention to detail, and begs the question...what other shortcuts were taken? The Inn allows pets \"up to 30 lbs\"---which should have kept out the 50+ lb monster that lunged at me on the third floor when I started out of the elevator. Good thing the owner had him on a short leash! On the plus side, the location is great...within walking distance of many restaurants and attractions. The pool area is wonderful (except for the music blasting out of the speaker hanging on the wall outside of the \"tiki\" bar. This was right next to the kiddie pool. If I'd had any kids playing in that area I would have complained about the dangerous noise level) and kept scrupulously clean. The view is fantastic. The front desk staff was very accomodating. I read in other reviews that Rhonda is great, and I second that. She should have the title of Concierge. Holly, the bartender at the Tailgater, was also great. The elevators could use a little more elbow grease. I would stay there again, but I would definately want to speak to someone person-to-person when making the reservation instead of taking whatever \"oceanfront studio\" happens to be available at the time I make the request. One more caveat---we were supposed to be joined by a third person on our second night (our nightly rate was for 1-4 persons). It was only after I inquired about a parking pass for the second party that I was informed the Inn only guarantees one parking place per unit; if they run out of parking places, you may have to pay for parking elsewhere for a second vehicle.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“I loved it”", "Author": "nikkidees", "ReviewID": "UR71799646", "Content": "I loved staying at this resort we where on the beach I lay on the bed and look out to see the waves hitting the sand. the most amazing view of the sunrise it was just like looking at a wonderful paining. the people where great and very friendly Rhonda one of the night staff would go out of her way to do anything for us she made os feel like family . rooms where clean and the beds are so comfortable I did not want to leave I will be back every year well worth the money", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Modesto, California", "Title": "“felt like second home”", "Author": "chazzz_10", "ReviewID": "UR71721601", "Content": "I have read some of the reviews about the Daytona Inn well i don't know what their talking about.I had a great time the staff made me feel like i was at home. the room was beautiful i stayed in room 224 and over looking the ocean and beach anything i needed the staff made sure i had it. told me all the fun places to go . like i said it was great!!!! and to all the people who said it wasn't ,i don't think you are even happy with yourself. so how could you like other people, places or things thank you daytona inn you made me feel so at home", "Date": "July 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“False Advertising Frustrating Tiring Experience !”", "Author": "reviewer603", "ReviewID": "UR71576249", "Content": "Coming from Georgia and arriving at 1:30pm is already very exhausting. With my family of 16 we were very excited to arrive until we stepped into the room. We had 4 rooms and all of them was awful so they offered 2 more and they were still awful. The Rooms consisted of the following narrow stoves, rusted doors, roaches & random insects, tacky furniture, dusty ceiling fans, sticky furniture, crumbs and what looked like animal hair balls, and half working appliances, minature tv's, and rooms with no shower, etc. The whole room felt compacted, nasty, and humid. It was like sleeping outdoors. I couldnt even take a shower it was so nasty. It wasnt anything sanitary about this hotel as a whole from the lobby to the elevator to all 6 rooms we purchased and immediately got refunded A.S.A.P. People please dont get mislead by the pictures displayed online because its the oppisite from what you see. And this is obviously from our own experiences. We were so disgusted we didnt think to snap one picture. Enter at your own risk !", "Date": "July 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ringgold", "Title": "“Great place to have fun!!!”", "Author": "chattsteam62", "ReviewID": "UR70617026", "Content": "First of all the location of the hotel is perfect. Close to everything, boardwalk, arcades, shopping, great food, beach, etc.. Loved the fact no cars are allowed on the beach of this hotel. The hotel was nice with large pool, places to eat and drink, and nice rooms. We stayed in room 225 and it is a very spacious room and is nice. Only problem we had was that the air conditioning in this room wasn't the best, but after buying a fan at the local walmart our trip was perfect. Their is a grill and bar right next to the hotel that can be kind of loud so if you're looking for a quite stay room 225 might not be the perfect place, but if looking to have a great time on the beach and don't mind the party atmosphere then will love the Daytona Inn Beach Resort. The staff is nice and willing to help you with any needs that may arise.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ocklawaha", "Title": "“Fantastic Family Atmosphere”", "Author": "lily2006Ocklawaha", "ReviewID": "UR69801586", "Content": "Located on Daytona Beach where there is not driving...safer for children! Can still see cars if you like watching them, which we did. Walking distance to Pier, Ocean Deck Restuarant and a great little breakfast place on Main St. Pool area, rooms, lobby and beach very clean and well maintained. Room 410 had a great view!", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winter Springs, Florida", "Title": "“Unexpectedly Delightful !!”", "Author": "ENorthOferrall", "ReviewID": "UR69796586", "Content": "All the rooms are individually owned and decorated. Yeah, some of the room owners probably care more than others, but room 118 was unexpectedly cool. I highly recommend this room in particular. Nice flat screen TV, DVD player, wireless access, beach umbrella, board games, small kitchen - nicely wquipped. Very nice walk-in shower and bathroom. Remodeled in May 2010. THE STAFF IS WONDERFUL AT THIS HOTEL!!!! I will particularly mention Kimberly in housekeeping and Ray at the on-site bar. Kimberly could not be any friendlier and is a huge asset to this resort.!!!! MAJOR kudos to her....and give her a raise!!!! LOL. Ray, at the Beach House Bar is funny, accomodating, and you just gotta love him! A great time was had by all........Great location as an added bonus!", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jacksonville", "Title": "“Touch of Home with an Ocean Front View - Wow!”", "Author": "kbtoys928", "ReviewID": "UR68340468", "Content": "Excellent location and very personable hotel staff. From our check-in to our extended check out, this hotel exceeded our expectations. We travel to Daytona quite frequently and have experienced dozens of hotels, motels and such. This is by far our favorite. The hotel is settled between the Boardwalk and before the first ramp for the drive on beach -- which meant no cars on the beach! We walked to the 7/11, Ocean Deck and boardwalk. The hotel was clean. Ice machines didn't last long because guests kept filling their coolers. On site is a little ocean bar and snack shack. Music got a little loud during the heat of the day, but the food was reasonable and the fruity drinks a welcome treat in the 90+ weather. The pools were imaculate. Could use some more lounge chairs and umbrellas to offer shaded areas. It got quite sunny so we used our beach umbrella for the table. The staff went out of their way to ensure our room and needs were met. We have already made reservations for July! Don't miss this hotel - you will thank me.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zürich", "Title": "“BEST EVER!”", "Author": "BarbandVale", "ReviewID": "UR67764392", "Content": "This hotel is just GREAT. We are from switzerland and we have been in the hotel in cpl times. We LOVE to stay in this hotel. The rooms are clean and nice. with coffee maker, Micro Wave. Nice Pool, very good restaurant and bar. The staffs are VERY friendly. We will come back in July 2010 and looking forward to see you all!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Pittsburg, Tennessee", "Title": "“Best Resort on Daytona Beach”", "Author": "BrendaJS", "ReviewID": "UR64414302", "Content": "The best place for fun in the sun. Close by all attractions without the crowds, hustle and bustle. Very friendly staff and the greatest resort manager. Great place for solo's,duos,family&kids. Just returned from 8day 7night stay and this resort was the best. No better place for pool/patio/beach access. All staff members friendly and available 24/7 for customer satisfaction. Great price for the place. Stay here if going to Daytona, FL. I will definitly be returning to this resort only.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eastbourne, United Kingdom", "Title": "“GREAT VALUE FOR MONEY”", "Author": "ironkween", "ReviewID": "UR64021622", "Content": "I was stranded in Florida due to volcano last month so decided to go to the beach and stayed here for four days with husband and our two children. The staff could not have been more helpful and so friendly. You will not get a better location you are right on the beach and there are no cars allowed on that section so great if you have young kids. Our studio had everything you needed to cater for yourself but if you wanted to eat out you are surrounded by restruants for any budget. There is a great mall a couple of miles down the road, a huge flea market on weekends and you are just 5 mins drive away from the Daytona 500 race track. Fantastic I will be going back!!", "Date": "May 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "florida", "Title": "“Horrible”", "Author": "alicecooper2009", "ReviewID": "UR58895871", "Content": "The photos on the web site DO NOT depict the age,size or cleanliness of the room. We were appalled when we first walked in what was described as a Deluxe Ocean Front Suite.Tiny ,dank , dirty and old.....thats what descibes it best. No way was it worth $129.00 a night. $50.00 maybe. We did not stay......", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "west virginia", "Title": "“CLEAN ROOMS - GREAT STAFF - HOUSEKEEPING THE BEST”", "Author": "skully37", "ReviewID": "UR58256849", "Content": "We went to bike week 2010, stayed at this Hotel. Close to everything. Best room in the world, clean. Housekeeping and the housekeeping boss a real pleasure, so nice and friendly. We will be bck next year and hope that all the same people are there. Way to go, Daytona Inn.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“I wish I was still at the Daytona Inn Beach Resort!”", "Author": "cozmo_10", "ReviewID": "UR55107549", "Content": "I just wanted to let you know that we loved staying at the Daytona Inn Beach Resort! We stayed in unit 231, for 8 nights, it was clean and had everything we needed! Plates, silverware,,,,Everything! It had a fun 'surfer' theme with the decor, with a small balcony that we enjoyed. The staff treated us wonderfully! They knew what was going on and where, and we really appreciated their suggestions on what to see! We had a great time! The Daytona Inn Beach Resort was in a great location, we were able to walk to so many different places, close to the Ocean Deck restaurant which is a fun time. The beach was just a few steps past the pool, it was clean, no trash on the sand, and the building itself and the property was very clean. I CANT WAIT TO GO BACK! Carol, the manager at the front office said that most of the units have been remodeled and updated which is good, but I'll try to get the same room. Thanks again!", "Date": "February 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tennessee", "Title": "“Good value for the money”", "Author": "kcbaumbusch", "ReviewID": "UR54638803", "Content": "We rented a 1-bedroom condo at Daytona Inn Beach Resort before reading some of the reviews, and were thinking, \"Oh no - what have we done?\" However, our place was fine, especially for the rate we paid. The condo was not damp as some of the reviewers stated their rooms were; we had cable TV and a DVR; the bed was comfortable, the bathroom was clean (although a trifle dated), and everything worked just fine. There was security in the parking lot every night, and the maintenance crew was very much in evidence around the place cleaning, painting, etc. The kitchen came complete with kitchen linens, microwave, 2-burner stovetop, and refrigerator; it also had electric skillet, toaster, coffeemaker, toaster oven, cooking utensils, and pots and pans. The small electrical applicances were not the newest, but if I owned a condo I wouldn't have state-of-the-art stuff either because it would probably disappear. The only 2 problems were: 1) the room heat was on when we checked in and we found that the air conditioning had been shut off for the season, but for January, Daytona doesn't get so warm that you really need AC! 2) The DVR did not function correctly but we let the owner's manager know and we got another one which did work. One main draw was that they allowed dogs and it was on a non-driving section of beach. I would stay here again!", "Date": "January 29, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Calgary", "Title": "“Great trip”", "Author": "rallycor", "ReviewID": "UR47630716", "Content": "Stayed fror a week in Feb. great location, close to everything. Walking distance to restraunts and nightlife. Golf packages are awsome. Room was good. Great beach location. Less than an hour drive from Orlando airport. Will definatly stay again.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Apollo Beach, Fl", "Title": "“Great weekend, thanks to the great service we got.”", "Author": "Patm0614", "ReviewID": "UR47434758", "Content": "When I go to Biketoberfest I usually stayed at another hotel, but this year I decided to stay at Daytona Inn. The other place was 1 block closer to Main St. but the parking was so bad and no security. This place was great. There was security around the parking lot all the time watching everthing and all vechiles. The service I got from the desk was great. Pam at the desk gave me exactly the room I needed for health reasons. The room was clean and the whole long weekend was really nice. This will be the hotel that we stay at from now on. Thanks for the great service.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Louisville, Ky.", "Title": "“Great time”", "Author": "LauriKy", "ReviewID": "UR45945860", "Content": "There were over 60 people in our group that visited the Daytona Inn Beach Resort. The staff was helpful and courteous. The rooms were comfortable and clean. The hotel is convenient and provided a great atmosphere for a fun time for all. We look forward to our next stay there. We are planning two trips to this hotel next year - one with our kids in the summer, and another no-kid trip. We are all looking forward to both trips and know we will be well taken care of again.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "st augustine florida", "Title": "“Celebration of the Big 50”", "Author": "dragonqueen_007", "ReviewID": "UR43718265", "Content": "What a great way to spend one of the most important events in your life....the big \"50\"...My sister livies in Michigan and wanted to come down to Florida to celebrate her birthday....My sisters (2) and myself live with in 50 miles of Daytona Beach and were looking for a place for us all to stay that had location...location...location...And this place was it.....Ocean view balcony........within walking distance to the pier and Main street,......A beautiful pool with DJ and bar....(starting at noon daily) and a Sports Bar and Grill......The rooms were up to date and very clean.....The staff was amazing....friend and very helpfull...they even offered night time security, which is a plus.....Will i come back? Oh yes.....We are planning on making this a yearly event.......but as for me.....it may be sooner....", "Date": "September 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Daytona Inn Beach Resort? (resort are you for real?)”", "Author": "twoxtack", "ReviewID": "UR38676107", "Content": "We stayed at this hotel based on 'photo's' from their website. Needless to say, they must have taked the photos from another resort. The moment we drove into their parking lot, I knew we were in for an 'interesting' stay. Hard to find the lobby to check in. The decor in the lobby was nice. It was obviously aged but neat and clean. The staff was courteous and friendly. At check in we found that all the 'rooms' are individually owned. HMM! Signing the registration papers I noticed in big bold red print...NO REFUNDS!!! HMMM! Our room was #317. Upon walking in, it was obvious that this 'owner' wasn't into maintaining thins room. Room also smelled damp. What could you do? Your in for an expo? No time to run from hotel to hotel to check vacancies. Plus there were three parties staying in one location. We chose to make the best of it. We had our own linens, and we went to cleaning. It appeared adequately cleaned. WOW it wasn't. The shower pressure was so bad I rinsed my hair in the sink. Toilet ran constantly so we turned it off at the valve. The beds made so much noise that you dared not moved. The sitting area, well...we chose to never use it. Kitchen counter was old laminate that was worn, stained and buckled. The cabinet doors also swollen from the moisture. Kitchen sink constantly dripped. The staff was 'johnny on the spot', when our room key quit working. Had it fixed before we even returned from the front desk. There is nothing positive about the room, and NOT worth the $100 per night charge. If your staying in Daytona with friends and your here to drink and party, and you don't care about appearances as you will be too drunk to notice, then this is your place. If your looking for a clean place to take your family..then stay away. I must say that the person doing their website, is great at Photo Shop. Not one thing looked as shown on the web site. As I said before we were with two other couples, one couples room was adequate, and the other couple asked to be moved to another room, which the staff did. With 2 out of three of us getting rooms less that satisfactory, sorry, but this place is not one I would ever want to return to..", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Stuart, Fl", "Title": "“Affordable and Very NIce”", "Author": "jim3instuart", "ReviewID": "UR38641974", "Content": "We recently stayed at the Daytona Inn Beach Resort on Daytona Beach. We were a little bit apprehensive because this is one of the older properties on the beach. Many of the past reviews were very nagative on this property, but we found it to be nice with a very nice attentive staff. The property is perfectly located directly on the beach at the end of Speedway Blvd so it's easy to find and is centrally located. In the past we have stayed way north and south of the boardwalk area plus we have stayed at the Hilton on the boardwalk. This is a little more private, safe non driveable beach but within walking distance of everything (shops, main street, boarwalk, restaurants, etc.). Anyway, great room, clean, nice staff, nice complex, great little pool bar, very pet friendly (35 pet deposit), great all around. We stayed in a one bedroom suite with a teenager. It was nice to have the seperate room plus there were plenty of things (girls, other kids, girls, beach, pool, girls, boardwalk arewa,and did I mention girls) So two thumbs up, you will not be disappointed. Plus this is way more affordable then places like the HIlton that get double this rate and then charge you 20.00 per day to park your car.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "orlando", "Title": "“Never again”", "Author": "notsobeachy", "ReviewID": "UR35020027", "Content": "stayed for a week and wanted out. The first day i got there, the room i stayed in was so humid the beds felt wet and my clothes smelled that night. The sheets had a bunch of stains on them and smelled. The window next to my bed was filthy! The blinds had a thick layer of dust and weird green mold type stuff, and the curtains were stained and smelly. The floor was slmy feeling when the room was humid, and when it finally cooled down the floors were nasty and whithne a minute of being bare footed my feet were covered with dirt.Our bathroom door would not sht, so you had to slam it to stay shut, atleast four or five times but that would'nt even work most of the time. When i got back from the onfrence i was at i relized they had'nt given me towels so i called for some and the staff was extremly rude saying \"Well, you couldnt have figured out you didnt have towels earlier?\" and didnt reply when i said thanks, just trying to be nice. i will never stay at this hotel again.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Louisville, Ky.", "Title": "“Great Hospitality!”", "Author": "KyhurricaneLauri", "ReviewID": "UR33580494", "Content": "I was very pleased with the hotel. The entire staff was pleasant and helpful - from the cleaning staff, to the pool bartenders, to the desk personnel. The hotel was clean, comfortable, and convenient. The pool bar and music added even more fun to this hotel. We thoroughly enjoyed our stay and are looking forward to staying at this hotel again. We will definitely recommend this hotel to our friends.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kissimmee, FL", "Title": "“Great Location”", "Author": "raump3", "ReviewID": "UR28722367", "Content": "Thank You for an enjoyable stay. I recently stayed at your resort from April 21st - April 23rd with my Mother and nephew. We all enjoyed the stay. I like how close to the beach you are. Like the fact that you are right off the main road and that you have Tailgators right there as well. I will definatly be visiting again in the future. Thanks again for a great stay.", "Date": "April 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "indiana", "Title": "“Best of Daytona Beach”", "Author": "steve_ail", "ReviewID": "UR24903474", "Content": "First of all this is the 3rd time we have stayed at the resort and I want to let everyone know for the money there is not a better valued motel on the beach. If you are reading the negativity about this place you are listening to a bunch of whiners that would not be happy at the marriot at $500 a night. We just got back from the Daytona 500 and this was our best stay yet. We will make this our stay for years to come. The location, pool deck, ocean view, space of the rooms along with housekeeping is fabulous everything the beach has to offer is walking distance.. The friendly people who run the hotel are like close family when you visit. I highly recommend this hotel for anyone visiting the area. Thanks for the hospitality", "Date": "February 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Stay Away Not At All as Advertised”", "Author": "Brenda50", "ReviewID": "UR18517862", "Content": "irst of all when we arrived the maintenance man was leaving our room. The room was hot and he stated he had just serviced it and he \"guaranteed\" it would be cool shortly. We left for a few hours, came back and it was still hot. The room averaged 87 degrees at night. The next morning at 8:30 a.m., I called the front desk and reported it. I called again at 2:30 p.m. Then again at 8:30 p.m. By this time, the guy at the desk stated he didn't know anything about the air not working. I asked for the manager, he stated she would be in at 10 the next morning. We went and bought fans, we had already askes for another room due to other issues and of course they had none. The next morning I called and asked for the manager, the girl stated oh she's not coming today, can I help you? Sure, you can fix this air conditioning I've complained about for 2 days. Very rudely, she stated I haven't been here for 2 days, I didn't know it was not working. So I went to dress and go to the front office. While dressing there was a knock at the door, was the maintenance guy bringing a fan. After a few more words, they came in and checked it. Thought they had found the problem but no it still didn't work. Through all this the manager not at any time tried to address the issue. I spoke with other people there who also had no air conditioning. The first day there I had to ask for maid service. The floors were so nasty you had to wear shoes at all times. The room key never worked. They had a tiki bar that nev er opened. Oh, but the bar/lounge was very clean and very cool. So is the lobby. We went to the lounge to order some lunch and it was extremely cool. One more thing, they don't mention on there website the homeless that hang out there or the drunks that stay in the parking lot at night from the lounge. So vacationers beware.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Spring Hill, FL", "Title": "“Great location and pool area”", "Author": "JKSKFultz", "ReviewID": "UR17665287", "Content": "The rooms were outdated and dirty. The toilets would not flush unless you held the handle down until it completely flushed. The shower curtain was ripped. The tile floor throughout the unit was dirty. One of the mattresses was covered with mold. The closet door would not shut easily. The outside door to the so-called balcony had to be slammed to get it to close and very difficult to open. The exterior was dirty with water standing by the steps (near the kitchen from the bar below). The pool area was very nice with a great pool. If you left in the evening, it was difficult to find a parking space when you returned. Security would have cars towed away and then would call your room to have you move your car to a parking space. Very nice location. Pay the upgrade and get a newer unit with ocean front view.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tennessee", "Title": "“Do not stay!!”", "Author": "Tristian", "ReviewID": "UR17368306", "Content": "First, we get to the Daytona Inn and we were overcharged $70 than what we were quoted on the phone by Carol the manager. We get to our rooms, which we had 4 rooms. They did not book the rooms on the same floor like we were told they were going to do but we looked over that. The air conditioner did not work in 3 of the 4 rooms. The shower would not work in one of the rooms. We reported all of the problems and they came and looked at it and said they were all working. Our room was 84.6 degrees one day. Our room keys did not work half the time we went to the front desk almost everyday 2-3 times a day excahnging keys. The floors were dirty. I wore my shoes everywhere in the hotel room. Housekeeping was good to exchange towels and stuff but that was it. They were working on the concrete one day and they started working with a jack hammer at 8:00 two mornings in a row and did not end until 5 or 6 that evening. I would not ever stay there again. We ended up checking out 2 days early.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NewJersey", "Title": "“Great Vacation”", "Author": "LilShamrock", "ReviewID": "UR17089526", "Content": "My husband and I have just returned from a most enjoyable, relaxing and friendly stay at this hotel and are telling all our family and friends that if they want to just get away for awhile in a great atmosphere, then the Daytona Inn Beach Resort is the place to stay! I mean the rates are quite reasonable, the location is the best and everyone on the staff made us feel right at home, including the housekeepers. We were even welcomed upon our arrival by the General Manager Carol! We had a beautiful oceanfront room with the most awesome view!! The rooms are nice and cozy and very clean. They have an olympic size pool as well as a kiddie pool, and are located right on the ocean! I highly recommend this hotel to anyone who is planning on staying in Daytona Beach. Make sure you get an oceanfront room so you can see the best sunrise ever! My husband and I will definitely be back for another stay.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new hampshire", "Title": "“wow loved the daytona inn beach resort”", "Author": "rayjenot", "ReviewID": "UR16732833", "Content": "we just got back from our stay at the resort, the weather was perfect the traffic free beach out from resort was really mind easing because i brought my wife and 2 kids 13 & 16 and my 6 year old and when i checked in i was greated by the most friendly staff and the most pleasant manor and a timely fashion. i think they were changing shifts and we all all know that the service can really be poorat this time, but to my surprise the general manager came out to greet us and welcomed us to the resort. the rooms were very clean and everything you needed was in our room evan the windows were clean, and when my wife needed something the housekeeping was right on top of it , my wife needed an iron but housekeeping was closed for night i called the front desk sure we have one here at the front desk and the front desk guy it's my pleasure sir. they evan had a family restaurant / sports bar on premises. in all in all i will be coming back to this resort for many years to come... very satisfied customer mr & mrs. jenot", "Date": "June 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quitman, GA", "Title": "“Absolutely loved it!”", "Author": "chef_stasi", "ReviewID": "UR16672507", "Content": "My daughter and I spent 3 days researching hotels and found this one to have pretty good reviews...well, they were right! We booked the crazy managers special and got a very nice room with seperate living area. The pools were inviting and we could not smell any bad odors anywhere. Housekeeping did exactly as we asked. The room decor was very \"beachy\" and clean. Darrell checked us in and was able to offer lots of good advice for the beach scene. He made us as comfortable as we could be! Thanks Darrell! We will definately return and also tell everyone we know to go to the Daytona Inn!", "Date": "June 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jamiemac26", "Title": "“YOU MUST STAY HERE”", "Author": "jamiemac26", "ReviewID": "UR16670991", "Content": "After canceling reservations at another hotel, we stumled upon this one. The hotel was awsome, the view amazaing and access to the beach was so easy! The front office people were really nice and helpfull. The rooms were very large, all tile floors with a superior view of the ocean. The bathroom was very clean the water pressure from the shower awsome! We plan on making this our perminent vacation spot in Daytona. By the way, you cant be the price either.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Apopka", "Title": "“I will NOT BE RETURNING EVER...”", "Author": "Kind1234", "ReviewID": "UR16409213", "Content": "We stayed here for 2 and half days. I did not like the bad smell by the pool area. The hotel is not well maintained on the outside as well as the hotel staff. My room was not cleaned and when the housekeeping lady came by she only asked if I needed anything??? I asked for clean towels, she had none and would bring them later, she NEVER came back. I had to go ask the front desk for towels, I was given clean pool towels from other previous guests (lost and found). The outside area of the hotel is gross and not maintained AT ALL. Cleanliness is not a high priority. It would be what I call a DIVE hotel! I do not recommend this hotel as family-friendly. IT was the worse hotel I have ever stayed at. I WILL NOT BE RETURNING was muttered by other guests besides me. A learning experience for allowing someone else look into hotels for our group.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Eastbourne, UK", "Title": "“Thanks to my friend”", "Author": "megelttil", "ReviewID": "UR16282450", "Content": "Thanks to my friend visiting this hotel earlier in the year, I knew where to go when I was in Daytona Beach. We were only there for four nights but it was really nice. We had a lovely room over looking the pool and the beach. It was so great to be able to sit out on the balcony and listen to the surf rolling in, I found it a great incentive to get up early each morning and go for a walk along the beautiful beach with my feet in the ocean, what more could you wish for. The hotel itself, is well situated for your every need and the staff were very pleasant and helpful. Certainly a place I would now recommend to all my other friends. A not so mature couple from the UK", "Date": "May 21, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "deltona fl", "Title": "“good place to stay”", "Author": "daltonray", "ReviewID": "UR16256138", "Content": "We stayed at the daytona inn beach resort for a Saturday night stay. It looks a little rough on the outside as all beach properties do after wethering many huricanes but the inside is wonderful. The room was recently renovated and very nice. Tile floors to help with the sand a very nice bathroom renovation and a little kitchen with a microwave and fridge/freezer. The pool was very large and right on the no drive part of the beach next to the pier. The location was great. The pool is not heated so it was a little chilly and there is no hot tub. The tiki bar was closed until memorial day but there are plenty of others near by that were open. Those were the only down side. I would definatly stay there again it was a great deal for the money only 65 a night on the internet.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lake Worth", "Title": "“Flip City Loved this location”", "Author": "FlipCity", "ReviewID": "UR15265925", "Content": "We took our cheer group up to Daytona for a competion the kids were ages 5-18 and they all loved the location right on the beach. The staff was very friendly & helpful as well as the price was affordable for the location. We would definately stay here again should we have any meets in that area. The hotel is in the area where cars are not allowed to drive which was an added bonus for safety of our kids. We were also in walking distance of many restaurants as well as the boardwalk.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new jersey", "Title": "“Good value”", "Author": "auntdani", "ReviewID": "UR14947922", "Content": "We went to Daytona for the Pepsi 400 last year and will be again this year. We stayed at this property and thought it was a good deal for the money. We'll be staying here again. All places in the area are a bit more for special events. I have started planning our trip and read the recent reviews. Some of the negative ones, made me think we stayed at a different property! Our room was #202, I think. It had a beachfront view and the view was tremndous. I loved going out on the balcony and gazing at the ocean. The room was in great shape and the decor was very nice. The beds weren't the best I've ever slept in, but they were comfortable. The bathroom was a bit dated, but it was clean with plentiful towels. I loved the little kitchenette to store snacks and beer. Even had dishes, etc. and a microwave! We also enjoyed the beach, (only steps away) and the very clean pool. Had and outdoor bar which was perfect for us. We stayed in a different beachfront hotel a few years ago, (in the shores area, I think) and that was disgusting! Also the location is great! Didn't have any trouble with the front desk people , thought they were fine. Housekkeeping good as well.", "Date": "April 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Neptune, NJ", "Title": "“Fantastic would stay again”", "Author": "stujo", "ReviewID": "UR14885312", "Content": "We had a fantastic time here, everything was better than expected. The rooms were clean & well kept. Will come back again next year.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eastbourne", "Title": "“Great Location, Friendly Staff”", "Author": "littlegem888", "ReviewID": "UR14873307", "Content": "Whilst on a holiday in Orlando last month, I found myself in Daytona for a few days , this is when I found the Daytona Beach Resort Inn. I was waiting at the lights coming off International Speedway Blvd. and there it was, right accross the road on the corner, I pulled in, tired and needing somewhere for a few days. The front desk area was pleasant and the staff were really nice, I got a room facing the ocean, (not all rooms do this) but mine was charming, standing on the balcony and watching that great ocean was just what I needed after the hustle and bustle of the theme parks. The location was great, right on the best part of the beach, close to shops and reastuarants and not far for the Daytona Speedway. Next time I visit Orlando, I will definitely head for a couple of days R&R in Daytona. Linda. English Lady in early 60's", "Date": "April 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Best Vacation Spot!”", "Author": "L0ve2TravelNY", "ReviewID": "UR14860841", "Content": "My family and I just returned from a great vacation in daytona beach, Fl. We stayed at the Daytona Inn Beach resort which is in the middle of everything. We didn't realize there was spring break going on and the rates would be higher. Upon check-in the manager came out to talk to us and realized we weren't spring breakers, and gave us a discounted rate. They also gave us coupons to the water park which was just walking distance from the hotel. We stayed in an Ocean Front Suite, which had a private balcony right above the pool, facing the beach. The boardwalk is walking distance and there are some really great restaurants near by. We also asked for late check out as kids wanted to sit out by the pool longer. Daytona Inn Beach Resort has the best location. The staff was very friendly, they made our stay very comfortable. As long as my wife and kids are happy, I'm happy.", "Date": "April 7, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ottawa, ON", "Title": "“Worst Place We've Ever Stayed”", "Author": "sunny020", "ReviewID": "UR14583751", "Content": "Dont ever stay there, its terrible!!! I agree with the other reviews I have just read. The Daytona Inn was awful. We drove to Florida from Ottawa, Canada and were very dissapointed with the place. We only stayed 3 out of the 7 nights and were out our money. The bed sheets were dirty, the place smelled musty and just dirty. Carpets were disgusting. I contacted the owner of this place and they refused to refund any $$$, very rude to deal with and called me a liar. All they have to do is read the rest of the comments from other travellers and the truth be known. Stay anywhere but here - the only good thing was the pool and beach, we stayed outside as much as possible. Only went in to sleep.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Don't Stay Here if you want to enjoy your vacation!”", "Author": "Annabellea", "ReviewID": "UR10357542", "Content": "I have traveled a lot and I have been to Daytona several times but this is the worse place I have ever stayed. Rooms are dirty and poorly kept. Water in shower went ice cold or burning hot suddenly. Even right after the maids cleaned the room you could walk across the floor bare foot and your feet would be black. There was sand on the beds when we first got there and the room was very outdated. Hotel front desk and office staff were very rude, but housekeeping and maint. were nice. Elevator was down right frightening. Daytime front desk clerk could not speak English well enough to understand. The day before our checkout the front desk called our room and told us we were supposed to check out that day but we had already paid until the next day. After I said we were not paying any more that we would just go to a different hotel they decided they had made a mistake and we didn't owe them more money.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Your Talking HOT”", "Author": "turney92", "ReviewID": "UR8497234", "Content": "Don't stay here if you want to stay cool in your room. The first day the A/C was out until after midnight, it was > 85 degrees in the room. After the repair, it never reached below 80' in the room. We had to sleep with wet towels on our heads and chest to cool down. This is an OLD hotel and the rooms are not clean, headboards broken, bathrooms filthy, they refused to allow a second vehicle on the property and advised we could park three blocks away and walk back or the vehicle would be towed. It was loud at night, although the pool closed at sundown, people were in there all night yelling and screaming. When we checked in, the back door exiting to the pool/beach area of the room did not even lock and that had to be fixed. The management/owners did not care about your concerns. They just argued back to you. There are many other areas on this beach to stay that are much newer and nicer. I will not make this mistake again, especially at $100 per night. I booked in advance with Expedia, and also took the cancellation insurance but that would not apply. They had my money already and would not refund it so we braved the heat and filth for 4 days.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1"}, "AuthorLocation": "Ohio", "Title": "“Worst Hotel”", "Author": "0216", "ReviewID": "UR8126189", "Content": "Daytona Inn Beach Resort was the worst hotel I have ever set foot in. Our room was dirty even after the maids came to clean it. They gave us a room where they knew that the floor was coming up and needed replaced and gave us no refund, discount, or anything. The only day we let the maids in our room to clean, I WAS ROBBED. I had everything locked up tightly and somehow someone got into my locked room, my locked luggage, and locked safe and stole my things. The hotel management was not concerned and my friend that I chose to vacation with was accused of taking it. It was a horrible experience.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Value for Pepsi 400”", "Author": "one4gatr", "ReviewID": "UR8084096", "Content": "I am always amazed at the reviews I see for these low cost Daytona Beach area hotels. Apparently most of these travelers have not stayed at many Daytona Beach hotels. I have been going to the Pepsi 400 race for the last 12 years and have stayed at many \"budget\" hotel rooms in this general area. First let me tell EVERYONE who cares to read this: you will ALWAYS pay a higher premium for ANY hotel in Daytona during peak summer months and surrounding special events. I am so sick of hearing \"$200 an night is outrageous\". Sure I wouldn’t pay $200 for this room under normal circumstances but again I came down during a special event. I actually booked 2 rooms this last weekend at this hotel. $179 for non-beachfront and $199 for beachfront. Both rooms were studios and were appointed about the same. both had tile floors, small kitchenette, tv, and balcony. Both were on the 1st floor. Rooms 120 & 128. Overall the rooms were reasonably clean and well appointed. The rooms do show some signs of wear and exposure to the beachfront elements. Another thing people who don’t live on the ocean don’t get is that the salt affects EVERY hotel in Daytona Beach so you will see some signs of rust and deterioration no matter where you stay. The hotel has a very nice lounge/restaurant. Prices are reasonable. Food is fair. Overall this hotel is nice and very comparable to most in Daytona Beach. It is not extravagant or luxurious but it is adequate. I rated this hotel a 4 compared to \"other hotels in the area\" not hotels elsewhere. If you are looking for a reasonable value, basic appointments, and convenience to the beach and local activities this place will well suit you.", "Date": "July 9, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Lorain, OH", "Title": "“Great place! Closest to Convention Center”", "Author": "flaorbust", "ReviewID": "UR7544630", "Content": "We went through Condos in Daytona, a management company run by Stephanie Jones, who has several units within the complex and throughout Daytona. We had a fabulous time, the rooms were spotlessly clean, and the proximity to everything was fantastic. We were attending a function at the Convention Center, and I believe this is the closest condo complex within walking distance. Places like Oceanwalk, the Hilton, and others that were closer were astronomically priced, or didn't even have microwaves or fridges, less alone full kitchens. The restaurant on premises called Tailgaters was fantastic, and the prices were reasonable for a resort area. They gave you more than enough to eat, and the food was superb! I particularly liked this complex because it wasn't on the drive-on area of the beach. Although the parade of autos and other vehicles are only traveling at 5 mph, I fear for small children there on the beach. I don't have one single complaint about the complex, and I think some of these reviews are greatly exaggerated. The place is great, and I certainly would return!", "Date": "May 4, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kim, Jacksonville, FL", "Title": "“Stayed for 3 months”", "Author": "huggypa", "ReviewID": "UR6710354", "Content": "Having relocated to Daytona from Jacksonville, I needed a place to call home for a period of time. I made reservations at a hotel, I will not mention, only to not check in due to the rooms. I remembered staying here one weekend, so this is where I went again, spur of the moment. The hotel staff is excellent. They are nothing but accomidating. They make you feel like your at home. In my stay I experienced 4 rooms, (due to other reservations). All of the rooms could not be better in my opinion and they all have their own personality. They are clean and well supplied with everything you need to live an everyday life away from home. Anything that I asked for that wasn't standard in a room I received, ie: iron. It is convienently located to anywhere you want to go to in the Daytona area. There are 2 privately owned restaurants attached to the hotel that are very accomidating. One is a sports bar and the other an outside and inside Cafe. The owners are wonderful and the food is excellent. Most of the time, I ate at one of the two for three months straight. There are many other restaurants convienantly located near by so that something is available for everyone.", "Date": "January 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "douglasville, ga", "Title": "“The reviews scared me”", "Author": "hapyday", "ReviewID": "UR5576323", "Content": "I booked this hotel the day before I found Tripadvisor and was afraid I would arrive in Daytona and have to find another hotel. The Daytona Inn is really very okay. Seems every hotel in Daytona is about 40 years old except for the Hilton. Our room was clean, no signs of any little creatures. The grounds were well kept and the pool area was clean and pretty. I know they clean the pool because I watched a quy clean it on Thursday. I broke the stopper on the bathtub and maint. was there to fix it within 15 mins. Daytona as a whole as become much grungier than in years past. Seems to be a number of homeless people hanging around, but security at the hotel seemed to be on top of letting them be around the hotel area. My 26 yr old son was sitting at the pool about 2 in the morning and said sercurity grilled him about who he was. GOOD JOB. If you need fancy to be happy, stay at the Hilton(but they seemed to have the bums too) but if you just want a fun time the Dayton Inn Beach Resort is just fine. P.S. we never once had a problem parking", "Date": "August 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Beckingham, England", "Title": "“Great Stay”", "Author": "sc355", "ReviewID": "UR5529987", "Content": "After a long journey from the UK its was good to arrive to a freindly welcome from the staff at the hotel. Our visit to the states was great and made even better by the service and location of the hotel. Looking foward to our next visit (already booked). Would definitely recomend this hotel", "Date": "July 30, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Daytona/Port Orange", "Title": "“Awful place, ruined my vacation”", "Author": "John1963", "ReviewID": "UR5435244", "Content": "The other negative reviews say it all. Wish i took my camera, these people posting 5 star reviews must be talking about another \"hotel\".", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Good value, excellent location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5424248", "Content": "I am concerned about the reviews that I have read about the Daytona Inn Beach Resort. My experiences there have been only positive, We stay there every year and the rooms have always been clean and the staff has always been polite and helpful. I can't imagine any problem that could arise that would not be solved immediately. The Manager, who is always on premises, (at least seems to be) is cordial, helpful and friendly. She helped us a few times when we wanted to play some golf and wanted to do some sightseeing. The Daytona Inn is also within walking distance from many attractions including the Bandshell, Movie Theaters, Boutique shopping etc. We walk along the beach to these places since there is a no driving beach in front of the hotel It is so easy to get to. This is the first hotel you come to as you travel from the airport and turn onto A!A. And most important is the price. I never have felt that the prices are high and that is why we always stay there.", "Date": "July 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Omg Loved It!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5416099", "Content": "OMG!!!!!!It was so amazing!! It was like a mini beach house!!We had a pool/oceanview!!It was so amazing!!Want to come back everytime I go to the beach!!!You could just leave the hotel walk through this little thing and your at the beach!!!Many shops around and food places!!!Great experience!!!!Would recommend it to anyone!!!It isin't expensive either and there is a little restraunt too!!!!!!Best place ever!!!!Had no problems what so ever!!!Everything was perfect!!Nothing NASTY or DISGUSTING not a thing wrong with this hotel!!! L O V E T H I S P L A C E!!!!!!!!Anybody who is looking to have an awesome time at the beach you should stay here!!Very convient!!!This is no lie you should stay here best place ever!!!!!Stay here and have a good time and leave good reviews!!!Awesome place!! Will stay at again when I do come!!!!LOVE IT!!!!!!!!!!!!", "Date": "July 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "ca", "Title": "“nice property, great location and very nice staff”", "Author": "kdcjsc", "ReviewID": "UR5413355", "Content": "I just saw the horrible review on Daytona Inn and I had write. My family and I stayed at the hotel in April when my daughter had a cheerleading competition. We stay in an oceanfront suite which had--two t.v.'s, full kitchen, sofa bed---which was great with kids. I know that everyone has different opinions on hotels but for the money we paid and the convenience for my family I thought it was terrific! I didn't see any trash around the building and all the help was in uniform and very friendly to us. I didn't pay Hilton prices and didn't expect the Hilton. Thanks to the staff--we will be back.", "Date": "June 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Great Experiance”", "Author": "A TripAdvisor Member", "ReviewID": "UR5374581", "Content": "Very clean rooms, the staff was great always asking if everything is ok and the view is amazing! The security that they have also is first rate it helps knowing that they are always watching out for thier guests safety. Overall this is one of the best hotel experiances that i have had in daytona. I would reccomend this hotel to anyone who wants a beautiful room and a great guest experiance. Will be back next year!!!!!", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "eustis,fl", "Title": "“worst hotel experience ever!!!”", "Author": "amber147", "ReviewID": "UR5233060", "Content": "the photos on their website are not real!! i dont know when they took them i guess when it was first built. but they are very misleading. i would never stay here again. i would have rather slept in my car. our beds were very uncomfortable and the floors were very dirty. you had to wear your shoes at all times. the air conditioning did not work and we notified the front desk of this twice during our stay and nothing was done about it even though they promised it would be. also the pool was very dirty!! i was also promised this would be cleaned out and it was never done either. the toilet broke and they didnt even leave toilet paper in their. you had to call housekeeping and ask for that. there is no air vent in the bathroom and the t.v was terrible you couldnt even watch it for the horrible blurriness. there were bugs all over the walls and moths everywhere. the couch in the room was soaked and you couldnt sit or put anything on it. i would never recommend this hotel to anyone and i would never stay here again. it was horrible and needs to be shut down. even the bathrooms in the hotel lobby dont have air vents.", "Date": "May 29, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Dirty Hole in the Wall”", "Author": "A TripAdvisor Member", "ReviewID": "UR5145594", "Content": "During my stay at the Daytona Inn Beach Resort I experienced horrible conditions. The room had dirty towels left in it upon arrival. Handles were missing off the doors to the closet. Also the ceiling leaked from the restroom in the room above. Housekeeping would often take our towels and not give them back for several hours. Often they would knock on the door earlier than 9AM. I do not reccomend the Daytona Inn Beach Resort to anyone.", "Date": "May 17, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Wow - what a beautiful \"on the Beach\" accommodation and service”", "Author": "A TripAdvisor Member", "ReviewID": "UR5044591", "Content": "We just wanted to share our experience with a great vacation for a much needed rest on the beach! The Daytona Inn Beach Resort is right on the beach in the heart of Daytona. Outside your door is lots of sun, sand and water. Out your 'front' door is the main Daytona Beach location - rides for adults and kids, restaurants and shops. The Speedway is near by if the race is on. This is truly in the heart of Daytona Beach. The room has all the facilities - a kitchen for essentials you need - coffee maker, fridge and stove for light meals. The bed was very comfortable - just like home, the couch and chair were convenient for TV (can't miss the sports) and most important the outdoor area provided comfortable lounges. The large pool was clean and inviting. We spent most of the time relaxing and enjoying the beach and ocean. And to round it all off, the staff was very friendly and helpful and the service was exceptional. So, if you are looking for a wonderful beach location where there is unspoiled sandy beach, convenient affordable accommodation and excellent service - this is it. We would highly recommend this hotel and look forward to a return visit.", "Date": "May 9, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "WV", "Title": "“Nightmare!!!!!”", "Author": "pinkypoo", "ReviewID": "UR5003255", "Content": "Where to begin!!!! Undoubtably this resort is the poorest place we have ever spent a vacation at. The room was horrid, the floor was filthy dirty--never been swept or mopped! You walked across it from the moment we arrived and your feet where black with dirt! HAD to wear shoes at all times.(even directly from the shower). The TV romote was broken-we reported this but was NEVER fixed. The doors where hard to open & close-had to slam your body against them to close them. The beds where poor quality cheap foam and very uncomfortable. The tub & sink drains where SLOW, had to stop my shower and wait til it drained before I could finish it EVERYDAY. The toilet would lean forward everytime one would sit on it! We also killed 2 roaches!!!!!!! The air conditioner was so old it sounded like a train blarring when it kicked on, couldnt use it at night. THIS PLACE NEEDS A GOOD SCRUBBING TOP TO BOTTOM! The closet floor had water in it at all times, made out luggage WET. The balcony had only one chair. The pool stayed dirty, others complained of this too! I have never experienced a hotel like this one before, hopefully I wont ever again. I cannot believe the photos or messages on their site are real,...UNLESS we are the ONLY patrons to receive a terrible room like ours. (Looks like alot of people have the same resonse to this place as I do)The last straw where the roaches! That did if for us, totally disgusted with it all. MAYBE they will actually take note of these problems for your future patrons, I SURELY HOPE SO!!!!!! The Manager needs to really make sure things are getting done as they should, this place was truely a disapointment and totally different from the photos and guestbook messages listed on this site. Felt like we needed a hot bubble bath after being in this place, it was so dirty! The bar next door was loud, bums asked us for money, it smelled of beer around the hotel. No one at the front desk could care less about anything. It would be my recommendation that some really good repairs be done to the rooms, scrubbing them would be GREAT, and call an exterminator! So sad to advertise one thing and give your paying guests this type of service. I would have rather slept in the car than sleep in this so called \"resort\" again! Ive seen much cleaner dog pounds than this place! SERIOUSLY! I think the health department needs to make avisit there SOON! Dont believe the decent reviews I dont know where they stayed but it wasnt here at the DAYTONA INN BEACH RESORT.......what a total nightmare! --------------------------------------------------------------------------------", "Date": "April 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Peru, IL", "Title": "“Our Home Away from Home!”", "Author": "Sandyj55", "ReviewID": "UR4822593", "Content": "I just spent Jan, Feb and the first week of March at the Daytona Inn with a tour group from Illinois. I loved the idea of having a seperate bedroom from my living room and a couch to sit down on in the evenings to watch TV. The ocean was right outside our back door along with the Pier, the Ocean Walk and many restaurants. It was so convienent for my guests to be able to walk to many different restaurants and the trolley stop was right in front of the hotel. But the most important thing about our stay at the Daytona Inn was the staff. Carene in group sales bent over backwards to honor my guests requests and Jeri at the front desk that had to put up with me day and night!! Joy in housekeeping and Raymond in maintance were always right there when you needed them. But my heart felt thans goes out to Carol, the General Manager of the hotel. Not only did she do her best to make 80 people happy all the time but did special little things for us that went above and beyond the call of duty. She even threw us a party one night with refreshments and entertainment. From the bottom of my heart I want to thank the entire staff at Daytona Inn for a wonderful two months and I can't wait till next year to see you again!!! Thanks from all of us at Hansen Tours...Sandy", "Date": "March 30, 2006"}], "HotelInfo": {"Name": "Daytona Inn Beach Resort", "HotelURL": "/ShowUserReviews-g34172-d84335-Reviews-Daytona_Inn_Beach_Resort-Daytona_Beach_Florida.html", "Price": "$82 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">219 South Atlantic Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "84335", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/73/8a/738ad12edf71f1348d41699e8c8ac51e1large.jpg"}}