{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Somerset, UK", "Title": "“Good hotel and location”", "Author": "Oakleigh22", "ReviewID": "UR127618718", "Content": "Stayed for 7 nights (2 adults and 3 teenagers). Hotel staff were friendly and the rooms were of a good standard. The breakfast was also good but the restaurant can get a bit crowded. Universal studios and city walk is just 10 minutes walk away. LA traffic can be a bit of a nightmare, so use the metro which is just 5 minutes for from the hotel. We used it to go to the staples center and to the Kodak theatre and could not fault it ($1.50 for single journey or $5 for a day pass). Other reviewers have stated have a room facing the pool to avoid traffic noise, we had a room on the opposite side to the pool and we could not hear any traffic noise.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "cortlandt Manor, New York, USA", "Title": "“Sheraton Universal”", "Author": "ddclean", "ReviewID": "UR127595427", "Content": "The Hotel was very clean. It's not like the Universal Hotels in Orlando, but for convenience to Universal Hollywood - perfect. Everyone we had dealing with was very courteous and friendly. The Valet Service was excellent!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Horrible Elevator Experience”", "Author": "FamilyTraveler034", "ReviewID": "UR127584226", "Content": "This hotel has far too few elevators for its size and the few that exist are slow and inefficient. On vacation days lots of famiiies are trying to check out with luggage at the same time. The experience was extremely frustrating. Some guests actually gave up and changed plans or walked down several flights of stairs with luggage. We ended our 20-minute elevator wait by going up to the top floor from the 8th just to get into an elevator. Thus, it was full for others trying to get down. Our shower was also broken, with a leak that sprayed over the curtain and all over the bathroom. We would have imformed staff, but were so late getting out, we did not have time.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Excellent location and excellent service!”", "Author": "gfgb78", "ReviewID": "UR127444342", "Content": "I stay have stayed at this hotel several times over the past few months and the service is always amazing. The valet, front desk, restaurant, and club lounge staff are all very responsive and friendly. This hotel is very clean and is a great location. This is great hotel for both business and personal travel.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sacramento", "Title": "“Sheraton saved our vacation!”", "Author": "hixona", "ReviewID": "UR127386326", "Content": "We had booked a different hotel for this part of our vacation and it did not work out. The Sheraton was able to give us 2 nights during a very busy spring break and saved our vacation. Emecka checked us in and turned our frowns upside down. The room was clean and quiet. It overlooked the pool and we were able to see the Next Top Models line up for auditions, which was fun. The rooms on our floor were having new room photos and mirrors installed at the time we were there, but they were quick. Starbucks coffee in-room and in the lobby. Convenient shuttle to Universal Studios.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Location!”", "Author": "anapin", "ReviewID": "UR127359205", "Content": "This was my second time in Sheraton Universal. At this time, we had a Club Lounge room and we could see the hotel was remodeled , but the staff still do an excellent job. From your arrival, the front desk people, the concierge and everybody that works there pamper you . If you need an information, they give you a complete map, explaining very well all the stuff you need. The breakfast was fair, with eggs, ham, cheeses, breads and muffins, coffee, tea and juices. Also they offer cereals and fresh fruits. You really don't need to have breakfast anywhere else. On the other hand, the happy hour - between 5;30 and 7;00 P.M. - is good if you don't drink alcohol. Soft drinks are free but you have to pay (and it's expensive) for any glass of wine or beer. As we can see, it's an unhappy hour.... But the appetizers were very good, mainly the shrimp appetizer.... Also to get the Port of Los Angeles you have to do a long trip - more than 50 minutes ! and if you call the Supershuttle, you have to go first to the Airport, and then, to the Port... The best thing is: you are almost facing the Universal Studios Hollywood! So, you can choose different things for dining and you don't need to have a ticket to go to Citywalk... If you like the rides, you can spend the whole day for fun... At Citywalk you can shop and dine, isn't lovely? The real problem we had at the hotel was with neighbors screaming, running and slamming doors at 1:30 A.M. I tried to knock the wall, asking for silence and they began knocking the wall like mad people. I called the reception and less than one minute ( the time to get the lift) I've heard the security calling the neighbors and I've got silence to sleep... I liked very much the readiness of the security...", "Date": "April 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location if visiting universal studios”", "Author": "xj_me_leex", "ReviewID": "UR127349142", "Content": "This hotel is perfect for a visit to the surrounding studios- universal warner brothers etc. near metro station however we had a hire car, parking quite steep $18 per day but close to Hollywood boulevard 10 mins, hollywood sign 5 mins, beaches 30mina and airport Lax 30-40 mins. Rooms quite basic room, shower, tv. Clean, just what you need for a place to stay, if you are looking for something luxurious this is not it. We may have this view as we had stayed in very luxurious hotels in Vegas and sanfrancisco in the same trip prior to arriving at this hotel. Hotel lifts were a nightmare took 15 mins just to get a lift that wasn't full but apparently it was fully booked this weekend. Breakfast buffet had variety of choice worth including when booking.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great Hotel, Great Location”", "Author": "Wild_Orchidz", "ReviewID": "UR127258076", "Content": "This hotel is a 5 minute walk from Universal Studios and the City Walk. Guest service was impressive. Rooms were beautiful. Location fantastic.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Enjoyable Stay”", "Author": "Paypay14", "ReviewID": "UR127194803", "Content": "Loved our Stay at the Sheraton Universal City. The staff was wonderful, the lobby is fun and hip. Lots of space to just hang out and relax outside of your room. The restaurant down stairs was wonderful. They have a great breakfast buffet, $21.00 adult, $11.00 for kids 12 and under. Wonderful service (Thanks Roman and Julieanne) It is walking distance to city walk and universal, the sub station is right at the bottom of the hill. Close to everything in LA. I have stayed at the Hilton in the past, but the atmosphere here was way more my style and If they continue to treat guest as well as they treated us they will do well.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Better than the first time”", "Author": "DrDSM", "ReviewID": "UR127155704", "Content": "I returned again for a yearly convention. Last year I had only one complaint about a dirty bed. This year everything was not just better it was remarkably better. The room was very clean and the staff was the most pleasant I have EVER experienced. Every single staff member was cheery and honestly cared. Not the fake smile one is often greeted with. Another surprise was the prepared lunch. I had the veggie option and it was delicious. Two things to watch out for; 1 is the elevators. Sometimes the traffic gets very heavy and it might take a while to catch one. Just plan ahead. 2. When the outside temperature drops below 53F, the A/C turn into a heater. This doesn't make a lot of sense since the windows don't open and the room temperature then becomes over 80F at 3 a.m. Kudos to the manager and staff for exceeding my expectations by a long shot. But please update the A/C situation.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Exceeded Our Expectations”", "Author": "ProfessorJS", "ReviewID": "UR127016599", "Content": "We stayed here not to visit Universal Studios but because we had a family member nearby. We arrived late and tired. I travel a lot around the world and around the country, and I had expected this to be just another chain hotel experience, but I have to say that management at this hotel is doing an excellent job because every (not just all, but EVERY) staff member we met was dedicated to satisfying the customer. The room was very nice, the bed was beautiful, but the staff were the best part, from the front desk, to the staff at the bar late at night, to the housekeeping staff who brought us extra pillows, to the staff in the breakfast cafe, to the car valet who helped my wife - thank you to all for a pleasant experience. We would definitely come back.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chula Vista, California", "Title": "“A great place to stay when visiting Universal studios”", "Author": "jacqui o", "ReviewID": "UR126935378", "Content": "We had a great stay here and the staff were very welcoming. We stayed in the club level which included breakfast. The breakfast was good but there were not enough seats/tables for all the guests- it got very crowded. The pool is adequate and kept the children happy for an hour or so. The location is also a winner- you can walk from the hotel to Universal Studios and Universal city and hotel parking is reasonable. Our first experience in a Sheraton hotel and after this I would definately stay in a Sheraton again.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Alberta, Canada", "Title": "“Exceeded our expectations.”", "Author": "Gary M", "ReviewID": "UR126870701", "Content": "My wife and 2 teenage sons stayed at this location for 2 nights in March '12. Having stayed at many Sheraton's all over NA I was unsure what the service level would be like in a tourist location being next door to a theme park. We were literally pampered at every level of contact within the property. Breakfast staff were attentive and cheerful. Evening drinks in the lounge (just mom and dad of course) was terrific and the staff again was very social and fun. Business center was state of the art and even the hotel wifi worked well. The rooms were clean, beds very comfortable, and I loved the shower head so much I am changing mine at home. A special shout out to one of the front desk managers, Sam. She took great care of us and made us feel like we were more important than anyone else. I found it impressive because in a property that boasts high turnover day to day it takes a dedicated team member to make people feel that way in such a short time frame. Thank you Sam and we are already talking about when our next trip there will be. Regardless of whether we visit universal we will stay at this Sheraton. Regards, Gary, Shelley, Justin & Jordan.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Update on our stay in November 2011”", "Author": "swills9", "ReviewID": "UR126513809", "Content": "Just a quick update on our review for November 2011, having been in contact with the Manager (Randy) he has promised to make sure we will be OK next time, which will be Feb 2013! Will keep you to this Randy, I see in one of the replies he says it is a 'secure' car park, sadly not 'that' secure, on our last visit, our rental car had the number plate (licence plate) bent upwards by 90 degrees, not much, but annoying all the same, but we did not mention it, when we took it back, the rental co, did ask, but we said we knew nithing about it, and must have been in a supermarket! Hoping for a really nice room next time (Randy !!!) nive and high with a good view, this Hotel can't be that bad, although we have had 'issues' this will be our 5th or 6th stay with them :-)", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Great location and a good hotel”", "Author": "schamp1", "ReviewID": "UR126510025", "Content": "We chose this hotel for a Christmas time visit to see our daughter in Los Angeles. I am Starwood Preferred and they were haveing a great promotion based on your birth year. So, the older you are the better they rate. This hotel offered a nice clean room at a better than average rate in North Los Angeles area. The staff in the hotel were very helpful especially the morning waiters in the restaurant. I think his name is Roman! Very nice man. He made you feel like you were having breakfast at home. No complaints!!! Good Hotel!!!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Everything You Need”", "Author": "Stewart C", "ReviewID": "UR126470476", "Content": "It is simple but nice, with a great lobby and bar. The fitness area is huge and new but the pool was less than amazing. My room was clean and had a great view of the valley and the theme park across the way. The entire staff was very friendly and outgoing. I will be returning!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Sheraton Universal”", "Author": "Mike S", "ReviewID": "UR126387438", "Content": "During a recent stay in LA we spent time at 3 different Sheraton hotels. This one was the best. It had the most comfortable (newest?) beds and was very convenient to area attractions. While checking in I mentioned to the desk clerk that I needed to ship souveniers home. Without my asking he immediately googled a local FedEx storefront location and printed driving directions for me. This little step was a very nice touch that really helped me. My wife was also very impressed with this hotel and we both would stay there again if in the area. She agreed it was the nicest one we stayed at during our vacation, even though it appeared to be the oldest of the three. It was well maintained.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phx", "Title": "“Location, location, location”", "Author": "ITGOA", "ReviewID": "UR126274909", "Content": "Pros: The best thing about this hotel is it's proximity to Universal Studios and Citywalk. A 5-10 minute walk, or there is a shuttle which we did not try. The Hilton is actually 2 minutes closer. Would stay here again for this reason alone. Rooms were clean and comfortable. We overlooked the pool with a balcony, not sure if this was an upgrade or not for SPG status, the check in person was not particularly forthcoming. We were also given Club Floor access when I asked, which translates to a continental breakfast in quite a busy room. Rooms are well furnished though on the small side. Cons: There is essentially a $30 a night surcharge to stay here. $18 for parking (not discussed at check in) and $10 for internet - with taxes is $30. I hate being nickel and dimed.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good location, but...”", "Author": "dingmax", "ReviewID": "UR126259019", "Content": "Universal CityWalk and Universal Studio are within walking distance if you do not want to use the shuttle bus service provided. For those driving, the Hotel has easy access to Hwy110 and Hwy 134, you just cannot beat such a location. However, this establishment shows aged even though it claims to have a million dollar renovation recently. We are offered a connecting room and can hear clearly the TV noise from next door, not to mention the sound of excitement from kids during check-in time at around 2-3pm. The Club Lounge is packed with family groups at morning breakfast, you do not enjoy food there but have to fight for it. We checked out after a three-night stay and found the Hotel double-charged us on \"Club Access\", everything is not up to Sheraton Standard that we expect.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Decatur, Illinois", "Title": "“No better than average”", "Author": "mkhmn", "ReviewID": "UR126146422", "Content": "Stayed here for a conference but brought along family. The only claim to fame is the proximity to Universal Studios and to get there on foot you have to take an iffy elevator up to the Hilton Hotel next door and walk through their ballroom area to get outside. Crazy. The elevator stuck twice while we were there. Not good. Checked in and the room was ready. No washcloths so immediately called down for some - they never arrived. Next morning called again and finally got some. No extra toilet paper so we were very careful. LOL Concierge was helpful and sold us Universal Studios tickets with no fuss. They have a Starbucks \"outpost\" in the lobby, but it's part of their actual bar. The person didn't make drinks, just pointed me to the filled canisters lining the booth and I made my own. Weird. The restaurant downstairs has a breakfast buffet that I really enjoyed. It was pricey, but the waitstaff was incredibly nice. Told the kids what they should do at Universal Studios and in what order and they were right! The restaurant makes their own salsa, so if you go, be sure to ask for that - it was phenomenal! I put it on the scrambled eggs from the buffet and really really loved it. Buffet had just about everything you'd want and ended up being cheaper than ordering off the menu. Probably wouldn't stay here again, but wasn't horrible.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Solid hotel, great location for universal and surrounding la area”", "Author": "kenuga", "ReviewID": "UR125916418", "Content": "Used points: Starwood gold member. Hotel was pretty large, heated outdoor pool kids enjoyed. Requested high room with view., was honored. Room 1608. Rooms seemed to have been updated and were comfortable for our family of 4. Walked and took free van to universal city walk.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Best hotel in Hollywood!”", "Author": "vamartinez05", "ReviewID": "UR125870091", "Content": "We stayed one night here in a suite and it was amazing! The room was big considering we have a 15 month old baby. Plenty of room for him to run around. Great views from the 14th floor. The pool was great temperature considering the weather was cold. Close to Universal City Walk and Universal Studios which we walked to both days. This is our second time here, and we will always continue to come back here each time we are in the area. The managers and staff are very helpful and always there to assist. Thank you again Sheraton for making our stay again memorable.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Not exactly a 4 star hotel”", "Author": "sspc", "ReviewID": "UR125802719", "Content": "If you are going to Universal Studios then this hotel is a good choice. The location is great, the staff is friendly and the lobby is very beautiful, BUT the rooms are very average. The bathroom was so small that you had to close the door to use the toilet. There were no toiletries, not even a shower cap. Finally, we had a great view, but the windows were filthy. I don't think this hotel deserves a 4 star rating.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“Facelift Please”", "Author": "Whis117", "ReviewID": "UR125256482", "Content": "in the land of plastic surgery and re-inventing oneself, why oh why can't the Sheraton Universal get a little love. The front desk staff was awesome, but the rooms are completely dated, bathrooms are microscopic and the place actually kind of smells bad! As I said , the staff is wonderful and try to overcome the condition of the property. The place simply needs an update - please - spend a buck on paint and carpet...", "Date": "February 26, 2012"}, {"Ratings": {"Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Walnut Creek, California", "Title": "“Redone Hotel at Universal Studios”", "Author": "raysb", "ReviewID": "UR125139276", "Content": "Hotel has been remodeled and is very nicely appointed, large pool good fitness facility walk or shuttle to Universal Studios Citywalk for a good selection of shopiing and restaurants. Convenient to Hollywood or downtown LA. Close to Burbank airport. Friendly staff.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hadleigh, United Kingdom", "Title": "“OK place to stay”", "Author": "ruthfa", "ReviewID": "UR124994058", "Content": "We stayed here for 3 nights in Feb 2012. We arrived at 2345 at night after a lond flight and there was no food availiable within the hotel (not even a vending machine). Front desk suggested we send out for pizza. We were assigned a room that the reception staff assured us was one of their better rooms as it had a balcony. On arrival at the room the main thing we noticed was the noise from the freeway outside the balcony (not sure why you would ever want to sit on it and overlook the traffic). The problem was that the glass patio window was not airtight and not at all soundproofed so the noise from the freeway was loud at all times. We phoned back to reception and asked if there was an alternative room availiable. We were told that no, the whole hotel was fully booked out. We were also told that we should be grateful for having the balcony as people who were higher up were always complaining it was too hot and the air conditioning did not work - at least we were able to cool the room down via the badly fitting windows. We then wondered what kind of run down place we were staying at. The room itself was great, really comfy bed, lots of storage and a good bathroom. Breakfast was adequate though the buffet area was very small (for the size of the hotel) and continously ran out of stuff. Service was erratic, one morning we were waiting so long for our drinks we had already finished the food. Its an OK place, the room is comfortable. Just avoid the traffic facing rooms with the balcony (on ground level floor 3) or the hot rooms in the tower (as reception suggested). Free wireless internet was a bonus also.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Beautiful location and attentive staff”", "Author": "grandmaB47", "ReviewID": "UR124973181", "Content": "We spent the long President's Day weekend at the Sheraton while in LA to visit our son. The hotel is located in an area with easy access to the freeway. This made it convenient to visit a variety of locations in LA County. The first night there we had a delicious dinner at the hotel restaurant, Californias, although the menu is somewhat limited. The service at the restaurant was superb! The restaurant validated parking for my son. The quality of the bed and pillows was wonderful. Our room was quiet and looked out over the courtyard and the hills. The bathroom needed updating and deep cleaning. The ice machine on our floor was not working and there were problems with the elevators. The young woman who checked us in was extremely professional and check in was very fast. Even with the problems with the ice and the elevators, I would stay here again due to the outstanding service from the staff.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Hotel of the stars?”", "Author": "RustyRobear", "ReviewID": "UR124934961", "Content": "I'm not sure if real stars have actually stayed here, but it was good enough for me. The proximity to CityWalk and Universal Studios was nice for getting out and away from the hotel during free time (I was there for work). I don't know when the rooms were remodeled, but they still had a pretty fresh feeling to them. The lobby was also very nice and good for hanging out in groups. I thought that we would have been a little closer to actual \"Hollywood\" attractions, but they were only a short ride away. I'd stay at the Sheraton Universal again if I was in the area for any reason, or if I wanted to take my family to Universal Studios during a SoCal vacation.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Great staff and location”", "Author": "nhhk", "ReviewID": "UR124466367", "Content": "A short walk to Universal, and short distance to many of the sights makes this an excellent place to stay. The rooms are clean and functional. The staff friendly. The staff did more than you'd expect from a Sheraton. The room I was in had a noisy neighbour and the staff went out of their way to move me. Then checked the next couple of days to be sure. The only negative comment about the whole place was that the bar served the worst gin and tonic I've ever had anywhere. Won't take much to fix that! I look forward to staying again next time I'm in Los Angeles.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location - nice Sheraton hotel”", "Author": "ManDanny", "ReviewID": "UR123787014", "Content": "We spent a night at Sheraton Universal after a couple days in Disneyland and our engagment! A great stay this hotel has a beautiful lobby, free internet via wireless or desktop in their Link@ setup in the lobby. Nice restaurant for breakfast, lunch, dinner and room service. Universal is about a five minute walk away so fine if the weather's fine, otherwise there is a shuttle bus that runs from Universal. I wouldn't say the walk is any farther from Sheraton than Hilton though. We were up on the 16th floor facing north in a corner suite. Nice view and enjoyable surroundings. Clean and well presented room. The bed was amazing!! Best sleep we had had all trip. Went for a swim the next morning but it was pouring and pool/hot tub is outside so that brought an end to that! Perfect Starwood stay - highly recommended.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "beatricepugzilla", "Title": "“OK for a Theme Park Hotel”", "Author": "beatricepugzilla", "ReviewID": "UR123430011", "Content": "Stayed for 4 nights to complete a Starwoods platinum challenge. Front desk staff very friendly but had a little trouble explaining just what the club floor rooms actually were - it was simple question but really seemed to stump the staff - was finally told the rooms were a little bigger than your standard room. Upon walking into my very small and a bit outdated room (espcially the bathroom), I felt sorry for those not staying on a club level as the room was very small so the non-club level rooms must be tiny. The television was smaller than any TV I have seen in the last three years in any hotel (travel a lot for business so I am out 1/2 of each month). The bathroom, as mentioned, could use an upgrade as well offering some new towels as the towels were very thin and frayed. To be honest, I have never stayed in a Sheraton and am comparing this to a Starwoods Westin so maybe this is not a fair comparison. After night one, thought about checking out and going up the hill the Hilton but then went to the fitness center. The fitness center is one of the best ones that I have been in a hotel outside a hotel giving you a pass to a local health club. The fitness center alone kept me at the hotel all 4 nights. Good to see that the Sheraton understands that business travellers do work out and like to have a wide variety of cardio and weights to choose from. Asked my business asscociate staying at the Hilton about their work out facilities (she is also an avid fitness person) and she was not impressed so I stayed put for the four days. The executive lounge is nothing to write home about. It is your standard lounge - did find it strange that they did not offer coffee or soda throughout the day but perhaps this is because this is more a family/tourist hotel versus a business hotel (?). Not sure I would stay here again on business. When it was booked I chose it due to the challenge and to be near my business associates staying at the Hilton.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent Experience”", "Author": "Tom1c", "ReviewID": "UR123362016", "Content": "A wonderful Hotel with fantastic surroundings easy access to the metro train system nice rooms nice breakfast very friendly staff couldn't have asked for more would love to go back and stay longer next time.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Disappointed”", "Author": "Jin H", "ReviewID": "UR123285447", "Content": "We actually checked out of another hotel to come to Sheraton but were very disappointed- should have stayed put where we were. We paid for a room that was supposed to be a more 'desirable' room because it had a balcony facing the pool- we were told by the reception \" people pay more for this room\". Firstly, to get to the room, one has to go up some 4-5 steps or so- there are no elevators to go to this part of the hotel- not good if you have some heavy luggages. Upon entering the room, we noted the carpet was stained in several areas (see pic). We then realized the wood panel on the door frame to the toilet was almost falling off (see pic). We went back to reception to ask for a different room but was told there were no other rooms available that were equivalent to the price of the room we paid. We were offered a room without a balcony but there will be no refund or upgrades. The receptionist went to speak with his supervisor and came back with nothing except the reassurance that his supervisor will follow up with us; of course no one followed up during our 2 night stay! The parking is shabby not attached to the hotel, you have to walk across a lane to the hotel for $15/night and the parking elevator smelt of urine. Room comes with 3 towels- there were 4 of us (2 kids) and so we asked housekeeping for more towels- they were prompt and brought us 4 extra towels but unfortunately 3 out of 4 towels were heavily stained (see pics). It was disgusting, adding to our disappointment. The only good thing was it's location if you are going to Universal Studios. You will be within walking distance to US. We were very disappointed especially considering it was a Sheraton. Will not go back there.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Great Location”", "Author": "downAMDsouth", "ReviewID": "UR123269004", "Content": "We had a great time, the hotel was nice, clean and friendly staff. The Room was spacious,beds was great. 4 Adults were comfortable in this room. Our View was very good, you could see Hollywood Blvd.(at nite the lights looked great) the hills in a distant, down delow you can see the different studios. The Location was a plus!!! All the attraction were just a short walk. Room service was good, food (breakfast) fresh, hot. Staff at front desk very friendly, most helpful. Yes, I would love to stay again. P.S. the hill was great walking excerise. Thanks again", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brielle, New Jersey", "Title": "“Great service......”", "Author": "James C", "ReviewID": "UR123182852", "Content": "Unbelievable service........ I have stayed in countless hotels almost always luxury oriented places like Ritz Carlton or Peninsula. I can honestly say that the accommodations and more importantly the service at the Sheraton universal city was the best I have had. We stayed in the vice presidential suite which was very reasonably priced considering its ample size and magnificent panoramic views. The hotel was well kept, clean, and the food was great.Â  Perhaps what stood out the most was the exceptional service from the moment I walked in the door. The entire staff was courteous, generous, and always willing to go the extra mile to assure our comfort. I come from an industry where client service and small \"value adds\"set you apart from everyone else.Â  The front desk manager, Sam, truly knows how to enhance a guests stay and was a very very large part of why our stay was so perfect. She personally saw to it that I never had to ask for anything. Also worth mentioning is the fantastic gentleman, Billy, from Californians restaurant. Billy was a delight and we made a point to sit in his section for breakfast daily. Finally, Fernando and Dai from the concierge went above and beyond helping to set up limo and town car needs for me as well as tickets for universal studios and madame tussauds.Â  Overall, I give the hotel a 12 out of 10!!!!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver BC", "Title": "“Very nice hotel”", "Author": "BCWife", "ReviewID": "UR122843745", "Content": "Although this hotel is quite out of the way for most So Cal attractions, if you're going to Universal and don't mind being out of the way, it can be the perfect spot. A shuttle is by every 10 minutes during the day to take you to Universal and City Walk where restaurants, shops and attractions abound. The hotel itself is very clean, a little old, but well maintained. Rooms are spacious and updated, the lobby is large and the lobby bar is a great place to grab a cocktail and appy before heading out (especially for happy hour during the week)!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Ok for the location, but in need of a renovation”", "Author": "ShanghaiShu", "ReviewID": "UR122814898", "Content": "Obviously close to Universal Studios, but not much to offer beyond that. We stayed in a junior suite which was nothing more than a regular room with some oddly placed extra space added on ('L' shaped room). Rooms are run down and in need of a renovation. Service seemed alright - with one exception. In the club lounge, watched a kid playing with the ice cubes intended for drinks with his hands and then putting them back in the bucket The club lounge attendant also watched this. I would have thought that the attendant would have changed out the ice? Nope. Needless to say, warm drinks that night.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Agoura Hills, CA", "Title": "“Great Staff Members”", "Author": "BigD19", "ReviewID": "UR122721905", "Content": "Spent 8 nights at this hotel and was very impressed with the level of service from all staff members. From check-in late on a Saturday night til checkout on Christmas morning everyone was totally responsive - front desk, valet, housekeeping, buffet attendants, even parking lot attendants. If I asked for something it was handled within 10 minutes. The only complaints would be the noise from the toilet tank running on and off all night long and the $18 per night for self parking (a bit high). They did do a repair to the toilet which helped but keeping the door closed at night handled the noise problem. The breakfast buffet (Club level) was good with sufficient choices and the staff there was very accommodating. Had some very pleasant conversation with several staff members and they never made me feel rushed. The room was decent size (very small closet) with a very comfortable king bed. The views of Universal City and the San Fernando valley were outstanding. Again, very impressive and I will return.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oceano, California", "Title": "“Best service ever”", "Author": "RumRunner01", "ReviewID": "UR122673883", "Content": "We stayed here over a weekend in December. Service was impeccable. We loved the lobby bar and they have an excellent martini list and they even have absinthe. The restaurant was excellent for foot and service, breakfast buffet was very nice. All areas of the hotel we experienced excellent service. Our room was cozy and the bed comfy. We had a view of Studio Citu from the 18th floor. Unfortunately out room got hot from setting sun and the ac was not enough to cool it down. Our ac was also very loud and after maintenance it was still loud. We will be staying here again in February since we loved it so much.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Needs Improvement”", "Author": "Yups89", "ReviewID": "UR122550531", "Content": "Just returned from a 2 night (dec 28 - 30) stay with my wife and kid. Staff were courteous, the size of the room is ok but the t&b is a bit small. One major complaint however is their aircon. Especially during the wee hours of the morning, both nights my wife and I woke up because the aircon is simply not enough to cool the room. Maybe that is the reason why they have a small fan inside the closet. I have read a complaint from another site with the same problem. The thing we like most about the hotel is the great location. Easy walk to Universal studios.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Nothing to complain about at all”", "Author": "sambas2", "ReviewID": "UR122532573", "Content": "great view - on the valley side very convenient location - 7 minute walk to universal studios/citywalk...or can wait for a free shuttle every 15 minutes. Close to Burbank airport, and hollywood. 2 minor complaints: prices of food and parking were a bit steep. For example, Self-park was $18/night, my bottle of soda in the gift shop was $3 + tax.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great staff, location, and gym!!”", "Author": "DWfromNY", "ReviewID": "UR122488424", "Content": "My husband and I stayed 2 nights at a VERY busy time of the year. The first room that we were given had a minor problem which I reported to the front desk with a request for another room. We were given a lovely upgraded room for our trouble and in addition we received breakfast vouchers. I was very impressed with how the front desk staff handled the issue. I also received an email the following day asking if everything was OK and if there was anything they could do to improve our visit. The front desk staff on Thursday DEc 29th was excellent. In addition ALL of the staff were extremely courteous and friendly througout our stay. We wanted to stay an additional day but the hotel was sold out. The gym was clean, there was a variety of equipment, and we did not have to wait to use any of the equipment. The location is great expecially if you plan to visit Citywalk or Universal. We were visiting a relative in Hollywood which is right over the hill...about 10 minutes by car. We will definitely stay here again next year but I will book earlier so I can get the extra night. Also concierge was very helpful on Friday Morning.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“QUALITY HOTEL ! QUALITY PEOPLE ! GREAT LOCATION !”", "Author": "ROBERT B", "ReviewID": "UR122376500", "Content": "Thank you to the Sheraton Universal for a relaxing and enjoyable stay. A special thank you to Max and Laurie at the Front Desk, and Rick Sanchez in the California Restaurant for his detailed info on Universal Studios and his unbridled humour. Our stay was from Dec 20th to 29th, during which time we found everything very satisfactory. We elected to go â€˜Greenâ€™ and collected enough points to enjoy a fantastic breakfast for our family prior to our departure. Self parking, although $18 for the first day, was only $9 per day afterwards. We found the rooms Clean, and Comfortable, and enjoyed a fantastic sleep every night. No problems with the Heat or A/C, and extra blankets were available if necessary. Staying on the 15th (Club) floor, we often and easily scooted down to the 9th for the Continental Breakfast, and late afternoon â€˜Horses Durvsâ€™. If we wanted some AM/PM privacy, we simply took food back to our room. The Hotel was clean, quiet, friendly, and all the employees seemed to really â€˜Careâ€™ ! -- something that you do not see often these days. The hotel is perfectly located, approximately 2 blocks from Universal City, which can easily be reached by Shuttle directly at the front door, walking down to the Metro/Universal Shuttle, taking the elevator up to the Hilton Hotel level and walking over, or, as we did, you can easily walk up the hill. We chose the Walk to get some exercise, and work off the extra pounds that one gains on vacation. The Hotel is also located close to Warner Bros Studios, The Hollywood Bowl, Mulhulland Drive, The â€˜Hollywoodâ€™ sign, and Forest Lawn Cemetery ( Where a lot of the Movie Stars are interred. Only a short drive, or take the Metro to the Walk of Stars, Graumanâ€™s Chinese Theatre, the Kodak Theatre, Paramount Studios, and other local attractions. We travelled on Hollywood Blvd, Santa Monica Blvd, Rodeo Drive, and shopped at Westfields in Century City, right beside Fox Studios, and were lucky enough to shop directly beside Movie Star, Amie Adams, in Bloomingales. The Santa Monica Pier is beautiful at night with all the lights. If you stay at The Sheraton Universal, either drive or walk over to Ventura Blvd, and try the â€˜ IN-N-OUT BURGERâ€™. The burgers are fantastic and inexpensive. Many involved in the movie business frequent this quality fast food location. Also try the â€˜Panda Expressâ€™â€”Great Chinese & Thai food. We would not hesitate to stay at the Sheraton Universal Hotel upon our next visit to the area, and would highly recommend this QUALITY Hotel to all our fellow Canadians, or anybody visiting Universal City, and the surrounding tourist attractions. Thank you to the Management, and ALL the employees for very positive and memorable experience", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent, UK", "Title": "“Great family hotel for visiting studios”", "Author": "Cliff S", "ReviewID": "UR122355230", "Content": "The strongest point of the hotel is the fantastic location. It is a very comfortable 10 minute walk from the studios. Yes this isn't the cheapest hotel but the standard is excellent and the location is really worth paying a premium for. The room was first rate with a great view over the studios. We actually got a really good deal booking online but I notice that for other dates it was much more expensive. Highly recommended for families visiting universal studios. Very convenient for subway and the drive into Hollywood was much quicker than I had expected to be so can also be used as a base for visiting LA more generally. All in all a fantastic location.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "alexandria va", "Title": "“Great place to stay near Glendale”", "Author": "Tiffany N", "ReviewID": "UR122093667", "Content": "I stayed here 3 nights while on business in Glendale. Bed was very comfortable, I had a great view from the 17th floor. Room was very bright, lots of natural light - which I loved. Front desk staff were friendly, housekeeping does a great job. Room was very clean and smelled great. Towels were bright white. Overall a very nice stay. Gift shop in the lobby is also open late and has snacks, toiletries and souveniers. They also gave me internet for free since it was my first time staying here - very nice! I will certainly return on my next trip to the area. I also discovered on my last night that there is a small shopping center around the corner (Riteaid/CVS, gourmet grocery, Starbucks and some small shops.) Very convenient place for breakfast/coffee and take out.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Beach, California, United States", "Title": "“Great service but greatly overpriced.”", "Author": "James L", "ReviewID": "UR122046070", "Content": "I stayed here for two nights in December, Great staff during check-in and during my stay. However the prices are out of control. Visiting Universal Studios there are really only two hotels to choose from for walking distance, this one and the Hilton, the Hilton is cheaper. Here at the Sheraton it is $18/night to self-park and $24 + tip for valet. I had requested a mini-fridge for my room which was never delivered. When getting hungry I thought about room service but saw that it would cost about $29 for a bowl of oatmeal and a glass of milk. No thank you.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Location For Visiting Universal Studios or Hollywood”", "Author": "SURF4FUN007", "ReviewID": "UR121993613", "Content": "This Sheraton is a great property located a top a hill in the Universal Studio's complex. You can get a view of the Hollywood Hills/ pool or Universal Studio/Valley view. The rooms are spacious and well appointed, however, they did show some minor signs of wear and tear. Room service was prompt and tasty although they no longer have their unique menu, now it's just standard Sheraton fare. There is shuttle service from the hotel that takes you right to the front gate of Universal Studios. The hotel is also located a short distance to the Red Line Metro Stop which will take you to Union Station, link you to Pasadena Gold Line or the LAX and Long Beach Lines. As others have mentioned, if you decide to walk anywhere, there is a steep hill that you'll need to endure.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Perfect Location and Great Staff!”", "Author": "albertc9", "ReviewID": "UR121955863", "Content": "We made our first trip to Los Angeles and stayed here for a week. From the moment we stepped onto the property we were treated exceptionally well by every staff member we encountered. A big thanks, in particular, to Sam who checked us in and gave us much more than we expected! We chose one of the Lanai rooms overlooking the pool area but looking back, I would've chosen a Tower room since it was rather cold on many days and couldn't take advantage of the balcony. The room itself was cozy and clean but we noticed the fire detector was missing with just a jumble of wires hanging out of the wall. It was quiet most nights so we had a restful sleep except for one night where one of neighbors were getting a bit, uhhhh, intimate rather loudly. The location can't be beat for what we were looking to do. The shuttle is extremely convenient and handy to get to Universal Studios and CityWalk since it can get a little tiring walking up the steep hill. Other areas of the city were easily accessible with the Metro Rail and a transit centre at the bottom of the hill. And the Club Lounge provided a fantastic continental breakfast and evening hors d'oeuvre with a great view of the area from the 9th floor. The staff did a great job ensuring there was plenty of food and drink available and the tables cleared promptly. Overall this is a fantastic hotel with friendly staff and would not hesitate to stay here again!", "Date": "December 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Good Hotel, still room for improvement”", "Author": "swills9", "ReviewID": "UR121585654", "Content": "Had our 3rd or 4th stay at the Sheraton in November this year (2011), we were in two minds about styaing here after our last stay which was both noisy and during a 'convention' noisy and on our landing a smell of alcohol! ( 2 nights) This time however the roonm was quite with a nice view from the (it has to be said) rather dirty window, looks like it had not been cleaned for some few months, not that easy I suppose 11 floors up. Again at the end of the week, there was some sort of convention, and we were kept up until 0245 in the morning with laughing and doors slamming shut, this was mentioned to the desk who did apologise. The other thing that annoyed me, and one of the reasons we went back to this Hotel, after the last trip, we had a letter saying that we would be given a free entry to UNIVERSAL, this latter was emailed back to them a couple of weeks before went, but the desk knew nothing, and the offer was never given to us. Parking was about $20 per night, but even as guests you do not get priority/resevered areas, thus on a few nights when events were on, we ended up on the very top deck squeezing in, and on one moring, some nice person had bent out licence plate through 90 degrees... why ? ! Would i stay again, possibly, it is handy for City Walk and the Freeway (101) Rooms are clean, Staff are very freindly, it's the little things that can really spoil the vacation,", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Dissappointing”", "Author": "DrStuo", "ReviewID": "UR121404977", "Content": "First the good: it is a great location and a beautiful hotel and we got a good price thru an internet site. Checkin desk service was top notch and we got a nice room on the 18th floor with a million dollar view of the San Fernando Valley. But: the bathroom was very compact, the bed felt very comfortable when I first lay down but I woke with a severe back ache. The room was too hot all night long despite the fact the air conditioner was working. In the morning my wife noticed that there was a portible fan in the closet which leads me to believe other tourists had complained about it being too hot and our discovery was too late to help us. Neither of us got a good night's sleep. Note that self parking costs $18 a day and there is No street parking available. You do have in and out priveleges with the parking.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Incredible staff, great hotel and location”", "Author": "randrl", "ReviewID": "UR121087227", "Content": "The manager at this hotel obviously understands what customer service is all about. Throughout our four day stay we did not find one employee who wasn't incredibly pleasant as well as helpful and so eager to make sure you have what you need and that you enjoy your stay They were so friendly without being too familiar. From the minute you step out the door of your transport to the minute you check-out, the well trained staff is there to make sure you will not hesitate coming back if your travel brings you back to this area. It is so unusual to find a place where every single employee without exception is great. It is the norm here..The property is very nice , the rooms are clean and spacious and the location is right next to Universal & City Walk with a free shuttle that runs all the time.The red line subway to other areas of LA is a short walk which is an added plus. They boast a beautiful lobby with a bar area , and a very well stocked sundry shop. I will try to find a reaso to get back to LA so I can stay at this location again.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mesa, AZ", "Title": "“Great location, great hotel!”", "Author": "Icats", "ReviewID": "UR121057926", "Content": "We visited LA from Oct. 27 to Oct. 30th for Halloween Haunt Night, a USC game and to visit friends. From the moment we checked in at 11:30 at night, the superb staff made us feel welcome, the bar was actually open, and the room was amazing. We got a corner room with a 2 walls of windows (thanks to being Starwood Owners I'm sure!). Great bed, while the bathroom is small, it's fully functionable, and we had a great view of LA. Valet service rocks, as they run to your car and are so nice and helpful. Location was perfect! We took an hour walk to Warner Brothers for a VIP tour (very fun experience) on a beautiful October day, enjoyed a great choice of restaurants on the walk there (recommend Paty's at Toluca Lakes) and walked through lovely residential areas. Took the free shuttle up the hill to CityWalk, did Universal's Halloween Haunt Night (get the Front of the Line pass), and walked back to hotel late at night. Did a USC game, while only 15 miles away, it did take an hour to get there, so have patience! On last day of trip, took a 20 minute drive (through West Hollywood) and went to eat brunch at the Marmalade Cafe at the Grove (outdoor shopping center and farmer's market) where they film Extra everyday. They were preparing for Halloween and Christmas in the same day. Very fun. Overall, great experience. We will return in a heartbeat next year. Great customer service, great room, and with so many fun activities/places to see surrounding the hotel, it's a win-win for a great vacation!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Providence, Rhode Island", "Title": "“Good location for visiting NBC Universal”", "Author": "81FrequentT81", "ReviewID": "UR120813606", "Content": "I stayed here one night before meetings at NBC Universal. Hotel is just outside Universal. Hotel is a little on the older side, though still quite comfortable.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Universally superb!”", "Author": "Balad", "ReviewID": "UR120726843", "Content": "Steps from Universal Citywalk and the similarly named adjacent theme park, the Sheraton Universal is arguably the most convenient hotel in the San Fernando Valley. Â A subway station for the Metro Red Line which is a 10-minute walk down the hill to Cahuenga, grants quick access the Hollywood attractions and downtown sports venues. Â If you care to park on the freeway with 10,000 of your closest friends, the 101, the 134 and the 170 are close by. Universal Citywalk has some great family-friendly restaurants like Wolfgang Puck, Tony Roma's and the Hard Rock Cafe. Â And, you can catch Jay Leno filming the \"J-Walking\" segment of the Tonight Show Â right around dinnertime here. Â Â  Â From the exquisitely polished brass handrails on the exterior walkway to the Zen-inspired front lobby, the hotel welcomes the weary traveler with a aura of sophistication and serenity. Â I have only been to a handful of other Sheraton properties but this is the nicest by far. Â  The people who work here rock! Â Every staff member we encountered was completely capable and Sam, one of the managers, truly went above and beyond with regard to getting us an extra room for a co-worker at the last minute so we could all be at the same property. I had a very nice room with a view of the Cahuenga Pass. The room was cleaned well with the somewhat troubling exception of pubes in the bathtub. Â The Club Lounge was stocked with an ample supply of snacks and beverages and the host and hostess ensured the food items were well presented. Â  Sadly, this is my last stay as a Platinum member before losing status with Starwood next year. Â \"Thank you\" Sheraton Universal made it great!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "scottsdale, az", "Title": "“Convenient is about all”", "Author": "andysmom", "ReviewID": "UR120529715", "Content": "Stayed here for 2 nights in order to visit Universal Studios. Checked in around 7 p.m. We were given a room on the floor just above the lobby where the walls are paper thin. While watching a movie with our 10 year old, our next door neighbors began engaging in a very loud \"party\" if you know what I mean. My husband and I were horrified and our son wanted to know what was going on. We could hear every disgusting word and utterance. It was beyond disturbing and in all my years of travel all over the world, I have never encountered this. I raced to the front desk and we were quickly moved to the 7th floor. The room was slightly better but we could still hear every movement from next door and above. Besides this, the hotel is dated and worn. The next night there was a wedding in the lobby (of all places) and the whole hotel was loud and busy. Kids were running back and forth on our floor until the wee hours of the night. Yes, it's a 5 minute walk to the Studios but I think we'll try another hotel should we ever visit here again. By the way, Universal Studios was interesting and fun but I have to say, the innuendos were everywhere including on many of the \"rides\". Oh well, this is Hollywood afterall...", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worcester", "Title": "“Excellent well located hotel with extremely helpful staff”", "Author": "MBA31", "ReviewID": "UR120522376", "Content": "Stayed 7th to 11th November 2011. Excellently located hotel within short walking distance of Universal studios and Universal city. Rooms newly refurbished to a very good standard. The staff are superb, all very helpful and the concierge staff in particular are extremely helpful and knowledgable, providing maps and advice to ensure you make the most of your stay. Highly recommended hotel , would definitely stay there again when in the area.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Great hotel, especially for the location but it did have some downs.”", "Author": "vamartinez05", "ReviewID": "UR120447177", "Content": "We traveled to universal studios and decided since we have a baby it would be great to walk to a close hotel and we chose the Sherwton Universal. The location is excellent and only about a 5 minute walk to Universal Studios. We had 6 adults staying with us and my baby and we were put into an executive suite which I was told it had one bedroom and a queen size bed in the living room area and a couch that would fold out, and about 600 sq ft of space with balcony When I heard this it was perfect especially for the price I was quoted. I walked n and was very pleased with the room only to find out though that there was no bedroom for me and my husbands privacy and the couch did not fold out. I thought where would we put all these people?! Went downstairs thinking they gave me the wrong room but no they said that's only the presidential suite. So I thought why would I make up what the room is the lady told me over the phone. Of course I was upset the only thing they did was offer me one cot free of charge which I accepted but the other adult slept on the couch. Over all the hotel is nice inside and clean, staff is nice. But with then knowing I had 6 adults they should have told me to either get two rooms or upgrade. I asked how much for the presidential suite they never provided me a price and I didn't get the other cot until 4 hours later I had to go back downstairs and ask for it. I would stay here again but make sure the room u get is the correct one just verify it with the rep. My overall experience here was good despite all the adults in a smaller room. We stayed on the 11th floor in room 1109. :) have a great stay!!", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Perth, WA", "Title": "“Get what you pay for”", "Author": "Loll73", "ReviewID": "UR120442308", "Content": "Recently stayed here in the middle of October , rooms a good size (no mininbar) and bathroom very small and dated .Combined shower/bath and old fixtures.The hotel in general just feels tired and old (even though its supposedly been renovated) .The hotel serves a purpose and that is its close proximity to Universal Studios.You can walk there in ten minutes and get to the city walk where you are spoilt for choice on food/drink options . Also the concierge gets very busy and you can wait a while to be seen - also didn't find the concierge very helpful . Would I stay here again ? only if I wasn't paying", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Hampshire", "Title": "“Loved it here!”", "Author": "NewHampshirePeppie", "ReviewID": "UR120427833", "Content": "Very pleasantly surprised with the hotel. Sure wish they'd have a shuttle though to airport but the Super Shuttle is fine. Chizuru at concierge was beyond belief. She was delightful and so accommodating. Went above and beyond and made our stay phenomenal. All the concierge staff was superb and loved the walk to Universal. It was so much fun and the subway so close to everything as well. I suggest the TMZ tour at Hollywood and Highland. The mexican restaurant at Citywalk is great too. The park is very nice off season. No lines (was sorry I bought the front of the line pass). You will love it here. Lovely business center, food was super and the staff par none. Every person who helped us was simply delightful and seemed to truly care about our stay. Franchesca and Alex and the chef (sorry to blank on his name) and Chichi the hostess were all terrific. I would come here again in a heartbeat!", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Really good customer service”", "Author": "Mrlasvegass", "ReviewID": "UR120423841", "Content": "We stayed in this hotel in September 2011 for a week after leaving the Andaz hotel in West Hollywood due to very poor customer service. Our Tour Operator Virgin booked us in to this hotel and I was initially unconvinced with their choice. However I was very wrong, on our arrival in the late evening by taxicab we were met by two reception managerâ€™s one male and female in what appeared to be very clean and modern hotel. They were very supportive of our previous problems at the Andaz, we paid for the buffet breakfast, we were put on the Sheraton 'Club Level' floor and given vouchers for free drinks on the club level floor as complimentary. The room was very clean and modern with two double beds, free internet, I pod docking station and complimentary starbucks coffee. We also had great views of the city, however there is no mini bar or fridge in the rooms. At the rear of the lobby there are several computers that give you free internet, there is a small store selling basics a very modern bar and a good size 24hour fitness centre on the basement level, which was always empty when we used it, and above all the staff were very friendly and approachable. The Restaurant serving breakfast, and dinner was very clean; we used the breakfast buffet for our six night stay. The choice was really good and varied which included scrambled, boiled and egg omelettes, bacon, sausage, hash browns, hot and cold cereals with bread and muffins, fruits, yogurts and a choice of pastries. Now the fun stuff!! Universal Studios and City Walk is literally on the door step, there is a free shuttle from the hotel that takes you to Universal studios, but you can walk it around five minutes. Universal City Station is a seven minute walk from the Hotel, which is on the red line that takes you directly to Hollywood/Highland (Hollywood Boulevard/Walk of Fame area) one stop in less than ten minutes. It costs $1.50 each way but a day pass was $5 which you can use on the buses and trains. We felt safe on the train when we travelled and that was at all times of the day. The last train being around 1.00am. As I said previously we stayed at this hotel for six nights, the staff were very pleasant, rooms clean and we used the public transport system to get around LA, this included getting public transport to see the dodgers play the Arizona diamondbacks. We would certainly go back to this hotel again if we go back to LA again especially when all you want is a comfy clean bed and room after an eleven hour flight from the UK.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Thin Walls”", "Author": "TexasTripper_7", "ReviewID": "UR120073435", "Content": "My daughter and I stayed here for the location and comfort and were very pleased with the cleanliness of the room and the accomodating hotel staff. We called the front desk on several occasions during our four night stay and our concerns were addressed immediately (extra towels, room refrigerator, noisy neighbors). Loved the Starbucks coffee in the rooms. Two drawbacks - the walls are so thin you can hear the guests next to you talking so when they started yelling at 2am, we woke up and called security. This happened 2 nights in a row. Also, clean your windows Sheraton!!! We pulled back the drapes to look at the amazing views and could hardly see it due to dirty windows that looked like muddy water had been thrown on them. Otherwise, got a good rate when bundled with a car rental so definately worth the money.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Stay Here ALL THE TIME- Great Location IN LA”", "Author": "Sparky8188", "ReviewID": "UR119957732", "Content": "The Sheraton Universal is in a great location to get to lots of different things easily in LA. We stay here all the time and we are treated like family by all the staff. The hotel does get very busy on the weekends with events and guests so beware of longer elevator waits but other than that the hotel has everything you need. The rooms are very quiet. The club level lounge is amazing! The pool and gym are nice. You are within walking distance to all the City Walk restaurants and to Universal Studios which is very nice! You are minutes away from Ventura Avenue and all the shops and restaurants that it offers. I suggest flying into Burbank and staying at this hotel! You won't be disappointed and it's hassle free!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Great hotel”", "Author": "Jackrory", "ReviewID": "UR119873662", "Content": "Have just arrived back home to the UK after a week staying at the hotel with my family. We were warmly welcomed by the reception staff and were in our room in no time, which after a 12 hour flight was great. This hotel is in a great location for universal studios - which is fantastic! It's a five minute walk but the hotel provide a shuttle service there and back if you feel lazy. We decided not to rent a car in LA and instead to try and get around using cabs and public transport, The Concierge told us how to do this, and pointed us to the metro station a short walk from the hotel. A day ticket for the metro and busses is only $5.00 a day, Its pretty easy to get around and we felt safe at all times. Rooms are a decent size and the beds are big & very comfortable, Shower is great!! only real issues we had with the room was with with the toilet, it was always reluctant to flush for some reason. Also could do with some free TV stations for children to keep them entertained while parents are getting ready to go out. Do not hesitate in booking this hotel", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“This place is everything you could ask for in a top notch hotel.”", "Author": "reddoor14", "ReviewID": "UR119838805", "Content": "It was a great place to stay while visiting universal studios. It felt secluded although close to the theme park and gave us a chance to get away from the crowds to a high class place. I would stay there again! The staff made us feel very welcome.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location, some outstanding staff”", "Author": "Sjc462", "ReviewID": "UR119407452", "Content": "When I first arrived we received a warm welcome from the valet parking which was a great start to our LA stay. The room, on the SPG level was great, with good views, however, it would have been nice to have had a fridge of some sort. This hotel felt safe and was perfectly located for Universal Studios and the City Walk. There is a complimentary shuttle to the Studios but it is a 5 minute walk, if that. Prior to coming to this hotel I had phoned, from the UK to get a treat arranged but was bitterly disappointed when we got to the room that this had not been arranged, and was even more dismayed that when I went to the gym and spoke to a young lady on reception she appeared disinterested, however on speaking to another receptionist, Cherry I think my faith was restored with a complimentary gift to the room. The SPG lounge is clean & pleasant and you can keep yourself stocked up with bottles of cold water from the fridge. If the sky lounge is not being used for a function I can highly recommend going up there, especially at night where you will get some stunning views. I will certainly chose this hotel if I go to LA again.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Buffalo", "Title": "“Close to the parks”", "Author": "lppenny23", "ReviewID": "UR119378399", "Content": "We stayed here on a mini trip to the park. I think it's def overpriced for the quality of the hotel. The people there were great and the drinks at the hotel bar were very cheap at happy hour! The hotel is very close to the park so that's nice. The bed was not so comfy and the room needed a little updating. We called at night for a robe and slippers and they brought it right up. Good hotel.. Yet overpriced!", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "British Columbia", "Title": "“A Very Good Stay”", "Author": "Canuck60", "ReviewID": "UR119194649", "Content": "Very comfortable, clean and close to Universal Studios... Self parking (even though you have to pay ...cheaper than valet ) was very easy. I would recommend this hotel to anyone going to Universal Studios", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Great Location to visit Universal Studios”", "Author": "BKBLUELOGIC", "ReviewID": "UR118987082", "Content": "If you are planning to visit Universal Studios then this hotel is just right for you. It is walking distance from Universal Studios - LA and City walk. There is a free shuttle service through out the day if you don't want to walk. Standard rooms are very basic, but the bed was comfortable. If you want to spend much time in your hotel room , I advice you to go for an upgrade, as the rooms are small in size. We were one couple so the size of the room was acceptable and we didn't spend anytime in the room except when we wanted to shower or sleep. There is no minibar or fridge for standard room so if you are planning to buy stuff that needs a fridge think twice. We bought chips and biscuits for snacks. The parking is 18 US$ per day but you can go in and out as much as you like. So include that in your budget if you are renting a car. I would advice you to rent a car in LA as the taxis are bit pricey. Hotel lobby is very nice and clean, staff are friendly. The 45 minutes free internet at the lobby for guests are very useful and you can use printers to print boarding passes or tickets for free. We used to check tripadvisor for local attractions nearby and plan our day. There is internet in the room with a fee. Breakfast was around 22 US$ open buffet but limited, however you don't need more than scrambled eggs, bacon, pastries , french toast, fruit salad, hash browns to start your day. I suggest you walk to city walk mall for breakfast if you are an early riser since shuttles start at around 9 am. In conclusion, if you are planning a trip to LA and your main goal is to visit Universal studios and spend most of your time there I highly recommend the hotel. .", "Date": "October 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "madera, ca", "Title": "“Alright hotel for \"name your own price\"”", "Author": "truxr4girlz", "ReviewID": "UR118746599", "Content": "I was able to get this hotel for $89 a night on priceline, but I would never pay more then that. Our room was VERY small, one of the tiniest bathrooms ever and I travel often. Self Parking is $18 a night which is average for this area. The concierge was super hard to understand with her hard accent and wouldnt stop pushing us to get a town car instead of a cab (pretty annoying, she waisted 20 minutes of our time by refusing to get the cab and pushing the town car!!) We ordered room service which was 15 minutes late, and we were in a hurry that morning (the whole reason we ordered room service) . Very overpriced.. Which I know room service is pricey, but when ordering a bagel I expected better quality, maybe costco sized bagel for $6. Not a tiny stail thomas bagel.. not even garnish on the plate, kind of shocking. And a side of hashbrowns for $6 that was smaller then the palm of my hand.. Also, it says on their website rooms have refridgerators, They do NOT! we didnt use the pool or hot tub, but the main reason we didnt is because the hot tub looked somewhat green from our room view. We also had a view of Vivid Entertainment studios (porn production company) LOL.. I must mention the positive points of our stay also! It was the PERFECT location for the reason we came to the area. If you are going to attend tapings to any tv shows its very close to all of the studios, LOVE that! I wish I knew the name of the guy sho checked us in . He was SO friendly and made us feel very welcomed and genuinly seemed to care about our stay. If concierge gets paid more he should be promoted! Also loved the walking distance to universal city. Although we didnt go to the theme park, the city walk is fantastic and I highly reccomend it. Very affordable restaurants there, and many of them! We plan to come to the area several times a year because we loved the experience of TV show tapings and still have so many things we want to do. Would only stay at the Sheraton again if there is an AMAZING deal, but will never order room service again!", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Irving, TX", "Title": "“Great hotel”", "Author": "Past_Traveller", "ReviewID": "UR118638385", "Content": "I had a quick stay at this hotel. Upon arriving, I was very impressed with the lobby. It was very modern and reminded me of a W hotel. The front desk men were very nice, helpful and efficient. I was upgraded to a corner room, which I assume had a little bit more space. The beds were the normal Sheraton Sweet Sleeper beds and very comfortable. There was a small flat screen tv in the room. The bathroom was smaller than some, but bigger than other hotels I've stayed in. It wasn't terrible by any means. The only \"awkward\" part was that the toilet was really close to the bathroom door. You couldn't open the door if someone was sitting down. I could hear the sounds of other guests through the walls at times, but I think that is somewhat normal when you're in a hotel. Overall, the room was clean and perfectly fine for my trip. I would stay here again. I was by myself this trip, but even if I were travelling with others, there was plenty of room in the room itself and several mirrors throughout the room so that you could continue getting ready while someone else is in the bathroom. The only odd thing was that when I woke up in the middle of the night, I didn't see an alarm clock, which is very odd for any hotel room. Upon waking up in the morning and looking around, there was an alarm clock, it just wasn't plugged in and I hadn't realized that the night before.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Fantastic Hotel”", "Author": "Naomir81", "ReviewID": "UR118596308", "Content": "After reading some reviews we where a little bit concerned about staying here but now we are not sure if they stayed at the same hotel as us. The service we recived was fantastic we arrived before the 3pm check in time and Emeka was able to check us in straight away. We found the location fantastic it is a 5min walk to universal studios and city walk a 5min walk to universal city station and then its only 1 stop on the train to the chinese theatre and a 10min bus ride to warner bros studios. Daisaku was able to help us with bus times to and from warner bros. All the staff where very friendly and helpful whenever we had a question and also received a hello whenever we walked into the hotel. The room was clean and comfy the bathroom was nice and clean, we had no problems with the lift waited 5mins at the most for a lift to arrive and we used the lifts at all different times of the day even with 2 functions on in the hotel there was still no problems with the wait time. We would like to thank Emeka (his Favourite ellen guests) and Daisaku for all there help over the time we stayed there nothing was to big for them to help us with", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Great Stay”", "Author": "hollie_s8", "ReviewID": "UR118355510", "Content": "I travelled with my 2 sisters, one of which was with her husband and young family. The hotel provided everything we needed for our short stay there, a pool for the kids, a short walk to the Universal City Walk and nightlife for us - Hotel had comfortable rooms, perfect location, and an amazing breakfast. Staff were very friendly and we thoroughly enjoyed our stay. If you are visiting Universal Studios it is the place to stay.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Great Hotel in a great place”", "Author": "CopenhagenMax", "ReviewID": "UR118225894", "Content": "We stayed 2 nights at this hotel and it was our first time to Sheraton in years since we stopped staying at Sheraton some years ago since we thought they were all old and needed refurbishment. Now this hotel has been renovatet and we found out many of the Sheratons are going through renovation. The room was very nice and spacious and since I love Starbucks coffee I was happy to see the room was equipped with a coffee maker and Starbucks coffee :-) There is a nice pool area, not big but not overcrowded so after the gym and a shower it was great relaxing there. Location is good eventhough you do not want to go to Universal Studios etc. (which we did not) The staff was very friendly in all areas and we did not experience any problems at all!", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "2", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Dublin, California", "Title": "“Great Customer Service”", "Author": "MAK101", "ReviewID": "UR118219410", "Content": "I stayed at this property for five days during a conference. We received an excellent event rate. The room wasn't huge but it was nicely appointed with dark wood furniture, flat screen TV, and a pull-out couch. It didn't appear old or in need of updating. I obtained a \"Lanai Room\" which overlooked the pool with a balcony -- I was told by other conference attendees that their regular rooms weren't as nice as ours. Maid service was thorough and efficient. The restaurant, bar, and gift shop were nice but over-priced. There are your typical conference rooms as well as a small bank of computers. There's a small bar by the pool. The customer service at this hotel was truly first-class; I didn't encounter anyone who wasn't exceptionally friendly, helpful and highly professional.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Victoria", "Title": "“Great Location if you want to visit Universal Studios”", "Author": "Winnie999", "ReviewID": "UR118176694", "Content": "This is a lovely hotel in a great location for those wanting to visit Universal Studios. If you are travelling from Los Angeles airport you can expect to pay $90.00 for a taxi. If you take the shuttle bus it is only $20.00. It is worthwhile purchasing your tickets to Universal Studios through the hotel as they offer a pay for one day and get the second day free. So it only costs $77.00 for two days admission. The hotel itself has nice feel and I would rate it a 4 star hotel. The hotel bed is really comfortable as Sheraton beds always are. The a â€™la carte breakfast was good. The staff were extremely friendly and helpful.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Orange, California", "Title": "“Great location, showing some wear”", "Author": "APDJOHN", "ReviewID": "UR118133925", "Content": "Recently stayed at this property. The lobby was nice, the staff were great and so friendly. The bathroom would be my only complaint as it was showing wear and needed to be fixed. The paint was peeling and just generally worn out. Other than that, you cannot beat the location if you are going to Universal. Again, the staff made the trip for us.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“It's all about location...”", "Author": "ielkin", "ReviewID": "UR118091451", "Content": "Easy access to major road 101/170, walk to subway station AND to the Studios! Comfortable room and bed, all amenities as expected. Free internet stations, huge parking garage. Great service, including concierge. \"Minuses\": long elevators waiting time, especially in \"rush hrs\"; morning \"starbucks\" in the lobby bar is quite far from the real brand flavor. Otherwise its all good.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“I wrote the review 2 mo ago that was titled \"stay at the Hilton\"”", "Author": "Motnzil", "ReviewID": "UR118046105", "Content": "2 mo ago we had an unfortunate experience. My husband and I decided to give it another chance and boy did the Sheraton redeem themselves!! Extremely clean room, nice and quiet, everything in perfect working order, staff was professional, friendly, and extremely helpful, club lounge was clean and fresh, our overall stay was a 10 out of 10! Everyone deserves a 2nd chance and I'm glad we stayed there again, so happy with the hotel we will be coming back in October with our children to attend Universal Studios again!!! Thank you Sheraton for going above and beyond, see you next month!!!", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Very convenient for visiting Universal Studio”", "Author": "xnipenn", "ReviewID": "UR118041269", "Content": "It is a great hotel for visiting Universal Studio. 5 minutes shuttle bus to Universal Studio. We stayed there 2 nigths. Staffs were very friendly, and helpfull. Room is clean. We bought our tickets for Universal Studio at hotel. you pay one tickets for 2-day entries.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "St. Catharines, Canada", "Title": "“HOT in CALIFORNIA..........................”", "Author": "Louise0518", "ReviewID": "UR117957272", "Content": "We just got back from a four day visit to California and we couldn't have picked a better hotel. The staff was friendly and helpful. A special thanks to Fernando, the conceirge, who helped us with all our questions and booked our tickets for the new, Cirque del Soliel, IRIS. He even took the time to show us the quick way from the hotel to the subway in order to get to Hollywood and Vine to the Kodak Theatre where the show was being held. It was only $3.00 round trip. The room at the Sheraton was clean and the beds were VERY comfortable. And, yes, this is the hotel where ELLEN has her guests stay during her shows. A very enjoyable stay, but way too short. We will certainly keep this hotel in mind if we ever return.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "S Wales", "Title": "“brillant location for LA would definately recommend”", "Author": "streakySWales", "ReviewID": "UR117886372", "Content": "Travelled with Virgin, Arrived at the Sheraton and found it be a modern look hotel. On our arrival was given a room that was not ready and as an apology without any hestiation they offered free internet access for the holiday. With a teenage daughter who wanted to keep in touch with friends on social network sites that was very usefull. We were given room 818 which had a lovely view of the hills, The breakfast was buffet but more than enough for what was needed. There didn't seem to be many breakfast diners close by which you find in other parts of the States. Location wise could walk to Universal studios without any hassle. The hotel is located on the side of the freeway with ease to travel towards the Pacific Coast but noise from the traffic which in LA is considerable is not a problem. The Hotel has well equipped gym and light and airy bar. All the staff were friendly and would recommend this hotel to others. Parking on site was $18 a day but that in that part of LA was not extortationate.", "Date": "September 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Phila", "Title": "“Fantastic”", "Author": "denjolu", "ReviewID": "UR117842865", "Content": "Clean, close to attractions, nice view. The lobby was beautiful and the rooms were nice and clean. The beds were comfortable. Universal Studios and Citywalk within walking distance. Would definitely return.", "Date": "September 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hood River, Oregon", "Title": "“Great staff”", "Author": "BizDevRoadee", "ReviewID": "UR117829051", "Content": "The good: the staff and the location. The ok: room amenitites and decor. The not so good: this is an old hotel that's been renovated. The rooms are evidence of this. The bathroom was tiny, the light switches barely worked, stuff was just a bit rundown. The restaurant was really expensive ($14 for oatmeal, juice and coffee?!) and $7 a day for Internet. But, this really is an ideal location for visiting Universal Studios and City Walk.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Excellent Customer Service”", "Author": "peter_vpnet", "ReviewID": "UR117784285", "Content": "The staff showed that they were trained properly and provided me with excellent service. I was even impressed with the valet service which normally is the downfall of most properties. It was the first time that a valet cleaned my windshield when they noticed it was dirty. Sometimes the smallest details means the most. The only negative was the long wait for the elevators in the morning and the small sink in the guest room. Other than that, my stay was great.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Simply The Best”", "Author": "Margaret F", "ReviewID": "UR117494911", "Content": "I have stayed at this property in the past and all of my time there including this month, was just great. Staff was incredible from the housekeeping to the front desk to the restaurant and the bar area. Weather was great in LA and I would never ever consider staying anywhere else. Sheraton in Universal City is the place to be. I was glad to get back home but when I climbed into my bed, I couldn't help but wish I was still in the large king comfy bed at the Sheraton :) Go there and stay - you will not regret it. Margaret", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Comfortable Stay”", "Author": "Scorp1970", "ReviewID": "UR117398489", "Content": "Stayed two nights at the Universal Sheraton with my partner. The room had a king size bed, small loveseat, coffee table and desk. Nice size bathroom, closet and balcony overlooking the pool. The room was clean and the hallways were quiet. The hotel has a spacious well-kept lobby and very friendly staff. And it's pet friendly. I would definitely stay here again when I get back to L.A.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "CA", "Title": "“Great hotel, great location”", "Author": "Moonstone07", "ReviewID": "UR117253291", "Content": "We stayed at the Sheraton Universal while visiting Universal Studios. The hotel was very clean, bed linens were crisp and the bed was comfortable and inviting. We got a very reasonable rate, even better than the on-line rate by calling the reservation line. The staff at the hotel were helpful and very professional. We had a minor problem when we first arrived of a toilet that would not flush. Our room was quickly changed by the front desk staff. Self-parking at the hotel is $18.00 in a covered garage. There is a free shuttle to the Universal park. It was so convenient running about every 15 minutes. The pool area was clean, plenty of poolside towels available. Very enjoyable! If you are traveling with a family, there are some rooms around the pool area which probably be very convenient if you have children that want to spend a lot of time in the pool. We would definitely stay at this hotel again.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Buckinghamshire, England", "Title": "“Brilliant location. Website does not do it justice. Staff brilliant!!”", "Author": "leeclump5", "ReviewID": "UR117201948", "Content": "Stayed here for two nights. Wanted to be close to universal studios...couldn't be closer, could see studios and filming locations right from our bedroom window. Free shuttle takes you to and from universal all day and up until 9.30pm. After this time you can walk back, takles about ten minutes and is downhill. Staff superb. Nothing too much trouble. One of our group was poorly with ear infection, staff were great at organising taxi to a drs surgery etc. Very helpful! Breakfast was great. Most of us ordered off the menu, but buffet also good. Upgraded to front of line pass for universal studios. Well worth it, queued for 30seconds to 1 min for the rides. Whereas other queues approximately 50-70minutes long!! We organised a private tour of the sights, for family of 5 this was cheaper than using open top tour bus...which in the heat would have been awful! Would definitely stay here again if we were going back to universal.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Liverpool", "Title": "“Fun times at Universal Studios”", "Author": "strawmato", "ReviewID": "UR117142429", "Content": "The hotel is a short walk away from the Univeral city walk. There are buses to downtown LA. Really enjoyed my stay and Universal Studies being 5 minutes away meant that I could stay n the park all day and not worry about shuttle buses. My only minor problem was that my room was difficult to find as it was at the rear of the building. Once I knew where I was going it wasn't a problem. Lots of conferences going on at hte hotel which meant the bar/restaurant was always busy. Easier to eat out on the city walk.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Montana", "Title": "“I have spent over 20 nights in this hotel and it is nice.”", "Author": "Exploremt", "ReviewID": "UR116948892", "Content": "I stay at this hotel for business a couple times a year. It has a stylish lobby and nice views. I have no complaints about the staff they all seem pleasant. I do not reccommend eating at the resturant or drinking at their bar as their pricing is outrageous. There are plenty of good resturants within a 10 minute drive and if you are on foot, simply walk up to the carnival atmosphere of the Universal City Walk, which while somewhat overstimulating and full of tourists has some decent resturants and bars that are, if you can believe it, cheaper than at the Sheraton.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gatwick", "Title": "“Brilliant hotel for families”", "Author": "saraben", "ReviewID": "UR116946837", "Content": "We spent one night here at the end of our holiday. The hotel was immaculate with all the facilities you would expect from a Sheraton. Would certainly recommend for business travellers or holiday makers. Lovely pool area with its own bar. Business Centre. Free transfers to Universal Studios.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hanoi", "Title": "“Great place if you are going to Universal”", "Author": "SimmoHanoi", "ReviewID": "UR116877479", "Content": "This is a good five star hotel very handy to Universal Studios. Rooms are decent. They charged us an extra 50% for late check out which borders on being fair. They run a shuttle bus to Universal which stops you having to pay for parking", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Levittown, Pennsylvania", "Title": "“Add a jungle gym to the Club Level”", "Author": "paul h", "ReviewID": "UR116774263", "Content": "I am a SPG member and this is my second time coming to this hotel. Last year tthe Sheraton had complimentary beer and wine. Not this year. I must say too many children running wild with no supervision. No wonder kids get abducted, anyways - The club level is a disaster - No where to sit, dirty little hands touching everything, limited selection and the wonderful laughter of the precious children. The morning was worse. I get free nights so I shouldn't complain, but what the heck. I will continue to use my points, but i will not splurge on the Club Level. The Sheraton must be really discounting these rooms.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gold Coast, Queensland", "Title": "“Good location for visiting Universal Studios”", "Author": "coastskigirl", "ReviewID": "UR116658665", "Content": "We stayed here for 3 nights as we were planning on visiting Universal Studios. Was so close we were able to walk or catch the shuttle bus that left at regular intervals. The young guy we got for our check in was really friendly and helpful and as our flight was leaving late happily gave us a late check out. Probably the only annoying thing is no free wi-fi in rooms and the cost of car parking but overall we where happy with our stay.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Toronto", "Title": "“Mid-range hotel with good location for attractions”", "Author": "LakesiderToronto", "ReviewID": "UR116535579", "Content": "The hotel's location is very good if the purpose of your stay involves spending time at Universal Studios. It's a very short walk and there is a complimentary shuttle so if you've spent all day at the Studios, you'll be glad to have your room close by. There is only one restaurant which is on par for this type of hotel. The lobby bar lacks character and is situated in the middle of the main foyer and there is only one shop which offers the standard gift and traveller's supplies. Request a room in the lower podium area surrounding the courtyard pool. The rooms are generously sized with large balconies that overlook the pool, providing a retro southern California vibe. The rooms and common areas were clean and overall the staff service levels were good.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great hotel with a fantastic location”", "Author": "Tina K", "ReviewID": "UR116496980", "Content": "We just got back from our stay at the Sheraton Universal Hotel. We loved every second of it. The entire staff was excellent and really went out of their way to make us feel welcome. The maid said hello to us every morning and made small conversations. The concierge was great. He worked efficiently, but also provided each guest with the attention that they deserved. The people at the front desk were super friendly and helpful upon our arrival. The waiter during happy hour kept our snacks full and our drinks replenished. Our room was very comfortable and had everything that I would expect in a hotel room. Yeah, the bathroom was a little small, but I'd rather have space in the room than have the bathroom take up space. The view was also wonderful. We were on the 16th floor, so we got a nice view of the pool and of the surrounding scenery. I'm not sure what they do, but when you enter the lobby, it smells amazing. I loved breathing in when I walked in each time, as weird as that may sound. The location of the hotel was the best part. It is so close to Universal Studios and they offer a discount of 2 days for the price of 1. We took advantage of buying the tickets from the concierge, but didn't end up going the second day because we saw everything at the park (except for the Shrek 4D--we weren't interested in that) in just 8 hours. I suppose we could have gone back and done some things twice, but 8 hours was enough when you're in the sun and crowds, and we had other things we wanted to do while on vacation. We didn't take the free shuttle from the hotel because we were so close that we just walked. (Avoid doing this if you do not do well with hills.) This brought us to many entertainment options from movie theaters, a bowling alley, restaurants, shops, bars, etc. Anyone can find something to do and something they will like to eat at the City Walk area. We were also a super close drive to NBC Studios and Warner Bros. Studios. We went and saw the Tonight Show with Jay Leno and took a Warner Bros Studio Tour while we were there. Both were great experiences and extremely close to the hotel. The only complaint that we had was that the elevators were very slow. They were often over crowded because people didn't want to wait anymore. I think it was pretty normal to wait at least 5 minutes for an elevator. Being on the 16th floor, I wasn't about to take the stairs. The ride up was very uncomfortable when people overstuffed themselves into the small space. In the hotel's defense, there was some pageant going on during our stay as well as the Teen Choice Awards, so perhaps they were busier than normal and their elevators don't normally experience these types of delays? The parking also was a bit pricey. I mean come on, $18 a day for a piece of concrete? That was a little bit annoying, but I guess that's life. All in all, we had a great time at the Sheraton and would definitely recommend it to anyone!", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "victoria,b.c.", "Title": "“\"Best Hotel of the Road trip\"”", "Author": "lumeljay1", "ReviewID": "UR116444898", "Content": "From the time we arrived we had nothing but wonderful feelings about this hotel. Though we self parked the valet attendants were friendly and eager to help. Front desk staff were great and our room on the 8th floor gave us a great view of the pool area. Though we didn't use the restaurant we did use Starbucks for breakfast which was just fine with us. There was a pool party on when we arrived so we headed down for music and food reasonably priced. The shuttle service was excellent to Universal and Citywalk provided lots of restaurant choices. The rooms were the cleanest I have ever seen and the decor modern and attractive. Best stay in a two week roadtrip. Loved the shampoo!", "Date": "August 8, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chino Hills, California", "Title": "“Friendly People Really Make a Difference”", "Author": "RaceGirl_11", "ReviewID": "UR116431340", "Content": "We stayed at this hotel because we went to Universal Studios for the day. From the moment we drove on to the property the staff was welcoming and friendly. We had a great stay here because the staff made it memorable.", "Date": "August 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "California", "Title": "“Very odd room .”", "Author": "Marilynbn", "ReviewID": "UR116354432", "Content": "I am writing this while we are still here at the Universal Sheraton. I will list the oddities of our poolside double queen room. No clock Slider to patio/pool area broken lock so we cannot open glass door Toilet is almost under the sink Shower head is too low at 5 feet Full length mirror is in closet behind hanging clothes. Bathroom door does not close Toilet handle needs fiddling Broken lamp switch...unusable light Plus I am amazed that any hotel is still charging for Internet access in your room. Especially for a non-high end hotel like the Sheraton. They charge $9.95 per day! As a travel agent I am usually given nice rooms so I can encourage my clients to go to the hotels that I stay at. This will not be the case for this hotel. The people have been nice but...let's see how long it takes for them to repair our slider.... So far it has been 2+ hours and no fixing.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Central California", "Title": "“A Great Vacation!”", "Author": "brooksterann", "ReviewID": "UR116286691", "Content": "Just returned from two nights @ the Sheraton Universal. We got a great rate through a \"name your own price\" website (midweek stay probably helped) and we were not disappointed. The front desk employee was polite and he gave us our bedding choice \"even though we booked through a third party\"... The room was a bit small but very quiet, the beds were comfortable, linens and pillows were nice, and room & bathroom were very clean. No fridge, but our cooler sufficed. Free shuttle to Universal runs every 20 min (or less) and drops you off at the center of City Walk (very close to park entrance). We did not eat at the hotel, but we did use the fitness center and although small, the equipment & facilities were clean and very nice. Our room was on the 8th floor of the tower and had a pretty pool & hillside view. My only issues were that they charge extra for everything (parking, internet etc) and that they did not make up our room the first day, but they brought us extra towels and coffee very quickly when we requested them. Overall it was a great stay and very convenient for visiting Universal and the Hollywood area.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Krakow", "Title": "“A bit disappointed - expected more from Sheraton”", "Author": "Michal32", "ReviewID": "UR116259665", "Content": "I spent 5 nights there. I rated this hotel with just 3/5 stars as I think you have a right to expect more from this chain. The most annoying was problems with internet â€“ any browser couldnâ€™t open the login site, neither from laptop nor smartphone. I finally called quest service, they transfer me to external tech-support company and I spent like 20 minutes with very nice guy who helped me login into internet.. But it shouldnâ€™t be like that. Then breakfast â€“ you pay like 20USD for buffet but the choice was very limited. So for me â€“ another â€œ-â€�. Location â€“ if you are going to visit Universal City or Hollywood â€“ very good choice (one stop by metro from Hollywood blvd. â€“ Kodak Theatre). If Santa Monica or downtown â€“ take another one. Be aware â€“ 100% no smoking hotel. There was also strike of some employees during my stay - just in front of the hotel â€“ bit loud â€¦ but ok, it happens - appreciated that the hotel manager addressed quests with letter explaining situation and apologies. So generally â€“ hotel ok, but from Sheraton you expect moreâ€¦", "Date": "August 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“This hotel was a star among local hotels but not anymore”", "Author": "globbiztravel", "ReviewID": "UR116107505", "Content": "I have been staying at the Universal Sheraton for the past 12 years. I have experienced a wide range of service and issues during all 4 ownership changes and management at the hotel. Prior to the renovation was probably the best time period for this hotel. Management was great at that time. Presently over the past 12 month period I have stayed at the hotel about 6-8 different times. Current management is not what I would consider to be responsive or care about their customers. They offer comment cards but NEVER respond to issues. This is not a hotel for business travelers as the hotel does not cater to them. If you are on vacation then you are the perfect victim to the hotel as there is no timliness in their vocabulary. I met with the operations manager On one of my past trips and he assured me everything would be corrected. That was a lie. The hotel has no quality control - some examples arriving in the room and TV doesn't work or no shower curtain in bathroom or telephone never charged and not operating or light bulbs burned out and non operating. This is hotel management 101 and this hotel doesn't care. Other negatives include untimely delivery of room service breakfast when ordered the night before, not reading breakfast card to not include certain items because they cause extreme allergy and could cause medical emergency, high speed wireless is a joke, some rooms have air conditioning while others don't, gift shop hours vary depending on when they decide they want to close despite hours posted in hotel guide. Forget about enjoying the view frOm your room as it would appear windows have never been washed on the outside - only when it rains. The value charged for nightly accommodations increases during summer months when there are more tourists. The prices do not meet the value at this hotel. It is sad that a hotel within the SPG family lacks proper management, upkeep of technology, quality control and time management so that all guests are treated fairly and their needs are met. I guess long time loyalty to a hotel doesn't matter anymore.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "NYC", "Title": "“Improving...”", "Author": "Red_Dolphin-Media", "ReviewID": "UR116041733", "Content": "I have stayed at this hotel many times during trips to LA, and I have to say I was very pleasantly surprilsed with the recent renovations to the lobby and bar. Also, I was worried after reading about elevator issues, but had no problems whatsoever with the elevators. I arrived at about 1am and had to wait at the desk a few minutes as there was nobody to be found..when the clerk finally emerged from the back she was a bit unfriendly (as if I had woken her or stopped her from doing something). I am an SPG gold member and she said she put me on the \"club floor\" on 15...yet my key never worked in the club in the morning (the club is on 9). Go figure...not sure how you have a club floor with no club. Compared to previous stays this one was better. I do normally prefer the Hilton next door as it strikes you as much more of a deluxe hotel, but the rate at the Sheraton on the night I was staying was much more reasonable. Overall not my favorite hotel, but I commend the management for improving it and hope they continue to better train staff and respect loyal SPG guests.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Santa Barbara", "Title": "“What a lovely hotel!”", "Author": "SantaBarbaraSusieQ", "ReviewID": "UR116034902", "Content": "I stayed there with our daughter and her 4 year old triplet sons. We had adjoining rooms that were beautiful and comfortable, and everyone bent over backwards to make our stay a great one.", "Date": "July 30, 2011"}, {"Ratings": {"Overall": "2.0", "Value": "2"}, "AuthorLocation": "san francisco", "Title": "“Not so great.”", "Author": "sacoxf", "ReviewID": "UR115870514", "Content": "I feel pretty sure this was not worth the price of Aprox. $200. The room was on the small size. The first room we were given had a gigantic red stain on the carpet, one dirty sock and a body sized grease smudge on the window. The moved us to another room and gave us free parking for the inconvenience. But I think they could have offered more. The restaurant had a very small menu. The rooms around the pool looked nice, but in the tower where we stayed, it was small and cramped with windows that needed a good wash. I was excited to stay in this hotel as it's close to universal and it has a shuttle and looks really nice in the pictures. Everything is much smaller (the room, the pool) in person. I do happen to stay in Starwood hotels frequently. I will not return to this one.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Walking distance to Universal Studios”", "Author": "azmommyof2", "ReviewID": "UR115864725", "Content": "My husband, 14yr, 6yr & I stayed here for a trip to Universal Studios. The hotel room was fine, no complaints. We needed extra towels & they were promptly delivered within minutes of calling front desk. There is a shuttle to Universal Studios but we did not use it as the park is extremely close. If you are not completely out of shape or elderly, the walk should not be a problem for u. It's probably 5 minutes away.... We'll probably not return to Universal Studios again but if we did, we would definitely stay here. Btw, I was lucky enough to get this hotel using Priceline's \"Name Your Own Price\" feature :)", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Scranton, Pennsylvania", "Title": "“Great Location, very helpful staff, nice room.”", "Author": "familytraveler20002", "ReviewID": "UR115825722", "Content": "All three concierges I encountered were friendly and very helpful. Parking and the front greeting staff were energetic, friendly and very welcoming. The room was clean and comfortable. The room temperature remained comfortable. The room was quiet. Nice view from the room. Three elevators were mostly fine, but were not enough when there was an event at the hotel. Over our 5 night stay, the house keeping staff repeatedly left us with not enough towels each day, despite us each day requesting more towels. (4 guest should be provided with at least four bath towels.) Dining prices in the hotel were on the high side and I would recommend using the easy access to Universal City Walk restaurants. Beware that the free shuttle's last run is 10 pm from City Walk. The walk back to the hotel is not bad.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Stay at the Hilton instead!!!”", "Author": "Motnzil", "ReviewID": "UR115774254", "Content": "1. The lock on the sliding glass door was broken off and it was about 1/4 of an inch sharp metal. Reported it two days in a row it NEVER got fixed!! I have a picture on my camera to prove it.Â  2. The metal bar to lock sliding glass door was also broken that when My daughter went to open the door it fell on top of her head. My husband immediately called the front desk.Â  3. PillowÂ Â cover was stained and also had little spots mold. Reported and was never changed. Also have pictures of that. 4. Two days in a row I asked for a refrigerator and neither time did anybody get back to me to tell me if they did or didn't have one.Â  5. It's a \"universal\" hotel, it states there's a nickelodeon channel but you have to pay 2.99 per show. There are no children channels.Â  6. Saturday night we go to get in our room and they changed the the code to the lock, when we were prepaid for 3 nights. Tired and all, had to walk back to the front desk to get a new key. Just a complete inconvenience for no reason! 6. Bathroom is so incredibly small. So is the room, you can hardly walk.Â  7. The lobby smells so incredibly strong like air freshener you can smell it from outside and gave me a sinus headache.Â  8. Twice they Â forgot to leave wash cloths. And only left three full size towels. Isn't there an order of how the rooms should be prepped?Â  9. Beds are so rickety and uncomfortable. After they claim and boast about their Sheraton beds. They are terrible.Â  10. It was 10:30 at night and so incredibly loud.Â  11. Â There was hair in the shower from a previous guest. Toilet was dirty Â The whole room was just not clean at all.Â  12. After we packed up our room at 8:00pm we called for a cart and 25 minutes later we still had NOT received one so we did not want to wait anymore and had to drag all of our stuff out! The service and hotel was the most disgusting experience I have ever had.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Perfect for a short stay”", "Author": "MichaelCowley", "ReviewID": "UR115599563", "Content": "Really enjoyed our time here as it's a great location for the Universal Studios visit. Had an executive club suite which was huge and well appointed - disappointed with the club offerings at cocktail time as alcoholic drinks weren't gratis . We headed downstairs to the excellent bar where we met a Hollywood screenwriter and chatted for about 3 hrs -what a blast.Staff all very professional and another quality Sheraton offering", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "British Columbia", "Title": "“An okay place to stay but the elevators are definitely a problem”", "Author": "Traveller1322", "ReviewID": "UR115599089", "Content": "Prior to our trip, as with every trip, I check out trip advisor. I had read that the food was over priced and the elevators were an issue. We stayed here from July 3 to July 8th. We did not have any issues checking in. A bellman took our luggage and let me keep my car in front of the hotel until I got our bags out and checked in. We chose to self park. The parking is extremely close. From the reviews I had read, it sounded like it was farther away but it is very close and very convenient and I don't see why you would need a valet. We were on the 4th floor and our room faced the pool. I thought the room was clean and well serviced and never had any issues at all. The main floor/ lobby of the hotel is renovated and very nice and they have a concierge who, when they are there, is very helpful. You can purchase Universal park tickets on site and they are knowledgeable about any deals or savings. We wanted to purchase tickets with cash but could only use credit card and the man was willing to put on his credit card and we would pay him the cash. We used our credit card but that was going out of his way I thought. There is a lounge right across from check in. Down farther on the main floor are computers for anyone's use. I think there are at least 6 computers available and I used them at different times during the day and never had to wait. The gift store has various items, from gifts to books to items you may need such as nail clippers (which we did). We had club service, so it was very nice to be able to go up in the morning and have some breakfast and h'ors doevres from 5 to 9 pm. Yes there is a charge for alcohol but soft drinks are free. The only problem with this hotel and it is a HUGE problem are the elevators. They are truly awful and I was so thankful to be on the fourth floor because you could walk down two flights of stair and be at the lobby. Lobby is 3rd floor. Just like everyone writes... they take FOREVER and A DAY. We checked in on a Sunday night and after we were settled, we wanted to go to the club level, floor 9 and check it out. The elevator was full of people. It was elevator #2... we were trying to get to 9 and it was like it was trying to understand the message of the floors but couldn't quite get there. It went to 9, stopped but didn't open, then went to 7, then back to 9 (not opening but acting like it may be thinking about it) went up to 10, down to 5 and then to 9 and finally opened. It was AWFUL. I have never been so close to thinking I was going to be stuck in an elevator. We got out right away. We chose to take the stairs down to the lobby to check it out more. When we went to go back to our room... there was a maintenance man talk to the elevator door saying, \"OK sir, I have called the repair people and they will be here shortly\" According to hotel staff, he was stuck in there for 45 minutes. They reassured my family member that it was all fixed. The next morning I was back in there and lucky for me, #2. I was trying to go to one of the top floors and the same thing happened. I never stepped foot in #2 again. The elevators never once took 90 seconds. I waited up to 15 minutes most times. They have seats outside the elevator, for a reason I believe. You really need to use them because the elevators take so long. We did have lunch one day in the restaurant and it was fine. There is a grocery store very close and we purchased some beverages and snacks. It costs $22 for two beer delivered room service which is crazy when you can go to the store and purchase more than two for cheaper then that. Loved the pool, loved the shuttle to Universal. Really easy to access and very friendly drivers. Does get quite full as it services more then just that hotel, so I had to stand once but all in all, it was easy and free! One day I was trying to rush and catch the shuttle and I could see it start to drive away and so I stopped running and my body language showed I was disappointed. The driver saw me and stopped and waited for us. So that was very nice. The worst part about the hotel is the elevators and I would not stay here again because of the elevators. Very scary. There are several comments about the elevators, so Sheraton needs to pay attention to that because it is a deal breaker in my opinion. Otherwise this is a fine place to stay. Just need to fix the elevators. Pillows and beds very comfy!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Ideal for Universal and Hop on Hop Off Bus”", "Author": "TartanTravellers07", "ReviewID": "UR115416970", "Content": "Stayed at this hotel 7 to 9 July. Booked via the internet 2 days before and got a deal which included parking, breakfast and universal tickets. Check in and check out was quick. Room was spacious and clean. Bed was extremely comfy. Buffet breakfast was very good. Service friendly. Free shuttle to Universal Studios but if you are able you are just as quick walking - 7-8 minutes. Can also get picked up here for free to take you to the pick up point (Chinese theatre) of the Hollywood loop of the Hop On Hop Off Bus tour - you can switch later to other loops. All in all we this hotel was very good and good value for money.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "San Jose, California, USA", "Title": "“If your thinking of staying here, please read this first (awful experience) ...............”", "Author": "JasonLT", "ReviewID": "UR115366749", "Content": "My wife and I stayed at the Sheraton Universal hotel on 07/02/2011 â€“ 07/04/2001. The hotel stay was absolutely terrible. Please read on to see what you are in store for should you decide to stay at the Sheraton Universal. First of all, while checking in, the front desk clerk (Jason) failed to tell us about the evening hors dâ€™oeuvres service (not a big deal initially, but it set the precedence for this hotel stay). I knew about the Club Level because I reserved a Club Level room. However, this hotel has Club Level floors and Preferred Guest Level floors. Although the floors look identical, they are labeled differently when getting off of the elevator which leaves a guest who reserves a room on the Club Level floor to believe they are getting less value of a room by having to stay on the Preferred Guest Level floor. The hotel put us on the Preferred Level floor so it was confusing to the front desk clerk (looking at his computer) as to what amenities were available to us. I asked him 3 times after checking in and he kept telling me that if I wanted evening hors dâ€™oeuvres or breakfast, Iâ€™d have to go to the hotel restaurant (he kept looking at me as if I were trying to get a hotel service for free). This got me very confused and second guessed myself as to what level of room I had reserved. Next, most hotels offer complimentary beer and wine on the Club Level during the evening hors dâ€™oeuvres service. Not this hotel. And that is hotel, in the club reception room, there are bottles of 5 beers and 2 wines on display on the appetizer table. There are sodas and bottled water right next to the alcoholic beverages display. However, there is no mention of those alcoholic beverages costing anything. No sign, no announcement, nothing at all. Even when the hostess came by to take a drink order, there was no verbal mention that there would be a fee for the alcoholic beverages. Once the hostess brings you the beverage, she brings you a check with the alcoholic beverages on it (and expects a tip on top of that). Now, what is the point of paying extra for a club level room if they are even going to expect a tip? Although most hotels offer complimentary beverages, beer, and wine at the evening hors dâ€™oeuvres time, it is fine that this hotel does not. But at least inform the guest of such. Ok, so next problem. The elevator service is terrible. Before staying that this particular hotel, I read a review on this hotel that stated that the elevators took a guest 8 minutes to get from the ground floor to her room. After reading that, I thought to myself, â€œthat cannot possibly be true. What an exaggerationâ€�. However, on that particular review, the manager responded that he tested the elevator service and it should never take more than 90 seconds to hail an elevator. I thought, â€œthatâ€™s trueâ€�. However, believe it or not, that guest was correct! The first elevator trip to our floor after checking in took 13 minutes to arrive at the lobby level, not to mention a few additional minutes to get to our floor. The elevators could not handle the capacity of the guests, and once to capacity, seemed to bypass the lobby floor where the majority of guests were waiting to go to their rooms. If an elevator stopped at the lobby level, it was a miracle (and so crowded that only 1 or 2 guests could get into the elevator). I think the manager who responded to the previous guestâ€™s review about the elevators was testing the elevators out at 3:00am in the morning. Next, we arrived in our room and it was facing the freeway (obviously noisy as heck). I called to request a room change (mind you, this is at 6:00pm) and I was told that the hotel was sold out and there was nothing they could do. I was told that maybe there would be rooms available tomorrow (Saturday) so I politely said to let me know in the morning. The front desk clerk said I would have to call back in the morning and inquire. Ok, so one more thing for me to do? I asked if they could simply call me and they said Iâ€™d have to call them and re-inquire. A few minutes later, I called back and said I definitely needed a room change. I was told someone would call back in 5 minutes. 20 minutes later, I called back since no once had called me. I was told that they were still searching for rooms (mind you, there were still tons of guests checking into the hotel so what the big deal was about a room swap was beyond me). They finally called back and said the only room they could fit me into was a standard room on the third floor (not a Club Level room) that faced the hotel parking structure. And when I say faced it, I mean you look out the window and you literally see a concrete wall in front of you with a little cement entrance road below. How disgusting and certainly a slap in the face. Was it intentional, Iâ€™ll let you decide? Read on and youâ€™ll somehow agree that the culture of employees at this hotel are rude and not customer service oriented. So, we kept the room and moved on. We left for Universal City Walk at 8:00pm and stopped by the front desk on our way out. We spoke to the clerk who initially checked us in (Jason) and asked for a room refresh of towels and an evening turn down service. Jason looked up our room and stated he would take care of it. My wife even double confirmed the correct room number and Jason repeated our names back from the computer. So we thought we were set. Not so. We returned at midnight to find the room untouched. I called downstairs and was told there was no housekeeping staff on duty at midnight. Now come one, youâ€™d think a hotel this size would at least one housekeeper on duty. I asked for a manager and was told there was not a manager on duty until 9:00am the following morning. Are you serious? No manager. Who is in charge if the hotel was on fire? I was told that there absolutely was no manager on duty and there was absolutely nothing they could do. They sent a maintenance type employee up to our room with a stack of towels. Period. They stated that they would email a manager and he would contact us at 9:00am sharp the following morning. I simply got a voice mail message on our phone (which I did not get until we returned from Universal Studios the following day at 5:00pm). The message simply stated along the lines of said â€œHi, this is Chris Moraca, Front Desk Manager, I heard we had some issues last night. Please feel free to call me with any questionsâ€�. The next evening of our hotel stay (night 2), we left for the City Walk at about 6:30pm and called the front desk to request a room refreshing and turn down service again. They stated that there would be no problem with such a request. We returned at midnight to find the room untouched again. I called the front desk and was again told there was no housekeeping at that hour and no manager on duty. This is a Saturday night. What do you mean no manager on duty? It was the same front desk person I spoke to the previous evening (Leanne) and she could not believe what was happening. She apologized and stated that this was â€œcompletely unacceptableâ€� for this hotel to treat a guest in this manner. She promised to have a manager call my cell phone the following morning (of which I received no call from a manager or supervisor). Furthermore, Leanne stated that the manager that she was emailing that evening was Holly and that Holly would be the person contacting me in the morning. I told her we had no shampoo or soap left and had to get up very early the next morning for a flight. She said she would have the items brought right up to our room. Ten minutes later, my wife called and asked where the items were. It was 1:00am and we could not be hanging out waiting for the items because we needed to get to sleep for an early morning flight the next day. We were then told that the items were not on their way because there were other guests that needed attention first and we would have to â€œwait our turnâ€� in a line of requests. Finally, a hotel employee arrived again with a stack of towels and an entire bag for soap and shampoo. I mean, there had to be 20 bottles of mini shampoos and about 30 bars of soap. What point were they now trying to make? Finally, upon check out on Sunday morning (at 9:00am), there was one luggage valet available for approximately 7 â€“ 10 parties waiting for his services downstairs. Thank goodness we did not have to have a luggage valet come to our room. It would have never happened. We were getting a bit anxious that no one was able to assist us with calling for a taxi so we went back into the hotel and visited the concierge desk. We asked him to help us get a taxi. Although he was helping no one, he said only the bell desk could help us. Come to find out, all the bell desk needed to do is push a doorbell style button once which signaled a taxi to come to the lobby entrance to pick us up. Are you telling me that the concierge could not walk over a few steps and push said button (or at least tell us how to push the button)? It would have saved so much waiting time and energy. All in all, this hotel is poorly managed, lacks proper training, and a disgrace to the Sheraton name. I have never wrote a review on anything in my life as they are very time consuming. However, in this instance, I felt compelled to because I have never been treated this way. And to wrap it up, to this date, there has been no call from management to address the happenings during this stay.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Fab place to stay”", "Author": "Robandwilson", "ReviewID": "UR114980458", "Content": "Checking in was easy and everybody was friendly and helpful. Since we arrived early from Australia our room wasn't ready at 8am but the staff rushed around and were fantastic and let us in early, They could not have been more amazing, Bed was a great size and view was good, so close to walk up to city walk and having the blue line hop on hop off bus outside was AWESOME, Only downside the starbucks in lobby, could've been the worst coffee I have ever had, but can not fault Sheraton universal Hotel", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“Average hotel”", "Author": "Belly2007", "ReviewID": "UR114942036", "Content": "We chose this hotel as it was near to Universal Studios. However, everything here you need to pay additional for, such as internet in room, breakfast, and parking ($18/day, with in-out privileges) They had a good number of computers where you can surf the web for free at their business center downstairs but it's usually full during peak times. Fortunately I was jetlagged so I was down there by 4am and nobody would be competing with me for the computers :-) They also had in-room starbucks coffee, and free newspapers at the business center. All in all, average / ok hotel, no wow factor, wouldn't recommend or NOT recommend to anyone.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Nice place, no complaints”", "Author": "Blondie2846", "ReviewID": "UR114611563", "Content": "Overall nice place. The bed is super comfy. The room and lobby are modern and updated. Everything feels very clean and new. The staff were very friendly. The food is so-so and overpriced. The gym is quite nice, but gets very crowded. There are 3 ellipticals, and 4 treadmills. I feel like they could fit in one more elliptical - since they were almost always full in the morning. But overall very impressed with the gym. Pool area is so-so.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Good place to stay if visiting Universal Studios”", "Author": "Fox0597", "ReviewID": "UR114034066", "Content": "If you're planning a visit to Unversal Studios, this is a good hotel to stay at. It's about a 10 minute walk to get to Universal Studios or the Citywalk from the hotel. I recommend booking club level. You get light snacks in the evening and a light breakfast in the morning. Don't expect too much for breakfast...not hot items to eat. If you're looking for a good breakfast, you'll likley need to dine at the restaurant on lower level. If you're planning on using the gym, it's a decent set-up consiting of treadmills, stationary bikes, dumbells, and strength equipment. The only issue I had was the lack of airflow. The morning I worked out it was very hot and the A/C didn't seem to be working.", "Date": "June 17, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Orange County, CA", "Title": "“So-so”", "Author": "OC_M_Lu", "ReviewID": "UR113577750", "Content": "We had tickets to watch the Playboy Jazz Fest at the Hollywood Bowl and thought it would be great to stay at the Sheraton due to the close distance to the Bowl. Check-in was a breeze; they allowed me to check in at noon even if technically we had to wait till 3pm. I requested a room close to the elevators on a higher floor and they gave it to me without a hassle. The room had a flat screen tv, coffeemaker, safe, iron and 2 phones (wireless phone doesn't work-battery light was blinking). Major stain on the carpet very close to the window- gross. Another problem was the A/C didn't function so well. It didn't feel cold, it just felt like a strong fan all night. We sort of expected (half-hoped) that they would have a shuttle to the Bowl; unfortunately it wasn't one of the stops so we just cabbed it. By the way, self-parking is $18 per day and valet is $23. Props to the valet guys-very friendly and cheerful even if the weather outside was dreadful and gray on that saturday afternoon. We had breakfast the next morning at Americanas which is located on the terrace level overlooking the pool. It wasn't very busy so we were seated right away. The buffet breakfast didn't look too appetizing so we asked for the lunch and dinner menus and I ended up ordering off the dinner menu. My ribeye turned out just the way I want it and my bf enjoyed his spinach and egg white omelet. We asked for plain bagel, unfortunately, at 11am they ran out of plain bagel and served us raisin cinnamon bagel and charged us $2 for the cream cheese. WE had a so-so experience at the sheraton - nothing really fantastic stood out. Will we go back and stay there again? Probably not. Maybe we'll try the Hilton next door.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great stay for work and play”", "Author": "FlyNurse365", "ReviewID": "UR113275982", "Content": "This was a great stay during my birthday weekend and then for work the rest of the week. Everything was crisp and clean. The housekeeping was great in respecting my privacy as well as having everything fresh. This hotel was a perfect distance from universal and staying away from the spotlight. Definitely will stay again.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "New Jersey", "Title": "“Nice Hotel but super busy....”", "Author": "yayalola", "ReviewID": "UR113168481", "Content": "I went with my daughter last year. She was selected in a model contest and they sent us to this hotel. It's was nice and the location it's great. You can walk to the subway and walk to Universal if you are planning to go and have fun. The only problem was the elevator. If I Am not wrong they have 5 elevators. We waited forever....it's so busy this hotel that the average waiting to go up and down was 20 minutes ...We ended up using the stairs most of the time....but if you are in the 10 floor or up..I am not sure if you want to do that... The concierge was always busy too. It was only one person to ask for directions or suggestions....it is suuuuper crowded...", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kailua-Kona, Hawaii", "Title": "“Loved it here and will return again”", "Author": "shawniegirl2", "ReviewID": "UR112101308", "Content": "We stayed here for 1 night at the start of our honeymoon. Checking in was easy and everybody was friendly and helpful. Since we arrived early our room wasn't ready but the desk agent gave us a key to a lower room (no view) and said if we were okay we could have that room or else wait for our room with a view. Well since we were not there for the view we checked out the lower room and it was fine. We went back to the agent told him it was okay and so he upgraded us from that room to a low floor with the pool view which I thought was way better then the room we were supposed to have because this had a balcony. Also, since it was our honeymoon they gave us a comp breakfast coupon. The property is very nice as you would expect for a Sheraton. Location was perfect for going to Universal Studios. Short walk or you can catch their shuttle. Conciege desk was very helpful in giving us ideas for things to see along with maps on how to get there. The bell desk was helpful and valet parking guys were great and even wiped down our windows for us. I have no problems recommending this hotel to other and would gladly stay here again. If I had to find something negative to say I'd say it was finding our room the first time. To get to the lower level rooms you have to go down the hall (passing rooms) to an elevator. There is no sign on the outside saying elevator down the hall. So we walked down the hall as that was the directions given, saw rooms and figured it was the wrong way so turned around before getting to the elevator. Then after checking all areas we asked again and was told to pass the rooms to find the elevator. It wasn't bad just confusing and something to laugh about as we should have trusted the first directions.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Close to Universal”", "Author": "zev0n", "ReviewID": "UR110291874", "Content": "Stayed at Sheraton Universal for 2 nights in mid-April 2011 with my mother and young kids (aged 8 & 5). It was so close to Universal Studios! Absolutely fantastic. To get to Universal, you can cross the street & head into the parking garage to take the escalators all the way to the park entrance, or you can walk up the hill and cross the pedestrian bridge. The metro (subway) is just down the hill and across the street and it takes you right to the Chinese Theatre and Hollywood Walk of Fame. Perfect location. The beds were clean and our room was ready even though we arrived before lunch. Staff were friendly. The pool was nice but shady in the evening. I only had 3 negatives ~ (1) no fridge in the room (2) our room faced the road and freeway so it was very, very loud at night (2) the restaurant was very expensive for breakfast and nothing was open in Universal City....a staff recommended a family run restaurant which was cheap & great, but we had to walk a very long way to get there.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Ouch from the outset!!!!!”", "Author": "adrianjaneb", "ReviewID": "UR110220225", "Content": "We booked this hotel a day before travelling. My husband booked over the phone via the reservation number. We didnt receive a confirmation email to confirn our booking, I heard him spell out our surname and i heard him spell out our email address not once but TWICE............ Check in - Because we didnt receive our confirmation number via email the lady we checked in with was very rude, if you dont have your confirmation number we can not help you, OUCH!!!!! eventually she found it after alot of huffing and puffing...... We had to pay for parking which is a total b........t cost after the price they charged for the room....... The room was very spacious considering we were travelling with a family of 5 (3 young kids). I dont even know if they had a restaurant as we didnt want to spend any additional money in the hotel after the service we received for reservation/check in. I mentioned this hotel to a friend of mine who was considering staying here and they immediately reconsidered another option. The only positive was it was close to Universal studios.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Weekend Getaway”", "Author": "rabrown420", "ReviewID": "UR109842600", "Content": "The hotel was a really nice hotel! its a good location out of the city but still close enough to get downtown and the rooms themselves were very nice. There were a couple of issues we did have that were kinda a bummer to our weekend. First the Valet that was $28 a day was not the best...everytime we needed it we waited for someone to help us but during the waiting other couples would walk up and get helped right away...not so awesome! The other issue was that we were on the 20th floor and there was some sort of noise that sounded as if a pipe was being flushed out every 15 min or so...also a bit annoying. Both nights there were events taking place above our room and we never heard anything or were interupted by them but the second night one of the elevator floors was wet and i slipped and hurt my knee but i wastn going to let that damper our fun..we still had fun and it was a good weekend getaway but im not sure i would stay there again.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great Stay!”", "Author": "Tiffery1", "ReviewID": "UR109013360", "Content": "The Sheraton Universal was a great hotel to stay at! My husband and I, along with a friend of ours booked 2 rooms for 2 nights so we we would be close to Universal Studios. We booked our rooms through Priceline (after shopping different sites and even calling the hotel itself) and got the best deal. When we arrived we found that our 2 rooms were on different floors, which wasn't that big of a deal - but the wonderful woman at the check-in desk went out of her way to find us 2 rooms on the same floor, that were right across the hall from each other. We meant to go back and get her name but we never saw her again. Just about everything to do with the hotel was wonderful. -The rooms were very clean (and we got a view of the park) -The bathrooms were clean and the water pressure was great! - There was a coffee pot in the room with STARBUCKS coffee and Tazo tea! a HUGE deal to me. -The entire staff was great! The valet people in the front were so nice! They joked around with us when we were coming in and leaving and helped us with walking directions (and we didn't valet, we just parked in the garage, but they were nice and helpful anyway and always smiling). - The people who worked the desk were friendly and helpful - Room service was speedy and our order was right. :) - The hotel is right across the street from Universal Studios and down the block from the subway station (which we walked to so we could catch the train to downtown and go shopping, see the walk of fame etc. etc and the Hollywood sign is visible from the Mall if you go to the top floor). -Housekeeping was great (we left them $5 a day - you should always tip everyday because you might get a different housekeeper at the end of your stay so if you tip only when you check out, you may have stiffed the person that cleaned your room most of your stay!) -There is a bar in the lobby which was great after a day walking around and also a convenience store in case you forgot anything -There is an outdoor pool, which we didn't use, but it looked nice clean (our friend had a view of the pool and the hills) -The overall hotel was clean and well maintained. We would definitely stay here again. Not only are you close to Universal and the Subway, but you are a short drive or cab ride to lots of other attractions. The ONLY bad thing we encountered in the hotel, and this only applies to my husband and I, not our friend, who had no issues whatsoever.... was that in the middle of the night our air-conditioner stopped working! The fan was going but warm air was blowing out... we both woke up very hot and the room was very very stuffy. It was the last day of our stay and it was the middle of the night - it wan't that big of a deal (although it was a little hard to sleep) so we didn't bother calling the front desk. The room was back to normal when we woke up and then we were checking out anyway. No biggie. I'm sure if we would have called someone, it would have been fixed in no time. But that's it... just one little tiny issue that did not ruin my vacation. :) We had a great time and we will be back! Oh and for those out there that complain about having to pay to park - good luck finding a decent hotel in California where you don't have to pay. We didn't mind having to pay to park - your car is in a nice garage, guard gated and it's right next to the hotel - no problems getting in or out, and once you pay, you can come and go all day long if you want.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Liverpool", "Title": "“Very helpful staff, good location”", "Author": "Liverpool0879", "ReviewID": "UR107452591", "Content": "This hotel was great for access to universal studios and all the highways. Was also only a 5 min downhill walk to the subway so that you can access all the sights of LA. The staff were very helpful and helped us to book lots of trips and visits and were always quick with advice and tips so that we had a brilliant 6 day stay in LA and feel we saw everything there was to see", "Date": "May 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Rooms smoke free, hotel, definately not”", "Author": "willowMelbourne", "ReviewID": "UR107421714", "Content": "One of my daughters is Asthmatic, and i would never return to this hotel, with her. Though the rooms are meant to be smoke free, they smell of smoke, admitedly not as much as the corridor or entrance area, so if a smoke free environment is necessary this is not the hotel for you. Its close proximety to Universal Studios was our reason for booking, unfortunately it did not live up to our expectations, as the sheets were torn or stained and the water did hot flow down the plug hole but built up in the bath. The restaurant is worth mentioning, food was great, the staff were attentive and listened to our needs. I do recommend eating here rather then at Universal. I also appreciated the Bell staff, their sunny but professional approach, and care they took with our baggage, was exemplery.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“nice hotel, great location, clean, touristy”", "Author": "MissMockingbird", "ReviewID": "UR106564392", "Content": "This was probably our 5th stay at this hotel, over a 8 year period. In the past few years they've re-branded this hotel as \"the hotel of the stars\" or something stupid like that and it has become much more touristy. That's ok. The location is excellent, easy access from the freeways and if you're into the tourist stuff Universal City Walk is within walking distance. We go to LA to visit family. So, I'd just as soon not be in the tourist mess but really it's worth it for this hotel. It's clean. It's nice. There is pretty much always someone on staff at the front desk. You can get a great deal on this hotel on Hotwire if you know how to recognize it in their system. That's what we do. It's listed as 4-star but I would call it a very solid 3.5 star, not a 4 star. Without the Hotwire rate I think it's still a great place to stay but I probably wouldn't stay there paying full price. I did once and it was over $1000 for 5 days. Maybe that's ok with you, and if so, you're going to really like this hotel. They have food, a bar, and a gift shop. I only have 3 complaints and they're fairly minor: 1) They use a flat sheet in place of a fitted sheet. For me, a person who rolls around a lot while sleeping, that meant that every night I ended up sleeping on a bare mattress since the flat sheets just wont stay on the bed if you move much. 2) They charge $18/day for parking. I think that's a lot considering that pretty much every person who visits LA gets a car. But, there's no place else to park. So, we pay it. 3) They can have long lines at check-in and just one guy working that desk. We unfortunately arrived just after their airport shuttle and had to wait about 1/2 hour to check in as all the folks from the shuttle were ahead of us. I think the hotel should bring an extra couple of people to do check-in when their shuttle arrives. I would recommend this hotel, especially if you want to see Universal City.", "Date": "May 2, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New Jersey", "Title": "“The Elevators and Thin Walls will make you crazy”", "Author": "KGolf14", "ReviewID": "UR104425696", "Content": "Just spent nine nights at the Sheraton Universal. Part of my trip was planned , part was due to a family emergency. The front desk , valet and bar lounge staff was very helpful and attentive but the rest of my hotel experience was very disappointing. Several days I waited over 20 minutes for the elevator. My first night the voices, noises and smoke from the room next store made it impossible to sleep. Most nights I heard all the conversations going on in the room next store. I am a Starwood Elite Vacation Owner and an avid Starwood user. This will be my last stay at this Hotel. I would rather stay at the Westin at Lax or a hotel near Burbank.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "1"}, "AuthorLocation": "Ottawa, Canada", "Title": "“mixed experience”", "Author": "travelling1935", "ReviewID": "UR103641082", "Content": "I have stayed occasionally at the Sheraton Universal over the years, and I have to say that in spite of recent substantial renovations, the hotel is feeling a bit tired. On my last two-night visit, I was on a high floor with spectacular views, and had a comfortable night's sleep on a most comfortable bed. The check-in was pleasant and attentive. Questions were answered knowledgably and courteously. The lobby was as attractive as I always remembered it, but with no real sitting area unless you went into the bar section. The decor in soft beige tints was pleasant both upstairs and down. Self-parking was good value at $18 per 24 hours, as was the internet. Yet, there was also a motor hotel feel feel which was new and unwelcome. The room maintenance was bizarre in my case. It was no more than perfunctory, if that. After my first night I returned to the room after several hours away and found that the bed covers had simply been pulled up â€” and not much more. Dust balls on the carpet evident when I checked in were still there 24 hours later. In the bathroom, I had left one towel in the tub because it needed replacing. When I returned it was now on the bathroom floor, along with the bath mat which I had carefully folded and draped over the tub in the morning. There was soap scum in the wash basin. Also. I suspect that easy access to restaurants up the hill on City Walk has had a negative effect on food services at the Sheraton Universal. Again, the staff in the sole remaining restaurant was pleasant and attentive, although not especially professional. But it was essentially a coffee-shop menu and coffee-shop quality food. However, the tortilla soup can be recommended. For breakfast, unless you want a traditional repast, the coffee and Danish bar in the bar area is your best bet.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Still as BAD”", "Author": "Mike D", "ReviewID": "UR101684372", "Content": "This hotel was not good the last time we stayed, some 4 years ago. Well it is now even worse. Plumbing not working, both sink and toilet not flowing away. It took 11 hours for the engineer to attend to these small matters. Very noisy maids trolleys going along at 5.30am, and maid service that would do justice to the average prison. Yes the beds are very comfortable but with all the noise what is the point. Next trip it will be up the hill to the Hilton.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Limassol", "Title": "“Amazing views”", "Author": "chrisoula1962", "ReviewID": "UR100844191", "Content": "Fantastic location, great staff....................most comfortable bed everrrrrrrrrrrrrrrrrrrr 5 minute walk to Universal studios, 10 minute walk to metro and then the world is your oyster...............highly recommended and value for money", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Great place - old hotel, but in nice shape”", "Author": "NewYorkTravelCoord", "ReviewID": "UR100423159", "Content": "I stayed here for 10 days last month and enjoyed it- The hotel seemed to be well maintained, and the staff was very professional and helpful. The Concierge was able to make dinner recommendation for restaurants NOT on the City Walk, and the bellmen were always ready to help any way they could. Two people made my stay extra special; the housekeeper on my floor who lit up each morning I passed her and wanted to know how I was doing, and the Club Room attendant at breakfast, who wanted to make sure I had everything I could possible want for breakfast. On my last day, the Club Room attendant said she was going to miss me, and hoped I would be back soon. I hope so! The bar also makes a great mojito! The other selections are very good as well. The only down sides were: The hotel restaurant. The menu looks like it came from the \"My First Restaurant\" kit: Salmon, steak, chicken, Caesar salad... The food tasted very basic as well. And the parking- about 20 bucks a day!", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Still a great hotel for Universal Studios trip”", "Author": "Norgetroll", "ReviewID": "UR100174976", "Content": "Lat stayed here two years ago. Hotel is still IMO the best play when visiting Universal Studios. The park is in walking distance and the hotel shuttle runs daily from 9am to 8pm. We never waited for more than 5 minutes . Hotel staff are very friendly. Plenty of bell men to get your bags. No line at check in, arrived at 8pm. We ate in the bar area, which is generally quiet. food was tasty and service friendly. We were in room on 10 floor. View of pool and hills. 2 queens with a sitting area. Perfect size for family of 4. Decor was nice and room very clean. Had Club privaliges. This is the only area we noticed any changes.Breakfast was fine but not as good as last time. The small single juice bottles in several varities were gone. Instead just a large Orange juice pitcher. No more single serve cereals and strawberries were only put out once. Evening service like wise was scaled back. Some veggies, dip, and chicken wings. Pool area is nice, with plenty of chairs and towels. The pool though is not heated, which made it impossible to swim in. Internet is still not free. $.9.99 a day. And self park is $18 a day. Still a nice hotel and we will stay here again.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Newly renovated except corners”", "Author": "SKW66", "ReviewID": "UR97677932", "Content": "Stayed in their cheapest King bed room for around $100 booked through Hotwire. Pros: - Received really nice service from the bell boy (man, actually) who showed genuine friendliness that made us feel that he really wanted us to have a pleasant stay from his heart. When he found that we were staying for 10 days, he offered to bring us a mini-fridge just in case. It's complementary anyway, but his service was really superb. Too bad I am not good at remembering names that I could have given him credits here. - 70% of the hotel had been renovated. E.g. wall papers, bedside cabinets, etc. - Couldn't request for a King bed room before arrival and hence we could only use a room in the same floor of the front desk. But since the hotel's big and the room was located furthest from the front desk, we did not find this much of a concern at all. - Computers in the business center were all new models (new at least to a computer idiot like me) with speedy internet. Before we arrived, we read the earlier review saying that the computers in the business center were not working properly. But during the 10 days of our stay, we did not see any of this happened and made good use of them. So it was still fine without free in-room wi-fi. - They offered $5 voucher each day we declined housekeeping service. Hence we'd collected vouchers worth a total of $30. We used them all at one go and enjoyed a breakfast in the hotel on the last day. (Though don't expect too much on the food...) Cons: - The only 2 mirrors in the room were located inconveniently. The biggest one was in the bathroom but there was no way I could lean closer to look at my face clearly as the bathroom was really small. Another mirror was located inside the closet. Since we have 4 big luggages, one of them was put inside the side right in front of the mirror ('cause no where else in the room could we have put it instead). And with the dim lighting next to the closet, it was still hard for me to try to put some make-up on. And we had been wondering why the mirror was not placed behind the working desk where there was a really big empty wall. - While every thing seemed to be pretty new, spider's web was found in the ceiling corner in the bedroom. Mold was also found at the ceiling corner at the bath tub. And the door lock was obviously not replaced after renovation and looked quite dirty and old. - Is it how the blankets are arranged in hotels now? We have a thick bed cover over a down blanket over a thin bed sheet. All these 3 items are just loosely covering in layers without any thing holding them together. Every morning the 3 blankets went different paths and it was really not comfortable to find yourself directly covered by the down blanket when you woke up in the morning. - With a flat screen TV already in place, the hotel at a level like Sheraton should really consider incorporating the HD features. - Traveling to Universal Studio/ City Walk from the hotel was not meant to be done by walk. Either you catch the shuttle or drive there yourself. We wanted to watch a movie past 8pm at one night but the shuttle was already off. We had to pay $10 for parking in the City Walk while we were supposed to be staying in the hotel at Universal Studio.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Menlo Park, California", "Title": "“Sheraton strives to deliver the best service - And it does!”", "Author": "chriscoolio", "ReviewID": "UR97160648", "Content": "This is the first hotel review I've ever written - the reason I'm writing this is because the Sheraton has delivered exceptional service to my family and me. I woke up early this morning because I was thinking about the daunting task of complaining to the front desk about an issue that was bothering me. When I finally plucked up the courage to go to the front desk, I was met by Max, who greeted me with a warm welcome. I told him my complaint and he surprised me by saying \"well, we will look into that because we want to make you a happy customer\". I was so surprised because although making customers happy should be the main goal of every service company, it is rare that that is the top of mind of the person helping the customer. There was no arguing with me, no disagreeing or push back - Max simply said he would take care of it. I felt comfort after this and I did not even tell him that I was actually planning to ask for a refund for the remaining 3 nights I am to stay here. Max raised my issue with the manager, solved my problem, and even threw in free wifi for my troubles- he converted me from an angry customer to a loyal one. I am very happy now and i look forward to my next three nights here in the Sheraton - Thanks Max! Other comments: -all standard rooms have no fridge. I called room services and they brought one up free of charge -rooms are renovated and clean -beds are super comfortable -$18 self parking fee for over night parking (lot is conveniently close to hotel elevator)", "Date": "February 19, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Bad experience”", "Author": "peteleedds", "ReviewID": "UR96873183", "Content": "Stayed at this hotel for 4 evenings. Front desk, bell hop were not friendly at all. Ordered room service four times but they did not get my order right 3 times. Ordered an omelette, but no salt or pepper. Called room service to complain, their response, \"you never mentioned salt and pepper.\" Ordered coffee, but only got a mug. Was told internet service was free, called before to make sure. I was then charged $9.95 ten times. I used valet parked for one day only but I was charged for 4! Was annoyed by the noise caused by the ice machine next to my door. Never got a good night's sleep. Called customer service to complain about these charges but agent kept putting me on hold. Then got transferred to accounting department but no response. No call back. DO NOT STAY HERE!!!", "Date": "February 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Central Coast, CA", "Title": "“Second Stay and Still Impressed!”", "Author": "stevelieb", "ReviewID": "UR96137135", "Content": "Being a frequent corporate business traveler, I really look for comfort and service when I am away from home and my family. This is my second recent stay at the Sheraton Universal, and I am still convinced that this is a great property. The aromatherapy scent that is common in all Starwood properties greets you when you enter the lobby. I was upgraded to a nice sized room with a king bed on the Club floor. The room was freezing cold when I checked in, but when I called the operator a hotel engineer contacted me immediately. He came upstairs and got the heater working-I just wish I remembered his name because he was very professional and made sure I was satisfied with the situation before he left. The 9th floor lounge is well appointed and offers an evening reception with beer and wine for sale, along with light appetizers as well as a free continental breakfast in the morning. After getting caught up on emails, I was not motivated to leave the hotel for dinner and ate downstairs in the restaurant. While nothing on the menu jumped out at me, the chicken with tossed parmesan asparagus was delicious. I look forward to returning on my next trip down the coast.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Plusses and Minuses”", "Author": "zephyr221", "ReviewID": "UR95966480", "Content": "This was my 2nd or 3rd visit to this property and my first since the renovation. Even as a repeat visitor, it's hard to find the entrance to this hotel. Staff check in was fast and friendly. I was upgraded to an \"Executive\" room which was basically a large junior suite. The room had nice/new Sheraton furnishings, but the new-ish flatscreen tv was way too small for the room/the way it was positioned (too far from the bed or sofa to see). The main problem with the hotel in the guest room as well as in the Terrace Room where I attended a cocktail reception was the lack of functioning A/C. I think the management is aware of this issue (as evidenced by the fan placed in the room at check in). The room wasn't terrible, but the ballroom was unbearable. People were sweating in their gowns and suits and constantly stepping out to breathe. Room service was fast and delicious. The lobby bar was a great place to catch up with an old friend. Good beers on tap, great cocktails, good service. Valet was fast. The only other problem (potentially a deal breaker if you're here on vacation) is that the elevators were woefully below the hotel's capacity. I'd wait 5-10 minutes on average. (To be fair, there were 2 events in the hotel and it was a busy Saturday night) but a trip to/from your room shouldn't take 20 minutes.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Greatest Staff and Comfortable Stay”", "Author": "jetski579", "ReviewID": "UR95231255", "Content": "My family stayed in January 2011 for 4 nights. Rooms were immaculate and large. Saved a bit and went for a single room with 2 queen beds for wife, 2 boys, and myself. Room was clean, bathroom was spotless, staff were courteous. Everything was just right in this hotel. Stayed with spg combinations.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "norcal", "Title": "“Family Trip to Universal”", "Author": "fhata", "ReviewID": "UR93432978", "Content": "Booked a AAA Travel package to the Sheraton Universal for two nights. We arrived just before noon and was able to check into a room right away. The service was great with our bellman offering a free fridge for all of our snacks/drinks that we brought. Parking for our car was included in the package, but runs around $18.00 for self parking. The room was located on the 17th floor with a nice view of the park. Although small, our accomodations seemed recently remodeled and clean. We quickly unpacked and headed to the park. By foot, you first take an elevator up to the next level (where the Hilton is) and then take a short uphill hike to the park. Total time about 15 minutes. There is a shuttle that picks up at the Sheraton but we never used it. Universal was not packed during our stay, and we easily covered everything in the two days. One evening we took the Metro to Hollywood/Highland (one stop from Universal Station) to see the Graumans Chinese Theater and the sights. On the return trip back to Universal Station there is a bit of an uphill walk to the Sheraton. It seemed safe as there were others walking. The next morning we decided to try their buffet breakfast downstairs and it was one of the best buffets we've had in a long time. Although not cheap (around $25.00/person) we enjoyed the breakfast faire. The big breakfast precluded us from eating much in the park that day until we had dinner that evening. That evening we spent at the City Walk next to the park. The recent acquisition of the Sheraton Universal by the Shenzhen group may bring some interesting changes to the Hotel. As a Starwood member we would definitely consider staying there again in the future.", "Date": "January 17, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "L.A.", "Title": "“A little frustrating”", "Author": "BuddyMalloy", "ReviewID": "UR92713789", "Content": "Was here on business for 2 nights, a few observations. The outside looks like nothing special but the inside has been redone. TMy first thought was that it looked pretty good. But... The pluses: - All staff were extremely friendly, at all times. - It is located within walking distance of Universal Studios and City Walk (but there's a shuttle anyway as some of the walk is uphill). - The hotel has an area with a number of computers for free use, including internet access. - hotel was quiet. The negatives: - The computer centre was not working 9 out of my 10 trips to it. When I finally mentioned it at the Front Desk, they were nice but completely unconcerned and it was never fixed for the rest of my stay. I saw others get up and leave the computer centre in frustration. - My 'recently renovated' CLUB floor room had stains everywhere - on the bed, on the drapes, on the literature. - room had plastic cups - no fridge or mini-bar (I really felt this was odd considering I was on the club floor) - The pay per view movies on the tv would not come up. - Could not access the \"current account balance\" - ever. - The restaurant closes before 6:30, leaving only the bar area on the main floor. The bar area is nice, the staff are great, but I thought the food was awful. - Conceirge gave me incorrect information (I was told a shuttle to the airport is $20.00...ah, I wish). - Bill was incorrect at check out and I had to get manager's assistance to straighten it out (completely their error - they were apologetic but the mistake was so unncessary). Keep in mind this hotel is not a cab ride from the airport (that's over $100.00). So you should rent a vehicle. It's too bad, with a little work and attention to detail, this could be a great place. I plan to take my family to Universal Studios soon, but I will be staying at the Hilton right next door. I didn't get a chance to visit it, but something tells me it's got to be better.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Australia", "Title": "“Dissapointing service”", "Author": "ILuv2Travel", "ReviewID": "UR92387528", "Content": "As flights from Australia arrive into LAX early in the morning, I contacted the hotel quite a while in advance and requested early check in. We booked 3 rooms and requested them all to be together. I communicated with a lovely man from the hotel before our trip and he sounded so positive and helpful. Of course upon arrival (with 4 feral children!) NONE of our rooms were ready and the receptionist didn't try to help us at all. A very dissapointing arrival. The rooms however are lovely and the beds are extremely comfortable. During our 3 days we never saw the shuttle bus to Universal Studios and this was a huge problem as I have multiple sclerosis. The walk is just too far and difficult (for anyone really!). Taxi drivers got really annoyed at us because the drive was too short. The Hilton is definately closer and an easier walk. Next time I would stay there as it is much more convenient. I wish other reviewers mentioned that! It is definately worth getting the club lounge as the continental breakfast is lovely and fresh. I would also like to mention that I left a US$250 brand new tracksuit on the bed as I left. I was silly to not check the room before I left. There were kids running around and we were running late so it's my fault. We phoned the hotel 1 hour later and were put through to lost property. They found nothing. We phoned again the next day and spoke to reception and lost property again - once again, nothing. Very sad that someone would find it and keep it.", "Date": "January 10, 2011"}], "HotelInfo": {"Name": "Sheraton Universal Hotel", "HotelURL": "/ShowUserReviews-g32655-d84422-Reviews-Sheraton_Universal_Hotel-Los_Angeles_California.html", "Price": "$218 - $334*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">333 Universal Hollywood Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91608</span></span> </span></span></address>", "HotelID": "84422", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8b/10/8b10553abab20688dd969369ee19fd248large.jpg"}}