{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Where was Everything?”", "Author": "Mary N", "ReviewID": "UR124583614", "Content": "I'm not usually one to leave bad reviews but there was just too many little things that bothered me about the hotel. It is now apparently the Chatsworth Hotel but I had originally booked it as a Radisson. For a moment, we thought were were in the wrong place since the sign out front had changed but nothing else. We needed a place close to some family, which is why we chose this hotel. The distance from where we needed to be was good but that seemed to be the only thing. When we walked through the hotel to the 3rd floor, we could definitely see that the hotel was in desperate need of some maintenance. The rugs were worn, there were questionable stains in the hallways, the sleep number bed remote wasn't working, etc. The hotel said they had room service but there was no menu in the room, nor was there any information in a book as most hotel rooms provide. There was pounding throughout the night, almost as if people were running up and down the halls or even up and down the walls themselves. We had to call down for extra sheets for the sofa bed, which was fine and they opened up the sofa bed for me. The set-up of the room wasn't that great as the sofa bed was directly in front of the air conditioning unit which made for me being freezing and my sister not getting enough air. I also have bad allergies to dust mites and kept coughing and sneezing the entire time I was in the room. The moment I stepped out, I was fine, which made me wonder how clean the place really was. I had booked the hotel for my sister and myself over the phone and asked for all price quotes and charges that were part of the bill so I could make a decision about this hotel and another nearby. I was given the quote of $81 a night with AAA for the weekend plus hotel tax. Okay, that's normal. Imagine my surprise when my credit card was charged $150 more than what my final bill was as I was checking out of the hotel. When I called, I was told that the hotel charged $50/night for incidentals and that it was on the website. Yes, but I didn't book through the website. He said I was GIVEN a form that outlined this when I called. I was passed along a sheet of paper that had my dates of check-in and check-out, and requested my sister's information (as she would be holding the 2nd key), the make of our rental car, and the license plate number. The man on the phone was not helpful and told me that so long as the room was in the same condition as it was before we arrived, the money would be returned in \"maybe 3-4 days, maybe longer.\" While the hotel was near where we needed to be, I would have much preferred to stay at a hotel slightly farther away for a cleaner space, a room with the desired information, and better service. While Jose was helpful the one night, it seemed no one else cared whether or not the guests were comfortable or were given basic information.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Chico, California", "Title": "“bed bugs! and didn't clean the room”", "Author": "meganmh2002", "ReviewID": "UR119377879", "Content": "The first morning we stayed (10/8/11) I work up with a few itchy bites. That night we came back around 9pm to sleep, the room/bathroom hadn't been cleaned. Not even fresh cups. There was loud club music below us from a party at the restaurant in the hotel. We were never informed or warned. The neighbors were yelling, partying and going in and out of the room, slamming the door every couple minutes. We tried to ignore all of this until the marijuana smoke started to fill our room. I finally called down to the front at midnight and they dismissed me and said they'd give them a quick call. This all continued until around 2:30am. The whole night I kept waking up itching. We got up around 7:30am to leave and I was covered in itchy bed bug bites. We went to the front desk to check out and explained out issues. They informed us the manager wasn't there but would get in in 30 minutes (9am) and call us immediately, and they wouldn't charge us until he talked to us. At 2:13pm we checked our card and noticed we had be charged the full amount with still no call from the manager. I called the hotel and they informed us the manager was busy and would try to get back to me by Monday. When I said this was unacceptable, they sent me to voicemail. He finally called me back around 5pm and refused to refund our money and told me it was impossible to have bed bug bites. I've had to see a doctor and dermatologist to help with the 50+ bug bites that keep me up all hours. And still no apology, just left with gross bumps everywhere.", "Date": "October 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Was a Radisson, now the Chatsworth Hotel.”", "Author": "Baronent", "ReviewID": "UR116534178", "Content": "We upgraded to a \"suite\" for an extra 35 bucks! Can't beat that! Overall, we liked this place. The \"suite\" was HUGE, although the layout was sort of strange. The room must have been 2 regular rooms before they knocked down a wall to create large, single room. The lighting was \"different\". On the ceiling, they had what looked like classroom lights throughout. With the room being so large, the tv was SUPER difficult to see from the bed. The beds were SO far away! But the couches were nice! As this was the only room we stayed in, I have no idea how the other rooms looked. Free wifi worked great. Staff was very nice. Everything was clean. VERY easy to pull your car up to the front, grab a cart, and take your bags to the room. Although, they need to change the room number directional signs. VERY confusing. There are no arrows pointing you left or right, just a series of squiggly lines. I went left when I should have gone right. Sound strange? It is. Also, pretty annoying when people sit right in front of the lobby and smoke. ATTENTION SMOKERS: Smoke is not only bad for you, it STINKS. I do not care if you want to smoke 200 cigs. a day, just don't do it right in front of hotel lobby's or small children. Show some respect. Of course, this is not something that is only a problem at this hotel. Maybe they can have a NO SMOKING sign by the lobby entrance so people with small children can walk into the hotel, and out, without sucking in all that nasty smoke. One thing I noticed... The place seemed pretty empty. I actually LIKE that. But I sort of felt bad for the place as they really were not busy. We bought some wine nearby and my wife went to the front desk to ask for an opener. Here is what makes me really like this place. The front desk woman, walked over to the bar and opened our bottle of wine for us. She told my wife, \"you can not drink wine out of the plastic cups in the room!\" and handed my wife two wine glasses from behind the bar. She did NOT have to do that, and that one little gesture shows me that people at this hotel actually CARE about the guests. Was it a one time occurrence? Doubt it. Oh, there is PLENTY of free parking too. In the morning, they have coffee and some breakfast bars by the lobby doors and those smokers. Whoever made the coffee that morning? YUCK! I mean, it was SO bad. SO bitter. We did not stay at this place for the coffee. so no biggie.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "libraryladyfo", "Title": "“This is no longer a Radisson property, it is Chatsworth Hotel.”", "Author": "libraryladyfo", "ReviewID": "UR116117883", "Content": "Same framework of the previous Radisson, sleep number beds, Hot Tomato Restaurant, same amenities...but I can feel the level of maintenance slipping. We have always stayed at this hotel when visiting our daughter at CSUN, it is the only nice place at a reasonable distance from her apartment. We will stay once more to give it a fair shot, at that point we will reevaluate.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Columbia, South Carolina", "Title": "“A good hotel with very friendly staff”", "Author": "stingman66", "ReviewID": "UR115307023", "Content": "I stay here very frequently on business and have always been treated extremely well. Whether I walk to the front desk or into the bar or restaurant, I am always greeted with a smile and hello. Susan who works in the bar/restaurant is always looking out for me. She makes sure my meals are prepared just to my liking. The fresh fish dinners are as good as you can get in this area. The steak filets are also very good. Gustavo (chef) comes out of the kitchen and asks how your meal was. How many places will do this? Krystianna who works at the front desk is always warm and friendly. She makes me feel right at home. Some of the furnishing in the rooms like the TV's are not the most modern, but the rooms are quite comfortable. They are also kept very clean by the housekeeping staff. You can also get a fridge and microwave upon request.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Gone downhill, and where is my coffee?”", "Author": "mkovnick", "ReviewID": "UR95572697", "Content": "I have stayed once or twice a year for a few years while out in LA, and it was always fairly nice. However, it is not being well-maintained. The wear is really showing. OK, not a big deal. It is a good location for those needing to stay in the west valley. But it is the little things that tick you off and sometimes make you say \"OK, I'm done... Next time I'll be somewhere else\". It wasn't the rooms. Yeah, they are worn a bot, but it wasn't a big deal. For me, it is the coffee situation. Trivial, maybe, but here it is... Nowadays hotels in this class like the Hampton Inn, Comfort Inn, etc. all have a simple buffet included in the price. I'm not a breakfast fan, but I want my coffee. Those little in-room pots make dirty water, and I want a decent cup. The thing is, that until 6AM, they do have free coffee in the Lobby. That is fantastic, but when their restaurant opens for breakfast, it vanishes. So I went downstairs for coffee, and it was gone. I was told no problem, I could go get it in the restaurant. But I learned that it was going to cost me $10. I didn't want breakfast... just a refill of my coffee. No matter, $10. When I balked at this (nicely), the many at the desk pointed me to a Starbucks down the street. REALLY? So first off, the coffee situation just isn't in sync with the standard of service of a hotel in this category, but the service... That was just a new low, especially on something as trvial as a cup of coffee that was free 20 minutes earlier.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Maple Grove, Minnesota", "Title": "“If you like mold, you'll LOVE This Radisson - bring your inhaler!”", "Author": "neeho", "ReviewID": "UR73312984", "Content": "A combination of mold festering on the AC vents, along with lousy guest services, will make your stay at the Radisson an adventure in respiratory issues and personal frustration. After my first night, I realized the AC vent in the room was covered with black mold. Lovely. So I kindly informed the front desk of the issue. They offered to move me to another room, which I accepted (I would have been fine if they simply offered to replace the replace the vent). I packed my stuff and moved to the new room, only to find the AC vent had EVEN MORE mold than the previous room! I had to leave, so I took my luggage to the car and threatened to find another hotel if they didn't resolve the issue when I came back. When I came back, they moved me to a mini-suite with a balcony view. No mold on the AC vent, but plenty of stains in other places that give one pause. There aren't enough Sleep Number beds in the world to make up for a lack of cleanliness and no attention to detail. I'm not asking for the Ritz-Carlton, I just want a clean room. Hey, if a Best Western can do it, why can't a Radisson! This hotel used to be great value for the price, but now it's simply a dump. Avoid this hotel until it changes management.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Diego", "Title": "“Find another hotel”", "Author": "Hidden619", "ReviewID": "UR71800514", "Content": "This hotel is horrible! 3 Stars? No way! I wouldn't ever stay at this place again. My brother-in-law stayed at the Hilton (also 3 stars) for $7 more using their AAA rate. If I only would have known!!! The hotel was dirty, it had a strange odor, the \"remodeling\" is very outdated, dirty shower shower.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Auburn Hills, Michigan", "Title": "“N”", "Author": "Fishoutofwater66", "ReviewID": "UR68729614", "Content": "I have stayed at this hotel a number of times. While i would not consider it to be a top tier hotel, it is not bad for the money. There are other hotels that are close by that cost almost twice as much. Parking and Internet service is free. The staff is generally friendly. The hotel has consistently met my expectations. However, my expectations were not that high going in.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Stockton, California", "Title": "“Not worth the money”", "Author": "kriscori", "ReviewID": "UR62960022", "Content": "I'm so ashamed that I spent over $100 on this place. The exterior is nice but the interior is another story. I agree with other posters on here that claimed that the hotel smelled because of the restaurant. If I'm paying that much money I don't want to smell foul odors in my room. I usually stay at the Ramada in Chatsworth but decided to switch it up for a change. Bad decision! I will stick with the Ramada from now on, it's a way better bargain. We also had problems with the wireless interenet, which was exceptionally slow. If you need access to your email and other things online I would not rely on their wi-fi working all the time.", "Date": "May 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Northern California", "Title": "“3 Stars???!!!!???”", "Author": "TitaNui", "ReviewID": "UR62262258", "Content": "We visited family in Chatsworth and wanted to have our own place to get away, so we chose to stay 4 nights at the Radisson. Oh, my! We're fairly seasoned travelers, but were suprised (unhappily) with what we found. The grounds, entrance, parking lot, and lobby were all inviting. Check-in in late afternoon was quick, cordial, and helpful. Great start! I opened the window in our room as soon as we entered. I was met with foul smells from the hotel restaurant's rooftop A/C and ventilation units which were a mere 30 ft. away from our window. I called the front desk to ask for a room change. They quickly offered two options. Our second room was even more disappointing. Apparently, the remodel hadn't yet occurred in this wing. Avoid room 235! You have to go up the elevator, then down 4 stairs and down another hallway of apparently rarely-used rooms. There were towels rolled up and pushed against a room's door in that hallway. Doorways were often propped open for ventilation (?) while they worked on the rooms, or something. You could see bed mattresses propped up in the windows of some of the rooms in that wing from the street. Our new room was a much smaller room with dated and leaking bathtub plumbing. The window valance was water-stained from an apparent earlier water leak or rain problem. Large stains on the valance, curtains held in place at the seams with Velcro, carpet which needed shampooing, and the signature Sleep-Number beds which made horrible noises when being adjusted. The bathroom fan was sooooo LOUD that it sounded as if a helicopter was trying to land - and it didn't even remove air from the bathroom! So we had to keep the bathroom door open, which was no small feat since the door needed to be propped open with a heavy bag. Three stars it isn't!! It may not even make 1 star! Too tired to move rooms again, we decided to address the problems in the morning. When I spoke to the morning front desk person on duty, he quickly dismissed the items I began to list with lines such as, \"That's the way most hotel bathroom doors work.\" When I informed him that I was going to be there three more days, he begrudgingly told me to return to the front desk later that afternoon to see if anything opened up. No apologies, no attempt to assist, just putting me off until his shift was over (I guess). I didn't bother going back to request another room. We wanted to spend as much time with family as possible and refused to be held hostage by a bad room and bad front desk employee. The hotel has a 100% guarantee policy that they will fix any problems or your night's stay is free. I wasn't even going to try for that one! Complimentary full breakfast buffet was adequate and pleasant mostly due to an exceptional, professional and friendly wait staff. They remembered the beverage request from the first morning and asked every following morning if we wanted the same beverages. Though taxes and gratuities were included in the buffet, it was easy to leave additional gratuities for such great service. Housekeeping did a yeoman's job, given what they had to work with. They cleaned the room as much as possible --- it's not their fault that the carpet was not shampooed, or the plumbing leaked, or water-stains were obnoxious! The beds were made, vacuuming done, garbage removed, and linens exchanged. Housekeeping cleaned and straightened what they could, and did a great job. Gratuity left for their efforts every day. Check-out was another adventure with Mr. Frontdesk. I had two VISA gift cards which check-in staff had assured me could be used to pay for my stay upon check-out. I explained that to Mr. Frontdesk who immediately began to tell me all of the things that could go wrong if I paid for my stay using the gift cards. Surprise! Nothing went wrong!!! I wasn't asked how my stay was or any other common pleasantries upon check-out. Too bad the many excellent staff at this hotel are overshadowed by an unhelpful front desk person and a really bad room - both of which could have been \"fixed\". Being considered the \"best\" place to stay in Chatsworth (which doesn't have too many options) isn't a reason for anyone to be rude or indifferent to customers! The Radisson sent an email survey to which I responded. I received a generic \"We're sorry you were not pleased with your stay\" email response sent by the \"Front Desk Manager\" ---- who may be the famous Mr. Front Desk?! Radisson Hotels are now crossed off our list of options.", "Date": "April 23, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Great way to see LA”", "Author": "RobinP3", "ReviewID": "UR55647962", "Content": "I loved this place, it was great for a fly-drive holiday. The hotel was well presented and best of all really good value for money. We went in January so we doid not use the out door pool but we did use the gym. The hotel was very safe also as there was a police station just across the street. Just off the main road we thought that the room might be noisy but this was not the case. The breakfast was also very nice. All in all a great, relaxing stay and a perfect base to see LA i.e. Universal Studios, Hollywood e.t.c.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "chicago", "Title": "“The hotel is nice and clean most of the staff is very nice but some people at the front desk suck.”", "Author": "jesseiker", "ReviewID": "UR47336719", "Content": "The place was very nice very clean the room was super comfy and cozy. I can honestly say if you avoid some people at the front desk your experience would be 5 stars. Most of the staff is very polite except for one man at the front desk always rude. When I arrived one of the keys i was given did not work I realize that later on that day when i tried to use it. I went downstairs to ask for another key. I was not angry i was pretty happy with the room I was looking toward everything we had planned, so i was in a good mood. he started accusing me that because i had my key next to my phone it got demagnetized. I explained i did not that i had both keys in the envelop he gave me and that one worked the other did not. He continued to pretty much scold me like i was a kid. I'm trying to not lose it so i put my phone down it happen to be right next to the key and then he goes you see you put it next to your phone just like that and that is why it doesn't work. so now I'm confused does he want me to pay for another key?? if so say so charge me don't yell at me. I asked him do i have to pay for another one if not then can i have the key? he finally gave me the key. I had to encounter him a few other times and the same treatment i tried avoiding the front desk when he was there. If you do go just avoid him and it will be a pleasant stay.", "Date": "October 20, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "libraryladyfo", "Title": "“Convenient and the breakfast buffet is awesome!”", "Author": "libraryladyfo", "ReviewID": "UR46201937", "Content": "We have one child at CSU Long Beach and one at CSU Northridge. We stay here each time we visit. It's close enough to CSU Northridge and the rates are great for the area. We love the breakfast buffet at the Hot Tomato.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, England", "Title": "“Fine, no problems”", "Author": "Paul113", "ReviewID": "UR37809238", "Content": "Standard hotel with decent pool and midway betweem 6 Flags and Universal Studios theme parks. Nothing to upset any traveller, plenty of food options including a nice Thai restaurant, just outside hotel.", "Date": "August 16, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lakewood, Colorado", "Title": "“What's the problem? This is a great place”", "Author": "Leenda324", "ReviewID": "UR37627007", "Content": "All those nay sayers out there bad mouthing this Radisson need to stay at another so-called three-star and eat their words. This is a very nice place. It's comfortable, it's clean, it's safe, it has a decent work-out facility and an OK in-house restaurant. Best of all are the staff. I had the misfortune of having a flat tire on my rental care the first morning there. Staff came to the rescue, shuttling me to my morning appointment for no charge and being just generally very, very nice and polite. The rooms are quite large. The bathroom has both a steam shower and a separate tub, with a large granite vanity area. There's a fridge and microwave plus coffee maker. Especially nice is the desk and desk chair plus free wi-fi, a real plus for the biz traveler like me. My room had an outside balcony, with a lovely view of the Santa Susannah mountain range and the interior courtyard which boasts a fountain and lovely landscaping. What's not to love if you're gonna stay in the Valley? For heaven's sake, my boss -- a very picky business traveler -- likes this place!", "Date": "August 14, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "3.0", "Rooms": "4", "Value": "4", "Location": "3"}, "AuthorLocation": "Cathey's Valley, California", "Title": "“Overall a very nice hotel, but several problems”", "Author": "ynp-CV", "ReviewID": "UR25889837", "Content": "Very nice lobby and parking lot and the staff really knows the area well. Room appeared fairly new and clean, sleep-number bed was great. TV had about 30 channels including HBO. Incredible array of products in the bathroom. If you're a light sleeper, the morning rush hour starts about 5 AM and is very noisy. Free buffet breakfast in the attached restaurant was super! Sausage, bacon and REAL scrambled eggs, not the powdered ones most hotels offer. OK, good is good, but when I read reviews I like to know the bad, so here goes: The small bathroom was terrible, other than all the bottles of stuff. I know bathroom noise is common at most hotels, but while in bed here, you could hear every bathroom above, below, near, or in the same county! I've never heard so much bathroom noise before anywhere ever. Then comes the stand-up clear glass shower stall attached to the sink. Very small to maneuver in, touchy temp control, and not very private with clear glass. Room cleanliness--while the room \"appeared\" clean, why did my white socks get black on the bottom after walking around the room for only a few hours? When you see that, it makes you really wonder just how clean this room is. The outside of the windows were very spotty and dirty, so maybe the room just \"appeared\" to be clean. Would I stay here again--\"maybe\", but I'd never take my shoes off :-)", "Date": "March 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scituate, MA", "Title": "“Great STAY!”", "Author": "Scituateboy", "ReviewID": "UR20984363", "Content": "Stayed here for one night for a special event at a nearby country club. This is a wonderful place to stay! The rooms are well maintained spacious and quiet. The big plus at this hotel, however, is the staff gracious and attentive. Especially the waitstaff at the buffet breakfast. Whomever is running this place really knows how to train their staff.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "fairfield, CA", "Title": "“Frequent Traveler”", "Author": "knewitall", "ReviewID": "UR15813196", "Content": "I have stayed here numerous times, and my experience has been, for the most part, favorable. However, my most recent stay was a bit surprising. The fire alarm went off three times during the night (the last time at 4:30 am). Needless to say, this will get you out of bed in a hurry and wondering what is going on. The front desk manager's explanation? \"It's a 17 year old system, and it goes off sometimes. At least we know the fire dept. responds\". That was it....no \"sorry for the inconvenience\", nothing. After spending countless thousands of dollars at this hotel for myself and my co-workers, at minimum, an apologie for a sleepless night would have been nice. Am I a picky guest? Probably, but most business travelers expect a bit more. When I told the front desk that the phone on the desk in the room did not work as the cord was frayed with bare wires, they responded \"There's another phone by the bed\". Unfortunately, I was doing my work on the desk and not on the bed.When I called room service in the eveing to order a simple sandwich, I was told \"It's dinner time and that's not on the menu. You have to order off the dinner menu\". I did...unfortunately. Lousy overpriced food. Enough said. Will be going to the Staybridge Suites down the street for my trip in June.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Coon Rapids, Minnesota", "Title": "“Hate sleep number beds”", "Author": "trevorr77", "ReviewID": "UR13070831", "Content": "I stay at this Radisson hotel at least 8 times a year when traveling for work. I think its a pretty nice hotel with a variety of different room styles and a staff that is very friendly. My biggest problem with the hotel is the same problem I have with ALL Radisson's...Sleep Number beds. I hate them and they are in almost all the rooms at this hotel. If you like this kind of bed, well the this hotel will be great for you. In a city with very limited hotel options, the Radisson is still the creme de la creme, with a nice restaurant, a pool, spa, and workout room, quiet rooms, and a great staff. Internet is also included in the rooms along with a free breakfast buffet...all in all its a nice deal if you need to stay in the Chatworth area.", "Date": "January 28, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "sdaztec007", "Title": "“Heck Yeah!”", "Author": "sdaztec007", "ReviewID": "UR10088844", "Content": "I just stayed at this hotel and it was wonderful. It is located in a quiet neighborhood, except for some traffic, although that is expected. The staff was friendly and helpful. The room was completely awesome for the price and also awesome for a hotel in the Los Angeles area. The SleepNumber bed wasn't as great as I was expecting but was far better than any other bed I have slept in at any other hotel in my life. I did not eat at the \"Hot Tomato\" restaurant next to the lobby although the concierge offered my father a free breakfast the next morning as it was his birthday. We did not take the breakfast although it was nice to have the offer. I was dreading a stay in a sub-par hotel elsewhere in the city and the reviews I saw for this hotel were right on as the room was perfect. It is nice to still be able to stay in a nice hotel, with a decent price, and feel good that you made your trip as great as possible by picking the right hotel and not the wrong one.", "Date": "October 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Danville, California", "Title": "“Moises Made Us Feel At Home”", "Author": "JetBlue2", "ReviewID": "UR10064819", "Content": "My daughter's family lives in Granada Hills. Now that she has four children ages 1 to 7, there is no longer room at that inn so we have had to resort to different hotels in the area. This was our first time at the Radisson. I checked it out on Travel Advisor where it received good reviews. I was not disappointed as it lived up to my expectations. The check-in and check-out was a breeze. The room was quiet and the beds superb. Our very reasonable room charge included a full and very ample buffet breakfast. Moises who managed the breakfast was very attentive and made us feel at home. We left him a very special tip for his excellent service. Tell him that the group who attended the Notre Dame-UCLA game (Notre Dame won) said hi. This will now be our home away from home when we visit my daughter.", "Date": "October 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Dallas", "Title": "“A little older, a little cheaper , a little less than more expensive places”", "Author": "Robsteray", "ReviewID": "UR10009516", "Content": "The staff is very nice, and helpful The facility is in need of renovation however. It's not crumbling down, but it has a just held togther feel to it. The walls in the rooms are tweety bird yellow. (I tawt I taw a puddy Tat) The rooms are a nice size and the rate you pay for them is fair. Other hotels up Topanga are a considerably pricier. So if you don't mind a few dings, it's a deal for the area. The bathrooms need some major touch ups. The tiles in the showers have major cracks in the motar giving it a not so pleasant appearance, and the showers have ancient showerheads caked with mineral deposits that impeed the water flow. For business, the wireless internet is everywhere and is great for checking email, but in terms of say downloading the speed is really subpar. Tried on several occasions to download news video and basically gave up. If you like sleep number beds they have them. They're clean and comfortable. Housekeeping does a pretty good daily job. They do offer a basic breakfast with eggs, waffles, french toast, and assorted breakfast meats. It's not bad, but sometimes it seems a bit cold, I had to check to see if the sterno ran out under the meats. Not appealing, but again it was built in the price of the room, so no real expectations there. The workout room, like most hotels is a couple of treadmills a bike, and an all inclusive machine in what looks like a converted guestroom. There are several gyms in the area though that have daily rates for visitors. The business center is actually roomy and easy to work in. There is a MAC in there that you can access for a fee, but your laptop will work fine in there. Overall, the place is just a bit older, so you pay a bit less for a hotel that may not be as upscale as something new, but it's a clean bed, free breakfast and internet. If you're on a budget consider it.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Fantastic Place!”", "Author": "JayneyMcIreland", "ReviewID": "UR8404490", "Content": "We stayed in this hotel for 2 nights. This is a fantastic hotel for staying in and around the sprawling Los Angeles. The hotel was very luxurious and provided the guests with everything that you could need. The bedrooms were gorgeous and the beds could be adjusted to suit the needs of each individual. The pool facilities were also lovely as well, set outside in a nice shady area with a large dining table if you wanted to use it. The hot tub was gorgeous. The hotel was not expensive at all and was a real find for our tour of California. Although the breakfast was not included in our price, for $10 a guest each morning you could have anything that you wanted and more besides. The breakfast was lovely. The hotel has an Italian restaurant also which we tried one night that was quite nice. All in all this hotel was a great place to stay and comes highly recommended!", "Date": "August 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Place”", "Author": "MHBA", "ReviewID": "UR7406507", "Content": "Found it difficult to find somewhere central for Magic Mountain at the right price and safe location but this Hotel we found great. Rooms clean and spacious. Full american buffet breakfast only $10 and is good value. Seperate shower in large bathroom. Spacious free car park .Staff very friendly and helpful. Even gave us a voucher which saved us $60 for Magic Mountain. 45 min drive from LAX. Same for M/Mount and Universal Studios. Plenty of places to eat within 5 min drive. Only stayed for 3 nights but highly recommended.", "Date": "April 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Excellent Stop!”", "Author": "Historiana", "ReviewID": "UR6705391", "Content": "This area of southern California has surprisingly few viable hotel choices and this is a nice oasis. The rooms were nice, the hotel staff pleasant and a nice bar and restaurant. It was located conveniently off of the highway and there are restaurants in the vicinity. Our reasonable rate included free Internet and breakfast. I was in the area for a few days of business meetings and the hotel worked well for our entire group.", "Date": "January 27, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "usa", "Title": "“very good”", "Author": "dsheinker", "ReviewID": "UR6548835", "Content": "We stayed at this hotel on Christmas Eve. I booked it on the Radisson website and to my surprise my booking (and the room) were ready for us when we checked in \"only half an hour later\". Total check in time was about 5 minutes, the room was big, clean and very comfortable, including a big bathtub with a separate big shower. The bed was the most comfortable bed we ever had even better then the one we have at home, the pillows and the blankets were first quality and very comfortable (the bed has an electrical system that let you change the mattress from \"firm\" to \"soft\"). The hotel itself is nice, clean, with free parking and its own restaurant. The Chatsworth area is not a tourist area, but it's a busy business area and most guest in this hotel are probably in the area for business reasons. If you want to have a very good night rest this hotel will be an excellent choice. Highly recommended.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "California", "Title": "“No complaints”", "Author": "Lorelai2", "ReviewID": "UR6006168", "Content": "We got a rate of $89/night through the Radisson website (don't be fooled into thinking you'll get a better room if you pay more, as I highly doubt it) which came out to a total of $200 including tax. We asked for and received an impressively quiet room. If you want a quiet room, make sure that your room does not overlook the pool, where shrieking kids can frolick about from 6am-10pm. The pool is a little larger than average, and the hot tub is a little smaller than average. I really like the bedding at the Radisson--lots of feather pillows (I think there are five or 6 on a king bed) and a down comforter. The room also had a very comfy chaise lounge. Our bathroom had both a shower stall and a separate bathtub. The bathroom and room were very clean. Yes, the bathroom door is right there when you walk in, but I didn't find this to be a problem as another reviewer expressed. While I wouldn't call the room spacious, it was not cramped by any stretch of the imagination unless one is accustomed to five star luxury hotels. We did not have much staff interaction, but they were friendly when we did. We ordered room service and it arrived quickly, but the food from Hot Tomato is not very good. It's passable, but not worth the price. For dining in the area, there is a taco shop around the corner and a vegetarian Indian restaurant across the street. If you're willing to drive a bit to Northridge there are many, many chains like Macaroni Grill and Marie Callendars. If you're looking for something non-chainey, we loved Cafe Orient on Devonshire near De Soto (10 min drive, closes at 9pm and closed Sundays). Also nearby is Chatsworth Park where you can do some light hiking, take kids to the playground or play in the vast field. Overall my experience with the Radisson Chatsworth was one that I would love to repeat.", "Date": "October 24, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Midwest", "Title": "“Nice hotel - a few quirks”", "Author": "traveler4565", "ReviewID": "UR5806584", "Content": "We stayed at the hotel to attend a family wedding nearby. The website led us to believe we would have a two room suite, which was not the case. The bathroom in my room was nice with the separate shower. A relative, who stayed at the same hotel, had a tiny little bathroom. The view outside our window was duct work on a roof, particially hidden by lattace. The air conditioning did not work, so we opened the window at night. The food was excellent, everything was very clean, and the service was excellent. The staff were always courteous. Enjoyed the sleep number bed. The swimming pool is located inside a courtyard, which is very nice. A security guard is on duty during the night, which made me feel safer. Easy to find, but rather difficult getting out to go toward the mountains. There is a quaint little donut store just around the corner.", "Date": "September 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Federal Way, WA", "Title": "“Okay hotel - not worth the price I paid for it.”", "Author": "Max-Huckleberry", "ReviewID": "UR5607243", "Content": "I checked all the usual websites and the best price I could find was $123+tax for the first two of my nights stay, and $180+tax for the remaining two nights of my stay by booking directly with Radisson on-line. From reading the reviews for this hotel on Tripadvisor, I planned to call the morning of my arrival date to request the 3rd or 4th floor in the Tower section. Seven days prior to my departure, I received an email from Radisson inviting me to check in early on-line and give my preferences on where I would like my room location and they would have my key waiting for me when I walked in the door. I was pleasantly surprised and immediately checked in on-line and requested the top floor in the Tower section. Since I was able to check in one week early on line, I felt there was no need to follow up with an early phone call the day of my arrival. I arrived at the hotel around 3:30PM on Saturday (check in started at 3:00PM). The hotel clerk went to an accordion file that was on the desk and pulled out my information. He read it and then said \"You requested the top floor\" and I said, \"Yes, 3rd or 4th floor would be fine\". I then asked how many floors were in the Tower section and he said there were four. He looked in his computer and then said \"The highest floor we have is the 2nd floor\" so he started issuing me a key for that room. While he was doing that, two gentlemen walked in the door and up to the next hotel clerk and said they were checking in and that they were supposed to ask for the \"Tower\" section and the clerk pulled their information from the same accordion file and said \"We have you booked for the 4th floor in the Tower\". I then asked the clerk helping me if my room on the second floor was in the Tower and he said it was not. I wondered to myself if these two gentlemen next to me checked in seven days early and prior to the time I performed my check in because I did not see how they could walk in the door after me and the hotel had reserved them the 4th floor in the Tower and did not for me. My last name starts with \"Z\" so maybe they just print out their daily arrivals and assign rooms in alphabetical order. I then asked the clerk that by me checking in on-line seven days early, neither of my requests were honored, so what was the point of me checking in a week early. The clerk said that all the rooms were occupied by customers that had arrived the previous day (Friday). The clerk told me that the only difference between the Tower section and the old hotel section was that the Tower section had ceilings that were two inches higher which gave the feeling that the rooms were more spacious. He gave me the key for me and my husband to go check out the available room in the old section of the hotel. When I walked in the room, I immediately felt it was not worth the price I booked it at. The bathroom door was two feet from the left side of the bed and had a tub/shower/shower curtain combination. The room I booked was supposed to have a separate tub and separate shower. The room looked too small for the chaise/chair furniture they had placed in the far corner. I went back to the front desk and told the clerk the room was supposed to have a separate tub & shower. He nodded his head and then gave me a key for a room in the 2nd floor of the Tower to see if that room would be acceptable. That room was configured a bit different and the bathroom door was to the right when you entered the room instead of around the corner and directly off the side of the bed. The bathroom was much larger and the room seemed longer and more easily accommodated the furniture. The clerk said he was sorry, but that was the best he could do for that night. I wasn't sure if that meant we could switch to a new room on Sunday, but I was frustrated and wanted to unpack. I told him I was disappointed, this was not the room we were expecting, but we would take it. I do not understand how he knew I booked the tower, yet was initially giving me a room in the old section of the hotel and after I looked at the room and said it was not what I had booked, he then gave me a room on the same floor in the Tower section. By hearing the gentlemen that arrived after me get the 4th floor Tower with no problem really annoyed me. There is only one entrance/exit to the hotel. You can only enter from a right turn, and exit with a right turn so we always seemed to have to make a u-turn, not sure if it was legal or not to perform the U-turn in the adjacent intersections. I wanted to try a Sleep Number bed so this was the perfect opportunity. Housekeeping did a good job and left extra towels each day. Tall paper cups and lids were provided with the in room coffee machine so you could take your coffee with you. The bartenders at the bar were very friendly. I would give this hotel a three star rating. We visit family in this area each year and have always stayed at the same hotel but we wanted a change of scenery. Because of the problem with our room at check in, we are not sure we would stay here again. We checked out some different hotels to consider for our next trip.", "Date": "August 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Washington", "Title": "“Wonderful visit”", "Author": "stampteacherandrea", "ReviewID": "UR5529451", "Content": "We stayed at the Radisson Hotel Chatsworth for just under two weeks. The staff was extremely helpful and friendly. We received \"hellos\" from all staff members when we met them on the property. The housekeeping staff did an excellent job and met our every need. The pool area was very nice and well maintained. Also, during the late night hours a security guard was posted at the door which made us feel extra safe and secure. I will stay here again!", "Date": "July 30, 2006"}], "HotelInfo": {"Name": "Radisson Hotel Chatsworth", "HotelURL": "/ShowUserReviews-g32655-d84434-Reviews-Radisson_Hotel_Chatsworth-Los_Angeles_California.html", "Price": "$88 - $149*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">9777 Topanga Canyon Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91311</span></span> </span> </span> </address>", "HotelID": "84434", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/67/e0/67e0bf1eb62d68276f37c298d190394613large.jpg"}}