{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lancaster, California, United States", "Title": "“Not even good.”", "Author": "Christopher C", "ReviewID": "UR123515772", "Content": "Wow was this a terrible hotel. Absolutely false advertising. \"Low-Quality Inn\" would have been more appropriate. They get you to book with then with low teaser prices then they nickle and dime you during your stay. The rooms were cheaply maintained. Showers had no pressure. The beds were very small and uncomfortable. T Then on top of that, they wouldn't allow our friends visit us in our rooms because they \"weren't staying at the hotel\". Don't waste your money and don't ruin your trip by staying here.", "Date": "January 23, 2012"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Santa Cruz, California", "Title": "“Great Los angeles location, parking great-pet accepted nice rooms!”", "Author": "CalItal", "ReviewID": "UR118117113", "Content": "We are a family of five, the rooms are big, we have a moving company and had a car and a truck, there was parking for both vehicles with no extra charges. They do accept pets-which is rare for an Los Angeles hotel- but the fee is $50.00- a bit costly for the average pet fees we have seen in the mid-priced hotel range. The pool was cold, and is on the shady side of the hotel, it also seemed to have a lot of leaves etc in it, though there are a lot of trees and plants around it. The water was clear though, so it is cared for. The room we had, had the two queen beds and a rollaway. It was clean, and modern a great space for a family with several kids. The location was great, a decent neighborhood for Los angeles, and right on the edge of the city. We could see the white Hollywood sign on the hill from the parking area. It is a short drive to the Hollywood walk of fame etc. There is a lot of dining all around the hotel, chain and local restaurants. The hotel features a simple but nice breakfast in the morning. Hardboiled eggs, yogurts, fruits, a variety of rolls and toast, coffee, tea, juices, also my kids favorite- the make your own waffle bar. The hotel features a good sized eating area, but like most hotels, do not wait until a half hour before the breakfast closes to eat- it gets very busy and crowded then. The staff here are very friendly. The hotel does have an odd elevator system, it is in the lobby, and comes up through one side of the hotel. If your room is on the other side of the hotel you may have a small walk to your room-bring wheeled luggage. They do have a stairway on this side of the hotel, but once you go out the door it locks behind you and you cannot get in even with your room key-security?. So you must walk to the other side of the hotel and re-enter through the lobby to ride the elevator or walk the stairway there. This can be difficult if you are parked at the far end of the parking area. They do have a lot of handicapped parking zones near the lobby for people with difficulty walking so much. I noticed someone mentioned this hotel to be a find in Los Angeles, I would agree! The rooms we have had prior to this are small and costly, and all seem to have parking issues etc- Nice place-thank you!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Worthington, Ohio", "Title": "“Definitely a find in L.A.!”", "Author": "Carolyn679", "ReviewID": "UR115388763", "Content": "My friend and I stayed here for three nights during our visit to L.A. We took advantage of the \"stay 2 nights & get third night free\" option. The location is good: close enough to Hollywood, although it does not have many restaurants nearby. The staff was friendly and attentive. Parking was free and always available. The room was attractive, spacious, and had all the extra amenities. Breakfast included bacon and eggs, juices and you could make your own waffles. Hotel is perched on a hill, away from street traffic and noise, and has an expansive view. I would definitely stay here again! Great economical and comfortable choice!", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Costa Mesa, California", "Title": "“Decent hotel, depending on what you're looking for”", "Author": "LMNT", "ReviewID": "UR114850147", "Content": "I stayed at this hotel with a group of friends. We had 5 people staying in a 2 bedroom, and the hotel provided a roll away bed. The room was HUGE - much bigger than your average 2 bedroom middle of the road hotel room. Everything was clean and they were happy to provide more towels. They had a mini fridge, coffee maker, TV, the usual. We never had a problem with noise, and the beds were comfy making for a good sleep. The pool is small, but its nice to just sit out by and take a load off. The location is in OK depending on where you want to go - close to silverlake, fairly close to downtown, and conveniently located off the freeway. Not that much nearby but there is definitely a bar or two within walking distance. We had no problems with the front desk or staff, they seemed very friendly and helpful. The continental breakfast was decent, they had fruit, waffles, some kind gross eggs and bacon, yogurt, hard boiled eggs - and coffee, tea, and juice of course! FREE PARKING (very important in LA). Its located up on its own little hill away from the street so we felt very safe. There was an elevator to our floor (I saw another review that said there wasn't). I'm not going to lie, it does look a little run down from the outside, but the rooms/lobby are much nicer once you are inside. I'd say the room and service is what you would expect for the rate. I'm also pretty sure they recently changed the name to \"hotel 250\" - but they are still associated with quality inn.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Excellent - Very Clean”", "Author": "CanadaCanuk", "ReviewID": "UR76246550", "Content": "We stayed in a family suite using the website special of stay two nights get the third night free. I accidentally booked our room for the day before we actually wanted it. When I showed up on the day that I thought I had booked it for, frontdesk was very understanding. They did not charge me for the first night, and they arranged for our room for the third day that I wanted. My mistake really could have messed up our holiday, so I am so thankful that they were understanding and pleasant. We also wanted to spend the day at Universal (take public transit - close and saves parking/walking) so we showed up before check in time. They quickly found a room for us. Our room was big and very, very clean. I am a super freak about dirt and germs, but I was very pleased and comfortable there. The bedding was crisp white, which meant that I knew it had to be clean or I would have noticed stains/ dirt. It was very quiet and free parking was great. The breakfast was the best of any of the 5 hotels that we stayed at in the similar price range. I felt very relaxed here, and we didn't have any stress or problems. Everything was as I hoped and expected or better. FYI There is a laundry mat just half a block north of the hotel. The subway is about three/four blocks away. We didn't find too many places to eat within walking distance, but when driving, we weren't far from restaurants. We bought snacks to eat in our room in the evening. We had a microwave, so popcorn was good. They also sell popcorn and candy in a vending maching in the hotel.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Wonderful stay with great service”", "Author": "sablatt", "ReviewID": "UR52793251", "Content": "My 20 year old daughter and I spent 4 nights at the Silver Lake, and we had a wonderful experience. The room was cool, with a lovely view of Griffith Park & its striking observatory as well as the Hollywood sign. The room was clean, and the beds were firm and comfortable with wonderfully plump pillows. The breakfasts were of the type usual for this kind of hotel, but they do a better job than most. Even if you come at the last minute, they are never out of anything, from muffins to eggs & bacon to cereals. The hotel has cleaning staff who always seem very busy, and the front desk staff are friendly and helpful. They even suggest the things that wouldn't occur to us to ask about. As for the location, LA is a very big city, but I was pleased and surprised to discover I could get to almost anywhere with very little trouble because of its nearness to major highways. The only negative is that the hotel isn't in a neighborhood that invites walking exploration. It didn't feel dangerous, just not very interesting. It was nice getting covered parking.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Colorado", "Title": "“Disregard All other Reviews”", "Author": "ColoKids", "ReviewID": "UR36944593", "Content": "I was on the phone with Jeff several times about the poor reviews. I was promised a pleasant stay because the hotel had been purchased by a new owner. The pict on the web site are as promised, clean and very comfortable beds. Jeff and Paten (?) were VERY helpful in assisting us with the better restaurants, tips on where to ride the underground train to get to Hollywood Walk of Stars and grocery stores. They were always available at the desk if needed. Breakfast was pretty good and since it fed a family of 4 much worth the price. The hotel includes parking and breakfast - not many do around there. I was VERY happy with our stay here. Parking not an issue and we rarely saw guests in the hotel, very quiet. Thank you for making our stay wonderful! I appreciate you keeping the promise.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "san diego", "Title": "“Not a Safe area”", "Author": "Guavarnica", "ReviewID": "UR20372601", "Content": "We came to thise hotel and it turned out to be a disaster. there was alot of traffic noise coming from the streets and freeways; we were moved to a quiter area of the hotel, but thats when things got worse. We woke up to a colony of ants crwaling all over the counter top sink!The ants were exterminated but, a there were still a few dead ants that weren't cleaned up. the T.V. is old and outdated, haven't seen one of theses since the 80's. the price was way too high, Definietely not coming back!", "Date": "September 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "The world", "Title": "“My worst travel experience”", "Author": "michaelbolles", "ReviewID": "UR17998242", "Content": "Here my letter to the Manager, I hope this help others not to live the same experience: Dear Jim, Today I´m living one of the worst traveling experiences, and all thanks to Holiday Inn Hotel. Yesterday night after confirm at the front desk that \"there is always some one in charge for attend any customer 24/7\" my nightmare begins. After a very short night I went at the front desk around 4am for my check out process and for a taxi, And what I found was a message that says\"One moment please, I will return in a few minutes...\" and at the end \"Smile you are in Camera\" I was waiting for around 1 hour with no signal of any person, until that I understand that nobody was going to help me so I start to search for taxi options via Internet and making several international calls trying to find a ride to the airport. When I was able to arrive to the Airport, the Airline told me that I lost my flight and because of this my connection, so that means that I will not arrive home the day I planned and all my next day meetings must be canceled. As a result the next available flight was 12 hours later with 3 scales and several hours between flights, meaning that my next night will be at another airport, I will arrive with 20 hours delay. With this experience the impact was more than just a lost flight, and because of that I will proceed to send an Letter to RRHH explaining this situation and why this hotel can not be an option when we need to be in a business travel. I expect that some one take actions to never let this happen again to any customer. regards. MB", "Date": "July 18, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Fresno, California", "Title": "“Great little hotel, bad location”", "Author": "FreeFromFresno", "ReviewID": "UR16629610", "Content": "Booked this hotel because I am a member of the Priority Rewards Club and it was close to Loyola Law School where I was to attend a seminar the next morning. When I pulled into the parking lot the check in location was not early to see. Parking lot was adequately lit, but hotel is at the base of a terrace so houses above gave me the feeling of being watched. Got in close to midnight and there was someone at the front desk to greet me. Had my reservation down for two nights when I only book one. Got that corrected at the front desk. So for, so good, as they have a 24 hour cancellation policy. Got up to my room on the 3/4 floor via a small elevator. It reminded me of being in Ensenada, Mexico. The third and fourth floors are on a split level with the third for handicapped access. Room did not have a room number on the door so I had to lightly knock on the door hoping no one would answer. Once I got into the room, it was clean with big windows. TV didn't work well as all of the channels were fuzzy. Slept well until around 3 or 4 a.m. when plenty of loud people decided to hold a conversation outside in one of the open walkways. There was king size with plenty of pillows, both firm and soft, for a good night's sleep. Lots of road noise at all hours of the day and night. This is probably the biggest draw back of this hotel, especially when one's room faces the adjacent freeway. Got up late in the morning so I was in a hurry to leave. Had to wait for someone to check me out, just to confirm I wouldn't be charged for second night. Desk personnel were not very helpful in locating the law school. I can understand lack of knowledge of the area, but there was no effort to point me in the right direction to find out. Complementary continental breakfast was nice. The eating and serving areas were clean. I paid $160 per might through on line booking. I would look for a better hotel with less noise from the freeway for the same price.", "Date": "June 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "chicago,il", "Title": "“poor service”", "Author": "travelniu", "ReviewID": "UR13999462", "Content": "They did not have my reservation, and the front desk operation is very outdated-a hand written reservation system. On check out the bill was a very 80's looking invoice. The Breakfast Bar was terrible-zero selection and no hot food or even peanut butter. No exercise room. Very scary neighborhood. All rooms open to the outside. Front desk staff not very helpful. Housekeeping staff were wonderful. I would never stay here and also removed from my company's list of acceptable hotels in LA.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia", "Title": "“Horrible Management and just ok accomodations”", "Author": "PhillyLover", "ReviewID": "UR12513772", "Content": "Front desk staff at check in was ok but not particularly welcoming. Front desk staff at checkout was downright rude and obnoxious when I asked for another copy of my receipt. No \"sure no problem\", \"have a nice day\", \"thanks for staying for 2 days\", just a pissed off attitude. Accommodations were average. Rooms open to the outside which isn't great. Parking was fine. Wasn't noisy. Not in a walk-around neighborhood...but there isn't much in LA that is under $300 a night. Wouldn't stay there again.", "Date": "January 10, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Niagara falls", "Title": "“Newly renovated”", "Author": "77princess", "ReviewID": "UR8271016", "Content": "The previous (and only) review is way too outdated! They have since remodelled...all the rooms have new carpet, new furniture, decor..and the housekeeping staff keeps the rooms so clean! Much better improvement!!! A little pricey at times of the year but hey, this is L.A.!!! Kudos!", "Date": "August 1, 2007"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Connecticut", "Title": "“Average hotel in a bad location”", "Author": "mathias1979", "ReviewID": "UR7941033", "Content": "To be clear, this is the Holiday Inn Express at Silverlake, not Hotel 250 at silverlake, not sure why the confusion on the name. Even the shuttle service from the airport also had a hard time figuring out what hotel I was seeking transportation to, even though the hotel referred me to their service. They had to go by the street address. Girl at check-in was very friendly and helpful as were all the other staff I encountered. Rooms were clean. Parking was sufficient. Hotel was quiet during my stay. The room was very simple with no frills. You get the basic amenities but nothing more. I think the rooms could use a bit of remodeling to feel a bit more accomodating. I was on the fifth floor, and the outside walkway faced right into the hillside and wasn't well lit at night...but at least it was quiet and not facing a noisy road. My other view was a portion of roof then Rt101. When the haze lifted enough, I was just able to make out the Hollywood sign on the distant hills. The biggest con: Location location location. At first I did not rent a car thinking I could just take the metro to the LA Convention Center since it was only two blocks away. One look at the neighborhood and I opted for the rental car. There were some homeless hanging out near the hotel and it wasn't the kind of neighborhood I would feel safe walking in well after dark. The good news in all of this is that the hotel is set up upon a hill so there is a buffer zone between the neighborhood and the hotel property. But if staying here, plan on renting a car or taking a taxi. Overall, generally pretty average. Other than the location I had no major complaints. At the same time, the services offered were just the bare bones, and the only real compliment I could give is that their front desk service was friendly. Bottom line: stay here if on a budget or having trouble finding room elsewhere. But look somewhere a bit nicer first if you can afford it.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Albany, NY", "Title": "“Clean, Comfortable Business Hotel”", "Author": "USMA1986", "ReviewID": "UR7848782", "Content": "I recently attended a conference in LA. I was not planning on going, so my late booking left me with no hotel options close to the Convention Center. The closest, decent thing I could book was the HI Express at Silver Lake. First of all, this is NOT a family resort hotel. A quick Google Earth of the area will quickly show the type of neighborhood it is in. That’s not to say that it is dangerous – just that it is 100% commercial/industrial with I-101 running right overhead. So these are the expectations you must set. The guy at check-in was friendly, efficient and quick. The rest of the front desk staff were also quite pleasant and capable. Every time I requested a taxi for the morning (even for a 4:00 a.m. pickup), it was there. The cab ride to the Convention Center (or Staples Center) was about 15 minutes and $15. The room was very clean and quiet, and the temperature controls worked well. The bed was comfortable and the bedding was more than acceptable. My junior suite had two TVs, a coffee pot and a rather nice desk. The free WiFi worked great. The bathrooms were a bit dated, but clean. The showerhead was new. I did not eat the continental breakfast (which looked very limited), but the coffee was pretty good with decent-sized “go” cups provided. So, for a three-day business stay this place was more than acceptable. But would I take my family here or stay here for a LA vacation? No. The Silver Lake simply is not in a tourist area.", "Date": "June 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "1.0", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Smelly Horrible Stay!”", "Author": "SN2BPHD", "ReviewID": "UR7195488", "Content": "The fist room we were given was on the forth floor. We though no problem. There is no fourth floor on the elevator. You had to get off on the third floor and climb a flight of steps. The second room smelled like cigarettes and underarms. We did n't even go inn all of the way. The walkway did not feel sturdy, and it was noisy on that side of the hotel. The third room was smelly, but quiet. I figured it was the best we could get. The beds were hard, and blankets were thin. Also housekeeping wanted our dirty towels at 10am. This was their only was of the day. The staff was nice, however I found it strange that they were wearing jeans behind the counter. There is limited parking, and it is up on a hill. No large vehicles can fit here. Also the area is questionable as I seen many homeless people in the area.", "Date": "March 20, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Dana Point, CA", "Title": "“Friendly staff, decent room, great price”", "Author": "mindy74", "ReviewID": "UR4942898", "Content": "I stayed here with my family for the Los Angeles marathon. We were a little concerned about the location but once we got there, it was fine. The neighborhood didn't seem particularly bad and I was planning to walk to the subway in the morning (but ended up getting a ride from my husband anyway). The management could not have been nicer, greating us enthusiastically and chatting about the marathon, the weather, and everything else under the sun. The room was clean and good sized, and breakfast in the morning was fine...coffee, juice, cereal, pastries, etc. Our only complaints (and they are minor) was that there wasn't a dvd player in the room, as mentioned on the website, and I saw a bug or 2 in the bathroom. Not a big deal. Oh, and the internet access worked fine from our room.", "Date": "April 6, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“I would not recommend this place to anyone on earth.”", "Author": "NGHC", "ReviewID": "UR4344280", "Content": "We booked two rooms with a hollywood view as it was faboulously advertised. It was more like a lauzy, small room, yucky carpet, with balcony--not a good value for $150.00 plus tax, a night. When we checked in, we got two rooms at the 5th floor, however, one of the room, was smelly. No body can survive within 1 minutes in that smelly room. The staff relocated us to the third floor, no balcony, without giving consideration for the lower rate. What you can expect? The room was small and old as well. The wireless internet connection is not working and the staff can explain. The next day, the other staff suggest us to use lobby's wireless connection, still cannot work and no sympaty to help. This is one on the worst hotels I've ever stayed at. I'm disapointed with this Holiday Inn property--they can do better than this! I would not recommend this place to anyone on earth.", "Date": "January 10, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Seattle, WA", "Title": "“What a Joke - no Holiday here!”", "Author": "Skylar_B", "ReviewID": "UR4314034", "Content": "We booked a room here for 4 nights and had planned to stay another 2 nights if the location and service worked out. NO GO! We had clean towels provided only once during our stay despite my pleas on 2 ocassions for clean ones! My husband went to the front desk and waited for the staff to \"borrow\" the cleans ones from an unoccupied room! I was told by both housekeeping and the front desk that this hotel didn't have enough towels for replacement until they washed the dirty ones! We would have to wait to take showers! I have never in my life heard of such a thing at a hotel chain like Holiday Inn and plan to discuss this with the corporate office. There was NO internet connection at all! It was said to be having server problems - right - but call that \"service\" problems and in all areas! We never attempted breakfast being afraid to trust the freshness of food in such a place. The parking lot is insufficient in size and is dark and dangerous appearing. The room seemed to be clean when we arrived, but when there is NO service whatsoever, and when basic needs cannot be met perhaps it is time for management to consider a different profession. Even though one staff member was quite friendly and helpful when we arrived, I would not recommend this place to anyone on earth.", "Date": "December 31, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Palmdale", "Title": "“Disapointed!”", "Author": "DesertQueenB", "ReviewID": "UR4130368", "Content": "We booked a room with a jacuzzi. It was more like a big tub with two lousy jets that barely worked--not a good value for $189.00 a night. They even asked for a $50 deposit that was not stated at the time of reservation. The room was large and clean, but needed repairs to the carpet. This is one on the worst hotels I've ever stayed at. I'm disapointed with this Holiday Inn property--they can do better than this!", "Date": "November 21, 2005"}], "HotelInfo": {"Name": "Hollywood Silver Lake Hotel & Suites", "HotelURL": "/ShowUserReviews-g32655-d84513-Reviews-Hollywood_Silver_Lake_Hotel_Suites-Los_Angeles_California.html", "Price": "$91 - $165*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">250 Silver Lake Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90004</span></span> </span> </span> </address>", "HotelID": "84513", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0b/82/0b827f37b8e08faadfe887fa9b0dd5a44large.jpg"}}