{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Its okay, but I'd recommend somewhere else.”", "Author": "MusicSarah11", "ReviewID": "UR128291098", "Content": "I've reviewed this place in the past and I feel like it has gone down the drain the past 9 months. Yes the location is perfect for Disney World - maybe 5-10 minutes- if that is all that matters to you. There were spiderwebs and dead bugs in our room, as if no ones been in there for months. The lock on the door looked as if it could fall off at any moment. We we requested a new room, the staff as rude, but did give us a new room. The new room was just as bad. After a 2 minute debate, my friends and I decided to get a new room at a new hotel. Yes the location is great, but pay the additional 30 dollars a night to feel safe and have a good room.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cocoa, Florida", "Title": "“Location, Location, Location”", "Author": "cindi m", "ReviewID": "UR128139934", "Content": "A great place for access to Disney World. Room was clean, easy access to Disney, did not find the shuttle helpful, two pick ups in the morning, 12 hours later you could get the shuttle to back to the hotel, both required transfers. There is a $6 A DAY service charge, for what?????? Continental breakfast leaves alot to be desired, coffee, tea and mini donuts. The property needs some TLC as do the rooms. However, the room was clean, the location is great if you don't mind paying to park at Disney, lots of good restaurants within walking/driving distance.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Danville, Virginia", "Title": "“perfectly acceptable”", "Author": "Jessica P", "ReviewID": "UR127840137", "Content": "For the price - great location, good perks (free wifi, free shuttle to the park, free breakfast), and adequate rooms and service. Id go back with my family again for the price.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "philadelphia", "Title": "“Holes in the wall, stains on the sheets”", "Author": "cmm441", "ReviewID": "UR127766442", "Content": "This was the first hotel hat I absolutely refused to stay at once I showed up. I typically stay at 2 or 3 star hotels... This hotel doesnt even deserve a 1 star. As soon as I went to check in I got a creepy feeling. I felt disgusted and frightened (though I cant really explain it.) When we showed up in the room, we noticed that the room definitely looked outdated, which in and of itself wouldnt upset me. But then we noticed that there were nasty stains on the comforters. Then when we lifted that up, the next blanket was not only stained but it had several cigarette burn holes in it. (This was on both beds). There was a huge hole in the wall right next to the 2nd bed. Then the bathroom light barely came in. Seeing the blankets was the icing on the cake though. My husband went to the manager to ask for new blankets but he was rudely told that they didnt have an additional clean comforters, and then he made a quick call which stated that they had one blanket... (even though we had two beds.) When asked if they had another room, the manager claimed that they were fully booked and had no where for us to go. When my husband returned to the room, the family in the room next to us said their room was disgusting also, and that they even had blood stains on the wall. (The room 2 days down stated the same thing.) I refused to stay there and began calling around to other places, while talking to expedia to get them to cancel my reservation. Expedia then called the hotel, and the manager then stated that he had another room to move us to. (Even though he stated 5 mins early that he did not!) We refused and ended up having to stay at a hotel 30 mins away. (It was spring break week this past week and all the nearby hotels were fairly booked.) Considering my first night there (after $15 hotel fee per day) cost $75, it was definitely not worth it. Im not usually picky and can definitely find good deals typically, but this was the largest mistake ever made!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Needs renovation”", "Author": "SidSimao", "ReviewID": "UR127472691", "Content": "It says in their website it was recently renovated.... But it doesn't say how recent it happened.. My room was stinky, the internet is fine, good location, but could find better places for cheaper prices.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Bad Experience”", "Author": "yazi1973", "ReviewID": "UR126742078", "Content": "We went to Orlando a couple of weeks ago and made a reservation online at the Knights Inn hotel. By looking at the pictures we thought it was ok but that was not the case when we arrived. We reserved 3 rooms in total and all of us were really disappointed of the condition of the rooms. I really do not recommend staying at this hotel.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Flea infested hole in the wall”", "Author": "Beverly S", "ReviewID": "UR126303358", "Content": "I reserved this hotel because of location and price. The non smoking room smelled like an ash tray. My children and I have flea bites on our feet. I complained to the front desk and nothing was done. The plaster was coming off the wall. The night staff acted like they were high on drugs. The continental breakfast? A few mini doughnuts, not even enough to feed a family of 4. This place was awful. Never again. I can't believe Wyndham associates their name with this disgusting place.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Ohio", "Title": "“DO NOT GO!!!!!”", "Author": "Caskar", "ReviewID": "UR126164045", "Content": "Please, save yourself money do not go to this hotel! I can not believe the health department in Kissimmee or the county can allow that place to operate. Our door not only didn't have a chain security lock, it wasn't even locked when we arrived! The only way to lock the door was when you were in the room using the deadbolt. Filth!! The sheets had stains on them. It looked as if they weren't washed. Gross! The smell bother us so much the 10 minutes we were in there ours eyes got red and burned. When we went to the front desk, we were 2nd in line of 4 all refusing to stay. We were told that we would be charged for the room and the extra charge for incidentals. This Knights Inn has guest sign room agreement then sometime later they stamp it in red with a disclosure about the extra charge then claim you agreed to it. Stay away!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Waterloo, Ontario", "Title": "“Good on a budget”", "Author": "mdrichmond", "ReviewID": "UR125301615", "Content": "This is a budget hotel and can not pretend to be anything else. But if you want to see the mouse and want to keep down the cost this is a great place. Any issues we had were dealt with promptly by Connie at the front desk or Juan, the master of all trades maintainance man. The pool is heated and sunny, the rooms are kept clean, and there are about a hundred eateries within a ten minute walk. There are free park shuttles and coffee, juice, and donuts for breakfast. Watch out though for the $6 facility fee which is not in posted prices but this seems to be becoming standard in Florida. Still good value for your buck.We return every year.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "fort lauderdale", "Title": "“Thanks Shane!”", "Author": "lostshakerofsalt1", "ReviewID": "UR125190364", "Content": "A friend and I stayed here for one night during our trip to the Magic Kingdom. After 14 hours at the park, we were so tired and were welcomed by Shane at the front desk who checked us in quickly, making us laugh and feel like we were family. For the location and the price, we will stay here on all of our Disney excursions. Thank you Knights Inn!", "Date": "February 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“I'd like a different room”", "Author": "LodgerFromChicago", "ReviewID": "UR123232632", "Content": "\"I'd like a different room.\" I said to the Knight's Inn front desk on the evening of Friday, January 13. My original room #307 had two people in it when I unlocked and opened the door. The clothed woman in the far bed loudly blurted \"WHAT!??!\" I stammered out \"sorry\", closed the door, and returned to the main lobby. The lobby's front desk woman with the fashionable fingernails corrected the 'credit card' style key to room #308. Per the instructions on the inventory card, I reported three missing items to the front desk: one wash cloth, one hand towel, and one TV remote. The room's carpeting was a mini-minefield, with surprise walnut-size bumps hidden below. The morning daylight found its way into the room through a small narrow space in the door. The shower was powerful and had plenty of hot water. The bed was comfy. I ignored the cigarette burns on the bedspread. This was my second stay at this Knight's Inn, and with its great location and low price, I am likely to return. It is great having parking immediately nearby, at one's doorstop. I stayed 3 nights here on this trip. But each morning, I packed up everything, and moved it to the trunk of the rental car.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Winnipeg", "Title": "“Very inexpensive 2 star hotel on Disney's doorstep”", "Author": "Winnipeger67", "ReviewID": "UR122729104", "Content": "Desk Clerk friendly, linens and bathroom clean, beds comfortable, carpets worn, tired and not fresh, had a small pool. All rooms are on ground level with an outside door and parking is directly in front of the door. Continental breakfast was coffee, orange juice (not tang or Koolaid) and Robin’s egg doughnuts. Free WiFi did not work until the IT guy arrived to reboot the system in the morning. Location: right on Disney’s door step. Certainly nothing fancy but cannot complain at the rock bottom price.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Budget Hotel”", "Author": "MusicSarah11", "ReviewID": "UR118624365", "Content": "Well, this is a cheap hotel, and that is what you get. I have booked this hotel twice before and probably again. When I come to Orlando, I am not spending time in my hotel room, but rather out and about in the city and attractions. I haven't had any problems with staff or room. I would recommend to friends.", "Date": "September 26, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "miami", "Title": "“YOU GOT FOR WHAT YOU PAY AND I AM HAPPY!!! : O)”", "Author": "anite2011", "ReviewID": "UR118131326", "Content": "Nice hotel Free shutter The breakfast is so, so Nice pool And really quit @ night I have no complaings........", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“Bedbugs! Need I say more?”", "Author": "BoxcarNY", "ReviewID": "UR117852765", "Content": "I realize that the bugs are probably brought in by previous guests but the problem needs to be addressed by the motel management. There were also questionable stains on the carpet in room 311. We stayed one night but left quickly the next dayNight clerk Harold was wonderfully helpful and very nice..", "Date": "September 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Ocean City, NJ", "Title": "“Bargain hotel”", "Author": "graeber5", "ReviewID": "UR117725012", "Content": "PROs-It has a good location, pool, free shuttle, wireless internet, micro & fridge in room, free donuts & coffee in morning, inexpensive if booked online. The staff was polite. Hotel next door has pizza hut & heated pool. CONs- The room wasn't cleaned every day, don't be late for the shuttle back or you will be left, there is only 1 washer\\dryer for hotel guest use, you can't extend internet price (I walked to hotel next door to rebook). Got locked out of room a couple times.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "perth western australia", "Title": "“very good value for money”", "Author": "tina77_11", "ReviewID": "UR113345653", "Content": "we stayed at knights inn for two weeks from 26th Jan to give us time to see disneyworld and other attractions around the orlando/kissimmee area. it worked out around 200usd per week inc. tax and continental b/fast which we thought was very good value. we would stay there again if we were going to that area which probably we are not for a few years anyway.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Carson, California", "Title": "“Excellent place to stay”", "Author": "egarcia_11", "ReviewID": "UR112495046", "Content": "Went to all the Disney Parks it’s the perfect location for the parks. There is coffee, tea, orange juice, and little doughnuts at breakfast. But with a fridge and a microwave we have in the room, we can buy our own food. Beds and room were clean and restful. It’s not 4star but for the price it’s perfect. Free Wi-Fi and heated pool. Easy on and off to Disney. And free shuttle to some of the parks. We stayed 4 days and would do it again. Give it a try.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Good Experience for the Price”", "Author": "Brazil_Man_11", "ReviewID": "UR106544798", "Content": "I visited Kissimmee early April and stayed at the Knights Inn with my two kids. I had no problems during my stay. The rooms were clean, the pictures on catalog matched reality, and the staff was friendly. Breakfast was simple but can expect more than that for the rates. I was not charged anything that I did not expect, just usual Florida hotel taxes. Keep in mind that this is an affortable hotel for people who is spending most of their days out and about at the parks, and I recommend it.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Horrible place, terrible service.”", "Author": "kinanik", "ReviewID": "UR101822867", "Content": "Worst hotel I've been in my life. I understand this is a cheap hotel, I wasn't expecting much but it was ridiculous, horrible service and when I tried to complain the girl at the front desk was very rude. First of all I got there on Thursday 02/24/11 and I ask for a crib for my baby and after waiting for hours for a response (and calling back to ask many times) they told me they didn't have any, I tried to talk to the girl on the front desk to see what other option they had, If there was anything she could do to help me and she just said NO, she didn't even tried to help me. We also had to go to the front desk to change our TV remote control a couple of times because they didn't work, and we were having trouble with our sink, it was clogged and we told them. The next morning I ask again to see if they had a crib available and if they did to please put it in my room, we also reminded them that our sink was clogged and we left our room with the \"Please Clean Our Room\" sign on the door. We went to Disney and when we came back they didn't even clean our room, the sink was still clogged (it was disgusting) and of course there was no crib. We told the front desk and they said there was nothing they could do because the workers have already left, can you believe that? We were so tired at that point that we went to sleep and left the next morning. I took some pictures of the disaster, including the disgusting sink and the inside of the room. We are NEVER coming back to that place, it was really unpleasant and for that same price (or even less) I've stayed in better places in the same area. My suggestion: keep looking and stay away from this place and these people!!!", "Date": "March 28, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Beware of Credit Card bogus charges”", "Author": "nodogtraveler18", "ReviewID": "UR99696819", "Content": "Service was bad, \"Continental Breakfast\" was a joke--mini donuts coffee and OJ--maybe. Charged $50 for non existent dog. Owner/manager said he had pictures, when asked to send copies he changed story to 2 or 3 witnesses saw me with a dog. I never, never, never travel with my dog. Beware of possible Disney ticket scams being run out of the lobby. I filed a formal complaint with their corporate customer service. Case --. Old run-down poorly maintained, beds not comfortable. This place should be avoided at all cost.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“FILTHY !!! UNPLEASANT !!! CROOKS !!!”", "Author": "Bokeron28", "ReviewID": "UR98793616", "Content": "My partner and I intended to have a quick, relaxing, fun, getaway to Orlando for one night. This stay resulted in the ultimate nightmare. Upon arrival I thought I had the wrong address – Reception area very dingy; Front Desk staff extremely rude with the guest ahead of me that was complaining of a filthy room. Nonetheless, I checked in since I had prepaid my stay through Hotwire. This is where the nightmare begins: Upon entering the room, a tainted smell greeted us. The carpets were stained, the comforters were aged and discolored, and all the bath towels needed to be in a dumpster instead of a room. With all this misfortune, we decided to still stay and spend the night. Checked out in the morning and 2 days after get slapped with a $6.00 CONVENIENCE FEE. How condescending? This hotel / motel/ inn – whatever you consider yourself to be needs not to be in business. I am disappointed that KNIGHTS INN has your location listed as a franchise. PLEASE FOLKS - DO NOT WASTE YOUR MONEY - IT’S A NIGHTMARE !!", "Date": "March 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“Cheap Motel with hidden fees”", "Author": "pacers16", "ReviewID": "UR96757988", "Content": "Cheap bottom of the barrel motel. Charged me a service fee for the \"complimentary\" continental breakfast (mini hostess donuts and boiling coffee, that's it) and shuttle to Disney World. Since when did complimentary mean it costs money? Also charged for parking when I didn't even have a car and the pool which I didn't use and the laundry facility which is an old washer dryer I wouldn't use anyway. Just another swindling company that tacks on service charges and admin fees. They use the cheap rates to lure you in. The faucet in the bathtub leaked constantly, the walls are super thin, and the tv stand shook and rattled against the wall as you walk through the room. This is heard when the neighbors do it too. I would never stay here again. If Knights Inn reads this I want my money back from the hidden fees.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Marietta (Atlanta) Georgia USA", "Title": "“BED BUGS DO INDEED BITE +C*A*U*T*I*O*N*!”", "Author": "jimwentzell", "ReviewID": "UR94430893", "Content": "we checked into Knights Inn Maingate Kissimmee about 6pm on a Wednesday, went out for dinner and came back around 10pm to shower and climb into bed. My wife and teenage son were sleeping soundly pretty quick, but I stayed up reading as I usually do. Within a few minutes I felt several sharp little bites, and to my horrified surprise found the sheets crawling with quite a few little bed bugs, each a little smaller than a ladybug. They were all over the bed especially underneath the mattress. AS I later found out, they come out while you rest and can sense the body heat like a flea. They DO suck your blood too! I have several nasty little marks but the overall experience was quite awful. My wife dashed out of bed roused from her deep slumber and we quickly packed up and left after notifying the clerk (Marvin) we didn't care about forfeiting our room fee we just wanted to get the heck away from this nightmare!", "Date": "January 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Bad Experience”", "Author": "jramos2563", "ReviewID": "UR92133892", "Content": "We stay in this hotel during December 22 until December 25 and we try to board the shuttle bus and we couldn't board the bus because it was so full and the continetal breakfast was a joke it was finish in like 30 minute because it wasn't obviously enough for everybody in the hotel and the internet was a joke", "Date": "January 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Horrible, Horrible, Horrible, stay in your car first!”", "Author": "Themeparkbuff", "ReviewID": "UR88539831", "Content": "This was the worst hotel I have EVER stayed in! The rooms were nasty with stains on carpet, bedspreads with holes and faded. We planned on a full week stay but we stayed one night and went to another hotel. I have NEVER in my life seen such a dump. First they lie to you about their rates as when you are given a price by phone or by coupon it does not include a 6.00 resort fee. When you think of \"resort\" fees, you think of a nice place right? WRONG!! It is another way of scamming extra bucks from you. I ahve stayed at a lot of hotels in the kissimmee area over the years, but I have never stayed in one this bad. But thye have no worries because SOMEHOW they ahve some good reviews.... Could it be the ticket sales booth coputers in the lobby that benefit from people coming there to buy tickets??? Hummm... I would advise if this is the only hotel with a vacancy (as it was when we went, should have gave me a red flag) to wither go home or sleep in your car. At least there are not bugs in your car? Please, please, do not expose yourself or your family to this filth!", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "pa", "Title": "“very comfortable stay!”", "Author": "wallykil", "ReviewID": "UR85005420", "Content": "went to this hotel after leaving rodeway inn maingate.because of bugs in the bed!! We arrived here 9 oclock at night and found the desk clerk very friendly and helpful.He felt bad for what we were going through and gave us a great rate 24.95 a night. We found this place had very comfortable beds /clean/and friendly.Easy check in and check out.And no bugs!!! Furniture is a bit out dated but we were glad this was only thing we could find wrong here.And will stay here again gladly .Again we would like to thank Knights inn for their help.when all was going wrong with the start of our vacation .They stuck out there hand and welcomed us with a great rate.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“It's an average hotel”", "Author": "msparker", "ReviewID": "UR82897764", "Content": "I traveled to Disney and stayed at the knights inn to save some money during thanksgiving. The room was well worn, but clean. I had a little bit of service trouble, and that was unfortunate. When I arrived my in room safe was broken, and the blanket on one bed had holes in it. Since I was traveling alone I just used the other blanket on the bed. The next morning I went for breakfast, which was just doughnut holes and orange juice. I informed the front desk of the two issues and asked that they be resolved. I didn't use the shuttle at all during my stay because they only pick up early in the morning and then drop off at night- I didn't want to be stuck at the parks in case something happened. When I arrived back at my hotel the beds were made but the blanket was still there, and the safe was still not working. I figured oh well. The rest of the stay was pleasant enough except I was frightened one night when a nearby delivery restaurant forced a menu through the door. When I was going to check out I grabbed my milk from the refrigerator and realized that it had gone bad. The refrigerator was broke and the only thing that had saved me from food poisoning the previous two days was the frozen blue ice I had placed in there. When I checked out I told the hotel staff about the refrigerator. I got a callus, \"oh well it broke we will fix it.\" I didn't expect anything but still an apology would have been nice. I was a little frustrated with the hotel because I was charged a resort fee that included the safe and refrigerator and neither worked. This is a good hotel for people on a budget and if you plan on staying in the parks all day. But be warned you will have to pay the Disney parking fee if you don’t want to wake up to catch the shuttle before 8 and then leave the park at 10 (Which is impossible since the fireworks at every park is around 9 and goes ‘till 9:30 and the mad rush to get out after is impossible to navigate through). I would recommend this hotel to couples without children, since the shuttle would be hard to catch and you would have to drive with your family and the parking fee would just be a pain for any family.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“Solid base for visiting the parks, not bad (June 2010)”", "Author": "AndrewWaters_England", "ReviewID": "UR75002612", "Content": "A really good base for visiting the parks and excellent value. The rooms were not the best but were perfectly passable if all you intend to do is come back late and sleep! The staff were pretty helpful and sold tickets in the lobby (not sure how legal that was!) and the atmosphere of the area was fine. I would definitely recommend this inn for what we did but would much rather stay somewhere nicer if I was staying for longer and intended to spend more time in our room. The only downside was that on the last day the computers broke down for some reason and they therefore lost all of the information about who was staying where, this resulted in them sending a large family into our room at 3am (fortunately I had put the latch across!) but it wasn't a massive problem and they apologised profusely in the morning. Overall, I would say it was one of the best value stays of our trip down the east coast of America.", "Date": "August 13, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Not Clean, Not Friendly”", "Author": "drprincess17", "ReviewID": "UR74489048", "Content": "The Inn was nothing like you see in the pictures or remotely imagine it to be. The first bad impression is that the front desk area is not bright and is in need of a brush of paint. In addition, the gentleman at the front desk was not nice at all. He wasn't welcoming upon registration and was not attentive when we called to tell him that the fridge in our room was not getting cold. We had to wait about two hours before he decided to just change our room, after much insistence, since he had no time to check the fridge issue. The fridge in the second room barely got cold and made no ice. We decided to stay in that room since there was no better option for us. The rug in the room was stained and there was an unpleasant smell during the entire stay (3 nights). The bathroom door did not lock and the tub barely fit one person. Forget about the continental breakfast; they didn't even have coffee at 8 AM! My family and I were very happy when we checked out! We'd never go back to that place even if it were free.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“Gross.”", "Author": "danidancer26", "ReviewID": "UR71577078", "Content": "This hotel sounds fantastic, but it's not. I thought it was a great deal for only $45 online, but once we arrived, we got to our room and left. Very outdated, gross linens, and the staff was horribly rude. I do not advise staying here, even if it is a 'good deal'.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Camdenton, Missouri", "Title": "“Cheap and clean”", "Author": "pattonphyllis", "ReviewID": "UR71285076", "Content": "The front desk was very nice and helpful, the rooms were clean, the motel was old but it was clean", "Date": "July 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belgium", "Title": "“Good rates near Disney”", "Author": "Gerdy_B", "ReviewID": "UR61019427", "Content": "Cheap hotel near Disney World. Free shuttle service. This one can be very crowded and stops at different hotels. Luckily ours was the first one so we were able to sit down on the bus. The room rates indicated outside of the hotel don's include a mandatory $ 6 resort fee for the swimming pool, internet, shuttle service, etc. Still very cheap with that fee included. Booking online (like I did) this was allready included. Big spacious rooms looking good but not everything might be working. In our room the hairdryer and the safety deposit box were broken. Also the internet did not work our first night. After complaining about that the staff did everything they could to fix the problem. And after about an hour of trying they actually managed to to so. The free 'continental breakfast' is really not worth that name. Only donuts. Still great value if you only want a place to sleep and spend your day in Disney World. Conveniently with 'free' (included in the resort fee) shuttle service.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Really, really bad. Don't even bother looking.”", "Author": "secondgrademom", "ReviewID": "UR60872166", "Content": "We booked this hotel for a night to get us through until our time share check in. Upon pulling up to the main building we noticed the pool on site was nothing like the photo and was littered with garbage, wet towels, clothing and run down patio furniture. The pool paint was peeling and cracked and the water was very dirty. The windows to the check in office were filthy with stuff dripping down them as well as them being cloudy. The entire place was run down and in disrepair. There was no way we were staying here. When we called Expedia, they were very helpful and gave us a $100 voucher to a new hotel since the hotel refused to refund out money. I am afraid to think what it might have looked like inside the room.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "sc", "Title": "“Motel ok...staff not very friendly”", "Author": "tamntom06", "ReviewID": "UR59833719", "Content": "Let me start by saying i have stayed in this motel for 6 or 7 yrs during vacation over the past 10yrs or so and i have always been pleased. This time was a little different. As others haved sayed its ok for the price you pay but the man at the front desk needs a class on customer servive. I picked up a discount coupon at a service center on the fla turnpike on my way down and he refused to let me use it so dont even try. They should be removed from the service center. He said i couldnt use it and i pointed out the dates were still good in return he pointed out that it was subject to availabilty and of course..he refused to let me use it. On the bright side we were only there 4 days and we were so busy at the parks that we didnt spend alot of time there. The kids did play in the pool and it was ok. At times it looked like the owners whole kiddie family was in the pool and that was a little strange. The shuttle is good..we were the first ones on and the first ones off every day so that was good. Resturants in walking distance and Perkins is mmm mmm good. If youre getting tickets for the parks try buying them inside Perkins.The guy there can save you some money!! Overall stay not to bad but customer service could use some improvement!!!", "Date": "March 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Ontario", "Title": "“clean and tidy”", "Author": "kittysmomma", "ReviewID": "UR54109776", "Content": "stayed for 2 weeks and found the staff very helpful, laundry on site and was very handy to rooms. easy access to all of the sites and resturants very close by. would stay here again.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "boston", "Title": "“Family Reunion”", "Author": "aiglemont", "ReviewID": "UR48841594", "Content": "We had six rooms and had no problems with our rooms. The staff was friendly and were willing to help us anytime of day . It was close to Disney and the free transportation to Disney saved on the parking at Disney. The free wireless interenet made it our day. We would check our e-mails before heading into town. The restaurants were walking distance and they had great food. Cannot beat the location. It was close to the major freeway (I-4) for us to get to the Shopping Malls or drive to the beach. What we saved on the room rate and breakfast, we spent on shopping. It was very inexpensive.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Worst hotel experience of my life!”", "Author": "KelKel82", "ReviewID": "UR48348805", "Content": "I would rate this hotel ZERO stars. It is horrible and quite frankly should not even be open for business. The only thing decent about the place is their rates. We booked a king bed and the only room staff would provide is a queen murphy bed. Who has murphy beds in hotels these days? After complaining, the staff informed us that there are only 2 king beds on the entire property, one non-smoking and one smoking. They did have the smoking room available. However, I was confirmed for non-smoking. Staff refused a refund for that night. Room built on a platform of plywood and carpet was filthy. I would never walk barefoot on those floors! You must sign a list of rules, including a charge to use an ironing board upon check-in. Hotel advertises wireless internet when it is actually WIRED! Bring your connection cords!! Hotel is so ghetto that the TV remote is issued upon check-in. I would never stay at this location, nor another Knight's Inn! It is absolutely despicable! There are plenty of other choices of hotels in the area that are MUCH nicer for a rate of $10 more per night. I am a new user to Trip Advisor and had I known they allowed you to post photos, I would have taken a photo of this dump!", "Date": "November 2, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "michigan", "Title": "“easy access and close to attractions and restaurants”", "Author": "donjuanMichigan", "ReviewID": "UR42489669", "Content": "stayed here for spring break. there were rooms available and it was clean and good to sleep in. the golden corral restaurant is just across the street . of all the hotels i stayed at, it was the closest to disney. will be back again.", "Date": "September 17, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Toronto", "Title": "“Not Bad.Friendly staff.”", "Author": "conservativecanadian", "ReviewID": "UR41427499", "Content": "This hotel is located in a very handy spot.Close to Disney,restaurants and shopping.It was clean no frills but for the amount paid it was OK.Parking right @ your door nice pool and good TV Channel selection.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "florida", "Title": "“Can't Beat the Price or Location! :-)”", "Author": "FloridaLucky013", "ReviewID": "UR34121064", "Content": "I took my 4 1/2 year old son up to Disney World for my birthday. This hotel was inexpensive and fit right into my budget. It was clean, it is a little outdated, but we didn't mind at all. I like the fact that you could park right in front of your room. Their continental breakfast was mini doughnuts and coffee and juice which was perfect to get the day started. My son and I loved the donuts. The shuttle was right on time and we were so close to disney world we got to stay the whole day and into the night. the Staff was very friendly and attentive. The pool was great and the other quests at the pool were very friendly! I am going back for another stay in September for my son's 5th birthday and going to Animal Kingdom!", "Date": "July 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“You get what you pay for”", "Author": "Anikabella", "ReviewID": "UR34054255", "Content": "After reading the terrible reviews this Motel had, I was expecting the worst. It gave us what we paid for. Rooms : Although the rooms are old and would need a facelift, it was clean, safe and decent. We had two double-beds with a full bathroom, a little table, two chairs, a safe, a telephone, a TV with full cable as well as a little fridge and microwave. We really can’t ask for much more at $30/night. The towels are old and scratchy a little, so I’d suggest bringing your own towels/face clothes. You will also need to bring your own shampoo/soap as they provide very little. Then again, it’s to be expected at the cheap price we pay. Although loud at times, the AC was working well and kept us cool. My only concern would be the water. I’m not sure if there is something bad with the water in the Orlando/Kissimmee area, but it has a really strong smell… So much that I had to use bottled water to brush my teeth. Again, it’s bearable if you spend minimal time in your room. Internet : They say you have free wireless Internet access… and you do, but the router is not very good. We were given a room a few doors down the Lobby and we still could not get enough reception to get online. Although, when my boyfriend sat in the lobby, he had full reception. So if you want to keep your internet access to a bare minimum, it is POSSIBLE to have access but only from the lobby. If you’re planning on working online for hours, forget about it. They don’t have any work station open to the public either. You need to bring your own laptop/Iphone. Amendeties : There is a small pool and although I haven’t been in it, there was almost always someone in it, so I figure it was alright. The “free continental breakfast” they advertise is lame. Two timbits (one-bite donuts) per person is the limit and they’re cheap, stale ones from the grocery store. The juice is watered down and I haven’t tried their coffee. This did not bother us as the location was great and was surrounded by many restaurants, at different prices. We asked where them where their Ice Machines were and they told us to go get our ice at the Ramada Inn beside our Hotel… Don’t expect to get any free Ice at Knights Inn! Location : It is greatly located with lots of restaurants around. Local bus service is available right in front of the hotel, there’s a grocery store across the street, a bunch of souvenir shops, etc. For the restaurants, at less than 5 minutes walk, there is a Sizzler’s, Ponderosa and a Perkins. Sizzlers and Ponderosa’s offer $3,99 breakfast buffet which were both ok, but a little more greasy than what I am used to in Canada. If you want to walk a little further, you get to all the different fast food restaurants, (McDonald’s, Burger King, Wendy’s), pizza chains (cici’s, etc) and Golden Coral. There is also a few activities available at a walking distance, such as mini-putt. Shuttles : We mainly picked this hotel because of its cheap price but also because of the free shuttles to Universal Studios and Disney World. We did not have a car, so this point was extremely important to us. At this time of the year, they had two different scheduled time for shuttles to Disney world and four different return times; Which gives you to options to sleep-in in the morning or not; come back before, or after dinner, at night. For Universal, they only had one shuttle to go and come back every day but since this park is smaller, it was all we needed. Based on 7 days of using the shuttles, I can confirm that the shuttles usually ran on time, with the exception of one night when the shuttle was about 40 minutes late to bring us back to our hotel. Be ready to stand on the bus though as we rarely got seats to sit on. They pack the shuttles as packed as they can. Overall, considering the price and what we got, I think it was totally worth it and we would definitely recommend it to young couples/families on a budget who simply want a place to stay over night without spending much time in the room. If you’re planning on spending a lot of free time in the room or work at night, I suggest going somewhere else.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brazil", "Title": "“it's good for the price”", "Author": "Marcelociocca", "ReviewID": "UR31027737", "Content": "I liked the hotel because it's near disney world and we didn't stay a lot of time in the hotel, we just go there to sleep. The front desk was very helpfull, they help us to get tickets to all the parks and tell us where to buy all the things that we want.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "vancouver", "Title": "“Not a nice place to stay”", "Author": "williamp", "ReviewID": "UR29869348", "Content": "I went to this hotel with some friends and it cost me very expensive for what it is. The bathroom was dirty, I think the cleaners didn't clean at all. There was some hairs on my bed, thats why I couldn't sleep. I even heard my neighbor say that there was a cockroach in the toilet. I wouldn't even recommend this hotel to a friend. The persons working there were not even friendly and the morning breakfast was horrible!", "Date": "May 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "New Jersey", "Title": "“Really horrible motel”", "Author": "DisappointedCust", "ReviewID": "UR28825034", "Content": "My family and I stayed in this motel for our Disney vacation. This is the most horrible motel I have stayed at. Front desk staff is not concerned about any issues one brings up to their attention. They provided us with extremely small and filthy bath towels. When I informed the front desk staff, they did not apologize or promise cleaner towels. The cover on the exhaust fan and lights fell down when my son was taking shower. He barely escaped getting hurt. Again, the front desk staff was not affected by this. They advertise that they provide free continental breakfast. They provide only donuts, coffee and orange juice. They have a sign that says they will stop any guest taking more than two donuts as other guests will be deprived of the donuts. My wife and/or I would go to the very small breakfast area and would bring back donuts, coffee and orange juice to the room. Since the kids would be in the room, we would have liked to bring some donuts for them. But these guys would not flinch at stopping you from bringing a few more donuts. They should not be using the word \"Continental\". Please stay away from this motel. Only good thing is the price. I would rather drive and save monies so I could stay at a decent motel than stay at this extremely dirty motel with a cold staff.", "Date": "April 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Pretoria, South Africa", "Title": "“Good value for money.”", "Author": "LeonKay", "ReviewID": "UR28166822", "Content": "Kay family, Pretoria, South Africa We stayed at this hotel over Christmas 2008 and still found it very good value for money after having been there a few years before. We do not think this hotel deserves the unfavourable comment some individuals have posted about it. We even had a nice swim in December in the heated pool. Positive aspects that we experienced: • Very affordable • Well situated. Ponderosa across the road provides an excellent buffet breakfast for $3.99 to fill you up for the days fun. It is surrounded by many factory shops providing some good shopping. • Free shuttle service to the Disney parks Less positive aspects: • Shuttle not always on time. • If you prefer nice and thick towels – rather take your own. We are recommending it to friends and will be back again! “sal weer terug wees”.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Philadelphia, Ohio", "Title": "“we had a great time & this provided for our needs.”", "Author": "auntieclimactik", "ReviewID": "UR27438971", "Content": "I will start with a warning, ALWAYS CHECK FOR BEDBUGS AT ANY HOTEL BEFORE YOU BRING IN YOUR BAGGAGE! America has been recently become a very hospitable place for bedbugs and the weather in florida makes it doubly so. To check for the dastardly little buggers pull back the sheets looking along the tube like seam and look for dark marks that look just like mildew. This is excrement for more details check this article. http://www.msnbc.msn.com/id/11877871/ we checked in and did the bedbug check and yes we found them and were promptly and graciously given a different room and went through the \"check\" again to find them yet again! the man at the desk upon me bringing him an actual bedbug in a piece of paper did try to tell me it was not a bedbug, to which I said \"yes it is.\" and got no argument from him but another room and he stated the rooms away from the pool always seem to be better so we tried again and after the \"check\" confirmed it was free of the extra guests. we checked in and stayed for 3 days (so far) with out incident. no one is impressed by the size of the towels in the reviews we read so we brought our own, no biggie we were happily given extras when we asked with out comment or complaint. You should ask for a remote for the tv when you check in as they keep them in the office but have no problem giving them to you . No one in the reviews were impressed by the continental breakfast so we expected it. The coffee was good, the donettes were ok and there is a sign stating you can have 2 donuts (donettes) per person. we were not angry as we expected it and had breakfast stuff in our room. there is a shoneys next door too. The pool was warm (from the sun) lit & open til late at night and seemed clean, doesn't exactly look like the picture in the advertisement as the paint is a little flaky and there are weeds around the edges of the area, but no yucky stuff to contend with. they cleaned our room every day and made the beds putting our extra pillows and even stuffed animals in the bed in a friendly way that made it homey and nice to come back to after the long day at the park. yes the towels were small so expect it. you can purchase your own beach towel down the road for a few dollars. the plumbing a little noisy, big deal, it works and it has HOT water! I NEVER saw a cock roach , or for that matter any other kind of bug in our room . One night after the park my little one threw up on the bed, we were promply given new bedding with no trouble. The beds were so comfortable. the tv, microwave & fridge all worked. And our A/C could have impressed a polar bear! Oh here is something no one told us, YOU CAN BUY YOUR TICKETS FOR DISNEY & OTHER ATTRACTIONS HERE AT THE HOTEL AT A DISCOUNTED RATE. We got ours from undercovertourist.com and got a good deal but would have saved at least 100$ if we had got them from the promo guy in the office. I am ok with the hotel and impressed by the staff. There was loads of restraunts and cheap souvenier places nearby. It seems pretty central to everything. And the internet was great about 1200-1400 kbps day or night from our experience. There are ice machines and laundry facilities 2$ for the washer or dryer. we never locked our belongings and were not missing anything. Having a great time at a low price, and happy to share it with others!", "Date": "April 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "chicago", "Title": "“Nastiest Place Ever!!!”", "Author": "t_marier07", "ReviewID": "UR27264468", "Content": "This is the nastiest place ever!!! It is in a great location that's close to everything, but if you can afford something else, PLEASE DO BY ANY MEANS!!! I have NEVER seen a place this gross IN MY LIFE!!!!! I've been to motels in the ghetto on the southside of Chicago, and still have never seen anything this bad in my life! My son and I broke out in rashes from this hotel, that looked like the chicken pox all over our body! My doctor safetly concluded that we had a reaction to maybe the carpet in the nasty room. I just can't believe that the management allow these units to look this bad. PLEASE TAKE MY ADVICE: DON'T WASTE YOUR MONEY HERE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "April 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Sarasota", "Title": "“jewelry stolen from room”", "Author": "disneyrules", "ReviewID": "UR25257664", "Content": "my family and I stayed there 4 times in 6 months. this last time the bed wasn't changed, the room wasn't vaccuumed, and my jewelry was stolen. The first three times was okay; the location is great and the beds comfortable. The first three times the price was great, but the fouth time they reamed us with all kinds of taxes and surcharges. We even had to pay for the phone which we never even LOOKED at. I'll never go back there again and we have yearly passes to Disney's 4 parks. Boy, did they ever lose a lot of money!", "Date": "February 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3"}, "AuthorLocation": "Boston, MA", "Title": "“Great value for your money”", "Author": "peedog16", "ReviewID": "UR24311322", "Content": "For a $30/night room, we certainly weren't expecting the Ritz. But for what we paid, we were extremely satisfied with our experience at his hotel.Here are the perks: Fridge: In my research, it was hard to find (without an extra fee) a room with a refrigerator--this was very important to us, as we wanted to make/bring lunches with us to Disney. Shuttle: The shuttle, though it made about 20-minutes-worth of stops at other hotels, got us to Disney right when it opened, so no complaints there. It also was there to pick us up after Disney closed. We did end up driving some of the days, just for more flexibility. High-speed:Another great perk. Though the connection was a bit dodgy at night--it didn't always work when we got back from Disney around 11pm--it was great in the AM around 7am. No problems logging in, fast speed, nice to be able to connect with folks back home quickly before we left for the day. Breakfast: The norm: doughnuts, coffee, and OJ. If you get there at 7am when it opens, you get your pick of the litter. No complaints here, and it was a nice bit of fuel to start the day. Area:Lots of eating establishments (nothing upscale) within walking distance should you want to skip the doughnuts or get dinner. Also lots of cheapo gift shops. If we hadn't had a rental car, I think this area would still have been okay for us to walk and find what we needed. Negatives: The room was \"well-loved.\" But again, we got what we paid for. The tub had some rust, wall paint was chipping, the carpet had been warn, and the towels were thin. BUT we really didn't care. We just wanted a place to sleep for 7 hours and keep our sandwiches cool. If you're looking for ambiance, don't stay here. But if you want a great deal and above-average amenities for your buck, this is the place for you.", "Date": "February 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Boca Raton, FL", "Title": "“Get What You Paid For”", "Author": "FrankBocaRaton_FL", "ReviewID": "UR23742153", "Content": "This property is a great example of you get what you pay for. It is one if the least expensive properties in the Orlando Area. It is conveniently located 1 mile outside of Disney. Rooms are basic-very basic. Staff all speak Spanish which might be a plus for some guests. Pool is small but clean. Towels are miniscule in size. Claimed free shuttles to Disney are once a day at inconvenient times. Add the $11/day Disney parking fee to the hotel room fee and it is still a good buy if you are not looking for anything at all upscale. It was an okay place to sleep at night while visiting Disney. Don't expect a lot, but it is great value for the money. Rooms have refrigerator (took 3 calls to get one that was sort of working) and microwaves. Parking is very convenient immediately outside the rooms. \"Free\" breakfast is coffee and some donuts.", "Date": "January 20, 2009"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“horrible”", "Author": "diapunctc", "ReviewID": "UR23495920", "Content": "The exterior is ok and the bathroom look clean at the first site; but the appliances did not work properly (I turned the water on, and then I couldn't turn it off), there was a roach walking and feeling at home in the bathroom. The room looked very old and ...just like a house unsed for a long time. The bed lining was terrible - stains and small pieces of dried food on the blanket, holes in the sheet, a white color that turned to yellow long time ago. Breakfast served from 7 to 9 AM (we found out about this at 9:30Am, of course, but after seeing where we should have had breakfast we realized we did not misss anything! And I got a 1,74$ local phone bill on my invoice, althought we did not use the phone at all (didn't even touch it). (is that suposed to be the tip?)", "Date": "January 12, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Port Charlotte, Florida", "Title": "“Loved the Price and Friendliness of the Staff”", "Author": "BobLC21", "ReviewID": "UR22587485", "Content": "We made a quick trip to spend time with our son and looked for the cheapest place that had decent reviews. We decided on this Knights Inn. We dealt directly with the local Knights Inn office - MAJOR PLUS instead of booking our room through a call center. I hate calling some call center that has no idea what is going on locally. The person behind the desk checked us in efficiently and she gave us a very nice room. We had plenty of storage space, a queen bed, sleeper sofa, high-speed internet in the room (ANOTHER MAJOR PLUS), plus the other usual necessities. Our high-speed internet connection was speedy. We slept well in the bed - the bed was very comfortable. Shower was great - plenty of hot water and water pressure. When we checked out, the person was very friendly. There was always coffee available by the front desk and a continental breakfast in the morning. We'll definately be back!!", "Date": "December 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norhtern Michigan", "Title": "“Very Comfortable Beds”", "Author": "snowbirdwolfy", "ReviewID": "UR22483653", "Content": "Very Comfortable Beds in this clean, large room. We liked the fact you park right outside your room. Great location and an exceptional value. We will be going back for another stay in Feb.", "Date": "December 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boca Raton, FL", "Title": "“Comfort and convenience on a budget”", "Author": "Teatiger", "ReviewID": "UR22327811", "Content": "This Knights Inn is great for a good, clean, comfortable stay at a budget price. The Inn is located a mile from Disney's main entrance road so you can zoom right into the parks easily. They have a tasty breakfast every morning in the lobby of pastry, juice and coffee. If you want to eat out the Inn is within walking distance of IHOP, Shoney's, Sizzler, Golden Corral and other nice restaurants. The staff is friendly and helpful and the rooms are cleaned and supplied with fresh linens and towels each day. You even get a refrigerator, a microwave, a safe, and wireless internet with the price of the room so its a terrific value. The Inn is set back from the main road somewhat so you don't get traffic noise from the highway. Give this Knights Inn a try for a good room at a decent price...we are totally satisfied and plan to stay here again soon.", "Date": "November 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "St. Augustine, FL", "Title": "“More than I expected at a price I could afford”", "Author": "Ethan10175", "ReviewID": "UR22105346", "Content": "I recently had need to spend time in a hotel just outside of Disney World. At first I was nervous about what I would find and how much it would cost..I cannot even describe my pleasure at having found the Knights Inn. Not only were the prices very affordable but the services were excellent. The rooms were comfortable and well stocked and the staff was freindly and helpfull. They even went above and beyond by calling me shortly after check in to make sure I was happy with the room and remind me about the continental breakfast in the morning! I would recomend this Knights Inn to any one vacationing in the Orlando area and I definitly plan on going back.", "Date": "November 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, FL", "Title": "“Great location for the price”", "Author": "butterfly7811", "ReviewID": "UR18688434", "Content": "This is a favorite hotel we always book, why becuause it convieniently close to everything, parks, restaurants, etc. We have stayed here four times and have never had any problems with anything not working. Me and my b/f are not picky travlers. A lot of people are picky and they should stay home if you want comfort for a free price! The hotel managers are nice and friendly. They know our faces the minute we walk in.", "Date": "August 6, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "CT", "Title": "“Awful!”", "Author": "cheetahangel", "ReviewID": "UR18211868", "Content": "This hotel should be torn now! Thankfully we only stayed one night and the minute we walked into our unit we wanted to leave. The bathroom had stains everywhere, the sink knob was broken, all the furniture was very old and falling apart, the light fixtures were uneven and broken, the floor when we walked on it felt like it was going to break because it was very squeaky and it felt like the boards were coming apart, the pillows had stains, and worst of all the front door wouldn't shut!! We did NOT feel safe here. Someone from a few units down slammed their front down and from our unit it sounded like someone kicked our door! The whole room shook and the door came unlocked. Please don't stay here. We only stayed here because it's very close to Disney but there are so many other hotels in the area that I would recommend to stay at . This place is not safe and I left feeling dirty.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Massillon, Ohio", "Title": "“Close to Disney but You Get What You Pay For”", "Author": "Buckeye_Traveller", "ReviewID": "UR17962000", "Content": "My family and I stayed at the Knights Inn Maingate, just west of the main entrance to Walt Disney World (thus \"Maingate\"). The motel is one of the classic (original) Knights Inn designed properties, where you can park at your front door (a plus for us). When I originally booked the motel, I was able to book a room with 2 queen beds for about $50/night during Spring Break. After arriving and checking into our room, we found that there was only 1 bed. After discussing with the front desk, we discovered that the 2nd bed was folded into a cabinet along the wall. When you open the bed out, you cannot get to the bathroom from the first bed without crawling over the 2nd bed. So we opted to change rooms for 2 double beds to avoid the climbing hassle, although I do prefer queen beds. The condition of the room and furniture seemed old and covered over by paint. I stayed in Knights Inns in their beginning days, and this was not the original color of the rooms then. There was a refrigerator and microwave though, which I have not always seen in classic Knights Inn properties. The motel also offered a free continental breakfast, which we never tried due to not getting up early enough. There was also an outdoor pool, but it always seemed to be full of foreign teenagers. We did not have time to try it, due to being at Disney everyday. Here are the pluses: 1. Close to Walt Disney World 2. Very reasonable price per night 3. Park at your door Here the minuses: 1. Not very clean - Needs a quality renovation, not just paint 2. Could hear people in adjacent room when their kids were loud 3. Owner and staff usually were foreigners, who were not always very friendly/polite 4. Awakened on first morning by ticket seller, via phone, from the motel lobby. The motel gives your name and room number to them to try to get you to buy attraction tickets from them. I thought this was very rude. My final take on this motel is that if you need a low cost place to stay close to Walt Disney World, and don't mind a little uncleanliness, this may be the place for you. Personally, I would pay a bit more for a nicer hotel, but have heard that you have to be very careful because a lot of motels/hotels outside of the Disney properties have problems. Thus the reason for reading reviews by everyday people on Trip Advisor!", "Date": "July 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Dump that I believe stole and sold my credit card numbers”", "Author": "lassell", "ReviewID": "UR17162329", "Content": "Walls in room had holes, Hotel clerk on duty was creepy. Place scared my wife and we had to move to another Hotel. Later in the month a bunch of credit card charges started hammering my account. I hadn't used the credit card anywhere for 5-6 months prior to this stay. I've stayed at other Knights Inns with no issues. I'm surprised that the corporation hasn't slammed then closed!", "Date": "June 23, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brandon, Florida", "Title": "“Just terrible! BUGS BUGS BUGS!!!!!”", "Author": "girlscouttroop346", "ReviewID": "UR16750071", "Content": "Me and 30 other girls went to this place as a Girl Scout function. We booked 6 rooms all close to each other. When we first arrived, the place looked just run down and about to fall apart. The lady that came and serviced us had long greasy hair and rugged clothing. When we got into our rooms, every single one of them reeked of smoke and mold, even though the room said no smoking. Our card to the room even had a cirgarette burn on it! The comforter looked like it had never been washed and the carpet never vacumed. In one room we found a large family of German cockaroaches and every room had bed bugs in it! The sheets and matress had holes in it that were definatley not man made! The air conditioning was leaking every where also. Half of the girls were so disgusted by the rooms, that they looked like they were going to cry. The pool, which they had all been looking forward to, was a milky green color. The batrooms were super small and the showers had mildew over them. The furnishing was tacky and terrible. After 30 minutes of being there, everyone unanimously voted to leave and make our trip back home in one night. It was definatley not remodeled like they said. I will never stay in a Knights Inn again.", "Date": "June 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gainseville", "Title": "“Knights Inn West - Perfect for my vaction”", "Author": "RyleThyme", "ReviewID": "UR16387474", "Content": "Knights Inn Maingate West Kissimmee There are mainy reasons why I loved staying at the Knights Inn. First the price was excellent. The staff was patient, friendly and helpful. It seemed like every time I had a problem they would answer either I can help you with that or I can do that for you. The free shuttle to and from disney was very conveint. The free safe and refridgerator in the room were great aids to my vacation. Last the bed was very comfortable. Rhoda Golub", "Date": "May 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Great Value at Knights Inn Maingate”", "Author": "cbpinpal", "ReviewID": "UR15993422", "Content": "My friend and I go to the Orlando area several times a year and had booked a reservation at another hotel where we have stayed a few times before. Coming from Atlanta, Georgia, we had an 8+ hour drive and were delayed by road construction and a short stop that, unfortunately, became a long stop. As a result, we did not arrive in time to claim our reservation and were turned away at 11 p.m. We were driving along Hwy 192 and saw the Knights Inn Maingate's lighted marquee advertising a weekly rate, so we turned in there and were warmly greeted by Cindy who was working reception. After being not-so-nicely turned away from the other hotel, Cindy's kindness was very much appreciated. Cindy explained the savings that the weekly rate offered and we decided to stay there. Both my friend and I are retired and on a budget, so we have stayed at a number of different reasonably-priced hotels in the Kissimmee area over the years. I have to say that the Knights Inn Maingate was the nicest of all of these, and the staff the friendliest. The room was very comfortable and well-kept. All rooms are on one level and we appreciated not having to climb stairs. The complimentary donuts, coffee and juice in the mornings were also very welcome, as many of the other places we have stayed did not offer anything to eat in the morning. Needless to say, we will stay at the Knights Inn Maingate again.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BUFFALO,NY", "Title": "“The Knights Inn Was Great!”", "Author": "ATPDENNIS", "ReviewID": "UR15681320", "Content": ".The Knights Inn of Kissimmee, Fl is in a great location to all of Orlando's attractions. Just minutes from Disney & Universal. Also in walking distance to a large supply of eating establishmnets. The rooms were spacious and neaty kept with a friendly staff .", "Date": "May 5, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "hamilton, nj", "Title": "“nasty, old , mold, ill”", "Author": "1lovecakes", "ReviewID": "UR15067370", "Content": "we booked thru our air lines web site. I couldn't believe how old and nasty this place was. It reminded me of short stay hotels in local towns where you would rather stay on a friends floor before you go there. we did not stay. we checked in with another hotel near by.", "Date": "April 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toronto Ontario, Canada", "Title": "“not great”", "Author": "Dannie14", "ReviewID": "UR14912454", "Content": "Stayed there 7 nights. when we first got there my first impression was that the room hadn't been repainted in many years and the room smelled musty. The bed was clean, but the bottom sheet wasn't a fitted sheet so when you slept on it, it moved and exposed the mattress. Had an earwig in the bathtub the first day, and a small spider later on in the week. Also we were not informed that the roomn would have a joining door to the room next t o us, which had people in it. We had booked a non smoking room, but the guy who had the room with the adjoining door decided to smoke and that's all we could smell. we called the front desk who said they'd call us back but they never did. guy stopped smoking, but next day was smoking in bathroom cauase that's all you could smell. Also on the 2nd last night they were partying next door and thats all you could hear thru the adjoining door. we asked them to stop at 12am and got laughed at. Also our queen size bed we paid for was a double", "Date": "April 9, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "ca.", "Title": "“Stay Anywhere Else”", "Author": "rogersaint", "ReviewID": "UR13756201", "Content": "Knight's Inn - Maingate Kissimmee, Fl. Monday,Feb. 11th 2008 Called for reservation. Quoted $29.95. On arrival price was $47.00. Door wold not lock without manipulating mechanism. Towels were paper thin and rough. Frig didn't work. Beds were uncomfortable. Free breakfast consisted of stale donuts & horrible coffee. Desk clerks were less than civil. Would not stay at any Knight's Inn as I read 5 reviews on 5 properties after this stay and they were all negative.", "Date": "February 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Waterloo, Ontario", "Title": "“Good budget stay”", "Author": "mdrichmond", "ReviewID": "UR13461765", "Content": "This is a budget motel that doesn't try to be aything else. If you have to have five star go elsewhere but for a decent vacation at a very reasonable price this Knights Inn is hard to beat. Good points are : -as stated it is quite well priced -a nice little heated pool -reasonably clean and well kept by Florida standards -friendly staff tried to satisfy us on any requests -great location near Disney with a free shuttle on bus route -at least two dozen restaurants within a ten minute walk and a hundred more in a ten minute drive Not so good : -teeny tiny bath tub -free breakfast is do-nuts, coffee and O.J. -flimsy construction Overall : -good value for what you pay", "Date": "February 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Convenient in every way”", "Author": "Sarah5NewYork", "ReviewID": "UR8015613", "Content": "Pleasantly surprised by excellent price for comfortable room one mile from Disney. I was with three children without a car - the free shuttle was a HUGE lifesaver! My children enjoyed playing in the clean pool and the staff was very helpful. Nice breakfast in the morning kept us going all day. All in all, I would highly recommend this hotel for its convenience and excellent customer service.", "Date": "June 27, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Don't stay here!!”", "Author": "g0pats", "ReviewID": "UR7488064", "Content": "We had a very bad experience during our stay at the Knights Inn Kissimmee. We requested a nonsmoking room but it smelled of smoke. The beds were terribly uncomfortable, didnt have fitted sheets on the matresses exposing many gross stains on the mattresses. The towels were also stained and very thin and worn. Overall, the room was very dirty and housekeeping did not service the rooms very well. Our beds were occasionally made and when they were, a very poor job was done. One of the main reasons we chose this hotel was for the free wireless internet. Apparently, the router was stolen and internet service was not available for our entire stay. When we would ask the staff, they would just keep telling us that it would fixed that day and never was. We were told by the staff to go outside and steal wireless service from the neighboring hotel! I felt the staff was very unprofessional and rude when we voiced our concerns. It definitely ruined my vacation!", "Date": "May 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston, Tx", "Title": "“I loved the location”", "Author": "19954kdz", "ReviewID": "UR7428591", "Content": "We stayed there for 6 days during the Easter weekend and the room was clean, housekeeping always gave us fresh towels and extras when we requested, remote didn't work but that was no big deal considering we were at the Disney parks all day. The room may not have been a 4 star hotel, but it was good enough for me and my family. We got a lot of use out of the mini fridge and microwave. The hotel is by many many food places, stores, about 10 miles from a Super Wal-Mart (which came in handy with my small children), about 15 minutes from the Disney Parks, overall it was a good place to stay. We didn't want to pay a lot for a room that we were hardly going to be in. This room worked out very well for us. We would just get up, get ready, and we were off to the parks all day until closing. It is close enough to all the Disney parks without having to pay the Disney resort prices. Me and family would definitely stay here again.", "Date": "April 24, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Puyallup", "Title": "“Never Again would we stay there!”", "Author": "Briamckenz", "ReviewID": "UR7392664", "Content": "We picked this hotel because it was close to the Disneyworld Entrance, it was a reasonable price(not the lowest or highest) and it offered free transportation to Disneyworld. We learned only after we had paid for our 2 rooms that they only offered 1 time a day to take and 1 time at night to pick up customers from Disney and if there were too many peolpe who wanted a ride back to the hotel, you might be out of luck. We ended up driving ourselves everyday to the park to avoid those problems. We were never offered a remote to the TV for either of our 2 rooms. The room had hair stuck to the walls, places where the sheetrock/paint was coming up from the walls and where the door connected the 2 rooms together there was no carpet. Both refridgerators in the rooms were damaged and painted with spray paint. The rooms had a musty odor. We spent over $500.00 for 2 rooms for 3 days, it may not seem like alot of money to some people but for the bad customer service, horrible room conditions and the hassle of having to drive ourselves not to mention pay for parking at Disney every day. We think it is too much. We would never recommend staying at this hotel.", "Date": "April 19, 2007"}], "HotelInfo": {"Name": "Knights Inn Maingate", "HotelURL": "/ShowUserReviews-g34352-d84794-Reviews-Knights_Inn_Maingate-Kissimmee_Florida.html", "Price": "$29 - $45*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">7475 West Irlo Bronson Memorial Highway</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34746</span></span> </span></span></address>", "HotelID": "84794", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b2/ec/b2ec3fd3d504f6ae1a2e29360020d7514large.jpg"}}