{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "De Leon Springs, Florida", "Title": "“Modest appearance but nice”", "Author": "buffalobob666", "ReviewID": "UR128455792", "Content": "My wife and I stayed for 3 nights while working at a trade show. The room was clean, everything worked, there was a nice flat screen tv, refrigerator and microwave. The room also had a hair dryer,iron, coffee pot and a safe. Housekeeping did a very good job each day and the free breakfast set up in the little restaurant next door was good, with pastries,cereal, waffles, soft boiled eggs and beverages it was above average for a \"continental breakfast\" This is not a fancy place, its not new and shiny, so don't expect a 3 star hotel at these prices. It was comfortable,clean, reasonable and the Sam Sham and the staff were nice. We plan on coming back next year.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanda", "Title": "“I will be back.”", "Author": "Nanacy B", "ReviewID": "UR127872569", "Content": "My family was in Florida last week. Driving about 4 hours from Miami to Orlando visiting Disney for couple days. Arrived Kissimmee searching for a hotel room without reservation. Find Quality Inn & Suites in the coupon book, and checked in. The room is clean and nicely appointed. The breakfast is ok. For the price that we paid, it was a great deal. We will stay at this hotel again on our next trip to Orlando.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Weston super Mare, United Kingdom", "Title": "“A little disappointed!”", "Author": "Trudy W", "ReviewID": "UR127298067", "Content": "My boyfriend & I stayed here for 1 night on our travels round Florida! We choose this one out of the rest on the 192 as it had a lake you could fish in which my boyfriend loved the thought of!!!! BUT.......... it wasnt quite a lake, infact i couldnt see any water!!!! fenced off & locked up, not sure if it was dried up but there were reeds taller than us & no sign of any water!!! Apart from that the hotel was good, clean nicely decorated rooms, comfortable beds, clean linen & towels & a lovely shower. The pool was clean but basic & the jacuzzi was out of order which was a shame!!! Breakfast served in the Indian restaurant joining the hotel was great. Fresh fruit, cerials, toast, coffee & juice, muffins etc. Great as was included in the room price. Would stay here again, nice & clean & great for a limited budget!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Don't do it”", "Author": "IndianaMotherof3", "ReviewID": "UR126934485", "Content": "Choice Hotels messed up our reservations at the Quality Inn where we were supposed to stay so they let us stay here for free... I am just glad we didn't pay for it. We checked in at 2am after our flight landed. The computers were down but the receptionist was ok. He took us to our \"suite\" which was two rooms adjoined. The bathrooms were super gross and only half of the outlets worked in one of the rooms and there was no electricity in the adjoining one! The linens felt like sand paper, carpet was dirty, we didn't sleep under the covers... Tried to sleep with as little body contact as possible!! I made my 3 year year old stand for her \"bath\" because the tub was so disgusting and I didn't want her to sit in it! The pull out couch was broken and our two older kids were halfway on the floor by morning. Shady area in Kissimmee. Breakfast was free but there wasn't much to choose from at all, by the time we got there at 8:30, most of it was gone and it was totally disorganized. We were checked out by 9 and on our way to the original hotel we were supposed to have. The (I think) manager on duty the next morning was nice. I told him about the electrical problem and he seemed \"shocked\" but I kind of think he knew about it ;)", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Pretty good price and customer service”", "Author": "Dayi88", "ReviewID": "UR126121190", "Content": "I rented a room for 4 people and I have to say the room was super clean, and the customer service excellent as well as the price. I stayed 4 days and 3 nights.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Orlando, Florida", "Title": "“Checking in to hell”", "Author": "bigk3224", "ReviewID": "UR125896212", "Content": "Me and my boyfriend came down to Florida for 4 days to visit out friend. We were traveling from Virginia, and after a 13 hour car drive, checked in, and they not only did NOT give us the type of room I had requested, but when I went back to the desk and told him it was wrong, he pretty much said \"too bad\" The room smelled funny, the floor clearly hadn't even been vacuumed and there wasn't even a shower curtain in the shower, which was browning and disgusting. I will NEVER stay with another quality inn, here, or anywhere else. Worst experience of my life", "Date": "March 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Inverness, Florida", "Title": "“good not bad for price they charged and clean”", "Author": "sunshine P", "ReviewID": "UR123493048", "Content": "I rented 2 rooms non smoking at this locations b'se had friends came from colorado to see all amusment parks and etc..I live 45 miles from all these places so we were going back and forth but one day we had to reach early so stayed there . check inn at 10pm, so couldn't take advantage of all other amenities but location was very good, we had 2 rooms and luckily was same as shown on website. very well clean, equipped with hair dryer, coffee pots in room, microwave and refrigerator(clean and no bugs), b'se that's where u find roaches and I AM VERY PICKY ABOUT THAT(most of the places they charge u extra for microwave and fridge but for 54.99+ tax it was all right.) BEDS WERE GOOD, SERVICE WAS all right, LINENEN VERY CLEAN,carpet was clean and looked new to me ( I am a clean FREAK.and I am a manager at one of the Choice Hotels so I know what their standards, what is must and all those stuff )was little disappointed they didn't had toothpaste, brush, deo, etc. which they said if we forget they will have it , but they didn't had . (b'se we decided to stay there once we finished seaworld and disney downtown didn't wanted to go 45-50 miles back not a big deal ) but Walmart supercenter 24/7 is nearby 1 or 2 miles u can get all the basics things which u need . if u need anything at night doors are closed and was lil bit noisy as we were on ground floor so had to call front desk and he took care of them. so that was good part . breakfast area was CLEAN .", "Date": "January 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Very Disappointing...website misrepresents the hotel.”", "Author": "CyndiJR", "ReviewID": "UR122481815", "Content": "Based on the website, we were expecting a nice place for our family to stay while we were in FL. However, the king bed was broken and so was the pull out couch. I complained twice and it was finally fixed the last night of our stay (5 night stay). The playground was fenced off and in bad repair. The hot tub was empty and needed replacing and the pool was filthy. The breakfast was very much \"grab and growl\" to get food. There was no protein offered...just danishes, muffins and cereal. You could stand in a huge line to make a belgium waffle...we did not. The manager was never there. Oh, they claim they have suites. The rooms are just two joined \"motel\" rooms....not real suites!!!!! And there were no Nintendo game units in the kids room. I would never recommend this place to anyone!", "Date": "January 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Essington, PA", "Title": "“YUCK!!! DO NOT STAY!”", "Author": "wendya2J", "ReviewID": "UR119877571", "Content": "Well, we were hoping that a Quality Inn would be basic nice, clean and comfortable. The rate that was advertised on their sign outside was \"unavailable\" when we checked in. We asked for a nonsmoking room - went to the 1st room - opened the door and the smell of smoke wafted out!!! EEKS!! Went to the desk and the very nice night manager gave us another room to check out - it was about 10 doors down maybe. When we went back up the steps to the 2nd room, we were kinda creeped out by a large group of teens/adults standing outside of their room making a lot of noise and smoking (this was right next to the nonsmoking room we tried first). So we went into the 2nd room. It smelled very funky. Went in and went to the bathroom - lets just say the toilet was not cleaned or flushed. Then turned down the covers in the bed and their were stains and hair on the sheets. YUCK! We went back to take our luggage to the car. Where we had to park in the back to get to our room was right in front of someone's house. There were also people sitting on a bench hooting it up between the house and the hotel. Then there were HUGE racoons in the dumpster not far from our car too! EEKS!!!! THe night manager was VERY VERY nice and refunded our money without any question. I was very disappointed in a Quality Inn.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Slough, United Kingdom", "Title": "“REASONABLY PRICED”", "Author": "gap61", "ReviewID": "UR119837924", "Content": "The room we had was spacious and clean and reasonably priced.Initially like some other visitors we had a little trouble with the key card. The outside areas were a little shabby and needed tidying up a bit.Overall ok for a 1 or 2 night stay as breakfast was included in the price.For a meal within walking distance steer clear of TGI Fridays and make the effort to cross the road to dine in the Olive Garden.", "Date": "October 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Disappointing, expected more from a Quality Inn”", "Author": "Alleninaus", "ReviewID": "UR116980205", "Content": "We'd been traveling around the US and generally found the Quality Inns to be of a good standard, reasonably priced. On arrival here however we were disappointed, the rooms looked shabby, small and we felt uncomfortable. As we were there for three nights I asked to be moved to a suite, this turned out to be just two rooms joined by a door. if we had our time again in Kissimee, I'd book another place.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0"}, "AuthorLocation": "Rockford, Illinois", "Title": "“disapointment”", "Author": "Kdenk", "ReviewID": "UR116534953", "Content": "rooms were filthy with bugs. lock on door was broke. does not recommend!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Tampa Bay, Florida", "Title": "“Deceiving photos of actual hotel condition”", "Author": "jojo34219", "ReviewID": "UR116169285", "Content": "Filthy corridors full of spider webs and trash. Almost 30 minutes waiting to make waffles, poorly organized breakfast area, unplugged toasters with no outlets to connect them to. The choice hotels website shows a fully operating hot tub that has not been working for over a year as of this review, if anything it looks like a child trap waiting for someone to fall in there.", "Date": "August 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Terrible DO NOT STAY”", "Author": "smileyman38", "ReviewID": "UR104174922", "Content": "i had a reservation for this hotel i specifically asked aobut a hot tub and pool and they said yes i arrived to find that the hot tub has been out of service for a year and no bothered to tell the reservation people or put it on their website when i contacted the front desk asking for a manager was told one was not available i was angry and raised my voice a bit and at the front desk clerk about my disappointment was told to leave the hotel or they would call the cops and have me forcable removed I contacted the choice hotels 1800 number to register a complained and was told that each hotel is individual owned and operated and they could do anything they wanted in my opinion if this is the case and they can do anything they wanted then why waste money on a complaint dept. so in my own opinion is do not visit this hotel or any hotle using the choice hotel brands they really do not care about customer satisfaction", "Date": "April 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Adirondacks", "Title": "“Nothing like the brochure”", "Author": "sharp43", "ReviewID": "UR97208146", "Content": "Stayed here for 2 nights, got a decent rate. Considering all the other choices in the area we would never stay here again. Small room, not very clean, didn't feel safe in the area. Hot tub was closed for maintenance, from what I could see it needed replacement, not maintenance. The playground area in the back was completely rundown, it looks like it hasn't been used in years! The gazebo near the play area looked like it was about to fall down, the whole back area was overgrown with weeds. Pool area needed lots of work, broken ladder, etc. There was a brochure in the room of the hotel....the pictures must have been taken at least a dozen years ago. I'm sure it was a nice place, once upon a time.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Smiths Falls, Canada", "Title": "“Reasonable Place to Stay”", "Author": "Dickens052", "ReviewID": "UR93807927", "Content": "Check in was quick. Hotel is close to some good restaurants, like the Olive Garden. The hotel room had been refurbished and was clean. The rate was really reasonable with the Roomsaver rate so can't go wrong. The deluxe continental breakfast was just okay but for the price is an added bounus.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Wonderful hotel with wonderful staff”", "Author": "marnie1975", "ReviewID": "UR86008604", "Content": "spent 10 days at hotel with my 8 yr old daughter. Check in was fast and easy. Front end staff professional and accomodating. Upgraded to room with fridge and microwave. Room was older but spotless.Housekeeping daily. Beds were super comfy. Everything worked well inc. airconditioner. Free breakfast was amazing... lots to choose from. Pool was super clean and large. Shuttle to disney was on time although i would rent car due to shuttle stoping at multiple hotels first. I have no complaints about this hotel got it off priceline for $25. Was worth every penny. Will definatly stay again and recommend to anyone in the kissamee area.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brasilia, DF", "Title": "“Bad for alergics and dirty rooms!”", "Author": "rafaelandrezo", "ReviewID": "UR69932295", "Content": "Me and my fianceé came all the way down from Brazil and arrived quite late (4:00am) at this hotel after a 3-hour drive from Miami. The lady at the counter was nice and kind, but that´s the ONLY good thing about this hotel. The rooms´ floor is made of carpet and the carpet is old, stinky, mouldy and VERY dirty. I took off my shoes and a few minutes later the sole of my feet were charcoal black! I mean, I´ve seen this kind of thing in some cheap, roadside motels in Brazil, but I thought I´d never experience something like that in the USA, especially being so close to the Walt Disney World Resorts. We were glad we stayed there for only 3 nights, since we were booked at a far better hotel for the remaining days of our trip. Besides the breakfast was very lame, the juice was bitter, the bread was hard and cold, and only the milk could be drank if you were REALLY hungry. We ended up having breakfast at Krispy Kreme, just a mile down the street. Conclusion: If your idea of a trip to Walt Disney World is saving as much money as you can, and you don´t give a damn about comfort, cleanliness, bad breakfast and sneezing all night long cause the room is mouldy and smelly, then this is the place for you. If not, then stay away! Oh, almost forgot. Not the safest place in the world, since the rooms are facing the street. I mean, anyone could come and break your door and take away your belongings while you´re chatting with Mickey in Magic Kingdom, cause this is a motel-style Hotel and the rooms are a bit far from the reception.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Raleigh", "Title": "“Dirty Rooms”", "Author": "Roy4433", "ReviewID": "UR54519392", "Content": "The carpet in the rooms were real old, it stinks, the air conditioner makes noise. The front desk was friendly, they offered me to change room but it was still the same i did not want to pack all our stuff and move it to another room and still nothing better. The bath room was small, but the breakfast was good", "Date": "January 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Illinois", "Title": "“Perfectly Adequate-But Stay Away From That Hot Tub!!!”", "Author": "brookers528", "ReviewID": "UR50496077", "Content": "My family stayed here just as a filler before we moved to the resort we booked for our vacation. It was fine, I have no complaints or compliments. It was completely adequate for what we needed. Rooms were fine & they were clean. We had to have our door repaired 3 times because it wouldn't read the key cards, but the gentleman who fixed it was nice enough & it was taken care of promptly. There was a continental breakfast that didn't offer much. The food was subpar but acceptable, however it ran out quickly so we ended up getting Krispy Kreme donuts down the street each morning. One big complaint-I don't see how that hot tub passes any kind of safety codes. It is badly deteriorated, so much so that a couple of us ended up with scrapes on our feet or behinds from stepping or sitting on chunks that had chipped off. The worst part was the fiberglass! We were all miserable because we ended up with fiberglass burns. It felt like I had been sitting on old-school fiberglass football bleachers. Ugh, it was horrible. Seriously, don't go near it. You'll regret it. When one of my teenagers was talking about it, I blew her off because I thought she was being dramatic, then I got in myself. If you must go in, don't sit down & don't lean against the sides. Trust me. All in all, it was a fine place. Nothing good, nothing bad. I got a very cheap rate through online bidding. Don't pay much, because there are better places for the same price range in the area. But if you're looking for a quick stop, it's fine. Just don't take a relaxing dip, because it will backfire. (:", "Date": "December 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Pella, IA", "Title": "“I have never stayed in such junky hotel”", "Author": "YuliaPella_IA", "ReviewID": "UR46970119", "Content": "I booked a room online and thought that 2 stars hotel would be ok. When I came in I was in shock. It is an old, dirty, smelly place. I do not understand who rates all these hotels. How this one could be 2 stars??? It is a piece of junk. Terrible.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Clearwater, FL", "Title": "“Don't accept a room in the front!”", "Author": "iamdollie", "ReviewID": "UR29456257", "Content": "We have a handicapped child and were given a room in the front. Delivery drivers from a nearby restaurant use the parking right BY this room for easy in and out access (and are NOT even in a real parking space), so the loud mufflers from the cars kept waking us! One driver even parked right OVER the handicapped stripes next to our space, blocking the wheelchair ramp!!! We finally had to ask to have our room moved to the back of the motel. Tubs don't hold water if you want to soak, either. Beds are bouncy. All noises sound like they're inside your room, not outside. I never could understand why motels don't do better sound-proofing, considering there is GLASS available for windows that do that....", "Date": "May 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Amsterdam", "Title": "“very basic, could be much nicer”", "Author": "Mars061", "ReviewID": "UR26664162", "Content": "We stayed here for 3 nights with a small child. We booked a one bedroom suite. This was big, it used to be two decent size rooms with two bathrooms. The rooms itself were basic. We paid about 68 dollars a night which isn't bad for the size of this suite but in this area are tons of hotels that might be cheaper, especially if you don't need all this space. They do have a pool but it was freezing! They have a hot tub which isn't very hot so what happened was that this (warm) tub became the kiddie pool. So if you came to enjoy the hot tub, you had to take playing children for granted. The hotel has a playground and little beach but it's very run down. They could really make a great place out of it but right now the hotel and surroundings are old and tired looking. Breakfast was very basic and crowded, especially with families going to theme parks, before the bus pick up. The personnel was friendly though and the hotel is surrouned by stores and restaurants and close to the theme parks.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "St Petersburg, FL", "Title": "“Acceptable for only one night!”", "Author": "OldWorldEurope", "ReviewID": "UR26556926", "Content": "We chose this hotel because of the price and proximity to DisneyWorld. I am glad we arrived late in the day and checked out early the next morning. The rooms really need to be remodeled. There are layers and layers of paint on the door frames; they need to be sanded down and redone. There were heavy rust stains in the bathtub around the fixtures. Everything looked worn. It made you wonder what else they were neglecting. If we had planned on staying an entire weekend or a week, I think we would have looked for another hotel. In fact, in less than 2 months, we did go back to Disney, and chose another hotel.", "Date": "March 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Key West, FL", "Title": "“Ok for an overnight!”", "Author": "JM11traveler", "ReviewID": "UR22138859", "Content": "I decided to stay at the Quality Inn & Suites Eastgate because we needed a place to stay in Orlando for an overnight and the price was only $42! The motel is a bit old, we had trouble opening our room door with the room key but maintenance came immediately and helped us! The carpet wasn't really clean,There was no remote control for the television, there was no hot water in the shower and absolutely no water pressure! We didn't complain because we were only going to be there for a few hours to sleep. The beds were ok and the sheets and blanket were clean! The continental breakfast in the morning was poor, its very small, too crowded and not a lot of food, just toast, pastries, juices and coffee. I only recommend this motel if you were going to stay for a short period of time!", "Date": "November 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "No.", "Title": "“Good for spending time outdoors”", "Author": "Cupcaking", "ReviewID": "UR18405112", "Content": "Seeing as this was the only hotel available there, It made me happy. The outdoor pool and Jacuzzi was nice. Extremely small breakfast area where you needed to eat on the floor practically. The power in our room went out once and then we couldn't get into it because the card ID number or something changed. They should have more washing/drying machines because it is hard to get your clothes washed on a long stay. It was pretty quiet.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rockport.IN", "Title": "“Family Fun!!”", "Author": "HarpyMom", "ReviewID": "UR16965879", "Content": "We really enjoyed the stay. The staff was super friendly and helpful. We needed to have items shipped to us & they were a big help in getting them to us. We all enjoyed the lake and pool. The motel is located close to everything yet far enough away to enjoy the quiet. The price was right. Only thing I could change would be to step up the cleaning. It was okay, but the carpent could use a cleaning. When we go back, we'll stay again!", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "north muskegon, michigan", "Title": "“ok, but quite a walk from old town”", "Author": "donjuandemarco", "ReviewID": "UR16214943", "Content": "i was here for spring break and it seemed like a good place if you like silence when you sleep. there is a jet ski rental behind the hotel, but $50.00 seems like a lot for just one hour of riding. it has many restaurants near by, so you will not go without food. if you walk to old town, make sure you have a good pair of walking shoes. its a little ways down the road.", "Date": "May 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Beach Gardens, FL", "Title": "“Perfect for the Price”", "Author": "disneygrl27", "ReviewID": "UR12845081", "Content": "This hotel really shocked us. It was clean, no musty smells as we read in other reviews. It was quiet-we could hear anything outside or in other rooms. The room was immaculate. Very speedy check in. The \"free\" breakfast was a nice idea, but they only had like 6 tables and it was cereal, we chose to spend the 30 bucks and go get a real breakfast. It was great for a one night getaway with the kids especially when we were at the parks all day & just needed to shower & crash. I'd definitely stay here again. Way to go priceline!", "Date": "January 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Reston, Virginia", "Title": "“Pretty good for the money”", "Author": "twoguncharly", "ReviewID": "UR12372203", "Content": "This hotel was priced very low for a room with microwave and small fridge. The room itself was clean and big with two Queen Beds, table and chairs, desk, and cable tv. I only gave it an average rating because there was nothing above average and nothing particularly bad. When I was there the weather was warm and sunny and the pool was icy cold. I was not leaving without a swim and did swim several days. The big hot tub was actually warm, just the temperature I like. Most of the rooms were empty yet when I asked to stay in my room for an extra day they said it was rented out. I checked again on the day I needed and the desk clerk said, no, still being held and I would have to move. I almost made a reservation elsewhere since if I was moving, it might as well have been close to the airport. Then I checked the Internet for the hotel I was in and found that there was a room like mine available. At least when I told the desk this, they did let me stay the additional night. Why all this fooling around is beyond me. i had some problems - the TV did not work when I got into the room, the refrigerator stopped working, and the maids were not good about putting coffee packs in the room. The breakfast was no good - nothing like they picture it and the room is dreary. No healthy food either. If you skip it you really lose nothing. Still, I do say that you probably will find the place OK for a short stay (I was there a week). Just do not be expecting a really nice Comfort Suites type of Choice Hotel. Also, be sure you get the right rate as listed on the Choice Hotel Web site. I've seen people come to the desk at more than one Choice Hotel and pay the highest rate when they obviously could have a lower rate.", "Date": "January 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Quality value”", "Author": "ELCHEAPEE", "ReviewID": "UR10867422", "Content": "Had two bedroom king suite paid $95 for first night and then came back a paid $103 for another 3 nights - big suite with big rooms, average bathrooms, lots pillows on bed, nice white bedding, lots of towels, comfy beds, fairly quiet, nice pool, breakfest is pretty good with waffles, cereal, toast, danish, cinnabon, muffins, hard boiled eggs, yogurt, canned peaches, apples & oranges, juice, and coffee. Hotel is under renovations, as elevators and some parts of the outside looks dumpy. Renos should be complete by mid december. Had some problems with first check in as key lock would not work, move to another room where bathroom ceiling leak water, and move to another room, gave us 50% off for our troubles for first night. Despite early troubles, we returned for another 3 nights because the rooms were newly renovated and very nice. Great location if you have a car to drive to disney - parking at disney is $11. Bad thing - $2.50 per day safe charge (even if you dont use it) and time share presentation ($90 credit per couple if you choose to go). They will not sell you disney tickets if you dont go to time share presentation. 24hr walmart sells disney tickets (min 3 day tickets) at discount. Walmart and Super Target carries good selection of cheap Disney souveniers. Also Disney Resort outlet located at prime outlet for more cheap souveniers.", "Date": "November 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "gm590307", "Title": "“BUdget Friendly Quality Hotel”", "Author": "gm590307", "ReviewID": "UR10853565", "Content": "The hotel is fine! Any bad reviews are just angry people with one little problem!!! The hotel is just what you pay for. It is affordable and the rooms are nice. Big bathroom!!!! The hotel allowed us to check in 3 hours early and check out 3 hours late at no additional cost. He wasnt supposed to do it but that is what they are there for. Transportation to the atrractions is VERY LIMITED!!! One bus goes to the each park once a day and returns only once a day and much after the parks close. Public transportation is great if you dont have a car. Busses run right infront of the hotel and run every 20 min or so. Suggested to take bus route 56 to Disney, it runs all day and you dont have to wait for the other bus. DONT ASK HOTEL STAFF TO GET YOU A TAXI!!! Also dont use taxis, they rip you off and take you way out of the way! Overpriced!!!! All in all was a nice hotel. Hot tub wasnt on! Pool was nice! This is the hotel to choose if you want to stay for cheep!", "Date": "November 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sunshine State", "Title": "“Lousy, Dirty, Terrible Customer Service Not A Resort”", "Author": "Bigbroad555", "ReviewID": "UR8220909", "Content": "My family and I stayed here for one night and let me tell you it was horrible. Let me tell you there are 2 different Quality Inns before this and they look excellent compared to this place. They also have a sign AAA Five Start Hotel Resort well it is not no 5 star nor is it a RESORT. The first room we checked into on the 15th had a spider and bugs all over it. My husband went to get some soda and snacks he didn't get to see the bugs. I called down to the person up front and they told us they would being a key to us for another room. We waited for my husband my sister inlaw and I and my 8 year old daughter. We decided we wanted to check out and leave and go to another hotel, when we went downstairs the lady was very nasty with us and told us \"I don't know what you did in that room so I can't refund your money.\" we were stuck in this motel for the night. They did give us another room that still had bugs I got bit . In the morning about 9am the cleaning lady tried to come through the door while we were still in bed. We had the door locked and she still tried to come in. No apologies. At first when we tried to check out they were not going to give us any refund but I think because we were starting to get un patient they gave us back half the room rate. NOT A RESORT save your money , Pictures are not what this seems to be.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Average”", "Author": "travelus73", "ReviewID": "UR7655076", "Content": "The hotel was quiet and had a nice pool area. On the other hand the continental breakfast was inadequate and the rooms had a bad odor to them. I would look elsewhere.", "Date": "May 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Warsaw, North Carolina", "Title": "“the suite was not sweet”", "Author": "maezell", "ReviewID": "UR7540750", "Content": "We thought we were getting a two bedroom suite with a kitchen and 2 baths. What we got was two rooms, one with two double beds in it and the other room had a small pull out couch with a small table, small fridge and microwave. These rooms were to accomodate 4 teenage girls and 2 adults. Teenages were running rampart all times of the night banging on doors. The free shuttle from the hotel to disney really sucked. They picked us up a hour later than they were supposed to and when we tried to call no one answered the phone. I will never spend another night in a Quality Inn /Suites.", "Date": "May 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Good for the money”", "Author": "BklynMom2", "ReviewID": "UR7330293", "Content": "Stayed April 4th-April 7th On a very last minute trip to Disney, I booked this hotel at $65 gov rate. We are a family of 4 (2 little boys) and had a standard double room - all suites were sold out. Ok, this is a budget, family motel. If you are expecting more you will be VERY upset. The room was typical of the Kissimmee area 192 strip - very old and housekeeping could have been better. The beds were old and hard, TV worked, they had a coffee pot (didnt use it) and towels were clean but so old that they were paper thin. Found an old pair of socks??? From previous guest???? We had room #309 right by the COLD Jacuzzi??? Swimming pool was not heated but clean and did get crowded. There is a small playground and Jet Ski rental on the property. Also a game room and laundry room. We did not eat their free Breakfast which consisted of the usual make your own waffles, etc. The staff was very nice (young kids) and eager to help. Hotel right in the middle of everything and 2 miles from Disney. All in all this place was worth the $65 not a penny more, but I knew this coming in. I would not stay here again if I could help it. This is a last resort, but, it does serve the purpose!!!! Its an old budget motel.", "Date": "April 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“Couldn't fault it!!”", "Author": "StaceyE1984", "ReviewID": "UR5968733", "Content": "Stayed in this hotel from 29th sept - 13th oct and what can I say!! What a fantastic budget hotel! I honestly cannot fault it. The room was cleaned every day, clean sheets every other day, toiletries supplies, fresh towels every day, it was just fantastic.The reception staff couldn't have been more friendly. The breakfast was very basic, but what do you expect, you do get it free after all!! The swimming pool was a little on the small side, but there was never anyone in it, so was great for just the 2 of us. Also the jucuzzi was brill, just like stepping into a hot bath! Hotel is about a 10 minute drive to all the disney parksand about 20 mins to universal studios. There were lots of places to eat around the hotel and lots of gift shops. The room service is Domino's pizza which was great! Overall we had a fantastic stay at this hotel, don't be put off by other reviews, give it ago and find out for yourself what a great hotel this really is!", "Date": "October 18, 2006"}], "HotelInfo": {"Name": "Quality Inn & Suites Eastgate", "HotelURL": "/ShowUserReviews-g34352-d84808-Reviews-Quality_Inn_Suites_Eastgate-Kissimmee_Florida.html", "Price": "$45 - $79*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4960 West Irlo Bronson Highway</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34746</span></span> </span></span></address>", "HotelID": "84808", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6c/54/6c5499c648a9d579ae30d7f0e29ad6e84large.jpg"}}