{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ft. Collins, CO", "Title": "“Nice, centrally located jumping off point”", "Author": "madonerider", "ReviewID": "UR128332616", "Content": "My significant other and I just spent a week at the Parkway International Resort. This was a last minute trade of my time share through Interval International. The resort is in a nice location, and, for us anyway, was a good location, located close to Interstate 4 for the things that we did - which didn't include Disney World - although it is very close should that be on someone's agenda. It's a nice trip to Tampa/Clearwater Beach (westbound), and the Kennedy Space Center/Cocoa Beach (eastbound), as well as being close to Celebration, FL. (The Disney planned community - think the Jim Carrey movie \"Truman\"). Parkway is not a destination resort. That being said, we found that the staff was pretty helpful and mostly very friendly. The condo itself was nice and comfortable, and the unit that we stayed in backed up to the forested area between the Parkway Resort and the Vacation Villages. It was quiet, and the screened in patio allowed us to eat all of our meals outside, watch the birds, squirrels, geckos, snails, and listen to other birds and frogs. The pool was more than adequate, and during our time there, not very crowded. However, the food at the Kenya Kafe -which is at the pool - left a little to be desired (not a great variety and nothing truly healthy), but under the circumstances, it wasn't too bad. The little walkways through the forested areas were very pleasant, and there was a little educational material, and one leads to a strip mall with a few restaurants. The down side: these are really minimal. The fitness room left a lot to be desired. The weight machine is a piece of junk. Clearly the room was created as an after thought, and all of the equipment was stuffed into a very small space. The condo itself could use better lighting. While they were using flourescent lights - this is good - they could still use higher wattage. The low wattage and some of the dark colors left the condo a little dark. The frig (at least in our unit) should have the door reversed (and it can be done - it is built for that change) so that you can get into it without having to step into the laundry room in order to open the door and remove things. The Wi-Fi internet access is expensive. Really this should be free. I am really! The resort could use a good recycling program. Maybe recycling is not that big in Florida, but we had a great deal of recyclable materials from the grocery store, and I don't think that any of it will be recycled. (I hope that I'm wrong - and I admit I didn't ask). This could be simply accomplished management! Would I stay there again? Possibly, depending on what I wanted to do in central Florida. I'd call this a 3 star.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maple Grove", "Title": "“Awesome 10 Night Stay”", "Author": "karen45", "ReviewID": "UR127205038", "Content": "We checked in on Thursday, March 22nd and stayed for 10 nights in Nairobi 308. I had called a couple of months ahead of time with 3 requests: a renovated room, a room on the top floor (we were burned a couple of times with kids running in rooms above us at other timeshares), and the type of room where the toilet area was in its own room. We received all three plus we were put in a room where the pool was just out our back door! Maybe because we checked in on a Thursday afternoon we had no one ask us about a timeshare presentation? We did receive a phone message and a notice about it but we ignored both of them with no problems at all. We were very pleased with our unit -- the photos posted by others are exactly what you will have. Thanks to other reviews I brought a small shower caddy as I knew there would not be anywhere to place things in the shower. Everything was in working order and the screened porch was a great place to dry swimwear and pool towels. The only thing I found strange is that there was not a door seperating the master bedroom and the master bathroom so whoever got up first woke up the late sleeper! The location cannot be beat! Very close to Disney, not too far to Universal and TONS of restaurants very near by. There is a Target store a couple of miles away and we took advantage of it several times. We usually do not spend a lot of time at a pool (too busy on rides) but after one trip to the pool at Parkway we were hooked! The water was very refreshing and there were plenty of places to sit by the pool. We did not try the Kenya Kafe but the food looked good. The washer/dryer in the unit was great--for once I did not bring 3 suitcases of dirty laundry home! We would throw towels in and run the washer in the morning before we left for the parks and then threw them in the dryer at night. I love not having to worry about people entering our unit and making our own beds is not a big deal...I mean does it take more than 3 minutes? We did use the oven to reheat some leftover pizza and we used the toaster but other than that there was no cooking done in our unit :) !! We had plenty of space to spread out and the 3 tv's were great (I'm not a big basketball fan and 24/7 ESPN is not my style). The two tv's in the bedrooms are a tad bit older but no big deal. I did not go on vacation to watch tv!! I also appreciated the tile floors throughout the unit (except for the bedrooms) as I feel it is much cleaner. The beds were really comfortable and we slept like logs. Others complained about the noisy airconditioner outside the 2nd bedroom but my daughter likes white noise and this lulled her to sleep every night. My wishes for this condo? A nightstand in the master bedroom please. I made do by bringing a stool from the kitchen counter into the bedroom. A list of \"to do's\" for checking out -- I had to ask what they wanted us to do. A printer in the room that housed computers would be great too. The front desk people were super nice and let us print our boarding passes there. The area is very nice and not as sketchy as some areas of Kissimmee. Can't wait for more vacation time in Florida and we will definately be back!!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“stayed there in Dec of 2010 and LOVED it”", "Author": "heather h", "ReviewID": "UR126811148", "Content": "this place was awesome..we checked in at night and were so tired from driving all the way from Michigan to Florida and the motel we stayed at the following night was just plain nasty..this place exceeded our expectations..it was a beautiful 2 bedroom with 2 bathrooms with a jetted tub in the master bedroom with a separate shower and a private balcony entrance from our bedroom..the other bedroom had two beds and a pull out couch..only complaint was the pull out couch was not comfortable at all. it was close to the main strip of stores and restaurants and the kitchen is fully stocked so making breakfast there saved us a lot of money. the grounds were beautiful and the scenic trail bridge was playing cool music as you walked..had a pool and a hot tub and a bar..the bar wasn't open though in DEC..we didn't get a chance to swim because it was still a bit cold outside and we were to busy at universal..this is a timeshare and they do ask you to take there tour but we just opted out of it and never felt pressured..the jetted tub was awesome after a long day at the parks.i was pregnant and my feet were killing me and this was the perfect end to the night..the price was great too..this place is a total GEM ..go there and you will NOT be disappointed", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hedgesville, West Virginia", "Title": "“been going for 12 years”", "Author": "mary v", "ReviewID": "UR126534081", "Content": "We are actually owners here and look forward to coming every year. The front desk has always been wonderful. The rooms have always been spotless. The \"boardwalk\" walking trail has always been a favorite. Not crazy about the timeshare presentations, but that's just Orlando. We usually go to them to get heavy discounts on attraction tickets. It's a couple of hours, but hey- you can always say no. The grounds are beautiful, and the resort is close to EVERYTHING. Great place. Going back for two weeks in June 2012.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Okawville, Illinois", "Title": "“Don't show up after dark”", "Author": "coolecg", "ReviewID": "UR125868498", "Content": "We arrived after dark. There are speed bumps leading up to the resort that are not visible until you ;hit them even though the road is a public roadway. Check in was easy, we were told where our room way. Carried luggage up to the third floor and found the key access would not work because it was the back door. Carried everything back down and around and back up again. There is no markings on the curb and my husband and I both fell off the curb in the dark due to the poor lighting. Rooms were clean.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna, VA", "Title": "“Very Nice Timeshare Facility”", "Author": "hoos90", "ReviewID": "UR125647369", "Content": "We stayed in a 2 bedroom that was very spacious. Only complaints would be that the kitchen is not well stocked, and the master bath only had a very tiny sink area, with very little room to put your things other than around the large tub. The resort is in a great location to get places around Orlando. We actually visited Legoland, which is about a 40 minute drive away.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fairfax VA", "Title": "“A Nice Place to Stay”", "Author": "PittsburghGeese", "ReviewID": "UR125175946", "Content": "We spent a week at Parkway International and had a wonderful time. We had a two bedroom condo overlooking the pool. Though the property shows some signs of age, it is well maintained and the staff couldn't be friendlier. The pool area was a very pleasant place to spend time and the pool bar was adequate, staffed by two wonderful bartenders.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Muncie, Indiana", "Title": "“Great Location”", "Author": "howic304", "ReviewID": "UR124478142", "Content": "The Parkway was nicely tucked away from 192. It was quiet, but still close to everything you would need. Check in was easy and quick. The room itself was quite spacious. The safari decor is a bit dated, but that did not really detract from the experience. We enjoyed eating breakfast on the screened in porch every morning even if there was no view. The kitchen was an added benefit. Beware of guest services. They kept pestering us with free gift offers and the VIP breakfast. It was a timeshare pitch, but you do get paid to be there. If you can waste 3 hours of a day, it might be worth it.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Superb”", "Author": "Sunworshipper28", "ReviewID": "UR123656351", "Content": "Have stayed at this accomodation twice now and will be there once again at Easter 2012 and have to say this accomodation is superb. From the spacious rooms to the front desk...just wish they would not pass me over to the Time share before giving me the parking pass..but that has never been real hard sell", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "winnipeg", "Title": "“Never Disappointed!”", "Author": "MsBeaton", "ReviewID": "UR123341810", "Content": "Our family has made visiting parkway in orlando a tradition over the years. Simply put, we are never disappointed in the accomodations, the staff at the front is always friendly and accomodating and enjoy answering any questions. I have since recommended parkway to 2 other families from our home town that I knew where travelling to the kissimmee area and they too were pleasantly surprised with their reservation at parkway. Unlike other reviews we have never experienced any problems with bugs or pests, we have always found the bedding to be comfortable, rooms cleanly, kitchens supplied with adequate utensils, and specific requests adhered to whether it be for more towels or toilet paper, it is always accomodated without incident. Those who complain that this condo complex is not up to par are those who are looking for a 5 star accomodation without paying the 5 star price. Well surprise Parkway is a 3/4 star accomodation and they make no secret of this and they provide exactly this and beyond in my opinion. As far as I am concerned parkway exceeds many 3 stars I have stayed at and the price is always right. Finally parkway international is ideally located to the interstate highway which will direct you to all parks, it is conveniently located near many shopping venues, restaurants, etc. It is a quiet area perfect for families who want to come home after the hustle and bustle of a disney park and just relax. As earlier stated....NEVER DISAPPOINTED with parkway.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ontario canada", "Title": "“week 51 for rent or exchange or for sale, 20 years owner”", "Author": "norman h", "ReviewID": "UR123069747", "Content": "we have owned there for almost 20 years, 1992 to 2012 and have stayed there 20 times, our family has out grown florida. yes it is 20+ years old, but upgrades and or replacements are done on a timely schedule. I have had no problems at all, I find the staff friendly helpful and courteous, the rooms have always been ready when checking in. If I needed anything, it was dealt with in a timely manner. They even have 24 hour security, they have never had any problems, and that's the way they want it to be, so you can feel safe, like staying at home. I would recommend this resort with no hestitations. I use tripadvisor all the time, and the poor and very poor comments, for most resorts, are usually the people you can't please at all, regardless of how hard you try. There are exceptions to everything, but you treat someone with respect you use get treated the same way. as far as time share tours with any resort, just tell \"no thanks\" inquires at puzzlecollector2 at yahoo dot ca", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooksville, Florida", "Title": "“I want to go back”", "Author": "DRMacKay", "ReviewID": "UR122315111", "Content": "We have definitely found the place to stay from now on. My husband and I absolutely loved this place. The price was right and the location of the resort is perfect if you plan to go to Disney, however, it is not close to Universal Studios. We took time to walk to the Starbucks that is open 24 hours, IHop, CVS, Wendy’s and many other stores/restaurants. You could also walk to the Arabian Knights dinner theater. We were so impressed with the huge size of the rooms and the cleanliness. We felt like we were staying in an apartment. We felt so at home and the beds were extremely comfortable. I loved having the large kitchen. The staff and front desk were pleasant and helpful. The theme and décor was fantastic. We felt like we were in an African jungle which was an awesome feel. I can’t say enough good things about our visit to Parkway International. We didn’t have any issues during our stay. My only regret is that we couldn’t stay longer. We will be coming back soon and plan to stay longer. We opted out of the tour/free breakfast offer. My only suggestion is that they consider offering WiFi for free.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester, Virginia", "Title": "“Fantastic, Kissimmee's best kept secret!!!”", "Author": "vab300m", "ReviewID": "UR121326950", "Content": "Just returned from a 8 day stay and absolutely loved it. Parkway International Resort is a great place to stay if you want a great price and close to disney attractions, places to eat and other smaller attractions, its right in the heart of things. Its just like a small apartment with a kitchen, 2 bedrooms, 2 bathrooms, washer and dryer, dining area, living room and balcony. We had an issue with the jet tub in the master not holing in the water but a quick call to the front desk and 5 minutes time someone came to fix it. Thanks Parkway International for a great stay, I've found a home away from home!!!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Morristown, NJ", "Title": "“Suggestions for this resort”", "Author": "GinnydMorristown_NJ", "ReviewID": "UR121249208", "Content": "Parkway International Resort is a great place to stay in the Disney World area, however I know management reads these reviews, so I have a few suggestions. WiFi should be offered free of charge, ($30.00 per week), and local phone calls should be free of charge (.87 per call), The smaller bathroom could use a couple of towel rods to hang towels to dry. Lighting in the small bedroom is very dim and the room is a bit stuffy, so a ceiling fan and light like the one in the master bedroom would be a welcome addition. Live music and Kareoke at the pool were entertaining, Kenya Kafe food could be improved. All the staff were friendly and helpful. Other than that, we agree with all the other positive reviews of this resort.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Beautiful Unit, Grounds and Location”", "Author": "stb501", "ReviewID": "UR120710810", "Content": "The Parkway International Resort provides living units with kitchens and bedrooms. The unit has its own washer and dryer. The back of my unit opened up to a wooded area with tennis courts. There were both front and back doors and a screened in patio. The development shares a nature preserve with the next development. There was a jetted tub in the master bathroom. Everything was kept up well. You are close to grocery stores, restaurants, and the quaint town of Celebration. Great place!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Solihull, United Kingdom", "Title": "“Great Value stay”", "Author": "karensolihull", "ReviewID": "UR120561430", "Content": "Spent 4 nights at the Parkway after reading Trip Advisor reviews and really glad we did. Location is great, we walked to Arabian Nights and it was only a 20 min stroll up to Logans, Joe's Crab shack and Mulligans bar in the Watertower which we really enjoyed. Easy to park and the outside of the building was nice, only thing was that it was a little dark in the evening but we still felt safe and secure - they had security staff too. Check in was really pleasant and they put us in a conda right overlooking the pool in the centre of the resort. We loved the room and could have stayed a lot longer - it was a home from home! 2 lovely bedrooms, both with their own bathroom and a huge kitchen and lounge area. Pool was nice and clean - my only issue was the really loud live music and karaoke on there. We didnt enjoy it but I'm sure other people would do so we kept in the far end of the pool area which was a little quieter Overall it was great value for money and we would definately stay again", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Just book it! We couldn't recommend it enough.”", "Author": "Char3238", "ReviewID": "UR120428279", "Content": "We have just returned from our holiday having stayed at the Parkway for the first time and honestly we wish we had found this place sooner. We stayed in the Congo block and had a view over the pool area. The apartment was spacious clean and has all the mod cons including a jacuzzi bath! The pool area was spotless and the hot tub was indeed hot and lovely! The staff were great and you couldn't get much closer to Disney without staying on site. Value for money for sure. Ok so the decor is not to everyone's taste but we will be back without a doubt. Thank you Parkway for a wonderful stay.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Athens, Georgia", "Title": "“Very pleasant stay!”", "Author": "Chad C", "ReviewID": "UR120286293", "Content": "Our stay at the resort was great. Everything seems to be newly painted and looks awesome. Our suite was very spacious and just above the pool. We did get the timeshare sales pitch but it was avoidable. We chose to do it because there was a free meal and cheap tickets to Arabian Nights available. A couple of hours of goofing off trying to make the salesman feel awkward was totally worth the payoff. Beyond that experience, our time here was great. No bugs as others have mentioned. The beds weren't the most comfortable but then again, any bed that isn't YOUR bed never lives up. We would DEFINITELY stay again. Great Value! Friendly staff!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philly, PA", "Title": "“Quiet, sylvan setting away from the Disney World bustle.”", "Author": "Mom3girls", "ReviewID": "UR120249045", "Content": "The only negatives I have about the place are 1, the wifi isn’t free (but it is only $30/week for up to 3 laptops); 2, accessibility - there’s no elevator, very few handicap parking and curb cuts; Idk if there are accessible rooms; I can tell you that having the two scooters in the room all week was a little cumbersome; I assumed that with only the 2 of us, we’d be able to keep the scooters in the 2nd bedroom, but neither of us were able to maneuver them into that room – the awkward placement of the 2nd bathroom prevented that -- so I’m not sure how a wheelchair would fare); and 3, that there’s only one phone in the entire unit. There also were no grab bars around the tubs/showers, and I had to request a rubber tub mat because their floors are slippery. Those are minor, though. The positives are everything else! The resort is next to the Arabian Nights dinner show, and well set-back from Rte. 192/Irlo Bronson Memorial Highway, and easy to get to and from DW, I-4, I-Drive, etc. It’s a short drive to area attractions; and the resort itself is beautiful, serene and quiet with pretty and consistent themeing throughout, and ALL the units are 2-bedrooms and 2-bathrooms. The suite itself: If you can, imagine the general layout as two large rectangles side-by-side – the bedrooms/bathrooms/lanai to the left, the living room/ kitchen/ laundry on the right. You enter into a small foyer/corridor; to your left is the smaller bedroom and bathroom; to your right is a small coat closet. You walk into the short corridor a few feet; the kitchen and laundry nook on your right, l/r in front of you, and master bedroom/bath to your left. The smaller bedroom contains two single (twin) beds with a storage nightstand between them, with a lamp; also a t.v./storage armoire and a closet. The 2nd bathroom is split. First you come to the mirrored vanity/sink with storage cabinets/drawers beneath; to the left of that (behind the smaller bedroom) is the smaller room with the commode and shower/tub, with a small nook with a few built-in shelves. The master bedroom contains a K bed with 2 storage-nightstands, and a t.v. and storage armoire. The master bathroom contains a whirlpool tub, commode, separate stall shower w/ a door, and a large mirrored vanity/sink with storage cabinets and drawers below. The beds were heavenly. We do not like soft mattresses, and these were just a little softer than what we have at home, very comfortable for both of us. I’m not thrilled with the soft pillows, but I’ve come to expect them at hotels so I just deal with them. Tip: I’ve learned that we like dark rooms, and that most hotel drapes do not close completely, so I’ve learned to pack a few binder-clips to solve this problem. A bonus is that the clips can also be used as snack-bag clips ;). To the right is the fully-equipped kitchen: full-size fridge with ice-maker, smooth cooktop/electric oven, m/w, d/w, toaster, blender, double-sink with sprayer, and fire extinguisher (you never know …). Basic cooking needs: set of pots/pans and cooking utensils, glass measurer and measuring spoons, corkscrew, ice bucket, can opener, cutting board, and a set of knives in a block. Also there were 3 oven-proof and m/w-able glass baking pans, two rectangular and one round with a lid, dishes and lots of glassware for dining, as well as dining utensils, a 2-qt. pitcher and four placemats. The phone is also in the kitchen. There is a breakfast counter with two stools, plus a large dining table with four chairs. (There are also several artificial floral arrangements in the suite, and a statue of a tiger on top of the l/r entertainment armoire!) In the back of the kitchen (which would also be behind the entry door) is the laundry nook which contains a stacked washer and dryer. As with other timeshares, you get a starter-pack when you check-in (several rolls of bathroom tissue, facial tissues, hand soap, bath, hand towels and washcloths; a kitchen towel and dishcloth, 2 potholders, a sponge, dish detergent for hand-washing dishes, 2 packs of d/w detergent, a roll of paper towels, 2 packets of laundry detergent, and 6 pool towels. If you need more of anything, you just call the front desk and they send it right over. I requested a rubber tub-mat around 9:30 the first night and it arrived within 20 minutes. (I’m assuming this is a positive indication of the level of service; we had no other service needs other than internet issues, which are handled by an outside company.) They also give you an option for fresh towels. You can launder them in your suite as needed, and/or you can opt for a towel exchange mid-week. If you choose the towel exchange, you can further opt to have your towels exchanged at their convenience (meaning they may need to enter your suite while you are out) or at your own! If you forget to fill out this form (which is in your suite at check-in), you are on your own for towel issues lol. We opted to wash our own, in their washer/dryer, using their detergent and hot water too, not too difficult a chore. In the l/r are a queen-sized sofa (that can be opened up for another bed), an easy chair and ottoman, two end tables and a coffee table, and an entertainment armoire that contains a flat-screen TV. and a DVD player (movies can be rented from the office but at $6-something, I’d skip them); there is loads of storage in this piece, and on each side of this piece of furniture are end-table type ledges as well. At the far end of the L/R is the exit door to the rear; there is a small patio-type space right outside the doors, and there are board walkways throughout the rear of the resort; leading to the office, the pool, other buildings, and there is a nature trail as well! To your left is a door leading to a screened lanai (on the 2nd floor, this would be a balcony) with a patio set (table and four chairs). Dh loved this space. He used it to set up our Halloween decorations – a ginormous inflatable Mickey-Pumpkin, two strings of lighted (small) Mickey-pumpkins, a Disney garland, and small lighted Mickey-ghost and Mickey-pumpkin statuettes. People passing by loved it, especially kids lol. Other notes re. the rooms: if you request a unit in buildings A, B, or D, you’ll be less than a half-block walk to the pool. Also, the theme is “rustic resort” and like Disney’s Fort Wilderness Lodge and Animal Kingdom Lodge buildings, with their (appropriate) darker colored motifs and surrounding lush foliage, makes for more dimly-lit rooms. The suite, and in fact the entire resort as well, were clean throughout, and very well kept/maintained. We did visit the pool one afternoon, but it wasn’t quite warm enough to stay in long; we then moved over to the hot tub which was better! Tip: by 3:00 p.m., the pool becomes mostly shaded, so you may feel chilly when exiting the water (depending on when you visit, of course). We came here on an Interval International Getaway (timeshare exchange company), but even if we’d exchanged, I think this is an excellent resort and a great value; I would not hesitate to stay here again. BTW, if you’re going to stay at timeshare resorts, you have to realize that they do not offer daily maid service (some provide it for an extra fee); also you will be solicited to attend a presentation to invite your ownership in the resort you are staying at. However they usually offer you some kind of remuneration for your time – a gift card, show or park tickets, a meal, discounts, or even cold hard cash. If you do not want to participate in this, you simply just tell the solicitor such when approached. Timeshare solicitors also have kiosks throughout the Orlando and Kissimmee areas, at restaurants, malls, etc. I didn't post any pictures of my own because the pictures on the resort's website are better and more importantly, are an accurate depiction of the resort itself.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hawaii", "Title": "“Loved staying at Parkway International!”", "Author": "lisale", "ReviewID": "UR120048998", "Content": "We stayed 11 nights at the Parkway International in early October. It was a really nice timeshare condo, complete with kitchen and stack washer/dryer. Spacious living room, very comfortable beds (king size in the master bedroom, 2 twins in the 2nd bedroom), jacuzzi tub (wow!) in master bath, clean carpets, nicely kept grounds. Staff at check-in were very nice. Ample parking. Lighting in the parking lots at night could be brighter, but it wasn't bad. Great location - very close to the highway onramps, very close to the roads that take you to all the Disney parks. Lots of restaurants and gift shops along Irlo Bronson. Sea World and Universal Studios parks were very close. Busch Gardens Tampa was about an hour drive away (worth the trip!). We loved everything about the Parkway and would gladly stay there again! We were informed of timeshare presentation meetings, but there was no pressure to attend them. Also, if you want maid service, you just schedule it with the front desk. They charge a fee for it (about $30?). Otherwise, this place is just like home, but nicer!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Middletown, New Jersey", "Title": "“Excellent!!”", "Author": "CKNJ", "ReviewID": "UR119717582", "Content": "Just got back from a 6 day stay with my family. Absoulety loved it!. We were in the Serengeti building, across from pool/check in area. The room was clean and smelled wonderful. It was very spacious, and we loved the backdoor area, and screened in back porch. The only negative we could find was that the master bed was a bit hard for our liking, but we dealt with it. We had a tripped outlet for the hairdryer one morning and maitenence came out within 3 mins to fix it! The pool area is awesome. Not too big, and not too small. It wasnt crowded at all, and there was plenty of chairs to go around. My daughter loved the playground area as well! They did not hassle us about timeshare at all (we inquired and we found out later they didnt have any units available). We will booking next years vacation with them as well!! Very happy with everything!! oh and i didnt see any cockroaches :)", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Beautiful”", "Author": "Handymanwife", "ReviewID": "UR118799072", "Content": "Our family of 7 (5 adults, 1 teenager and 1 three year old) just got back from a week in Orlando. We stayed at Parkway Int'l and enjoyed it very much. We found the rooms clean and very pretty. The pool area and grounds around the resort were exceptional. The staff was very helpfull whenever we needed anything. The resort is also within a few minutes of the theme parks. There are three floors but no elevators. We were on the 2nd floor and did not find it to be a problem at all. We will definitely be coming back to this place.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Pleasant Surprise!”", "Author": "rmilagros", "ReviewID": "UR118573751", "Content": "We just got back from our 7-day stay at Parkway International. I must say that we were a little concerned due to some of the reviews that we read prior to arriving. However, I must say we were very pleased with our room, service and customer service (with the execption of one person). Our check-in was great and so was our check out. No roaches (one Palmetto Bug in the living room; make sure to not keep your door open for long periods of time), DB got rid of it and that was the end of it. We did have tons of \"love bugs\", but they are in season right now all over Florida. Rooms were spacious, clean, and we were very happy. Our first night there we hung out at Kenya Cafe, go hang out with Greg & Norm, these guys will hook you up with some serious drinks and maybe even surprise you with some special dishes, just go early since they close around 9 (my only complaint is that they closed early and the pool is open til 11). Parkway is in a great location, close to all theme parks, highways, parkways and even restaurants. Pool was nice! Give a it a chance and keep those doors closed.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "long island", "Title": "“Mixed feelings about resort, but stay was ok, wont be back.....”", "Author": "deelovesdis", "ReviewID": "UR117949289", "Content": "I just spent a week at the Parkway International.. Checking out Sept 2nd. The resort which is really just a few buildings and one pool, oh, yeah, and a tennis court was pretty empty and despite my requests to be near the pool ( I am handicapped and cannot walk more than 100 feet without assistance,) I was put in building G. The pool is behind building A. The front desk said\" its just a walk around the buildings, not to bad of a walk\". I said I cannot walk that far. 500 yards or whatever, anthing more than 100 feet , its all too hard for me. I understand it is hard for people to realize that a chubby healthy looking woman who seems to have no disabilities - has a disability. I have COPD, and several herniated discs which make it extremely painful to walk more than a few steps at a time. Of course I understand requesting a room near a pool is only a request, but most hotels try to be accomodating. I was told a note was put in the computer to try to get me a room closer. From what I understand , the male at front desk didnt put a note in or try to get me a closer room. I made a few calls to the front desk, each time getting someone else, assuring me they would try to move me. Getting in my car and driving to the pool was a joke! You are soaking wet and make your seats in your car wet and then they smell up the car like mildew!! Finally on Tuesday I was moved to a room closer! IT was great, ground floor room right near the pool! I could walk out the back dooor to the pool and see my child from the patio. So , now I start seeing giant COCKROACHES! No, not the florida Palmetto bugs, these were cockroaches! Could I ask to be moved again? No. So now my dream room has roaches. Not a dream anymore. I was so concerned with my luggage and clothes and of bringing them home with me. I had to sort through all my luggage and wash and dry everything, it took me hours. I did inform the front desk about the roach problem and they did use the eco friendly company. I also did tell them about the front door. seems the bottom of the door was too high and we actually saw a roach come in under the front door. So, we were in the room far from the pool for 4 days, and couldnt utilize the pool, now in a room that had cockroaches, which really turned me off, and ruined my time. I am still hoping one of the roaches didnt hide in one of our suitcases and come home with us. We drove so they could have made the trip back here alive. THe room was nice. Actually the building G room was very nice with a huge bathroom. Building A room was a little smaller,the bath room was also smaller, with a shower that could only fit a child. Everything was nice enough. Nice kitchen, nice sized beds.but........ We stayed here a few years ago, and lke the other reviewer expected the buildings to be run down-and they weren't. Last time we had a great time , I had a great feeling being here and couldnt wait to come back. THe roaches really upset me and to be honest wont ever come back.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Northumberland", "Title": "“Fantastic! Would stay here again tomorrow!”", "Author": "luvlyluvvie", "ReviewID": "UR116910851", "Content": "We have just returned after a 3 week stay here at the Parkway International and I can honestly say I haven't got a single complaint. Even before we arrived, being paranoid, I emailed the resort to check on our booking and received a friendly and prompt response. We arrived very late after flight delays, but had no problems checking in, the security officer who showed us to our apartment was friendly and courteous and the check in process was quick and easy and at no point were we hassled to buy a timeshare, although if I could have afforded one I would definitely have considered it. The apartment itself was lovely - more spacious and pleasant than our home in England! All the rooms are nicely furnished, the beds are very comfortable and there is certainly every appliance and utensil that I would care to use and plenty that I didn't get around to using! I was especially delighted with the washer/dryer as I don't have a dryer at home and I found it extremely convenient and effective at getting my family's clothes dry quickly. We were in a ground floor condo so we didn't have to climb any stairs and we barely heard any noise from upstairs or next door. If I was being picky my only negative would be that we didn't have a particularly exciting view - over the tennis court and the back of the shops - maybe next time I would see if I could request a condo overlooking the pool, but really that is an extremely small thing. We did see one cockroach in our room - it was no big deal, I trapped it in a glass and put it out the door and were't bothered by any again. The complex itself is small but perfectly formed! Our kids (aged 12, 7 and 5) enjoyed the play area and loved the pool which was heated and lovely to swim in at the end of a long day at the parks. The jacuzzi was amazingly hot and relaxing. Although the pool is quite small, it was never crowded and there was always spare chairs and plenty of room in the water. The nature trail was short, but pretty although I was disappointed we saw no snakes! We did see fish and turtles and lots and lots of lizards and squirrels. Some of the boardwalk was being replaced during our stay but it caused us no problems. We found the staff friendly and pleasant whenever we encountered them. The security guards were often seen doing their rounds (even during torrential rain!) and always said hello. The staff in reception were pleasant, efficient and helpful when we went to collect our suitcases (which had missed our flight), when they sorted out a problem with our room key and on checking out. As for location, the Parkway is in a great place for visiting the Disney Parks, just 10 to 15 minutes depending on which park you're trying to get to and about 20 to 25 mins up to Seaworld and Universal. You are right next to the I4 and a short drive to International Drive. Being located on the 192 there is no shortage of places to shop and eat. You can walk to a few shops and restaurants next door to the complex although I wouldn't advise using the supermarket there as their prices are phenomenal - head up to Walmart on Vineland Road or Turkey Lake Road instead and stock up (they're open 24 hours - we went at 2am!) It is also quite close to Old Town which is worth a trip on a Friday or Saturday night to see the cars. I would recommend an evening visit to Pirate Cove mini golf - there is one just off the 192 or one at Lake Buena Vista (not Pirate Island which is next door to the Golden Corral) - it is very atmospheric and a lot of fun. There are lots of cheap restaurants nearby - I wouldn't recommend Ponderosa, but I have no complaints with Sizzler and the range at the Golden Corral is well worth the price you pay. However, if you want to eat in, there are all the cooking facilities you need in the condo. If I had eaten in more often, I might not have had so much dieting to do now I'm home! All in all, we had an excellent time and I would stay here again tomorrow. Next time we visit Orlando, this would definitely be one of my first choices. Real value for money and we were very impressed.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Texas", "Title": "“Our second stay was great too!”", "Author": "GeorgemTexas", "ReviewID": "UR116720262", "Content": "Our family of 5 stayed here in July 2011, our second time. And, once again, we are quite pleased. The condo is spacious and comfortable. We parents like having our own room. The pool area is nice, but not memorable. The best point, without a doubt, is proximity to the Disney parks. You can get from the condo parking lot to a Disney parking lot in 5-10 minutes. You only go through one light, and even that is a right turn. All this, combined with an awesome rate if $90 a night, made us very happy.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Corpus Christi, Texas", "Title": "“A Great Spring Training Bargain”", "Author": "HooksFan", "ReviewID": "UR116639033", "Content": "Our family absolutely enjoyed our stay here. We happened to be at this resort the same time that cju13 was there. We were advised on the remodeling going on and adjusted our plans accordingly. Since we weren't there much during the day it really didn't inconvenience us. Our two bedroom/two bath unit was more than spacious for our family of four. Having a kitchen along washer/dryer in the unit cut down on meal and laundry expenses. The location of this resort puts you within short driving distances of Walt Disney World and the Atlanta Braves and Houston Astros Spring Training complexes. As others have pointed out this is a timeshare...they asked me when we checked in if I was interested which I replied I wasn't and that was the end of it. I had to make a minor change to our reservation and the staff was more than accomodating. This was definitely a bargain for the price which we paid. We had no problems with any type of insects and the internet speed was more than adequate. In a couple of years we will probably be interested in a timeshare to coincide with our vacations. Our family will definitely be back.", "Date": "August 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Canton, Ohio", "Title": "“Still Great!!”", "Author": "lp6145", "ReviewID": "UR116280406", "Content": "After the initial time share try, everything was great. We stayed here in 2009 and the resort was nice and clean, well kept up and on the smaller side, coming back in 2011 I expected it to be alittle run down, but was surprised to see that it was as nice as before and improvements had been made. Would recommend this resort to anyone. We really enjoyed our stay.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Weymouth, England", "Title": "“Great find, really good Hotel for the price paid”", "Author": "piggywiggy01", "ReviewID": "UR115453029", "Content": "After searching for somewhere to stay for 3 nights in Kissimmee and reading the positive reviews on Trip Advisor, I booked the Parkway Int Resort. We found it a bit tricky to find even using Sat Nav, but we had just travelled from the UK so it was in our time the early hours of the morning. However, we had no problems after that. Check in was done very efficiently and the Receptionist was polite and courteous. We stayed in the block opposite Reception, think it was Kilimanjaro. Anyhow we were pleasantly surprised when we stepped into the Condo. The rooms were large and clean and tidy. My daughter slept on the pull out couch which she found comfortable and so were the beds. The kitchenette area was well thought out and appeared to have everything needed for a self catering holiday should you chose to do so. We did however, have problems with both toilets, which had obviously been blocked by previous guests which meant a very early morning on our first day when the bathroom flooded when we flushed the toilet. However, a frantic call to Reception and 10 minutes later the caretaker arrived to sort it out, closely followed by the cleaner. After that we had no problems at all. We were not in Kissimmee long enough to use the facilities at the Hotel but we checked out the pool which looked good. The Hotel is extremely well situated for Sea World and the Magic Kingdom the two parks we visited. Roughly taking around 10-15 minutes to reach them. We also visited City Walks which took about 20 minutes to reach. We would certainly have no hesitation in recommending the Hotel and would certainly use again if we stay in Kissimmee for future Florida holidays.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York", "Title": "“\"Loved it\"”", "Author": "smitty2094", "ReviewID": "UR115298230", "Content": "I had a great time there. The only complaint I do have is that the pool should be cleaned more often since I spent most of my time there. The staff was polite & courteous and the gounds well kept. The activities supervisor, Becky, was smart, funny , and great to be around. I look forward to next year.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Medicine Hat, Canada", "Title": "“Wonderful.... would reccommend !”", "Author": "emelainegiles", "ReviewID": "UR115106635", "Content": "I really do not understand the bad feed back this hotel has recieved. The staff were very welcoming and the 2 bed condo we stayed in was clean and well maintained. The location of this hotel is spot on. You are only minutes away from disney and you are right on the 192 which makes getting anywhere easy. The pool is small but the hotel isn't massive so no need for a huge pool. My children loved it. I canont fault this hotel at all and for the money we paid it was a real bargin. I can say if we ever go back to Kissimmee we will be staying at the Parkway again.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Danville, CA", "Title": "“WORST RESORT WE'VE EXCHANGED TO!”", "Author": "Eur0pe06", "ReviewID": "UR114693990", "Content": "RUN AWAY FROM THIS RESORT - WORST EXPERIENCE EVER!!! We have owned timeshares for almost 15 years. We exchanged our Westin 2BR timeshare via Interval and selected Parkway based on the \"premier\" designation given by II. We also read the reviews which were, for the most part positive. What an inequitable trade this turned out to be. The unit was a 2 BR, 2BA - it was definitely sized well enough based on sf to accommodate our family of four. And the kitchen was well-stocked with tools, and the AC worked well but as someone else pointed out, it was right next to the second BR and very loud. We had to turn it off at night. The man who checked us in was pleasant enough. The maintenance guy who came to unlock our safe and bring us working knives was timely and helpful. But that is where the positives end. Our unit - B306 - was lacking in the cleanliness department. While dustbunnies and cobwebs are generally excusable, the following are not: used bandaids on the floor, cockroaches in the bathroom and bugs in the utensil drawers. We told the front desk about the bandaids and the cockroach on our 2nd full day. She then proceeded to tell us that she can have the room sprayed but cannot guarantee the odor. My daughter and I have breathing issues and a room full of bug spray is not what I have in mind during my vacation. She promised to get the room cleaned. They changed the towels - but cleaned it was not. More cockroaches showed up again on Friday - this time we brought them the \"dead specimen\" in a ziploc bag as well as a picture to prove that there is an issue as the first encounter did not seem to generate a serious enough response. I asked for the manager on duty the second time, who proceeded to tell me that they use a eco-friendly service (we weren't told about this the first time and the front desk should have advised their managers of the issue the first time) and she will get them out right away. Should we have left or asked for a different room? Perhaps we should have after the first time but I trusted that they would take care of the problem the first time. After the second encounter - we only had 1 full day left and repacking and moving would have taken too much precious time. The Master Bath was an afterthought. Sure it had a jacuzzi tub - which I guess is a must for all the MBRs nowadays, but they forgot the shower, so a pre-fab shower unit was installed at the corner - no room to bend if you drop anything. A more comfortable shower would have been more useful than the giant 2 person tub. There was one sink, but no countertop and nowhere to hang our toiletries - we had to use the tub wall to store our toiletries. The Master bath was very dark - either they need to change the lightbulbs or add more, but it was dark. There were more switches than there were light fixtures. The second bath was more usable than the Master. The pool area needs updating. After the cleaning issues with our unit, we were quite uncomfortable trying out the pool and the hot tub. When I told the front desk we were in the process of checking out and I wanted to get a receipt to make sure we were not charged for anything, she gave me a rather funny look when I wouldn't give her my room key and explained we were still packing. She proceeded to tell me in a rather snobbish manner that I was not checked out until I turned in my room key. Seriously??? I know there are others that raved about this place. I WILL NEVER GO BACK.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hertford, United Kingdom", "Title": "“We love it so much we keep coming back year after year”", "Author": "nannybeth3009", "ReviewID": "UR114650556", "Content": "Discovered Parkway about 8/9 years ago having been moved from sister resort Orbit one where I own after a hurricane, and haven't looked back. Prefer smaller friendly resorts and this fits the bil perfectly, every appartment isn't far from the pool. As previously stated its clean, spacious, close to amenities and maingate. Jackie I loved a previous review calling Becky 'Entertainments Director'. We have made such good friends because of the intimacy of the pool and look forward to catching up with them again this year.My grandchildren and I enjoy the free breakfast but I like that we don't get the free breakfast at the weekend it gives us an excuse to go out. All the staff both Becky's. Norman, Kenny,Jackie are all wonderful and I can't wait to get back in September. Beth, Hertford UK", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "milwaukee", "Title": "“A GREAT place”", "Author": "brewerfan2", "ReviewID": "UR114438937", "Content": "Check in was a breeze, room was a . 2 BR 2 bath , full kitchen and a 6 seat dining room table with another 2 seat table in the living room. Washer, dryer and an inscreened patio, for 105/night tax included. The room is not old and worn like alot of other resorts in Orlando. There is no daily house-keeping and no new towels are brought to the room, unless you pay a fee for them. To me this is no big deal, as I can wash and dry my own. There is daily garbage pick-up as you just leave it right outside your room. The location is excellent. You are just a 10 min. drive to Disney parks, Univ, and Sea World. It is a tad off of 192 but away so there is no traffic noise. There is a grocery store within a 2 minute walk, and scores of trinket stores and restaurants off of 192. The beds were excellent as was the water pressure.With 4 adults in the room, we never lost hot water.The staff that we dealt with were all excellent individuals and very helpful. I was never once approached about buying a vacation home.", "Date": "June 19, 2011"}, {"Ratings": {"Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Arnold, Missouri", "Title": "“Far exceeded our expectations!!!”", "Author": "markstlou", "ReviewID": "UR113236059", "Content": "Talk about a value! Super clean and spacious! Everything there you would need. Nice pool and hottub, cute nature trail. Only a couple miles from Disney and on one of the \"main drags\" that allow for quick access to many restaurants and activities! Don't miss this if you can help it!!!", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Richmond VA", "Title": "“Clean resort and helpful staff”", "Author": "JRF07", "ReviewID": "UR113087006", "Content": "My husband, 2 year old and I stayed here for a week in June 2011. Very convenient location, right around the corner from Disney. Our 2-bed, 2-bath unit was overall immaculate and quiet. The master bedroom's sheets had some hair on it, but the response from the hotel was immediate. We called the front desk and someone was there within 5 minutes to change the room over. We were very impressed with the responsiveness. Nice pool area, playground---very family-friendly. One downside for us was that smoking was allowed in the pool area. Since the pool isn't enormous, I didn't like that we had to be around it. The other disadvantage was there is not free wifi internet----it is $8/day or $30/week, which seemed unnecessarily steep.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Newberry, South Carolina", "Title": "“Will stay here again but none of my request were taken care of!”", "Author": "TrueDiva2011", "ReviewID": "UR110832379", "Content": "I stayed at a the sister company Liki Tiki Resort in 2010 and loved it. Since we had additional people coming with us we were looking for something a little cheaper and Parkway International Resort was perfect. The resort is in a better location than Liki Tiki. It also does not have the water park that Liki Tiki has. Honestly the thing they call a water park is a slide and water fall located in a pool. When I booked my room I requested a poolside and/or first floor room. Needless to say I didn't get either of my request. The lady at guest services advised me that I could stay in the room provided for one night and then she could get me in another room the next day. That didn't work for me so I just stayed in the room provided for me in the Kilamanjaro building 2nd floor room. The Kilamanjaro Building is located across the parking lot from the pool. It takes about 3 mins to get to the pool area so everything turned out ok. My favorite thing about the resort is the pool area. The resort is very small so the pool was never overcrowded and I could always swim without worrying that I was going to bump into someone. I spent several days at the area and my 3 year old son enjoyed it very much. There is a nice park right beside the kiddie pool. My son went back and forth with ease and I was able to see him at all times. Plus the area is gated! The bar/grill is also located beside the kiddie pool. You don't have to worry about bringing any money to the pool because they will charge it to the room. We loved the chicken nuggets in fish batter, nachos and all the spirits. The pool closed at 11 which is very late for most hotels/resorts. The bar only stayed open to around 6 though...I'm assuming this changes in the summer time. There is also a small game room in this area too. There were activities for kids and adults in the area. They played bingo and black jack for money and there were a lot of kiddie activities that my child was too young for. To top off the area they played island music and even had a performer at times. On top of the beautiful pool area the rooms did not disappoint. The living room had a pull out sofa and if you pushed the tables against the wall, there is enough space to add 2 queen size blow up mattresses (one on each side of the pull out couch). There was a nice screened patio with ceiling fan and had a view of a parking lot and trees. We saw 3 raccoons looking for food while we were out on the patio. There was also a grill that was easily accessible by the extra set of stairs for the back of the building. The master room had a king size bed and a patio door for immediate access to the patio. We had new mattresses too...of course I checked. The bathroom had a jetted pool and an additional area for toilet. This was very helpful because someone would go to the bathroom and shut the door and not hold up other people from brushing their teeth etc. I did clean the bathroom but I always do at hotels. The jetted pool had sand in the jets. It took me 15 mins to clean the tub. I believe the people before us went to the beach and the cleaning lady didn't notice the additional sand. The 2nd bedroom was smaller and had an outdated TV but who cares. The twin beds had wheels on them so it was very easy to push them together to make a full size bed. The 2nd room had the water heater in the closet so the room was warm even when the rest of the hotel was freezing. The 2nd bath was ok but I didn't used it. There were no complaints from any members in my party about the 2nd bathroom. I did not see any bugs but my sister explained that she saw an unidentified spider with fur in the room. She killed it and she didn't see any thing else. Kitchen had everything you would need but a small frying pan for eggs. We brought dish washer and laundry detergent and didn't use it. The only thing that they didn't provide was hand soap...so I will be sure to bring it next year. We used the dish detergent that they provided. Washer and dryer are small but served it purpose. We did not use the oven so no comment there. The free breakfast/time share speech is ok if you want to get the 20 dollars off your multiple day passes to the park. They also offer you $100 gift card if you do not want the discount on the ticket. Why not get the money before you leave? If you tell them no they do leave you alone though. Another thing I like about this resort is the home feeling. Once you get there you can have guest over and they have no problem parking. I asked for the 1 hour extension for checkout and it was horrible. The maid bothered me the entire extra hour knocking on the door trying to figure out if I had left yet. She said nobody told her. I guess they need a better system. Overall this resort is just a little bit above average. If you are looking for a comfortable place to stay with privacy in your own room and the option to cook and wash clothes...stay here! Also the exercise room is a joke. They don't have a stair climber...my favorite. They do have a treadmill and elliptical though. The nature trail is a very small path and not even half a mile lol I hope this helps!", "Date": "May 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Roselle Park, New Jersey", "Title": "“Worst Vacation Experience Ever”", "Author": "jaymvita", "ReviewID": "UR110795974", "Content": "This past April 2011, I booked several days with the Parkway through an exchange company for myself, my wife and our three daughters, aged 6,3 and 1. Upon arriving at the hotel from New Jersey at about 8:00pm in the evening, I was told by Sandra, the desk attendant, that they had no record of me or my reservation in the system. After insisting that I had a confirmation via email, I was allowed to pull up the email and prove that they did indeed have me confirmed. Sandra then proceeded to tell me that the entire resort was booked solid and that they simply had no room for me or my family. Sandra called around to sister resorts to see if they could accommodate us but they had nothing either. At this point, after a half hour of looking to see what happened, the only sure thing was that my kids were without a place to stay in Florida. Luckily, we had friends staying at the resort who offered to put us up for the night until the Parkway could sort out the mess that they had left us in. Unfortunately, they were themselves a family of four which meant that they had to rearrange their vacation plans for one night to squeeze my family of five into their two bedroom unit. Not exactly the heigh of comfort for everyone involved. The next day, the Parkway did find a room for us which was frankly enough given that we had nothing else. The room was fine except for the AC unit which sounded like a jet engine every time it went off. Unfortunately it was located right next to the kids' room which meant that it startled them every time it kicked in. The manager, Vicki tried to ease my anger and disappointment by offering me some complimentary vouchers for future stays, but in keeping with it's record of failing my family, those vouchers have yet to surface. It has been a month since we stayed there. And it will most likely be the very last time we ever visit the Parkway again.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ontario", "Title": "“This was our second trip to Parkway and we still love it.”", "Author": "OntarioHopper", "ReviewID": "UR109338172", "Content": "While the decor is a bit dated, it continues to be clean and great value for the money. We love the location as it is walking distance to restaurants and shopping plus 5 minutes to Disney and 15 to Seaworld. The pool is fantastic and they try really hard to put on activities for the younger kids. We were located on the 2nd floor facing the pool and other than some noise neighbors the first night which a quick call to Security fixed promptly, it was relaxing and easy. You do see Security wandering around so if provided a very safe feeling. There is nothing fancy about Parkway but they are doing upgrades and at 80$ per night, it could not be beat.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "York, Pennsylvania", "Title": "“Very comfortable and enjoyable stay!”", "Author": "halvi1", "ReviewID": "UR108865452", "Content": "We recently stayed at Parkway during a trip to Disney World. We found the room spacious, clean, nicely decorated, and convenient to the pool area. The beds were comfortable, with good quality sheets. The location was convenient to Disney World (less than 10 minute drive to the parking lots). The front desk staff member was friendly and helpful, and she allowed us to check in early since we arrived well before check in time. The person who provides the parking pass will \"invite\" you to a free 5-star breakfast or lunch, which is really a timeshare presentation in which someone sits with you while you eat, and talks to you about the offer - unless you're really interested or find it worth the discounted tickets or gift card, I would skip this, as it takes several hours of your valuable vacation time. But the resort was great and I would definately recommend it!", "Date": "May 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Excellent value for money, we would return!”", "Author": "holidaymaker3952", "ReviewID": "UR104841109", "Content": "We have today returned from a 6 night stay at this hotel and would honestly be happy to recommend it. We believe it was great value for money. After reading some of these reviews, I was on constant lookout for any bugs and honestly did not see any in our room and only saw lizards outside! Our apartment was comfortable, all equipment was working and was decorated well. The sofa, however, did appear to need replacing but this appeared out of place as it seemed to be the only item in need of replacement. The air con unit outside bedroom 2 was fairly loud but this did not cause us any problems. The location is great for Disney and also convenient for other attractions. It is not a large resort and therefore does not have a wide range of facilities but the facilities it did have, seemed perfectly adequate. The staff were friendly and although there is currently a lot of painting/refurbishing going on, the workers were accommodating and we were given warning to use the back door to the apartment rather than the front as the front stairwell was being painted. The view from the apartment wasn't amazing, but wasn't unpleasant. As a sister resort, guests of Parkway International are permitted to use the water park of Liki Tiki Village. You are however required to pay for a parking pass which is $5. The Liki Tiki water park is very small (a pool and a few small slides) and although it served a purpose as part of a relaxing 1st day, we would not make the effort to go again. We also made use of the hotel Wifi access and were pleasantly surprised to find that this worked in our room, but we're not sure if it would work in every room. We paid $29.99 for 7 day access, which was worth it for what we needed it for. I believe there was a daily fee option of around $7.99 / day. Overall, we would definitely recommend this hotel due to the value for money.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“It's really not bad at all...”", "Author": "travelgirl34352", "ReviewID": "UR104429754", "Content": "I really worried after reading the other reviews. This is an older resort, but it isn't as bad as people make it out to be. Our unit was clean, although there was a bit of smoke smell lingering in the unit. Everything worked fine. The staff was helpful and friendly. The decor is animal themed, but it really isn't bad at all. The tv's in the bedroom are an older style, but who cares...it's vacation. Who watches TV on vacation? The tv in the family area is a flat screen. The pool was clean and well kept. The poolside bar is \"ok\". We have stayed in much better, and I have seen much worse. The appliances are updated, and the new building paint looks nice. My only wish would be that there were more amenities, however, the kids club seemed to have really good daily activities. There are two small playgrounds. No bells and whistles, but it really is a nice place to stay.... I would stay here again.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mentor, Ohio", "Title": "“OMG don't do it!”", "Author": "Judytraveler13", "ReviewID": "UR104413934", "Content": "We traded in our Aruba Surf Club timeshare through Interval International for this timeshare and were we very disappointed! I checked the first unit they gave us and found dead bugs in it...so they gave us another unit....no bugs at first, but we saw them once we got our luggage in. The main problem with these old units is that they are very dark with old furniture and bathroom/kitchen facilities. The couch was very uncomfortable and we were sitting on the edge because the cushions were worn out. There were no elevators and we needed a bottom floor for my mother. They were painting the outside with a rust color and overspray was all over the doors and stairs. The plants outside were dead and needed to be replaced or taken out. Not enough lounge chairs around the pool for the guests to use. One menu at the outside bar/food site... the outside bar to select food.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ellicottville, New York", "Title": "“Excellent Place to Stay!”", "Author": "Cathy99", "ReviewID": "UR104300192", "Content": "I don't understand all of the negative reviews. The room we had at the resort was very nicely done. It was clean and while not huge was more than enough room for my family of three plus my mother and brother to be comfortable for two nights. We had a two bedroom room. There was a king bed and two twins plus a pull out sofa. All beds were clean and comfortable. The rooms had a screened in patio. The view wasn't great,, but we don't stay at a hotel for the views. The hotel is done in a safari theme, but we were so close to the Disney parks (5 min drive) that it went well with the Animal Kingdom. There are no elevators and we were on the second level, but the stairs were manageable for us. They could be more difficult for others. The pool was nice and the wooden trails around the place were nice, too. Overall a great place again and I would not hesitate to book a room there again!", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Akron, Ohio", "Title": "“We couldn't believe how nice it was for the price!!”", "Author": "Cavinsullivan", "ReviewID": "UR103013812", "Content": "We booked his room last minute as our travel plans changed abruptly. When we arrived, we found the young lady at the front desk very pleasant and friendly. Although for some reason, they had no record of our reservation, they were very accomodating and even charged us a lower rate than I had booked online. We lucked into a first level room with walk out to the pool. The room was fantastic. It had two bedrooms with TV's, a full kitchen, two bath rooms, a large kitchen table, a large living room with flat screen and a DVD player. The master bedroom had a jacuzzi and a walk out patio. The pool was clean and very nice and had a nice atmosphere. They had activities for children throughout the day, an arcade and live music in the evening. There was a poolside bar that offered food. We ate there one night and the hamburger was one of the best I ever had!! What a pleasant surprise that was. W extended our stay two extra days. It was minutes away from Disney and all in all it was a great find. I would recomend it to anyone!!", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“great place to stay with kids and family”", "Author": "brimleyresident", "ReviewID": "UR102526385", "Content": "i have stayed here 3 times now over the past 3 years, i think the value for the money is great, granted its not a 5 star resort but its at least a 3 and is very nice, ive been to places that had a hose stuck to your wallet and believe me this doesnt do that, it has a nice pool and play area for children and they have activities around the pool most days, my condo or suite was clean and we had ample room for 5 people, some of the reviews i read on here were less than desirable but if you want a nice place to stay and a place thats clean , centrally located near the parks and I-4 with numerous restrauants around and if you dont want to spend a fortune, then this is it, we booked ours thru hotels .com and got an excellent rate, in closing we will be going down here again in april and are staying here again,", "Date": "April 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“A reasonable place to stay”", "Author": "jandahiltner1", "ReviewID": "UR101770692", "Content": "After reading the wide range of reviews on this resort, I wasn't sure what to expect. I'm usually an uber-planner, but I was a bit behind this vacation and my usual sure-bet choices for time share exchange were booked. We booked here by default; I read the reviews and hoped for the best. All in all, I was pleasantly surprised. We had a 2 BR 2 bath unit. In a nutshell: the place was clean, very clean. No weird smells. I never saw a bug, despite hypervigilance and having a unit on the ground floor. It was quiet. Never heard a neighbor despite the parking lot being pretty full. Outside painting was going on but it did not disrupt our stay. The decorating was pretty bad; luckily that's not why we were there. The staff was very polite. They ask you to fill out the customer satisfaction survey before they allow you to have the access code for the reduced rate internet connection, well before the complete discovery process has occurred. There were several non-functioning items in the unit-- a non-working outlet in the kitchen, a slightly leaky sink (just a bit of moisture on the floor after running the dishwasher,) and the icemaker was not hooked up. The condo is fairly dark, between the decor and the energy efficient light bulbs. The beds were very comfortable. The shower was strong and refreshing. My kids enjoyed the jacuzzi bathtub. The proximity to the parks was fantastic. If I was looking for a resort to serve more than a clean place to sleep and change, I would be dissapointed, however we were visiting Orlando to hit the parks and this place really met our needs. Elegant, no. Better than \"basic\", yes. The resort, in my opinion, is not a destination in itself, but that's not what we were looking for, so we were pleasantly surprised. True, we had to bring our own shampoo.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What a great place...”", "Author": "Thefamilyguy111", "ReviewID": "UR100955298", "Content": "My family of four stayed here based on the good reviews and I have to say we was not disappointed. It is tucked back away from the highway and you can walk to many places to eat and shop. Down just a little bit from old town. We purchased tickets for the dinner show Arabian nights which pretty cool. The staff is helpful and curtious. It is a timeshare resort but there was no pressure for us, just a nice relaxing week. The rooms are spacious and clean. They have everything you need to make you feel like your home away from home. Dont believe the negative things, some people just love to complain. Its a true bargain. We saved a ton of money staying here and going to the parks and could not have been happier with it! We will for sure stay here again.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Erie, Pennsylvania", "Title": "“small and ok”", "Author": "davsbabe", "ReviewID": "UR99961040", "Content": "ok i'm not one to make a big deal over little things just read my other reviews. we had a 2 bed 2 bath unit. the 2 bed room 2 bath was ok, it only had twin beds in the 2en bedroom \"not good\" when you have two other adults that are large and need more space.the master bedroom was nice it had a king bed.the master bath was updated and very nice. the theam of the rooms were lions tigers and big game that was not realy bad,but if your not in to that theam then you don't want to stay here.if you love the theam you will love it here.we liked it so it did not bother us at all.now for the staff we did not get a mid week cleaning like you get at most time share resorts,so not only did i have to do our wash i had to do the resort was at our cost as we had to buy extra landury soap.then we had a tour we booked with disney and had to be up very early so we called the front desk the night before and asked for two wake up calls fifteen minutes apart, well we never got even one almost missed our tour we would have been out over 500 dollars good thing we set the clock as well.we did not walk the trail or eat at the resort so i can not give you info on that.one note the resort is very small no front gate not front desk staff late at night. any one could come and go as the please.the only time we seen any staff was when there was check in.we will not stay here even if we got it for free.. please under stand i'm very open minded so it's hard for me to be so mean but i don't want anyone to go through what we went through.if you do choose to stay here i hope you have a better time here then we did.good thing we got there late at night and left very early in the am so we only washed and slept there.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“don't be fooled by good reviews”", "Author": "gheegheeme", "ReviewID": "UR99874570", "Content": "First, when we arrived I had called ahead for a room facing the pool even if I had to take the third floor to have a nice view (the resort has no elevators). When we arrived, our view was........ the side of the next buildin, not even a glimpse of the pool. I climbed down the 3 flights of stairs and went to the front desk to complain. After complaining, we were switched to a 3rd floor room with a pool view. Finally inside our room, it was very dated and not too clean. I immediately killed a crawling bug on the kitchen floor. It had a musty odor, but a great view of the pool. The main area of the room is tiled and you will need to wear socks of shoes or else you will have dirty feet. I would recommend stripping your beds and immediately washing the bedding. The bedding at night didn't smell fresh when sleeping. The second bedroom has two twin beds and inside the closet is the hot water heated. Right outside the bedroom door is the furnace, needless to say, you don't get much sleep with all the noises from these two large units going off and on. The next morning I wanted to heat up my coffee after putting it in the microwave for 1 minute, then 2 minutes, then 10 minutes, I realized there was no heating my coffee. One evening, we wanted something to eat from the Kenya Kafe at around 6:20 p.m. When we called them we were told they are closing in 10 minutes. So when they say hours vary by day and season, it really means when they no longer want to serve their guests. The bar closes early around 7 p.m. So grab some cold beer from Publix if you want to drink something by the pool after a day at the parks. Also, the pool closes quite early and I saw security shooing guests back to their rooms around 10 p.m. It is true that this place is centrally located near many activities, food and disney parks, but it certainly isn't a 3 star, more like a 2 star resort. When I was checking out, a guest in front of me spoke in a low voice about a cockroach in their room. We spoke as she was leaving and she said they visit Florida often and realizes that this happens, but cockroaches can be controlled by the resort. Find a place with nicer ammenities, after all it is your vacation that you have anticipated going to for weeks after all the planning.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“another great stay at the parkway”", "Author": "zoom8942", "ReviewID": "UR99867351", "Content": "this was our second stay at the parkway international, and we had a wonderful time. The hotel is only minutes away from disney, and we got a great rate of $77 a night. We traveled with a teanage daughter, a preteen son, and a preeschooler. The parkway offered many kids activities durring the day, but we spent much of the day at disney. we spent the evenings in the great heated pool,which was warm enough even for me to swim(im a wimp) There was definately an older crowd so there really was no other children to interact with? the time of year or just the crowd the parkway attracts. thay were referbishing the hot tub that week(bummer) The room have plenty of space to hang out. I do wish houskeeping would come in once a week and clean, as by the end of the week the floors were quite dirty, dont know quite why. kitchen is fully stocked,and washer/dryer though small helped alot. they were powerwashing/painting all the units which was loud, but we were gone most of the day anyway, so it didnt really affect us, unlike the previous poster. I guess they have to be able to referbish sometimes, and at $77 a night who can complain!!!!!!!! do wish they had free wifi", "Date": "March 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stamford, Connecticut", "Title": "“Definitely will stay here again!”", "Author": "debpurn", "ReviewID": "UR99290300", "Content": "I stayed at Parkway the week of Feb 20th. Checked in a few hours early with no problem. I was pleasantly surprised when I saw the unit due to the descriptions I had read regarding the decor. There was definitely enough space for myself, husband and 9 year old son. I am always worried about noise when travelling and I never heard any of our neighbors. Slept great every night. Our unit was near the playground so we didn't hear any noise from the pool area. We spent most of our time away from the resort so I can't comment on the pool or activities. The location was perfect. Parking was not an issue here like other resorts we have stayed at in Orlando. My only 2 gripes would be the shower was small and the tvs in the bedrooms need to be upgraded. But I would definitely stay here again.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reedsburg, Wisconsin", "Title": "“Wonderful, fun, and relaxing”", "Author": "Raboine", "ReviewID": "UR98667530", "Content": "The weather was a little on the cooler side, but the resort had plenty of indoor activities to keep us busy, too (plus a great hot tub!). Becky, the activities director was super friendly and made everyone feel welcome. I had never played all the variations of bingo that she organized but helped me understand and I even won the big pot at the end! It was so much fun that I went back for blackjack, too. Manny, the bartender, makes some delicious margaritas, too, so you'll definitely have to have to split a pitcher or two :) The tennis courts were really nice and up to date. The room itself was beautiful. You could tell everything was less than a couple years old, and I loved all the diamond patterned tile everywhere. We look forward to returning next year!", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Troy, Michigan", "Title": "“Something for all 3 generations!”", "Author": "sandeebeech", "ReviewID": "UR98255153", "Content": "Everything in our condo was clean and very comfortable. The outdoor property was free of litter and maintained on a daily basis. True, there is no maid service but clean towels, soaps, and other housekeeping necessities are available at the main desk. Parking was directly in front of the units. Daily activities were provided for the children down by the pool. Outdoor/pool chairs and tables/umbrellas were clean and in good condition. We found all personnel very polite and ready to assist us if needed. The exercise room was a little on the small size, but it was never crowded and often empty. We took advantage of the outdoor gas grills and used one to cook our dinner one night. My only complaint would be the size of the second bedroom in our condo - the master bedroom was perfect, the second bedroom was very small...which was fine for kids, but not adults. I would recommend this resort to friends -- all 3 of us enjoyed our six day stay.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Great Stay!”", "Author": "dolphindream88", "ReviewID": "UR97921536", "Content": "We stayed at Parkway International Resorts from Feb 15-22nd & we loved it. From the outside of the buildings it looks kind of run down, but once we walked into our room we were very impressed. The 2 bedroom/2 bath condo was perfect for us traveling with a 11 & 15 yr old & the rooms are spaced out for privacy. Having our own in suite washer & dryer was awesome. It was great to be able to wash clothes & towels whenever we wanted to. We had great service from the hotel when the chain to flush the toilet broke in the master bath, maintaince was there to fix it within a hour of us reporting it to the front desk. We were only approached once to attend the time share presentation & it was by a phone call, all we said was we were just heading out to the parks & they just said thank you & did not press us any furthur. We checked in late at night so the front desk had told us to return the next morning to receive our offical parking pass, but we just used the same one they gave us at check in and we had no problems, i just think it is a way they can ask you to attend the time share presentation in person. Would be willing to stay here again on another visit to Orlando", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "South Haven, Michigan", "Title": "“Pool, Hot tub & Tiki bar Close Super Early!”", "Author": "luvthesun33", "ReviewID": "UR97516926", "Content": "Things to know before you go: Wireless Internet doesn't work well at all, pool chlorine is high, pool, hot tub, and tiki bar close Early, security insure that everyone is in by 10pm which We didn't like because after all your on vacation. Also the pool area gets kinda crowed early so get there early to reserve your spot or bring your own lawn chair. The room was nice & clean perfect for us four. I enjoyed the spa tub in the master bedroom but another lady I met said hers was super loud. There are no elevators that didn't bother us a bit and we were on the top floor but just a heads up incase you have someone in your party that can't handle the stairs. The trails were nice but don't really lead to anything (no shopping, dinning). All the staff were very helpful & kind. At check in they were happy to move us close to the pool area. The kids enjoyed the play area. The game room was fun on a day when it rained a bit. We enjoyed a game of shuffle board. Overall we had a great time.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jakcksonville, FL", "Title": "“We've found our place in Orlando to stay!”", "Author": "steph774", "ReviewID": "UR96717986", "Content": "We traveled w/our kids ages 4 & 2 & my in-laws for a 2 night stay at Parkway International. It was a wonderful stay! It is a timeshare resort but we declined the \"breakfast invitation\" & they didn't press on any further. The rooms are very big & VERY clean! I was most excited about the cleanliness-I couldn't find any fault. We loved having a full kitchen with pots & pans & 2 bathrooms. I can't say how the service is at the front desk if you were to need something, b/c we only stayed 2 nights. It was perfect & we'll definitely be back! OH & eat at Charley's Steakhouse right next door-best steak i've ever had!", "Date": "February 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Falcon, Colorado", "Title": "“Hmmm... this is a tough one.”", "Author": "LadyFan55", "ReviewID": "UR96368173", "Content": "First let me say that we own at Parkway International, but I am going to make every effort to give an objective review. We were also there during a week of poor weather, although we travelers may not realize it, the weather can tilt our opinion, but I will try and not have that affect my review either. We had one week on deposit with the Resort program itself that was going to expire soon so my husband and I decided to use it for our first vacation without our boys in 15 years. (It was also the 1st time we stayed here at our home resort). For this purpose the 2 bedroom suite was a perfect size, we did not use the 2nd bedroom but the 2nd bath was a nice plus, but if we would have had our 3 boys with us, it would have been tight for us. There were not many draws offered in the master bedroom either. General info: This is a mature resort, old is not the right word as the units were all re-done within the last 5-6 years. The first building done (the building we stayed in and own in, \"C\") shows the most wear. The guests who stay at Parkway are also more mature than many other places we have stayed, some in age, all in behavior, some both. With that said it is also a great place for kids with many activities. Maybe not the best place for singles and those who enjoy a \"night-life\" or \"partying\" atmosphere. It has a laid back, festive feel, but not rowdy. Staff was fine, they where neutral about us and we were neutral about them. M-F they offer coffee, orange juice, packaged muffins or bagels, granola bars and packages of oatmeal. Not a full continental breakfast by any means, but we made good use of it. All units are 2b/2b with a king size bed in the master and 2 twins in the 2nd bedroom. I understand they can prep some rooms to have 2 king beds by putting the twins together for you. There is a mini W&D, full kitchen, dining room, living room and a screened in patio. The suite has outside entry both in front and back - loved that! The rooms are decorated in an African Motif. Nothing showed much, if any, wear and tear but neither was it \"fresh\" or \"brand new\". Well appointed kitchen. Wireless I-net is free if you own here and maybe if you own at any Island One resort, but it was pretty darn slow, even with a strong signal. The breakfast/lunch spiel after you check in and are getting your parking pass is a timeshare tour for Vacation Village at Parkway, the neighboring Resort, we own there too. We bought our 2b/2b there from private owners, but we did do the timeshare tour at VV@P about a year ago and it was one of the most horrible experiences of our life, we will never do it again! This is a timeshare resort and like all the timeshare resorts we have stayed in, daily housekeeping does not come standard, so be prepared to make your own bed. Supplies we found in our room: TP Paper Towels Kleenex Trash Bags Liquid dish detergent 2 single size packs of dishwasher detergent 1 single size washing machine detergent (we use and are happy with the 2-n-1 wash & dry sheets) 1 Caf & 1 D-caf coffee Sugar/Sweetener packages & powered creamer packages Small soap bars Pros: • Location, location, location - just east of I-4, it is only minutes from Disney and a short jog up I-4 to Seaworld, Discovery Cove, Universal, etc. Publix is just a couple blocks west and about every place you can imagine to eat is within a 5 minute drive. • Quiet - you might think that a resort so close to a main drag and interstate would have a traffic noise problem, but the lush vegetation totally insulates out all traffic noise! • Attractive grounds - really one of the best, mostly natural landscapes we have seen. The nature walk is a nice bonus too! • Awesome jetted tub, but do not care for it's location. I like the configuration of having a nice jetted tub where you view the bedroom and the TV versus the bathroom and bowl. • Very pretty pool area and finally a true Hot Tub! • Comfy bed but the pillows where a little too plump for me. • Not a single bug in sight. Cons: • In an effort to conserve energy, they go way over board using the energy efficient light bulbs making the entire unit way too dark! I finally had to just start leaving lights on so as to not have to wait for them to \"warm up\". • Carpet in the living room. We prefer tile. Regardless if it looks dirty or not, I always \"feel\" like carpet is dirty unless it is brand new. • No door on the laundry area so you could not close off the sound of the w&d. • TV - The size in the living room is fine, the one in the master is small (sorry, forgot to look at the 2nd b.r.), but the worst thing is the lack of selection. Only the most basic channels. Why does TV matter when in Orlando? Well when it rains, or is cold and you can't hit the pool after a day at the parks, it might be nice to wind down with a decent movie, not possible here unless you like only the oldies. But, with that said, the current rack rates to stay here may be worth the trade off. • Pool was too cool for the season, we could have swam if it where warmer. We visited the Resort where we will be staying Dec of 2011 and tested the pool temp there, it was very warm and swimmable even with weather barley hitting 60º. • The exercise room is sad, depressing and packed with way to much stuff! I love to work out, but I walked in then right back out. The resort is above \"Average\" but \"Very Good\" is not quite right either. Wish I could give it 3 1/2 stars = \"Good\".", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "LaCrosse, WI", "Title": "“Fantastic stay here!! Will absolutely return!!”", "Author": "wiscgrandma", "ReviewID": "UR96289505", "Content": "Have been to Orlando six times and this is by far the best accomodations we have ever had. Our Garmin GPS took us right to it. Having such a huge room was wonderful, especially with a family of six in one of the rooms. The kitchen was large and had everything I looked for to cook meals from pots and pans, baking pans/sheets, utensils, dishes, silverware, etc. Had a hand mixer, blender, coffee maker, sandwich grill, knife block, cutting board. My family enjoyed the whirlpool tub in the master bathroom, but there was also a walk in shower in there. They accomodated us by placing our two families next door to each other. We had a ground floor room which was good with little children and a 7-8 months pregnant woman (note-no elevators!). Having a washer and dryer was wonderful and soap was provided for it as well as for the dishwasher and dishsoap. No, there is no shampoo provided but soap was provided. Parking was right outside the door. There were tennis courts and a pool area which the kids used and enjoyed. There is a little strip mall behind the hotel with a grocery store and restaurants. The grounds were clean and beautiful. We were located in the building furthest from the front office and it was very nice and quiet there. When we arrived they told us after we signed in (and had provided our vehicle information) that we needed to go into a side room and get our 'permanent parking pass' from a gentleman but we politely declined and walked out of the lobby (we got no parking tickets while there either!) No one called us to ask us to a \"breakfast\", etc, until the day we were leaving and then they apologized for calling when told them we were checking out. Everyone was polite. I can see no point in buying into this time share as the rates were excellent to just rent and not have the other hassle/obligation. The location is excellent-easy to get in and out of and it is close to all main attractions. We have found the place we will always stay on our future visits!!", "Date": "February 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good size rooms”", "Author": "MollyAust", "ReviewID": "UR95606239", "Content": "Not a bad place to stay for the money. Probably will need a car to get to the hotel. Staff pleasant and the rooms clean but starting to show there age. Our room not ready so we were changed to a poolside room. Wouldn't recommend staying in one of these as the noise from the bar, pool and the music from7 in the morning is a bit much. We were there in winter and the cleaners cranked the music up when cleaning early in the morning! Ove ll a good place to stay with easy access to all the theme parks and local shopping. Great having a kitchen to be able to prepare our own food.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Huge rooms for the price! Not too bad if you don't mind a couple cockroaches.”", "Author": "usmcdevildog", "ReviewID": "UR94508143", "Content": "PROS: - Huge Rooms - Decent Price - One of the closest off Disney property hotels - Jacuzzi tub in master bath - On site playground - 3 televisions - Kitchen with utensils - Washer/Dryer in room with detergent - No cleaning crews to disturb you if you sleep late CONS: - Checked in around 9:00 PM, was told to come back to the concierge desk in the morning for a \"Parking Pass.\" I came back at 7 AM (when they told me they opened) and the front desk said they wouldn't be in until noon. I wasn't going to rearrange my schedule to go get a \"parking pass\" for the hotel I was staying at. I never got one and my car was amazingly enough still there every morning. - Front desk is closed from 11:00 PM to 7:00 AM. Had to check out at 4:00 AM to catch an early flight. Left keys in room, good thing I didn't need a receipt! I don't know how anyone would check-in if they got there late at night. - \"Continental breakfast\" (oatmeal packets and stale granola bars) only served Mon-Fri - No shampoo - Only had 1 1/2 rolls of toilet paper between the 2 bathrooms - Had a couple cockroaches in our room Even though there are quite a few cons, I would stay here again if I was able to get a decent price. I would not want to be an owner (it is a timeshare property) nor would I pay the full regular nightly price.", "Date": "January 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Whitinsville, Massachusetts", "Title": "“Just an okay place”", "Author": "MLK58", "ReviewID": "UR94290626", "Content": "Not a warm and friendly check-in, but not rude either. Quick and efficient. The whole place needs to be cleaned better, especially the floors. The kitchen needs a new toaster and could use a new coffee maker also, but it had everything needed including soaps for dishes, dishwasher and washing machine, paper towels, tissues, etc. The beds were comfortable enough, but the sheets and pillow cases didn't smell real fresh, although they seemed clean. The pool area was very nice, although there was hardly anyone there, so don't know what it would be like if it were full. I guess the best thing about the place is it's location. Very close to parks as well as downtown Orlando. Not sure if I would stay here again.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Poughkeepsie, NY", "Title": "“Expected much more....”", "Author": "biged", "ReviewID": "UR93885192", "Content": "My daughter and I stayed here for two weeks. I heard glowing reports about the place. I would definitley NOT rate this place higher than 3 stars ( if that ). Rude and uncaring front desk ( and an obnoxious game host ) were a few of the problems. Some of the should-be-obvious things were not taken care of : Towels and linens were never replaced, unless begged for, and the garbage problem ( they never said what to do with the garbage, although I specifically said you can come into the rented space and take the garbage ). A leaky showerhead was replaced quickly. The place was old. Not dirty, but old with no elevators ( no big deal ). Mirrors and lion wallpaper everywhere. Just not my cup of tea. I also learned that January is not a good month to go swimming ( my bad ). I felt like once they got you there, they forgot about you. I would rate this place between 2 and 3 stars.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia Beach, VA", "Title": "“Great Stay!”", "Author": "hephzibahs", "ReviewID": "UR91824547", "Content": "Great Place to stay. About 20 minutes away from Universal Studios. The room sizes are pretty good. 2 Bedroom and a jacuzzi in the Master's Bathroom! Full kitchen with silverware and dishes, coffee machine, grinder. Also has washer and dryer, which comes in handy. Master's bedroom leads to balcony. There is also a nature trail that leads to a little shopping center. The trail is beautiful. The king size bed is very comfortable and huge! Would definitely stay again. Tvs in the room could use an upgrade.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whitehall, Pennsylvania", "Title": "“In the Middle of Everything!”", "Author": "kimmy5504", "ReviewID": "UR91015871", "Content": "We spend 5 nights and 6 days at this resort. Since our plane arrived late, we had to have security check us in. No problems! The unit has 2 bedrooms, 2 baths, a kitchen, living room, and washer/dryer in the unit. The resorts offer a complimentary continental breakfast daily (M-F) in the lobby. This resort is so close to the parks! There is a Publix supermarket close by. Across the street is the town of Celebration. We were never pressured into a timeshare presentation. The pool is very basic and there is a playground for the kids next to the pool.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Herts, UK", "Title": "“Excellent value for money & perfect location !”", "Author": "vhoney", "ReviewID": "UR89584884", "Content": "Two bedroom apartment for just the two of us - so much space. Full kitchen which was very useful. Very clean. Decor not to everyone's taste but not old. Perfect location for the parks & International Drive. An abundance of restaurants on US192 also - some of them within walking distance. Do Charley's Steakhouse & Kissimee Swamp Tours.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Connecticut", "Title": "“Excellent place to stay with kids.”", "Author": "jtmadisonct", "ReviewID": "UR89465530", "Content": "This is a comfortable large suite with 2 full bedrooms. A kitchen with all the pots/pans/dishes you can ask for. Washer and drier in the unit, tv' in every room. The location is perfect. You could not get any closer to the parks. It is nice to have a home base for young kids to call home while away. You can cook a homemade breakfast, make sandwiches to take to the parks, and put a load of laundry in before you leave for the day. In my opinion, it is better than being cramped into a single room with 2 beds with no privacy which you might find on-site at a cheap resort place. Don't forget to go to Fioni's Italian restaurant right down the street. Perfect home style cooked meal. We loved it there. We needed a home-style meal after all the park food. The BBQ up the street at Fat Boys is good too. Oh yeah, ask for Everett at the resort. He will help you out with anything. We will be back", "Date": "December 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vermont", "Title": "“Rude Front Desk Agent!”", "Author": "skikid553", "ReviewID": "UR89375911", "Content": "Everything was going really well. Clean condo, quite large, no elevator so if you have trouble with stairs stay on the bottom level. The bad thing was that we went away for a couple of days and when we came back we tried to log onto the internet and could not because we did not have the code. So I called the front desk on 12/8/10 at 6pm and got a man who basically said I did not know what I was talking about.....we paid 29.99 for a weeks worth of internet to which the woman who checked us in gave us the code, but according the man at the front desk, no one there gave us a code, they don't do that at the front desk!!! So I wonder how I got the code to get in, when I began questioning the man he hung up on me!!!! so much for customer service at this resort. Also just to let you know, I did find the code that the woman at the front desk gave me upon check in and this is how I am typing this right now.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wellington, OH", "Title": "“Very nice”", "Author": "JENNMCC", "ReviewID": "UR85408778", "Content": "We enjoyed our stay at the condo/resort. The unit was very large and clean. Shampoo may not have been provided, but all of the kitchen needs were there, soap for dishwasher, washing machine, and sink. Extra paper products were also on the counter, along with packs of sunblock. Natural sunlight was not easy to come by in our unit but we weren't in the room that often. It did seem dark though. The screened in porch was nice and it was great to leave the door open to let the fresh air in. There is also a back door to the unit which is unique. The pool was nice and plenty big. There was plenty of shade so you didn't have to be in the sun all of the time. We didn't go to the cafe, but we did take our own water to the pool and saw plenty of people with outside food and drink. They have daily activities for the kids and adults. There is a work out room, didn't use it but it looked ok. We did pay for the internet for the week much bettter deal than paying daily fee. The location is great, easy to get to the airport or 4. Our biggest concern was that they were going to bug us about buying into the timeshare. They do try and talk to you when you get there to get something set up, we were in a hurry and made it clear we didn't have time to set anything up and they never bothered us the rest of the week. Would for sure here again.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dartmouth, Canada", "Title": "“Fantastic Place To Stay”", "Author": "Brentpen", "ReviewID": "UR84514544", "Content": "Loved this place. Very convenient to Disney, Seaworld and lots of restaurants. Had friends staying on disney and one night we left Ainimal Kingdom at same time. We were back at Parkway before the disney shuttle had our friends back at their resort. Wal-Mart is about 10 minutes away(driving) and Super Target and a Publix grocery store even closer.Nike outlet within walking distance as well as some restaurants. Found the pool to be a good size. Staff were friendly and helpful. Laundy, dishwasher and dish detergent were supplied. Liked the place so much goinng back in early 2011.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Connecticut, USA", "Title": "“Very comfortable beds, close to Disney, but no shampoo in the bathrooms”", "Author": "TheOneWhoLovesTravel", "ReviewID": "UR83874853", "Content": "The resort is nicely located near Disney. You do need to be careful with GPS as you may end up missing exits to get there. The resort has several buildings surrounding nice size and depth pool. There also buildings outside of pool areas, which are good when you want some privacy. The parking is free, but internet is $29 for a week (not bad, but I prefer it to be included). The pool area has a pool bar, children playground, and nicely equipped arcade room (coin-operated). They have some walking passes, but no fitness center. The only pool rule was that you could not bring outside food and beverages, but had to buy those from the pool bar, which is very strange. The two-bedroom suite was spacious, full-sized kitchen, large living room, a private balcony overlooking gardens, DVD player (movies are charge), flat-screen TV in the living rooms, and older TVs in bedrooms. The master bedroom has a king bed with soft mattress and duvet, large bathroom with shower and Jacuzzi, smaller toilet. The other bedroom and bathrooms were a bit smaller and there were two European-style beds there (hence International name?), which are only good for pre-teenagers. The only other omission was complete absence of shampoo. When we asked at the service desk they told us that the were not a hotel to carry the shampoo, but a resort. We went to nearby Radisson hotel, where two shampoo bottles were complimentary given to us by their front desk shocked to learn that the Parkway International did not have any shampoo. As a time-sahre resort, they also asked us to come to 'learn about the resort', which we declined and they called every day and left messages; otherwise, they were not much pushy on the issue. The check out was good and they even printed airline boarding passes. Except the shampoo and odd pool rule, the resort is very nice for its class. we really liked the king bed and the pool area.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Dont Depend on your GPS”", "Author": "Ozad7880", "ReviewID": "UR81975365", "Content": "Like all the previous posts, a great place to stay in. Close to everything you could want to make your stay enjoyable and memorable. Only thing I could add for those traveling there for the first time, is to search for hotel name rather than the address. The address took us around in circles to no avail. When we called, we were told to go across from the Radisson on Parkway Ave. Found it easy.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“great place i will stay there again”", "Author": "nivo25", "ReviewID": "UR74837478", "Content": "it was really a great vacation the room was clean & comfortable we have been in the 2 bedroom villa it was big & we was 5 persons with a baby the babycot was great for my baby, the location also was great it took only about 10 min to reach all the parks, it was a great hotel i will stay there the next time if u need to enjoy go to parkway international hotel.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jrbjhb", "Title": "“Best Vacation EVER!”", "Author": "jrbjhb", "ReviewID": "UR73260840", "Content": "Based on Tripadvisor ratings we booked for the Parkway International through II almost a year in advance. Was it because we booked so early? I don't know but we got a unit RIGHT by the pool and our entire group just LOVED it. The 3 year old keeps asking to go back. There is a decided family atmosphere with entertainment provided part of the afternoon and on Saturday night. [If you need a nap in the afternoon request a place away from the pool/entertainment area. It can be a little noisy when they do kareoke with a mike, but otherwise is well insulated from outside noise.] There are restaurants all over and it is very close to Disney World. The three year old LOVED the nice playground and the nature walk which is quite extensive...a nice 8 or 9 minute resort board walk that takes you through real Florida \"jungle\" to a convenience store area that has restaurants as well. I loved the apartment and the pool, both of which were sparkling clean and the staff was as nice as could be. It is clear they aim to please and cheerfully provide you with extra towels, garbage sacks, or whatever as needed. Like most resorts they offer you a sales \"tour\" with freebies attached, but were nice when we declined. We have learned from experience that the time these tours take from your vacation are not worth it. We hosted our son, daughter-in-law and two grandchildren and there was plenty of room for everybody. My daughter-in law kept remarking on how nice it all was and how well designed the apartment was. We used the washer and dryer and went home with clean clothes. They have nice, clean gas barbeques and make a maintenace man available to start one up for you whenever you want. We used it twice and saved on eating out. The kitchens have everything you need.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Wonderful! Wouldn't change a thing!”", "Author": "Jcarerros", "ReviewID": "UR71823110", "Content": "I have nothing but positive things to say about this place. We will stay here everytime we come!", "Date": "July 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Great place, close to all the parks”", "Author": "CaribbeanTim", "ReviewID": "UR70917765", "Content": "Our 3rd time to PI and still a great place. We love having the condo feel being that we have 3 kids. Them having a separate room is what I wish we could get everywhere. The pool is not huge, but certainly adequate. The playground is great for the kids to run off steam too. We love being 5-10 minutes away from the Disney parks at this resort. The one thing we did not like this time or any of the other times is that they will not let you check in early. You have to wait around until 3-4 when they say the rooms are supposed to be done, maybe next time we will be able to get in a little early.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ma.", "Title": "“Great Value, Location, Service”", "Author": "maggiemagoo", "ReviewID": "UR61810766", "Content": "Traveled to Disney World with our 9 year old grand daughter. Exchanged a one bedroom time share in Aruba for this suite. Location was fabulous..minutes from Disney. Rooms were spacious and had all the amenities you need. Our room overlookede the pool. The bartenders, Norm and Greg, were great as were front desk staff, Kenney and Megan. Pool was clean, staff was helpful and pleasant. Lots of restaurants within driving distance, some within walking. Pulbix market just down the road. Older units, but well maintained. We were very pleased with the entire experience and would stay there again on the next trip to WDW.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, VA", "Title": "“Great place! Would definately stay here again!”", "Author": "keewart", "ReviewID": "UR60954142", "Content": "Just got back tonight from a week at Parkway International. Went with another mom and our 14 year old boys. Accomodations were perfect for us! Recently renovated, new kitchen cabinets, new GE appiances, stacked washer and dryer, tiled baths. The linens we had on the bed differ from the pictures....we had a white double sheeted down comforter (more like a down blanket) with a runner at the bottom, not a bed spread (this was much better). Some of the towels were a little thin, but we just used the other fluffier ones. The jungle theme is used quite a bit, although I wouldn't want it in my house, it was tastefully done. 2 flat panel tvs, one in the LR and one in the master BR. Another tv in the 2nd BR. We timed it: 3 minutes from our door to the Hollywood Studios entrance! Only a little longer to the other parks. The location can't be beat. The boys loved the Nike outlet that you could literally walk to. Prime Outlets are only several exits away on I4. Publix grocery is a very short drive away. The boys loved having their own bed and bathroom. Although they didn't go to the pool, the moms did and enjoyed afternoon drinks at the pool bar several afternoons. I wouldn't hesitate to stay here at all. If you are looking for a place with expansive lush grounds or golf course, you may want to look somewhere else, but this 2BR 2BA timeshare fit our needs and I felt more than comfortable staying there. I slept great every night. The other mom slept on the sleeper sofa and she said she slept great each night, too.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Emerson Park", "Title": "“Feels like coming home!!!”", "Author": "JudeEmersonPark", "ReviewID": "UR59637129", "Content": "We own two weeks here but came over for three. Weather wasn't warm but sunny and bright, though we did have 4 days in which the temperature was over 65deg. Nice enough to walk round Epcot and Hollywood studios comfortably and the other two days around the pool. We come back to our resort every 2 - 3 years. It is so convenient for everything, the apartments are kept beautifully and you have the presence of security guards keeping an eye out. We did a big shop at Publix so spent a few nights in. The other shopping was fantastic, had to buy another case.! We spent a few evenings over at Celebration Village and because we have been over so often its so easy to get from place to place. We hired a large car as friends from New York joined us for a few days, they love Parkway too! The staff are so very helpful and you don't get continuous phone calls or pressure to buy timeshare there. We have owned since 1990 and have not been disappointed once on our visits to Florida. The next time we go, we are hoping to take our grandsons who at the moment are 2yrs and 5months respectively. There is so much to see and do all within a 10 minute drive. Probably won't be back there for about another 3 years or so but know it will be like coming home!", "Date": "March 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Awesome place for a family visiting WDW”", "Author": "GeorgemTexas", "ReviewID": "UR59345094", "Content": "Our family of 5 stayed here for 8 nights in June 2009. We had a two bedroom two bath condo. The youngest one slept on the bed which pulls out of the sofa. We were very pleased. The pictures on the web site are mostly accurate. It is about a 10 minute drive to the WDW parking lots. The kitchen is a decent size. The pool area is nice enough for the kids, but not memorable. Did not bother to get our \"parking pass\" from the condo sales folks. Just made sure the security folks were OK with that. Never answered the phone either. Thus, zero sales pressure. We'll stay here again!", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkshire", "Title": "“All round excellent”", "Author": "DJC026", "ReviewID": "UR55963526", "Content": "I have actually stayed here a few times, April 2007 was the last time I went with my girlfriend, now wife. We had a two bedroom apartment, with 2 bathrooms, lounge and kitchen area. The units are excellent in cleanliness and space, we could have easily had 4 people in there and with the pull out bed in the living area, 6. The unit also came with a balcony, which had a net to stop mosquitos getting into the rooms. The kitchen comes with all the utensils such as kettle, toaster etc. The rooms are well decorated (its based on a jungle theme) and it is very much like living in a home away from home. Outside of the unit there are 'safari walks' around the wooded areas, which are pleasant. There is a kids area with slide and swings and a small games area with a couple of arcade games. This backs on to the pool area, which is a large pool and a couple of spa baths. There is also a bar area around the pool, which does serve food too. The resort also has a small gym and tennis court. It is generally a quiet place reagrdless of business, the staff helpful and well maintained throughout. The location of the resort is excellent, near restaurants and shops and all the major parks. We would definitely stay here again and recommend it to others.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "winnipeg", "Title": "“This place is wonderful , will be back for sure”", "Author": "WinnipegDonna", "ReviewID": "UR54122790", "Content": "We stayed at this hotel from dec31 to jan 10 , 2010 .I was actually scared before we got there as it seemed too good to be true for the price . Seeing the pictures didnot reassure me as I have stayed places before and the pictures of the place don't even reseble the hotel . In this case it was even better and nicer than the pics.Location was great , all comforts of home and didn't hace to take dirty laundry home .Beautiful well kept grounds ,very nice staff and security. also didn't hear neibour noise.We will be staying at this hotel again in 2 yrs when we return.having a nice place to come back too after being a tourist for 12 hrs a day with tired feet , was very comforting .comfy bed too .Thankyou for helping our vactation a perfect one .", "Date": "January 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rhode Island", "Title": "“Great Stay”", "Author": "kr7757", "ReviewID": "UR53747572", "Content": "I stayed for one week. It was clean and neat. I would stay again. The staff was pleasant and no one tried to sell me anything. The check in was fast and pleasant. The only con to my stay was the singer by the pool was much to loud and awful. Also there is no elevator, we had to climb to flights of stairs with our luggage. However, the condo was great and I loved the screened-in patio and washer and dryer. The location is great.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "puerto rico", "Title": "“Just Great”", "Author": "monicacaguas", "ReviewID": "UR53400756", "Content": "I stayed 6 nights with my husband and two kids (9 and 10) . I was worried about some web sites bad reviews but because of the low price I take the chance and was wonderfull. The location is excellent just minutes to the Disney parks and near restaurants and stores (GREAT). The check in was fast (we always arrive after check in time). The villa is BIG . The kids have their own room, their own bed, their own bathroom , their own TV so, they were happy and we too.The master room is very spacious, the bed is comfortable the master bathroom have a jetted whirpool. The kitchen is very clean and well equipped , the washer and dryer works very well. My villa was a first floor has I requested (thank for the tip) with a great pool view and a balcony . The least I liked was that our second floor neighboors footstep wake up us at 7:00am. Every morning at the lobby there were complimentary coffe and snacks. Pool area is clean, and very pretty. GREAT VALUE AND A GREAT STAY. People dont stay at a hotel room.This type of resort have everything and a good price.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "West Virginia", "Title": "“Best location”", "Author": "MancieWestVirginia", "ReviewID": "UR51227166", "Content": "This resort was located in one of the best spots you could ask for. It was so close to Disney, resturants and downtown disney. The resort was so quiet and a pleasure to talk to anyone you come across. The staff was great to help you with any of your needs and so friendly. The only thing the I would change if possible is that we stay for two weks instead of one. I sure we will return", "Date": "December 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Feels like home”", "Author": "NorwegianMama", "ReviewID": "UR49055635", "Content": "We having been traveling to the Disney area for over 15 years with our extended family and we have always chosen to stay at Parkway. When other family members have stayed at more \" fancy \" resorts we have all ended up hanging out at Parkway. It is not a very large resort and has a very nice pool area. It has a great location, easy drive to everything. I feel comfortable telling our teenage children and their younger cousins to go hang out at the pool. We have always been lucky and had a room on the lower level near the pool. The room is always clean with plenty of room. The kitchen is well stocked with supplies, because we always cook breakfast and dinner at the resort. The activities offered Thursday thru Sunday and enjoyable. The kids love Bingo and the adults love blackjack. We paid only 80 dollars a night for our last visit, a great deal, even in the off season. We feel very comfortable and safe at this hotel. They were also very nice and let us in our room early at 1100 am, as someone on our trip was sick. They also rearranged rooms to put our family all near one another in the same building without us requesting it.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "ontario", "Title": "“Great value - will come back!”", "Author": "OntarioHopper", "ReviewID": "UR48363520", "Content": "We stayed for 7 days while visiting the Disney parks and absolutely loved the condo and area. We were on the ground floor facing the pool and playground which was great with kids. The condos are at least 10 years old but they were clean and very spacious. Two big bathrooms and bedrooms and tons of space to store your things (much better than a hotel for a week). It had everything we needed. The pool was nice and clean and never busy. The rooms were VERY quiet/soundproof and we never heard our neighbors. Our son was in the back bedroom which is close to the airconditioning and hot water unit and he did complain a bit that they were noisy but we didn't notice. The fitness center was small...my husband used it and said there was only 2 treadmills and an exercise bike and stairclimber with weights. It's a 3 minute walk to a few good restaurants (loved the Kobe Steak house) and a 5 minute walk to Starbucks. Just ten minute drive to Premium Outlet and the Publix grocery store is a five minute drive to pick up breakfast foods and snacks. Our only warning - fight off the time share people with a stick! My husband got sucked in...they promised us breakfast and a $100 visa gift card for only one hour of our time. 90 minutes later after a dry bagel and old piece of fruit, we had to firmly say NO and then they were suddenly very curt and unfriendly. We did get the gift card after another 30 minute wait and it wasn't worth the hassle. Just say no when you check in and the resort itself is perfect.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Berkshire, England", "Title": "“Overall a good stay”", "Author": "Traveller from UK", "ReviewID": "UR47621283", "Content": "We recently stayed at the resort for six nights and had a mostly positive experience. There were a few little niggles starting with when we tried to check-in. We knew we were a bit early but the woman on reception was quite curt and kept telling us there was no way we could enter our apartment until the proper check-in time of 4.00pm as it wasn't ready. Because it was only 2.15 pm we accpeted this but....at no time during the next 2 hours did anybody go near our apartment as we parked outside it to wait!!!! The decor is indeed a little dated but the apartments are great value for money and are well equipped with everything you could possibly want. Maid service is available but we didn't use it. However, the floors (we think it was the carpets) were filthy and we my husband's white socks were soon black!!! While we were there the pool was closed for renovations for two days which was a nuisence to say the least. We were able to use the pool at the condos next door but it was quite a long walk and by early afternoon, the pool there was in shade. Overall we had a very nice stay and would probably return as it is such good value. We were not bothered at all by any time-share people. These apartments", "Date": "October 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Mississippi", "Title": "“Great value. Comfortable and convenient.”", "Author": "scm5g", "ReviewID": "UR46389523", "Content": "Was a great place to stay with family to visit Disney. Next best thing to staying in the park. It was very close. It was clean and comfotable. Decor was a little dated, but nothing was shabby. Definitely recommend.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Cleburne, TX", "Title": "“Close To Disney- Kissimmee, FL”", "Author": "ldorrn", "ReviewID": "UR45216896", "Content": "This is a condo with two bedrooms/ two bath, full kitchen, washer/ dryer, screen porch with table, 3 t.v.'s with dvd player, living room, diner table, front and back door. We were going to Disney and had friends there in Florida and they stayed with us there. ( No extra person charges.) This was a GREAT price and it would be great for a family. Master bed room was large with king size bed, a large bathroom, 2nd bed room had 2 twin beds and a sofa bed as well in the living room. It had a nice enclosed playground for the kids/ nice pool with bar. If your nasty and can't clean up after yourself and need maid service this is not for you. (thou, I do think you can add daily maid service If you want) If you want a large condo and not a two room hotel at a great price this is it. The room was VERY CLEAN! As were the grounds as well. Wire-less Internet was not free :( , about $10 a day. But, ther was a Starbucks just up the street if you want free internet with a good cup of coffee. :) Everything you need is in the kitchen, plates, flatware, glasses. They did have snack type stuff for free at breakfast at the front desk area. Golden Coral Restarant was the best deal for breakfast, when eating out. Looks like it cost more up front but you get a MUCH better selection of better food and all the juice you want in the price. Everywhere you go the prices were the same for breakfast by the time you walk out the door. For all-you-can-eat lobster and snow crab there is a place just down the main drag to the left of the light. Mike's or Bob's something like that. The food was great and the people and service were even better!!! There's another one at a hotel , we tried both, this one is better by far! They'll show you how th get the tail out of the lobsin about 2 seconds! And then just eat till you pop! LOL The people at the Condo were very nice and they exchange lien on wenesdays or sooner if you ask. It felt more like home than a hotel, which I liked. We rented a car which was nice. I think a bus service runs to disney from the main road about t 1 1/2 - 2 blocks away. But, I'm not sure. Parking at Disney was $12 a day. No discount or multi day passes for parking (which I didn't like Mickey!!!). We had 5 day passes to the parks. Only a few more dollars each day after the first 3 days. You can take in bottled drinks as of this writting in like a butt bag and snacks. (Freeze the bottled water the night before.) All bags are looked in at the entrance at Disney. Get FAST PASSES for rides. They're free. Have fun! :)", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ontario", "Title": "“Outstanding”", "Author": "gennie09", "ReviewID": "UR41746217", "Content": "Just returned from our stay at the resort with my spouse, our daughter and our five year old grandson. We had a marvelous time. The resort is everything that we expected and more. Quiet, close to parks, restaurants, shopping, clean, clean, clean, specious unit, friendly service. Prior to booking, I had researched the resort (had stayed in Liki Tiki previously), but wanted something closer to I-4, knew that it was a time share resort, didn't have daily \"maid service\", didn't have an elevator or other \"perks\" that some of other reviews complained about. We were on the third floor overlooking the pool (at our request). We didn't have a problem putting on a dishwasher or a washer before either heading down to the pool or out the parks. Our grandson especially liked the decour of the unit and the resort - he calls it the \"jungle\". Couple of minor complaints, if any, (1) trying to get you to commit to attending a timeshare presentation (although they don't tell you that's what it is) the following morning, as you are picking up your parking pass - a firm NO did the trick. (2) The vanity in the master bathroom (at least in this unit) is very small. No room to put anything on the counter and no shelving (except for space underneath the sink). The shower is on the small size, however, the jetted tub is huge. The vanity in the second bathroom is larger with additional shelving. Overall, there is plenty of storage space. We are definately looking forward to returning.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Nashville", "Title": "“Maybe GOLD CROWN back in the day!”", "Author": "cage94", "ReviewID": "UR38159697", "Content": "This is obviously an older timeshare resort. Don't get me wrong. The rooms themselves were a refresher after pulling in. The place is a victim of times. We are use to the newer resorts (We enjoy Marriotts). And this place has done a good job trying to keep up. I wouldn't say I would never stay here again but it certainly is not my top 5 in choices. We like to get on the top floor anywhere we go. This place will accommodate you with that. Why? NO ELEVATORS. BEWARE. I'm a fairly young man and was able to do it ok. But I wouldn't want to again. I like elevators. I do not like to work to hard on vacation. Even with elevators I might (maybe say it was a silver crown). But let me say that the actual rooms themselves we pretty good. I did not like them having 2 entrance doors. Especially with toddlers running around. They try to get you to do the timeshare thing. Beware. We know how to handle it. So come prepared. Had a pretty good trip though. Pool is okay. Like I said this place is just a victim of the times.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“Location, Location, and CLEAN!”", "Author": "ReviewReaderMom", "ReviewID": "UR35307849", "Content": "We traveled with our 3 year old and 3 of the grandparents for our 1st disney experience. We own a time share in another state and opted to trade this year for our trip to Orlando. As it goes with timeshares...what you see is not always what you get (or what they sell to you!). Over the years I have found that you really need to carefully check out the places you trade for because so many of them are crap, run down, and filthy. I am admittedly neurotic about where we stay when we vacation and I spend countless hours (much to my husband's dismay) researching and reading mutiple reviews from many sites before I commit. Of course I like places that feel a little luxurious, but I will trade luxury any day for CLEANLINESS!!! With a toddler, I want a clean place more than anything else...the Parkway met the requirements. We had a 3rd floor unit (2 bed/bath) and the 3 grandparents shared a 1st floor unit (2 bed/bath). I called ahead to ask for one unit to be on the first floor for the grandparents (no elevators at this resort) and even said I preferred at least one 1st floor unit over the units being in close proximity to each other. The front desk was wonderful and not only gave us one 1st floor unit, but made sure they were in the same building. Nice. This is not a luxurious resort, so if you are insistent upon modern furnishings, decor, and the very best quality of everything (as many timeshare owners are), then you should not stay here. It is NOT the Ritz, but it is very comfortable and very clean. If you just want a spacious, comfortable place to come home to in the evenings from the parks, then this is your place. The kitchen and bathrooms were spotless and well kept. LOVED the very clean jacuzzi tub after walking 10 hr. days. As in another review, the master bath shower on the 3rd floor is fairly small, but again, IT IS CLEAN. They do only provide clean towels in the middle of the week, but I've learned to just take a small bottle of laundry detergent (they did actually provide some detergent) and throw them in the wash myself when we need a new supply. Again, if you need to be pampered the towel thing might annoy you, but washing a load of towels once during the week was not a problem for us. They provide a stacked washer/dryer unit that worked fine and quickly. Also, I read some complaints about paying for maid service...we were only there one week!! I don't need someone to pick up after me every minute and I actually prefer no one enter my unit during the week, so yes we emptied our own trash and ran the dishwasher ourselves. The ONLY issue with anything being unclean at all, was the tile floor in the living room on the 3rd floor. It was swept and free from debris, but it could have used a wet mop and a nice floor rug just to \"warm\" up the atmosphere a bit:) The living room in the 1st floor unit was carpeted and felt a bit cozier. We stayed over the July 4th weekend and the resort was not crowded. In fact, we found it to be fairly quiet and private the whole time we were there. We finally realized we had neighbors when we saw their pool towels on the rail, but never heard nor saw anyone :) Parking was never a problem and many spaces were available right in front of our unit. We used the pool on two occasions in the late evening hours and it was clean. Our screened in porch over looked the pool and even when it was the busiest, it never seemed overcrowded. Buildings C and D are a perfect location for using the pool. We had a back door to our units (C building) that went out to the pool, shuffleboard area, grills, picnic areas, childrens playground, and poolside bar/restaurant. Our location was perfect. The playground is a very nice ammenity for small kids. Well kept, looks new and safe. We used the small arcade for a few minutes also. Probably wouldn't occupy teens very long and the games seemed old. We had a huge flat screen in the living room with a DVD player so just bring your own game system. We did call in an order to the pool side restaurant one evening and just went down to pick it up and bring back to our room. Food was good and resonably priced. Not open very late though during the weekdays, so plan accordingly. Plenty of restaurants in the area and we never minded driving so it wasn't a problem for us. I knew about a small waterpark at the Parkway's sister resort from all my research so I asked about it (no one mentioned it at all during check-in) at the front desk and was given directions (about 8 miles away, very easy and quick drive) and a pass to get in for a $5 fee. The pass was good for one day. We loved the waterpark! It was small and so were the slides, but perfect for school age kids. Also had a toddler play area. Again, teens would probably be bored by it pretty quickly, but youngers kids seemed to love it. Location: We went to the Disney complex (parks and downtown disney)everyday and often more than once during the day. VERY close. Maybe a ten minute drive into the main gates and never encountered any traffic even after the fireworks at Epcot on the 4th. The parking pass into disney is $12/day but it's good for the whole day AND at ANY of the 4 parks during the same day so if you park hop, you just pay the $12 once a day. Aside from staying on the Disney resort, you can't pick a better location. I would recommend this resort for a family with young kids anyday and we will stay here again! Just a few cons to be very picky (and for management to read)...water pressure in master unit shower was like being beat to death. I actually dreaded getting in because it was so hard, and I felt like I was draining a small river somewhere. In the days of going \"green\" it was definitely wasteful. Not enough (nearly none) towel bars/hooks to hang wet towels. They could easily add these on doors, etc. Master bath vanity on the 3rd floor unit was so narrow, I could only leave my toothpaste on the counter. No room for anything else on the countertop, so I had to use the second bathroom vanity top for make-up, hair supplies, etc. However, the 1st floor unit had a large vanity to in the master bath, so it just depends on your unit. 3rd floor units have more square footage (about 500 more!) and very high ceilings, but the 1st floor unit was still very comfortable for my parents and mother-in-law. 3rd floor unit had a \"wet-bar\" in the living area, but not 1st floor unit. 3rd floor unit had wardrobes in master suite, no closet or night stand, but a large closet just outside door in the living area. Not a problem, just be prepared. 1st floor unit had a closet in master suite and night stands...again, just depends on unit. My only REAL complaint is the $30 fee to use their WiFi (or $8 for 24 hrs.). Really ridiculous...it's 2009...even my dentist's office offers free WiFi!!! I hope they change this policy before we return. :)", "Date": "July 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Massachusetts", "Title": "“Not What Promised”", "Author": "TWold", "ReviewID": "UR35013215", "Content": "When arriving at the resort, was very disappointed. Resort was no where near a 5-star resort. Basketball court was a hoop in the driveway where cars would have to be moved to play. There was no housekeeping, unless you wanted to pay extra, clean towels where exchanged on Wednesdays only, but if you complain you can get them when you want. Pool is very small and not clean. There are no activities offered such as a regular resort would offer. Coffee maker did not work and when asked for a new one, was told I would have to wait until 8:00 am when staff arrived meaning I would have to wait 2 hours for my morning coffee. Exhaust fans in bathrooms did not work. Grounds were not kept clean. The only good thing, it was close to the parks. Would not recommend this resort to anyone.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City, NY", "Title": "“Home away from home and more!”", "Author": "DrCrazyA", "ReviewID": "UR30509242", "Content": "The Parkway hotel offers huge rooms with all the amenities of home - washer, dryer, detergent, paper towels, full kitchen and utensils. It's great for large groups/families because the bedrooms are huge PLUS the living room can sleep quite a few as well. Very quaintly decorated. Immaculately clean. The theme parks are within a 10-15 minute drive from the hotel, so as long as you rent a car it's totally worth staying here at a fraction of the cost of staying at the theme parks. Not much in terms of food or even coffee there, but there are decent chain restaurants on the same block, or you can pick up groceries and cook/reheat leftovers since there's a full kitchen. The grounds are generally very quiet and peaceful. This is definitely where I'd stay if I returned to Disneyworld again.", "Date": "May 22, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Surpassed Expectations”", "Author": "QueensMarine", "ReviewID": "UR28519020", "Content": "This place exceeded my expections from all the reviews I read. The accomadation had two bedrooms, two baths a living room, kitchen with everything you need, a full sized fridge, microwave, toaster, dishwasher, full sized oven and much more. We had three TV's and a small area behind the kitchen with a washer and dryer. It was very clean and tasteful. Their is a Publix supermarket next door which you will need your car to got to. You can walk to a smaller supermarket/grocery type store. This store is was about a 1 minute walk from the hotel that does not require you to cross any streets or use any public sidewalks to get to. The pool area was great and not as small as some reviewers have said. The whirpo0l was also very nice. The pool area also has a bar that serves drinks and food. The pool area also has activities for the kids during the day for a nominal fee such as crafts. The hotel also has bingo games and black jack somenights. One night included musical entertainment by the pool area and a fish fry which cost $8 for adults and $6 for kids. The resort also has gas BBQ's that you can use although no one used them during my stay. Tennis courts and shuffleboard are also available. This place has no room service unless you request it for a fee. The master bedroom had a whirlpool tub in the bathroom. My only complaint was that to use the WiFi service you have to pay a $30 fee for one week or $8 for 24 hours. This really should be free during this day and age. This is a time share location. Initially when I checked in they asked me if I wanted a free breakfast and free tickets to which I said no and I was not asked again about the subject. The next morning I received about two phone calls and a knock on the door. I ignored this, learning from previous posts that these were the time share peolpe, and was never bothered again. If you stay call ahead and ask for a room that faces the Pool if you don't want to walk far or if you want to watch you kids. Each room has a small screened in porch. Mine faced the pool area and was very nice to have breakfast in the morning. If you have trouble with a lot of steps also ask to be on a bottom floor. I was on the third floor and this was a little difficult for my father in law who has had a hip replacement. The hotel is right next to the I-4 and the all the Theme parks are from 5 to 15 minute away. Their are countless eating areas from simple fast food to steakhouses in the immediate area. I can't wait to go again.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Albany, NY", "Title": "“Loved this Place!”", "Author": "joancrounse", "ReviewID": "UR28315715", "Content": "Wanted to add another positive review. Rented here because of the photos and TripAdvisor reviews and was not disappointed. Lovely spacious rooms, spotlessly clean. Staff went over and above to be helpful. The balcony was a great place for breakfast, especially coming from the cold northeast. Plenty of room to have the family stretch out, we never felt crowded. Very centrally located to the parks and not a bad drive to the east coast. I couldn't imagine going anywhere else on our next trip to FL.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "wexford", "Title": "“Great Place, Great Location and Great Space”", "Author": "silverliningIreland", "ReviewID": "UR27469630", "Content": "We have just returned from the Parkway. we are a family of 2 adults and 4 children aged 6, 7, and 15 year old twins. We all enjoyed staying at the Parkway. The Accommodation was spacious and we did not feel 'on top' of one another in the least. The Kitchen was so well equipped, it was like a home from home expericene. Only dirty washing I had to bring home was the Pj's as had washed and dried (with the appliances) as I went along. The pool area was lovely and not at all packed. There is a games room, a playground, a shuffle board area and also gas bar-b-q's which can be used at your convenience. The Radisson Hotel was across the street and was nice for my husband and I to go over a couple of nights for a quiet drink. The location was within easy walking distance of old town and an abundance of restaurants and shops. The disney parks were all only a 10 min drive away - perfect! I would definitely go back to the parkway and look forward to our next visit. Also a visit to Downtown disney is a must and especially go see Cirque du Soleil - you will be mesmerised!!", "Date": "April 5, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Value": "5", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Great Value”", "Author": "ricmiclab1", "ReviewID": "UR27410834", "Content": "We found Parkway International to be an excellent value for the package price that we paid to stay for a week. This is our 6th trip to the Disney area and I found this resort to be the best value for the money that we have so far stayed. I'm assuming that all rooms in this resort are the same with two bedrooms, a living room, a kitchen (with fully stocked utensils), a small laundry area w/ washer & dryer and two bathrooms (one adjoining the master bedroom and the other just across from the 2nd bedroom). The kitchen saved us a bit of money with a Publix Supemarket just down the street. We were just minutes from the Disney property and felt like we really received our money's worth at this resort. Be aware that there is no daily maid service provided for a week's stay. We did have one little \"glitch\" whereby there was sand in one of the beds when we first checked in but a maid was quickly sent over to change out the sheets. We didn't hold this against the resort as they were more than accomodating in charging us one less night's stay when our flight was cancelled due to weather conditions and I gave them less than 24 hours notice. One other thing. This is a timeshare resort but we were never approached or pressured. The only contact we had with a salesperson was after we checked in at the front desk they send you across the hallway to get your parking pass. I was delayed for a minute here as I was offered a free breakfast where I could hear about a timeshare offer and receive free tickets, etc. I just said I would think about it but never committed or attended. We have stayed at a different resort on each of our Disney trips but I would definitely consider this one again in the future.", "Date": "April 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "bristol,U.K.", "Title": "“Nice location and friendly staff”", "Author": "collettebristol_U_K_", "ReviewID": "UR26412421", "Content": "We stayed at the Parkway for ten days.The suite was a very good size,and had everything you could need-dishwaher,washing machine,dryer etc.A nice touch was the bag of tissues,paper towel,washing and dishwasher powder put ready for you,along with coffee,sugar and creamers.Good idea for guests that dont want to stop off on their way to the hotel after a long journey,Swimming pool area was really nice,with a poolside bar.Children seemed to enjoy the games room. The only thing that let this resort down was the rooms were soooo dark.We had the lights on constantly.Apart from that though,we really couldnt fault it. Would I stay again? Most probably,yes.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Carlisle-UK", "Title": "“Great stay pity about the cutlery!!!”", "Author": "DouglasCarlisle_UK", "ReviewID": "UR26071705", "Content": "Stayed here for two weeks on an exchange timeshare the room was spacious, clean & had a very good kitchen area. Checking in was easy the staff were great & the rooms were ready. There appears to be no maid service as such if you wanted towels & a change of bedding you had to ask for extra. Good pool area with childrens playground & great hot tub after long days at the theme parks. Our main & only gripe was that after about a week when the rooms change over the kitchen utensils were removed so we came back on the night to find spoons missing & other kitchen equipment missing very strange. When we informed the front desk they just issued us with new ones they said they would inform housekeeping no real explaination. A few days later we would discover glasses & chopping board missing so we had to ask for more although we were never charged for any of the missing items. Other than this the complex was superb clean & tidy & only five minutes from disneys hollywood studios no more than twenty from all Disney complex on the US192. Access to all areas are easy from this resort, there is a Wal-mart nearby & Old Town two minutes down the road. Its was a great stay & a super complex but they need to get the housekeeping sorted out but apart from that it was quiet pleasent stay.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ohio", "Title": "“great room for the money”", "Author": "zoom8942", "ReviewID": "UR25610012", "Content": "we just stayed 5 nights at this hotel after getting a great rate off hotels.com. rooms were huge and offered anything you could want in a room. this was our first time staying off disney and was afraid it would loose the disney feel, but it didnt. the rooms were decorated in safari theme, we had a 3rd floor room and loved the high ceilings but hated the walk(no elevators) the washer and dryer came in handy as my little one was sick a couple days and needed washing done. the dislikes- ( im being nit picky)the floors were a little dirty, socks were brown, ring around jacuzzi tub(cleaned it myself and still used it and it was awesome) $7 a day for crib so brought my own pack n play the likes- nice heated pool, kids loved the playground,tennis court, game room,nature trail. lots of room, beds were comfy screaned in porch", "Date": "March 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“Can't wait to return”", "Author": "our3boys", "ReviewID": "UR25115099", "Content": "Even though check-in is 4:00, we were hoping to get in early after reading some reviews and couldn't.(driving 17 hrs and pouring rain with 3 children) But after we got in, it was well worth the wait. The staff was great. (Lobby closed at 10:00, don't know what you would do to check in after that) The water pressure in the shower and jetted tub was TERRIFIC! (towel bars in each bath) Plenty of storage, under wetbar, and in tv cabinet, each bedroom had a dresser and nightstands, closets in each room and hall. They also had a can opener, hand mixer, blender, 2 patty sized-george foreman, icemaker in freezer, among others people have mentioned. Cleaning service is available for more money, which I would rather bring some clorox wipes and spray to do myself and you know how clean it really is (as I do anywhere I go) The only reason I gave it a 4 on cleanliness is because when you walk in it looks very clean but as I was wiping down, there was some ketchup splattered on the dishwasher and the shelf in back above the jetted tub needed cleaned, etc. Lots of lights and many lamps that could be adjusted by the 3-way switch. The 2nd bedroom was not as well lit. Had ironing board & iron. The decor was very nice. Landscaping beautiful all the way around. Usually only a few people swimming at most with others at tables or lounging. We loved the 2 nature trails, and the ducks eat out of your hand (snakes basking in some branches obove water) Lots of nature to discover. We absolutely loved it. It is definitely better than a hotel and reviews were better than anywhere I looked including the more upscale places.", "Date": "February 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tenafly, New Jersey", "Title": "“Large clean villa in convenient location”", "Author": "tenaflymom", "ReviewID": "UR24915694", "Content": "This was a bit different than other hotels we've stayed in in and out of the Orlando area. Lower in star rating but it was an excellent value for what it was. The stretch of Irlo Bronson is like chain restaurant central with Shoney's, Golden Corral etc. Our favorite was Logan's Roadhouse down the street next to the Publix. Pretty good ribeye steak w/ grilled vegetable skewer and incredible hot butter rolls. You can pick up some breakfast and lunch supplies at Publix while you're there.", "Date": "February 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dunham, Quebec,", "Title": "“Thumbs Up to Parkway International”", "Author": "darigg", "ReviewID": "UR23791666", "Content": "My wife and I enjoyed our first stay at this resort. The jungle theme throughout the resort was nice with lots of trees and nature trails. You didn't even know you were near two major highways (I-4 and 192) The room we had on the third floor was beautiful. High ceilings, tiling and wallpapering were nicely done. The screened in porch overlooking one of the treed areas made breakfast on the balcony very relaxing. Both Ida and Carmen were very helpful during our stay. We were coming from another resort the week previous and we had to be out of that resort by 10AM. Normally checkin at the Parkway is 4PM, but Ida was helpful in allowing us to book in early so that we could put our perishables in the fridge right away without spoilage occurring. There were a few little issues at the resort that could have been improved on, but they were minor and we would not hesitate to book here again. For example, the pool bar wasn't open every day, you had to pay for internet use at Guest Services, the water pressure could have been better in the shower and the mattress was rock hard. The amount of trees around the pool shaded the pool over quickly, but I'm sure at another time of year this is not a problem as the sun gets higher in the sky. The timeshare salespeople could have been a little more discreet with their salesmanship. Considering that they were selling timeshare to a nearby resort, often they would walk through the pool area talking to their clients, sometimes quite loudly. They would even sit by the pool and we could hear the entire business discussion quite easily. Other than that, it is a beutiful resort with a great location near Disney World and I would recommend this resort to others.", "Date": "January 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Princeton, NJ", "Title": "“Two Thumbs Up”", "Author": "Woolewoman", "ReviewID": "UR23749394", "Content": "We were originally booked for another location, but they did not have the room type we requested, so we were upgraded to the Parkway International. At first I was a bit hesitant, it was very last minute - boy am I glad we took their offer. The suite was spacious, well laid out, and absolutely spotless. The kitchen was well equipped: toaster, blender, even a waffle maker. There is a Publix supermarket just down the road, making shopping easy. It was only 5 minutes to Disney, yet tucked back from 192, so quiet as could be. We got no Timeshare Pitch at all, just friendly, courteous service. I would return in a heartbeat (especially since it is 19 degrees outside as I write this).", "Date": "January 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“An absolute nightmare......Beware!!!!”", "Author": "Vacation807", "ReviewID": "UR23363242", "Content": "This could have been a fabulous vacation, but thanks to the absolutely negligent mgmt. at this place, it wasn't. Though we had been enjoying our vacation, on our 5th day there we left our room at about 9am for the day, when we were apparently given a phone message on our room phone at 10AM that they would be letting movers in our room to change out the couches. So what happened next you ask? My husband's $500 work phone was STOLEN!!! (and no, it wasn't laying out in plain sight either). I found out later the \"movers\" had free reign over our room long enough to find something easy to tuck away, and that was that. The worst part? ABSOLUTELY NO CARE/CONCERN or follow-up was ever made to us. The Gen Mgr. at the time, Jackie (that's all the info the front desk was \"allowed\" to give us) is completely unprofessional. I've been so steamed about this incident I waited several months to write this review just to see if I'd get ANY follow-up. NOT! While this place was clean and the ammenities nice, it doesn't mean a thing when your property and safety are on the line. PLEASE BE CAREFUL!!!", "Date": "January 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, FL", "Title": "“Best place in town!!!!”", "Author": "reviewstohelp", "ReviewID": "UR22506771", "Content": "I am getting ready to book a hotel stay for January 4th, 2009 and I did not want to go back to this hotel because we stayed here in January of 2008 and wanted to try another place. However, I have read the reviews for my other options and lastly I read the reviews for Parkway and I'm coming back. During our stay in January 08 I had a wonderful experience. Nice room, clean, spacious, with a full kitchen, washer and dryer, nice pool(not terribly cold for January) and closest location to Disney.", "Date": "December 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge", "Title": "“What a fab resort!”", "Author": "MirandaC_UK", "ReviewID": "UR21552218", "Content": "We booked through Greenbee.com which is run by Expedia for John Lewis. It was very cheap so I wasn't really expecting much & I was very pleasantly surprised. The apartment had two bedrooms, two bathrooms & a double sofa bed. The jungle theming was a bit OTT but the apartment was spotlessly clean & fully equipped, even pool towels were provided. We didn't really use the facilities at the resort as we were theme-parking every day & only discovered a programme of activities when we went to check out. The location is excellent - close to Disney, the I4 and right on the 192 with Celebration, Old Town, Wal-Mart & Golden Corral close by. We didn't appreciate the Timeshare pitch we had to endure to get a parking permit ''one hour of your time, free breakfast & reduced price themepark tickets'' - yeah right! Does anyone fall for that? ''it's not timeshare'' - yeah right! I'd definitely recommend Parkway International.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Perfect for our family”", "Author": "BIGRKH", "ReviewID": "UR21346645", "Content": "My family loved this resort and it was perfect for us. We are a family of 5 (three 13 year olds) so space is very important to us and this condo style resort offers plenty of space. Each unit has an oversized master bedroom with a king bed and a very spacious master bathroom. The second bedroom has twin beds with a 2nd full bathroom right next to it. This proved to be very convenient during that mad rush to get ready every morning. The unit also has a full kitchen, a washer/dryer, dining area, and a good size living room with a sofa/bed. Everynight when we got home from the parks we had plenty of room to relax. The location was great, 5 minutes from Disney & 20 minutes from Universal. The condo was very clean. My wife is very critical when it comes to hotel cleanliness and the Parkway passed the test. The unit and the property was very clean and well maintained. The staff was was very accomidating....we arrived very early and they let us check in. Be aware of the Time Share proposal by the gentleman who gives you your parking pass. I said I wasn't interested and that was that. I got a great deal through expedia and will definately stay again. Please be aware this is a condo not a hotel, there is no maid service or fresh towels. We just threw the towels in the washer every morning on our way out the door to the parks.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beatty, Saskatchewan", "Title": "“Great Resort”", "Author": "wrightwright", "ReviewID": "UR20785501", "Content": "This is a nice condo style hotel. It is close to the parks. The kitchen has everything that is needed. The master bedroom has a jacuzzi tub. The units have a washer and dryer. We were on the 3rd floor and those units have vaulted ceilings. Internet is available for $30 per week. The second bedroom has twin beds. Discounted tickets are available at Guest Relations if you want to listen to them talk about their Vacation Club. It is easy access to I4 and the toll road to the airport. There is a Publix and Walgreens just down the road.", "Date": "October 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "England", "Title": "“Nice apartment at a reasonable price”", "Author": "jweaver", "ReviewID": "UR19500989", "Content": "We spent 10 days here and had a great time. The apartment was massive for the four of us and it was very well equiped. Pool isn't big but it was never very full anyway. Location is good for Disney and ok for Universal / Sea World / Wet and Wild. A car is essential as there are no theme park transfers. Staff were always helpful. One word of advice: go to Publix for your shopping (less than a mile away), as the small shop near the resort can work out expensive even for small purchases.", "Date": "August 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wyoming, Michigan", "Title": "“FANTASTIC STAY!”", "Author": "EVIEGrandRapids", "ReviewID": "UR16765208", "Content": "We stayed at the Parkway through Interval exchange. I called ahead and spoke with Aida and requested room facing pool. We were assigned Conga 303 - FANTASTIC - thanks Aida :) The rooms were super clean (they've been remodeled recently completed) the area is super convenient - especially when going to airport - take Celebration Street and hop on 417 North - you're there! The Nature trail though small was very cool - Saw a Woodpecker - pretty big - pecking away. Also park rangers took away a Racoon - real big! - who was a \"nuisance\" to guest. I was lucky enough to take its picture - in the cage of course - All staff SUPER friendly. Even allowed for me to leave a gift for my uncle to pick up the next day (He lives in Orlando) Overall, yes not a \"luxury\" resort - but would not trade it for the luxury. The quiet - the rooms - all the best! Thanks to all the Staff at Parkway - When I go back to Orlando - will hold out to exchange here! By the way, my uncle who owns at Westgate was very impressed with the resort. Also we did visit Westgate for lunch with my uncle; and though the free lunch was nice; the noise; craziness; was not! I'll stay at Parkway without the free lunch", "Date": "June 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Nice and convenient...but”", "Author": "Dubya55", "ReviewID": "UR14605741", "Content": "Parkway International Resort was conveniently located to attractions in Kissimmee and Orlando. We went for spring training games, and the Braves stadium is only a mile or so away. There is an excellent steak house within walking distance of the condo's (Charley's). The problems we encountered with the condos are minor, but worth mentioning anyway. There were two bedrooms and we were with another couple who took the master bedroom while we took the other one with twin beds. The twin beds were like sleeping on a torture rack. Hard as plywood. They really need to replace them. The business center was open, but their computers and printers were not working so they were not any help printing out boarding passes for our return flights. We stayed on the third floor and as far as I know there were no elevators to get there, so if you can't go up stairs you better ask for a first floor condo.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Shepherdstown, West Virginia", "Title": "“Small resort, very close to Disney and highways”", "Author": "Zaphod", "ReviewID": "UR14168799", "Content": "We stayed at this resort as a base for taking in a bunch of MLB Spring Training games, as well as visits to the Universal theme parks. We stayed on a timeshare exchange belonging to one of my travelling companions. The resort's proximity to I-4 and route 417 (the Central Florida Greenway) makes it a great location for heading west toward the Tampa area and east toward the Space Coast. The south entrance to Disney World is less than a mile away, and the Wide World of Sports complex (Spring Training home of the Atlanta Braves) is only minutes away. The resort is fairly small and somewhat spartan. The pool is nice and has a bar/snack bar, but other than a tennis court and a shuffleboard court, there isn't much in the way of ammenities. The \"nature trail\" is a short boardwalk that leads to the Vacation Village Resort. The people at the front desk are very helpful and pleasant. I especially want to compliment Farena (please pardon my possible misspelling). We showed up around 10:00 just to scope out the place, and inquired about early check in. She said it was doubtful that anything was ready, but offered to start the paperwork for us and asked for our preference in buildings and floor. We asked for third floor with the balcony facing the woods where the natue trail is. She discovered that there were actually two units cleaned and ready to go in the building we wanted. We were in the unit within five minutes!! (Building H, third floor) The units are comfortable and well laid out. The main problem is that the second bedroom only has two twin beds which are not very comfortable for an adult. Also, while smoking is not allowed in the units, it is allowed on the balconies. The folks below us smoked out there pretty frequently, and the fumes drifted directly up into our balcony. We had to move inside and close the doors to keep the smoke out of our unit. Ugh! The kitchen contains a is fairly well stocked with dishes, utensiles, and pots & pans, however it does lack a dish drain for the items that you wash by hand. While this resort does not compare in overall quality to the Marriott Grande Vista or the Sheraton Vistana, it is perfectly adequate for a week-long stay. Unless they provide larger beds in the second bedroom and ban smoking on the balconies (like Marriott Grande Vista has just done), I probably wouldn't stay here again. If these features aren't a problem for you, I would recommend this resort.", "Date": "March 9, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "rochester, ny", "Title": "“A very nice place”", "Author": "schomper42", "ReviewID": "UR14138781", "Content": "I took my parents there and stayed in one of the 2 bedroom 2 bath units. It was fantastic. A great pool area. About 1100 square feet, jacuzzi tub, 3 televions, screened in porch, it was great. A very nice kitchen, an overall very nice layout and roomy. Very clean and we just loved it! I hope this helps someone.", "Date": "March 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“This Place was Perfect for Us”", "Author": "nosnowbird", "ReviewID": "UR12789143", "Content": "This place was absolutely perfect for us and exceeded all of our expectations. Our purpose for selecting this resort was based on a need to be close to the Florida Hospital - Celebration Health for 10 days. We desired to set up houskeeping instead of being holed up in a hotel for our time in the area. We searched the internet for lodging close to the hospital and sorted by the most reasonable price with the best reviews. The low nightly rate plus a few unpleasant reviews (mixed in with mostly positive reviews) had us a little concerned, but we booked anyway. Once we arrived, we were simply blown away by the accommodations. The rooms are very large and spotlessly clean. The grounds are mature with lots of plantings and large trees. We were really pleased with the discovery of boardwalk trails through the woods, some leading to a grocery story and restaurants, and some leading to neighboring resorts and some leading to even more trails. These walking trails became very important to us and we walked them every day. They are even lit up at night. The Parkway International Resort is only about 1/2 mile from the hospital. Another big benefit for us. The room as I mentioned was perfectly clean and well laid out. 3 TVs with a big screen in the living room. Two bedrooms, two bathrooms, full kitchen including dishwasher and washer & Dryer. There was even a bag of basic supplies on the kitchen counter waiting for us when we checked in. The room and grounds were quiet and we spent a lot of time on the screened in porch drinking our morning coffee and listening to the birds in the woods just outside. There were absolutely no bugs and we really wonder how anyone could write a negative review on this resort. On top of everything else, the staff was always very pleasant and helpful and flexible to our needs. Our stay there was wonderful and we hated to leave. Bottom line.....This place was just perfect for us and we will gladly stay there again and we will highly recommend it to anyone.", "Date": "January 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vero Beach Florida", "Title": "“Great well run clean resort”", "Author": "jhillflorida", "ReviewID": "UR12450950", "Content": "we have stayed at Parkway three years in a row and it is a very nice resort. When we last stayed in January of 2007 the resort was currently being renovated. We stayed in a suite that had not been renovated and it was still very nice. We are looking forward to staying there in January of 2008 and we understand all of the renovations have been completed. This is a very well run resort with an extremely nice pool and hot tub area. It is very close to everything. The rooms are very nice, very much like a place you could live at year round with a nicely equipped kitchen. The renovations will completely redo every unit including all new tile, carpet, appliances, etc. and the units will be fantastic when this is completed. We have never once had any major problems with the resort that they were not able to resolve. Our experience has been pleasant. When staying here you can walk to the other resorts that are part of Parkway and that means additional pools and hot tubs and other nice nature areas. We are not owners, we simply rent and I would recommend to anyone to consider this as a place to stay. We normally just relax and maybe attend one of two of the parks during our 3 - 4 week stay.", "Date": "January 8, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "NY", "Title": "“Ugggh”", "Author": "QueenMab85", "ReviewID": "UR11919440", "Content": "I had an allergic reaction to mold in the room, firstly, and spent the entire week in itchy agony (because I didn't realize it was the room at first). Secondly, the grounds are unattractive and the decor tacky, not to mention the mold and dirty-looking fixtures. We took to calling the resort \"the trailer park.\" The beds had sheets that should be printed on rather than slept on. The staff was helpful but very awkward - the aforementioned Kimber did not know when to stop telling us stories about her life when we had already told her we were very tired and wanted to get to bed. She was, however, very eager to help. The \"resort\" is very conveniently located - close to the Disney parks, the hospital (which I visited twice due to the allergic reaction), pharmacies like Walgreens, and restaurants. However, I would never, ever stay here again and would not recommend it.", "Date": "December 23, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "winnipeg", "Title": "“very impressed!”", "Author": "MsBeaton", "ReviewID": "UR11655266", "Content": "We had read some other reviews posted on the website and had some concerns. However upon arriving we were more than pleasantly surprised. The staff was very friendly and accommodating. A fellow named Bill assisted us in making a reservation for us at the Luau at Seaworld and got us front row seats. A wonderful young lady named Kimber was fantastic. Helpful, freindly and courteous. Our room(#305 B) was excellent, brand new, spacious, very clean and efficient. Contained all the ammenities we needed,beds were comfortable,. Everything was new, fresh, and clean. We made use of Parkways pool area and tennis courts, and found the location to be perfect in relation to anything you needed to get to from 192 or interstate 4 including Disney, Seaworld, Mcdonalds, subway, KFC, shopping- target, wallmart, old town. We found the property itself to be very well maintained and clean, everything was lighted and decorated for christmas, it was a wonderful holiday experience at Parkway. Would definitely stay there again,", "Date": "December 18, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "london", "Title": "“My favorite place in Kissimmee”", "Author": "thegreennan", "ReviewID": "UR8701351", "Content": "Just returned from a great week in Parkway International. Superb location,nice grounds,nice pool. The 2 bedroom condo we had was well furnished, very clean and comfortable. Convenient for all the theme parks. I would certainly stay there again and recommend it.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Outstanding Location for Park-Hoppers”", "Author": "WestHighlands", "ReviewID": "UR8129052", "Content": "Pros: 1. Convenience to Entertainment & Dining - Very Centrally Located 2. Fastest property check-in I've ever had - No Hassle 3. QUIET... Once inside our unit (50 ft from the pool), didn't hear a thing the entire week. 4. Clean & Well equipped: Walked through the entire week in stocking feet & socks were never dirty (a common complaint in resorts like this). 5. Beds were comfortable with plenty of extra linens/blankets. 6. Units are very large. Visited Blue/Green Fountains same week as a friend was there & they were quite small by comparison. 7. Washer/Dryer combo in the unit was efficiency sized but it worked extremely well. Dried 4 pool towels in a matter of 30 minutes. 8. Non-Smoking in all units (ash trays provided on the patios if required) Cons: 1. Pool is a little dated and is not walk-in style. Deep (6.5') and clean and never crowded, just older - its not a brand-spankin' new property. However Pool Furniture was newer. 2. Amenities (i.e. food & bar) / Activities are fairly limited. It is a smaller property after all. 3. In-Room TVs not great (smallish & reception not great) 4. Master-Shower is quite small & the Master Vanity will not accomodate two adults. I was amazed at how quiet this resort was when we stayed during 4th of July week. Expected it to be crowded & noisy & it was just the opposite. Staff was courteous and helpful and check-out was as quick as the check-in. Part of the attraction for this resort in Orlando is that Liki-Tiki (within the same property management company) is available to use for $5. A short drive down US192, and this 220k gallon water attraction is great for the kids. We also used the bar/dining facilities there and they were excellent. Generous portions and prices, at least on the food, was very reasonable. Ladies, if you want a foo-foo drink (daquiri, etc.) expect to pay a premium. One catch is that they won't let you bring in a cooler of your own. I thought that this was cheesy at Liki-Tiki, but fair enough. The life-guards also didn't prevent kids under 42\" from going down the big slide which is true at Orange Lake Country Club River Island, and so we saw many smaller kids having a blast, even though not closely monitored but there are usually lots of parents around anyway. Liki-Tiki is a very kid-friendly property and we're glad that we get to use it, I just don't want to stay there because it is at the far end of US192. Just remember that this is a Timeshare Resort NOT a hotel, even though they rent out nights for 3-day trips, etc. So don't expect hotel-like service or you'll be disappointed. This is a home-away-from-home style of vacation property. If you want room-service, etc. try Renaissance across from Sea-World. In summary, Parkway is a great location for a base of operations for a park-hopping stay in Orlando. We didn't spend a great deal of time at the resort, however it was a welcome place at the end of each day due to the comfort and size.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Balto,Md", "Title": "“On Family Vaction at Parkway Resort”", "Author": "2muchpeach", "ReviewID": "UR8078942", "Content": "June 22 Me and my family stayed at the Parkway resort my family and I had lots of fun , great room , people was real nice and the kids love the pool . Now the family we had 2 rooms both on bottom level, Love the parking in the front of the building. The only thing I did 'n like was when the man told us they was given us a goodie package and it was just to take a survey of there other building and it really turn out to be a timeshare he lied and my family and I was'n there to listen to any timeshare it was a waste of our time and it took to long the kids was really ready to go to the parks . Now everything eles was nice. We really enjoy our stay there and would stay again only if we don't have to listen to a timeshare. It was clean and neat.", "Date": "July 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "pa", "Title": "“Great resort but HARD BED!!!!”", "Author": "websam", "ReviewID": "UR8053092", "Content": "This was our honeymoon and we used our week on our Interval International timeshare. It was great all except the beds were very hard. My 1st night there I woke up the next day with my back hurting. Then we slept on the sofabed and it was way softer than the beds. The staff was fine and the pool, hot tub, kitchen, etc. was ok. However I would beware of the \"free gift\" they want to give you. The man at the guest services told us we'd get free breakfast plus another gift just to go look at their new building and \"take a survey\" telling them what we thought. It was a timeshare sell. Why would I buy a timeshare in FL when I own exchange? anyway, we wasted a whole lot of time doing that, and I was mad that they lied flat out to us. Otherwise, it was great. I won't stay there again due to the beds, I can't deal with hard beds.", "Date": "July 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Machias, ME", "Title": "“A nice place to stay.”", "Author": "downeastmainiacs", "ReviewID": "UR7479877", "Content": "We visited the Parkway International Resort 4/14/07 - 4/21/07 and booked by trading through Interval International. We stayed in building \"B\", which is the first building on the left when entering the resort. It is rated a \"5 star\" resort, but I have never stayed at a \"5 star\" resort that I would classify \"5 star.\" I had read the reviews on this site prior to checking in and wasn't sure what to expect as the reviews range from great to terrible. Happily our stay was great. We arrived in the Orlando area earlier than the 4PM check-in time and called the resort to see if early check-in would be possible, and were told to \"come right over.\" When we checked in, the staff person remembered speaking to me on the phone and was very friendly. Our unit was on the second floor and we had to climb one flight of stairs to reach it (these are three-story buildings with no elevators.) All week we were able to park right by the stairwell to our unit. The units are approximately 1200 sq ft, two bedrooms, one with a king bed and one with two twins, full kitchen with laundry, dining, living, two full baths with showers and tubs and a screened patio area. The units are non-smoking, which was great for our son who has asthma. The unit was very clean, though the decor was a little dated (this didn't bother my family...we don't go on vacation for the furniture) but was not badly worn. Everything in the unit was in fine order and we didn't have any trouble with anything all week. The beds were very firm but not unlike the beds you will find in most hotels. The sleep sofa would not have been comfortable to sleep on for a week, but then I've never seen one that was. We prepared several meals in the unit during the week, and saved substantially over eating out. We visited the pool most evenings after a day at the parks and never found it crowded. We didn't see any bugs all week. We were called a couple of times about the \"free breakfast\" (timeshare-speak for the sales pitch tour) but when I explained politely that we were not interested, the calls stopped. The only complaint I heard from my family all week was from my 17 year old daughter who missed wireless internet. (I did not miss it.) Honestly, we had a great week and our family of 4 had plenty of room to relax and spread out. I would not hesitate to book at this resort again or recommend it to friends.", "Date": "April 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Eight Mile, Alabama", "Title": "“Resort is filthy”", "Author": "rcmrph", "ReviewID": "UR7366014", "Content": "We stayed as an Interval member exchanging as our home resort was not available. From the start, arriving at the unit the dishes were dirty from the previous people who stayed. I know, you do not get maid service at a time share resort but the unit should at least be clean when you arrive. As the stay wore on, on the third day, we discovered roaches in the bathroom. We thought after we killed one roach, that would be it as the resort did have a lot of trees. That was far from the end of it. When the staff was notified, they did not seem at all surprised and instead asked what size the roaches were, by the way they were large and small. The water pressure was bad during the whole stay with sketchy availability of hot water. The tubs also had very slow drains. The facility lacked chains on the doors (not kid friendly) and elevators. This is hardly a five star resort and much closer to a one star (being generous) resort.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Friendly staff”", "Author": "Traveller7734", "ReviewID": "UR6636518", "Content": "We did a timeshare exchange. Interval International has this as a 5 star resort. It is not in my experience (3.5 - 4 ). Staff were friendly and accomodating. Room was clean and kitchen well stock with tools, dishes etc. Furniture was in good shape and several rooms were being updated. Pool was fine, nothing special. Buildings are 3 floors, no elevator. Nature walk not a big deal Very convenient to Disney World and all the restaurans, stores, and shlock on route 192. Rte 192 easy entrance to Disney World, but you can not get out East bound onto 192 due to all the construction....need to come out onto 536 from the north, then back South down to 192.", "Date": "January 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Mateo", "Title": "“Great Choice”", "Author": "travelpicky", "ReviewID": "UR6573656", "Content": "We arrived at midnight due to a late flight. We were shown to our room right away and wow what a great choice. The rooms were spacious and had all the comforts of home. It was very clean. The staff was great and very friendly. The pool was outstanding. I wouldn't consider staying anywhere else should we visit the Central coast of Florida again. We had two teens and they were very happy with the stay. Great for families. Best choice I ever made.", "Date": "January 11, 2007"}], "HotelInfo": {"Name": "Parkway International Resort", "HotelURL": "/ShowUserReviews-g34352-d84812-Reviews-Parkway_International_Resort-Kissimmee_Florida.html", "Price": "$89 - $182*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6200 Safari Trail</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34746</span></span> </span></span></address>", "HotelID": "84812", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/64/1f/dd/parkway-international.jpg"}}