{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Salem, Oreogn", "Title": "“Confused about the extremes between reviews? Read this...”", "Author": "eeyoregon", "ReviewID": "UR121867880", "Content": "I wrote a review of this property in 2008. I travel frequently and have stayed in hotels on both ends of the spectrum. To this day, I stand firm that this was the WORST hotel that I have ever encountered. I would like to point out WHY the reviews of this property are SO extreme. There are TWO kinds of rooms at this \"resort\" and they are extremely different than each other. There are the old, dirty, falling apart, disgusting, bug infested, would be condemned by any health authority rooms (the kind I stayed in). These rooms are primarily given to those of us who use budget booking sources like lastminutetravel, hotwire, etc. The photos from another poster are just the tip of the iceberg for the old rooms. And then there are the newer rooms with the nice appliances, granite counters, rich cherry wood furnishings, etc. I did see one of these rooms by peering in a window during my stay and was floored to think that they only updated some of the rooms and charge a much higher rate for the rooms that are safe to inhabit. I did inquire about the nicer rooms during my stay and it would have cost me an additional $60 a night, of which I did not have in the budget. I hope this helps those of you who are on the fence. If, and only if, I knew for a fact that I would get one of the \"nicer\" rooms, I might consider staying at this establishment again, BUT only if every Disney property were completely booked. WHY? Because this hotel wanted over $100 a night for the \"nicer\" rooms but Disney only wanted $69.00 a night...oh how I wish I had known at the time. At a Disney Value resort I get FREE round-trip airport transportation, FREE parking at all Disney Theme parks, FREE use of all on property transportation between parks/hotels and FREE extra magic hours in the parks. Learned my lesson the hard way. Happy travels!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Morristown Tn", "Title": "“Excellente”", "Author": "Zramos", "ReviewID": "UR59572770", "Content": "We went to stay for 2 nights. I saw the reviews and I did not now what to come in to. It was excellent room were big with big frige microwave. Pool was excelent. when we lefte the came and made our beds just like any other hotel. It did not have bugs or anything discusting. It was preaty pleasant.", "Date": "March 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkshire,UK", "Title": "“Good budget hotel in a fantastic location!”", "Author": "HelloKittyUK", "ReviewID": "UR59150788", "Content": "We arrived on a Thursday night having spent ages trying to find the hotel (this was down to me freaking out driving an automatic on the other side of the road whilst trying to negotiate the signs rather than the hotel being hard to find). We were the only ones there so no queue for check-in; it was very quick and efficient, my only problem being the room tax or whatever t's called, I don't know why US hotels insist on this, an annoying $40 out of budget I wish they would include in the original price. Our only other issue was the annoying guy at the sales desk trying to sell you Disney tickets the minute you walk in the door which was pretty irritating after a 9hour flight and a stressful drive from the airport. However, this is something you find everywhere in and around Orlando. This was my 2nd trip to Kissimmee (my first had been 5 years earlier and I'd stayed in a villa). The car parking was free which was excellent and there were always plenty of available spaces. That first night we went to eat at Chillis right across the road (crossing the road was an experience in itself; America isn't designed for pedestrians!), service, food and prices were good. There was lots of choice for places to eat withinn walking distance from the hotel; we tried Dunkin' Donuts, Papa Johns Pizza, UNO and bought a few bits from CVS. There was also a good gift shop next door (with a giant wizard on top!) where we bought some cheap beach towels to take to the water parks. Wal-mart was also a short drive down the road where we picked up essentials like breakfast foods and drinks and snacks; there was plenty of room in our fridge and cupboards in our room to accommadate this. The room was clean when we arrived and was cleaned daily to a good standard and we were never disturbed by maids, we left a dollar a day each as a tip which we thought was fair and we received good service in return. The bathroom was small but clean, no real problems with it and there was a huge counter in the room with a large mirror which I used to my hair and make-up. There was a large wardrobe and bedside cabinets plus 2 double beds; more than enough for the 2 of us. We also had a microwave. No, there wasn't many channels on the telly but it was adequate considering I didn't go to Florida to watch TV; an automatic alarm went off on it when there was a tornado warning in our area which was a bit scary! We didn't bother with the laundry facilities; we washed clothes in our bath and hung them over the balcony outside our room, they dried easily in the heat. The pool was OK, it didn't open 'til 9am which I found annoying as I would've like an early morning swim, it didn't make sense as there was no lifeguard anyway and even then it didn't open on time. As a plus point it was never busy so you could easily get a sunlonger and enjoy the pool mostly to yourself. The only bugs I ever saw where lizards around the grounds which were so cute! I found it very close to Disney and never a long drive to anyway I wanted to go.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Jim Thorpe Pa", "Title": "“wonderful”", "Author": "SarahJimThorpePa", "ReviewID": "UR46793557", "Content": "We go to Kissimmee every year in October. I have to admit I was a little leary after reading some reviews. It was the best hotel we stayed in for the price and we have been coming for 20 years. They upgraded our room for free and it was very clean and housekeeping did a great job. I will definetly stay there again in years to come. Dont listen to the bad reviews. I think other hotels write them so people dont stay there. Happy Vacation !!!!!!", "Date": "October 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Ft. lauderdale, FL", "Title": "“Bed Bugs- Stay Away!!!”", "Author": "LDS25", "ReviewID": "UR40032438", "Content": "My family and I stayed there two weeks ago and it was the worst experience ever!! I've stayed at alot of different motels in Kissimmee, over 12 yrs. and this was the worst!! I actually gave it a chance, even after reading the reviews. First, it started out with a room that stunk, the bathroom light didn't work and the tiolet kept overflowing! So the next morning, I spoke to the lady at the front desk , she gave me another room that was just as bad, so we called again and asked if we can have a better room, she said for more money you can. I was furious, I was not going to pay any more money for this place, which I had already paid in full. Ten minutes later, the manger called our room and said he would give us the better room at no extra charge. We thought now that's good management, he accommodated us. The room was nice, it had granite counter, big high beds, wet bar.... So we were pleased, we stayed in that room two nights. The morning we were leaving, I woke up to find a little bug walking in the bed right next to me and my daughter, I freaked out. I looked around and saw blood spots on the sheets, but didn't know those were signs of bed bugs, I've never experienced them in my life! Then I noticed red bite marks all over my waistline. I couldn't wait to get the hell out of there!!! Well, here we are two weeks later with bite marks all over our arms, legs, back, ...... and doctor bills for the visit and creams for the irriation. Don't stay there, it turned our trip into a nightware that we are still living!!!!", "Date": "September 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Massachussetts", "Title": "“Awful experience, starting with Management!”", "Author": "pvj4853", "ReviewID": "UR36490398", "Content": "No breakfast, unfriendly service, AC hardly ever worked and when I tried to address issues with the Manager, he only came up with a bunch of excuses for less than perfect service. Had to swich rooms because they could not fix air conditioner. It took them four hours to start addressing program and to decide to move us to another room. Manager has no clue! I do not think this place will be in business for much longer due to the way it is being managed.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Jonesboro, AR", "Title": "“Was just fine for us.”", "Author": "saxysai", "ReviewID": "UR33881859", "Content": "My dad and I stayed here after a long day at Disney and for us, it was just fine. Yes, it is very no-frills: no breakfast, not a lot of channels on tv, no ironing board/iron. But for our purposes it suited us just fine: we just needed a place to crash at the end of a long day. Our rooms were very clean; my only complaint was on the second day there, one of my towels had hairs in it, but that was the only problem. Here's my opinion. If you are going to be in the Orlando area for vacation and plan to spend some time in the hotel, then choosing a better motel would be a good choice. But if you JUST need a place to crash, it is very cheap and suits that need just fine. The staff was very friendly and helpful and check-in was speedy. The property itself was well-maintained and clean and the area was safe. Also, there is plenty of shopping and restaurants nearby and it is a short, easy drive to Disney.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "high point", "Title": "“Aweful place to stay- rather sleep on the street”", "Author": "roroHighPoint", "ReviewID": "UR32034091", "Content": "The lady in the front desk was a very mean person, she did not wanted to give us our tickets to Disney world that we were suppose to pick up from the hotel as a package deal. The rooms were smelly and nasty, water was leaking, actually had a nightmare on my first stay. We would rather pay $10 more to stay on other hotels. I cannot believe such an exixtence in America. Please people go elsewhere to stay.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "marion", "Title": "“Very pleased with accomodation”", "Author": "billyMarion", "ReviewID": "UR31288279", "Content": "I was also very worried about our reservations due to the previous reviews. When we drove up to the hotel, it was nice looking. I asked the clerk if we could have a courtyard room, which she gave us. I checked everything in the room since the reviews were not good. The mattresses were Serta pillowtops (which were new). We had a mini kitchen with a wet bar, refrig and microwave. All of the countertops were black granite and plenty of room in the sink/dressing area. The bathroom was a little small but all of it was clean. The courtyard was not as pretty as we thought it would be. There were no sign of bugs inside or outside. All of the other guest vehicles were very nice, so you know that there was no rif-raf.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Puerto Rico", "Title": "“OMG, THIS WAS HORRID!!!!!!!!!!!!!”", "Author": "macama07", "ReviewID": "UR31230266", "Content": "This was supposed to be a great family vacation to Disney with our daughter & another family & it turned out to be the worst experience ever. The rooms smell nasty & are full of dust, the bathroom has moldy walls & the shower curtain made me vomit!!!!!!!!!! The bathroom has no decent ventilation & no matter how clean you are, it smells very bad. The rugs are old & extremely dirty & the beds? OMG, this is when we noticed something was horribly wrong. The mattress & box springs WERE STAINED!!! The sheets & bedspreads are from the 70's & smell like they're that old also. The AC units are old & broken down, they leak terrible amounts of water outside the room & we even gave them a closer look & noticed that the vents are even cleaned!!! The dust & mold in the rooms (Lord knows what else) made my husband & daughter EXTREMELY SICK!!!!! They got the worst allergic reaction to the dust & we ended up having to leave the hotel 3 days before check out, without a penny of refund. All in all, the stay at this hotel was miserable & the worst experience we've ever had. Considering its in an excellent location & so close to the Disney parks, we were expecting a cleaner & more welcoming stay.", "Date": "May 31, 2009"}, {"Ratings": {"Overall": "1.0", "Location": "2"}, "AuthorLocation": "New York, NY", "Title": "“Do yourself a favor and spend $20 more on something safer...”", "Author": "DeeL9", "ReviewID": "UR31209960", "Content": "Got the $25 / night rate for 2 nights over the memorial day weekend. Like others after reading the reviews I thought it was a good deal and it was relatively close to Disney World and would take my chances -- after all I only wanted to sleep there. I would not stay here again and would not recommend anyone to stay here. I am not a pre-madonna type person and was expecting low quality -- you get what you pay for. It's just a place to sleep in, but I never got he chance to sleep here! My problems below: 1 - No early check-in (expected this) 2 - Room was old and dingy (expected this) 3 - mini-fridge door was cracked and door molding was torn, tremendous amount of moisture and mildew in the mini-fridge. (didn't care much on this, but noticed it). 4 - Shower had mold on all the walls in it. 5 - After showering and laying down in the bed, minutes later i felt itchy, nasty bed bugs there... 6 - It advertises free shuttle service to the Disney parks. The timings are not convenient, you're better off renting a car for $30 from the airport and having your freedom. 7 - The bed mattress was terrible. It goes flat as you lay on it. Not very comfy. (expected) Why take a chance? The bed bugs threw me over the edge. I left and checked into a better hotel down the street. I ate the $50 charge as a lesson learned. Spend $20 more and stay at a more established 1-2 star hotel. This place isn't worth a chance. Not for $25. Not even for $18. Heck, even if it were free I would not stay here...", "Date": "May 31, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Central NJ", "Title": "“Please don't stay there!!!”", "Author": "garfield215", "ReviewID": "UR31007983", "Content": "We gave it a try because some of the reviews said the place is ok for what you pay for. It was $25 for us but seriously I didn't think the place would have mold everywhere in the bathroom. Mattress was completely flat. I might as well sleep on the floor. Everything was disgusting. I mean how do they pass inspection? We actually left and stayed at Holiday Inn Express nearby. It's $80 but at least you get breakfast free and you can actually sleep in the bed and take a shower without being all grossed out. Please do not stay at Legacy Grand!!!", "Date": "May 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Pittsburgh", "Title": "“Great for the price”", "Author": "johnanddeeplus3", "ReviewID": "UR29641997", "Content": "We booked our trip through Travelocity and received a great rate for this hotel, but we did opt to pay extra for the upgraded room. We were a little apprehensive about staying here after reading the reviews, but we noticed that the more recent reviews were a little better so we decided to risk it and figured that we could find another hotel once there, if it was as bad as some described it. We checked in ( the lobby area was nice and clean) with a pleasant desk attendant and was in our room a little before the 4:00 check-in time with no problems. The first thing we did was check our beds, and was pleasently surprised to find new mattresses. The carpet was clean (no stains) and the rest of the room was clean as well. We returned every evening to find that the room was fixed just fine and adequately stocked with supplies. We needed to check into the airport for our return trip home and to print out our boarding passes, so we went to the front desk and ask them to take care of this for us. The desk attendant promptly took our information and printed our boarding passes for us. We didn't see a single bug in the room the entire week we were there, there wasn't any gap under the door, there wasn't any blood on the sheets (they were clean), everything in the room worked just fine (although one light switch was in need of fixing, due to a short). The pool was open, and even though we didn't use it, it looked very clean and inviting. They do have a store in the hotel, but it is only open Friday - Sunday. Overall, we had a pleasant experience here and would stay again if in the area. If you're looking for a five star hotel, this isn't the one for you; but if you're looking for an inexpensive, clean, comfortable room to spend your evenings at while on vacation, you may want to give the Legacy Grand Hotel a try.", "Date": "May 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Syracuse, New York", "Title": "“Hotel from hell !”", "Author": "FloridaxO52", "ReviewID": "UR28705210", "Content": "There Was Nothing Nice About this Hotel Other Than It Was Right Next To 2 Good Gift Shops. It Was Thee WORST Hotel I Have Ever Stayed In. At Noon We Had Finally Gotten Out Of The Airport Went To The Hotel & We Couldn't Check-In Until 4pm - We Don't Know Where We're Going We're From NY, If The Rooms Are Ready Let Us In Ya Know?! We Got 2 Rooms, 1 For The Parents and 1 For The Teenagers. We Walked Up The Flight Of Stairs To Be Greeted By An Overflowing Garbage Can Then Another Overflowing Garbage In The Laundry Corner. Parents Toilet Almost Immediately Had To Fixed W/ The Guy Running In & Out Of Their Room. In Our Room We Didn't Have A Directory On Our Phone To Get Thru To The Front Desk. We Called 3 Days In A Row About Our Sink Not Draining And Toilet Not Flushing We Ended Up Hanging To Leave Sticky Notes On The Bathroom Mirror. In The Mean Time Where Do 4 Girls Brush Their Teeth ? - In The Tub That Leaks And Soaks The Floor After Each One Of Us Got Out. We Went Thru A Roll Of Toilet Paper And Had 1 Roll Left, You'd Think The Housekeeping Would Give Us Another Roll But Nopee. . 2nd Roll We Had Was Gone Called The Front Desk At 10pm The Lady Was Rude As All Hell Saying We Would Have To Walk All The Way To The Front Desk When They Should Have Runners For All Hours This Is A Hotel People. We Called For Some New Towels And More Pillows . . We Received Baby Sized Towels & 2 Pillows . .Again What Will 2 Pillows Do For 4 Girls ?? The Bathroom Mirror Light Would Only Work When It Wanted To. At Night There Is No Lighting Basically Anywhere. The Whole Place Is Run Down The Internet Makes It Look So Good. Let Me Come Down And Take Some Real Pictures For Your Website, It Makes The Rooms Like Nice & Their Not! The Only Nice Looking Part Of The Hotel Were The Lobby Areas. The Bed I Was Sleeping On Had A Broken Open Box Spring It Was Gross, The The Nasty Brown Blanket Was Itchy, Beds Make Your Back Hurt. The Shuttle Is Some Bull Yeah 2 Shuttles All Day For Disney. . What About People Who NEED To Get Back To Their Room WHENEVER They Need To ? We Ended Up Using The Lynx Bus After Being Stuck At Epcot Not Knowing When The Shuttle Was Going To Come & The Bus Information Has The Hotels Old Information That Says It Cost $10/Each So Yeah Stick To The Lynx If Your Going To Disney It's Lynx 56 Costs $4.50 For All Day Pass Til 3am . . & When You Use It Makes Sure You Already Have Correct Amount For Each Person Because The Legacy Grand Gift Shop nor Front Desk Will Be Able To Give You Change You Might Have To Walk All The Way To Dunkin Donuts.The Pool Is NOT Heated It Was Freezing Us 4 Girls Were In For Only 5 Minutes . . Got Back To The Room I Asked My Sister What That Smell Was In The Bathroom After We All Changed And Hung Up Our Bathing Suits. It Was The Pool It Made All Our Stuff Smell Like Garbage And We Had To Pay $2.25 To Wash & $1.75 To Dry. There Are No Towels For You To Use When You Get Out Of The Pool The Website Lies, & I Don't Recommend Using The Poolside Bathroom Either . . Sister Found A Turd Left In The Toliet, You'd Think The Hotel Employees Would Check These Things. && It's Farther Than 3 Miles To Disney Don't Let Them Fool You. Overall I Will NEVER In A Million Years Stay Here Again Unless It's Given To Me Free Of Charge.", "Date": "April 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bronx, New York", "Title": "“Pleasantly Surprised....I would choose this hotel again.”", "Author": "Alli1468", "ReviewID": "UR28482171", "Content": "Like most everyone else who posted a review, I was very skeptical about what we would find once we checked in. I spent a week here with my wife and 3 kids and everyone of us left the hotel totally satisfied. I had requested adjoining rooms but the hotel staff was unable to accommodate my request due to the hotel being booked at full capacity. I spoke with Amy at about 7AM the morning that me and my family were due to leave for Orlando. She assured me that she would do her best to get me 2 rooms as close together as possible. We finally arrived to hotel at about 8:30PM that evening and true to her word, we had to rooms side by side with a great view of the pool. My kids absolutely loved it! The rooms did not smell musty, we had a fully functional mini fridge and microwave, and our coffee maker worked just fine. Our rooms were cleaned everyday and fully stocked with towels. When I called the Front Desk one evening at about 10PM to advise them that one of our rooms did not come equipped with a TV Remote, Isabel had one sent over in less than 5 minutes! My only experience that was a little on the negative side was that I noticed that the trash receptacles outside of the hotel had not been emptied in about 2 days. I stopped by the Front Desk one morning before heading over to one of the parks and brought this to the attention of the clerk on duty. When we returned later that day all the receptacles were empty and the hotel staff made sure they were cleared every day after. Would I go back? I sure would! The price was right and the service was too!", "Date": "April 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "arkadelphia", "Title": "“Much better than I expected”", "Author": "jimmy1vilaine", "ReviewID": "UR28409516", "Content": "The Legacy is a good hotel for the mony in a great location. I was afraid to stay there from the previous reviews but I gave it a shot and I am glad I did. Me and my wife loved it, primarily for the location, but it was a pretty good stay! We´ll be back!", "Date": "April 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Rhode Island", "Title": "“horrible”", "Author": "hateditRhodeIsland", "ReviewID": "UR27495540", "Content": "This was the worse place to stay ever. When we first got there we were given a schedule of the shuttle. There are only 2 each way a day. This was not mentioned on the web site. We had to take a taxi back everyday for $25 a pop, because the return shuttle is at 6 and 10 at night. Way too long in the parks. We got there on march 31st and the shuttle schedule was different for the next month and where not informed of this until we were outside waiting for it. The cops came to our room because there where breakins the night before and wanted to know if we saw anything and to keep an eye out. And the duck floating around and pooping in the pool was just ducky. Consider yourselves warned.", "Date": "April 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Fredonia, AZ", "Title": "“Nasty”", "Author": "n8vsista", "ReviewID": "UR27307449", "Content": "pictures are worth 1,000 words! our room was disgusting, holes, i'm sure we seen black mold, it smelled hella musty in the bathroom. Maybe we had the LOWEST economy room, because there were some renovated rooms closer to the lobby that looked descent. The Courtyard was straight up busted! The ice machine area, was gross to say the least. just look at our pictures and maybe rethink the Legacy Grand... or upgrade your room. I won my trip, so didn't have much say in the reservations, so if you have say--- Say NO to this motel. OH yes, and the tiny gift shop was never open...(sorry)", "Date": "April 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "South Pole", "Title": "“Dirty”", "Author": "largekahuna", "ReviewID": "UR26279150", "Content": "Room was dingy and dirty. Needs to be updated. Linens were low quality. Sink light flickered like a strobe light - we complained but it was never fixed. There was an iron but no ironing board. Also complained, and a board did show up 4 hours later, too late to iron our clothes for dinner. Pool gates rusty. Tons of cigarette butts lying around landscaping. Mixed desk staff experiences - nice and rude - crapshoot I guess. Bathroom was dirty - shower had mildew and a bonus clump of hair on the ceiling. Three night stay resulted in a $10 \"resort fee\" in addition to the Orbitz cost - no idea what this was for! Only window in room looks out onto the porch/hallway - only way to get privacy is to close drapes and shut out all the light. Internet (wireless) only available in main lobby (we also got it in the pool area, but not in our outside room). I guess you get what you pay for, but in my opinion, not worth it.", "Date": "March 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Much Better Than Reviews Indicate”", "Author": "PennsylvaniaPAGirl", "ReviewID": "UR25816024", "Content": "After reading the reviews on TripAdvisor, I was extremely wary of this hotel. I was pleasantly surprised when I entered the cute lobby with a Spanish-style fountain. The lady behind the counter was accomodating, if a bit skittish, perhaps from dealing with too many diva guests. Walking through the hotel to my room, I was pleasantly surprised to find the walls painted with cute names to indicate individual rooms. My hotel room was clean and contained both a microwave and a small refrigerator. The television had channels galore from which to choose. The only downside was the water in the shower took quite a while to heat up . . . I think this hotel had a recent upgrade, because I got the impression talking to a taxi cab driver that he had heard several nightmare stories about the hotel. Apparently, at some point, this hotel may have had cleanliness issues with the authorities and may have been required to clean up its act. At any rate, I found this hotel very adequate.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Not bad for the money”", "Author": "hendejm", "ReviewID": "UR24379941", "Content": "I know there are lots of terrible reviews out there for this hotel but having stayed here on three separate occassions, I have to say that it is not bad for the price. I booked thru Hotwire and paid only $18 a night. For that price, I wouldn't expect a Ritz Carlton or even a HOJO's. Really, $18 for a hotel room? Lighten up people. If you are that cheap and are willing to pay such a low price, don't sweat it and put up with old carpet and cigarette stains. For $40 -$50 you can get much nicer places, but you are paying double the price and may not be so close to the attractions. Don't be mad at the hotel if you didn't like the place; be mad at yourself because you thought that you were going to get something better than that for only $18 a night. You get what you pay for!!!!!", "Date": "February 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Buffalo, NY", "Title": "“Very nice stay”", "Author": "Nics2009", "ReviewID": "UR23916471", "Content": "I read all of the reviews, but still booked.... reason being because it was just a place to sleep. We got to the hotel early at around noon. Just thought it wouldnt hurt to ask for early check in. With no problem at all they set us up in a room. Very kind and friendly front desk staff. We spent the extra money on a suite and very very glad we did. My fiance and I were very pleased with the room. Beds were nice. good amount of area to hang clothes. Tons on counter space. Only downfall the shower head was very low. Im 5'8, my fiance 6' and we both had to bend down to just get under the shower head. But no biggie. I read a lot of complaints about bugs. We only found 1 bug and figured we were in and out so much we probably brought it in. As for the room service complaints ..... well you know that little tag you can put on your door that says \"do not disturb\" use it! We left it in there the whole time and nobody that we know of came in our room or disturbed us. We did however hear a lot of noise early in the am outside our door. Sounded like thunder but it was the house keeping carts going by. We also had to call down to the front desk to get a remote control for the tv. They were very nice about getting one up to us as well, took about 30 minutes. All in all its not a bad place to stay. The outside does need some updating. And if you can, upgrade your room. Its worth it. *Buffalo, NY*", "Date": "January 26, 2009"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Tampa Bay", "Title": "“Weird”", "Author": "kstamant", "ReviewID": "UR23898922", "Content": "No coffeemaker, all the the ice machines were broken and the front desk made no attempts to help out. The irrigation system was on with no sprinkler heads on any of them and water spewing everywhere. The property is VERY dark at night...kinda spooky really. Rooms are ok...our tub leaked continuously. The room had two double beds(old spring mattresses) with microwave and fridge. Even at the Hotwire price we will not stay there again.", "Date": "January 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“For the $$, it's a steal.”", "Author": "ginger1197", "ReviewID": "UR23404030", "Content": "My family and I stayed at this hotel for 4 nights. I had read the reviews, but decided to try it anyway. I was pleasantly surprised. The staff was friendly, and even upgraded us to a pool view room with a mini-fridge for free. It's an older hotel and could use some remodeling of course, but if you just need a clean place to stay with a great location, then this hotel is for you.", "Date": "January 9, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Pensacola Beach, Florida", "Title": "“...okayyyy so I paid only $18 a night!!! did I get my $'s worth???”", "Author": "tiff21x", "ReviewID": "UR22325565", "Content": "I have to start out by saying again.. I got this room for $18 a night thru Hotwire.....if you've ever booked thru Hotwire, then you know the drill, you dont get to see the hotel until AFTER you've booked it....its just the chance you take when you only care about a clean place and clean bed.. I had no high expectations with this place, and in the past Ive trusted Hotwire's ratings on hotels and never had a problem so anywho.......stayed for 3 nights Nov 27-30, 2008...hotel is in a great location in Kissimmee, its on Hwy 192 between mile marker 10, its near many shops, restaurants like Red Lobster, Chilis, fast food, CVS aross the street, and near I-4 access to hit the themeparks.. hotel is old, and some reviews said it smelled mildewy, I just think it smells like an old library book, the pictures on expedia were taken years ago, cause the hotel is in need of a facelift, new gardner, some new blankets and bedcovers, new doorknobs.... but hey I PAID $18 a night... lol. ok, rooms are old, smell old, but ours was clean for the most part.... I didnt feel gross in the room, but yeah walls have cracks, paint chipped and peeling, carpet had stains, tub needed new caulking, etc.. but who freakin cares.. Im not there to stay in a hotel room when I get to Orlandooooo.... rooms have microwave and mini fridge which was nice..tv DOES work.. have about 14 cable stations, but NO HBO, (so if you come to Orlando to watch TV?? then dont stay here.. who comes to Orlando to watch tv???) beds nice and clean..ok first night I saw a bug in the bathroom... but that was the only one I saw the whole time, because if there had been more I wouldve been out of that place sooo fast.. but our room was on the first floor(ground) so it could've crawled under door.. (it wasnt a roach and it was small)...has iron w/ board, snackshop in lobby, no restaurant, no room service, but theres like a million restaurants within walking distance if you dont have a car they also offer free shuttle to Disney... AND they charge you 2.50 a day even if you dont use the shuttle...(they explain that to you up front though.. well they did to me) no biggie.. since I only paid $18 a DAY.....staff was nice and helpful.. one young kid had the themepark tickets for discount, BUT its the timeshare crap you gotta go listen to for about 3 hours, then you get the discount tickets (we passed) all in all, I probably wouldnt stay here again, but for $18 a night, clean bed, hot shower (ohh yes the shower had hot water) and quiet rooms it was a deal! and not a horror story as people make it seem", "Date": "November 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "florida", "Title": "“Nothing special”", "Author": "jnwoodsjtwoods", "ReviewID": "UR22323859", "Content": "I just returned from my stay at this hotel and overall it isn't the best place to stay, but for the money it isn't bad either. The lobby is nice and they do have internet access in both the front and rear lobby area, but there is no internet access in the rooms. My check-in and check out experience was pleasant and quick and I didn't have any issues. There is no restaurant onsite, however, there are vending machines in the rear lobby as well as dining tables and a television. The rooms are at or below average. There is a minifridge and microwave. There were visible cracks in the wall that had been painted over, the carpet could have used a good vacuuming, and there was rust around the hinges of the doors. The bathroom and vanity lights flickered and the tub drained slowly. The service was also average. When I called down to the lobby the first night because we needed extra pillows, they sent them to us. The next night I called because we needed more washcloths and the lady told me I could come and pick them up from the front desk. When my husband went down to get them, he was only given one washcloth and two towels because apparently they didn't have access to the supplies once housekeeping has left for the day! (huh! As if towels have to be kept under lock and key at a hotel). Also dryer was very difficult to work (I never did get it to work) and I lost several quarters attempting to dry some clothes. I got a really good deal on the room booking through orbitz, so I can't complain about that, but I don't think I would ever stay here and pay full price.", "Date": "November 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "alabama", "Title": "“This Was A Great Place”", "Author": "kgrayAlabama", "ReviewID": "UR20962759", "Content": "I booked my hotel threw hotel.com after reading this reviews on here I was very scared at what I might find. When I arrived at the hotel I was shocked at the nice location it was in, and the lobby did not smell of mold and mildew. My room was very clean, bathroom was very clean and I had plenty of hot water. Sure guys this was by far not a marriot or some fancy resort but it was a very very nice clean place to stay considering your are mostly there to sleep and shower lol!!! however I would in deed stay at this hotel again....... golden corral on 535 has the best breakfast it is a must to eat at as well .......", "Date": "October 17, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Salem, Oreogn", "Title": "“3 stars? You have got to be kidding!”", "Author": "eeyoregon", "ReviewID": "UR19583467", "Content": "Booked this HORRIBLE hotel through Lastminutetravel.com for 2 nights. Our hotel room was the most disgusting thing I have ever stayed in. Smell: pet urine combined with vomit! We demanded a different room which ended up smelling like mold and smoke (non-smoking room now but wasn't in the past). Room has not been updated (cleaned for that matter) in over 20 years. The carpet was wet, sticky and had iron burn marks. There was NO weather stripping under the door which left a 2 & 1/2 in gap...perfect for all of the Florida critters to crawl in and out of!! Everything was old, dirty and falling apart from the fixtures to the bedding. We both ended up with bug bites all over...fleas?? Bedbugs?? The Ice machines did not work. No elevator to upper floor. Moldy shower curtain. Bath did not drain. AC worked well but had to be on 24/7 to accomodate for the huge gap under the door. Pillows smelled like unwashed hair! I can not believe that anyone could rate this establishment as a 3 star!! I have stayed in 1 star hotels that seemed like a palace compared to the Legacy Grand Hotel. And to add insult to injury they charge an additional daily resort fee!! DO NOT STAY HERE!", "Date": "August 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "White Stone, Virginia", "Title": "“Not as bad as people say....”", "Author": "RobSpi98", "ReviewID": "UR18681384", "Content": "Ok, after reading reviews bashing this hotel, I was VERY nervous when I got there. I received these accomodations after winning a 4 day trip from a tour company. So I really didn' t have any other options. The hotel room was clean, neat, and well equipted. We had plenty of storage room, a microwave, fridge, two sinks, two nice beds, etc. It was not Hilton or Marriott, but it was not a dump like people on this board have said. I was not too overly pleased with the neighborhood behind the hotel, but didn't have any problems. There did appear to be people milling around out on balconies, etc, but we just went into our room and closed out the \"neighborhood\". The hotel really doesn't have much to offer outside of the room and a small pool. There is not resturant, no internet available, no lounge, and no ballroom available. It looked like they used to have these things, but they were all closed down, and it is now wasted space. This hotel really could use a major face lift, but I found the room very tolerable, and not as bad a people on this board make it out to be. The staff was helpful to me, and seemed rather friendly. I was looking for internet access to print out my boarding pass for the next morning's flight, and the lady at the desk was very helpful suggesting a coffee cafe down the street to get internet access. Check in and Check out was uneventful, and we look forward to coming back to florida in the future. If you can save money/especially in the tough times we live in now- I would use this hotel. Good Luck and enjoy Orlando!!", "Date": "August 6, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Toronto", "Title": "“Don't stay here they stole our luggage”", "Author": "triedtraveller", "ReviewID": "UR18402038", "Content": "While staying at this \"motel\" someone entered our room with hotel keys and stole all our luggage and identification. Having 2 cranky children, the hotel offered no assistance and was not accommodating in the least. All they made clear is that they are not responsible for our belongings. To add insult to injury other rooms were broken into the same day by someone with hotel key access. After trying to get any kind of answers the GM avoided us and we were told he would not be coming until 11:00(check out time) In grieving my concerns we were asked to leave because there were other customers in the fromt lobby. When I refused because wanted answers or to speak to a supevisor the front desk clerk called the sheriff to escourt us out. The sheriff showed much sympathy and advised me so we did. Never did anyone show interest in the well being of the chidren or their customers. It was more important to throw us out in the streets with two kids, no clothes, no money in a foriegn place than to show some customer service. Please heed this warning becasue I would not wish this treatment on anyone this \"Motel\" was not helpful at all.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Wonderful”", "Author": "2008florida", "ReviewID": "UR18190812", "Content": "This hotel was wonderful. Granted, it was simple, but I had no problems whatsoever with this hotel. I would recommend this hotel to my friends and family if they are looking for a getaway and do not want to spend a ton of money. There are plenty of shops and restaurants around, as well as a Wal-Mart down the street. The fridge and microwave came in handy and I saved some money on this trip.", "Date": "July 24, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "maple ridge", "Title": "“Do not stay here”", "Author": "hopps", "ReviewID": "UR17694486", "Content": "My Husband & I went to Florida for the weekend to go to the daytona nascar race and this was the only hotel we could get. We travel often and I always look at the trip advisor and we should have cancelled before we even got there. We got there at 11:30 at night the front desk was great, got to our room 202 and WOW it was soooooooooooooooooooooo old and very used. I could go on and on but just take our word DON'T STAY. The carpet was so dirty I didn't take my shoes off ever only to go to bed ( the sheets were clean) and if you are travelling with small kids the tub was soooo rusty you could'nt bath them in it I even wore my shoes in the tub:( We nrver used the pool cause we thought if the rooms are like this how clean is the pool or do they even clean it. The olny thing is we were only in florida for 2 night so we were so busy I think we were only in our room for maybe 10 hous including sleep. DON\"T STAY stay somewhere else", "Date": "July 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Feasterville, PA", "Title": "“Reasonalble, Convienent, & no problems!”", "Author": "AuntTeeTee", "ReviewID": "UR15969828", "Content": "I was extremely nervous about going here after I came accross the reviews, I almost cancelled until I saw the last 3 recent reviews. I am guessing this place \"cleaned up\" because our room was clean, the staff was excellent, the pool area & lobby were very nice. Yes, the place is a little older -- rooms could use some updating but our overall experience for what I paid was great. We had all the ammentitiies listed, they even offered free shuttle to the parks (we didnt use it though) The place is convienent to everything-- about a 5 minute drive to disney world with a ton of restaurants and gift shops in between. I am going to complain about 1 restaurant within walking distance-- it is called the Las Vegas Buffet--- yes- cheap -- but totally disgusting especially for breakfast. (Go to Ponderosa- it is 1/2 mile further down & much better) So if you are looking for an inexpensive place and are not looking for anything fancy, I would recommend this!!", "Date": "May 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Would definately stay there again”", "Author": "LCA1399", "ReviewID": "UR15857279", "Content": "After reading the previous reviews on here, we were a little leary about the hotel, so we decided to upgrade to a deluxe room prior to checking in. We were pleasantly surprised how nice the room was when we arrived. We spent a week inthe hotel and the room service was great and the staff were very friendly, sheets were changed daily and we were given extra towels everyday upon request. We would highly recommend the deluxe rooms at this hotel and hope to return in the near future.", "Date": "May 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "England", "Title": "“Dont understand the bad comments, enjoyed our stay”", "Author": "england19", "ReviewID": "UR15456215", "Content": "I was worried after i had booked this motel about how it would be as some of the comments were really bad. i really dont understand how they can drill this place so much. its a cheap place to stay so you are not going to get 5 star luxuary!!! Our room was basic but we had everythin we needed for our stay, we had room service every morning and our room was clean, i could not find one reason to fault it. This motel is fine to stay if you are going to all the park, it tooks us no longer than 30 min to get to the destinations we wanted to go to. you are right in the middle of the 192 so in each direction you can walk and you have shops/restrauants all around you. Angels is about a 10 min drive and i would definatley reccommoned that the food is amazing!!! Also old town kissimmee is a nice 20 min walk and that place is great in the eveings for all ages, we enjoyed a few good nights out there!!its has loads of shops/rides/places to eat, definatley worth going to.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "elizabeth nj", "Title": "“Had a Good Stay”", "Author": "malela1979", "ReviewID": "UR14704485", "Content": "I read some of the reviews after booking the hotel and was a bit nervous about what I would find, but I have to say I disagree with the reviews. Our room was clean and comfortable. It had a small refrigerator, microwave and the beds were comfortable. The shower curtain was hanging a bit because it would not stay on the hooks, but other than that I have no complaints. I would stay there again.", "Date": "April 1, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "queenofdivas", "Title": "“Not a clean place”", "Author": "queenofdivas", "ReviewID": "UR13838229", "Content": "I booked this room b/c it was really cheap and you get what you pay for. I would NOT recommend this hotel to anyone. If you are really really really on a budget and must have a cheap hotel. I suggest you bring your own blankets, pillow cases, towels, and shower shoes....and don't spend any more time in your room than needed (i.e shower, get dressed, and sleep) My first room smelled moldy and the second did not, but the room was still not clean. The hotel is old and run down and no keep up has been done.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "new york", "Title": "“Horrible”", "Author": "ilovetotravel928", "ReviewID": "UR13757206", "Content": "First of all the bed was so uncomfortable and everytime i layed in it i was completly itchy. The toliet got clogged over and over. When i asked about the shuttle service they were not very helpful at the front desk. Even worse when I got stranded in Epcot and called them to ask about the shuttle service they said there was nothing they could do to help me. I am now going through a rather large disput with them because they charged me a 124.30 a month after i had stayed at the hotel. DO NOT STAY HERE!", "Date": "February 22, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Rochester, NY", "Title": "“A good choice for an inexpensive extra night in Florida, or low cost vacation.”", "Author": "redick350", "ReviewID": "UR13578859", "Content": "We had two rooms, 164 & 166. Both were clean with fresh linens. We checked in relatively early, so we had time to check out the pool and courtyard before dark. Both were very nice. Our rooms had a refrigerator and a microwave in each, and the heater/AC units looked new in both rooms. There were cosmetic blemishes here and there, but to be fair it is an older hotel. We were only staying one night until we could go to our timeshare the next day, so our expectations were not real high. The one thing that I did not like was the greeting (or lack of one) when we were checking in, but the person behind the desk did attend to our need for an additional roll-out bed. overall, I found this hotel a pleasant surprise after reading the bad reviews about it.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“the worst experience in my life”", "Author": "grando1mom", "ReviewID": "UR13062979", "Content": "people running up and down the halls at three am and when yo ucall the desk they say they have no security so they cant do anything. Then we asked for an extra pillow and the front desk it would be tomorrow . Then the bathroom was leaking during the night and the walls in the bathroom was full of mildew. . My grandson had the phone off the hook and called the front deks mink you he is a baby and they called telling me he is annoying and I should control my kid then told me as I told her to shut up that I need medicine or pills to control him they are the rudest front desk people the rooms are nice but they need to do something with their bathrooms and the staff are extremely rude.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Notre Dame, Indiana", "Title": "“You don't get what you pay for.”", "Author": "qtop10r1", "ReviewID": "UR12586161", "Content": "Jan. 2008 first room had no table, 1 broken chair, no lamps, and the air or heat did not work. Second room was one of the remodeled but phone didn't work, \"New\" furnature was scratched and room service did nothing unless I went to hunt them up. Floor was vacuumed 1 time in 7 days. Hotel is trying to go condo and some rooms are being upgraded with better used furnature that the junk they are throwing away. They are not spending $$ on anything unless it shows to anyone looking to buy. Ice machines do not work ( only 2 of 6 in operation ) Resturant is closed as is the small store in the lobby. Our first room with the defects was rented the next night even though they knew nothing had been done toward repairs. YOU COULD BE THE NEXT ONE TO GET IT. Overall this is a dirty motel that is falling apart and the owners are doing only what has to be done until they have too. We should have moved to motel 6.", "Date": "January 13, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "TAMPA", "Title": "“NIGHTMARE!!!! I WOULD NOT EVEN LET MY PET STAY HERE”", "Author": "travelingtrail", "ReviewID": "UR12434548", "Content": "I have been in third world countries and not only had a nicer, cleaner hotel, but had friendlier service. We booked our hotel on line through hotels.com and thought we were getting a non-smoking room. When we arrived our romm reaked of cigarettes and mild-dew. The shower had a constant leak and the toilet over flowed (though they did use bleach to try to make the other people's crap flush down). When we asked for a different room we were told to contact hotels.com to do that. That when you book a room on line it's first come first serve so you get whatever is available. Well, they decided to up grade us to a different room. Only this room was dirty, the carpet was lumpy, and the sheets, blankets were dirty. We did not discover the linens being dirty until we were ready to go to bed. When we called the front desk they were extremely rude. I believe the woman's name was Doureen or something like that. She told us we would just have to wait until the morning for house keeping. We decided to call hotels.com to ask to leave this hotel & be booked at another location (since we were on vacation & this was a huge disturbance, let alone inconvenience to my entire family). We ended up leaving this hotel the same night we checked in only to be treated like a criminal. When the Doureen the front desk person found out we wanted to leave she became hostile with us and used profanity with my family members. I WOULD NOT EVEN HAVE MY FAVORITE PET DOG SLEEP IN THIS HOTEL.", "Date": "January 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "waltham ma", "Title": "“very happy”", "Author": "mikeee2020", "ReviewID": "UR11685956", "Content": "first off, the hotel is close to everything, we were surrounded by shops and all types of food establishments. and disney world is only a 10 minute ride. the room was wonderfull and to our surprise our room came with a little fridge and microwave. the beds were comfortable, and our room was very clean. it was a nice surprise concidering what we paid. michael f. waltham ma.", "Date": "December 19, 2007"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Hopefully the Legacy will NOT be ours!”", "Author": "VacationerFLA", "ReviewID": "UR11239181", "Content": "The above hotel was rated by your patrons as an average 3.2, with 2 stars on the confirmation. Your website posted it as 3-1/2 stars. You should re-evaluate this hotel. I would give this hotel only a 1/2 star, perhaps one star, but certainly no higher. 1) We were promised a room upgrade when we placed our booking online. There was NO DISCLAIMER as to any restrictions for a possible upgrade, i.e., \"Free upgrade may not be available at check-in due to being fully occupied.\" We were told my the HOTELS.COM reservationist that said the free upgrade was not available because the hotel was completely booked. It turns out that it was no fully booked during the time we stayed. Upgrades were available, but we were not given one. The front desk clerk told us that these rooms are reserved for \"higher\" rate guests. 2) The accommodations for a \"Standard\" room offer only two amenities - a small refrigerator and a small microwave. The bed was old and very uncomfortable. The overall condition (not cleanliness) was very poor. Only the \"upgraded rooms\" were much more comfortable. The room was in need of cosmetic work, terrible carpeting, in need of paint, and the fixtures were very old, including the furnishings. 3) This hotel must have a reputation for withholding washcloths. They must cost extra, thus only one was provided. 4) We booked two rooms, one of which was fairly clean (under the circumstances, as the maid can only do so much with which to work), however, the other room was poorly cared for...trash & cigarette butts under the bed (in a \"non-smoking\" room, no less), and the sheets did not fit the bed. A fitted sheet was required for the beds - one had a fitted sheet, the other a flat sheet which did not fit the bed properly. Two of 3 lamps had no lightbulbs & the a-c unit had no knob to turn it on. Mgt did fix that problem. The door lock did not work properly. We reported it, we assume they fixed it, because it appeared to work later. 5) The hotel grounds were acceptable, the pool (although not used) appeared to be lovely and inviting. Parking was plentiful. The hotel had no elevator (which should be noted when booking this hotel, for ADA purposes), the handrails were not that secure and in need of paint. The building itself appeared to have been recently painted. If you read some of the reviews, it was obvious that some of these guests were either upgraded to a premium room (which accounted for the 4.0 or 5.0 rating, or they've never stayed at a decent hotel in their lives. My advise to HOTELS.COM (and EXPEDIA) is -- do a more thorough review of the hotel BEFORE establishing your rating!! See EVERYTHING, not just the room they booked for the reviewer to get a better rating! And FULLY DISCLOSE all the facts! I've stayed in thousands of hotels over the years, mostly good or great, a few not so good. This hotel is certainly one of the latter.", "Date": "December 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lakeland, Florida", "Title": "“Becareful of the \"bait and switch\" when you arrive at this hotel.”", "Author": "dgoogirl67", "ReviewID": "UR10598342", "Content": "We booked on Hotels.com and had no problems at all. I specifically requested a non-smoking room. My husband, myself, and our son needed somewhere close to Epcot after the Food & Wine Festival so sleep before we drove back to Lakeland. The price was fantastic at 43 bucks ....thats why we even booked it . We wanted somewhere close, cheap, and clean. When we arrived at the hotel (around 10:30pm) the woman at the desk tells us that there are no more NON-smoking rooms and if we want one, we'll need to fork up another 11 bucks. We literally had to argue with this woman (Isabelle) about getting what we had already paid for online. We even had our printed out document that specifically said NON SMOKING ROOM. I showed her and she got so pissed and told us we should have called hotels.come to make sure that the room would be available. I have NEVER had to call a hotel prior to showing up to see if the room I booked was available!! Has anyone else???????????? Bottom line....she gave us a \"suite\" ..which looked just like a \"standard\" room...2 beds and a bathroom with a mini fridge.(whoopie doo) . She was a witch and because of her..Ill never stay there again. Otherwise ....the hotel was nice. They really need to fire her or teach her some people skills.", "Date": "November 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "manaus", "Title": "“Hate”", "Author": "viajantemanaus", "ReviewID": "UR10330908", "Content": "This hotel was terrible. I wouldn't stay there never more. The bathroom is old, the carpet is dirty! Stay away from this hotel!", "Date": "October 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "NJ", "Title": "“Stay Away! This place is AWFUL.”", "Author": "JEB23", "ReviewID": "UR10006893", "Content": "This place made the local Motel 6 look like The Ritz Carlton. If the rest of my party had not already made arrangements to stay at this \"hotel\" (if you can even call it that) I would have certainly left and made arrangements to stay elsewhere. For starters I had to literally shoulder my front door just to get in the room. Upon entry the first thing I noticed was the front curtain was hanging down on the end closest to the door. It had been this way for so long that curtain had a black groove worn through it where the door had been hitting it upon opening and closing. In addition to the groove/rip in the curtain there was black mold and and disgusting stains all over the curtain in several places that coule easily be seen. These stains were so obvious that it was clear that they were just ignored by housekeeping. The bathroom was tiled with three different types of tile from obvious repairs and the amount of mold growing through and around the bad caulk job was enough to make you want to lose your lunch. When I went to complain at the front desk I was offered another room which I was allowed to check out first and thankfully I did. Upon entering the room the smell of must/smoke was enough to knock you over even though this was supposed to be a non-smoking room. Upon further inspection I saw a 5\"x7\" hole in the bathroom ceiling that had the piece of the ceiling used to repair it hanging by a piece of caulk. I returned to the desk to let them know and they told me that they were taking that room \"out of service\" or so they said. The front desk called later to inform us of our new room number and to have us pick up our new room keys. Upon entering the new room it smelled of must and smoke which was again surprising because it was a non-smoking room. The TV in the new room had terrible reception and the AC did not work so a service tech was sent to the room. When the tech removed the front of the AC unit to reveal the filter it was clogged with enough dirt that could choke a horse and was certainly not healthy. He then began to work on the TV and was working on it when I had to leave the room. I returned later that evening only to find it was no better than when I left. I called for service the next day only to have the same result, terrible to no TV reception. The bathroom in the new room was as bad if not worse then the original room. There was visible mold and dirt throughout. In addition to these problems the top sheet / comforters on the beds had rips and burn holes in several places. Since we were only one day away from checkout we agreed to deal with these issues since we would soon be leaving. The Hotel has a nice set-up but is in a state of major dis-repair. The hotel does offer the use of a washer and dryer but do yourself a favor and bring your own quarters if you plan to use them. There is no change machine onsite and when I went to the front desk for quarters they told me they did not have any but I could go to the 7-11 down the road if I needed change. That was just par for the course here. No linen changes, wet towels from housekeeping, filthy bathrooms and carpets....I could go on and on. Do yourself a favor and pay a little more money for a better hotel and you will be much happier. My party had several rooms at this hotel and these types of problems were common in every room. STAY AWAY from the Legacy Grand ! They should have paid me to stay there. If you won't take my word for it then do yourself a favor and ask to see your room BEFORE you pay and you be the judge.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Atlanta, GA", "Title": "“We were booked for 3 nights but checked out early.”", "Author": "RedTraveler23", "ReviewID": "UR8708018", "Content": "This was a hotel from hell. Our room was trashed when we checked in. We went back to the front desk for a clean room. They said they were booked solid but would send a maid over to clean. We went out to dinner and returned 4 hours later only to find our room still not cleaned, we went back to front desk only to be told the maids are all gone home. We asked again for a clean room and they said they were sold out. We asked for a refund and were told sorry. We asked to speak to a manager and said we would need to come back in the morning. We ended up cancelling our reservation and finding another hotel to stay in. We went back the next morning to try to talk with manager but no manager ever spoke to us. We have since filed a complaint and and stop payment on our credit card.", "Date": "September 13, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Charlotte NC", "Title": "“Hotel is an overstatement - motel from hell”", "Author": "prjones09", "ReviewID": "UR8392111", "Content": "We were trying to visit Universal Studios on a school teachers budget. We however never expected to stay in conditions worse then the poorest African village. The rooms had the uncompromising scent of mold and sewage. The staff was friendly however but the shuttle service was #1 - if you were making a list of the worse and unprofessional and reliable shuttle companies in the area. The TV was very fussy and it had basic cable connected. This hotel truly needs to be shut down. There were bugs, mold, and the buildiing had areas of structual decay. We expected to save money but not put our healths at risk in the process. We checked out early and checking into an emergency room as soon as our plane lands to get clearance from our doctors.", "Date": "August 10, 2007"}, {"Ratings": {"Check in / front desk": "2", "Overall": "1.0", "Location": "3", "Value": "1"}, "AuthorLocation": "Lynbrook, NY", "Title": "“Mushrooms growing from the ceiling”", "Author": "Gabyhays", "ReviewID": "UR8379213", "Content": "We spent 6 nights in this dirty 6th rate dump! If this is the last motel in the area, we suggest that you camp in the woods first. They NEVER change the bed linnen. There were actually mushrooms growing from the bathroom ceiling. They did not provide had towels, one night they didn't even provide toilet paper. Almost nothing worked and their maintenance doesn't keep the place up. The housekeepers said; \"It's not our fault, we can only privide what management gives us\". The managers name is Buchanan. PASS THIS ONE BY OR YOU WILL FIND YOURSELF WRITING A MEGGAGE LIKE MINE. Oh, and by the way, I am en experienced traveler that used to be on the road two weeks every month, this message is not just sour grapes, it's factual.", "Date": "August 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“The Worst Place I have ever Stayed!!”", "Author": "FloridaMom98", "ReviewID": "UR8347118", "Content": "This hotel needs to be condemned!! There was mold in the bathroom, faucets about to fall out of the wall, door frames with rotten wood. I was afraid to look in the refrigerator. There was dirty laundry left under the TV area. My husband felt something scratching him in the middle of the night - It was a toe nail in the bed - and it wasn't ours!! I wore my shoes the whole time, I wouldn't even sit luggage on the floor it was so dirty and disgusting!! I had to go to the bathroom in the middle of the night but didn't go as I was toooo afffrrraid what I might see if I turned on a light.....Honestly, I thought I might see a rat!! Don't waste your money - It's scary.", "Date": "August 3, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Tampa", "Title": "“Stay Away From This Armpit Of A Hotel”", "Author": "jpwaldron", "ReviewID": "UR8239724", "Content": "This hotel was horrendous. I wouldn't stay there if I won a FREE stay. Mold in the bathroom, damp beds. Cheap on the towels. Crap stains on the seat, stains running down the wall near the toilet. Not possible that the maid missed those stains. The staff was the only bright spot. They were friendly and cheerful. We were upgraded without request from their regular crappy room to their premium crappy room. No pun intended.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Gibbstown, NJ", "Title": "“A good value - but this hotel is on the worn side”", "Author": "BillW73", "ReviewID": "UR7938796", "Content": "For the money, I paid under $40/nt, my room and hotel were great. I saw the reviews about bugs and became very concerned. So first thing I did was to strip the sheets and also look on floor for any signs of bugs. I saw nothing then and never saw an insect for the next three nights I stayed at the Legacy Grand. Now the room is a little worn, but every thing worked like television, a remote, many cable stations, the plumbing, and the water pressure wonderful. They cleaned the room each day and replaced the used towels too. The only bad thing was the shuttle service. Beware it took 1.5 hours to go to WDW due to the numerous stops at other motels.", "Date": "June 19, 2007"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "florida", "Title": "“Disapointed”", "Author": "UNIV", "ReviewID": "UR7703483", "Content": "I stayed at this hotel for 1 night. I will not stay here again. First, the clerk at the desk during check in was not very helpful, acts like I was wasting her time. The room was not very clean, especially the bathroom, it smells a little, and a lot of molds and dust in the corners. It was very disappointing. It was a nice building outside, looks clean - but not inside.", "Date": "May 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia PA", "Title": "“We had a GREAT experience”", "Author": "mellyandDon", "ReviewID": "UR7580117", "Content": "I booked my trip with expedia.com, and got the lowest priced package so in all honesty I was not expecting anything wonderful. My Hubby and I arrived a day early for our trip for personal reasons. When we arrived we were greeted by Darrine the manager who was soooo nice and very accomadating. We checked into our room and were a little upset that our television did not work ( a problem that could have happened anywhere ) I walked back down to the front desk and I explained my concern. Within in two minutes we were upgraded to a suite. In my opinion that is excellent customer service:) ANytime we needed towels or light bulb changed there was someone there to accomadate us within minutes. In my opinion the room was ok, and the staff was excellent. Durring my next trip to Kissimee you will find me staying at the Legacy.", "Date": "May 10, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "connecticut", "Title": "“Worst Experience”", "Author": "eagles4", "ReviewID": "UR7550976", "Content": "We arrived at this hotel on april 18 2007, the room had nasty odor, without coffee maker and iron and you could smell humidity, we asked for a room change and they told us that we had to pay more money, we told them that we traveled with a package, since we only need a place to sleep,shower,etc, we end up staying in this room, we used to get up with blood shot eyes, stuffy nose and the minute we hit the street all these symptoms disappeared. Louis East Haven, CT", "Date": "May 6, 2007"}], "HotelInfo": {"Name": "Legacy Grand Hotel", "HotelURL": "/ShowUserReviews-g34352-d84854-Reviews-Legacy_Grand_Hotel-Kissimmee_Florida.html", "Price": "$37 - $62*", "Address": "<div class=\"amenFloat\">", "HotelID": "84854", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b1/a3/b1a366ce27917bc043fffad94bb3ee9a3large.jpg"}}