{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Neptune, New Jersey, United States", "Title": "“If you smoke, this is a nice hotel”", "Author": "Jefffromtheshore", "ReviewID": "UR125569067", "Content": "I say this because the first floor smells like a cigarette break room. Luckily I asked for a non-smoking room on the second floor, but you can only do so much to get the smoke out. I could still smell a little of the smoke in the bed covers, which I'm assuming they use in all of the rooms. (The quarter-sized burn hole I found in my covers gave it away.) The rest of the room was fine, kind of old, neither good nor bad, a little ugly, but I was really just there to get a quick start to the airport the next morning. Which I did - in their free, smoke-stinking shuttle.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“\"Let us start from the beginning!\"”", "Author": "Lotus L", "ReviewID": "UR124644255", "Content": "Let us start from the beginning... when I came down to Miami from Orlando to visit my best friend who was in Miami on business, I wasn't expecting for my experience to be on the bitter-sweet end. After I coudn't find an available room at the hotel where she was staying,I had to find a hotel room asap, because it was already 2 am, I was extremely exausted from the trip & a long day at work. I should have know better... \"be prepared not to find a hotel room when there is a convention going\"...anyways, I finally found a hotel room available at this hotel. Honestly speaking this hotel needs to start up fresh again!!! air out the rooms, rip the carpets and replace them, and do a hotel makeover. I am not a smoker and hate the smell of such, however, this time I had to either put up with it or sleep in my car!! so I chose option 1, now.. If I can help it... I would not, would not, stay in this hotel again, I did because of the circumstances. Next time, I'll rely on TripAdvisor and book a room ahead of time... for any of my last minute trips or long trips. Good luck to you all.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Trinidad", "Title": "“Not terrible but wouldn't stay here again”", "Author": "Donna S", "ReviewID": "UR124600063", "Content": "The service was not very impressive. The front desk person wasn't even able to give proper details of nearby activities or able to provide us with info on how to get around. They charge extra for checking in early. The room was not properly cleaned and the ambiance wasn't quite welcoming. The lighting was poor. The iron wasn't working in the room and I wasn't able to get it replaced to iron my clothes for the next day. They have a pool not heated but it was the highlight of the place in addition to the fact that they were closely located to Merchandise Mart which is why we chose to stay there in the first place. It may be best suited for someone who just needs to overnight. Getting around is very expensive and public transport was very unreliable.", "Date": "February 14, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "lebu, chili", "Title": "“Ok hotel”", "Author": "jacobs442", "ReviewID": "UR124073859", "Content": "We had an overnight flight into Miami airport and not knowing any of the hotels chose this one due to the Brand name and the low price. The shuttle took a long time to pick us up. The front desk person was nice enough and from the oudside the hotel looked ok. The main problem for us was the smell of smoke. It was really overpowering in the hallways and the room itself smelled of smoke. The bedspread needed changing and the room was not spotless but nothing too bad. The hotel was ok for just one night but if we had to stay here on holiday I think we would probably have found somewhere else. We had to leave before breakfast so can not comment on that. The shuttle back to the airport was fine.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“A dump”", "Author": "ElleTraveler21", "ReviewID": "UR122671583", "Content": "Please do not stay here. The smell of smoke, the sketchy elevator (door opened and closed and dipped before moving), the attached local nightclub, the seriously dated rooms, the clogged water pipes in the bathroom, hair in the sink...disgusting... I stayed here during a five hour layover and I thought I could deal with a 1 or 2 star hotel for five hours. Wow....I can rough it in the forest more than I can stay in this hotel. Do yourself a favor -if you have to go cheap, at least go cheap and clean.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Smoke-filled Hallways, Closed Restaurant, and Distant Plug-ins”", "Author": "Gerry049", "ReviewID": "UR121814606", "Content": "I chose this hotel because I thought that it would be a bit higher quality than the other hotels with airport shuttles. After waiting about an hour, my shuttle came (I had landed at 5pm and had to fly out the next morning). I got to the hotel. Quick check-in. Since I had no dinner on the plane, I asked about nearby restaurants. Restaurant in hotel was closed. The nearest was Wendy's - 10 mins in the pouring rain. I was grateful when the front desk clerk gave me a menu of a local take-away and told me to call him and he would order for me; thus, I would avoid the 85 cent local phone call charge. No mention on the menu of delivery charges. I order a $6.70 sandwich. When delivered, I had to go to the front lobby to pick it up and pay $12. Went through hallways that reeked of smoke to my room which, although officially non-smoking, still had a lingering smell of smoke. Rather cheap decor. I put my laptop on the desk only to find that the nearest plug-in was half-way across the room. I went to the bathroom - found a small bottle of shampoo (no conditioner or lotion) available. The next morning, I checked out - included among the charges was a $2 per night, plus tax, room safe charge - which I never used. The in-hotel restaurant opened at 8am for breakfast - I had to catch the 7:30am shuttle to make my flight. Advice - bring own food or stay elsewhere. Also, I hope you do not have a smoke allergy.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "atlanta", "Title": "“Terrible hotel”", "Author": "AtlantaZanne", "ReviewID": "UR121781828", "Content": "Hotel was convenient to Miami airport but that was it. The place is old and dirty. Do not recommend it. Had to wait 25 minutes for shuttle. Stay at the brand new Comfort Inn behind this hotel.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Trinidad", "Title": "“HORRIBLE follow up service with customers calling by phone”", "Author": "MarinaMaharaj", "ReviewID": "UR121707133", "Content": "I have been over charged on my credit card by Days Inn International and I have been calling for the last 4 days trying to get in contact with the mysterious accounts receivable but still to no avail. This is TERRIBLE service. I am already in my home country Trinidad and now I am forced to send up my phone bill by calling everyday. This is HORRIBLE follow up service. I called left a voice mail no one contacted me. When I call the hotel accounts receivable no one answers. HORRIBLE follow up service i say.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Maracaibo, Venezuela", "Title": "“Days Inn Miami International Be careful with your credit card”", "Author": "Intrepld", "ReviewID": "UR121252720", "Content": "I had a confirmed reservation guaranteed with credit card for Days Inn Miami International for November 13 to November 18, 2011. Confirmed rate was $85.46 for the first night. Due to international air delays, I arrived at 2 AM next day. The front desk attendant said I had no reservation having already charged my CC for no-show, but I showed her a screen capture of my confirmed reservation email. Then she said motel was full but she could let me have a no-show's room for $159.95 plus taxes. I accepted. Me and my wife are seniors and it was late. When I arrived home I noticed in my bank statement they also charged me $93.46 from my reservation's credit card for the same night they charged $159.95 plus taxes. I was asked to complete an online survey about my stay and I reported my claim. The next day I received from a no-reply email saying the $93.63 didn't appear on his computer. I then tried to contact the Wyndham people (owners and managers) through their contact web page, but it couldn't go through until I changed to a US address. So not only I was charged $253.58 for a written confirmed rate of $85, but Wyndham or Days Inn will not accept any type of feedback online from outside the US.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Horrible”", "Author": "Jan M", "ReviewID": "UR120924836", "Content": "We've stayed here when we arrived to Miami, it was very easy to find even without map. It is expensive, more than 80$, dirty rooms, not enough space in the room, bit smelly. If possible wouldn't stay again.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Trinidad", "Title": "“Acceptable but probably wouldn't return”", "Author": "Ackbar", "ReviewID": "UR120310203", "Content": "We stayed here in transit on the night of October 30th. Sleep inn was booked, and we looked for the next available budget friendly hotel for the overnight. We missed the shuttle at the airport despite having come out at 25 minutes before the said time the shuttle shift was ending. Check in was quick and the girl at reception was very pleasant and helpful. The corridors are very dated and reminded me of hospital corridors to be quite frank. On entering the room, the decor gives it a very shabby unappealing look. But it was comfortable ,clean and fully equipped. It served its purpose. Only comment is that the a/c units should be more strategically positioned as my husband got the direct blast all night. Check out was quick. There was some waiting time in catching the shuttle the next day to the Miami airport, bearing in mind this hotel is probably about 5 minutes drive from the airport. The driver seemed disgruntled, couldn't understand what he was saying because he spoke spanish, but basically quarreled all the way to the airport to himself. Please bear in mind we were told by him that there is a $3.00 charge for this service. We thought was complimentary but didn't make a big deal of it because we usually tip anyways.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Edison, New Jersey", "Title": "“Cost the Price”", "Author": "Sathya S", "ReviewID": "UR120283191", "Content": "The hotel was nice. its worth the money. The staffs are really kind enough and very attentive. Rooms are good and much satisfied with the amenities. The check in and check out can be made much faster.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Indianapolis", "Title": "“Comfortable”", "Author": "clark957", "ReviewID": "UR119399286", "Content": "Stayed here one night to catch a curise ship. The room was comfortable & clean. The hotel had free transport to the pier. The only complaint was that we waited 45 min. at the airport for the shuttle (the drive between hotel & airport was 10 min.)", "Date": "October 17, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Punta Gorda, Belize", "Title": "“Good for a stopover”", "Author": "Hickatee", "ReviewID": "UR119114806", "Content": "I ended up at this Days Inn having got fed up with waiting 40 minutes for the other Days Inn shuttle to turn up. I needed an overnight stop before catching a flight the next day, and this worked well - pleasant staff, swift check-in and check-out procedure, prompt shuttle transfer, and clean and comfortable room.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Awfully bad!”", "Author": "jaadddee", "ReviewID": "UR119078652", "Content": "Place was dirty, smells horrible and staff did not understand English!", "Date": "October 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "MA", "Title": "“Comfortable Short Stay”", "Author": "ips28", "ReviewID": "UR118621715", "Content": "We stayed here only for one night to board Cruise next day. Room was clean & comfortable. Big plus is free shuttle from airport and free shuttle to Miami Port, So if you are flying down to Miami just to board cruise next day, then it's a cheap option as you will save on rental car or cab.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Diego, California", "Title": "“better than the other airport hotels”", "Author": "ThePrincess87", "ReviewID": "UR117069728", "Content": "if you're looking for a cheap and clean place for a night close to the airport this place is good. the rooms are clean and its literally right next to MIA. the bathroom was clean. there was a fridge and a microwave in the room that were both functional and pretty new. the staff are nice and not sketchy at all. i went to a few other hotels before coming here and they were all pretty bad and more expensive. its nothing special, but its what you need for a good night's rest.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Port Richey", "Title": "“ROBBED IN PARKING LOT”", "Author": "acoggins54", "ReviewID": "UR116469725", "Content": "My Husband and I checked into the Motel. Upon Arrival the 1st Clue is that this hotel is from the Ghetto. After we checked in My Husband and I were sent to the Back of the Parking Lot to park. This we thoguth was extreemly werid but never gave it much thought. When you park back their it's in a gate past security area. We went into our room and asleep we went. My Husband came out at 3;30 am to find a Man standing behind our Van. He didn't give it much thought and went back into the room where I was. Well when we checked out we proceded to our Van to find the Sliding door was half open. Looking into our van our 500.00 Gps as well as our Camcorder was stolen out of the Van. Days Inn said they were going to do An Investigation into the Manner. If you serisouly Value your safety of yourself and your family do not stay here. It is a Dive and theives love this parking lot.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good”", "Author": "lala35805", "ReviewID": "UR115965663", "Content": "Great price for the hotel. Free transportation to the port. A little bit smell in the room.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "USA", "Title": "“Stay here only if all other hotels are full”", "Author": "eirebuff", "ReviewID": "UR115429771", "Content": "The Days Inn web site says an on-site restaurant, but not that it is only open in the morning. No restaurants within walking distance, so plan on an expensive cab ride somewhere. Well worn and not very welcoming. Quick ride to the airport, but the driver does not know what a stop sign means.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Interesting location, amongst the trailer park!”", "Author": "Joyno", "ReviewID": "UR98786676", "Content": "I booked this place as it was reasonably priced and was near the airport. Only problem was that NW 11th street is crossed by the freeway and the more west you go, the worse the neighbourhood! I felt bad leaving the HoJo's and Hiltons behind. Check out the period trailers parked along from the hotel, no doubt used after the dodgy nightclub next door! We checked in, no problem, and the manager was polite, although we didn't overtest his customer service skills. The room was big, reasonably clean, with a great view of the underside of the 757 taking off. TV worked, hot water and clean bathroom with coffee machine. Sheets looked ok, and a preliminary bug check found nothing. We tried to get something to eat at the place next door. We walked into what looked like a nightclub set from an early Starsky and Hutch episode! An ancient man smoking a cigar draped in gold shouted at us that the place was closed. I couldn't help laughing at him. I needed to feel my way out as it was very dark. I slept that night with my gun under the pillow. Would I stay again? Yes, but I would take a purple suit and gold chains.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "CrazyForGambling", "Title": "“Absolutely Horrible”", "Author": "CrazyForGambling", "ReviewID": "UR98727763", "Content": "If you stay here make sure you take your own towels because they will NOT give you an extra one and take your own toilet paper, shampoo, and other toiletries. We were given three towels in our room for 4 people to use and I was told I couldn't have another one because they didn't have extra ones. They didn't have extra pillows either (the place wasn't even sold out). Don't bother to ask the housekeepers for anything because 1.) they will not understand what you are saying and 2.) they won't give up the shampoo even though it is for hotel guests to use, and forget about an extra roll of toilet paper (take your own) This place was the most horrible Days Inn I've ever stayed at and I would NOT go back for any reason. Oh, the AC/Heater didn't work right either...the security doors didn't work and the front desk staff are not friendly at all! The only good thing I can say about this place is that seeing it in the rearview mirror was the highlight of our stay!", "Date": "March 2, 2011"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Hermantown, Minnesota", "Title": "“I wouldn't do that again.”", "Author": "getmeoutofminnesota", "ReviewID": "UR98007515", "Content": "We stayed here just one night-late flight-early morning drive to Key West. Run down, marginally clean. If that's what you get for $112 near the airport, I'll pay more next time, or I'll take a taxi to the Blue Moon for $155.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "West Bend, Wisconsin", "Title": "“Looked nice after a while not really”", "Author": "Ryan H", "ReviewID": "UR97491837", "Content": "Upon arriving (which is not even close to the airport) somebody got busted for major drugs in front of the hotel and was having their car searched for more. The employees seemed angry or irritated at use and the other people. The other guests had this feeling like they had been the the previous and seemed mad. Our room was suppose to have a view of the sea but when we complained they seemed mad and switched our room for a even smaller room facing the sea. That room wasn't to clean but okay bathroom was the cleanest so that was good. Their pool was pretty good but crowded. I liked how this hotel was on the beach but seemed extra angry when the sand I had on me went on the floor. Oh and the closet in my room smelled like urine. No considering this place again.", "Date": "February 21, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "NEW YORK", "Title": "“What a naughty concierge!”", "Author": "CUBANO45", "ReviewID": "UR95080169", "Content": "I arrived to Maimi from New York on Monday January 11th and I waited and waited for the shutter van to take me to the hotel for almost two hours and it didn't show up though i called the front desk several times but despite that I had a paid reservation for two days the front desk guy cancelled my reservation without any request of my part just because seem that he got tired that I called him several times...it was a nightmare and I got very mad because then i had to call another hotel to get a room and of couse i had to pay more... Please trust me don't stay in that hotel because people like the concierge on tha shift (afternoon-evening ) need to learn how to deal with customers especially learn what the word \"respet\" means.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“They Will Rob You”", "Author": "PattersonNY", "ReviewID": "UR94188305", "Content": "We reserved a room a day before our cruise. After seeing the reviews 2 days later, we called and cancelled. That was 2 months prior to our cruise in December. After we returned home, we saw that they had billed us for the room that we didn't stay in. They said that they did not receive a cancellation from us. We are currently disputing this charge. With so many bad reviews from people who stayed there, we had problems with them and we didn't even stay there. If you need a hotel just prior to your cruise from Miami port, stay at the Holiday Inn. They have a free pick up from the airport & $1 charge per person for a shuttle to take you to the Miami cruise terminal that leaves on time at 11 am. Buyer beware, and cancelled reservation beware too.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Winter Park, FL", "Title": "“I deserved it ... for being so cheap”", "Author": "rrgwpk", "ReviewID": "UR92455686", "Content": "- Phone did not work ... there was no power adapter - TV remote did not work. Took it to the front desk and they gave me another. It did not work either. - very dimly lit. 2 wall lamps by the bed worked, the floor lanp did not work. - stayed 4 nights .. on Sun AM there was no hot water. Had to take a cold shower before leaving on business for the day. - no network access in the room for 2 of 4 days. Network very slow when it did work. - emergency exit/security door was unlaocked at all hours. Not very security for this rough neighborhood. - weird chemical smell throughout", "Date": "January 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Menlo Park, California", "Title": "“Smells and needs remodeling - badly”", "Author": "dsilver829", "ReviewID": "UR89784179", "Content": "There weren't any cockroaches, but the place looks pretty bad. The lobby looks like it's been bombed out, and the first two rooms I got smelled badly - one of smoke and one of some weird odor. The third room smelled fine but had stained carpet. To the hotel's credit, the staff let me transfer to a new room several times with no fuss. And the hotel is close to the airport and cheap (by Miami standards). Overall, I have to believe I could have done much, much better without spending too much more money.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Forest", "Title": "“WORST HOTEL EVER-FILTHY DIRTY”", "Author": "Christinjoy03", "ReviewID": "UR86306615", "Content": "My husband and I stayed here on the last night of our honeymoon. Travel agent made reservations for us and we were DISGUSTED! Dead roach on the floor in the bathroom, stained sheets. We slept with the light on because it was so dirty. Found coins under the TV stand, a dirty tissue behind the night stand and the ceiling paint was pealing off. IT WAS GROSS!!!!!!!! DO NOT STAY HERE! We paid $60 a night. This place is also in the GHETTO! Not safe!", "Date": "November 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ridgeland, South Carolina", "Title": "“Bad Experience”", "Author": "princessapplez2010", "ReviewID": "UR68243964", "Content": "This was my second stay at this location and compared to my first experience, This one Sucked!! First of all, the second day we came back to our rooms, the housekeeper didn't clean one of them and she didn't even bother to leave clean towels. We went down to complain and the guy at the front desk told us that there was nothing he could do but give us clean towels. There was no apology or reason why our room was not cleaned. Second, on the third day of our stay, we returned to our rooms and the other was not cleaned. We were outraged. Again, we complained to the front desk and the person that was there had a \"don't care\" attitude. She gave us clean towels and sent us on our way. We didn't have this our first stay there the previous year, so we were very surprised at the poor service we received. Not only that, we received a survey by email last year about our stay, but for some reason, we didn't get one this year. I guess they new the service was poor. I wouldn't recommend this hotel to my worst enemy.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Bed Bugs”", "Author": "tamtam136", "ReviewID": "UR63373333", "Content": "There was bugs in my bed and bathroom. When we reported this to the office they asked us if we left the door open. They did give us another room but I could not sleep and felt very unconfortable. There were people hanging out in the parking lot and in cars at all hours of the night. We heard men talking about meeting prostitutes in one of the rooms ouside our window in the middle of the night. The internet was down. When we checked out we talked to a few other guest that had the same bug problem and the office asked them the same thing about leaving the door open which we did not do. Manager did gave us half off the room but after we foiund out that other guest had the same problem and it was not isolated we should have had the room fee waived. We even showed the manager video and pictures of the bugs.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "CONNECTICUT", "Title": "“not so good....”", "Author": "SOPHIE44", "ReviewID": "UR62401240", "Content": "We picked this place because it was \"close to the port\" and airport. We arrived very late 10pm, and we were not expecting much except for a clean room and a ride to the port in the morning.room was clean enough, but the whole place smelled like cigarettes. We went over to the bar to have a beer, and it was not very comfortable Everyone was smoking, and I dont think anyone spoke English at all. We signed up for the 11 am ride to the port as soon as we arrived. The next morning, when we inquired about it, we had been bumped to 12 pm. We were already set to go, and we didnt want to chance waiting until 12 and having it be later. \"Close to the port \"turned into a $40.00 cab fare. I cant say much positive about this place. not a good pick for a precruise hotel. You would be better off paying a bit more to be closer to the port.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Awful airport hotel - super overpriced!!”", "Author": "Globeteach", "ReviewID": "UR61155710", "Content": "We were desperate for a place to stay in Miami for one night on a long stopover at MIA on our way to Central America. This is one of the poorest airport hotels I've stayed in and it was super expensive! The bedding looked old and needed replacing and the noise from the airport was loud. There was no breakfast - which for the price we paid, I thought there surely must be a donut or something - and no coffee. The only benefit was the free shuttle to and from the airport. This hotel is next to a salsa bar/nightclub, which had some scantily-clad women entering at the time we were checking in, certainly not something I would want my young children to be around or see. The noise from the nightclub could be heard inside the hotel, thankfully we were on the other side of the building. I was so mad that I had paid so much money to stay here!!", "Date": "April 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Worst hotel experience by far!”", "Author": "Scottee25", "ReviewID": "UR59589408", "Content": "My wife and I needed a hotel for a single night prior to a cruise. I booked this hotel for several reasons. The first being that it offered free shuttles from the airport to the hotel and from the hotel to the Port of Miami. It was also close to the airport, and due to the time of our arriving flight, we would not have far to travel. We knew this hotel was not supposed to be fancy, but figured it could be a place for us to sleep the night before out cruise. Therefore, at $130, we thought the shuttles alone would make up for the slightly high price. Our flight was scheduled to arrive in Miami at midnight and I confirmed with the hotel that their airport shuttles run until 1AM. Due to a delay departing, we did not arrive in Miami until 12:30AM. The first thing we did was call the hotel and inform them that our flight was slightly delayed and we were on our way to our luggage. They informed us that it was not a problem and to simply call back once we had our luggage in hand. By 12:45AM we had our luggage and once again called the hotel only to find out that their driver had just left to go home. We were forced to take a cab ($17 I believe) which the hotel refused to reimburse us for. Check-in went painlessly enough and before too long, we were in our room. The room was old, dark, and just simply depressing looking. However, since all we wanted to do was sleep, we really didn't care about its appearance. Unforunatelly, we were unable to sleep throughout the night undisturbed. When the night club crowd poured out after 2AM, they simply did not go home. They continued to party out in the parking lot until well after 3AM. Between the thumping music, squeeling tires, and Spanish dialog, it was difficult to continue sleeping. Only upside was my wife was nice enough to translate some of the more colorful things being said. Eventually the crowd dispersed and we were able to fall back asleep... until roughly 7AM when the hillbillies in the room across from us woke us up with all the noise they were making. They had left their door open so that their brats, who were running up and down the hall, could come in and out of the room as they pleased. Needless to say, we knew we were not getting any more sleep this morning. We decided to get up, get dressed, and grab some breakfast. We soon learned that the breakfast being served in the restaurant/night-club was a cold breakfast and no hot breakfast was available. It also didn't help that the restaurant still smelled like urine from the night before (you have to walk by the bathrooms when you enter the restaurant to get to the seating area). Front desk informed us that the closest place nearby that serves warm breakfast (that would be open) was a Wendy's about a mile away. Not too bad of a walk but there is really nothing else around the hotel. After our breakfast, we grabbed our luggage and headed down to grab the shuttle to the port. We were informed that the shuttle leaves on the hour and of the 3 time slots available, the first 2 were already full. The lobby was also completely full as 2 wedding parties appeared to be checking out at the same time. Deciding we had had enough of this hell hole, we asked the hotel to call us a cab. Thankfully one arrived within minutes and we never looked back (btw, cab fare to the port was roughly $40). Whatever your reason's are for needing a hotel, stay clear of this place! I can't think of any reason why I would ever recommend it to anyone. If the rest of the hotels are sold out for a given night, you would still be better off sleeping in the airport!", "Date": "March 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Berlin", "Title": "“Great Airport Hotel ... makes you wanna leave as soon as possible”", "Author": "lplusk", "ReviewID": "UR58726676", "Content": "We read the reviews before, and we didn't want to stay there. But our reservation at a different hotel by Hotelclick.com was a complete flop. So be aware of Hotelclick.com!!! The Days Inn is way over-priced and scary: the location, the parking, the front desk clerk. We only needed to stay for 8 hrs. Thank goodness!", "Date": "March 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Illinois", "Title": "“What a Dump”", "Author": "Keiko96", "ReviewID": "UR57761510", "Content": "This place was a total dump. Read and pay attention to the reviews. This place is stuck in the 1970's. Elevator kept breaking down, parking was scary, and the room was a joke. The hallways smelled like mold and mildew. The front desk clerk acted like they didnt have a clue where some restaurants were at. Do your self a favor and stay somewhere else.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2"}, "AuthorLocation": "michigan", "Title": "“Horrible horrible horrible horrible horrible horrible”", "Author": "badhotelreview", "ReviewID": "UR55815283", "Content": "This place is ridiculous. The front desk person habitually lies. We waited(AND ARE STILL WAITING) at the Miami Airport for over an for the shuttle, He JUST arrived 1 HR 43 min after the first call. The shuttle to the Port of Miami really doesn't leave until noon, but they want you out AT 11 so they tell you to be in the lobby by 10:45 leaving you to wait in the parking lot/LOBBY for over an hour. NO SUCH THING AS CONTINENTAL breakfast you must pay $5.00 JUST FOR EGGS, toat and coffee. NEVER AGAIN!!!!! THE COUPLE RIDING with us agreesTHEY WAITED 1HR AND 15 MIN. The comforter had been burned with an iron and they had it on the bed like it was good to use---not good. KATINA-MICHIGAN", "Date": "February 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "girlsheri1", "Title": "“No elevators & Cont. Breakfast isn't FREE!”", "Author": "girlsheri1", "ReviewID": "UR54327954", "Content": "We were on the 2nd floor, with all our luggage for 2 weeks, and had to drag it up 2 flights of stairs. The room was extremely small. I picked this property because it had a cont. breakfast, but they got me, you had to pay extra for it. So be sure to read the fine print! I wouldn't stay here again, I felt taken advantage of.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Pennsylvania", "Title": "“Believe the reviews, do not stay here.”", "Author": "TravelFan_2010_10", "ReviewID": "UR53557861", "Content": "Our room was dirty. Sheets had not been changed. Bathroom had one bar of soap. Nothing else. One elevator worked sporadically. Pool was closed. Reason unknown. Soda machine kept money, did not dispense water bottles. Restaurant is not associated with hotel. It is a night club of some type. Restaurant was very smoky. Food ok. Hamburger was raw even after sending it back to be re-cooked. Bill was incorrect at check out charged extra for 3rd person in room. Desk staff were reluctnat to change even when reservation information presented. Shutlle to port was over crowded. Loaded by ship. Ours was last ship loaded and standing room only to port.", "Date": "January 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Iowa", "Title": "“Ick!”", "Author": "IowaCruisers", "ReviewID": "UR52710874", "Content": "We checked in and the front desk people acted very annoyed to be disturbed from their T.V. show and magazines. Then we went to our room, more like the gas chamber! It reeked of ciggerette smoke. I was afraid to even open my suitcase thinking that I would get cockroaches, our blanket on the bed had ciggerette holes in it as well. The dinner was over priced its in the ghetto anyway so finding even a mc donalds was hard. It is incredibley out dated and I don't think anyone spoke english to top it off! Then we tried the \"eqqupment room\" the only thing that worked was the stair stepper, it was ridiculious! Never again.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "west palm beach", "Title": "“Great trip.Clean rooms,close to airport/cruise ships.Great deal”", "Author": "familyfirst032", "ReviewID": "UR38472148", "Content": "Good shuttle service to cruise ships and airport.Very short ride.Clean and safe.Great Deal!!!", "Date": "August 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "los angeles", "Title": "“Great hotel, lousy location, rude staff”", "Author": "johnnybnice", "ReviewID": "UR35564398", "Content": "I loved the hotel itself but everything else turned me off to it. The front desk women was rude and really didn't want to help at all. The cleaning people were apparently having a meeting in the middle of the hall we when I was clealy struggling to carry all my bags past them. They all just looked and continued talking. The room itself wasn't bad. It was cool having a fitness center in the hotel as well. The pool and pool area was nice but it was right near a busy highway so there was constantly traffic buzzing along at all times of the day. The neighborhood was kind of sketchy as well. And you should probably learn spanish before you come visit. Only some of the staff at the nearby Taco Bell spoke English.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Ocala, FL", "Title": "“Run away! Don't Stay. Total Dump in Very Bad Area.”", "Author": "TotalRoadWarrior", "ReviewID": "UR35415828", "Content": "First of all, this place is HARD to find because of all the freeways crossing in the area. It is located at the SW end of the airport and you get to hear planes 24/7. All there is around here are warehouses and half of them are empty. The so called restaurant on premises is actually some kind of bar/disco that gets cranking late at night. It wasn't open when it said it was so I didn't check it out. I had a car and could get out to eat. Nothing close. The desk clerk when I checked in was friendly and gave me excellent directions for the places I wanted to go. However, that was the only high point of this stay. The parking lot has a chain link fence but apparently it never gets closed. You drive around back to get to the elevators. There is a key operated door, but it doesn't close properly, so it's never locked. When you enter through this door you get the distinct aroma of dirty sneakers. It's stinky & moldy. No air conditioners on in the hallways, yet it is over 90 degrees outside. The only ice machine is on the first floor, but there is nothing saying that, you have to figure it out. When I got to my room I was surprised that it was clean although dated. I was under the impression I would have a fridge & micro, but the clerk informed me I would need to \"upgrade to a suite\" for that. Forget it. There was a safe with an alarm sounding. I called the front desk, but never got an answer, so I finally went downstairs and he did tell me how to turn it off. Apparently when he is checking someone in, he doesn't answer the phone. At all. Nice touch. There were unsavory characters hanging around the parking lot all the time. I would close the door behind me (so you would need a key) but every time I used the door, it was left open again. I was concerned for my safety as a woman traveling alone, but nothing happened. Still, I was nervous just going to my vehicle to get things. The crowning blow came about 2:45 AM. I had a dry mouth and woke up. I could feel the walls vibrating. At first I thought the room next to me had a loud radio or TV. But then I went to the window, which was also vibrating. Looked outside and all I can say is \"Holy Cow!\" The parking lot and the lot of the next property were PACKED with people, there was music going, food vendors set up, I kid you not! It was unreal! Some kind of street party right outside the hotel with HUNDREDS of people milling around. There were even cops supervising (not arresting or bothering people). I have never seen anything like this in a hotel parking lot in my life. I had trouble getting back to sleep. At 3:30, they were still going strong. The next morning when I went to check out two people were at the front desk speaking Spanish to each other and couldn't care less that I was standing there. I finally got some attention, got checked out (bill was wrong, that took another 10 minutes to fix). So after all was settled, I asked the woman at the desk what the party was last night and she said \"I didn't work last night. I wouldn't have any idea.\" BS, is what I thought. So I asked the guy at the desk and he said \"probably something with the disco.\" Oh Christ, they are playing dumb and you KNOW that they know. This place sucks! To top it off, the hotel website says this location has THE CHAIRMAN'S AWARD. What a joke. I have been to other Days Inns with the Chairman's Award and they were all first rate. This place should be imploded and paved over. Don't go, even it you can get it for free. Don't say you haven't been warned. I wish I had checked Trip Advisor first. This was a last minute business trip.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "san jose", "Title": "“I wonÂ´t go again!!!”", "Author": "shuching", "ReviewID": "UR34152672", "Content": "I am handicap, for me is difficult to walk. Anyone help me with the bags. The iron doesnÂ´t work and the bathtub doesnÂ´t work. The service is terrible. The internet is very very very slow.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Los Angeles", "Title": "“One of the worst hotels I've ever stayed in!”", "Author": "TheCrabbyTraveler", "ReviewID": "UR32497786", "Content": "DUMP! My wife and I stayed here for one night on a layover to the Turks & Caicos Islands. First, I only gave it one star because it couldn't give it less than one. This was such a horrible experience, I will never stay at a Days Inn again. We chose this hotel because it was listed as being only 2.1 miles from the Miami airport... Yeah, if you drive across the runway! We also picked this hotel because it advertised a free airport shuttle. I called using the courtesy phone and the person who answered said he would send the driver over immediately. After 30 minutes of stand out in the heat and humidity, we called again. This time the driver was there in about 15 minutes. The ride took about 10 minutes, but driving distance I would say it was about 5 miles and it was near the end of the runway, so we got to listen to planes taking off all night. After checking in we walked to our room past several smoking rooms (each room had a sign smoking or non-smoking), the entire hallway wreaked of cigarettes. Our room was small and smelled really bad... like mold. The furniture looked really old and worn out. So bad that I didn't want to set any of my clothing on it. The same goes for the carpet, I wouldn't even walk around in socks, I put shoes on to go to the bathroom. Hell, I wouldn't let my dog (if I had one) do the \"butt scoot\" on this carpet! The restaurant attached to the hotel was a ghost town, and looked like they offered over priced burgers and similar stuff. We decided to see what was around the hotel. The only thing in reasonable walking distance was a gas station with a small convenience mart attached. We bought a six pack of beer and went back to the room. Through the evening flyers for various take out places kept appearing under the door (about 5 total). We elected to call Domino's Pizza whose phone number was on the room key! It was not my favorite, but at least you know what you are getting. In summary this is the grossest hotel I have ever stayed in and will never patronize Days Inn again as a result. I'd rather sleep in the airport than stay here again!", "Date": "June 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“very isolated”", "Author": "2englanders", "ReviewID": "UR30909029", "Content": "After calling for their free shuttle from airport to hotel we waited over 1 hour for them to pick us up. I called 4 four times and was assured each time the driver was on the way. It's not very far from the airport (thus the name Days Inn Miami Int'l Airport). Then the driver had the gall to expect a tip!!! We finally got into our mediocre room and went to the on-the-premises restaurant which did not open at the advertised time on the sign by the entry door. There are no other places to eat nearby. We had no car because we were only staying overnight and catching a cruise the next morning. The next morning we came to the same restaurant at the advertised time of opening and was told they did not open before 8am, later than the sign said. The desk clerk told us the only thing nearby we could walk to was a Wendy's. Turns out that was over 2 miles away. We gave up walking and returned to the restaurant around 8. The neighborhood is all deserted and the dominating language is Spanish. Even in the hotel lobby the staff all speak in Spanish even in front of their guests, which I think is rude. The room was okay, but don't expect much. There were 2 chairs but no table between them. The morning shuttle to the pier was okay.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Norway", "Title": "“Good value and location for a night by the MIA airport”", "Author": "blaaveisa", "ReviewID": "UR29399225", "Content": "My boyfriend and I stayed at the Days Inn one night when we flew into MIA from Europe. We arrived at midnight and we needed to stay one night by the airport to catch a flight to Honduras the next day. We wanted a cheap alternative, since it was just a matter of sleeping a few hours. We picked the Days Inn beacause of the good price ($ 60) and the location, even though the reviews here on trip advisor were not very convincing. But we were very happy with the room and the service we got. It was clean, quiet and with a big and nice bed. We slept very well after more than 30 hours of travelling. We got a smokiers room, but it didnt smell anything at all. I can strongly recommend the Days Inn if you need a cheap place to stay by the MIA airport. The shuttle service picked us up right after we arrived and took us to the hotel, all for free.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "SAO PAULO, BRAZIL", "Title": "“Good price for an old and basic Hotel”", "Author": "rodrigomspinho", "ReviewID": "UR28899115", "Content": "I spent 4 days at this hotel, which is really close from the MIA Intl airport. They offer 24-hour free shuttle, and the driver was kind and helpful. The receptionists were also very friendly. They gave me great tips for shopping and dining, and I had no rip-off incident following their tips. The Hotel itself is really old, and needs some maintenance at all. However, the room was very acceptable, clean and confortable. ThereÂ´s a Car rental office at the lobby, and prices are the same offered by AVIS, HERTZ and others. The rate was around USD60,00 per day, which I consider a good price, for a simple and old Hotel, but conveniently located and reasonably confortable.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "3"}, "AuthorLocation": "bolivia", "Title": "“As bad as they say!”", "Author": "danielbolivia", "ReviewID": "UR25940700", "Content": "I stayed one night in February and even if it was free, I still regret it! I guess it's all about what you're used to, but for me it was borderline depressing and luckily I don't have suicidal tendencies... Smelly elevators too. Since a picture is worth a thousand word, I'll put a couple of them. Oh, I do have to mention that I had a newly renovated room... well maybe it was renovated by some Mister Newly a couple years ago! As far as bugs I haven't seen any, no bites or anything either but still a little scary. On the last note, those awful restaurant pamphlets all over the place reminded me of the crappiest Montreal neighborhood, please don't even think about calling them, there's a pizza hut that delivers there if that's what you want! Also no place to buy anything but a small gas station market. Anyway, good luck if you still decide to go!", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Monterrey", "Title": "“Not that bad”", "Author": "JavierOrtega", "ReviewID": "UR25658337", "Content": "The purpouse of the trip to Miami was to attend a convention. Hotels near the convention center with average prices at Collins Ave. were dysmal or to pricey so we decided to stay here, near the airport. I read ther reviews and was prepared for the worst since the Days Inn at South Beach was horrid the last time I stayed there 2 years ago. But I was surprised that the fornt desk guys were polite and helpful, the hotel even 80s-looking-old was clean, we stayed at the 3rd floor and the rooms were clean. Towels were changed daily, housekeeping did their job, wake up calls were requested and made and the shuttle to the airport was on time (although the driver was somewhat cranky). Bad stuff: one day I heard a knock on the door and as I was making my way to the entrance a maid entered asking if we were checking out that day, I didnt like her coming in like that. 5 to 6 pizza fliers were slid down the door nightly. Overall you get what you pay for and was a quite decent experience.", "Date": "March 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "indianapolis, in.", "Title": "“Not a good experience”", "Author": "Honey99922", "ReviewID": "UR24529755", "Content": "Had a very bad smell and terrible service. Went shopping and was left at a Walmart for over an hour after we called to be picked up and when we called they would say \"be there in 5 min\" Also our bus to the cruise ship broke down and they let us sit for an hour without telling us. Not clean either.", "Date": "February 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "boston, MA", "Title": "“won't stay again”", "Author": "teach32", "ReviewID": "UR24381293", "Content": "We had stayed at t his hotel last year before our cruise. Granted it is not a \"nice\" hotel but it served the purpose for an overnight and the free shuttle to the pier was great. This time the shuttle casts 6.00per person and then they charge $2.00 per person for the luggage once in the van. The room was okay, but the first room we were given reaked of smoke and dirt. we were moved to the 4th floor and that roomwas better. Didn't take a shower the next morning, the tub was a little shaky. Won't stay there again.", "Date": "February 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "", "Title": "“Beware of untruths!”", "Author": "javo", "ReviewID": "UR23062699", "Content": "We stayed at the Days Inn MIA two nights in december book-ending a cruise experience. Each night the room we had was clean and spacious- that is the only thing that raises my review above a \"terrible\" rating. They do NOT have free shuttle service to the cruise port. They charge six dollars per person and before you head to the port, the driver collects for dollars per person for baggage fees. The restaurant is really a joke. Very limited menus, poor service, etc. What makes this worse is there are really no other places within reasonable walking distance as options if you arrive without a car as we did. There is NO free internet service. The idea of any kind of service from staff is laughable. The shuttle to and from the airport was fine and the driver pleasant.", "Date": "December 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Miami, Fl", "Title": "“I truely bad experience”", "Author": "fmca95758", "ReviewID": "UR23021194", "Content": "I stayed in this hotel the night of the 17th to the 18th of December 2008. Breakfast was at 08:00, actually the latest I have ever encountered. Check out time was at 11:00, the earliest I have ever encountered. Due to the rush I forgot my toilettry bag worth at about 250.00 dollars. They tell me they did not find it???? A total lost. Wow, this is something.", "Date": "December 26, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Brazil", "Title": "“Worst Service Imaginable”", "Author": "1_Weary_Traveller", "ReviewID": "UR22886379", "Content": "We had the misfortune of a broken shower faucet in what was an otherwise reasonable room. After 3 hours of pleading with the front desk to either move to a room that had a working shower or even just use the shower in a vacant room, all to no avail, the front desk clerk came up to see if he could address the problem personally. At this point the owner/manager discovered that the clerk had left his desk for a considerable amount of time (there is a video camera on the front desk for security purposes) and rang to reprimand the clerk. This brought on a bitter and profane dispute between the clerk and the owner/manager. We checked out immediately to find another, better hotel.", "Date": "December 21, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Chicago, IL", "Title": "“Worst. Hotel. Ever.”", "Author": "Melimeli60610", "ReviewID": "UR22790321", "Content": "First, I tried to book this hotel online (after having been gulled by what seemed to be a reasonable description on their website). The reservation didn't go through, so I called them directly; the fellow at the front desk actually got into an argument with me about how the rate was only available online and since I called in person I would have to pay more; after a little bickering he gave me the cheaper rate. That should have been my sign to go elsewhere, because when I finally got to this place (after having to drive round and round through some seriously dodgy neighborhoods to get there in horrible Miami rush hour traffic) it reeked of smoke from the restaurant/nightclub just off the lobby. The building was filthy, the patrons were constantly in and out of the rooms, slamming doors at all hours of the night, and honestly saran wrap would have been more soundproof than the windows in the room. Then, when I finally checked out and fled the premises on the first shuttle to the airport at 5am, the parking lot was full of working girls and their special friends who were just leaving the still-busy nightclub. (That explained the constant traffic and door slamming in the hallway.) The front desk staff was pleasant enough, the room was clean enough, and the bed was comfortable and bedbug free (I checked), but the incessant noise and sense of danger kept me from getting more than about 45 minutes of sleep all night (in spite of the furniture that i piled in front of the door). Do yourself a favor and spend the extra $50/night to stay at a better hotel in a safer neighborhood.", "Date": "December 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Toronto", "Title": "“Beware CREDIT CARD FRAUD!”", "Author": "donot", "ReviewID": "UR22102348", "Content": "I stayed here in Dec/07 so this review might seem rather late, but I just have to add my comments after reading the review posted here Aug 4, 2008. My daughter's family, who lives in another city, and I met up and stayed here before a cruise. We had 2 separate rooms and we each paid with our own credit cards. Other than the cruise ship, this is the only business we had in common where we both used our own credit cards. Lo and behold, about 6 months later we both had unauthorized charges on our credit cards. The fraudulent charges on both cards all originated from the same Miami area district and all occurred around the same time. We informed the credit card company of this coincidence, but based on the other reviewer's recent experience it appears that using your credit card here is still very risky. As far as the hotel itself, this place is cheap and you get what you pay for, nothing fancy but clean. It's ok if you just need to get some sleep overnight pre-cruise. The shuttle service from the airport and to port was good. The food at the restaurant was awful, but there's nothing else nearby if you don't have a car.", "Date": "November 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Toronto", "Title": "“It was actually okay”", "Author": "lovetotravel0202", "ReviewID": "UR21079340", "Content": "Overall we thought this would have been a bad hotel, but when we got there we were surprised. The room is not spectacular but it does serve your purpose if you are staying for a few nights. The Wifi connection in the room is really fast and the TV channels come through clear. The bed is comfortable, we felt safe in the room. The gym downstairs does not have any working equipment but that does not really matter, you could get up early and go for a brisk walk. There is not much amenities around the hotel. The hotel does offer a shuttle to the port, so if you are going on a cruise this is really helpful. The shuttle is not 100% free the driver does charge $2, which really is not bad at all. One last thing the water pressure in the room was not as a strong and at times we did not get hot water. Overall we would stay again, but only for a few days.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“Well, Let's Just Get High/ Unacceptable!!!!!!!!!!!”", "Author": "bjtabree", "ReviewID": "UR19795103", "Content": "Well let's just say that the negative reviews were right on the money. Not only is the service questionable, hotel near run down, and not the cleanest, they had patrons in the hotel rooms SMOKING MARIJUANA. When I brought this to the attention of the front desk clerk/manager or whatever, he said \"I know, I've been smelling it to but there's nothing I can do about it. Maybe he was , i'll digress. These people would not even go investigate which room or rooms it was coming from and when I mentioned the police he says \"well they are corrupt and they won't do anything about it either\". Now come on; it really peed me off too because 20 of our family was staying here and some were older and I had my 4 year old daughter. You can see the hotel from the express way coming in and it looks like a no man's land with wood bearing and weeds. The picture on the website is very misleading. At least the pool felt good. I've used two different Days Inn properties, twice in Florida in the last 5 years and even subscribed to them through email because of there low prices BUT THIS IS RIDICULOUS. The first time was not the greatest and this time was totally UNACCEPTABLE even if we were only there for 2 days prior to a cruise. I HAVE UNSUBSCRIBED TO DAYS INN AND WILL NO LONGER RECOMMEND OR PATRONAGE. Never Ever Again", "Date": "September 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Western US", "Title": "“Book with Caution”", "Author": "easygoingwesternUS", "ReviewID": "UR18623976", "Content": "We stayed at this hotel on two separate one night bookings; beginning and end of a trip. The airport shuttle left much to be desired, the room was adequate, the restaurant mediocre; front desk service very lax. We used a separate credit card each time; six months later both those credit card numbers were being used for unauthorized purchases in the Miami area. Yet we had not lost our cards. The only 'common' transaction on each card was this hotel. Please be careful with your credit card number when you stay at this hotel.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Springfield", "Title": "“hated it!”", "Author": "deedeelee", "ReviewID": "UR16907579", "Content": "Unless you are desperate to save a dollar, do not stay here! We stayed the night before a cruise. They had a courtesy shuttle to the port, but the driver charged us a $2 per person \"luggage handling fee\". The place is run down. They advertise a fitness room, but 3 out of the 5 machines were broken and it was filthy! Also, there is NOTHING around there. Although I have to say; the shuttle picked us up promptly at the airport, and the front desk people were very nice to us. But it really kind of grossed me out!", "Date": "June 13, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "oklahoma", "Title": "“Left Me stranded”", "Author": "pastordelight", "ReviewID": "UR16192522", "Content": "I had a confirmed reservation that i had made three weeks prior to leaving Ok when arrived at airport and called for shuttle they told me that my reservation was cancled!! Three weeks and they couldnt even send me an emai...maybe they gave my room away since our flight did not come in until 10:30pm? I will never trust a Days Inn to honor their reservations...BEWARE!!! We did eventually find another hotel but it cost us twice as much as we had budgeted...", "Date": "May 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Montreal", "Title": "“Do Not Go There”", "Author": "swmboMontreal", "ReviewID": "UR15197412", "Content": "My elderly parents stayed there prior to taking a cruise. They don't have internet so they phoned in their reservation to the call center. When they arrived at the hotel, they were told they were a day late and were charged a no-show fee. The hotel staff provided no help and would not refund their credit card. They wrote to the head office complaining about the mistake. The head office's reply was that my parents had made a mistake on the internet reservation - they don't have internet, don't know how to use it and as mentioned above, booked via the call center. After checking other sites, it turns out the Days Inn in general rip off their customers by not honouring their cancellation policies or in this case, committed complete fraud on a pair of seniors. NEVER EVER BOOK DAYS INN - especially in Miami.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Horrible Experience!”", "Author": "freetobeme2008", "ReviewID": "UR15093543", "Content": "If you value your life and your hard earned money, you will stay at another hotel! This place is thoroughly disgusting, and the staff are unaccomodating. To avoid a horrible experience, DO NOT CONSIDER THIS HOTEL, STAY AT ANOTHER AIRPORT PROPERTY. This place should be shut down, and condemned.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Tampa, Florida", "Title": "“Hated this dump”", "Author": "n756tk", "ReviewID": "UR14817178", "Content": "1st of all, don't call the hotel for a price, go to the Days Inn web site. And the best thing about the hotel is that the reservation department told me to do this as it was cheaper then calling the hotel directly. The other good news is that they have a shuttle. The hotel is a dump. They also charged for a safe even when you do not use it. We were there 7 hours waiting for our connecting flight. They added $2.14 for the safe. Wierd. Why don't they be honest and just adjust the price up front. The rooms were old and musty. We will never go back.", "Date": "April 5, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Location": "1", "Service": "1"}, "AuthorLocation": "Tampa, Florida", "Title": "“All-Time Worst Hotel Ever!!!”", "Author": "gooooogirl", "ReviewID": "UR14798929", "Content": "I am embarrased to say that I ever stayed here. Funny, I actually stayed at this hotel in 1996 and it sounds like it never changed. I remember this place because it was the WORST STAY I EVER HAD. The front desk was horribly rude, but it was late and we were going to check out early the next morning. When we checked in there was an armed guard sitting outside the front office that you had to be buzzed into enter. We were given the wrong room and card key and walked in on a couple of people sleeping. When we finally got to our room, it smelled horrible, like stale cigarettes, it looked like somebody had been sitting on the bed and they had left there pakage of Marlboro Reds on the bed. The walls wer e so filthy that they had sticky gunk running down them. We tried to get a pizza delivered, but nobody would deliver there. It smelled so bad, I told my husband just shut off the light and lets go to sleep so it will be over soon. I was too tired to check out. Halfway through the night, I couldn't take the smell...under the bed we discovered a DIRTY DIAPER. Disgusting! When we checked out, within a few hours of checking in; the front desk was disinterested in our complaints.", "Date": "April 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“A $170 Motel 6”", "Author": "Fall_Line", "ReviewID": "UR13403125", "Content": "This property has clearly surveyed the Miami hospitality market and concluded that they can charge $170 for the level of service that one would expect in a $70 hotel. The airport shuttle is very problematic. We waited an hour, despite calling three times. I warned others in my group who were arriving later, and their experience was even worse. One waited and hour and a half, then finally cancelled her reservation and booked another hotel. My other friend called several times and after an hour was told the shuttle had stopped running and she had to get a cab (the hotel did reimburse her cab fare, however). The lobby area is musty and dingy and there was only one functional ice machine in the entire hotel-- and the ice had flecks of dirt embedded in it. The hotel also charges $6.50 for breakfast and $2.00 for coffee, which I found quite irksome, as most hotels in this class include breakfast (and charge less per room). On the upside: the sheets were clean, the room was pretty quiet despite being next to the highway (and a Saturday night), and the shower pressure was good. I actually got a fairly decent night's sleep. The shuttle to the port was also fine-- it got a bit of a late start but we got there in plenty of time. (They used a larger shuttle bus with a trailer, in contrast to the single van they use for the airport shuttle)", "Date": "February 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Monte-Carlo, Monaco", "Title": "“1980's Hotel, Not Friendly Staff”", "Author": "mahme", "ReviewID": "UR13392725", "Content": "Upon check-in, the reception lady was rather rude. I asked for a wake up call the next morning which was never made. Apart from that, I did not expect too much from this hotel. Given the price and the fact that it is a Days Inn. However, it seems this is one of the worse Days Inns. Room felt old. The reception made me feel like I was oin 1978 or something..", "Date": "February 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Charleston, SC", "Title": "“Beware- they don't honor reservations, even if prepaid”", "Author": "Charleston_SCSam333", "ReviewID": "UR13176310", "Content": "We reserved rooms at this hotel for two different nights, before and after a trip to South America. Rooms were prepaid in advance through yahoo travel. The first night, staff was extremely grumpy and every single piece of equipment in the exercise room was broken. Otherwise, the stay was uneventful. The second night was a DISASTER. We arrived at the airport at 12:45 at night, called the guaranteed shuttle for about 10 minutes, then gave up and paid $16 for a cab. When we got to the hotel, the man denied that we had ever called for the shuttle. THEN he informed us that \"we\" had cancelled the reservation at 6pm (note that we were on an international flight at that time), and they had no rooms available for us. He saw the reservation in the computer, complete with note that we would be arriving late, but would not acknowledge that they had done anything wrong by cancelling our PREPAID reservation. So at 2:00 am we had to find another hotel room. I will be contacting Days Inn management about this as it was by far the worst Days Inn I have ever stayed at. Also, I need to get my money back somehow. If anyone is considering staying at this hotel, I STRONGLY recommend that they look elsewhere.", "Date": "February 1, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Ottawa", "Title": "“Only the price was good”", "Author": "lhache", "ReviewID": "UR12585036", "Content": "They charge a fee of 2$ for safe in room, yet ours was not working each of the 4 days we were there they promised to 'send someone'. The staff was polite but useless. There were minute ants all over the room, except in the beds. The room was poorly cleaned before we arrived, the mirror was dirty with someone else's toothpaste spit, the floors were grimy, and the carpets only vaccumed once during our stay. The sink was cleaned once, and the tub once on a different day. On the plus side, our sheets were changed nearly everyday, but when we returned to our room early afternoon, were told the stripped bed wouldn't be dressed for 3 hours, as they did that first, then cleaned the rooms one by one, not dressing until later.So much for a nap! The elevators are weirdly placed. You enter, pass the lobby, walk the entire length of the hotel, take the elevator.It was faster to climb the 3 flights. The exercise room is a glass box by the pool, barely fits the few cardio machines. Constantly vendors push fliers under the door, even VERY late at night. Also, parking for hotel guests is not important, as afternoons the entire parking lot is 'valet parking' for the Bar,except the furthest slots from the door.The surly 'valet' is rude and treated us as if we were cheating him out of some money by taking a spot. The hotel is easy to find off the Dolphin Expressway, and sleeping near an airport was no problem noise-wise.", "Date": "January 13, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Manitoba", "Title": "“Ok for the price but not ideal”", "Author": "smcnewf", "ReviewID": "UR12476268", "Content": "We stayed at this hotel because it was close to the airport with a free shuttle. We stayed here for 2 nights after our cruise docked. The hotel was dark, old decor, and a little dirty. The room however was much nicer and better maintained than other common areas of hotel. The pool was large and seemed nice although we did not go in. Hotel is located next to airport with GREAT shopping and eating within 10 minute drive. The Shuttle was Great to the airport. Overall not a great place for the family but ok if you only want a quick place to sleep while catching a ship or plane.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Arkansas", "Title": "“Not the cleanest but friendly staff”", "Author": "arkansasmomof2boys", "ReviewID": "UR11993542", "Content": "Front desk staff very nice. We stayed 1 night and left for a cruise the next day. Use the hotel shuttle if going to port - $20 charge. We took a taxi and it cost $32. Our room was on 3rd floor. Hallways were very dim with lighting. The hotel needs updated. Bed was soft but covers smelled musty. Bathroom was dirty. Dried urine was on bottom of commode and hair was underneath lavatory. Ceiling in bathroom was cracked and tiles along bathtub/floor were cracked. Check in and check out was speedy.", "Date": "December 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Vancouver", "Title": "“Fairly ugly for the money but fairly clean.”", "Author": "Trip_0ut", "ReviewID": "UR10909581", "Content": "Staff seem OK, They say closest hotel to the airport, well I guess it is physically very close but a bit of a drive from the gate. Very old motel. disco in the ground floor, freeway on other side. My wife not very happy with the area we were in. Wireless worked in the lobby, way to slow and very poor connection on 3rd floor.", "Date": "November 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "california", "Title": "“Good place to stay for the night”", "Author": "MrsVerloop", "ReviewID": "UR10598437", "Content": "My husband and I chose this hotel because of its location, and complimentary airport shuttle. I have to admit that after reading reviews on this website, I was a little worried. However when we arrived at the airport at 9:00 p.m. we called for a shuttle, within 15 minutes it arrived. The shuttle driver could have been a little friendlier, but got us to the hotel safe and sound. When we arrived at the hotel, we were checked in quickly. Our room, though no suite, was clean and comfortable. Since we had spent the entire day on flights, we were starved and ordered room service. Once again the service could have been a little friendlier, but the food was good, not great but good. We had no complaints in regards to noise, we slept like logs. Overall, I can say that I would recommend the hotel to anyone who just needs a place to stay for the night.", "Date": "November 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St Martin", "Title": "“Good value for money”", "Author": "JMPStMartin", "ReviewID": "UR10542636", "Content": "I can highly recommend this hotel. Affordable does not necessarily mean nasty and this hotel is proof thereof. Value for money we got: the public areas are clean and well kept, the rooms lovely with great beds and linnen. Although slightly noisy due to it's proximity to major roads and the airport - the conveniece of it's location makes up for it.", "Date": "November 2, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Trinidad & Tobago", "Title": "“Comfortable”", "Author": "dlion", "ReviewID": "UR10177888", "Content": "This hotel is not the Hilton, but it is affordable, clean, comfortable, quiet, out of the traffic, and roomy. Free wireless net. Easy access to main roads and expressways. The on-site resturant's food was tasty - steaks and mexican. I stayed 8 days on business, and did not have any problems. The staff was helpfull. Room houskeeping was excellent. I am from Trinidad & Tobago.", "Date": "October 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "ohio", "Title": "“Shuttle service bad for Airport and Cruise”", "Author": "jksturner", "ReviewID": "UR10039462", "Content": "We picked this hotel because the website stated they had airport shuttle service and shuttle service to our cruise. On reservations I even stated we would need these services. I called the hotel 5 times to request shuttle. Never came. Saw it pass us several times while we waited an 1 1/2 hours outside airport. Hotel clerk even hung up on my husband last time we called. We had to finally flag a taxi down. When we got to hotel, 2 shuttle vans sat at the front of hotel empty. When we checked in we were told we would recieve a call at 9 in the morning to set up shuttle service to cruise. No call came. When I went to the desk to ask about it they stated they had booked me on the first shuttle and told me to be in lobby at 11:30. I was there at 11:15, but we were then told we would be on 2nd shuttle at 1:00!! While I waited in lobby there were several other guest I had spoken to that had same experiences with airport shuttle. Plus hotel shuttle states it is free. It is not there is a $2 per bag charge and you will not leave hotel until that is paid to driver. Rooms were clean and nice. Hotel reminded me of a bar everywhere else. Restaurant was closed when we went for breakfast, was told they can close whenever they want not owned by hotel. Desk clerks at night are not friendly. Also make sure you have comfirmation sheet. Desk clerk wanted to charge us a higher price at check in. When I told him this wasn't right he told me \"Prove it\" Thank goodness I had my comfirmation email. Would not recommend.", "Date": "October 4, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Cleveland", "Title": "“Ok if you just need a place to sleep”", "Author": "laura790", "ReviewID": "UR8511285", "Content": "The hotel was tired, although overall was clean. Some of the building could use some fixing up. They have a pool, but we didn't try to use it. Shower had great pressure & warm water. We stayed here overnight between coming back from Peru and getting back to Ohio. The restaurant was quite dark inside and dated; we decided to go out instead. Airport van was pretty timely.", "Date": "August 26, 2007"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "michigan", "Title": "“TERRIBLE EXPERIENCE”", "Author": "giardinismom", "ReviewID": "UR7967919", "Content": "What a horrid experience! I was taking my three kids (alone ) on a cruise.. We were arriving in Miami at 12:30AM.. I called the Days Inn that I had found via kayak.com and called them. It took a few tries to get through. Finally, I talked to a call there (Yvonne) and got my reservation all set; gave her my credit card number.. She said \"hold on for a confirmation\". I did. We were cut off. It took about 20 tries to get back to her and when I did she apologized and said sorry, the computers were down. I'll reduce your room rate to 79$ and here's a confirmation number. I said wonderful .... I also had checked to be sure that he shuttles ran past midnight as we were coming in late. She assured me they ran until 2am. Perfect. So I thought. Of course, arrived in Miami from Detroit. Tired kids. We're ready to sleep. Called the Days Inn to catch the shuttle. \"We don't have a room for you\". The manager couldn't give a rip that we were stuck there. He said a meaningless sorry and refused to give me his last name. I asked him to find me another room - he found another hotel at double the rate and he wanted me off the phone. I was stuck so took the room. The other hotel was just as bad in terms of comfort, breakfast (they threw in a free breakfast -- but you can't have th bacon, eggs, etc unless you want to pay 10$. what a crack up)..... The pillows were 1/2 inch thick... Relatively minor things... But the Days Inn was flat out rude. I filed a complaint upon returning home. No one cares much. The GM finally emailed and said \"too bad, you didn't tell us it was a late arrival\". Not a very nice tone. I do NOT understand how places like this stay open. Avoid this place if you can..... Now I have to laugh at it - my kids say Miami is the worst place they've ever been to... Oh well!!", "Date": "June 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "wintersville, oh", "Title": "“never again”", "Author": "jvnorth", "ReviewID": "UR7847451", "Content": "One night in this hotel makes me want to cancel my vacation and never return to Miami ever again. First of all, the appearance was outdated and wasn't as clean as I would have liked. One ice machine on the first floor. The shuttle was fast to pick us up, but the seatbelts didn't work. All night long airplanes flew by and could be easily heard. Interior and exterior walls were thin and you could hear \"ALL\" activities in nearby rooms. Nobody was fluent in english so it was hard to communicate. There were paper flyers passed out under the doors for a local pizza shop, we ordered and it wasn't edible. We called to get a refund and was hasseled about it. Continental breakfast consisted of one drink and one bagel, muffin, or danish for a whopping $6.50. Never stay at Days Inn MIA!!!!!!!!!!!", "Date": "June 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Seattle", "Title": "“This place is a dump, rip off and in a bad part of town.”", "Author": "Hutt", "ReviewID": "UR7281753", "Content": "This place is a dump, rip off and in a bad part of town. It's the worst Days Inn I've ever seen. I booked one night stay in this hotel because we had an early morning flight out of MIA. They gave us a room right next to the overpass (which is cut out of the photos online). When I complained to the front desk and asked for another room the man was very confrontational and scary. We left the hotel immediatly without staying there. I am still waiting for Days Inn to refund my money, they have a no cancelation policy even if you are not satisfied! Stay at the Hampton Inn on NW 57th Ave. For just another fifty dollars, you will get a clean room, breakfast, secured parking and great customer service!", "Date": "April 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "chicago", "Title": "“never again”", "Author": "ram110197", "ReviewID": "UR7251863", "Content": "One of the worst places I have stayed in recent years. The staff was mostly rude and unresponsive. There was no power for the tv, fridge, microwave for the first night. They are supposed to have a business center and wifi access. Neither exist. I expect when I stay at any hotel, there will be at least coffee in the morning. Only one out of three days was there. While the food at the attached restaurant was ok, the staff there was as bad as at the front desk.", "Date": "March 30, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London", "Title": "“Not totally bad, for overnight stay...”", "Author": "Englishman0123", "ReviewID": "UR7209367", "Content": "I definetely concur with those people who tell tales of not getting to the hotel with ease. I waited and waited at the airport (having come off a flight from south america and feeling very tired)....... then i called, i couldnt get through.......so i called through to \"sales\" and then reluctantly someone said they were sending a bus out to the airport. Fastforward one hour and at last it had arrived.... Having read all the reviews the day before i had anticipated all this but i was still mythed that i had to suffer the same. When i go there at last my heart was filled with even more fear when i saw what a dump it first appeared. I could only get through the fear with self consolation that this was only a stop over and after one night, however bad the experience i would be free soon!!!! HOWEVER, to my SUPRISE my room on the 3rd floor was clean, spacious and fine. Yes, its near the highway but this IS an airport hotel and i didnt find the noise intolerable (the overhead flight noise i only heard once the next morning), for one night at least. I then went down to the bar and found it ok and got a reasonable price burger. Bathroom is fine and bed was fine too. When i left the next day, i did cast my eye over the ground floor rooms and feel i was lucky not to have had one of them. All in all the service here is poor, the people not interested and the experience likely to be frustrating. However, as an airport hotel it serves its purpose if you get a cheap deal on it.", "Date": "March 23, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York State", "Title": "“A DUMP!!!”", "Author": "HappyTravelerNYS", "ReviewID": "UR7154242", "Content": "We are trying to get a refund-hotel billed as newly renovated. Not True-watch for bugs. Moldly, mildew smells. Dirty bedspread. Carpets had burn marks and holes, Worse place I have ever stayed. Management did not respond to complaints. Need I say more.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "NEBRASKA", "Title": "“Cruise lodging-helpful tips”", "Author": "OLEWISEONE", "ReviewID": "UR6819700", "Content": "We booked the hotel though our Travel Agent to stay at before and after our cruise. After finding this site I was scared to death to stay here, but I did find some of the info very helpful. I hope to pass some advise on to others. The hotel is not near as bad as some people have written, though it isn't great by any stretch of the imagination. We arrived to the Miami airport at 6:30 Saturday night and called the hotel for a pick-up they said it would be an 1 1/2 hours so we took a a cab/van. We had four people with a lot of luggage, so that was our best bet. The ride was $9.00 which was good price. As soon as you get to the hotel request that your name is put on the list for the cruise shuttle. There were many people taking a shuttle so the hotel hired a Greyhound bus. Our bus was scheduled to leave at 12:30 in the morning. Checkout is 11:00 but they will let you stay in the room longer. The hotel is on the airline takeoff path so request a room on the east side, it makes a world of difference. The beds are comfortable. Rooms could be a lot cleaner, a few bugs, but the staff was helpful. The hotel is not near any restaurants which is a problem, to take a taxi will will cost you around $20.00-$25.00 each way to go anywhere. We took a cab to Monte's Shrimp Bar in Coconut Grove and ate outside on the water (the weather was perfect) it was nice. The hotel does have a restaurant but it is is more of a lounge, the morning we left to catch our plane they had a party that didn't end until 5:00 in the morning. What ever you do don't get a room by the restaurant, you will hear music all night long. In the morning they serve a buffet breakfast for $7.50, or continental for $4.00. (cash only) It isn't great, but you don't have many options. They don't start serving until around 9:00 and they serve until it is gone, maybe 9:45. When we returned from the cruise we took a cab to the hotel and it was $26.00. That night we at at Joe's in South Beach, cab fare was $30.00 both ways. Be sure to sign up early for transportation to the airport and be down stairs waiting 15-20 early if you have an early flight. The shuttle starts running at 5:00a.m. and the van only takes as many people as he can hold. Over all the hotel wasn't bad. But if you can find a hotel closer to some restaurants it would be nice, because the cab fare is what is the killer.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Lied about airport shuttle availability; staff can't speak English”", "Author": "latenights", "ReviewID": "UR6705064", "Content": "This inn advertises that they have an airport shuttle. It's a lie. When we arrived, we were told the shuttle wasn't running because the driver had gone home. We had to take a cab to the hotel ($22) and were not reimbursed. The next morning the shuttle was running, once an hour. Every chair in the lobby was occupied, so we went outside. People were sprawled on every available space, so we had to stand. Luck for us we did! When the shuttle arrived, it was an 8-passenger van, and since we were standing, we were able to reach the shuttle before the others did, and we got in. The shuttle left about 15 people in the dust when it pulled out. I imagine most of them took cabs. The other irritating thing about this place is that no one speaks English. The front desk can answer questions in English, but usually they don't understand the question, so you get the kind of canned answer that you would get when talking to a computer over the phone. Our room was clean and neat; we have no complaints about that.", "Date": "January 27, 2007"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Seattle", "Title": "“Scetchy, loud, and worn”", "Author": "girlkayaker", "ReviewID": "UR6563322", "Content": "We only stayed 1 night before flying out early the next morning. Rooms were small, sheets were threadbare, bathroom was very small. Of course, being close to the airport, we could hear each airplane take off throughout the night. We did not take the shuttle so cannot comment on its' reliability. Staff were unhelpful. Overall...yuck at the price of $157!", "Date": "January 7, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Okay property for 1 night”", "Author": "dmlandis", "ReviewID": "UR6527867", "Content": "This was a fair property. We got in late at night and left at 11 am the next day. Service was lackadaisical and the room was fairly bare. Only enough coffee and towels for 1 (we were 3). There was a pool and workout room. Perhaps Days Inn North Airport is a better property. One nice thing though is that this property is very convenient to Hwy 836 and airport.", "Date": "December 31, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Okay”", "Author": "twilsonb", "ReviewID": "UR6031837", "Content": "Stayed at the Days Inn Miami Airport in October 2006 for one (1) night before leaving on a cruise. Stayed here on advice of a travel agent/friend (who stated at a much nicer hotel). I suppose the advice was for convenience and price. It was convenient to the airport, just a few minutes. The price was right at $89 per night and free shuttle from airport and free shuttle to your cruise pier. The pool was outdoors and was okay, I just could not muster the nerve to jump in due to location of hotel in Miami (saw a drug deal going down at corner convenient mart just before turning in here). The restaurant and club in the hotel were the best feature I saw. Breakfast was pricey for this caliber hotel, but good. Drinks were priced reasonable in the club the night before, but be warned, no English speaking patrons were in the house so I left early, I was outnumbered. The staff spoke broken English and basically were just no enthusiastic about their work, they were just putting in hours. The rooms were large but dark and cleanliness could have been improved (but not skanky). Shuttles were on time as promised from airport and to cruise pier. I might stay here again but ONLY for the convenience and price but would check in and go straight to my room with a snack and stay there until time to leave for cruise.", "Date": "October 30, 2006"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "St. Louis, MO", "Title": "“Worst Hotel Ever!!!!”", "Author": "RdWarr", "ReviewID": "UR5781729", "Content": "This place is smelly, the beds uncomfortable, and way too much noise!!!!! Entirely the worst experience I have ever had in a hotel. The only thing about it is it is cheap for Miami and if you are stranded at the Airport overnight without a lot of cash available it will at least do, but that is all I can say for it.", "Date": "September 8, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Oulu", "Title": "“Avoid, avoid....”", "Author": "Tintti", "ReviewID": "UR5490733", "Content": "This hotel was so bad as a hotel can get! Stayed there for one night between flights and there was one too many. As the several other reviewers, we waited for the shuttle to come and pick us from the airport for over an hour, all the other hotel's shuttles passed by several times while we were waiting. After arriving to the hotel we were given a smokin room and as I went back and asked for a new one I was given a new room but again smoking! The reception personnel simply wasn't listening anything, two persons just gossiped their own matters and didn't even look at the customers. Finally, got a non-smoking room, which wasn't too good either. Dirty and outworn, smelled bad and the noice from highway just behind the window was unimaginable!! When we checked in I asked the receptionist how early should we arrive to the lobby in order to make it to the shuttle to get us to the airport in the morning. He told us to be there anytime we wanted and in ten minutes the shuttle would arrive. As we arrived in the morning to the lobby and checked out now the other receptionist (who was there at the same time with the evening shift while I was asking in the evening before) told us that the shuttle had already left and there would be no other until after an hour and thus we wouldn't make it to the flight! She didn't offer any help, didn't apologise, even insisted first that she didn't know the guy who was working there with her last evening!!! She was very very rude, and the most unbeliveable thing: while we were standing there the shuttle arrived from it's tour to the airport, but the driver refused to take us to the airport before the next \"shift\" (in an hour)!! The receptionist didn't make anything for this matter either - infact she took a personal phone call to her mother and started gossiping! We insisted for the taxi, which she (seemed to) order and which never arrived. After 20 minutes I ordered taxi again and thistaxi arrived in five minutes. We made it to the airport barely in time, paid 12 $ for taxi drive even though we selected this hotel partly because of free shuttle service. This seemed though a peanuts then as we were so glad to get out of this horrible hotel beside the horrible highway and run by most rude, non-english-speaking, non-smiling, non-helping and even non truth-telling personnel. We are not picky travellers, we often stay in hostels, budget hotels etc. However, these kind of hotels are not worth the saved bucks: they give you mammoth headaches and bad spirits and possibly a missed flight as an extra surprise. Do yourself a favor and avoid this hotel!", "Date": "July 20, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Canada", "Title": "“Stay away from this hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5379241", "Content": "I stayed at this hotel with a group of 10 students and 3 chaperones. It is the worst place we ever stayed at. The people at the front desk are rude and not helpful at all. The staff is very rude. They actually come in your room without knocking first and don't apologize when they see it is occupied. The rooms are okay, but the cleaning staff is very loud in the morning, forget about sleeping in. The worst part of our stay was the driver of the shuttle. He was the rudest staff member there. Since there were 14 of us, we had to go in 2 seperate groups. He was incredibly rude to the students. When we got to the airport, he gave the other passengers their luggage and yelled at the kids to get their own. Obviously, I didn't tip him. When he picked up the other group, he lied and told them that I said to leave him a tip. Do yourselves a favor, stay away from this place.", "Date": "June 24, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Colorado", "Title": "“Good for pre-cruise”", "Author": "A TripAdvisor Member", "ReviewID": "UR5038275", "Content": "We stayed at this hotel because we were going on a cruise out of Miami and needed somewhere to stay for the night. We chose this hotel because it was cheap (62.00 AFTER taxes...we got a good deal online) and also because it offered a free shuttle to the port. We flew in from Ft. Lauderdale, so we didn't use their shuttle service to get to the hotel. We just took a taxi. I actually didn't know they offered a shuttle from the airport. Maybe they only do from the Miami one, I'm not sure. So I can't really comment on their shuttle from the airport. But the shuttle to the port was on-time and went smoothly. If you're staying at this hotel for cruise reasons, it's a good hotel because of the free shuttle to the port. But if you're staying here because you're on vacation in Miami, I wouldn't suggest it. Miami airport is very close nearby and the planes flying overhead are very loud. The highway is also right behind it. Also, the walls are very thin and you can hear everything. Anytime someone closed their door or walked down the hall or even took a shower above you, we could hear it. This didn't bother us, because again, we were only there for a room for the night before our real trip. But it might have bothered us if we were staying there a few days. The hotel does have a bit of a musty smell, and if you get a room on the side that the parking lot is on, you can hear the cars and valet people all night. Course, if you're on the other side, you will be by the highway, and I'm not sure if that would be just as noisey. The room itself was clean, and the king bed was very comfortable. They have a restaurant downstairs. The food was good (we're not too picky when it comes to food, some people might not like it), but it was expensive. We got burgers and fries and it was 9 bucks! They also have a pool, but we didn't go in it. It looked clean though. The staff was nice. The guy at the counter was very friendly. And when we took the shuttle the next day to the airport, our driver was very nice and gave us lots of nice tips for our cruise. One tip about the shuttle to the port: Most cruises let you board their ships at noon. So make sure you get down to the lobby early so that you can board your cruise early. We got down to the lobby at 10:30 for the 11:00 shuttle, and there were already 10 other people there. It was a good thing we already had reservations! If you tell them you want to take the shuttle right when you check in, they will put your name down so you are guaranteed a spot in the morning (as long as you're there on-time). But if you don't put your name down, and get there when 12 people have already put their name down, you have to wait for the next one. And I don't think they do it every hour. I think they have a shuttle at 11, and then the next at 3. But I'm not too sure on that either, it was just something I heard when I booked the room. But better to be safe then sorry, so put your name down right when you check-in. Hope this review helps!", "Date": "May 6, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Peoria IL", "Title": "“Horrible Hotel”", "Author": "tetons", "ReviewID": "UR5033369", "Content": "This hotel is dirty, run down, and the clerk at the counter tried to rip me off, my stay was prepaid over 6 weeks in advance by the travel agent, when I arrived at the hotel they had my reservation but said it was not paid for, well after arguing with the clerk for awhile, he said \"oh I do see where it has been paid for already\". The hallways are old and dark, the neighborhood is crummy, and I was scared to even walk the hallways, it had 1 restaurant with very OVER PRICED food. We had to wait 2 hours for the shuttle to pick us up for the cruise and there is not enough chairs or couches in this dumpy hotel for people to wait for the shuttle to the cruise ship. I will NEVER EVER STAY HERE AGAIN.", "Date": "May 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Rio de Janeiro-RJ, Brazil", "Title": "“1st and last time ever”", "Author": "Capt_Otero05", "ReviewID": "UR5025862", "Content": "I refer to the DAYS INN located at 11th St (there are two others nearby, from the same chain: one at Civic Center; each hotel has its own shuttle; the ones bound for Civic Center and the other one passed more than twice, while the one bound for 11th st has never shown up). The shuttle took almost 2 hours to pick me up. Along these almost two hours, I called the hotel using both the free phone and my own cell phone as well, and could only get messages from an extremely irritant call center. I recorded 5 or 6 urgent messages there. Never had any response for any of them. Finally, when I was about to give up and take a cab on my own, I gave it a last try. A sleepy voice answered and apologized, and said the shuttle would be on its way \"immediately\". 15 mins later it had not arrived at Concourse E of MIA Intl', so I called again. A 2nd voice (also a sleepy one) answered and said he did not know about the problem, apologized as well and said the shuttle would be \"on its way at once\". Total time waiting: 01:53 mins. It is quite a record for me, after 26 yrs working with the aviation industry. Apart from that, the ice machine in the corridor was inoperative, though the vending machine was delivering chilled soft drink cans. Rooms & bathrooms are reasonable. Overall, this is one of the few places I would never stay again in Miami.", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Puyallup, WA", "Title": "“Pre-Cruise Hotel”", "Author": "CyndiArm", "ReviewID": "UR4603844", "Content": "The only good thing about this hotel was the free shuttle to the cruise. Also, be aware that there are several Days Inn airport buses. We got on the wrong bus with another couple and then called our hotel and they sent the right bus to transport us. The hotel was filthy. The hallways looked like they had never been cleaned. The non-smoking room smelled like a smoking room. We were afraid to walk barefoot on the carpet. We will not stay there again.", "Date": "March 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "DeSoto, Missouri", "Title": "“Better than expected!”", "Author": "familyriders", "ReviewID": "UR4447676", "Content": "This hotel was better than expected. After reading the reviews we were a little worried about the hotel and the shuttle service. Both were great. We called when we arrived at the airport and were picked up about 20 minutes later. We were able to rent a nice convertible at the hotel for about the same price as the airport rental centers. This hotel is not near anything except the highway, so you do need a car if you are staying very long. The city was easy to get around but parking is hard to find. Our room was very large had a microwave and fridge in the room. The room was clean and check in was a breeze. We only stayed one night and returned the car and took the FREE hotel shuttle to the Port with no problems at all. Very nice for the money about $100 a night. As stated in other reviews make sure you pick the right Days Inn as there are many in the Miami area.", "Date": "February 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Brentwood, CA", "Title": "“Decent budget hotel w/Complimentary Port Shuttle!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4351636", "Content": "Decent for 1 night pre-cruise - which was exactly what we were looking for! Pro: fairly clean, free airport and port shuttles, good-sized room. We stayed Saturday, 10/08/2005, for a rate of appr. $60 through AAA. Probably saved another $50-100 by having the free shuttles as we had 6 people in our party / 2 rooms. Cons: very popular bar 'mystique' draws tons of crowds. We arrived near mid-night w/a toddler in the party and weren't quite sure where we were arriving ;) Breakfast is $7 buffet in the empty / dark bar definately not worth the money, although the service was impecible.", "Date": "January 13, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Durham, CT", "Title": "“Filthy”", "Author": "A TripAdvisor Member", "ReviewID": "UR4025038", "Content": "Had to stay while visiting my grandfather in Jackson Memorial Hospital. Although it was convenient and cheap, we couldn't stay another night. This hotel was one of the grossest I have stayed in. They put us in a smoking room - didn't really care, except you could tell that the room was never cleaned by the cigarette ashes on the floor and table. We were afraid to walk barefoot and didn't even shower there because you could tell that wasn't cleaned either! It was extremely noisy and even the restaurant was gross. The area does not feel safe, the hospital staff even told us to never go out at night. There are plenty of reasonable hotels downtown that are clean and safe. Avoid this one at all costs!", "Date": "October 15, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver, B.C.", "Title": "“Very accomodating and helpful!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3691031", "Content": "Me and my wife went on a caribbean cruise and we needed an affordable and convenient hotel for our overnight stay in Miami. We picked this hotel because it had decent tripadvisor reviews and because it offered shuttle services for the airport and seaport. We were very glad we did. Our baggage was lost during one of our connecting flights to Miami and the hotel manager, George, allowed us to use the airport shuttle as much as we wanted to clear up the mess. The rest of the staff was just as helpful and they would always ask if we had found our baggage yet. Anwyays, we eventually found our missing luggage and we couldn't have done it without the generosity of the manager and hotel staff. The rooms, although simple, were clean and tidy. Its not the fanciest hotel, but its definitely one of the best hotels we ever stayed at. Thank you Days Inn.", "Date": "July 21, 2005"}], "HotelInfo": {"Name": "Days Inn Miami International Airport", "HotelURL": "/ShowUserReviews-g34438-d85007-Reviews-Days_Inn_Miami_International_Airport-Miami_Florida.html", "Price": "$61 - $138*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">7250 NW 11th Street and 72nd Avenue</span>, <span class=\"extended-address\">EW Palmetto Expressway</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33126</span></span> </span> </span> </address>", "HotelID": "85007", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ed/04/ed04823ac268f411f073743446e375346large.jpg"}}