{"Reviews": [{"Content": "Good location but dirty and falling apart I stayed in this hotel 5 or 6 times back in the 90s when it was a Howard Johson, when it was well organised, clean and a nice place to be. I went back in 2006 when it was Port of Miami hotel, being independently run, and the place was a mess. Staff were unhelpful and rude, the rooms were in need of repair and maintenance, and the whole place was a mess!Our first room had a metal bar sticking out from the base of the bed which I cut my foot open on, and when I went to reception they offered me the first aid box and asked me to complete a report, then I had to ask for them to move me to another room. The next room that we were given had a 6 inch hole in the sink (faucet) so you could see the floor through it, and the shower tub had a bin bag of rubbish in it!! We moved rooms again to a room which was acceptable but quite dirty.Breakfast used to be great; a bit like an in-house waffle house where you could sit at the bar and watch food being cooked. Since the changes, there was a toaster with bagels, coffee and yoghurt. It was OK, but nothing great.The good thing about this hotel is the location; across from the AA stadium and 10 minutes walk to downtown and bayside. Parking behind the hotel feels reasonably secure.In the old days there used to be a falling-apart Miami-dade Police car 'parked' permanently outside the loby with 'K9 unit' painted onto the door panel - acting as a deterrant against thieves I suppose. This had now gone; it was a shame as it was quite nostalgic!! I never saw how it would scare any thieves off as it had been there for 5 years, but maybe it made the tourists feel safe!!", "Date": "May 18, 2007", "ReviewID": "UR547679205", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "4"}, "Author": "brian_lorraine"}, {"Content": "Worst Hotel Ever..but cheap and good location We stayed at this hotel last January (I should have written earlier). We stayed one night prior to our cruise.The Good:-cheap: for Miami this is a great deal, and if you are looking just for a place to crash the night before a cruise it will do-location: it is right across from the ship docks and the mall so an easy hop across the street-nice staff: the staff was generally ok..they don't speak a lot of English, but ah, that always makes things more intereting. Our request for towels (they had 2 measly towels for 3 guests) was met promptly.-the view: we were high up so we got a nice view of the harbourThe Bad:-broken elevator: one of their 2 elevators was out of service in the morning. You can imagine the hell it was trying to catch the elevator down when everyone else is leaving at the same time. We were near the top floor and had a 2 year old with us. We waited for over half an hour for an elevator (they were always full) then we decided to walk down 15 flights of stairs with all luggage..luckily a nice couple helped us-dirty: the rooms are pretty dirty. I did not really want to walk around barefootAll that being said, the place was pretty run down, but you get what you pay for. Would I stay here again..no..I'll pay the extra for a clean room and a working elevator", "Date": "Jan 4, 2007", "ReviewID": "UR343362446", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "legalbabe"}, {"Content": "Never Again Arrived about 7 P.M. Staff very rude. Had to change to a different room 1st on was dirty and had bugs. No food available. Very run down. Was not a good way to start a vacation.", "Date": "Jan 19, 2006", "ReviewID": "UR257443032", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "When HoJo dropped name service went down... We stayed previously at this hotel in Dec 2002 before a cruise when it was still called Howard Johnson Port of Miami. Than I would have rated it about a 3-4 star hotel. The service was good. When we went on our next cruise in March 2004 we figured we would stay there again for the 1 night as we enjoyed it last time and it is really close to the port. When Howard Johnson dropped its name the service went way down. Alot more things were broken in the suites and the sheets were barely even clean. Light bulbs were or missing, the toilet and sink barely worked and the air conditioner was broken. The staff at the hotel desk barely spoke/understood a word of english compared to before. I wouldn't recommend spending more than one or two nights there.", "Date": "Sep 28, 2005", "ReviewID": "UR658605146", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "HoJo's OK. The hotel facilities are a little run down, but it is reasonably priced and very convenient to the cruiseport. The staff was pleasant and helpful. It has what may be the worst continental breakfast in North America; but if breakfast isn't the most important meal of your day, it's ok to stay in the night before your cruise.", "Date": "Sep 14, 2004", "ReviewID": "UR366043857", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Carnivalcat"}, {"Content": "Idea for pr cruise stay Stayed 2 nights before and 1 night after a Caribbean Cruise,with my husband and son. Both rooms had 2 double beds and plenty of space/storage. Breakfast, included, was self service toast,cereal,coffee/tea/juice, OK to keep hunger 'at bay'. Probably would stay again when cruising as it's close to the port and transport is available - book the night before. Wouldn't recommend for a longer stay.", "Date": "Apr 17, 2004", "ReviewID": "UR610997893", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Awful, Just Awful! Prior to our cruise, we arrived at this hotel about 11:00 pm. The staff were very rude, not allowing us to use our AAA discount, even though it was clearly stated that they accepted AAA. From the moment we stepped off the elevator into the hallway to our room, the air was musty and smokey. The cleanliness of the room was unacceptable, and the room was small. There was a restaurant, but when my family was there it was not open. I definitely wouldn't recommend anyone staying at this particular location. The only positive thing was that it was close to our departure point for the cruise....that's it.", "Date": "Feb 9, 2004", "ReviewID": "UR787901515", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great pre-cruise location We have stayed here twice prior to a cruise. While the room is run down, the people couldnt have been nicer. Free breakfast is fine, small choice but just what you need to get your day started. Port transportation was fantastic. Nice air conditioned van, make sure you sign up the night before! Delivered us to the port before all the airline passengers so we had a stress free check in !!!", "Date": "Nov 3, 2003", "ReviewID": "UR478724583", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g34438-d85026-r7639158-Port_of_Miami_Hotel-Miami_Florida.html", "HotelID": "85026", "Price": "$95"}}