{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Not recommended.”", "Author": "Jetdoctor516", "ReviewID": "UR126537595", "Content": "First problem they have is the shuttle service. They have 2 busses and a van and they opt to use the van. Thanks to the Crown Plaza next door for letting us use their shuttle bus, as the Regency made people wait an hour because the van was full.The staff is very rude and they look at you almost feels like they are racial profiling. The rooms are not clean just look neat. The ironing board smelled like fried food. They have extension cords all over the place. As for the gym nothing works. Alot of false advertising here. Will not stay here again!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“An airport hotel oasis”", "Author": "two4coffee", "ReviewID": "UR126040604", "Content": "Extremely clean, strategically located and engaging staff makes the Regency a supervalue. Pay the extra few dollars for the Regency Club . rooms. Shuttle to the port of Miami very convenient .", "Date": "March 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Evening Staff Clueless, Pillow Smells of BO”", "Author": "MinnesotaTravelbug", "ReviewID": "UR125964898", "Content": "Upon arrival at airport we called the hotel who said the shuttle ran each half hour. After 35 minutes we called again, only to be told it was on it's way. 10 mins later it arrives full and told another was being sent, After another 30 min, we booked a taxi... the hotel is only 10 mins away!!! The check-in staff was clueless and didn't know about the breakfast/drinks which were to be included with the room charge. The pillows on the bed smelled of body odour from the previous guest(s). The door to the patio had clear evidence of a previous break-in. The room was dated. The positive was excellent hotel staff and shuttle driver during the next day. And the free breakfast was much better than many hotels.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Convenient, Corteous Staff, has everything you need and more”", "Author": "William d", "ReviewID": "UR125548888", "Content": "I've stayed in this hotel many times, but never wrote about it. I live in Orlando and go on business as well as pleasure. If I go on pleasure to take a cruise, they offer free shuttle to the airport and cruise port. Free shuttle for my wife to the malls and I go golfing. Very close to everything without the parking charges of Miami Beach Hotels. One of my favorite restaurants in Miami is La Carreta and there is one less then 5 miles away, The Versailles (also Cuban) right across the street from La Carreta. They have a very good restaurant on property to do your breakfast meetins before hitting local clients, excellent bar, very cozy, Staff is knowledgeable and very helpful. Bayside is a 10 minute drive, as is downtown. Excellent for vacation and business, a rare commodity, I never stay in any other hotel anymore, but the Regency by the Airport on LeJune. William", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Super Accommodating Staff”", "Author": "april b", "ReviewID": "UR124214365", "Content": "On a recent business trip I booked three rooms here based on the central location to everywhere we needed to go. I really appreciated the way Regency accommodated all of our needs! We arrived hungry and very late the first night and were still able to eat at the hotel restaurant. Over the next few days we also took advantage of the business center and the hotel bar. I found all of the staff to be attentive and gracious. We also used the shuttle back to airport which was very helpful as well.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, New York, United States", "Title": "“Recommended”", "Author": "Sadia A", "ReviewID": "UR124068643", "Content": "its a good location, very clean...and comfortable. Room was perfect and comfortable. I would recommend to stay if you have a short stay. Staff was friendly and helpful.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dominica", "Title": "“very good location and service”", "Author": "frequenttravelelr", "ReviewID": "UR123848729", "Content": "I got a good price at expedia website which is about 20% less than the rate at the hotel website. The hotel itself is very good. The airport shuttle is punctual and the driver friendly. Staff at the hotel are very good. Room and bath are quite good too.If they offered complimentary breakfast, this would have been an excellent choice but there are a number of good restaurents close by, so not a big geal.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Suffern NY", "Title": "“OK for a one night stay”", "Author": "PinaColadaLover", "ReviewID": "UR123845805", "Content": "We were put up at the Airport Regency Hotel in Miami by American Airlines when a mechanical delay caused us to miss a connecting flight. We had to wait over 30 minutes for the hotel shuttle, but once we got there, the hotel was clean and updated, and the bed was comfortable. Front desk staff were pleasant, and they accommodated our request for a fridge in the room. They did not ask for a credit card from us, which was nice. The return shuttle in the morning got us back to the airport on time.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "orlando", "Title": "“Perfect 4 A One-Nighter”", "Author": "sooperboy", "ReviewID": "UR123516440", "Content": "Spent the night in Miami for a wedding and the Regency Hotel was featured on the 'Hotel Tonight' app which opens unsold rooms highly discounted. Here are my thoughts. If you are a hotel snob. The Regency Hotel is NOT for you, but if you can lower your standards you may find a deal. The Cons: The Check-in staff is not friendly and very difficult to understand and I AM bi-lingual! The bathrooms needs updating. (cosmetic) The Pros: Very Quiet spacious rooms and comfy beds. Clean bathrooms though dated. Free Parking & Wi-fi Conveniently located to many dining options and directly off the Dolphin Express Way. Cannot review the restaurant or bar since I did not visit either. Remember, the goal was just to sleep and it met those needs at a great deal. Final Thought: When you pull in the parking lot does look a bit ghetto since you must pass what I imagine was a guard's station. They should consider removing this.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Attitude, attitude attitude”", "Author": "Will0ldham", "ReviewID": "UR123236668", "Content": "The attitude of all the staff was disgraceful. Maybe it is just the Miami thing but that is not an excuse. The receptionist was rude and refused to check us in before 3pm, we sat in the lobby for 2 hours until i saw him start to check people in 45 mins early, he did not bother to inform any of us in the lobby we could then start to check in early... The rooms were clean and tidy...as expected. In the morning my friends kept getting woken up by phone calls form the cleaners, and knocks on the door form 7:30am trying to get them to leave the room so they could clean it, despite check out being 11am. Eventually they called reception but did i not get any help. The cleaner when they saw her just gave them attitude...", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "easton", "Title": "“Location, Location, Location”", "Author": "Deb P", "ReviewID": "UR123096578", "Content": "A bit of a sleeper, but a clean, charming and well run hotel in the heart of Miami. Free wifi and shuttel service a plus. Great stopping point for an onward journey abroad, by plane or ship.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“What a surprise!”", "Author": "Joyce B", "ReviewID": "UR123075762", "Content": "Having missed a flight at MIA, an American Airlines employee suggested the Regency Hotel a few minutes from the airport. She stated it was very afforable but not to expect much. Not so. A grand lobby and a comforting staff made my brief stay enjoyable. A decent restauraunt and a surprsingly upscale gift shop made all the difference. The reto Pan Am line the shop carried was really unique. Rooms not elaborate, but clean and well equiped. Wifi excellent. Highly recommended.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sacramento, CA", "Title": "“This place is a dump!”", "Author": "Ariktravel", "ReviewID": "UR122740415", "Content": "The ONLY reason I was stuck staying was due to a 12 hour delay on American Airlines. I arrived into MIA at 2am and apparently this was the only place with rooms. I could not beleive American Airlines put a full fare first class passenger at this dump. The front desk staff were VERY rude. The rooms are built from the 60s. The bed did not have blankets or comforter--just one thin sheet. The in room phone was from another hotel and had a different room number on it. Overall, dirty hotel that needs to be demolished.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2"}, "AuthorLocation": "Sunnyvale", "Title": "“would NOT stay - stayed before cruise during 12/25/2011”", "Author": "stkmgr", "ReviewID": "UR122415956", "Content": "We stayed here for one night before we heading to 7 day cruise. My initial feeling is I chose wrong hotel for my purpose: for the quality of room, facilities, they charging very high. Rooms are small, and A/C is making horrible sound (in addition to some other machine in hotel compound making huge noise entire night). No free breakfast (need to pay). Good thing is: they provide a free shuttle to cruise port. For more details http://stkmgr.blogspot.com/", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ely, Minnesota", "Title": "“Regency Hotel - comfortable, friendly and nice rooms”", "Author": "icanoewenonah", "ReviewID": "UR121968212", "Content": "The first time we were going to visit Miami we chose this hotel because it was the only one, near the airport, that offered a 24 hour shuttle service. We could have rented a taxi but would rather have a shuttle. The shuttle drivers are all very courteous, our favorite is Mario who is a dear and we share our stories of both living in Chicago in the past. The rooms are very nice, a little bit older but kept up nicely. The hotel is called a \"boutique style\". I don't know what that means but it is very well decorated inside (sort of 50's style) and has a nice courtyard/pool area with restful music playing in the background. I believe that most of the rooms on the outside, have a patio sliding door and a small veranda. (ours did) They have a bar & a restaurant in the hotel. We have gone to the bar, very nice bartender there. We haven't gone to the restaurant, we use the Latin Cafe just across the street since it is one of our favorites. Another nice thing about the location is that if you want to go to a movie, there is a movie theatre at the end of the block, located in a small outdoor mall kind of area with just a couple stores.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Would Stay Again !!!!”", "Author": "ReadytoGoNyc", "ReviewID": "UR121891455", "Content": "The staff has very pleasant; especially, GEORGE. He was very helpful. He suggested we eat at \"The Latin\". It was delicious.The hotel and rooms were very clean and up to date. Would defiantely stay again !!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Stay here!!”", "Author": "Heidi B", "ReviewID": "UR121643078", "Content": "We stayed at the Regency Miami Airport last night. The front desk staff was efficient and very helpful. They have bell service which come in very handy specially when you have children. The room and bathroom were very clean and in excellent condition. We had a comfortable night and breakfast in the morning was also excellent. There was a nice variety of fruit, breads, muffins plus eggs, harsh browns and ham, coffee etc. Would definitely stay here again!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Apopka, FL", "Title": "“Nice Place - Great Stay”", "Author": "Smokereader", "ReviewID": "UR121283067", "Content": "Found this hotel after having a bad experience at another hotel in the area. Hotel was very clean and has up to date furnishings. Treated very nice upon check in and at check out. Room was nice. Better that what I expected.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Friendly Enviroment”", "Author": "Millie23_11", "ReviewID": "UR120893464", "Content": "Once again i visited the Regency and the service was wonderful! I can't get enough of the attention to detail that was given to me. Jose is very knowledgeable and caring. I will almost always stay at this hotel. They go above and beyond to please it's guests. Thank you very much!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Coventry, Rhode Island", "Title": "“pre cruise”", "Author": "donna m", "ReviewID": "UR120868634", "Content": "very nice hotel the lobby is modern and chic great feel. the rooms are adequate clean and warm. the staff is wonderfua nd helpful. I would definately book for any clients looking for hotel close to airport cruiseport and nightlife is a short hop away!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "White Rock, Canada", "Title": "“Excellent hotel, wonderful staff!”", "Author": "laura W", "ReviewID": "UR120620020", "Content": "I visited The Hotel Miami regency when I was on my way to help out in Haiti after the earth quake. This was a very stressful time for myself and my medical team. I was pleasantly surprise when we were introduced to the front desk manager Miguel Batista as he was so kind and compassionate.He did everything to make our stay wonderful and comfortable. He even went out of his way to find us some healthy snacks we were craving late at night when nothing was open. I have never been to a hotel with such friendly and accommodation staff and I highly recommend this hotel to anyone who wants great service and a wonderful experience. I look forward to my next trip to Miami, and stay with Regency Hotel, Laura from Vancouver BC, Canada", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Loved it!!!”", "Author": "Rebeca E", "ReviewID": "UR120599520", "Content": "The renovations made a big difference!!! Loved my stay last week. Found great help with all the employees, excellent public relations. I would definitely come back to your property and I have already told my friends \" this is a great place to stay\" Keep up the good work!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Santo Domingo, Dominican Republic", "Title": "“Very Good”", "Author": "Gustavo C", "ReviewID": "UR120595895", "Content": "Very good hotel, stayed for 2 nigths and liked it very much, very good customer services, staff very helpfull, would stay again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester UK", "Title": "“Adequate”", "Author": "ajhaeh", "ReviewID": "UR120052706", "Content": "After recently arriving late at MIA and missing my flight connections courtesy of American Airlines I was invited to stay at the Regency for the night. The shuttle bus from the airport was fine and check in no problem. The rooms were adequate for the stay with all the usual trimmings... In room coffee, safe, TV etc. Breakfast buffet was $10 and included fruits, cereals and some hot plates of eggs, bacon, sausage..adequate. Again, check out was fine and the shuttle bus punctual. On my next travel through MIA, should I be delayed overnight I would use the Regency again.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Stay away”", "Author": "dkennedy5324", "ReviewID": "UR119700675", "Content": "I would not stay here again if they paid me to stay. Old hotel needs updating badly rooms more like a old motel6. Hotel shuttle is a joke. The van smells like smoke we even saw the driver sitting in front of the hotel smoking in the van.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oakville", "Title": "“Planning to go soon”", "Author": "CheekyBabe", "ReviewID": "UR119690720", "Content": "I have been reading a lot of reviews for this hotel and it seems that most of the negative reviews came from clients that were assigned to stay there due to flight cancellations. As such, perhaps they were generally disgruntled about the situation or perhaps they were given the older rooms pending renovations. Overall, I find that some of the comments were nit picky and is expected of an older hotel. With renovations under way, this should be indicative as to how the hotel wants to continue to improve. I also want to commend Jose, the hotel manager for taking the time to respond to most negative and positive feedback. This is someone that obviously cares about the business and is touch with what the public thinks. I look forward to visiting the hotel in January with my family. We plan to stay there before and after our cruise.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Florida", "Title": "“WHAT A WONDERFUL SURPRISE”", "Author": "SouthFloridaDomenico", "ReviewID": "UR119551555", "Content": "Recently, I had a trip planned to go north. When I got to the airport, my flight had been overbooked, and the airlines offered to have me stay overnight in a neighboring hotel. Since it was late, and I didn'e feel like driving back to the beach, I decided to take a mini stay-cay and check in to this hotel. BOY, WHAT A SURPRISE! I thought all the boutique hotels were mostly on the beach. But, when arrived at the Regency Miami, everything from getting off from the van, through checkout was superb. The hotel has been recently renovated, and although from the outside, it doesn't look like much, the inside brought about quite a surprise. The lobby was great, there was an awesome restaurant and bar, and even a club. The staff was extremely accomodating, and the rooms were fresh and clean. They even have a pool for an early morning dip after breakfast. I was really impressed- these guys really know what they are doing. I may stay there again just for the coziness of it all-super friendly staff, and very clean.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Best hotel near the airport”", "Author": "DMK1966", "ReviewID": "UR119531415", "Content": "Very clean, cozy and quiet. The rooms are large w/ balconies. Decor is beautiful from the lobby to the halls right into to the rooms! Surprisingly enough, did not hear the planes going by w/ the slider closed. Gorgeous pool and landscaping. Ontime FREE Shuttle service. Staff is very efficient and friendly. The restaurant had great food, reasonably priced and plentiful portions. The bartender and waitstaff treated us like we were old friends, they entertained my teenagers w/ some tricksand jokes and even shared there secrets of how to do the tricks. We had some good laughs that night! I highly recommmend staying here!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“awesome night”", "Author": "elias d", "ReviewID": "UR119452844", "Content": "Short but sweet I was sent to the Regency Hotel after the flight I was booked on was cancelled. It was a rainy night and I was not looking forward to spending it at an airport hotel. However, I was surprised how attractive and lively the hotel turned out to be. There were three areas to hang out â€“ a Lobby lounge, a full service restaurant and a club. The front desk agent invited me to their happy hour when I checked in. Le Club was a very cool bar. Not very crowed, but the upscale clientele and a great DJ made it fun. It closed a bit early for my taste, but was still enjoyable. I got a great nights rest, and awoke to a rainy day. Too bad as the hotel had a really nice pool.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Do not trust the pictures”", "Author": "mgrp", "ReviewID": "UR119358405", "Content": "We stated here after one of our flights was canceled. Unfortunately we are common victims of airline cancellations and usually end up in an airport hotel once a year. Usually I try to make the best of it but this hotel is in poor shape. The lobby looks very nice but upon exiting the elevator we had a rude awakening. Rooms were being redone and it was a bit of a mess, people were also loudly partying and smoking pot down the hall (you could definitely smell people lighting up when walking down the hallway). The music from the onsite club \"le club\" could also be heard in our room. if you aren't down to party this might not be the place for you. Room was less than desirable, bathroom was in sore need of an update.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Very surprinsing experience!”", "Author": "Pineda727", "ReviewID": "UR118962514", "Content": "I live in south Miami and my aunt from New York city and me were trying to travel to Hawaii as a vacation, but our AA flight was canceled, so they gave us the choice to be sent to a nearby hotel,I chose the hotel just to go a watch some tv and sleep. Coming from AA,I did'nt expect for us to be sent to this nice hotel.The driver was fast and nice and the lobby was beautiful, the staff was very professional and everything looked clean. No bellman was available at the moment since one was helping a family, and the driver went right back to the airport. We had a big suitcase with us, but both my aunt and me are very petite so it was quite heavy for us,as i was trying to pull the suitcase the man from the restaurant offered to help me (later i learned that his name was Ernesto and he is the restaurant host,very good service) but the manager himself, Jose B, came and pulled the suitcase for me all the way to my room. I found the staff to be very professional and caring, I was very happy with the service and felt like everyone made sure that we were ok.The next day the bellman Luisito helped me to go down to the lobby and took his time trying to find if my flight was on time. Overall,very clean, nice rooms, but the best is the staff.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Not a good experience”", "Author": "ynnej10", "ReviewID": "UR118699212", "Content": "Our flight from Aruba was delayed due to mechanical issues so we then missed our connecting flight. AA had to put us in a hotel in Miami for the evening and we got stuck here. The staff is very nice but the rooms are BAD! We walked in the room and no A/C was running so we turned it on high but even by morning the room was still really warm. It was about 85 degrees in the room when we first arrived. The bathroom was gross. We had mold in our shower, on the shower curtain and around the sink. The sink barely drained and when you turned the faucet on it leaked out the back all over the floor. The tile on the bathroom floor was also chipped and cracked in several places. We did have a balcony....with a great view of garbage cans from the hotel next door. Luckily our stay here was only for 7 hours. I would never have paid to stay in this hotel.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maracaibo, Venezuela", "Title": "“A Great travel experience at Miami Regency Hotel”", "Author": "Alfredo Jose G", "ReviewID": "UR118428766", "Content": "I never had had the opportunity to sit down and to write a review about a such a wonderful team and fine customer experience. I came from Tokyo, Japan and I had a strong jetlag over my shoulders, the less thing that I needed was complications by the time I checked in in my hotel, there were 4 people (for me the fantastic four) that made my stay at RH the warmest and finest stay of all, they are Jorge Oliva, Roberto Reyes, Susej and Jose Miguel (MGR), all these people really worried about me and took care of me, giving to me options and the best assistance on every requirement that I had to make more pleasant my stay at Miami. This is a short note to thank you all and to recommend all this site the wonderful hotel that RH has become. Thanks from Alfredo Gonzalez,", "Date": "September 21, 2011"}, {"Ratings": {"Location": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“BLAH”", "Author": "gop7752", "ReviewID": "UR118291469", "Content": "A decent hotel that is close to the airport and the airport. The hotel also has a complimentary shuttle to the Port which is FANTASTIC. However, for a hotel that prides itself on being a common place for cruisers to go before embarking on a cruise, one can NOT print out online checkin materials, such as boarding passes, etc. for the cruise. They have a nice business center, but the computers do NOT have a PDF reader on them so one cannot view, hence print, these imperative materials. BE SURE TO HAVE EVERYTHING BEFORE ARRIVING TO THE HOTEL. The staff is NOT friendly at all. NOT HELPFUL. Pretty rude. Tried asking for assistance with the printing, I was advised, \"oh well\". Also, all of the vending machines were broke (yes, all 5 throughout the hotel) so I was not able to get a water after traveling 5 hours. Once again, I approached the \"concierge\" (notice the quotes), and his suggestion was to walk out and find a store. Mind you, I have never been to Miami before, it was after 11 p.m., and the hotel is NOT in what appears to be a safe area. When I went to check-out, the staff was again very short and rude...abrupt. Didn't seem to care about my conerns or give me the time of day. Again, decent hotel but will probably not stay here again based solely on the service of the staff. Too bad...there is A LOT of potential for this establishment.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "ny", "Title": "“Nice hotel Nice people”", "Author": "none n", "ReviewID": "UR118251580", "Content": "My stay at the regency hotel miami was really great!!! they cancelled my flight and i was not giving a voucher, but when i got to the hotel this young lady name Rose welcomed me with such warmth it was nice ,and when i got to the room i was really happy the people was very nice and i really enjoy each and everyone that helped during my stay if im ever back in miami i will definitely stay there agin great place shuttle great thank you hope to see you guys in the future", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Santo Domingo, Dominican Republic", "Title": "“Nice Hotel..”", "Author": "Carlos S", "ReviewID": "UR116545939", "Content": "The hotel is good, nice bed for a good night sleep.. Very Clean, nice swimming poolâ€¦ Good price..", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lanham, Maryland", "Title": "“Visit to Regency Hotel”", "Author": "marlene1530", "ReviewID": "UR115828416", "Content": "Everything is very elegant and neat. The hotel facilities are equipped with everything you could need. The staff is very friendly and willing to help in anything you need. The location is a plus (close to the airport).", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Wonderful customer service! Attentive staff and friendly front desk.”", "Author": "Millie23_11", "ReviewID": "UR115775888", "Content": "I went on a quick trip to Miami and booked a room at this hotel. Right from the start the front desk helped me being that it was a quick stay. They accommodated me with excellent customer service and showed concern that all my needs be met. The room was very clean and beautiful decor as well. I did not need to remind the front desk of the time i would be leaving, the bellman was there when indicated. Very friendly and amicable the young man. The next morning i enjoyed a variety of breakfast items, all fresh and tasty. But overall i can not stop to say that the front desk was truly a great help and i must add they had excellent customer service! Will keep in mind this hotel for future stays!!!", "Date": "July 25, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Santo Domingo, Dominican Republic", "Title": "“Of course we'll be back”", "Author": "NikkiS07", "ReviewID": "UR115725963", "Content": "The hotel was fabulous, the people always smiling and friendly, and the shuttle service was great!! We didnt have to wait a minute and you guys were already there!! So i would definitely go back to the hotel, it was an unforgettable experience.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Service": "4"}, "AuthorLocation": "Nassau", "Title": "“wasnt half bad.. surprised”", "Author": "bellabahama", "ReviewID": "UR115703418", "Content": "AA canceled my flight to Chicago..I've lived in Miami and have never heard of this hotel. So when the agent gave me the voucher for the hotel I refused, AA doesnt put their own Pilots /staff here. But it was all they had, and I wasnt about to pay for my own hotel or sleep in the airport. I lobby is very old world spain or spanish decor. I was surprised it wasnt a roach motel, as i once thought. My room was clean, Fresh paint and white linens. The TV is antiquated though but oh well and the bathroom wasnt half bad. Would I stay there again.. maybe. if the price was right. Yes. oh and free parking.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Dover, New Jersey", "Title": "“excellent restaurant”", "Author": "rafaelromeror", "ReviewID": "UR115635228", "Content": "I had the pleasure of staying a long time and know all the facilities, since I just sleep for a weekend, my stay in Miami was short on family staff ... but i test the food in his restaurant and take some drinks watching the yankees...it was excellent! time, i get fun a lot, treatment, food and service was very good, I would like come back with good friends.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Flower Mound, Texas", "Title": "“Worst Hotel Stay in 20 years”", "Author": "mlston", "ReviewID": "UR114932509", "Content": "I was given a voucher from American Airlines to stay in this hotel. The staff is unattentive at best. The driver to the shuttle rude and arguing with guests. I saw other hotels pass me three times before I ever saw this guy. When I got to the front desk Mickey looked like he had been partying all night and then put his uniform on. I thought he had been over worked for hours and asked how much longer he had to work he said about 6 more hours. I was given a voucher for food and was starving. I got mashed potatoes ouf of a box. I ordered salad and got two hamburger toppings lettuce, tomato, and onion put on a plate. I got to my room and the sound outside my window sounded like an airplane taking off. I asked if they had another room and they said no but offered me earplugs. I came down to get the ear plugs and they were offering a new guest new rooms. The earplugs did not cover the noise. I woke up on and off all through the night. I was in deep sleep at 8:00AM and someone knocked on the door and was opening it at the same time. Did not even give me a chance to respond. The maids have been so loud ever sense I have not slept. The alarm clock in the room has read 10:43 since I got here and the remote does not work, I have two more food vouchers for this \"hotel\" but will not use them as I will not put any more money in their pockets. I will go pay to eat at the airport. Goodbye Miami!!!!", "Date": "July 1, 2011"}], "HotelInfo": {"Name": "Regency Hotel Miami", "HotelURL": "/ShowUserReviews-g34438-d85189-Reviews-Regency_Hotel_Miami-Miami_Florida.html", "Price": "$107 - $186*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1000 Northwest Lejeune Rd</span>, <span class=\"extended-address\">1000 NW 42nd Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33126</span></span> (Formerly Airport Regency Hotel)</span> </span> </address>", "HotelID": "85189", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-f/01/c5/60/34/airport-regency-lobby.jpg"}}