{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hollywood UK", "Title": "“Very brief stay”", "Author": "WhitlocksEnd", "ReviewID": "UR126489668", "Content": "A post cruise day room was included as part of our cruise package. Short transfer from the Port of Miami, reception struggled to cope with the large number of guests checking in at the same time. Room although a little tired was very well equipped. The coffee provided in the room was excellent. Took advantage of the free, regular, hotel shuttle to get to the airport where we are able to catch a bus Miami Beach for the princely sum of $2.30 each way. This ensured that we were able to make full use of our day in Miami. Only disappointment was that we had to check out of our room at 16.00 which left us a bit in limbo prior our evening flight back to the UK.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frisco, Texas", "Title": "“Very good stay.”", "Author": "cancun123455870", "ReviewID": "UR126449945", "Content": "Stayed here for one night with an early morning departure from the airport. Served our needs perfectly! Very comfortable bed, and the free shuttle to the airport runs every 15 minutes and the ride to the airport takes less than 5 minutes. Would stay here again. Got a good deal with a Priceline bid.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Not that great for a Sheraton”", "Author": "Rosafresa", "ReviewID": "UR126355652", "Content": "Hotel was beautiful....about 20 years ago i guess... the carpets are dirty, the elevators, doors and windows are in real need of been replaced. Certainly not what you will expect from a Sheraton. Pros: The lobby attendants are great, and really friendly, and the area pool is good. The beds are great too! really comfy! The free shuttle to and from the airport every 20 minutes certainly adds points.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“Great staff”", "Author": "GrayHairedGranny", "ReviewID": "UR126335704", "Content": "We used the Sheraton as the gathering point for a trip to Cuba. The room was quiet and comfortable. We particularly enjoyed the flatbread pizza in the patio restaurant area. We have to say a big thank you to Geo Zeledon and the Sheraton -- we had a post Cuba medical emergency -- Thanks, Geo for driving us in your car to the Coral Gables ER and getting us settled in.. and thanks to Holly Cabell in the ER for your care and attention... not quite how we planned to celebrate St Patrick's Day --- but you made it memorable for sure", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Clermont, Florida", "Title": "“Review of apparance of the hotel room”", "Author": "DaleGoehrig", "ReviewID": "UR126180180", "Content": "I think it is time for the Sheraton to replace the worn carpet and worn furniture in Rolom 353. We were really surprised to find a room in this condition at a Sheraton. We were surprised that we had to pay $15 a day for parking.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Great Location, Amenities and Caring Staff”", "Author": "spgplatinumchicago", "ReviewID": "UR126148019", "Content": "We have had several recent stays at this hotel, and each has been exceptional. The hotel is located adjacent to a canal and golf course, providing very pleasant views. The lobby area is very open, with a tropical theme. Considering its proximity to Miami airport, we very rarely heard any associated noise (a great). Our suite was quite large, with a great view of the canal/golf course. Everything was modern, functional, and comfortable. The dining area was very light and well appointed, with a wonderful outside covered eating area, providing great views. The restaurant provided many choices (along with a similar and innovative menu at the Vin Bar seating area). The Chef, Frank, is extremely talented, creative and friendly. The fitness center is up-to-date with all of the equipment one would need. Most important is the wonderful staff, from Dave Berger (the General Manager), Raul Ulloa (Hotel Manager) and everyone working there. They all make us feel like 'Family'. Special thanks to Nicole and Sonia for always making sure that everything exceeds our expectations !!!! One more important point: the hotel is pet friendly and our 2 dogs (Cirneco del Etna) love staying here. There is sufficent walking area, etc. Everyone makes them feel like they belong. We look forward to many more stays.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "La Vergne, Tennessee, United States", "Title": "“Very convenient and quite nice too!”", "Author": "Jonathan H", "ReviewID": "UR125967258", "Content": "I stayed at the Sheraton Miami airport on March 1st. I have to say for an airport hotel this one was very nice. The staff was good, the decor was nice and the room was very comfortable. The hotel is located right next to the rental car return area of MIA. We returned our rental car the night before our flight to save time. It was great to just take the shuttle to the airport, sooo much easier. I highly recommend staying here if you have an early flight out of MIA.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Convenient & Great Value”", "Author": "jvalente_ca", "ReviewID": "UR125933089", "Content": "Family(2 adults, 2 kids aged 8 &13) stayed here the night before our cruise. We chose this location as we are SPG members (4000 points for this reservation)and it is across the street from MIA car rental, so very convenient for us to drop-off rental and get a free shuttle ride to port(using Alamo) Hotel & Room were very clean, beds comfortable, nice view over golf course.Hotel parking was $15 with in/out.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Convenient, comfortable travel hotel”", "Author": "RozzyW", "ReviewID": "UR125889008", "Content": "My family & I just concluded a one night stay at the Sheraton Miami hotel. Paul checked us in and was very pleasant & polite, as well as speedy. After a long drive to Miami, it was greatly appreciated! We stayed in a very clean and comfortable club level room. Great view of the Miami skyline and golf course. The club lounge is currently being renovated, so it is in a temp location. The snack selection at night could have been improved, but the cold drinks and breakfast in the a.m. were great. No complaints about this stay and we would definately stay here again.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“sheraton Miami”", "Author": "Jill H", "ReviewID": "UR125841516", "Content": "great manager at desk - Stanley!! very nice and accomodating hotel!", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Osaka, Japan", "Title": "“Excellent hospitality”", "Author": "namatrip1", "ReviewID": "UR125829501", "Content": "Staff's hospitality is excellent, especially bell / drivers. Free shuttle is available every 15 minutes and some payable shuttle for shopping mole also available. Only 2 regrettable points are, there is no much choice of menu in restaurant and fresh fruits provided in the room were left until a lot of fungus grow. But overall it is very recommendable.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colorado Springs, Colorado, United States", "Title": "“Geo Zeledon”", "Author": "Lisa H", "ReviewID": "UR125664987", "Content": "Geo was great. He helped us find a great local restaruant and he made sure we had safe trasportation to the beach. Loved him and the Hotel (especially the gym). I will recommend!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Moodus, CT", "Title": "“Friendly staff - great value”", "Author": "atd817", "ReviewID": "UR125625687", "Content": "We arrived and were given a great room with a nice view of the golf course. Everything was clean and neat. The only negative was that the hotel was an expensive cab ride away from South Beach. We asked for assistance in choosing dinner options that were local. The front desk and staff and gave us some great choices. A driver named Geo Zeledon was so kind as to recommend a wonderful low key restaurant named La Rosa to us! He was so helpful and we are grateful! We enjoyed ourselves immensely! Definitely recommend a stay here!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cascavel, PR", "Title": "“Traveling with family”", "Author": "vicenters", "ReviewID": "UR125594838", "Content": "We Spent one night in Miami. The hotel offers shuttle to and from airport. Excellent service and friendly staff, close to the airport, and the breakfast is really excellent.Thank you.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice room with great airport location”", "Author": "Hisfriend", "ReviewID": "UR125588989", "Content": "Very close to the Miami airport and a typical, nice comfortable room. Put on the concierge floor with access to the lounge. Breakfast was a little disappointing in the lounge even though the Spanish lady there was wonderful. Know that you have to pay for parking or Valet at $15/night for either so it is worth it to valet. Will stay here again.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Three stays in January”", "Author": "wvugrad2001", "ReviewID": "UR125561584", "Content": "I am a regular guest of the Sheraton Miami Airport Hotel, I ended up staying there 3 times this January for a total of 13 nights. For the most part things were great, which is something I have come to expect from this hotel as the staff is some of the best I have experienced in a hotel. Food in the restaurant was wonderful and the breakfust buffet is quite good. The only two issues I had during my stays in January were the quality of one of the rooms I had to stay in for one night and the temporary location of the Club Lounge. The hotel was sold out for my first visit and the room I was given had to have been given to some pretty rough guests as the furniture was broken and the carpets were badly stained. Dave, the hotel manager, had the room cleaned before I returned from work the next day and still moved me to an upgraded room for the inconveinience. He also treated me to an exquisite dinner in the restaurant (the warm duck salad was incredible). I truly appreciate the quality staff at this hotel who go above and beyond to provide excellent service. I can't wait to experience the new Club Lounge when it is finished. The current set-up in a suite and the previous set-up in the bar are nice but neither has had any hot food which was a great feature of the old club room. They are trying their best, but it is the small things regular guests miss. Thanks again for the excellent service and I'll be back in April.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bridgton, Maine", "Title": "“Good for quick overnight.”", "Author": "twip", "ReviewID": "UR125506446", "Content": "Nice place to stay for either late/early flight. Free shuttle is convenient. Very nice to sit by the pool and watch golfers. Rickenbackers we felt was a bit expensive and long wait for change when paying the bill. Lobby was open and clean with lots of sitting spaces. Rooms were nice, clean and functional. NOTHING nearby! must take taxi to shopping area [$10] or anyplace else to eat. Breakfast is NOT included and you only get 24hr free internet. Use points and stay for free then this place is great!", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Thank you Sheraton Airport”", "Author": "Reyhaneh S", "ReviewID": "UR125479821", "Content": "Spent one night in Miami. They got me a shuttle to and from my interview, they helped navigate me to the Beach afterwards, and they kept my fragile personal belongings in their storage once I checked out....WITHOUT a problem. FRIENDLY STAFF, CLOSE TO AIRPORT, WONDERFUL SERVICE...and the pool was warm and perfect. THANK YOU AGAIN...", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful staff!”", "Author": "Therese B", "ReviewID": "UR125323562", "Content": "Planned a trip to Miami and stayed here for five days to celebrate my husband's and our daughter's birthday. The day staff at the Rickenbacker restaurant namely Cecilia S., Aracelis A., and Carlos(cook) made their special days extra special! They brought out a mini cake and sang for them! They also was very attentive. Their service outstanding! We travel a lot and the experience here was by far memorable courtesy of the staff. A slight glitch to our stay happened on our last night. One of the servers seemed to be overwhelmed and it reflected on his service. He was abrupt but it was rectified by a very professional, and accommodating gentleman named Elvis (I think is the manager at the restaurant). Overall, this hotel and the staff made our vacation special. Would definitely consider coming back. We highly recommend this establishment.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Katy, Texas", "Title": "“Convenient for the airport”", "Author": "Eddie_Aberdeen", "ReviewID": "UR125304463", "Content": "stayed here before an early morning flight as its near to both the airport and car rental center. At best i would say its dated and in need of a spruce up although to be fair it was clean and comfortable. Check in was good and efficient and the bar staff were friendly. Bar food was average at best my club sandwich tasted a little of stale oil and had obviously been grilled on the hot plate my wife's chicken tenders might have forced a visit to the dentist they were to hard although she did say the french onion soup was very tasty. The guys on the shuttle service were very helpful trying to manage lots of folks all wanting to be first on or off. I would probably stay here again but my expectation level of the brand would be very much reduced.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ontario, Canada", "Title": "“Convenience”", "Author": "travel-king13", "ReviewID": "UR125209166", "Content": "Booked on Hotwire and was very happy to get The Sheraton because of it's proximity to the car rental center. Arrived after midnight very tired after a long day and flight. Shuttle arrived within 10 minutes and it was a short 3 minute drive to the hotel. Check in was very fast, less than a minute since all my information had been already provided. My room was right next to the elevator, as most Hotwire rooms are, it didn't bother me, but I can see how it may be bothersome for others. The room was small with two comfortable queen beds. The bathroom was a good size, but the pedestal sink had no place to put personal toiletries. When I woke up in the morning and opened the curtains, I had a great view of the Melreese Golf Course and the city of Miami in the distance. Overall, decent but not great.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Union City, New Jersey", "Title": "“Home away from Home”", "Author": "Andres G", "ReviewID": "UR125162149", "Content": "It is not easy to work out of home town; however, it is priceless to find a home away from home, and I found my home at Sheraton Miami Airport Hotel. I am staying every week since last September 2011, and I will continue. This hotel has the best staff ever, an excellent GM working hard to improve the hotel everyday; a great sales person that is more than a marketing is a friend, thank you Jose. Thank you Kat and Stanley for your special way to help and treat everybody. Furthermore, to start your day you can enjoy a breakfast like home. It is an outstanding service with and unique staff with person like Carlos, Domingo, Bostone, Ruben, Melissa and the rest of the team. If you are coming to Miami, I recommend you the best place to stay \"Sheraton Miami Airport\" Sincerely, Andres Garcia!!!!!", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Very Pleasant, Good Airport Hotel”", "Author": "NellieVA", "ReviewID": "UR125083249", "Content": "I spent one night at the Sheraton Miami Airport after arriving on a late-evening flight. The pending Boat Show had most of the hotels booked in town, and I didn't want to try and navigate an unfamiliar city after flying all day. Got a good price on this hotel through Priceline, and was very pleased with my stay. The location is VERY convenient for the airport, and in hindsight I could have waited to pick up my rental car the following morning, as they are so close to the Rental Car Center. In fact, the hotel is located directly at the bottom of the ramp as you exit the Rental Car Center. It is not overly easy to cross over and enter, but it's still a good location. Parking is by valet only, but it was easy and very quick. I called as I left the room in the morning, and my car was already waiting when I reached the lobby. The room was clean, in good shape, and very quiet. I never heard anyone in the hallways, or even the normal sound of pipes, etc. My best compliments are saved for the bed, which was extremely comfortable. Props to Sheraton for this. Overall, it was a nice stay. I can't imagine staying here if you're not wanting to be based directly at the airport, but if that's what you need, the Sheraton is a good choice.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "NJ", "Title": "“Convienent, sufficent, ok are the words I use to describe this hotel.”", "Author": "2worldtravelersnj", "ReviewID": "UR125054252", "Content": "2 nights while working in Miami area, right next to Miami International which is really the best thing is has going in my opinion. It isn't easy to get in and out of if you aren't familiar with the area but once you get the hang of it, not bad at all. Staff upon check in were all very nice from valet to front desk. Valet only and it will cost you 15 a day so be prepared. No upgrades available even though I called twice and asked and they told me they would do their best, well best didn't work :) All good though, standard king room with some air purifier thing. No mini refrigerators left which bummed me out but access to lounge with status is a bonus! Didn't get good sleep here at all. It must have been the combination of my neighbor and the air purifier, just didn't work for me as well it was a bit worn out so I never felt comfortable from the start. I get a bit freaked out when I see dirt and grime and I did in the bathroom, carpet and curtains. It was by no means unbearable just not to my liking. Gym was good, plenty of gear, unsupervised minors though can pose an issue. Pool looked good but didn't use. Lobby was nice and bar seemed good. All in all a decent stay but would I stay again, most likely not. Will look elsewhere to find what I like most in a hotel when in town.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "5", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Key Largo, Florida", "Title": "“Smelled and Carpets Stained”", "Author": "JayandLisa", "ReviewID": "UR125035894", "Content": "We used their park and fly parking garage so we decided to stay at the Sheraton Miami Airport for the convenience due to an evening flight. Our first room smelled of mold and the carpets and walls were stained. The second room on a different floor smelled of smoke,had stained carpet, and had loose tiles in the bathroom and had moldy water stains around the air conditioning duct. Our third room at least didn't smell but had large stains on the carpet and hand prints on the walls. This hotel needs a complete rehab. The owners should put some money back into this hotel.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great staff”", "Author": "JoulesToronto_Canada", "ReviewID": "UR125007307", "Content": "Geo Zeledon greeted us and made our last night in Florida so much easier by taking charge of our luggage, directing us where to return rental car, arranging shuttle for 5.00 am. Thanks for making our departure so much easier.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“Sheraton Miami was wonderful!”", "Author": "jennifer s", "ReviewID": "UR124991888", "Content": "I visited this hotel with my 3 children for a weekend trip to Miami. Although my booking company messed up my reservation, Stanley who was working at the front desk was incredibly kind and patient. We interacted with staff from Guest services, housekeeping, and valet, and all were so professional and courteous! This is one os THE BEST hotels I have stayed in!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great Hotel, Great Staff”", "Author": "SUPERMARIO-NY", "ReviewID": "UR124971209", "Content": "This was a very convenient hotel, Very clean hotel with a GREAT staff, they were so nice and helpful. I would happily recomend this to anyone who traveled to Miami.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warsaw, Illinois", "Title": "“Nice staff & great room”", "Author": "kt012885", "ReviewID": "UR124577767", "Content": "I was nervous after reading some of the reviews but we got to the hotel at 10:30pm and we were welcomed to nice staff. We had a couple drinks at the bar (pretty expensive but expected) and we just stayed the one night. The room was cozy and clean with a comfortable bed! No complaints!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ohio", "Title": "“Great Staff!”", "Author": "Denise A", "ReviewID": "UR124493293", "Content": "Alain assisted us after we had missed our flight. Alain was very patient and kind. We are very grateful for his help!", "Date": "February 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "hometown", "Title": "“very relaxing place even with it's location”", "Author": "joannie p", "ReviewID": "UR124492637", "Content": "I was happy to find this place to be quite relaxing and quiet. The service was excellent and we enjoyed spending time here.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Great service”", "Author": "kyfirefly", "ReviewID": "UR124451332", "Content": "The staff was extremely helpful and went the extra mile to help. Geo Zeledon was very informative and helpful.", "Date": "February 11, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Orlando, Florida", "Title": "“Stay before cruise”", "Author": "pjw08", "ReviewID": "UR124413035", "Content": "Only stayed one night before going on a cruise out of Miami. The hotel is a bit dated and the executive lounge was not up to normal level of Sheraton standard, however, based on previous review, this was apparently due to renovation going on at this time. Had a serious problem with housekeeping, but because of the diligence between staff and management a satisfactory resolution resulted in rectifying the situation.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "chicago", "Title": "“Try another hotel for your layover”", "Author": "durgaChicago", "ReviewID": "UR124384122", "Content": "This was only a transit overnight stop. The shuttle came quickly and the driver was helpful with the luggage. Check in went quickly because we had Starwood's gold status. The problem was the room. The upholstery was torn, the room lighting horrible and the phone was broken which necessitated a walk to the desk to inform them of the problem. A maintenance person came but couldn't fix it. The hallway drapes were very dingy and dirty and I detest seeing trays of half eaten food on the hallway floors. Breakfast food in the club lounge was below average, no variety and less tempting than my husband's Atkin's bar. A tV down the hall was blasting but thankfully, I couldn't hear it in the room. Try another hotel for transit.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Perfect for convenience to the airport”", "Author": "vacationgirl105", "ReviewID": "UR124345928", "Content": "Stayed here for one night with an early morning departure from the airport. Served our needs perfectly! Very comfortable bed, and the free shuttle to the airport runs every 15 minutes and the ride to the airport takes less than 5 minutes. Would stay here again. Got a good deal with a Priceline bid.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Meadville, Pennsylvania", "Title": "“A wonderful staff”", "Author": "James F", "ReviewID": "UR124345400", "Content": "The hospitality and technical staff that took care of us at the conference were top notch. Every request was returned with a smile and eagerness to meet the needs of our group.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Stay on the golf course side”", "Author": "get_with_it", "ReviewID": "UR124320122", "Content": "We arrived at this hotel at 2:30 AM due to a late flight. The hotel is about a 5 minute cab ride from the airport. We went straight to bed and when we got up in the morning we were surprised to look out our window and see a canal and golf course. We went for a walk and out the front of the hotel we could see and hear the airport. If we had been on the airport hotel we would have been woken up earlier by planes. The bed were comfortable and the rooms clean. Lobby renovated, pool very nice. There is a strip mall about a 20 minute walk or $8 cab ride. I have booked this hotel again next month.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Beautiful pool area”", "Author": "GAL01", "ReviewID": "UR124306297", "Content": "The convenient access to the Miami Airport is a plus. The front windows look out to the monorail of the airport but the rear windows overlook a golf course. The pool patio area with its bar and grill provide a refreshing escape from the hustle and bustle of traveling. Although the hotel is a bit dated with the bathroom showing signs of wear and tear, the beds were extremely comfortable.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lerum, Sweden", "Title": "“Great hotel close to the airport”", "Author": "BenganJ", "ReviewID": "UR124289109", "Content": "Stayed here a couple of days during Christmas. Great hotel which will be even better when they are finished updating the gym and the club lounge. Stayed on the club floor and the rooms needs some updating. Club loung closed and gym in a conference room. Breakfast in the restaurant which we got instead of breakfast in club lounge was really nice. Pool area with outside bar on the backside made it feel like a resort.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Break fast at resto”", "Author": "sam s", "ReviewID": "UR124269230", "Content": "i stayed for a week at the hotel , i enjoyed the break fast and friendly stuff ,the greeted us with a great smile and excellent service , i like to hight light the flowing stuff , F rocha , polanco , melisa lopes and boston. thank you guys", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Breakfast Staff”", "Author": "koko k", "ReviewID": "UR124233169", "Content": "I was in Miami for business and I stayed in this hotel for a little over a month. Everyday I had breakfast at Rickenbacker and the entire staff are just great, super friendly, welcoming and full of positive energy. I would like to highlight a few who I became good friends with: Boston, F.Rocha, Polanco, Melissa and Stanley from front desk who always managed to recommend great evening restaurant ideas! To the entire team, thank you for making my stay a wonderful and pleasant one.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect”", "Author": "Jonathan K", "ReviewID": "UR124174636", "Content": "Absolutley a perfect hotel. The waiter named Boston was phenomenal. The food,the service and the entire staff was incredible.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ras Tanurah", "Title": "“VERY GOOD HOTEL-EVEN AFTER CHECK OUT”", "Author": "Julio B", "ReviewID": "UR124107030", "Content": "This was a very good stay for me and my family. Everything was as expected from Sheraton. Very close to the airport. I had a small problem after I checked out. There was a charge in my credit card that I did not make. Somebody purchased 95 $ in the souvenir shop and charged it to my room. I noticed when I was checking oput and the receptionist ensured It will not be charged to my credit card because It was a mistake. After a few days the ammount was finally charged to my credit card then I wrote an email to Mrs. Camela, from the Finance Dept. She was very kind and the charges were reverted to my credit card. This was a good after checkout service from them.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nebraska", "Title": "“Unparalleled outstanding service”", "Author": "HistoryChickadee", "ReviewID": "UR124070905", "Content": "My organization hosted a five-day program for 60 attendees at the conference center at this hotel. We were quite nervous about having been located at an airport hotel, but the extraordinary service from every single staff member at this property simply blew us away. The manager of this hotel must be phenomenal because I have honestly never seen anything like the quality of the service here. (I am staying an extra night after my home airport being snowed in). Yes the hotel is a very tad bit dated, but it is clean and the beds are very comfy. Plus, the food in the restaurant and in room service is quite good...in fact our attendees could not say enough about the food provided for breakfast, lunch, and dinner (and snacks in between!). The only issue is that it is remote if you want to go to South Beach or downtown, or anyplace that isn't the Miami airport for that matter. How we got around that was the amazing people who took us in large groups in their shuttle. But no matter how you cut it, there are no walking paths to speak of. If you walk by the canal you risk \"alligators and poisonous snakes\" as the signs say all along the edge! The stories I could tell you about how the people here went above and beyond the call of duty are simply too numerous to list here. I would recommend the conference center for any business event and even if you are just staying overnight before or after a flight I would say that if you take a moment to chat with a staff member or ask them for or about something you will have a friend for your entire stay. I better quit gushing or you will think that I work for them! :-)", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Much better than expected - if you travel with a car check parking costs.”", "Author": "Abarr101", "ReviewID": "UR124012654", "Content": "Having read some mixed reviews I was a little concerned about my stay. These concerns were quickly dismissed by a friendly shuttle driver, efficient check-in and clean/comfortable room. The hotel is dated and parts are tired but all appears well maintained. My room looked recently painted with a new carpet. Food and service at Rickenbacker's exceeded expectations and the terrace/pool area is relaxing for an airport hotel. Just one point to note - despite the GM's assurances/feedback in a response to another review (23rd Jan '12) a sign on the concierge desk clearly states valet parking at $15 with NO in/out.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ridgefield, Connecticut", "Title": "“Recent visit for Business Meeting to Sheraton Miami Airport Hotel”", "Author": "Mark C", "ReviewID": "UR124012542", "Content": "Busy airport hotel, at check in the room we were given a room that had not been cleaned yet, however we received very good service and support, especially from the Bellman - Ron Wilson, who assited us in getting into another room. He quickly moved us, involving the front desk and the hotel manager and was very helpful thoughtout the stay. Him and the team were very responsive and high level of service. At the end of my meeting I had a tight connection for my flight and Ron was able to get us over to the airport quickly to make the flight. Kudoos to Ron for his customer service orientation! Their business center and meeting facilities were very good from the rooms, AV equipment, snacks and refreshments for breaks etc....were very good, hey who expects Izze beverages in the coolers outside your meetings. The only negative as with most building in Miami and warm climates is contolling the temp, it always seems to be a bit too cool in the meeting rooms. My wife also mentioned the lunch down in the restaurant was very good, fresh and tasty offerings like a caprese salad which for the middle of winter to taste fresh is key. Only other recommendation is that you request an even numbered room, back of the hotel, with a nice overlook of the golf course behind and views of greater Miami. All in all a great hotel for a layover, transit or business meeting!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Blackpool, United Kingdom", "Title": "“So glad we did not arrange this stay”", "Author": "LancashirePaul", "ReviewID": "UR123984831", "Content": "We were booked in the Sheraton by our cruise line the day we flew out of Miami to Heathrow. On arrival the reception area was really modern, clean and welcoming. Check-in was fairly quick but they were busy with checking in a lot of guests who like us were getting day rooms before evening flights. The rooms were a reall disapointment, dark, dated, depressing and I hate to say, past there sell by date. The bathrooms had plenty of towels and toiletries but on the surface it appeared clean but thats where it stopped. On closer inspection there were weeks of dust on the pipes under the sink, sink plugs were filthy, mould stains on the tile grouting the silicon was black and some missing around the bath edges, so disapointing. Heavy thick layers of dust on the chrome fixtures and fittings. Of course, this is all down to the executive housekeeper and lack of their standards. I always believe and say, it starts at the top. I can accept older style rooms, it doesn't have to be to my style, but dirty thrown in the mix is a NO NO. The outside bar area where drinks are prepared was really dirty, mould, ground in dirt and the cocktail blender would be condemed if health officials inspected.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sudbury, Massachusetts", "Title": "“Lovely view of golf course at dining room”", "Author": "joanko", "ReviewID": "UR123959113", "Content": "Stayed there in December for business. Enjoyed breakfast which was included in the rate. It was very nice and loved the view of the golf course at the dining room. Hope to play some golf next time when not on a business trip. Room was clean and comfortable. Only drawback was that it was hard to find(even with GPS) when one is coming from Miami. It was easy to find when coming out of the car rental.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bay Area, CA", "Title": "“This hotel is schizophrenic”", "Author": "nwterp99", "ReviewID": "UR123629390", "Content": "The bar staff was friendly; the front desk was not. The bed was clean and comfy, but the carpet was dirty with stains. The building is old, but has been modernized with newer furnishings and decor. It's close to the airport, but other than that, there's not much to do around there. This place is good for one night stays if on your way to/from the airport or cruise port. Otherwise, you'll find downtown or the beach more interesting.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Quality of the support service at lobby”", "Author": "Carlos Miguel A", "ReviewID": "UR123628127", "Content": "I would like to congratulate Sheraton regarding the professionalism of the support personnel at lobby. I had a superb service by Geo ZeledÃ³n. Thank you!", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Solihull.UK", "Title": "“Very pleasant few hours”", "Author": "Creditgirl", "ReviewID": "UR123615121", "Content": "This hotel was part of a cruise package, we were given a room for the day before a night flight home. The room was large, well furnished and equipped but no safe with a view we hadnt expected for an airport hotel, looking over a golf course! We dropped our bags and headed out to the pool and terrace area. We had drinks and a snack while looking out on a waterway and golf course on the other side,all very pleasant and enhanced by the appearance of a manatee right in front of us! The foyer had a live departures board for the airport and we used the free internet service to check in online for our flight and printed boarding cards. There is a free shuttle every 15 minutes to the airport and a new train terminal is being bult opposite the hotel but not sure where this will go. Will definately use this hotel again for a lay over.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Capital District", "Title": "“No Complaints Here!”", "Author": "UpstateNYerMeMa", "ReviewID": "UR123456085", "Content": "We definitely made the right choice for a 2 night hotel stay prior to our flight from MIA. Having read many previous TA reviews, I had a preconceived idea of what to expect. I was more than pleasantly surprised that my expectations fell far below the actual experience. The area as you approach the hotel is a very commercial, active construction area, opposite an airport parking garage topped by a monorail, not very attractive. However, once inside the Sheraton's front lobby there is a complete visual transition. The public areas, pool, patio seating area, bars and restaurants are all attractively done in modern decor. The gym looks brand new and is very clean and well equipped. As you leave the lobby and enter the pool patio area , another visual transition takes place, you see lush greenery, a manicured golf course, water (canal?) even manatees and turtles were in residence there. We were fortunate enough to be in a 9th room facing that interesting golf course view and it was evidently soundproof since we saw, but did not hear, a few jets passing by. Loved the room, its view and especially the comfortable bed. The bathroom was not huge but was satisfactory. Each member of the hotel staff that we interacted was friendly, helpful and efficient, There was a small problem with our bill upon checkout but Sonia Steverson, Director of the Front Office, resolved the matter quickly to my satisfaction. The shuttle ride to MIA Section D took all of 3 to 5 minutes. talk about convenience. Yes, this is an airport hotel and not meant for long term stays, but in my opinion it has a small resort feel to it. When flying out of Miami, the Sheraton Miami Airport will be our hotel choice.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Florence, South Carolina", "Title": "“Do your research first”", "Author": "BrianE1968", "ReviewID": "UR123381301", "Content": "This hotel is adequate for a quick layover but not much else. My wife and I stayed here overnight before a cruise. Be warned that this is valet parking only. It costs $15 to have vehicle parked and there is no in and out. But, you can catch the free shuttle to the airport to eat or catch public transportation if you want to go to South Beach. The hotel is a bit isolated so you either eat at the hotel or catch the shuttle to the airport. The bed was comfortable but this hotel is dated. There were broken light fixtures in the room, stains in the carpet, and an overall \"aged\" bathroom. But, if you are just catching a few winks between flights these probably aren't deal breakers. The staff was friendly and helpful, although a few of them struggled with Enlish.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belfast", "Title": "“Excelent hotel near airport”", "Author": "kerlinso", "ReviewID": "UR123327271", "Content": "Had brief stay here and was very impressed - the room was quite luxurious and well equipped. Nice public area and pool area. Very efficient airport shuttle which takes less than 5 minutes to the terminal - a very decent airport hotel which looks as if it has been upgraded recently.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Airline layover at the Sheraton”", "Author": "Brock H", "ReviewID": "UR123323146", "Content": "We hadn't meant to stay over the night but two American Airline maintenance issues left us late for our connector home and we ended up here. I'd like to say the room, restaurant and staff were fine but the food was not up to par for a place like this (tough chicken in the salad, wrong order brought the first time, overheard another table complaining) and the bathroom was more what you'd expect to find in a $59 Super 8. Adequate but small with a noisy fan and dodgy seat on the toilet. After a week in the Caribbean we weren't stressed, the room was free and the meals subsidized but if I'd paid full fare I'd be feeling differently.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Diego, California, United States", "Title": "“Starwood Gold upgraded room”", "Author": "Peter S", "ReviewID": "UR123263628", "Content": "My brother is a starwood Gold member and booked the rooms so we were able to get free breakfast and upgraded room. The rooms were very clean and breakfast buffet was excellent. The parking is valet only; no self parking. I prefer to have the option to self park so I don't have to wait for my car, but they give you a number to call ahead so we didn't have to wait that long. Free shuttle to airport was very convenient. Taxi service was very slow during this New Year eve weekend. We were actually informed that it would be faster to take the free shuttle to the airport to get a cab. Was very happy with this hotel and would stay here again.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Calabasas", "Title": "“Element did not open”", "Author": "SandG12", "ReviewID": "UR123069103", "Content": "We had a say booked for the new Element hotel. I suppose they could not open as scheduled. They transferred our reservation to the airport Sheraton. They honored our great deal of hot breakfast and parking. The breakfast was good..... Thankfully free, otherwise it is 50.00 for 2! Room was average. They tried to accommodate", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Isle of Palms, SC", "Title": "“Great place for you airport stay.”", "Author": "PhilattheBeach", "ReviewID": "UR122942947", "Content": "My wife and I had two stays at this hotel during our recent travels. Yes, there is renovation going on, but it did not interfere with our stay at all. Front desk staff was excellent. The restaurant was really good for breakfast (be sure and have the fresh-squeezed orange juice). It was wonderful to have good quality, free wi-fi so that we could check our flights and other travel details. The airport shuttle was flawless.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Scotland", "Title": "“glad it was only a day room”", "Author": "gerbilhoward", "ReviewID": "UR122891588", "Content": "we had our room for the day prior to our night flight home and were we glad. the foyer was very nice, our check was quick. the receptionist was cheerful and helpful. the pool area was small but with a nice view over the water and the golf course. the chambermaid was very helpful in helping us fine our room. the room was very dated but large. the quilt cover, sheets and pillowcases were very creased as if they had not been changed from the last occupants. our room overlooked the water and golf course which was very nice but would have been better if we could have seen out of the window. the window was double glazed but there was condensation in between the glass panels. the bathroom was very old and tired. the bath taps were rusty, the bath overflow cover was falling off, this meant we could see the overflow hole and is was so very dirty. the bath was so old it had permanent stains on it. the shower was not much better, dirty and rusty. I was glad it was only a day room and our friends drove us to South beach for the day. we only used the room to wash and change our clothes prior to our evening flight. the staff were all very nice and helpful but the hotel leaves a lot to be desired. Sheraton needs to spend a lot of money to upgrade and clean the hotel. would I stay here again?..................... definitely NO.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“OK hotel right next to the airport.”", "Author": "mmppwwzz", "ReviewID": "UR122721807", "Content": "I stayed here for one night to catch an early flight the following morning. For an airport hotel, it was OK. The hotel appeared to be very full the night I stayed. Eclectic crowd made up mostly of people who looked like they had been bumped from their flights. There were some random people who looked as if they were spending their vacation at an airport hotel which was somewhat surprising. Maybe a pre/post cruise crowd per some of the other comments. Check in was chaotic. The hotel is huge and with most people staying only 1 night, thereâ€™s a lot going on at the check-in desk. I can't say much about the pool, restaurants or other aspects of the hotel since my stay was so brief, but the bar staff were very friendly when I had a quick drink at the bar. My shuttle departed for the airport at the time promised. Overall recommend this hotel if you have to stay near the airport.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Great overnight stop............!”", "Author": "wallybaloo54", "ReviewID": "UR122615130", "Content": "Very clean room, nicely furnished. Our rate included a buffet breakfast, which was excellent. Food in the dining room was a disappointment, and prices are quite high. Location is superb, with little time delay to catch hotel shuttle going in both directions. Perfect spot to stay if cruising, however, there are no other restaurants in the immediate area.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent airport hotel”", "Author": "joeyboy79", "ReviewID": "UR122609626", "Content": "Very clean and modern looking hotel, nice rooms, staff very courteous, very close to Miami airport, walking distance to car rental return.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malmo", "Title": "“late flight in to Miami - good location”", "Author": "HoganMalmo", "ReviewID": "UR122579276", "Content": "Flew in from copenhagen and arrived in Miami late in the evening. Stayed our first night at Sheration Miami airport. The hotel was exactly what we needed. Speedy checkin, extremely comfortable beds and valet parking. The parking was a bit expensive. The hotel is located at a walking distance from alamo and other car rental companies. You can save money by picking up the car in the morning. We stayed at the 7th floor and the didnt expreience any noise from the airport or trafic outside.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent Airport Hotel”", "Author": "Ncdoctooth", "ReviewID": "UR122433580", "Content": "I am an SPG member who stayed at this hotel with his family for one night on New Years Eve. My observations: the rooms were updated and clean, the workout room was very nice, the breakfast in the restaurant was excellent. For only 3,000 SPG points a night, it was a GREAT value. I would definitely stay here again.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marion,NC", "Title": "“Spa Sheraton”", "Author": "Debra B", "ReviewID": "UR122297348", "Content": "I just spent 7 days in Miami visiting my daughter for the holidays. After a couple of days in her cramped one bedroom apartment my husband and I moved over to the Sheraton Airport Miami. This was one of the best Holidays ever due to the incredible staff,of what we have now named \"Spa Sheraton\". We had a room with a beautiful view of a golf course. Spent a day at the heated pool in sunshine and we were 15 minutes drive from travel channels number one pick for Florida beaches \"South beach\". I have never been treated with such hospitality !! As a world traveler this has to be one of finest staffs of any hotel I have been to. From the housekeeping staff, restaurant ( which is awesome.. Do try the seared tuna). Smiling faces and friendly outstanding service!! I can not praise this hotel enough!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "East Bay, near San Francisco", "Title": "“Exceeded expectations”", "Author": "MusicMajor", "ReviewID": "UR122287035", "Content": "My husband and I stayed for 3 nights at this hotel in early December (visiting family in the area and then departing on an overseas trip). Our room (#631) seemed to be a small-ish, older room. However, it was spotlessly clean, with VERY comfy pillow-top beds, and Starbucks coffee. The staff at the reception desk was exceptionally helpful, sorting out some problems for us and printing out maps when we wanted to walk beyond the hotel/airport area. The small downside is that there are no other restaurants within a short walk. It took us about 15-20 minutes to walk to a small shopping plaza nearby. That said, the restaurant on-site is appropriately casual and quite acceptable. When booking, check the web site for their \"specials\". We got the \"pay your year of birth\" for one of our nights. This special is often sold out, but it pays to check!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Fantastic Service”", "Author": "reednikki", "ReviewID": "UR122233268", "Content": "My boyfriend and I stayed here Dec 20th - Dec 23rd, the shuttle picked us quickly and the driver was so nice, he gave us the ins & outs of the hotel during our 5 minute drive from the airport to the hotel. I informed the hotel prior to our trip that my birthday is Christmas Eve and that this trip was part of my birthday celebration, the manager responded back to my email informing me that she was going to upgrade us to the club level. The club level offers a full american breakfast, bacon eggs, omelets & freshly made waffles. They also provided one cocktail and one app during the evening; because of this we barely spent money on food during our stay. The room was spacious and the bed was super comfortable, the only draw back was that there was not a fridge or safe in the room. South Beach was only a $27.00 cab ride away, tip: make sure they put the meter on and not try to charge you the flat rate from the airport which is $33.00. We hated leaving the 82 degree weather in Miami to come home to 40 degree weather in philly but that's the price you pay when you live on the east coast. We are already planning our next trip back to The Miami Shearton Airport hotel", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "madison, wiscosnin", "Title": "“Exceptional service”", "Author": "35islandgirl", "ReviewID": "UR122202903", "Content": "Stayed one night between flights. Nice but small pool. 5 minutes to airport. Super friendly and kind driver. Room nice but on the smaller side. Very clean and nicely appointed as a typical Sheraton. Decent food in restaurant, but exceptionally competent and friendly service and positive energy by everyone on staff who we encountered: maids, front desk, servers, bartenders. Allowed us to check in early. Even a maintenance worker wished us a pleasant stay while walking in the hall. This speaks to strong managers and work relationships. We were very impressed. THANKS SO MUCH,,,", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Convenient to airport, pleasant stay”", "Author": "kiwigal999", "ReviewID": "UR122091945", "Content": "5 min in shuttle from airport, shuttle came along every 15 minutes. clean basic rooms with excellent friendly staff. good wifi in room on 3rd floor. business centre had flakey internet connections and i was unable to get the printer working to print my boarding pass. surprising quiet given its location at the airport", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rego Park, New York", "Title": "“Nice stay before a cruise”", "Author": "shummichael", "ReviewID": "UR122000148", "Content": "Very nice, clean and safe hotel. Near the airport with free shuttle. Here's a tip I received from the shuttle driver. If you're looking to save about 30 bucks getting a cab from the hotel to South Beach, take the shuttle back to the airport and ask the driver to drop you off the staircase leading you to the bus terminal (which is downstairs from the airport). Once you walked down the staircase, take bus 150, which is an express bus, to South Beach (You can either get off at Collins or Lincoln). Trips takes about 40 mins at a cost of $2.35 pp (exact change require as the bus driver doesn't give change out). Thus no need to rent a car nor spent about 60 bucks RT from hotel to South Beach.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lafayette, Louisiana", "Title": "“Great Hotel Stay”", "Author": "Joe c", "ReviewID": "UR121969448", "Content": "Great Hotel & Staff that do an excellent job with guest. They shuttle to & from the airport for free which is just 5 min from the hotel. Very good food at the restaurant also with a very good staff there also. All for a very reasonable price.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Beyond Expectations”", "Author": "Los C", "ReviewID": "UR121959643", "Content": "I stayed at the Sheraton for the Thanksgiving holiday and couldn't be happier. The thing is I didn't even expect the high level of service I received. The staff made me feel like I was the most important guest at the hotel, what a beautiful feeling. I really appreciated GEO ZELEDON who went out of his way to make my accomodations comfotable.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Good Airport Hotel”", "Author": "MrEdnWilbur", "ReviewID": "UR121922665", "Content": "The hotel is located less than a mile from the airport and a cab is not needed because they provide a shuttle service to and from the hotel. The front desk staff was a little slow in processing the arriving clients because they were new and being trained. The lobby was smallish but modern looking but my room decor was not. Carpeting was torn in places, wallpaper was discolored in many spots and furniture was worn looking. The company I worked for provided a lunch buffet for us and it was a decent Spanish type meal. The hotel bar was a nice place to hangout and if hungry they offer some bar type food. For outdoor activities,they provide an outdoor pool, a shuttle to the Dolphin Mall or play a round of golf next door.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Salt Lake City, UT", "Title": "“Nice views, fresh decor, convenient to airport and Miami but front desk service was poor”", "Author": "glbltrotter", "ReviewID": "UR121805674", "Content": "I generally don't like staying at airport hotels, but when I am arriving very late, and leaving early, they can sure be convenient. My expectations for the Sheraton was low - given other airport hotels I've stayed in. Cons: The front desk staff was unorganized and not that friendly - even though I was a platinum member. When I arrived at the front desk, the attendant didn't notice that I had booked a promotional rate that included an amazon gift card and some coke products, and a plush polar bear. I had to bring it up, and then he began telling me there was no notice of it in my record. I double checked my reservation online at SPG and sure enough, it was there. Another attendant immediately took over - who said he couldn't access the promotional goods right then but told me to check in again in the morning. He was a lot more helpful - I was wondering why wasn't he working with the preferred customers - the other guy seemed indifferent and defensive. When I went to get the products and inquire about the amazon gift card in the morning the attendant told me the 'room where the products were was locked and only the manger could get them' and that the gift card would be emailed to me in 6-8 weeks - not right after my stay as I understood. I told her to not bother with the drinks, but if she could get me the plush coke polar bear I'd appreciate it. I waited for 15 minutes, and had to leave to catch a shuttle for my flight - without the plush polar bear for my daughter. I didn't get my bill print out either - Not a huge deal - but I was really looking forward to taking it home to her. I spent 15 minutes the night before, and another 15 minutes the next morning to no avail. I'll be surprised if I get the amazon gift card as promised. Pros: For an airport hotel, if you are lucky enough to get a room on the rear side of the hotel, you look over a golf course and the city skyline in the distance. If you get a room at the front of the hotel you're going to have a view of a busy street, and parking garage. Also, the rooms have a fresh decor, and the hallways and common areas were clean and well maintained. This hotel use to be a Wyndam and ithe fresh and light filledd theme compared to a lot of the dark and stuffy Sheratons I've stayed in before, was a nice change. The airport shuttle was great - both the pick up and the return went without a hitch and were really quick trips. The driver couldn't have been nicer. I had early meetings and missed breakfast. When I returned to check out and head to the airport I checked the dining room about breakfast. They had just shut down, but the waiter and the greeter got me a big bowl of fruit and some juice - and couldn't have been friendlier or accomodating. Also, I noticed the pool over looks the golfcourse and river - and loked like pleasant setting if you had a little daytime to catch a little Florida sun between flights. Overall, the building and facilites and shuttle service were better than expected - especially for an airport hotel. I wish the service at the front desk was as friendly and efficient as the staff in the dining room and the shuttle. I really wanted to take home that little polar bear to my daughter and didn't have 30 minutes of limited time trying to get the front desk to honor the promotion as promised. I'm not very hopeful regarding the amazon gift card given all the confusion at the front desk.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great place to stay near airport”", "Author": "TravelerAlways1234", "ReviewID": "UR121774089", "Content": "Everything was clean and neat. The front desk staff were friendly and helpful. The restaurant food was excellent and moderately priced. Our watier, Boston, was extremely helpful and attentive. Great views of the golf course from restaurant and patio. Definitely a step above a standard airport hotel.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Nice place to stay between flights to the caribeean”", "Author": "Foster7204", "ReviewID": "UR121734695", "Content": "We were flying to the Dominica Republic and stayed here between flighhts. They have a quick shuttle from the airport, which was great! We were picked up and in the hotel within 30 minutesmof our arrival. Desk clerk very pleasant as was the shuttle driver. He was so funny, felt like we were on a tour, not just being shuttled to the hotel. The room was very commy and the bed was \"heavenly\" really, especially after a long flight! They have a great exercise facility, no charge, and everything was clean, plenty of towels to use while working out. Breakfast buffet was great, and since we are SPG members was included inour stay. Waitstaff was very helpful, coffee cup always kept full and hot. Everyone here was friendly, kind, and went out of their way to make our stay nice and welcoming. We also stayed here on our way back from our trip and this is where we had problems. Again same quick pick up from the airport, and quick ride to the hotel, quick check-in, great rooms. The only hitch was that there was confusion about room service. We even called room service the night before we were leaving, and were told to just state on the card that we were leaving early, and they would bring our breakfast at 5. Well no go. When I got up, I checked outside our door and saw that they did not even pick up our room service card. We were told that the card needed to be on the door by 2 am. I put it out by 11:30 pm, but no one picked it up. When I called the desk, at 4:45 am, I was told that room service is not open till 6, even though the card is marked that breakfast could be delivered between 5-5:15am. Our bill was delivered shortly after this phone call and the room service card was picked up, I even called room servic and left a message, but no coffee or breakfast was delivered. This was our only problem, lack of communication about room service, and I reallly really wanted my coffee. I did make coffee with the in room coffee maker, so I was not a total wreck!", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oshawa, Canada", "Title": "“A Little Tired But Has All The Right Moves”", "Author": "westerner1", "ReviewID": "UR121594868", "Content": "Staff are excellent! Our waiter (Boston) was exceptional! The airport convenience combined with a lovely new patio and bar overlooking a prisitne golf course makes this property a combination \"airport/resort\" experience. The value can't be beat!", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nova Scotia", "Title": "“Good cruise overnight”", "Author": "wanderingman09", "ReviewID": "UR121594470", "Content": "We stayed here overnight in November prior to joining our NCL cruise at the Port of Miami. Got a good price on Hotwire and found the hotel to be quiet and comfortable. It was good to be located near the airport after travelling much of the day and arriving in the evening. The restaurant was good, breakfast buffet better than the dinner experience. Sat by the pool which overlooks a golf course before leaving for our cruise. Staff were welcoming and friendly--overall a good choice of a place to stay.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bahamas", "Title": "“Nice accommodations and restaurant”", "Author": "Trinibahamamama", "ReviewID": "UR121564349", "Content": "After missing my connecting international flight home from Trinidad, which was the last for that evening through no fault of my own, I was rebooked to travel the following morning. I was given accommodations by the airline for the night at the Sheraton. Suffice to say, the experience overall was pleasant except when I returned at 4:00a.m. from an all night shopping spree at Walmart, to an empty bell desk and invisible security. I had to struggle with a number of shopping bags to my room. Non the less the few hours of rest was very refreshing . The bed was comfortable and the room amenities quite appropriate including an all white decor of the bedding. Later that morning I enjoyed a quick a la carte breakfast that I ordered in the restaurant although room service and buffet service was available. The snack at the restaurant the previous night upon arrival was also a treat. Special mention should be made of the pleasant petite female bell attendant who collected my bags and escorted me to the shuttle for transport to the airport. I should also mention the courteous bellman upon my arrival who suggested I take a taxi instead of renting a car to the department store which was only a few miles away. I certainly I will return for a stopover visit in the not too distant future.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Good choice close to MIA”", "Author": "TCSuwGA", "ReviewID": "UR121531941", "Content": "Decent choice if you need to stay near the airport. Most other hotels are on the south side of the highway. The hotel is located on the main artery leaving the airport. A few things to note: the hotel is upgrading its workout facility, making accomodations by placing fitness equipment in a make shift conference room. The club level lounge is also being rennovated, so Club level travelers make do with breakfast in the main area. The hotel, which I believe is an old Hilton or Wyndham, has been rennovated. I recommend requesting a view of the golf course. It was nice to wake up to a view of the sun rising over the course. The staff was attentive. However, if you have your own car, no that access is tricky. See the other reviews. I recommend valet (same price as self park) but give yourself extra time. Only 2 people bringing up vehicles during \"crunch time\" in the morning. Again...good choice for those seeking to stay close to MIA. Full disclosure: I am SPG Gold.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mordialloc, Australia", "Title": "“Dissapointment in Miami”", "Author": "Peter W", "ReviewID": "UR121504346", "Content": "The single biggest dissapointment about our overnight stay at the Sheraton in Miami was the almost total lack of any sort of customer service. There was one exception - full marks to Miguel in the bar; he was friendly, worked hard, listened and made a great effort to find the wine that I wanted. The rest of the staff, front desk, concierge, restaurant just went through the motions. The hotel also looked liked it could use a good clean in some places, mainly public areas, but our room was OK, big enough and had the right amenities and the Sheraton bed was heaven (as usual), the shuttle service to the airport worked well and provided us with the means to go sightseeing although the concierge desk failed to suggest that as an option and left it to us to sort it out for our selves.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tobermory, Canada", "Title": "“Great customer service”", "Author": "Stefanie H", "ReviewID": "UR121499017", "Content": "My husband and I recently went on our honeymoon and passed through Miami to get to Costa Rica. To make a long story short, we were denied entry into Costa Rica due to the expiration date on one of our passports. When we were shipped back to Miami, we booked a room last minute with the Sheraton Miami Airport Hotel. When we checked late at night we asked to speak to a concierge the following day to set up a new trip, since we couldn't get into Costa Rica. The next morning, we spoke with Alain, and he helped us arrange a rental car - even had them pick us up at the hotel! - and helped us find a resort in Key West for the week. Alain and everyone at the Sheraton made a big difference in turning our horrible honeymoon into a great one! Thanks so much for the great service :)", "Date": "December 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Gravendeel", "Title": "“Good hotel close to the airport”", "Author": "Hans-Bogaert", "ReviewID": "UR121449673", "Content": "This hotel is close to the airport and there is a hotel shuttle service every 15 minutes. It takes less then 10 minutes to get from the airport to the hotel. The hotel is conform Sheraton standards. In other words it is clean and it has a comfortable bed. The staff is friendly. Although the airport is close by it will not disturb you. There is a small swimming pool with some deckchairs if you want to sit outside and relax. From the pool you are looking at the golf court so no the view is not bad. No restaurants within walking distance. Unless you take a taxi you have to use the hotel restaurant or pizza delivery service. The hotel restaurant food is not that great but unless you take a taxi you have no real alternative. If you want to do some shopping then there are a few malls in the area you could visit. The international Mall and the Dolphin Mall. There is a shuttle service to both malls that stops at the Sheraton. Expect to be in the shuttle for 30 minutes to 1 hour. A taxi ride to Miami Beach south is $30. here you can walk the boulevard, do some shopping and have a drink or meal.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“RESTAURANT”", "Author": "Francisco G", "ReviewID": "UR121421430", "Content": "good service and very nice attend Mr. BOSTONE was very friendly with us and He did an excellent work attending us.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maia, Portugal", "Title": "“Victor Calderon and Miguel”", "Author": "Jcclavel", "ReviewID": "UR121370775", "Content": "Victor and Miguel they provide excellent service at the bar. Specially after a long trip I had. Service with a smile and a warm welcome!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Worth every cent!!”", "Author": "Saf512", "ReviewID": "UR121367396", "Content": "We were treated very well at the Sheraton. We had a club level room on the 10th floor that was very clean and satisfactory. The morning buffet was included in the price and was wonderful. We enjoyed complementary drinks and starters from the bar due to hotel construction both nights of our stay. Victor M. was an amazing waiter. We received great service with a smile. Victor went out of his way to make sure we enjoyed our stay.We would highly recommend this hotel if you want a nice clean hotel with very friendly staff. We also used the pool. It was nice, warm and clean.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Arona, Italy", "Title": "“Perfect for a short stay or if you lime golf”", "Author": "Adolphflyer", "ReviewID": "UR121311838", "Content": "Very good if you plan to stop one night or if you want to stay colse to airport. The shuttle bus is perfect. The hotel is good the reception is very well organized and friendly. The room is very clean and silence", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Great Restaurant experience”", "Author": "Stephen D", "ReviewID": "UR121306199", "Content": "We travel a lot and the hotel bar experience is as volatile as the stock market - Extreme highs and lows. Well, we luckily caught a high as the dynamic team of Victor Colclenet and Miguelito treated us to first class service - enough that we would consider no other hotel when we choose to stay close to the airport again. Their level of service was superb. We had the seared ahi and were surprised that it was as good as any restaurant we'd visited.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Sheraton Hotel”", "Author": "linda_travel_review", "ReviewID": "UR121267431", "Content": "The Sheraton hotel is very convenient for an overnight stay if you are flying/arriving at the Ft. Lauderdale airport. Shuttle Service is every 30 minutes and on time. Would not recommend the restaurant for breakfast. Expensive!!! Since buffet was too much food, opted for pastries for quick breakfast. This selection is expensive and pastries were ice cold. Better to get your quick breakfast at the airport.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Good for a short stay”", "Author": "Design123", "ReviewID": "UR121107781", "Content": "The lobby and public areas of this hotel have recently been renovated and are now very pleasant. The hotel has a convenient location right next to the car rental centre at Miami airport and from there it is easy to get into Miami and out to the Everglades to the west and to the keys to the south. The room had recently had some upgrades but the refurbishments could have gone further, the bathroom floor and tub tiling were very old. Overall the hotel was adequate and convenient for a short stay and when booked through a discount agency reasonably good value for money. The 3.5 star rating is probably correct the hotel could not be considered to be four stars. There is no sidewalk or direct route from the car park to the hotel and walking on the roadway back to the hotel is a little risky. The layout of the parking is also rather confusing and the signage not helpful. Valet parking is only minimally more expensive than self-parking and therefore I would recommend this option.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Nearest to the airport, tough to drive to”", "Author": "jfmelle", "ReviewID": "UR120875885", "Content": "I stayed at the Sheraton Miami airport for 3 nights in November as part of a business trip to the Miami area. I was scheduled to arrive early in the morning for a business meeting, so I requested a reservation for the night before to assure I could arrive, check-in and get a shower. Prior to the trip, I even logged at the SPG website and filled in information and confirmed my arrival time there (there's a field for that there). For my surprise, when I arrived I was informed that my room was assigned for somebody else because I didn't arrive the prior night. The information I filled in at SPG website was not available, as systems were not integrated (front desk information). After half an hour of conversations, a room was finally designated to me in a floor that was under refurbisihing. The room was not that clean... The room is big, and bathroom was clearly refurbished recently. Hotel has no free parking. Free wifi at the room and public areas, good speed and reliable. Hotel location isvery near to the airport, but it is very tough to drive to there from somewhere else, due to the frequent renovation on airport access and lack of update of most GPS devices.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Horrendous”", "Author": "Em2014", "ReviewID": "UR120862651", "Content": "Stayed here with my husband and miother earlier this year. The hotel was very tired, the staff were unbelievable rude (a few laughed at any requests we made at reception), the lifts looked like they were 30 years old and the corridors were old and vile. The room seemed grubby throughout and the only saving grace was the bed which was very comfortable. To be honest, the bed looked to be the only clean thing in the whole hotel! I would avoid at all costs. This hotel put us in a very bad mood before we got on our Celebrity Cruise...", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“I couldn't get out of their comfy beds...”", "Author": "Roqster", "ReviewID": "UR120839684", "Content": "I snagged a room at a great price for an over night layover in Miami. It was a shame we had an early flight because those beds were hella comfortable. Sheraton just set the new standard for hotel beds and pillows! Only complaint was that hotel is removed from downtown and other places to do stuff, but the trade off was the free airport shuttle that runs every 15 minutes.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cohutta, Georgia", "Title": "“Pre Cruise Vacation”", "Author": "Daniel P", "ReviewID": "UR120784086", "Content": "Just a note the say THANKS! The hotel was AWESOME! Everything from shuttle pickup to checkout was OUTSTANDING! The driver from the airport had a great personality. Check in was quick and easy. The room was great with a FABULOUS view. Breakfast in the restaurant was superb. We dined out on the patio in the open air. I stopped by the front desk with some questions about the area and Charlotte was very warm and helpful. I can tell by the atmosphere that most of the employees were happy and enjoyed working here. I would definitely would stay here again and recommend anyone coming to Miami area stay also. THANK YOU!", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ringgold, Georgia", "Title": "“Incredible!”", "Author": "JimRinggold_Georgia", "ReviewID": "UR120783657", "Content": "I was stunned by how incredible the movement towards excellent this property has experienced sine my last visit, earlier this year. GM David Berger and his entire team are working feverishly to build this hotel as a premier gateway hotel to the cruise lines, South America, and the world. The staff is fabulous, especially if you have the chance to meet Charlotte at the front desk, Jose, in the bellman/parking desk, or Cecelia in the restaurant. The SPG lounge is set to open up in December, having undergone a complete renovation. The outdoor area by the restaurant has been completely cleaned up and beautified with some luxurious outdoor sitting and dining furniture. The entire atmosphere of this place is just marvelous. This is my hotel of choice when traveling with Starwood in South Florida. Thanks for all the hard work, David. It is showing significant and positive results! Dr. Jim Barrett", "Date": "November 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“desaster!!!!!!!!”", "Author": "camilla5555", "ReviewID": "UR120754976", "Content": "the worst hotel...bad service,bad reception,no attention at all......the only thing that works is the valet parking.....the manager should be ashamed!!!!!!!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“*Fantastique*”", "Author": "JaneBonnieC", "ReviewID": "UR120599142", "Content": "Best hotel option if you have a flight arrival late at night. The hotel is less than a 2mins (free) shuttle ride away from Miami International Airport. The staff there are professional and curteous. And I must thank the maid who found and gave me back my camera's memory stick which I lost in the lobby....my world would've came crashing down had she not picked it up and returned it. Food was great! Had a full and healthy breakfast there. Couldn't have asked for more. Also internet is free. The rooms were nice (stayed there 2 separate times before and after the cruise) No complaints there. Definitely will book with them again the next time I'm in Miami.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Faulty Towers”", "Author": "JG200", "ReviewID": "UR120521676", "Content": "Huge lines at check in with only one staffer. In restaurant it took forever to get a menu and waiter never came back. Took shower and it suddenly turned scolding hot and I couldn't turn it off. It's probably still running. Oh, all of our TV remotes needed batteries.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia, South Carolina", "Title": "“First Class Service”", "Author": "SunSouth", "ReviewID": "UR120466154", "Content": "Our stay at the Sheraton Miami Airport was outstanding!! If you want excellent customer service you must stay at this hotel. Was there a week for an Amerijet conference and had the best experience I've ever had at a hotel. Rooms were very clean and the sleeping beds were so comfortable and the linens so crisp and clean every day. Henry the Tiki Bartender was a treasure! The hotel staff was very accommodating, friendly and willing to assist us - especially Ruben Javamillo who was exceptional and maintained such a high level of professionalism the entire time of our stay. We recommend you try this hotel - it will not dissapoint you!", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Excellent hotel with very gracious staff”", "Author": "gab11_11", "ReviewID": "UR120402870", "Content": "Excellent hotel with helpful staff. Very conveniently located within minutes of the airport. Rooms are exceptionally quiet, clean, beds comfortable, and staff are exceptional, anticipating our every need. The restaurants were excellent and reasonably priced. Stanley, the manager, made us feel like we were the most important guests in the hotel.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kingston, Canada", "Title": "“Average airport hotel”", "Author": "udo_schuklenk", "ReviewID": "UR120310547", "Content": "I have read the other reviews and wonder whether I stayed in the same hotel yesterday. The airport transfer is efficient, but do keep in mind that the property isn't in walking distance to the airport, so you need to add time to get to/fro the airport. They bumped me up to their 10th floor (Starwood Preferred guests). It's a construction site, so I had to walk over plastic sheets of some sort to get to my room. The room was typical Sheraton, I can't complain about the basics (great bed, wireless internet access reliably worked and was complimentary for a change, excellent coffee making facilities). The trouble is that the air conditioning unit is seemingly quite old, so it made sufficient noise to wake me up several times throughout the night. What's the point of staying in a hotel room over night if the aircon wakes you up all the time! They also added another unit aimed to clean the air in the rooms (they make big hay about it, so there's an explanatory card and whatnot). I switched it off to decrease the noise levels in the room just a little. I had dinner in the bar. What a disaster. The French onion soup was ok, the chicken caesar salad an unmitigated disaster. I ended up paying over 50$ for what turned out to be a mediocre meal. The wine wasn't drinkable to be honest. I agree wholeheartedly with various guests' comments on the friendliness and professionalism of hotel staff. Everyone I met (even the guy who served the lousy food in the bar) was truly pleasant to deal with and helpful as far as that was feasible. Beware, some of the buttons on the phones (eg 'Wake-up Call') are actually dead, nobody will respond when you push the button. Would I stay here again, truth be told, I will, given that reviews of the only alternative hotel in the airport vicinity indicate a much worse property.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Service, Service, Service”", "Author": "dp p", "ReviewID": "UR120295228", "Content": "My family and I stayed at the Sheraton Miami Airport before and after our trip to St. John, VI. I was expecting another shabby airport hotel and I was pleasantly surprised. The staff is excellent and we were treated very well. The pool and restaurant were very good. The service was great. We spent some time with the newly hired manager of food services, Javier, and he was excited to improve the level of food services at the hotel. I must admit that I was really impressed with everyone we met at this property. Everyone was happy. They seemed intent on making their guests feel welcome and relaxed. The highlight of our visit was Geo at the valet desk. He gave us the royal treatment by driving us to and from an off property dinner. He also rolled out the red carpet for my little girls upon our return to the hotel. They were thrilled. I am a platinum SPG member and stay in a lot of hotels for business. Our stay at the Sheraton Miami Airport made us feel special. Our very pleaseant stay was was totally unexpected. I think that Starwood has a little gem in this property and the people that work here. I look forward to visiting again sometime soon.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado, United States", "Title": "“Fabulous as always”", "Author": "Beth J", "ReviewID": "UR120211520", "Content": "I have been staying at this property now for 2 years. My most recent stay was on 11/4/and 11/5. Courtesy Van; All the men that are at the bell desk and drive the van are very friendly and accomodating. Truly professional. I always I look forward to seeing the front desk employees. Mr. Pierre, Charlotte, Miriam and Nathalie (as are all the front desk employees) are always wonderful to me when I check in. When I ask for a refrigerator or to have maintenance look at my air conditioning it is done right away. I always ask housekeeping for extra towels as I walk to my room.The housekeeping staff is very friendly and accomodating. SPG lounge. I love Ana in the morning. She always asks after my children and how I am doing. Restaurant and Bar. Wow, tonight was truly exceptional. I asked waiter Miguel Gutierez if they had corn tortilla's for the quesadillas and he asked if I was gluten intolerant. I told him I was and that Chef Frank Liberoni does keep gluten-free bread for those of us that are gluten-free. Kudos to chef Frank and Miguel for making a wonderful quesadilla on toast points for me. Then Miguel said that to call ahead in the future to let chef Frank know that I will be arriving so he can purchase what I would like to have at the restaurants to accomodate my diet. Music to someone with food allergies. Lastly, I would like to state that I was only scheduled to stay one night and woke up with the flu causing me to stay another night. When I asked Mr. Pierre if he could extend my visit one more night it was 'not a problem at all'. He also asked if he could bring me anything if I was too sick to come to the SPG lounge or lobby shop myself. I am certain that the hotel was overbooked as it often is but he always seems to magically \"make it all happen\" for all his guests and employees. I love this property because the employees make me feel at home as possible when I am on the road. You are lucky to have such fabulous people.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Central location”", "Author": "Royalfalcon1", "ReviewID": "UR120193265", "Content": "Since this hotel has undergone renovation it has become a much better place to stay. Nice rooms with special air filters for customers with allergies. Cosy beds. Aircondition is noisy.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Worldwide", "Title": "“Different MIA Hotel---More of The Same”", "Author": "ElvisPWorldwide", "ReviewID": "UR120172401", "Content": "Oooo boy, here we go---another MIA airport hotel. I should probably wise up and quit staying at MIA airport--and stop complaining about the hotels there. I've long ago come to expect the substandard levels of service and cleanliness that most MIA typify. From leftover food in my room from the previous guest, to checking into a room with someone already sleeping in the bed---Iâ€™ve pretty much seen it all at this airport. Maybe for that reason I was excited by the spiffy reviews for the MIA airport Sheraton. As my business often dictates, staying in the city was inconvenient so the airport it was. On first look, the Sheraton was clean, renovated and well thought out. Nice common areas, reception, rooms, gym---in truth, the entire property is good. I believe this hotel used to be a Wyndam so a refresh was obviously done. But despite the new look, the same service prevailed that is common at the local hotels. My first day they did not replace any towels and it took a few phone calls to get linens before I could take a shower. This was complemented by leftover grounds in the coffeemaker, no replacement of cups and amenities (club level) and an overall lack of cleanliness in the public areas. It seems every surface I looked or leaned upon had leftover food crumbs or something sticky slopped upon; the place was unkept. This was the case in the temporary club lounge and in the restaurant. The valet parking was the real treat as it look around 20 minutes each morning to get my car. Lots of chaos, lost ticket, lost car and twice brought me the wrong vehicle. Ever since somebody took the MIA airport Hilton and flushed it down the toilet, itâ€™s been a dicey proposition getting a good hotel at MIA. Maybe this is the best of the lot and I should not be so picky. As I will inevitably be back at MIA, Iâ€™ll probably end up staying here again. I just hope they replace my towels next time.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Easy to forget it's an airport hotel!”", "Author": "ccctravels", "ReviewID": "UR120096389", "Content": "The drive up on the hotel feels very much like an airport hotel but I really liked that it is on a golf course and has a nice pool/pool bar! Clean, modern and very well kept property. I also felt like the front desk was friendly and efficient..the even remembered me.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Nice Hotel, Great Location”", "Author": "ILoveToEatOut", "ReviewID": "UR120065314", "Content": "I stayed at the Sheraton Miami Airport for a couple of days on the tail end of a trip to Miami. Although this is a fairly old hotel, they have kept it nicely up to date. The rooms have been recently remodeled, and everything is clean and modern. The beds were very comfortable, and the amenities were nice (although not outstanding). The pool area is nice, and the business center is well appointed and convenient. The location is perfect for airport connections: it is literally directly in front of MIA, and less than a three minute ride over to the terminals. For early morning departures this is ideal.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Location is its best feature.”", "Author": "Theguyin4B", "ReviewID": "UR120053820", "Content": "The hotel is located almost in the airport. A free shuttle runs every 15 minutes most of the day, or you can take a quick ten dollar cab ride. The hotel is aging, and needs some refurbishing. The resturant is passable, but not outstanding. Beds and pillows are comfy but the rooms and bathrooms are small. I stay in this hotel often as it is quick, convient and relatively inexpensive. Room service was prompt and reasonable. I had a prepaid rate of $176 with tax about $200. A good value for an airport location.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "El Paso, Texas", "Title": "“Excellent hotel, excellent service...!!!!”", "Author": "Viyar", "ReviewID": "UR119968580", "Content": "The hotel is perfectly located just in front of the Miami Airport and minutes from shopping malls and freeways... The service at the front desk was more than excellent. Same at the restaurant, the breakfast (buffet) is very good and the staff is very friendly and ready to help...!!! The rooms need some minors repairs but overall they are good...!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Great Hotel 5 Mins From Airport”", "Author": "girlish_sista", "ReviewID": "UR119888968", "Content": "Fantastic hotel. Within the airport complex but the rooms were very quiet. Would definitely recommend for a stop over or if your flight is rescheduled like ours was. We booked online and saved $50 versus the price offered to us by the front desk. Rickenbackers Restaurant offered awesome food. Servings were huge and comforting! Would happily stay again if we had a connection or stop over.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Excellent facillities and Services”", "Author": "MARC T", "ReviewID": "UR119878861", "Content": "I have been staying at the Sheraton (formerly Wyndham) Miami Airport for many years. Since Sheraton took over the operation, things have vastly improved as far as service. The facilities are being upgraded, the service is very good, and the meal service in the dining room is excellent. Perhaps the biggest surprise is the friendly staff, especially Stanley :Pierre, the manager, who greets many of the guests personally. It is clear there is a new philosophy of service at this hotel, and it is personified by all employees. I travel around the world and always feel at home at this hotel. The rooms are spacious and quiet, and the exercise room is great after a long day of work or travel. It takes two minutes to get from the airport to the hotel, which is a real plus. I am willing to pay a little bit more for the Sheraton than other hotels because of the perks and treatment.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fairfax, Virginia, United States", "Title": "“Fantastic Hotel conveniently located by the airport”", "Author": "Boret1", "ReviewID": "UR119845881", "Content": "After a horrible experience in a Sheraton in Nassau, I am happy to report that this Sheraton in Miami is making me recover the faith in this hotel chain. From the moment I walked in the service was great (Thanks Johally!!) I was treated like a king, the room service was fantastic and the room was clean and comfortable. Eventhough the hotel is very close to the airport the room I stay at was very well issolated and I was not bothered by any noise from any planes. If you need to stay close to the airport or you need a great deal for a hotel in Miami stay here.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Sheraton Hotel stay...”", "Author": "Bree S", "ReviewID": "UR119756140", "Content": "Overall I enjoyed my stay at the Sheraton. I liked the fact that it was sooooo close to the Airport! I thought for the cost of the stay, it was nice. My front desk rep was really awesome!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Excellent Staff at Rickenbachers \"In House\" Restaurant”", "Author": "Brian Z", "ReviewID": "UR119755845", "Content": "Ruben J. took care of us for breakfast this morning and he not only provided a friendly and kind greeting to start our day but kept our glass full and our table well attended! I thanked him and told him I look forward to our stay....look for Ruben J. at this Sheraton because he is one of the rockstars that make travel today bearable! Thank you Ruben, God Bless!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pembroke Pines, Florida", "Title": "“Fantastic service, stylish upscale hotel, great for buisness trips!”", "Author": "Lisa1529", "ReviewID": "UR119571519", "Content": "We were so pleasently suprised by this hotel, the service was outstanding and I have never stayed in a cleaner hotel. Lots of nice thoughtful little touches, great buisness center. The valets were fantastic! The room had black out shades and a lovely king sized bed. We weren't expecting much from an airport hotel but were pleasently suprised and will stay there again if in the area again.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jupiter, Florida", "Title": "“Good for the price, easy parking”", "Author": "JaimeH_FL", "ReviewID": "UR119515250", "Content": "Nice comfy bed, close the airport, shuttles run every 15 minutes, easy and cheap parking.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gardner, Massachusetts", "Title": "“landed exhausted into hotel heaven.”", "Author": "nellpernell", "ReviewID": "UR119501897", "Content": "Quick and easy transport to hotel from airport. Great staff, efficient, helpful. Rooms were excellent, morning breakfast was very good, and then immediate access to the airport. It was a short visit and provided us with exactly what we needed, fast, perfect service, super comfortable, clean room with good breakfast and back to the airport with NO SNAGS.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lakeland, Florida", "Title": "“Great hotel - excellent service”", "Author": "barbara f", "ReviewID": "UR119452919", "Content": "My husband and I just got back from a weekend at this hotel and had a wonderful time. We were very impressed with the service level of every one we encountered, our room and the well kept grounds. Dining at Rickenbacker restaurant was excellent - not to mention the encounter we had with our service attendant, BOSTON who was professional and just an AWESOME guy", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Sheraton Miami Airport - 29th September 2011”", "Author": "Philip D", "ReviewID": "UR119449218", "Content": "I stayed at Sheraton Miami Airport Hotel on night of 29th September and want to praise the warm welcome and efficiency of the check-in process afforded by a member of the front desk team Stanley Pierre who did an excellent job. Stanley was highly courteous, friendly & knowledgeable and a great ambassador for the hotel and the Sheraton brand generally. Stay was good, sadly only a short one but I would use the hotel again if I come back to Miami airport area and would recommend to others for sure. Philip Davis", "Date": "October 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Port of Spain, Trinidad", "Title": "“Understaffed, poor customer service......”", "Author": "KwesiDapper", "ReviewID": "UR119436299", "Content": "The room was good the 1st night we arrived. I had to ask the manager to send housekeeping by the 3rd day to clean the room, it was like we were abandoned. We went out the 1st night only to realise that they were short staffed with valet, after waiting almost 1 hour we had to get our car for ourselves. When we returned our keys did not work, wen we went to the front desk we were no where on the system. They had to re-book us back in the hotel & re-issue new keys. They then said that they had to swipe my credit card again for a $200 deposit. Charlotte Sylvain has the worst attitude and should be moved to housekeeping. Thank goodness for the manager on duty, i forgot to get her name, she saved the day. I will never stay in this hotel again........", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“great stay”", "Author": "dasgfdgfdgfd", "ReviewID": "UR119416655", "Content": "had a business trip mixed with weekend pleasure and decided to stay at the Sheraton Airport- great stay, had lots of fun, superb staff and good rate. like the food/cold beer at the tiki hut out back! excellent place to stay! dave s.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Six week stay”", "Author": "Jeff C", "ReviewID": "UR119403932", "Content": "After staying here for five weeks and having a great deal of trouble receiving my mail and packages, I had the good fortune of having Raquel Maris from the front desk assist me. Seeing my frustration she assured me she would find my missing mail. After a great deal of research (during her break) she found two letters that had ended upstairs in the corporate offices. The letters were addressed correctly and had my room number included in the address. Employees like this make a long hotel stay much more tolerable.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, Kentucky", "Title": "“Great Hotel, wonderful for connecting flights”", "Author": "Kristina L", "ReviewID": "UR119357830", "Content": "This hotel really should be the airport hotel. My husband, myself and two kids stayed here on the 10th floor, when we looked out the window we could watch the sky tram go by just across the street/parking lot. Literally it is only two minutes from the airport so you can leave on the shuttle pretty much when you need to be to the airport. Customer service was great, we had help with our luggage and a quick tour of the hotel and amenities on the way up to our room. The room was great, they were a little small, but still great! It was nice the room has a robe inside with all the normal shampoos and soap with the addition of shower gel, shaving cream, and mouth wash. My only complaint was there was two sets of single serving coffee, it would be nicer to have a pot that makes two cups, but beyond that there were only enough cream and sugar for one 16oz cup, If you have two cups, let us have enough condiments for each cup :) I was very happy to have complimentary bottled water in the room, and they were drank immediately. My husband did go to get ice and the machine was out of order, other then that everything was great. And lets face it machines break down from time to time, really no biggy. I would totally stay again. We were able to get a clean room with air purifier...absolutely wonderful", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Great Customer Service”", "Author": "carlee2266", "ReviewID": "UR119296977", "Content": "I spent one night in Sept at The Sheraton Miami airport on our way to Atlantis. The hotel is a beautiful hotel but after a long flight we encounted the BEST Customer service by an employee by the name of Stanley Pierre. As a frequent traveler I must say this was the best customer service experience I have had in quite a long long time. It was a breath of fresh air since now a days traveling it is hard to find... We will return to this hotel for longer stays thanks to this wonderful experience with Stanley. Keep up the Great work !!!!!!!!!!!!!!!!!!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Switzerland", "Title": "“OK for a night,”", "Author": "cybername", "ReviewID": "UR119250236", "Content": "I spent one night at the hotel after a long flight. It was ok, but the hotel has certainly seen better times. The first room had a smell so I asked for anther one which was promptly done.The rooms are ok but dont's expect something fancy. The hotel is really very close to the airpoirt, right across the street when you exit from the car rental station. Parking is about 15$ a night. They served excellent breakfast.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Easily accessible, but parking is expensive!”", "Author": "Lee W", "ReviewID": "UR119229383", "Content": "Great hotel and facilities. Ask for a room that overlooks the golfcourse - much nicer than the highway view that you get on the other side.. Parking adds up quickly - $12 daily self park is the cheapest you can get. Breakfast buffet is extensive and great food.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Georgetown, Canada", "Title": "“airport hotel that is starting to show its age”", "Author": "petewanner", "ReviewID": "UR119179213", "Content": "this is an airport hotel that has been very well maintained - but just like me, the place is starting to fray at the edges and showing its age - little things in the room - loose fittings, chipping paint, wear spots on linens and rugs - but they still have the ability to charge full tilt including some very expensive parking front desk could not have been more helpful or pleasant, rest of the staff a bit aloof. Ate in the restaurant - really good food, but service was stand-off-ish. Watched a ball game in the bar with some fellow travelers - the servers were attentive but not engaging with the crowd The excercise room has a great view and for a hotel, well equipped", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very close to the airport great service”", "Author": "Rafaelplatino", "ReviewID": "UR119165215", "Content": "Excellent location, room very confortable, free transportation to airport and the Mall, I will stay here again", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“great stay!”", "Author": "q b", "ReviewID": "UR119121464", "Content": "Enjoyed my short stay at the Sheraton and Breakfast buffet was fabulous just as good as a spa resort Especially was waiter Bostone very personable and plesant.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Melissa went out of her way to make my stay comfortable and enjoyable.”", "Author": "Carluccibop", "ReviewID": "UR119005274", "Content": "I really want to let everyone know that Melissa gave exceptional service. I was tired and stressed from missing my connecting flight. Melissa went out of her way to look after me and pretty soon I was much less stressed and I went on my way the next day, relaxed and happy. Great hotel, great staff. Carlos Quintero", "Date": "October 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great hotel... bad lost & found experience”", "Author": "diane a", "ReviewID": "UR118999910", "Content": "Honestly, I would rate this hotel and service while we were there as excellent but unfortunately, my glasses were left in the room and they disappeared. When I called lost and found the lady was really nice and helpful, but informed me that nobody had reported my glasses. SADLY, I KNOW my glasses were left there, and perhaps room service took them.... it is unfortunate not to be able to trust that the lost and found service will work. Integrity is key and I am really disappointed.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Union City, New Jersey", "Title": "“Outstanding Staff”", "Author": "Andres G", "ReviewID": "UR118926089", "Content": "This is the hotel with the BEST staff ever. At the lobby you will be treating like a king by individuals like Stanley; and as soon as you go to your room you will be enjoying a quiet and confortable atmosphere. Following morning, as soon as you enter to take your breakfast, you will see the most outstanding staff, like Bostone and Ruben. If you are planning to go to Miami, I recommend you this hotel, and you will never regret.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Juan", "Title": "“rcasi101@gmail.com”", "Author": "rcasi", "ReviewID": "UR118886388", "Content": "I was awarded this hotel through to a bid at a travel site, but if I would had paid full price my rating will be about a 2 1/2. The price I paid was very good and I was able to overlook certain things.. I did like the stay on various aspects like service, and room cleanness. I did not like the location of the hotel and I will only recommend if only using for airport stay.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Convenient location.”", "Author": "VacationDreamer1048", "ReviewID": "UR118848010", "Content": "Hotel is located opposite where we collected hire car. Easy to find. First class breakfast - numerous variety of choices. Only stayed one night so did not fully use all facilities. Room looked towards airport and miami mover but not noisy. Other rooms had view of golf course and city skyline. Good standard of accommodation and service. Did not use hotel restaurant at night. Variety of menus in room information to arrange delivery of food to room. Clean room, friendly staff. Member of group in a wheelchair, hotel interior easily accessible, did not need adapted room so unable to comment on this aspect. Would stay at this hotel again.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "delray beach", "Title": "“Great Employees”", "Author": "ronworldtraveler2011", "ReviewID": "UR118762698", "Content": "I am writing to inform you that during my stay at your hotel, there were two employees in particular who went out of their way to assist us and make us feel comfortable. They are Johally and Torri. They are definitely an asset to your organization and a model for others re: the high quality of service possible. Our thanks to both of them. Ron Konowitz", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent value and location”", "Author": "RobertW62", "ReviewID": "UR118744064", "Content": "Stayed one night early this week at this hotel in order to catch early flight the next day. Excellent value for what I paid for. Clean room, very friendly hotel staff and very nice hotel restaurant. More importantly, from the room where I stayed, no airport noises at all. Definitely, will stay there again next time.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Lovely Service”", "Author": "ndresdow", "ReviewID": "UR118700976", "Content": "The hotel staff were all wonderful, especially Boston A. in the restaurant. Thank you guys for all your hard work!", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great location and view!”", "Author": "gsnapps", "ReviewID": "UR118695166", "Content": "My husband and I have stayed at this hotel twice in the last year and have had a great experience every time. The back of the hotel overlooks a beautiful country club golf course and a canal, so you can beat the views! I never heard an airplane, even when we stayed on the top floor. The food and dining staff were very gracious, even when they were insanely busy and we have nothing but good things to say about our rooms and the rest of the staff we encountered. Definitely worth a stay if you want to be near the airport, but rent a car if you want to explore.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Commendation”", "Author": "Rogelio C", "ReviewID": "UR118673638", "Content": "My wife and I enjoyed our stay at your hotel. Your staff was very helpful and was always willing to go the extra to ensure we were comfortable and happy with the place and service. We particularly would like to comment Staff Geo Zeledon for his extra assistance and hard work. He is very dedicated to his job and takes pride in serving all the patrons. My wife and I hope to stay at your hotel the next time we are in Miami. It was relaxing and staff are very professional. Thanks again for you services. Respectfully Rogelio and Adrian Cumberbatch", "Date": "September 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "SugarLand, TX", "Title": "“Convenient, but not up to Sheraton standards”", "Author": "DebJ14", "ReviewID": "UR118636088", "Content": "My husband and I booked one night at the Sheraton Miami Airport because of its close proximity to the airport. While waiting for our luggage I called the hotel to inquire about the shuttle. I said I was in baggage claim and the woman lectured me that the baggage level was not the pick up place and that I needed to go up to the departures area. She was very rude. The shuttle driver was very nice and came down and assisted my husband with the luggage. He called ahead to say that Starwood Preferred Guests were coming in on the shuttle. They rolled out the red carpet (literally) and put us in the SPG check in line. The woman at the desk said she was leaving and we would have to wait for someone else to check us in. Someone finally came. I was irritated when he told my husband that as SPG members breakfast was on the house when in reality we paid for the bed and breakfast package. We got our keys and headed upstairs. We previously stayed at the hotel when it was a Wyndham. It appeared that Starwood upgraded the furniture and TV and the King bed was very comfortable, but the bathroom was not clean and there was mildew on the old, worn tile.We paid extra for a room with a view, but the windows were filthy. We went down to the pool, but it was overrun with screaming kids so we just sat in the sun as far away from the noise as possible. When we returned to the room we noticed that my husband's credit card was not returned to him at check in. We found the person who checked us in and he had the card and gave it back to my husband. We did not have a car so we ate dinner in the hotel restaurant. The food and service were good. The presentation of the cheesecake and key lime was very nice and both were delicious. We also had breakfast the next morning and our server Francisco Roche from Brazil was excellent. We had the buffet, which had a nice selection, and Francisco kept the coffee, juice and water filled and we enjoyed talking with him. Francisco was the highlight of our stay at the Sheraton! We walked across the street and picked up our Hertz Car. The doorman at the Sheraton kept the key while we retrieved our luggage and checked out. The line for check-out took forever. There were only 2 people at the front desk and there were at least 5 other guests waiting to check out and at least 10 people waiting to check in. While the hotel is convenient to the airport, we probably will not stay here again.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Good Choice”", "Author": "MARC D", "ReviewID": "UR118596884", "Content": "I arrived to Miami late around 2 am just staying one night passing through was there no longer than 5 minutes when i see the Sheraton bus passing by the driver Gorge which i wont forget jumped out of the bus grabbed my luggage an said \"Let me have your luggage your on a vacation just seat back and relax\" which I really wasn't but made me feel like one. He walked me to front desk which was quite sleepy NOT A GREAT IMPRESSION! Breakfast was great not expensive at all for a Continental. Will definitely stay there again RECOMMENDED.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Carrollton, TX", "Title": "“Perfect overnight accommodations close to the Miami airport.”", "Author": "EvanC", "ReviewID": "UR118588739", "Content": "I selected this hotel after being bummed from my flight to Dallas. The price was great for the cleanliness and convenience. The hotel shuttle runs 24 hours and was the perfect solution for me to get from the airport to the hotel and back early in the morning. Most hotels don't offer shuttle service before 7. However, this hotel did which saved me on cab fare. The only issue with the hotel is location to other dining choices. There is nothing with in walking distance. The rooms were bar-none the cleansest and most comfortable. A++ to the property staff and management for making my stay there great. Tips: purchase food/snacks from the airport if you are arriving late at night. The convenience store in the hotel lobby was closed when I arrived around 10:00 pm.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Davisburg, MI", "Title": "“Sheraton Miami Airport”", "Author": "Pamelammi", "ReviewID": "UR118541435", "Content": "We stayed here two nights, 9/14 and 9/22/11. The first stay we arrived early (12:15 PM) and had to wait for our room to be prepared for 1 1/2 hours. After dropping our luggage off in our room we hurried down to have lunch in the restaurant. We did not have a good dining experience, but the chef came out and apologized, and did not charge us for our lunch. The food was good, but there were some mishaps. We did not expect him to take care of our bill, but were pleased by this. On 9/22 we arrived later in the afternoon and were greeted by the front desk clerk very cordially, and she even gave me a card to share our experience with tripadvisor.com. That evening we returned to dine at the restaurant onsite, and had an excellent experience with very good food, wine, and service. The bell staff here are very attentive and helpful, as are the valet staff. We would recommend this hotel, It is right across the street from the airport and you don't have the airplane noise in the rooms. The rooms are comfortable, and I like that they provide Starbucks coffee to help me wake up in the morning! We also appreciated having a t.v. station that showed our flight status, and there was also a display in the lobby that did so as well.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Great overnight stay!”", "Author": "donnalorrig", "ReviewID": "UR118509413", "Content": "We stayed at this hotel the night before our cruise which left out of Miami. Everything was very nice and clean. There were 6 of us traveling together, so they gave us adjoining rooms. The restaurant served a great dinner and pool area was clean and inviting and we spent several hours there. Front desk service was quick and pleasant. Taxiâ€™s were waiting right outside the door as we checked out and took us to the seaport in the morning. Although the building was constructed in 1977 is appears to have been well maintained and updated nicely. The shuttle from the hotel to the airport runs about every 20 minutes. We were glad not to have to rent a car besides. We got a great deal on this hotel via Hotwire and I would certainly stay there again if my travels take me back to Miami.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Good for a 1 night layover”", "Author": "born2go", "ReviewID": "UR118391464", "Content": "We got a very good deal with Priceline for this hotel, which is always good:) The room was smallish but certainly updated nicely, with flat screen TV and updated bathroom. I think the small bathroom would have gotten old if I was here on business for a week but perhaps some of the rooms that were overlooking the golf course were larger. Ours was a bit of a hike from the elevator, but can't complain because of the price we payed. The shuttle to/ from the airport was quick and efficient. The pool was lovely! It was heated, overlooked the river and golf course and it was a wonderful way to start the day. Breakfast was very good with nice views, although a bit pricey. One strange thing is that they included a 15% service charge (maybe because this is a business hotel??) and didn't bring the coins back after we paid cash for the breakfast, only the paper money. It was only 50 cents so it wasn't the money loss, it just seemed a bit cheeky.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Best food !”", "Author": "ana p", "ReviewID": "UR118321355", "Content": "The company I work for had a 1-week meeting at the Sheraton Miami Airport Hotel (the week of Sep. 12th) and we were all impressed with the quality of the food served. We have periodic meetings in different hotels in the city and vicinities, but nothing can be compared to the tasteful food we had at the Sheraton Miami Airport. Thank you chef and kitchen staff for the wonderful menu !", "Date": "September 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Clean comfortable stay”", "Author": "nickamc80", "ReviewID": "UR118311827", "Content": "Stayed here for one night. Hotel is nice but major complaint is location and parking. You need to drive little bit to find something to eat or for shopping. Right at the enterance of the MIA airport. Parking is very tight- need more spaces", "Date": "September 19, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "ecuador", "Title": "“they charged for parking!!!”", "Author": "cloperalta", "ReviewID": "UR118292117", "Content": "I think 15 dollars a day is too much to something that should be a service. Rooms dont have refrigerators and if you ask for one, they give you an old and noisy one!!!", "Date": "September 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Plainfield, New Jersey", "Title": "“Extremely Friendly and Helpful”", "Author": "SalCarrano", "ReviewID": "UR118250123", "Content": "During my stay there all the staff were kind friendly and helpful, however one person stood out amongst them all, her name was Sofia Lannuzzi and it will be hard to forget her. Her energy and excitement was addicting. When i arrived i asked a young lady a simply question \"Wheres a good place to eat \" ? she started naming Italian ? Chinese ? Seafood ? Steak? I replied \"Whats your favorite food\" ? Well her eyes light up as she said Sushi !!!! To my pleasant surprise sushi is my favorite food. she explained where to go, recommended some of the dishes there, and at that moment i knew she was the go to person i can go to for the rest of my stay. Now to be honest with you, the hotel is above average, however the staff will definitely keep me coming back..", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Seneca Falls, NY", "Title": "“Amazing Staff!”", "Author": "TheDarkestStar82", "ReviewID": "UR118136014", "Content": "Stayed here at the Sheraton Miami Airport Hotel and Convention Center a few months ago. I stayed here one night pre-cruise and again one night post-cruise before I flew home to New York. I was able to use my Starwood Preferred Guest points to get free stays. The shuttle was easy to catch at the airport and arrived at the hotel in just a few minutes. The staff at the front desk were super friendly and professional. I had a great room with a view of the river and nearby golf course. I loved to watch the turtles swimming around as well as the jumping fish! My room was a great size, had a large flat screen TV, and a very comfortable bed. My only complaint was the bathroom counter has a layer of dust and the floor needed some sweeping. Overall, the room was very clean. When I arrived on my cruise ship it dawned on me that I had left my bathing suit hanging up in the bathroom back at the Sheraton. I called the hotel and talked to someone at the front desk, who assured me that they would set my bathing suit aside for when I return to the hotel a few days later. When I arrived back at the Sheraton post-cruise and checked in, they had my bathing suit in a plastic bag waiting for me. I was so thankful! I was then told that it would be a few minutes for me to get into my room as they were waiting on the people in the room to check out. Well the \"few minutes\" turned into over an hour. So the lady at the front desk gave me access to the Club as a bonus. The Club was great with a variety of breakfast items, dinner appetizers, beverages, complimentary internet access, comfortable seating, and flat screen TVs. The outdoor pool area was great for relaxing in the sun and going for a swim. I did think the restaurant and gift shop/general store in the lobby was kind of pricey, but the service was excellent. I loved the bar staff. They were very friendly and made great drinks! The amazing staff is what made my stays at the Sheraton Miami Airport so enjoyable. I'm definitely staying here every time I am in Miami!", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sunset Crest, Barbados", "Title": "“Review of the restaurant staff in the new Sheraton Miami Airport Hotel”", "Author": "Karen H", "ReviewID": "UR118129416", "Content": "This is my second trip to this hotel for business purposes and I want to mention how great the restaurant staff is, especially Francisco Rocha. I remembered him from last year because he goes out of his way to please, to make you feel like he is there to meet your needs. In this day and age, it is great to find someone who really cares about his job. I can't believe that I remembered him from a year ago. The chef is also great, excellent food. Scotty (been at this this hotel for 34 years) just delivered room service. These guys really make me feel at home. Meanwhile, I had a couple minor issues with the room (remote didn't work, no room service menu). The conceirge staff went out of their way to make things more than right and took care of things immediately. With people like Mr. Rocha, Scotty, the great food in the restaurant, and the quick response to correct any problems really makes me hope that we book this hotel again next year for our meeting. Highly recommend it.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York City", "Title": "“Attractive, Super-Convenient to MIA, Great Staff”", "Author": "winebluesea", "ReviewID": "UR118095980", "Content": "Extremely happy overall experience, starting from booking. Originally booked non-refundable, non-changeable rate online. Then had to call in to change dates because of delays caused by Hurricane Irene. Eventually spoke directly w/ reservations manager, Iriana Garcia, who was more than gracious in rebooking new stay dates. I'm a basic Preferred SPG member, but she was good enough to book me onto the Club floor, where I had a very clean, roomy, '60s-stylish furnished room. The room and the hotel are clearly not new, but equally clearly they have been remodeled and upgraded and don't resemble the cookie-cutter place they probably originally were. Staff throughout the hotel were extremely pleasant, from reception to cleaning staff to restaurant servers. Breakfast was plentiful and varied, with healthy options. SUPER close to MIA, but room offered beautiful and quiet view of water and golf course with skyline beyond. Excellent value at prepaid weekend rate. Only negative: very poor speed internet connection in Club Floor lounge.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Must stay”", "Author": "Manish690", "ReviewID": "UR118069516", "Content": "We stayed at this Hotel before we headed for 7 days Cruise. We were two families. There is nice golf course right next to the hotel (excellent option for golfers). It was very nice view from the hotel room. Hotel was very clean and service was excellent.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great service, great staff, great hotel!”", "Author": "GladT", "ReviewID": "UR118039442", "Content": "Very nice hotel, the associates were very nice and helpful. The room was beautiful! The valet attendant Geo Zeledon was very helpful with our car and luggages when we were leaving. There was another male associate that helped us and went above and beyond when we arrived at the hotel. He made us feel special and I wished I knew his name. Thanks Sheraton Hotel! Will recommend this hotel to others!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "", "Title": "“Perfect hotel for flight layovers... minutes from the airport”", "Author": "robertc2k", "ReviewID": "UR117990131", "Content": "This is a great hotel for spending the night for a flight layover. The airport shuttle service runs every 15 minutes and the hotel is just minutes away. The service at the hotel has always been very good. Stanley at the check-in desk is exceptional. He is always happy to see you and takes very good care of each and every guest. Nothing fancy as far as the rooms go but for a convenient airport hotel it's hard to beat not to mention the price is always excellent. Perfect for the business traveler.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Good Value”", "Author": "Contraidentukl", "ReviewID": "UR117940571", "Content": "I booked a room Priceline. I needed a place to stay the night before my cruise left, and this option worked very well. PROS: - Clean - Quiet - Free Wifi - Free Airport Transfer CONS: - Starwood (HOT) pricing for food - Shoved into room 953 (WAY at the back) Overall, a good option to stay overnight at before your cruise. I will stay here again the next time I leave for a cruise out of Miami.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Fantastic Executive Meeting Center is perfect backdrop for Beautiful Food Presentation”", "Author": "Chucktree", "ReviewID": "UR117881622", "Content": "The warm welcome on a Sunday evening at this airport hotel set the tone for an intense two day meeting that flowed with perfection thanks to the professional coordination of the conference service manager and her team as well as our 24/7 access to one of the most comprehensive business centers ever seen. The Executive Meeting Center is one of the best with great conference tables and chairs, built-in A/V equipment and excellent support team--only to outshined by the beautiful Reception and Dinner delivered with perfection in the Ballroom, complete with a visit from the Executive Chef. I utilize many Starwood products and with confidence place this Sheraton among the top ten. Thanks!", "Date": "September 9, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“A great airport hotel”", "Author": "Laura G", "ReviewID": "UR117806587", "Content": "Charlotte Sylvain is extremely courteous and helpful at the front desk. She was my critical link in recovering my lost item. I look forward to seeing her again on my next Miami layover. L.G.", "Date": "September 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Waiter very Friendly”", "Author": "MarcosWeber", "ReviewID": "UR117723016", "Content": "excellent hotel, I recommend to Brazilians. The waiter Francisco was very friendly (brazilian guy) and it made all the difference. I will be again.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Thank you Stanley”", "Author": "wvugrad2001", "ReviewID": "UR117682137", "Content": "In my previous review, I took issue with the rude behavior of the front desk staff and Chris the bartender in the Vin Fiz Lounge and praised the customer service provided by Stanley who is a true professional. Those comments are still valid , but I want to give credit where credit is due. I just recently revisited the Sheraton Miami Airport Hotel for the last week of August and have to say that there was noticeable improvement in the front desk staff and the time spent waiting on the phone to have someone answer it. Room was clean and kept that way through the week, staff was friendly displayed a lot less attitude than my last trip. Giuseppe was a great help with my luggage both on arrival and departure. I did not venture back to the Vin Fiz Lounge, but I did enjoy the breakfast buffet at the Rickenbacker. My only suggestion would be to have the cleaning or wait staff who pick up trays after room service not let plates set out for over 8 hours as some items left behind tend to smell and it is not pleasant to walk by them.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Not sure if we would go back!”", "Author": "Rosana L", "ReviewID": "UR117516461", "Content": "The front desk staff were (mostly the ladies) not courteous, friendly nor pleasant. They wouldn't give any eye contact to customers. I felt very intimidated asking questions. It was as if they didn't have time to help us. We were booked at the hotel for 4 nights. On Day 2 of our stay, our room was not cleaned. We left the room at 11 a.m. for the Dolphin Mall, came back at 9.15 p.m. and was shocked that the room had not been cleaned. We called front desk (took ages before they answered the phone) and they did send someone to clean. We ended up waiting in the lobby for another half hour while it was being cleaned. On the other hand, the concierge, more specifically, Geo Zeledon, went the extra mile. He was very helpful in taking us by shuttle to a nearby grocery place (paid $5.00 return) to buy some fruits. He was very friendly and deserves to be recognize for his assistance.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "tokyo,japan", "Title": "“marvelous”", "Author": "chen w", "ReviewID": "UR117516008", "Content": "the lady at the front desk was very sweet plite and respectable if i can recall her name was torie ,she was very helpful too me because i am carrying child and she made sure i was accomadated with refrigeration and each time i came to use the microwave she stopped what she was doing for me .We chatted I told her i never seen her before at the sheraton she replied yes because i am a new face i've been here two weeks .for that amount of time i think that torie is a great employee at the front desk if i could recognize her more for this would.I asked her for her name she gave it to me with no problem eventhough I tried to scare her up as if I was going to make a complaint with her boss she was not scared she knew she hadn't done anything wrong.Torie is a very fast but exact and straight to the point of everything I needed to know .This hotel experience was very nice and I also was assited by a lady by the name of charol @ the front desk she was very nice to my family and I thanx these two women for providing my family and i with a great room hope to see you soon .chen-", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“LOVED EVERY MINUTE!”", "Author": "Smith143", "ReviewID": "UR117472238", "Content": "PAUL CALDERON WAS EXCELLENT! All of the staff, especially the bellmen, were very helpful and friendly as well. Guest services were immaculate! We will definitely be going back for future trips in Miami!", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Very short stay but excellent service from Front Desk Staff...resturant needs help”", "Author": "wheretoonextyall", "ReviewID": "UR117427939", "Content": "Arrived late but upon check in the over night staff was amazing....I stayed only one night(2am) on August 13 and had the most welcoming smile by the front office gentleman.......Upon my check out i visited the resturant where i recieved the worst service ever....The waiter only visited my friends and i table twice and he walked away for good.....we never saw him again.....very disappointing concidering the food was aweful as i had the margarita pizza...he returant sucks but the hotel staff is killer!!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fortaleza", "Title": "“Very close to the airport and walking distance to the rental car building.”", "Author": "GeorgeAlbuquerque", "ReviewID": "UR117361749", "Content": "Nice and comfortable room. Fast and friendly front desk staff. Great breakfast. Perfect if you arrive from a late flight. We had a god night sleep and excellent breakfast and just walked across the street to pick up our rental car. Restaurant had a great dinner too!", "Date": "August 28, 2011"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Vin Fiz Lounge”", "Author": "theflyingmango", "ReviewID": "UR117347750", "Content": "Miguel (bartender) went above and beyond to accommodate me. I chatted with him about white wine and how I wished they had a better selection at the lounge. I showed him a picture of the wine I liked. He asked if I would be around tomorrow and I replied with a yes. I honestly did not expect him to go out of his way to pick up a wine that I liked with his own money. Later the next day I got a call from the GM asking for my address to send the bottle of white wine that Miguel got for me. I was honestly shocked. Miguel was on the ball when it came to customer care. I had an issue ordering food from Chris (server/bartender) and Miguel noticed. He came right over to intervene to handle the situation. The service Miguel provided was awesome. You never expect service like this from a bar/lounge. Very pleasant surprise indeed. Thank you Miguel. My stay at the Sheraton Miami Airport was exceptional because of the excellent customer care you provided. I'll be sure to thank you properly on my next visit.", "Date": "August 28, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great service Great people”", "Author": "mintzchoco", "ReviewID": "UR117302199", "Content": "We were greeted with very friendly people at the airport as well when we arrived at the hotel. Torri, the lady that assisted us at the front desk was extremely helpful in letting us know what was available to us on the ground floor (e.g. gift shops, restaurants, bars). Overall, the atmosphere created by the employees and their services were very warm and welcoming. Definitely a hotel to choose if planning business trips or overnight stays in Miami.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Coral Gables, Florida", "Title": "“Great hotel!”", "Author": "Jenny4122", "ReviewID": "UR117298151", "Content": "We stayed at this hotel while we put in hurricane proof windows in our home. I have to stay the service was exceptional. The front desk, especially Tori, was very accommodating. My car was always waiting for me when I can down to the lobby (I just phone front desk to get it). The bathroom and rooms were clean. This was very important to me because we had our 1 year old daughter with us. We were also able to take advantage of the club lounge, where we had appetizers and breakfast for free everyday. We trust the Starwood Properties. They are the best!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Home away from home”", "Author": "D3uce318", "ReviewID": "UR117235469", "Content": "Comfortable beds, spotless rooms, and friendly staff. In the restauraunt a waiter named Francisco was extremely cordial, and helped with everything that we asked for. His service was beyond good and was intuitive. Any need that I came up with in my mind he filled without me even asking. Definitely worth the stay.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Very Helpful Staff”", "Author": "Veronika N", "ReviewID": "UR117229172", "Content": "The hotel has very nice rooms that are very clean and well kept. The staff around the entire hotel is very friendly and is always willing to help. Nicole at the front desk was helpful and very friendly about any requests we made, and Emilo was extremely kind and helpful on the mezzanine level. I would definitely come back to stay at this hotel again.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Respectful”", "Author": "d b", "ReviewID": "UR117200853", "Content": "I starwood memeber maduro loved my service from trainee tori during the stay at the sheraton,she was well respectable,funny,and placed herself into my shoes.I do recommend this hotel again for these reasons.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Loved it!”", "Author": "eht13", "ReviewID": "UR117191063", "Content": "Manager and staff were very hospitable. The restaurant staff were very nice and courteous, and didn't mind striking up a conversation with you. Also, they have discounts for breakfast. Ask someone at the front desk for a little discount card! very nice and clean, and the beds are very comfortable. Also, it is right next to the airport (and close to south beach!), so instead of taking a 25$ taxi, you can just get a free ride to the airport from the hotel shuttle, and then take a shuttle from the airport for about 3 dollars. Work out facility is good too. Highly recommend!", "Date": "August 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Solid airport hotel”", "Author": "jsantivanez", "ReviewID": "UR117008371", "Content": "Right across the street from MIA rental car facility. Very clean, no noticeable airport noise, excellent check-in service & free shuttle. Got a room for less than $60 on a bid site as well. If you have the time, it's also got a decent golf course right behind it.", "Date": "August 20, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kalamazoo, Michigan", "Title": "“Comfy, clean and excellent service!”", "Author": "lipsforchrist", "ReviewID": "UR117001278", "Content": "We stayed here while we waited for a flight the next day. The rooms were nice, the shampoo smelled lovely, and the service couldn't have been better. Everyone was over and beyond both helpful and kind to our family. The restaurant (Rickenbacker) inside this hotel was DELICIOUS! The best burger we've ever had and again, over and above service. Our only regret is that we didn't get to stay for longer.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Palm Beach Gardens, Florida", "Title": "“Great service, great food and comfy beds!”", "Author": "Marilyn C", "ReviewID": "UR116994406", "Content": "I was in town for training in the Sheraton's executive meeting center, and a company dinner. Wow, the EMC was everything we needed, fully the best training facility I have used in years! The banquet food was amazing and service staff too. My entire team felt pampered and we were able to engage completely in our training. I know we will be back.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Get location - Great service”", "Author": "joseph t", "ReviewID": "UR116984531", "Content": "I am in Miami (airport area) virtually every week for the last year and started staying at the Sheraton Airport. First because it was close but now I have gotten use to the wonderful service. The staff is very friendly and they go out of the way to make my stay work. Because of the service I even stay at this Sheraton when my travels take me to other areas of South Florida.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Montreal", "Title": "“Comfortable.”", "Author": "Coba5", "ReviewID": "UR116951321", "Content": "Very close to airport. Rooms are comfortable, however one of our rooms was kind of dusty. Parking is self service at $14/day. Need a car to go anywhere even a supermarket.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Excellant airport hotel”", "Author": "PamelaHelenEllis", "ReviewID": "UR116939876", "Content": "the Sheraton is 500 yards from the car rental centre by the airport; easy to find. The hotel was very clean and has a beautiful pool, golf course views and large inviting lobby. Free starbucks coffee :) Breakfast was excellant. We had the buffet and were served fresh squeezed OJ and had a chef's omelette prepared by Domingo (very good). Our sever was Cecelia - she was pleasant and attentive. A very positive experience - we would defiantely stay again. We booked on Westjet hotels site and got a great rate with free breakfast.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bruxelles", "Title": "“very comfortable room and very efficient staff”", "Author": "Pierre55", "ReviewID": "UR116925136", "Content": "Perfect stop over in Miami .beautifull room ,very clean swimming pool.We 'll be back next week on our way back to Europe.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "columbia, MD", "Title": "“Just bad”", "Author": "jojoearth", "ReviewID": "UR116817506", "Content": "The Good 1. I had an overnight layover and was initially impressed with the service at check in. 2. Went up to the room, nice modern decor. 3. Room had a nice view of the golf course and lake. 4. They have a free shuttle to Miami International Airport. The Bad 1. Sat down to write a phone number at the desk, someone had used the pen to stir coffee or urine. It smelled so bad and leaked all over the place. 2. Went to use the bathroom, it was extremely small and the tub had not been cleaned. Several hooks were missing from the shower curtain and the pipes under the sink were exposed and rested on the towels. 3. There was an ironing board but no iron. 4. I called the front desk to find out about printing my boarding pass, no answer. I called for 10 minutes from the hotel phone and my cell. Could not get anyone to pick up. Finally, I went downstairs to the desk only to find there were three or four people behind the counter having a good time while one checked someone in. 5. $12 for self parking? Two people came to see me and we went out for coffee instead of paying $12 for an hour or two. 6. Internet $9.99 a day. No thanks. I did not complain because I was only there for one night. This was my first and last stay at a Sheraton.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston", "Title": "“Great! Would stay again!!!!”", "Author": "jayshar", "ReviewID": "UR116772034", "Content": "My husband and I just return home today from a 4 day stay at the Sheraton. We was there celebrating our 1st wedding anniversary. They have the best hotel staff ever!! Everyone from the Shuttle bus drivers to housekeeping work their buns off to make your stay a pleasant one. Our room had a great view of the golf course, it was clean and came with a Air Purifier .Nice amenities in the bathroom. The workout center is fully equip, pool area is small but nice. The only thing stopping me from give this hotel 5 stars is the parking and the food in the restaurant.The parking was inconvenient and food wasn't very good , We would recommend this hotel and stay again!!! All hotels should have a staff like this hotel!!! Thanks everyone at the Sheraton for making us feel comfortable and welcome!!!. Hope to stay there again next year!!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“The hotel was fine, but don't trust them.”", "Author": "Jessica B", "ReviewID": "UR116763718", "Content": "My family booked a cruise out of Miami for June 2011. We drove down the day before the cruise left to do some sight-seeing and stay the night. The Sheraton was our choice because they have a place where we can keep our car while on our cruise and they had a free shuttle to the terminal. Plus the picture that you see looks nice... We were able to keep our car there like we booked ahead of time, but they had gotten rid of the free shuttle service. No one could tell me why I called two days before check-in to confirm our reservations and shuttle, and everything was fine then. They were \"kind\" enough to call us a taxi when we asked and quoted us $24, but instead, they called us a private car service which we didn't notice there was a difference until we had to pay at the ship terminal. Thanks to Sheraton, our Free shuttle cost us $80 for a 3 mile trip!!! When we got back from our trip, we hailed a taxi at the terminal and were told AND charged $15 for the ride back to the hotel to get our car. The taxi driver said that they have to charge flat fees for certain trips and ours was one of them. Also, the picture you see above for the water view Sheraton is not quite true. The front of the hotel is at the airport. The view is freeway, parking garages, and terminals. The view didn't matter to us being there only one night, but the noise was typical for an airport. The back of the hotel, which is \"sort-of\" depicted here is a canal and golf course, and not a peaceful lake as depicted here. Our room was small for what we are used to with hotel rooms, but maybe it was just because it was on the end. We were told we were given a Starwood Prefered upgrade, so I am wondering what the normal rooms are like. There were some positives... The pool was nice, they offer free use of a few computers in a common area to check email, and there is a place to buy Starbucks in the lobby.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Fort Worth, TX", "Title": "“Convenient Stopover Point”", "Author": "joeb1249", "ReviewID": "UR116530526", "Content": "I had an overnight layover in Miami and wanted somewhere close to the airport for the few short hours I would have to sleep. The Sheraton at MIA is within a five minute drive from the terminal and was quite convenient. When I got on the hotel shuttle, the driver asked if I was a Starwood member, and when I answered \"yes', he radioed ahead to the front desk that I was on the way. When I arrived at the reception desk, they quickly checked me in and gave me my room key. The room was comfortable and the staff were efficient. The hotel shuttle leaves every 15 minutes, so getting back to the airport for an early morning departure was not a problem. If i have another stopover in Miami, I would not hesitate to book the airport Sheraton.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "usa", "Title": "“more like a slightly better motel 6”", "Author": "wimpdiver", "ReviewID": "UR116488218", "Content": "The good - closest to airport, frequent free shuttle, friendly staff (but they never follow up on promises) The bad - old very poorly maintained rooms, understaffed so everything takes forever and the phone is either not answered by front desk or only answered after 30 (I'm not kidding) rings or so. No one takes responsibility to follow up on promises - staff doesn't seem to have power to correct problems and management is MIA:(", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Tokyo", "Title": "“Very Cloe to the airport.”", "Author": "Itapipoca", "ReviewID": "UR116279606", "Content": "If you're going to use the free shuttle bus, you should check the pickup place and schedule in advance with the hotel. ZERO information at the airport. And staff at the information booth is not alway there.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great Time in Miami! Thanks, Paul!”", "Author": "MDS1", "ReviewID": "UR116279296", "Content": "We arrived at the Sheraton later than expected and were tired. During check-in, we had a little delay, but thanks to Paul Calderon, it was a breeze! He was SO helpful and such a joy. We were not very happy with our room and he found us another one IMMEDIATELY! Thanks to him our stay was a pleasant one. The room was comfortable, with a great view. I'd also like to thank Armando for his wonderful valet service. He even remembered our car and got it for us in record time! We'll definitely stay there again when in the area!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Tampa, FL", "Title": "“Chaotic - Average accomodations at best”", "Author": "Vonderbach", "ReviewID": "UR116207926", "Content": "Booked this room for two nights beginning Aug 2nd. Reception and Bell service was prompt given the conditions (two children trying to negotiate access to their room without a parent?) Check in was courteous, signed up for the frequent stay program in the off chance that I ever frequent another Sheraton...who knows? Upon entering the room, I found the remote control to be unresponsive. Ordinarily this would be no problem, just call maintenance and have them come up and fix it. However, what should have been a simple call ended up being a 20 minute wait. After calling for the remote, I find I have no bar soap in my room, not even liquid soap..just shampoo and lotion. Again, not a problem. However, this required two phone calls and 20 minutes as well. The housekeeping lady was abrupt, nothing spectacular about her delivery of the soap...quite average I suppose. The maintenance man was very friendly and traced the problem to what was likely the prior guest trying to hook up something to the television. So about 30 minutes after check-in, I could finally relax. As for the room....it was just average. Standard size, mini fridge, small bathroom...nothing stood out as being extraordinary..which with the Sheraton name, I sort of expected. I should note at this point that I booked this room via Hotwire, so truth be known, I have little to complain about. The reason I review rooms is not to condemn, but because I know that hotel management reads these reviews. By sharing my experience, other guests can gauge their reaction to my troubles and perhaps report back with more positive experiences as a result. All in all I suppose I'll get a good nights sleep. I wrote this only two hours after check-in, so we'll see how I feel when I check out.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "The Villages", "Title": "“Very nice”", "Author": "skip0358", "ReviewID": "UR115996611", "Content": "Wife and I stayed there 7/20 & 7/29 before and after our vacation. Our rooms were very nice,bar and restaurant were very nice. We used the indoor parking which we found very nice. Here's a hint book the parking online and prepay we saved $50. The shuttle was clean and on time. Would deffinatly stay again!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“So much has happened - and I've only been here for an hour!”", "Author": "MiddleNameGO10019", "ReviewID": "UR115864059", "Content": "First shuttle bus whizzed by me - it looked full. After another :15 the second bus actually stopped. The driver got out and said he was full, that I'd have to wait for the next bus (with no assurance IT wouldn't be full). Made my way through the cesspool that is the Miami airport and found the taxi line. After quite a wait in the oppressive heat I got a cab - $13 ride. At hotel. This should be good. So I give my information and confirm my preferences for quiet location and all that goes with that. I said \"is it a Pure room\"? It wasn't, even though my reservation clearly states that. I ask for a refund of the cab fare. They were about to deny it (because the driver hadn't filled out the receipt) and then Stanley appears. Stanley was doggedly determined to save the day but I had been pushed too far and was ready to leave the property and go to another. Despite my protests about not wanting something for nothing, he put me on the club level and offered me breakfast. I said \"I have two full American breakfasts on my reservation.\" Alas, like my Pure room confirmation (I had the paperwork, from the booking I had made on Starwood.com), their records didn't reflect this either. Stanley persevered, showing me the hotel amenities and graciously taking my luggage to the room. He saved the moment and did so with total professionalism, a dose of empathy, and a great sense of humor. So while I wish I could give the property a four rating, here's why it's a three - the room is quite pleasant, but the a/c is a little weak for such a hot climate. I have been in on airports hotels with better soundproofed windows, but these are just good. I had trouble getting connected to the wireless internet - when I tried to call downstairs, using the \"guest services\" button on the phone, the dialing is by pulse (vs by tone) then goes to a fast busy. I had to resort to calling \"0\". And I am set up at the desk looking for a place to plug in my laptop. Nada. I love the belt line outlets offered by so many properties. While I often stay at Starwood properties, it's been quite a while since I stayed at a Sheraton. I don't know if it's the locale, the generation, or the brand, but this experience didn't stand up for an intrepid business traveler. So to be fair, the hotel is solidly good, but Stanley does deserve FIVE STARS for his awesome handling of a frustrating situation. Commendable and a level of service that we wish was the norm, but simply isn't anymore. Bravo.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Always a pleasant place to stay near the airport”", "Author": "MStangle", "ReviewID": "UR115858111", "Content": "We have stayed several times at the Sheraton Miami Airport Hotel as a stopover (from California) before flying to a Caribbean island and have always had a most wonderful stay. The Sheraton Miami Airport Hotel is the perfect place to stay prior to air travel as itâ€™s a 10-minute ride to/from the airport (being the closest hotel to the airport), has efficient shuttle service, a friendly staff and comfortable rooms. The rooms are a good size, very clean with very comfortable beds and bedding. Among other things, I was impressed with the free bottles of water that are provided in the room. The bathroom amenities include most anything youâ€™d need for an overnight stay and the front desk provides other essentials if needed. You can get room service if youâ€™d like your breakfast to arrive as youâ€™re getting ready for the day. You can print boarding passes and check real-time flight status, although sometimes the computers are occupied and sometimes the printer isnâ€™t responding. There is a business center on the second floor if thereâ€™s a problem at the computers in the lobby. The staff is very friendly and unhesitatingly offers help when you have a need. We have not eaten in the restaurant, mainly because we usually arrive past dinner-time and instead we grab a light meal in the Vin Fiz Lounge. The quesadillas here are very good and there are other tasty options on the bar menu. We have been fortunate to be waited on by Yury Fernandez who was tending bar during most of our visits. We appreciate his kind and efficient service with both food and beverages and almost feel like heâ€™s an â€˜old friendâ€™ now when we arrive. Jury is a very considerate man and is an asset to the hotel. During our last stay, we also met Diego A Comesana, who is the Food and Beverage Manager. He too was very nice and shared a genuine interest in making sure that guests were accommodated. The Sheraton Miami Airport Hotel now feels like a â€˜home away from homeâ€™. We wouldnâ€™t hesitate to recommend it as a place to stay during your stopover before heading to the airport. You will feel well rested, refreshed and ready to go after staying here! Weâ€™ll be back.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Maegenwil", "Title": "“Perfect Stay”", "Author": "Roland W", "ReviewID": "UR115850819", "Content": "A typical Sheraton Hotel, nice reception hall, clean rooms, good fitness area, good food in the restaurant. Pool has sun from morning till eveining and it's 24 hours accesible. Friendly staff and a good overall impression. This hotel is good not only for an overnight stay if you land in Miami. Good connections to nearby local attractions (Everglades)", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto", "Title": "“Airport Stopover plus a round of golf”", "Author": "SksAdvntr", "ReviewID": "UR115774118", "Content": "This was a stopover at the start of vacation, as I was waiting for my wife to arrive in town. The hotel is OK - the only reason I stayed here was because of the proximity to the airport, it was a Starwood property, and the pool looked decent. I got a very good deal, so I think it was decent for the price. My room was somewhat dated - a good size, but everything could use a refresh. I ate a dinner and a lunch at the restaurant - the food was OK, nothing spectacular. Other guests seemed to be doing a conference or a stopover like I was. The service was pretty good - had some good help getting over to a nearby restaurant to watch a basketball game (odd that I couldn't watch it at the hotel...) - and the food at the restaurant ended up being good too. The locals are friendly and happy hour was very fun. The second day, after looking at the golf course, I decided to head down for a round. Got a great deal on the golf - rentals, plus cart, for about $60 or something like that. It was twilight pricing, but I easily got a round of 18 in. The course is called Melreese Country Club or International Links Miami - and has the distinction of being the first course Tiger Woods played as a Pro, I think. I was paired up with a gentleman in his fifties and his son-in-law - very friendly. The fairways and greens were in good condition - rental clubs were decent (Tayler made Burner irons and woods). The course was not as challenging as I thought it would be - I hit in the 90s, which reflects that it played pretty easy for a mediocre golfer (high handicapper). So - if you're in the area, and not inspired to work - go hit a round. Twilight rate was a good deal, but their visitor rate is not very good for a regular round. Overall, an OK stay - hotel could use some upgrades, but proximity to golf and airport are positives. Pool looked nice too, although I didn't take a dip myself.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Nassau", "Title": "“beware of parking costs & local calls from room”", "Author": "bellabahama", "ReviewID": "UR115705009", "Content": "stayed at this hotel which was formally the Wyndham, now called Sheraton. However parking charges stay the same and very costly. each time you leave the garage and park again is more money. Hotel best for people with no car. beware of local call charges even though 786 is a shared local call with 305 area codes. I was stilled charged as long distance. otherwise great staff. beautifully kept rooms, modern styling and free business center and free shuttles.' would stay again, without a rental car.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "BRONX, NEW YORK", "Title": "“5 STAR SERVICE”", "Author": "SLTRAUGOTT", "ReviewID": "UR115651317", "Content": "From valet parking to our leaving the hotel, the two nights we spent at this hotel was beyond excellent. Courtsey was shown at all times. The room was beautiful and comfortable. The view was excellent of the river, golf course and Miami city skyline. We hope to return to this hotel to relive this experience again. Enjoy.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Decent value for a business stay”", "Author": "jbcarioca", "ReviewID": "UR115612038", "Content": "This hotel is unchanged from the Wyndham it was a year ago. It is a good option if you have a car and do not expect much. Otherwise stay someplace else.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“my son and I loved,and for shore we'll be back.”", "Author": "Leda55711", "ReviewID": "UR115594681", "Content": "We had a good time at the hotel, was nice and the service was excellent. The employees was very helpful and friendly special at restourant at breakfast time when we was served by a fantastic employee Francisco Rocha whom took the time to to answer my son 11 years questions. The Hotel Sharaton is very luck to have a exceptional employee like him, my son did't want to leave and I told to we'll be back. Thanksfor the great experience.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin", "Title": "“Best stateside airport hotel I have ever stayed at”", "Author": "DrAndyN", "ReviewID": "UR115482809", "Content": "With more than 4 million miles in the last 15 years, I've stayed at a bunch of hotels, and always cringe when I see the client has booked me at an airport hotel. Not this one - great staff, particularly Ernesto who works with planning and executing meeting rooms and events. Nice pool, good views, excellent food, good business center with free printing and faxing, comfortable sleeping room. I will be glad to return to this airport hotel!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great Stay, try it you will be suprised!”", "Author": "Nictore", "ReviewID": "UR115416723", "Content": "My family and I stayed at the Miami Sheraton on our way out of town, I was skeptical at first coming from working at a large hospitality chain and hving high expectations that is not under the Sheraton branch but to my amazment there were suprises around every corner, Location: If you are looking for close you've got it, it is a stone thrown from the airport. situation on a beautiful golf course instead of your usually airport overview from your window. Check in: We did wait but not more than 6 minutes, what do you expect from a high volume airport hotel, I think the girl at the desk was proficent, informative and genuine in our check in process. While in line the you could see the General Manager was walking through making sure all the guests were comfortable in thier wait time. Rooms: Well appointed, clean and ofcourse you cannot beat the comfort of the bed! Usually in airport hotels you do get alot of noise all night from people coming in and out, but not here, we slept like a drea. If you are going to stay I woulod suggest the executive 14th floor, the amenities in the executive club are great for traverlers and kids. There are free snacks, internet, huge tv's, a pool table and couches. It seemed to be the gathering place which overlooked the golf course and the tarmack as well. Dinner: The restraunt threw me for a loop, I had the pasta my daughter and husband had the pork and my father had the steak. The presentation rivaled something out of a 5 diamond establishment and the taste left us wanting more, you could see the others in the restruant as well were enjoying their service. The chef came around to everyones table numerous times to see if there were any questions and how everything was. I give a thumbs up to our waiter, whom i wanted to recruit for my property, his guest service interactions were seemless! Departure: As fast and efficient as one can imagine, tram was waiting when we arrived at the doors to take us on our way and the bellman was nice enough to offer us water or jiuce for our journey to the airport. Reading other reviews, it dissapoints me that people would nit pick, even the best hotels sometimes have minor issues, it is the care and genuism of the people whom shape your journey while you are there, from the girl at check in, to the waiter, general manager and chef that left a lasting impression for us to return for many times to come.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Nice pool, right at the airport, ok staff”", "Author": "occasionaltravels", "ReviewID": "UR115363276", "Content": "We had an overnight layover and the shuttle didn't take long to come by at 10pm. The lobby and room was modern and clean. The receptionist guy had some issues with our online booking and didn't really say why it was taking over 10min to figure out, and then was rude and annoyed about it. Plus I asked him for a wake up call for 5am in order to catch our flight, which never came. Luckily I had set my own alarm. The pool was nice for the hour it was still open, then we got room service which was actually cash-only, so luckily we had bills on us when the food came. Our 6am shuttle was prompt as well.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“nice people!”", "Author": "jensam98", "ReviewID": "UR115254560", "Content": "Got stuck with flight issues at 10pm on a Sunday night. After waiting for the shuttle for another hotel for 30 minutes we jumped on the Sheraton bus. Nice place, price was reasonable but I was pleasantly surprised at the great attitude and helpfulness of the staff. The folks at check in had me up to speed on what I needed to know (grill hours, shuttle times) and I had a key in hand in three minutes. Liked the flight schedule right in the lobby. Food at the grill was pretty good and the bartender was friendly. The room was standard issue with beds very comfortable. Big flat screen TV. I've not had many experiences in this general area to make comparisons- regardless this will be my go-to place next time we need accomdations near MIA. Also, the shuttle was very timely and there were more than one running during our time in and back out.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“It was a nice stay”", "Author": "NiceT60805", "ReviewID": "UR115154104", "Content": "The issues that we had with our stay was the windows were filled with a sap like substance and bugs and dust. The water when showering would not get hot unless we turned it to the hottest point then turned it off then back on again. A couple of the younger customer services reps were not attentive and failed to mention to us that we had to swipe our card to leave the parking garage so that we wouldn't be charged $14 each time that we left. They were busy conversing and joking around instead of assisting. The bed linen was DIRTY and looked as if they hadn't washed or changed it so that kind of made us a little uncomfortable. I will add that Geo Zeledon was excellent with assisting us with our arrival and departure. He assisted with our bags and car service and was very nice and helpful. The hotel was not a horrible stay and it was nice for the price. With a few adjustments, it can be an excellent place to stay. it is very convenient to the airport and 95. There is a nice view of the golf course and it has a very relaxing atmosphere. After raising our concerns with the hotel manager, they were quickly resolved.", "Date": "July 8, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newtown, PA", "Title": "“Great location next to the airport”", "Author": "relayer", "ReviewID": "UR115107684", "Content": "I got this Sheraton bidding through Priceline and it could not have been more convenient for a layover. Our plane got in around 10pm and the shuttle was no more than a 5 minute wait. With an 11am flight in the morning I was happy the hotel is located right across the street from the airport. Again, the shuttle was waiting for us in the morning. The hotel was inviting inside when entering the lobby. Staff was friendly when checking in. We stopped in the bar/restaurant for a late dinner and it hit the spot. The king room was nicely appointed and clean, the bed comfortable and it's always a plus to actually get HD channels in the room. The only minor drawback of this stay was a bathroom tub that could have used a little updating. Overall this is a good choice for the Miami Airport because of its location and efficient shuttle, even better when getting it on Priceline.", "Date": "July 7, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose, California", "Title": "“Convennient transportation and nice staffs”", "Author": "leonzhang", "ReviewID": "UR115107115", "Content": "As a SPG member, we booked this hotel for short distance to Everglade NP and Miami Downtown and Miami Beach. I'm especially grateful of the warm hospitality offered by Juan Flornce, the client manager and his colleagues. They nicely held the member room for me even I was so late to check in. I also got parking fee validation and free lounge access for the whole period of my stay. Thanks you guys, good job! Leon Zhang @ San Jose, CA", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Great facility and outstanding service for productive meetings”", "Author": "artcab", "ReviewID": "UR115012709", "Content": "DO Facilities are great to held productive meetings. The hotel staff takes care of everything so you can keep focus of your event with no \"surprises\" on the rest: rooms, food, catering, etc. Being close to the airport and offer a shuttle service is a plus for business travelers DON'T None", "Date": "July 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Providenciales", "Title": "“Disappointing”", "Author": "Jackie10101", "ReviewID": "UR115000906", "Content": "Upon Check in I was given a room at the very end of a long hallway, although I am 7 months pregnant and just arrived from a 12 hour flight. When I opened the door of my room I discovered its already being used. I had to walk all the back and request a new one. On the way to the reception I met another hotel guest that just experienced the same thing. In my actual guest room several things were missing: soap (instead the maids put the shower gel on the soap tray), the \"do not disturb\" tag, a pen for completing the hotel experience questionnaire and spoons for the in room coffee maker. Also the windows were extremely dirty. The breakfast was - apart from the big selection of fresh fruit - not very good. The pastries were of cheap supermarket quality, the cheese plate consisted of Kraft's style sliced cheeses all smashed on one plate. All in all I would have expected more from a Sheraton, it rather felt like staying at a Quality Inn.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“I Will Wait for Hotel Renovation Before Going Back”", "Author": "PAQ", "ReviewID": "UR114850072", "Content": "I have stayed at Sheraton hotels all over the world as a Platinum Level Starwood Preferred Guest. This renamed, but not yet renovated, Sheraton, needs help. It is a 1 minute shuttle ride from Miami International Airport, and I was pleasantly surprised that airplane sound was modest. I noticed a lot of airline crew stayed there. It has a large club loung with simple breakfast food and TVs and 2 computers with a printer. The hotel really needs a several million dollar renovation to be called a Sheraton. Right now it is more like a Days Inn. If and when this hotel is renovated, I expect to stay here a lot more often, especially for the $126/night rate. Front desk staff were pleasant.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“we loved it and we will be back”", "Author": "otrebor23", "ReviewID": "UR114848192", "Content": "made the trip possible by the help of Nicole very nice girl also Raquel and Henry were super, thank you for your warm hospitality. Thank Nicole for going the extra mile with us", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Port Charlotte, Florida", "Title": "“Our Oasis After the Storm”", "Author": "abrito57", "ReviewID": "UR114803335", "Content": "Iâ€™m very please with the service, hospitality and professionalism of all the stuff at this facility, they really make the difference and change my mind about the SPG program. We had a really bad experience at the facility we were before we arrive to this one and I was seriously considering canceling my membership in the program but your representative Raquel Masis with her care and professionalism make all the change in the world. I just want to give credit where credit is due. Iâ€™m very please and satisfy with all the services and all the stuff and I will definitely stay with you again and recommend you to others. I thank you on behalf of my self and my family. Regards, Adel Brito", "Date": "June 27, 2011"}, {"Ratings": {"Sleep Quality": "3", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "Caracas, Venezuela", "Title": "“front desk girls”", "Author": "VilmaMM", "ReviewID": "UR114742294", "Content": "came with my daughter and i used to love this hotel but this time the service was so bad specially the girls in the front desk Cecilia and Raquel Masis both of them need to know about how to be polite with clients, very disrespectful and rude. to work in the front desk they need to manage better their attitude because they are the first impression and the face of the brand ...and they live me a very bad one. So bad that i dont want to come back and i will not recommend this hotel i came with friends and fell ashamed because i told them about the good hotel this was and i found a very different one. The rest was Ok not Excellent but ok The guys from the bar Chris and Miguel are very nice boys you can see that they enjoy woking to give good service you should have more people like them and this hotel would be so incredible.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "5", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Caracas, Venezuela", "Title": "“Worst Service Ever”", "Author": "melaymiranda", "ReviewID": "UR114741563", "Content": "one of the reasons my mom and i picked this hotel was because of the good service we received a year ago when it was the Wyndham Hotel, and definitely we dont want to come back. First of all THE FRONT DESK SERVICE IS THE WORST EVER, the people working at the front desk are extemely rude, specially the girl from Argentina she always in a mad mood and clients get that feeling. Also several of times i couldnt go into my room there was to many problems with the key card, when i went to fornt desk the boy who was there treat like i was a criminal because there was no register of me an my mother, also one night my room( by the way my room is 829) wasnt clean and my mother went downstairs to the front desk to complain and the girl who speak spanish laugh at her face and leave her hanging so disrespectful....what a bad impression we are taking from this hotel and also the brand Sheraton, we didnt came that far ( Venezuela) to receive such a bad service. The only person who knows about culture service is Miguel from the bar, people like him knows how to treat clients from the hotel. I hope this review helps to improve the services you give to your clients. thank you Melay Miranda & Vilma Men ( Venezuela)", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sanford, Florida", "Title": "“Came for Aniversary it was great”", "Author": "dfromsvr", "ReviewID": "UR114723998", "Content": "came for a special occasion we were here for 3 nights and 3 days. Hard to find when coming for first time past it 3 times before finding the hotel. The view of our room was great the gentelman that checked us in upgraded us to a King bed viewing the golf course a beautil view of the lake with the jumping fish. He was the mangaer at the Spg line.The food in the restaurant was excellent ate there alomst everyday if not for breakfast for dinner too. Found flyers for restaurants left underneath door of hotel room, ordered from Italian Restaurant the food was not good the dinners tasted like canned food, called the restaurant to complain the gentelman was rude and hung us up. So we came back to the Hotel and went to the bar where Miguel and Chris were working, excellent they treated us great had some light food, We have been back to see both Miguel and Chris at the Vin Fiz Lounge every night since we have been here. These guys go above and beyond, spoke with the manager of the restaurant and bar too tell him how great these guys are he offered us a drink on him. So when we come back to Miami we are coming back to see Miguel and Chris they made us feel at home, we talked like we have been friends for a long time gave them our phone number for when they are in Orando to look us up. We check out tomorrow to go to Fort Lauderdale to another Sheraton for our last night before going back home. We will be back the only thing i did not like was the expensive parking fee. I work for the Sheraton Vistana Resort and the employee discount is great especially the discount for the food. Everyone at the Front Desk was helpful and the bellman was great for directions for and things to do in the area.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Fantastic Customer Service”", "Author": "Wana2", "ReviewID": "UR114686645", "Content": "After a long day in the airport with cancelled flights, the staff at the hotel went above and beyond getting us rooms for the night. We were greeted by friendly and funny front desk staff (Stanley Pierre and Sophia) who immediately saw we were having a rough day. They upgraded us and made us laugh at the same time. Chris at the bar also helped us unwind by making us laugh while providing excellent customer service. These guys all provided fantastic service, were very personable and were very appreciated.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "New York", "Title": "“Hotel really needs an update. Service is good.”", "Author": "bamydood", "ReviewID": "UR114675676", "Content": "A friendly airport hotel but the rooms are dated, tired, the wallpaper peeling in the early 90s bathroom. The place definitely needs fresh carpets and surfaces and furnishings, if you stay in a newer hotel these rooms are disappointing. Friendly service, though,and the constantly circling airport shuttle is a nice advantage.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Good: Closest property to the airport Bad: Renovations needed”", "Author": "miamiskyboy", "ReviewID": "UR114627920", "Content": "I have stayed at this hotel four times in the last 10 weeks. Overall its a nice place and you can see the progress in the renovations that are SLOWLY taking place. POSITIVE: I have come across some staff memners that are truly great. Most of those work during the day hours, but if its a PH shift the seem to be quite rude. I guess its becasue the managment is not there to supervise. The hotel is without a doubt the closest property to MIA Airport. The only other hotel that is closer is the MIA Airport Hotel that is located inside the terminal. But that property is old, outdated and over priced. So at the end of the day, this property is a better option. The hotel recenly went back to the Sheraton brand and has been going thru some updated and renovations. Most of the work being done is coming out nicley and the hotel lobby looks new and fresh. But it also looks cheap and not very upscale. Perhaps when its all done it will look/feel more plush. The beds here are incredibly soft and delicious. The rooms are also very clean. There is anewly renovated finess center and a refershing pool with towels and plenty of lounge chairs. The hotel does have dedicated SPG rooms for Elite Members as well as the new Respire rooms. Internet works very well and is provided free of charge. There is also a nice work desk in all the rooms along with an ergonomic chair in the newer rooms. NEGATIVES: The property is older and has been thru several names. In the process it has lost its identity, and so, when you walk in, you dont think \"Im at the Sheraton\" . The arrival area is busy and not very nice since there is so much cionstruction going on in front and around the hotel. The parling lot is ugly. needs painting, landscaping and better signage. The entrance to the hotel is at the moment VERY dangerous as there is construction and shutle busses everywhere trying to get in and out of the airport. If you are a tourist arriving in your rental car at night. It can be quite dangerous and confusing. The valet attendants are sometimes there, sometimes not. Do not expect 4 star service here, as valet at this hotel needs some training. I used it the first time and never again. The other times I self parked. The parking lot at this hotel is outdated and ungly. It also suffers from bad signage. It is also of an extremly non guest friendly design. As if you park on the 2nd level - you need to go to the end of tha parking lot to go in to the hotel, then go up a set of small stairs (No ramp or elevator) and then go thru a LONG and non air-conditioned corridor that runs almost the entire lenght of the hotel. Where finally you can go inside the doors that open up into the Mezzanine level. Where you can then take the elevators down to the lobby for registration. The rooms are very nice and if you get a corner room (The 02 line in particular) those are very spacious. But the ones in the middle are on the smaller side. The rooms are very ncie if you get a newley remodled room. If you dont, then the rooms look and feel like 1987 all over again, including vintage popcorn ceiling and vintage dark brown wood paneling on the doors. The bathrooms have only been \"Refreshed\" even in the newr rooms and could use a complete renovation. The tiles used to be white 15 years ago. Now they are yellow ish and have layers of scum and caucking that have been accunulated over the years... The countertops and vanity are new and very nice. With black granite and excellent lighting. The towels are also of good quality as are the amenitys provided. If you get a SPG room, they provide a nice assortment of upgraded amenitys in those rooms. Front desk agents smoke at the hotels entrance and it looks terrible. The agent that checked me in one night was smokig outside and he came inside to help me. He still smelled like smoke so bad that it made me sick. This should not be allowed. Shame on the managment here for not enforcing a non smoking policy with employees in front of guests. Lasllty. there is nowehere to eat withing walknig distance. They also do not offer 24 Hour room service. This is unacceptable in a major city like Miami, in a full service airport hotel. Lastly, they charge way to much for the food and so they take advantage of the sitaution. The breakfast buffet, for example, is $21 !!! I was at the Intercontinental Hotel in Tampa, FL 5 days ago and had a much better breakfast buffet and it was only $16. Overall the place has potential. But there is still a lot of work to be done. Stay here for the location, but not the property itself. At least not until they finish the upgrades.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent service”", "Author": "dawil41", "ReviewID": "UR114405420", "Content": "This trip was very special to me, came down for my girlfriends birthday.the hotel was beautiful great service everyone was very nice at The front desk.food was great and I want to take the time to really thank ms.nicole carmenate for making mine and my girlfriends stay extra special.my next trip to miami I will definitely book my room with you guys again.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“we enjoyed our stay and Geo Zeledon as great, wonderful guest service”", "Author": "Bam1515", "ReviewID": "UR114232022", "Content": "My family enjoyed our wonderful stay at the Sheraton. Check in process was quick and simple. Room was clean and comfortable (specially the pillows and comforter) But the one representative that truly made us feel at home, comfortable and welcome was Geo Zeledon. Geo was very helpful with providing us the instructions for parking, finding our room and mostly very hospitable to my mother that needed to take her medicine and he went above and beyond to get her her water. We also requested dinner recommendations and directions and he was very knowlegable of the area. A big Thank you to Geo Zeledon and to the Sheraton for such a wonderful stay", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Marblehead, Massachusetts", "Title": "“Great Personality and Customer Service”", "Author": "scarlettredd1", "ReviewID": "UR113926753", "Content": "I have to say that this hotel is the most unique, clean, organized, and spotless hotel I have been in quite some time. But not only that but you have 2 employees that have had a remarkable impression my sister and I. Starting with a front desk representative named Myriam Eugene. She was extremely sweet, helpful, and a very kind person to the point of going overboard to accommodate us. As well bartenders Christopher Agapay & Especially Miguel Gutierrez they offer the best selection of wine they had at the Hotel as well the food from the restaurant. They also make our stay at the bar so pleasant that we was just going to be there for about a half hour and left the bar after 3 hours . I myself Work in customer service for yrs now and it was a amazing trip for us!! Thank you so much for having such great and sweet employees.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Texas", "Title": "“Disappointed on multiple levels”", "Author": "ecoaggie", "ReviewID": "UR113865608", "Content": "Like many others, we needed to arrange \"bookend\" nights in Miami for connections on each end of our international vacation. We chose the Sofitel for the front end and the Sheraton for the back. Both were similarly priced (although the Sofitel was $30 cheaper), close to the airport and have a free shuttle. The Sofitel won the comparison hands-down. Tthe facilities at the Sheraton were not quite as nice (generic lobby, cafeteria style restaurant, dingy beer-soaked sports bar, and musty room), but the major failing of the Sheraton was the poor customer service. Perhaps we should not have stayed during a time when the NBA finals were in progress, but nearly the entire staff was more interested in watching the game than helping customers. We waited for the shuttle for a considerably long-time and then things only got worse. Check-in lines were 8 people deep because only 1-2 people were assisting guests and 2-3 were watching the t.v. behind the counter. The bellhops/concierge staff were also lounging around watching the game with the exception of one individual. He helped us with our many bags and told me the restaurant was open until 10:15 (we had been traveling all day and arrived late, tired and hungry). We briefly settled into our so-called \"Starwood Preferred Guest\" room and then went downstairs for dinner. We arrived at 10pm and the restaurant staff told us they were closed. Disappointed, we walked back through the lobby and mentioned to the bellhop that previously helped us we thought the restaurant would still be open. He said it should be and went to mention it to someone behind the front desk who looked to be in charge. This person turned away from the t.v. to listen, shrugged his shoulders and told us to go eat in the bar then turned back to the television. Recognizing that the beer-soaked bar packed with basketball fans was no place for my 7-year old daughter we dejectedly returned upstairs. After hunger won over and realizing that this hotel does not have room service, I went back down, waited a very long time to be served and then carried a plate of nachos (there were only 4 items on the bar menu) back to our room. Overall this was a completely unacceptable experience for a respected chain like the Sheraton and we will think twice before staying at their properties elsewhere. We certainly won't return here.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Overall a very nice experience!”", "Author": "LadyLER", "ReviewID": "UR113685660", "Content": "I want to commend this location for excellence in service. Upon my arrival, I was disappointed with a few staff--Ernesto, Sissi and another young lady on the wait staff for the CPA Conference. As a guest, I was in the Mezzanine Lounge, where there was food prepared for hotel visitors for a conference. I wasn't there to eat the food, but rather to relax while completing some school work. As such, one of the gentleman asked if I was with them at the conference to which I replied no, and he simply asked if I had eaten, and again I replied, no. Well, he then offered me the opportunity to eat with the group and I capitulated for after their time of eating. I was approached by the wait staff and told not to eat the food that they were readily going to throw away. I was livid, and told them that I was invited to eat there, and I'm certain that the hotel staff wasn't suppose to be there eating for that matter. I was approached again later in the day, and just got frustrated with the predjudice. I am a gold member, and it was just out of place to be treated that way. However, I promised to write for 5 wonderful people who made my stay grand, and they are the most outstanding staff that any resort hotel could employ. They are Scott Goldberg, Allen Crawford(?) Anna--the morning Guest Lounge Host, Jennifer, the Concierge, and Chris the security. I would be remisiced if I failed to mention the young man who works the 2nd Shift--I want to call him, Addi, but that may be wrong--He has a dog, lives in Adventura and cares for the guests on a more personal matter. He came at the very beginning of his shift around 2pm-6pm to always make sure things were okay with me, and I appreciate that. I also believes he works at the Front Desk. He'll know who I'm speaking of. I think this is a great location. It is very clean, quite and quaint. It has the ambiance of luxury hotel, but the softness of affordability and family-friendly atmosphere. After I experienced the undue treatment from Ernesto--more than once, I was grateful that Scott, Anna, Allen, Chris, Jennifer and the other young man at the Front Desk went out of their way to make me--as the customer, feel warm, welcomed and treated me with the respect that I deserved and, not to mention, paid for. IT IS AN HONOR TO BE ABLE TO SERVE, BUT IT IS AN EVEN GREATER HONOR TO RECEIVE/HAVE GREAT OR EXCEPTIONAL AND OUTSTANDING SERVICE.(Let me know if you'd like to use that quote for an advertisement). Those six individuals provided that type of service. Thank you, and because of them, I'll remain a member and visit again!", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Friendly staff”", "Author": "Paz95", "ReviewID": "UR113236910", "Content": "Friendly staff, good experience, great price it was a good stay:))) def coming back", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, England", "Title": "“Pubic Hair in my bed”", "Author": "ItalGrecoLon", "ReviewID": "UR112931187", "Content": "Mine was a business trip over 4 nights. The reviews here are by and large, positive. As a result, did not expect any hiccups. In hindsight, probably weighing up the comments, people tend to stay for 1 night and often, as distressed passengers via an airline. Check in was smooth and efficient. Allocated a queen sized room. The room was large and the bathroom ample. In terms of fittings, it's a concerete building that Sheraton have added their brand to. It does not bear any resemblance to a city location. In my mind, fitting with a much cheaper brand. My horror came when I noticed the sheets and pillow cases were not ironed. I pulled back the sheet to find pubic hairs. Clearly the maid service felt the last guest had stayed only a few hours and did not bother to change sheets. At the time I noticed this, it was beyond midnight and I was not in a position to call house keeping nor the front desk. The following morning I reported this to reception who appeared shocked but made a note of it. When I returned the same evening from my work, I could not guarantee they had been changed since they still did not look freshly ironed. My second gripe. The hotel offers a complimentary shuttle to/from the airport only. This is no different to any of the other airport hotels. A trip to the mall is $10 with set timings. Finally, food and beverage. $22 for a doble vodka?! Seriously ! Get over yourselves. I don't pay that at the Palmer House Hilton!!! Take a look at the cost of Smirnoff Red in a grocery store. Factor in your buying power, add a reasonable mark up, but $22?! The dinner buffet. One choice of meat. What does the pasta go with? Chicken What does the mashed potato go with? Chicken A la carte was expensive, but the food enjoyable. Breakfast : Are you kidding that you charge $3 for coffee and $4 for orange juice?!?! So : 2 eggs, 1 coffee and 1 juice = $19.00 + 15% service charge + tax = $23.56 So a family of 4 having the same breakfast, staying one night between flights would expect to pay $94.24 It's an airport hotel !!!!! I hired a car : Got to/from the malls and opened up a variety of restaurant choices in the vicinity and no doubt saved - if not necessarily in terms of $ then certainly in terms of freedom and choice. A friend came to visit me from Tampa. My friend, coming to visit a paying guest was expected to pay $18 parking. Despite contacting the front desk, this was the charge. Coming to visit a paying guest? Yep. If they stay an hour, yep - $18. I was not going to argue with the front desk, because English is my first language and I don't need someone repeating my question or responding to me like I'm an idiot. Would I recommend the hotel? If your airline is picking up the tab for 1 night - Sure. Be mindful of what lurks in your bed. If it's your choice and your $? There are other options. Would I use the Sheraton Group again? Absolutely. But not this one.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "New York", "Title": "“Will try other Miami airport hotel next time”", "Author": "StevoL", "ReviewID": "UR112706034", "Content": "Selected this hotel for its convenient location during a layover en route to St. Kitts and used Starwood points for a free night. Convenience is about the only thing the hotel has going for it. The front desk staff was less than welcoming, looked bored, didn't smile. The room was a decent size with a nice view of the golf course and downtown Miami. Bathroom was on the small side. Was planning to catch a movie to kill some time during my layover, but after two calls to the front desk to report that the \"menu\" button on the remote wasn't responding, they said they'd send someone up to the room. About 15 minutes later, the guy didn't even need to enter the room.....he simply said that their entire system was down and wouldn't be working again for 2 days. I found a stray hair plastered on the shower wall, and then upon closer inspection, found one on the ceiling. The phone in the room was obviously not cleaned because it smelled from the last occupant's perfume. Bottom line is that the staff needs better guest service training and better supervisions of room cleaning.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Rude Service from Check-in to Check-out”", "Author": "musiqtraveler", "ReviewID": "UR112007383", "Content": "The establishment is very nice, convenient to the airport, and has great amenities. However I couldnt get past the rude front desk clerks and guest services staff. I'm not from Miami, so i'm not sure if this attitude was just indicative of the people in the city altogether, but everyone i encountered who worked at this hotel just had a permanent scowl attached to their face and when I asked a question they seemed as if it literally pained them to answer. They were quite short and rude. I will not return.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Great Hotel, but a little too far from SoBe”", "Author": "TravelingTravler", "ReviewID": "UR111142641", "Content": "This is a great hotel if you're just in town for business or in between flights. The lobby features all the current departures and offers a free shuttle to the Airport. Our room was very spacious and the linens were nice and plush. They even let us check in early which was awesome. My only complaint is this is 5 minutes away from the airport, but 25 minutes from Miami Beach, without traffic... but there is usually always traffic.", "Date": "June 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "north richland hills", "Title": "“Thank you Stanley at the front desk for your excellent customer service.”", "Author": "zavvydog", "ReviewID": "UR109943170", "Content": "Nice rooms, beautiful golf course, excellent customer service.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“Great service!”", "Author": "ForrestnOdin", "ReviewID": "UR109942891", "Content": "I did not intend to stay at this hotel but due to an airline error American Air put me up here for a night after losing my luggage and more or less destroying the last 2 days of my vacation to Dominica. When we arrived to the hotel the person working the desk, Jaholly (sorry if not spelled correctly), was incredibly friendly and kind....it was such a nice change from the condescending airline people that we had been dealing with all day. I don't know if she will ever see it but thanks Jaholly for being so nice! Also the boys working the bar deserve some recognition too...they were very nice as well.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peoria, IL", "Title": "“Wonderful service: went over and beyond”", "Author": "peoriaPeoria_IL", "ReviewID": "UR109843623", "Content": "Booked 1 night stay for 11 medical professionals who were travelling to the island of Haiti for a medical mission trip. The hotel management( Iriana & Oscar) worked with our church to establish a very reasonable rate. We booked 3 rooms and due to the early flight that we needed to catch the next day, the staff allowed us to set aside breakfast for the following morning. What great service!! It was very much appreciated!!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Outstanding Service, Good Hotel, Very Happy, Can't Wait to Come Back”", "Author": "MrTravelPlus", "ReviewID": "UR109251889", "Content": "Recently, I spent a week at the Sheraton Miami Airport property. I am an SPG Platinum member, so I know my hotels. This property is very good, but the staff are amazing. The hotel rooms are renovated new, with plush heavenly beds, new carets, furniture, flat TVâ€™s, and more. The hotel has fast wireless internet, a good business centre, and free computer access. The VIP lounge is great, perhaps the high light of my trip. The room service is good! The hotel has a pool and gym. The main restaurant is good. The hotel is located within walking distance of the airport, but provides a free shuttle. I want to give special recognition to Scott Goldberg, an employee who has been working at this property since it opened in 1977. Scott really impressed me, he went way above and beyond to make our stay amazing. What I found really special is that he treats all guests as VIP, addressing them by name, giving them respect, making them all feel comfortable and at home, and tending to the needs of all guests on a 1 on 1 bases. He deserves an award. In our book, we give him the â€˜summa com laudeâ€™ award, latin for â€˜with highest praise and honourâ€™. Thank you Scott Goldberg, I can hardly wait to come again. You are the reason why I stay at SPG Properties, you are the reason why I am Platinum, You are the reason why I own stock in Starwood Preferred Guest Corporation. Respectfully, Dov Erlichman SPG Platinum", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Clean, Comfortable, Close to airport - and Several staff went above and beyond to help us!”", "Author": "LoeFlyer", "ReviewID": "UR107966179", "Content": "We chose this hotel because it was convenient to return the rental car the night before our 7am flight and take the hotel shuttle in the morning. We will return because two staff members went out of their way to help make our stay more comfortable. Mr. Uriel Caro is a Housekeeping Manager who really knew the layout of the property, and made several recommendations of rooms that would be comfortable for us, staying just one (short) night with small children. We had arrived at 10pm with a week's worth of luggage and exhausted kids. Gustavo, one of the bellmen, was not only able to get our bags to the room quickly, but even led me back to the rental car facility in the hotel van and waited while I returned the car, giving me a ride that saved me from walking back. It's not a long walk (which is why we chose the hotel in the first place!) but it was late at night, I didn't know where I was going, and I had to be back at the airport in 6.5 hours. Both of these men went above and beyond to help out a tired traveler. They really made me feel like a guest!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bardonia, New York", "Title": "“Pleasant and Welcoming and Definitely Worth Re-Visiting”", "Author": "BookLady30", "ReviewID": "UR107589021", "Content": "My husband and I spent two days in this lovely facility. The room was very large and luxurious. The bathroom and bedroom were spotless. Its location is not only convenient for the air traveller but fifteen minutes away by car from the city of Miami. After a day of touring, it was delightful to return to the hotel. We stayed on the club floor so the club room was accessible to us. It was a large beautiful room with a friendly and accommodating staff. My husband has a gluten allergy and both Anna R. and Scott G. could not do enough for him. They made special trips to the kitchen to find food that he could eat. We felt sorry to leave and will make a point of staying in this hotel again on our next visit to Miami.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Hotel is average, Meeting Manager was AMAZING.”", "Author": "ahoward_siu", "ReviewID": "UR107129648", "Content": "Stayed at the hotel for a conference and student competition. The hotel was average. A bit dated and worn. Noisy location next to the airport. However, I was responsible for organizing a full day compeititon utilizing the food service and PanAm ball rooms. Several hundred college students were in attendance and we required a very strict schedule. Ernesto (I unfortunetly don't have his last name) was AMAZING. He was a main contact at the hotel and bent over backwards to make sure we had everything we needed. He went above the call of duty in making sure every detail was taken care of. He was friendly and always upbeat. The event went off without a hitch in large part do to his cooperation. He is a true gem in the hotel managment industry. He deserves a raise.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Tampa, Florida", "Title": "“Not easy to get to by car but nicely updated hotel”", "Author": "AdProMan", "ReviewID": "UR106802717", "Content": "I recently stayed at the Sheraton Miami Airport for a conference. It was not easy to get to the hotel by car but if coming via the airport it is a breeze, literally just across the street with round-the-clock shuttle service. Once I arrived at the hotel the valet service was outstanding. Since I had brought lots of materials for the conference, they were very helpful getting it all unloaded and delivered to the right places in the hotel. Thanks Giovanni. Inside, the hotel is nicely refurbished and the new furnishings and color schemes are very clean yet comfortable. The conference area is very nice. Every meeting room has sound, lighting control and AV controls built in. They only have one main ballroom but it was just the right size for our group. The guest rooms are a little tight but very comfortable. The desk in my room accommodated all the various devices I brought with enough power outlets for all. And lastly, this hotel is next to the airport but it seemed quiet and it backs up to a beautiful golf course so the pool overlooks the beautiful greens with a view of the Miami skyline beyond. We had a great experience at the Sheraton Miami Airport.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "West Indies", "Title": "“Actually at a walk-able distance!”", "Author": "Verinagra", "ReviewID": "UR106392734", "Content": "My husband and I stayed there for one night. We landed in Miami around 8PM and had to leave for Houston on a 7.45 AM flight. It is an excellent location for travellers between two legs of flights. Room size is reasonable. There is free internet in rooms, complementary shuttle to airport and back, every fifteen minutes. We did not experience any noise, a common problem with airport hotels. Breakfast was included in the room charges but we could not take it as we had to leave before bâ€™fast time. Considering they are dealing with new people checking in and out constantly, the staff was very friendly and helpful. The dining room staff was a little uncooperative. We went for dinner at 9PM. We were offered both options buffet and â€˜a la carteâ€™. We had a vegetarian friend with us. He could not find any thing suitable on the menu, so said would go for the buffet. There was vegetarian soup, salad, rice and desert, but there was no vegetable entree. He requested if they could make an omelette for him. The head waiter said the kitchen was closed, so they couldnâ€™t. I wondered how he had offered an â€˜a la carteâ€™ meal in the first place? Buffet food was just OK.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Pleasurable experience”", "Author": "thorfl", "ReviewID": "UR105975731", "Content": "I had been staying at this hotel quite a bit when it was The Wyndham. In January 2011 Sheraton took over. In March 2011 I stayed there and was disappointed in the changes I had experienced and one aspect of the service. I had contacted the General Manager of the hotel and expressed my displeasure. Upon my return in April I was quite surprised with the service and changes. It appeared he had taken my previous comments and had them corrected. My most recent experience was memorable and I will return to the facility. It is clean, has a very nice fitness center and the staff was very cordial. Two individual that stood out were Scotty who has worked at the hotel since it had opened many years ago and Charlotte (at the front desk).", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Roseau", "Title": "“great location and great staff”", "Author": "Toutpartout", "ReviewID": "UR105850381", "Content": "use this hotel for businees travel quite a lot. Staff are very helpful, from the restaurant staff to the valet and concierge ( Geovanny Zeledon) , everyone goes the extra mile. The way back from the car park is not that well lit and I walked into a glass door face first on one stay. Like the monitor with all the flight departure times in the lobby . All in all, a great airport hotel.", "Date": "April 27, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "NorCal", "Title": "“Suprised by value and amenities. Great Staff...what a room”", "Author": "stevenli9999", "ReviewID": "UR105373937", "Content": "This former Wyndam didn't disappoint. Family trip this time. Great staff at checkin. This Sheraton has Club lounge and they are worth every penny. Being close to the airport, there's a lot of turnover traffic with day stays and cruisers, so the lobby can get busy at times. Being SPG members helps since they maintain the SPG Gold/Plat line specifically, unlike some other properties. The room was spetacular. The beds are better than 'heavenly'. Completely supportive with individual springs so the kid's movement didn't bother at all. Plush pillows abound (4 per bed!). We had a Pur room which had an air purifier in it. Wow. Very nice touch and appreciated from my allergy prone kids. Didn't hear a plane either. The sound proofing was done very nicely. Anyone in Miami can tell you the flight path goes right over the hotel....yet only time we heard a plane was walking outside. Pool: kept extra warm....a little bit too much, but the kids loved it. Good views of the golf course and peripheral canal--which had jumping fish no less to entertain the kids. Garage: a bit of a walk, but covered and goes to the messanine level, bypassing the lobby (nice touch). Park on the 2nd level to minimize steps (4 steps) on the luggage. The parking system is a bit of PITA as it kept losing the coding on the key to let us in/out. They are used to it and the valet attendent comes running down the ramp without 30sec to assist. Extras: WiFi: free. Nice touch for a Sheraton. Fast too. Complimentary water in SPG rooms. Again, the staff is superb and friendly. Access: Road construction stinks--thanks to Miami's 10+ year airport white elephant. Best way to get here is via douglas rd (NW 37th Ave). Avoid Le Jeune unless you want to add 10min to get here. Truely an enjoyable stay and pleasantly surprised for the Level 3 SPG hotel....this could easily be Level 4 with the service and amenities.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Great staff”", "Author": "Calina1", "ReviewID": "UR104587306", "Content": "The Hotel has a great location, conveniently close to the Airport. The Shuttle bus was great. We want to thanks specially Geo Zeledon! he referred us to great locations for food and places to visit, excellent prices, also helped us to get a car rental, he actually arranged himself a good price for us!. Front desk people were not too friendly as everyone else at the hotel. The room was clean and provided all the amenities, clean towel, shampoo, etc.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Poor housekeeping”", "Author": "rlcruz_cedeno", "ReviewID": "UR103835795", "Content": "Housekeeping did not replenish soaps, shampoos, conditioners etc. They also either threw away (or stole) a very expensive personal higiene product that was half full. When called to inform, it took over 1 hour to get someone to bring the items not replenished. I had to go down personally and talk with the Front Desk clerk after the 1st hour passed. On another note, and not the hotel's fault but getting to the hotel from the city is extremely confusing.", "Date": "April 12, 2011"}, {"Ratings": {"Overall": "4.0", "Service": "4"}, "AuthorLocation": "Hollywood, Florida", "Title": "“Exceeded My Expectations”", "Author": "edexter", "ReviewID": "UR103512871", "Content": "I returned from a business trip last week and went to the Sheraton Miami Airport Hotel garage to get my car. I use their parking facility anc shuttle when I fly from MIA. Had some trouble with my car. While explaining this situation at the front desk, Stan Pierre of the Guest Services department overheard me and offered to help. He exceeded my expectations. He exudes the spirit of hospitality. Needless to say I will continue to use this facility.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Fantastic Service!”", "Author": "sfischburg", "ReviewID": "UR103207400", "Content": "When clients are impressed, it makes my day! Bell staff were stand outs. They help to make this hotel exceptional.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kent UK", "Title": "“Great Beds!”", "Author": "malcliz", "ReviewID": "UR102826674", "Content": "We stayed here for one night before our cruise after flying into Miami from the UK and at the end of our cruise we had a day room before our flight back. The thing that makes this hotel stand out, as others have said in these reviews, is the extremely comfortable beds â€“ probably the most comfortable bed we have ever slept in! We had a very pleasant view over the waterway to the Golf Course and during the day we had a relaxing time by the pool on the sunbeds, swimming and reading. The staff were very pleasant and we enjoyed breakfast and lunch during our two stays. There was also free internet access either on your laptop or on computers in the lobby which was great for catching up on emails before or after a cruise or for checking in online. The only negative point we found is that the bar by the swimming pool was closed when we spent the day at the hotel and the main bar was also closed so there was nowhere to buy a drink before lunch before going into the restaurant. There is a shuttle to and from the airport which only takes a few minutes and the driver was very helpful. Would recommend this hotel (and particularly its beds!) for a restful day either before or after a flight.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Amazing Hotel- Saved our Sanity!!!”", "Author": "GraceAdlerDesigns", "ReviewID": "UR102751933", "Content": "We were stuck in Miami after the fuel fire and thought we were going to have to sleep in the airport for two days. After exhausting all options and on a whim, I found my SPG card, called the Sheraton at 3 a.m. They booked rooms for that night and told us to take the next shuttle so we could at least rest in the clean lobby until the rooms were ready. When we arrived, they'd opened the rooms for us and we were able to get some much needed rest! I may be biased because, previously, we'd had two rooms at another subpar local \"boutique hotel,\" but the beds were heavenly, the staff was great, The bar was our only dining option the next night and the staff seemed a little overwhelmed and service was spotty. However, the manager comped us a bottle of wine to make up for this. The main restaurant was ok, but we'd been eating hotel and airport food for a week, so we very sick of it. Also, loved the free Wi-Fi and the pretty pool with the Tiki Bar and large lounging area! The only critique I have is that some of the furniture and counter space was dusty- I think that we were put in rooms held for and leased by the airlines that are used infrequently. Overall, we had an absolutely positive experience with this hotel!", "Date": "April 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "5", "Service": "4", "Location": "5"}, "AuthorLocation": "Sussex", "Title": "“We had a day room”", "Author": "jennywrenSussex", "ReviewID": "UR102733025", "Content": "We were given a day room voucher for this hotel as part of our cruise package. We were given a room on the 10th floor with a view over the golf course. The room was spacious and well appointed with coffee maker and excellent bathroom complete with toiletries. We had lunch in the restaurant which was pleasant and spent the afternoon on loungers around the pool. The hotel does run a shuttle to a shopping mall 8 miles away which would have been good but due to the lengthy process getting through US customs on leaving the ship we didn't have time to use it which was a pity. There are no shops near to the hotel at all. Free internet access in the lobby enables you to check in online and print your boarding pass. A free shuttle runs every 15 minutes to the airport which takes just 5 minutes so this hotel is an excellent choice for an overnight on arrival in Miami or as we had, a day room prior to an evening departure.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ringgold, Georgia", "Title": "“Good hotel and getting better with a super staff!”", "Author": "JimRinggold_Georgia", "ReviewID": "UR102581343", "Content": "This hotel started as a Sheraton property, but was, for the past ten or eleven years, a Wynham hotel. Sheraton is back in and the hotel is definitely up and coming. There are some major renovation plans on deck. But the staff is what makes this hotel. Scotty in the SPG Sky Lounge is awesome! He has been with the hotel for many years and is a wealth of helpful information and conversation about Miami. He is so helpful and friendly. GM Barger has a good team assembled and the convenience to the Airport and the Tri-Rail is perfect. This is definitely my hotel of choice when cruising out of Miami or Ft. Lauderdale, or heading to South America.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“DO NOT STAY HERE - this place almost ruined my vacation!”", "Author": "cartmikk", "ReviewID": "UR102466479", "Content": "Their service level is definitely on another level of TERRIBLE. This Sheraton did the unthinkable - they CANCELED my Starwood \"friend discount\" reservation and sold it to someone else (for money) and did not even notify me! I found this out only because my friend (the actual Starwood employee) wanted to double check the status of my reservation...2 DAYS BEFORE MY ACTUAL STAY. My friend was furious - this hotel is being written up with corporate as I speak. When I actually checked in, my friend who booked a 2nd room on her own almost lost HER room too because they lost HER reservation somehow! Then they said there was no proof of payment, and she had to dig through her bank statements just to prove that she did. But here's the real kicker: after all that drama was over, they charged THE WRONG PERSON'S CREDIT CARD when we checked out. They charged my Starwood employee friend's card instead of me. Then, when they tried to reverse the payment, they had to ask me for my credit card info again because they LOST the one that was supposed to be on their file. How can they have so many mistakes for one room in one weekend???! Unbelievable. This hotel seriously almost ruined the entire trip for me. Did I mention their location is horrible, cab service is very slow, and even the ATM machine was broken??? Please do us all a favor and do not stay here....staying at a trashy, run-down hut is better than staying here.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Excellent!”", "Author": "janine0802", "ReviewID": "UR102255927", "Content": "My boyfriend and I went to Miami for a music festival. We chose this hotel based on the reviews/price per night/overall value we anticipated getting. We really enjoyed our stay here! The manager, Tony, greeted us upon arrival and was very personable. We ate at the restaurant for lunch 2xs and had room service 2xs as well...good food. The room we had was on the \"Club Floor\", the top floor of the hotel. Worth the $10 difference per night from a standard room. Upgraded amenities, very comfortable bed, great view of golf course. Had Starbucks coffee you can make in the room. Everything was super clean. That floor allows access to a VIP-like room with free breakfast and evening time prepared food, snacks/beverages, pool table, and computers 24/7. Bottled water was free in the hotel room and in that Club Level room. I thought for Miami, this was great value for the money. Right next to Miami airport and has free shuttle that takes you to/from airport...then you can pay $2.50 for a shuttle that goes to the beaches all day. Would definitely recommend!", "Date": "March 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Springfield, Ohio", "Title": "“Nicole Carmenate is a superstar”", "Author": "aa548098", "ReviewID": "UR102203141", "Content": "This hotel has changed names in the last year. Once a Wyndham now a Sheraton. Many of the folks that made this a great stay close to the airport have stayed on and now work under the Sheraton Brand. Nicole Carmenate is one to those. Over the last month she has always been a smiling face ready to help anytime, not only for myself but all of the many travelers I have watched her take care of. Nicole along with many of her coworkers is the reason that I will continue to stay at this property in the future.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "texas", "Title": "“Great service in every dept.”", "Author": "schmoov", "ReviewID": "UR102094626", "Content": "Stayed here while attending the Sony Ericcson Tennis Tournament. Front desk staff went above and beyond to help me find info about accessing a shuttle to the stadium. Staff at the restaurant, especially Claudia (our waitress) provided consistently top notch service and hospitality. Very pleasant stay, made so by great people.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coral Springs, Florida", "Title": "“A resort hotel disguised as an airport hotelâ€�”", "Author": "joeb526", "ReviewID": "UR101897949", "Content": "Stayed at the hotel to meet a client who was flying in for the weekend from the North East. The hotel is literally on the door steps of the Miami Airport. I picked this hotel because it is conveniently located to Coral Gables which is so diverse in restaurants and night time entertainment. The hotel provided complimentary shuttle service to and from Coral Gables which was a huge convenience for us. I also wanted something right outside the airport that didnâ€™t feel like we were staying at the airport. The hotel has a great outside pool area over-looking a golf course, river and the skyline of Downtown Miami. The pool area has a tiki-bar with a heated pool that we took full advantage of. The staff also was very attentive to our needs including the execution of a beautiful amenity left in my clients room.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Jose", "Title": "“Nice Rooms, nothing nearby, whatch out for your stuff in the room”", "Author": "traveler1007", "ReviewID": "UR101387890", "Content": "It was overall a nice and clean hotel with comfy beds and ok food. But you should definitely watch out for your stuff in the room. I lost a ring that conveniently showed up in the most awkward place when I called to complain, and another co-worker lost a pair of shoes that never showed up. And the location is very close to the airport but nothing else whatsoever. No restaurants, pharmacy, etc. nothing.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Halifax, Canada", "Title": "“Great Hotel”", "Author": "elizabethmacdonald", "ReviewID": "UR101259519", "Content": "I used to stay at this hotel 2-3 times a year when it was a Wydham and it was the best hotel. It just changed to a Sheraton and I hope during the switchover they kept the same staff, the same customer service levels, the same ambience and the same beds/rooms. The valet and bell staff here were the best (extremely friendly, professional, helpful, efficient) and what impressed me the most was that even though I stayed here only 1-3 times a year some of them would remember my name from year-to-year. Great staff can make or break a hotel and these staff set the bar high. The beds were super comfortable and clean and the food in the restaurant was really good. This hotel was so good (as a Wyndham) that I once had business on Miami Beach during spring break and didn't want to deal with the spring break crowd and party atmosphere that instead I stayed at the Wyndham Airport Hotel and commuted each day instead just so I was guaranteed a great hotel.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Over-priced, dirty, and outdated”", "Author": "darrena77", "ReviewID": "UR101067492", "Content": "How does this place have 3-1/2 stars? There was no soap in our room, 1/2 a roll of toilet paper with no extra rolls and too many hairs in the bath tub to count.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice Hotel but poor after sales”", "Author": "ChrisF83", "ReviewID": "UR100147113", "Content": "I held a conference at this hotel where we had 50 attendees. The rooms were nice and clean if a little basic. The staff were very friendly and helpful throughout. After the event the service was very bad. I have been trying to get i contact about missing Starwood points for spending thousands of dollars at this hotel and I have had no response despite a number of reminders with false promises of 'looking into it'. I have complained but had no repsponse!", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guernsey", "Title": "“Best bed I have ever splept in!”", "Author": "TheMissingLink66", "ReviewID": "UR99933592", "Content": "I stayed at the above hotel the night before I joined a cruise ship. There was a courtesy bus from the aiprort straight to the doors. The reception staff (especially Miryam) were fantastic. The rooms roomy with all the amenities you would require. The bed was out of this world! SO SO comfortable (when i mentioned this to the reception staff they informed me I could buy it from the Sheraton on line shop - what a great idea!) We had dinner and breakfast there (both buffets) and had use of the pool an sun chairs. I would highly recommend this hotel to anyone stopping off in Miami.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bowie, Maryland", "Title": "“So outdated”", "Author": "TraceyK66", "ReviewID": "UR99147470", "Content": "Very expensive for an outdated hotel. I wish I had paid more and stayed somewhere more pleasant, the staff couldn't even cope with merging two bookings for consecutive nights! Nightmare to get in and out of if you are driving, avoid it if you can", "Date": "March 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Truckee, California", "Title": "“Nice hotel, horrible bar service”", "Author": "mcarter68", "ReviewID": "UR98957028", "Content": "I stayed at this hotel due to a 6am flight and they have 24 hr shuttle service. Check-in was a little slow as there was a large group ahead of me, but I was pretty happy when they upgraded me to the club level due to SPG Gold status. Rooms on the Club floor are pretty comfy. There are no nearby restaurants but the bar is open and serving food until midnight, so I stopped in for a bite to eat. I sat at the bar, which was about half occupied, and waited 15 minutes for the bartender to acknowledge me. I ordered a drink and a club sandwich. 35 minutes later the sandwich was nowhere to be seen and the bartender had disappeared. Meanwhile two guys next to me sat down, ordered wings and were half way through eating them. Finally got a lukewarm sandwich and cold soggy fries after 40 or so minutes. No apology or anything. Just a guest check with 15% gratuity added on. If you stay here, eat dinner before you arrive! Bottom line is this place is ok if you need a place near the airport but nothing special and there are much better places for less money.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tunbridge Wells", "Title": "“An ideal airport hotel, popular with aircrew”", "Author": "johnbursby", "ReviewID": "UR98463636", "Content": "Stayed for one night en route from Lima lo Heathrow. I found the Sheraton Airport Miami to be one of the few airport hotels anywhere with both character and a regular clientele. Due to my own oversight I had booked the wrong night. However the staff at reception were just superb...particularly Miriam (Manager please note) and a room was soon sorted out. The bar had a friendly atmosphere probably due to the many regulars. My meal in the restaurant was delicious. All in all a very good stay, but the hotel (like me) is starting to show its age and perhaps the Sheraton bean counters could make provision for a make over in the near future.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Conference Professionals”", "Author": "Makes_Me_Wonder", "ReviewID": "UR97643555", "Content": "I work for a fairly large international organization and we recently held a 10 day workshop at the Sheraton Miami Airport Hotel. It was virtually headache free! Staff knew what they were doing, anticipated our needs, made valuable suggestions and were very accommodating in every way possible. I've been to many venues with conference facilities in Europe, Latin America and North America but not every venue has business event coordinator experts. There is a difference between handling a wedding or a retreat that lasts just one day and handling a business meeting that can last over a week. The Sheraton Miami knows how to efficiently help you run your business meeting no matter what the size of your group. Its location is ideal for business travellers. Right there at the airport and less than 20 minutes from Miami Beach if you want a change of atmosphere. Besides, once you are in the hotel, you forget how close you are to the air traffic. The rooms are very comfortable and the food is good. Breakfast is pretty much standard but the staff makes all the difference. Wireless service on the entire hotel property is a plus. So in the end, for the purposes of our 10 day workshop, the hotel was perfect. P.S. All the car rental agencies are right across the hotel! If youâ€™re staying for a while, be sure to rent a car with a GPS to get around Miami. Oh, and you can walk to the car rental place. No need to take the hotel shuttle to the airport only to get on the car rental shuttle at the airport to return to a building thatâ€™s right across from the Sheraton.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bakersfield, California", "Title": "“Awesome”", "Author": "Patrickk92", "ReviewID": "UR97633985", "Content": "Hello folks, I had the opportunity to stay an extra day in Miami and a few of us decided to stay at the Sheraton Miami Airport Hotel & Executive Meeting Center and boy the stay was much appreciated and needed. Our room such a great view over the golf course on the pool side. From the shuttle (shuttle drivers Jeff), the front desk and the restaurant (Frank & Domingo) just pure AWESOME!", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Great Location, First Class Facilities, and Outstanding Service-oriented Staff”", "Author": "spgplatinumchicago", "ReviewID": "UR97601707", "Content": "As a long-time Starwood Platinum member, I have had the opportunity to stay at many properties. This was my first visit to this hotel, and I plan to become a regular here. Of primary importance is the staff, ALL of whom, from the General Manager on down, provided excellent and caring service throughout my stay. I was treated as if I were 'family'. Special thanks should be given to Lucas, Sirle, Stanley, Lorraine, Sarah, all of whom were wonderful to work with. Compliments to Raul (the hotel manager) for his generous assistance. The hotel facilities are first class. I was given a beautiful suite which far exceeded my expectations. I was pleasantly surprised by how quiet the rooms are, considering the proximity to Miami airport - never heard planes landing/taking off. The pool area and fitness center are inviting and are much more than adequate to satisfy my needs. The hotel's public areas are nicely designed and quite pleasant. There is a club lounge which provides breakfast and evening snacks. The evening selection is one of the best I have come accross. Thanks to Chef Frank for providing an interesting array of choices. Finally, the hotel's location provides easy access to the Miami area and beyond. I look forward to many more stays.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Not that bad, but not worth any significant amount of money”", "Author": "lebelgo", "ReviewID": "UR96090458", "Content": "I actually stayed at this hotel after flying into Fort Lauderdale, not MIA, because this hotel had an incredible deal for SPG points. That being said, when I rate, I try to take into account what I would have paid for the room. First of all, the hotel is convenient only to MIA airport. If you are coming from somewhere else, you better have a good GPS handy, because access is rather tricky, especially when coming from the west. I felt it was a bit chintzy to charge $20 for parking in an area where parking is very much not at a premium. No big deal, though. The greeting a reception were nice. I felt my room was perfectly nice looking, unlike a number of other reviewers. Perhaps as an SPG gold member I got a refurbished room? Everything was clean, spacious, and in working order, except the TV checkout at the end of the stay. My main complaints were: (1) The rooms were not insulated sufficiently for an airport hotel under a flight path. There was more airport noise than most airport hotels I've stayed in (which is quite a few). (2) We ordered room service breakfast which never came. We weren't charged for it, and just ended up eating out, but how difficult is it to get that right? (3) Pool area was small and claustrophobic. So for the small number of SPG points I was charged, I can't complain, but for the price they want to charge, I feel one should probably be able to do a lot better, especially if one needs to park. This is, after all, just a 3* airport hotel.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“Plain Vanilla airport hotel”", "Author": "RusNewton", "ReviewID": "UR94931277", "Content": "I spent a night here on arrival at Miami Airport because I wasn't sure if my flight was going to be delayed etc. There is a shuttle from the terminal which goes every 15mins. I had to wait about 7min, the journey is maybe 2-3min so very close. Check-in was quick & easy. Lobby is OK, staff were helpful. Room was clean, nothing fancy but no surprises there. Internet was free which is good. Restaurant was OK - staff were friendly, food was surprisingly good. Looks like the hotel is used quite a bit by air crew because there were some checking in when I arrived and there is a large bar with pool table etc to hang out in.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“DO NOT STAY HERE! BED BUGS!”", "Author": "pbmcdaniel", "ReviewID": "UR94615264", "Content": "Stayed here for a convention and I was horrified to wake up with bed bug bites all over my legs- had to go to the emergency room which they said they would pay for the visit and then no one would return my phone calls after I sent them the bill. DO NOT STAY HERE! Would have seemed to be clean but bed bugs in the beds!", "Date": "January 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Horrible”", "Author": "ari100", "ReviewID": "UR93400355", "Content": "This hotel, former Wyndham and before that already a Sheraton, is an aberration! I don't understand why Sheraton bought it and put its brand on it. It looks sad and it is the worst place where to spend even one night before or after your flight. They just bought it, waited some time and opened it again publicizing a radical renovation that never happened. I am starwood gold member (and have been a gold member for the past 4 years) and after this experience I started doubting of the commitment of this brand to quality and decent accommodation. Please, close it as soon as possible!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“More like a motel than what I would expect from a Sheraton”", "Author": "thesaint01", "ReviewID": "UR92816697", "Content": "Stayed one night at the Sheraton (former Wyndham) before an early flight. I had my doubts as we pulled up outside the hotel. When walking in to the lobby it did however look very nice. We were the only ones in the lobby, the front desk staff did however still spend more time talking to each other than helping us to check-in quickly. Coming up to the floor we were at the 'fresh' and new feel from the lobby was all gone. The corridors were long, dirty carpets and the roof was very low giving it a very cramped feel. The sign with the room number outside our room had also been replaced with a piece of paper with the room number on. The room was probably modern some time during the 90s but now it felt in desperate need of refurbishment. It had more the feel of like a Motel8 or something like that than the Sheraton. All the necessary things were however there (such as TV, coffee maker, desk, chairs, iron etc) so it was functional. The best thing about the room was the bed, it was comfortable and big. Other good things about the hotel was the shuttle bus (running every 15 minutes) and the location close to the airport was also good. Still there are other better options for airport hotels (for example the Best Western I stayed at a few weeks earlier).", "Date": "January 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Worst Front Desk and BellStand Customer Service Of any hotel I have ever stayed in.”", "Author": "global_tx", "ReviewID": "UR92702201", "Content": "Sheraton (the old Wyndham) has upgraded and installed heavenly beds in all rooms -they are fantastic. Thats the good news , and there isn't much more. The front desk could care less about your stay. They don't answer the phones. They don't follow up on issues. Hotel has a great meetings team but the other service is so bad here It isnt worth the effort. The meetings staff was excellent, as was the restaurant staff (Diego) and Michael (?) in the bar. Major customer service training is needed here - only a handful of employees should be in contact with a customer.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fairbanks, Alaska", "Title": "“disappointing service”", "Author": "Akkat", "ReviewID": "UR92444245", "Content": "We arrived at the Sheraton, and proceeded to sit in the lobby for nearly 2 hours while the front desk tried to figure out our reservations. The hotel insisted that we had not made reservations for 3 days, but only 1, even though my companions had their reservation confirmations in had. They argued and tried to send us away, saying that it was not their fault. Luckily, they could see that my mother wasn't going to back down, and finally found a way to honor the reservation. The hotel and the rooms are nice enough, I suppose. My husband and I had to catch a plane the next morning, so we pre-ordered breakfast, set our alarms, and thought all was well. When we got up to take showers, before our cross-country flight from Miami to Alaska, there was NO HOT WATER! I would never have guessed that a hotel that size could be out of hot water at 4 AM. We tried again later, with the same results. Then our breakfast never showed up. We tried repeatedly to contact room service and never got an answer. Five minutes before we left for the airport, the kitchen called to ask if we still wanted our breakfast, saying they had just gotten the order we put in the night before. So our flights were a little rough, to say the least, having had no shower or breakfast. All in all, VERY DISAPPOINTING SERVICE", "Date": "January 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Georgetown, Guyana", "Title": "“Very Convenient Location, Great Staff!”", "Author": "janais2000", "ReviewID": "UR92342798", "Content": "The first plus for me for this hotel is its proximity to the airport which is really convenient. The Hotel provides an airport shuttle which runs every 15 minutes and you commute easily between the airport and the hotel in less than 5 minutes. I found all the staff to be friendly and helpful, and the front desk staff is quite professional. The rooms are pretty nice and on my last stay there I had a very pretty view of the golf course. I did not use many of the facilities including the pool, but did have a stroll around the pool area which is quite attractive and seems very relaxing. The buffet breakfast is pretty good, though a bit pricey, and the restaurant staff very friendly. Also convenient is the fact that the Dolphin Mall Shuttle makes a stop at this hotel, so for those interested in shopping, that's an added feature. I am told that the hotel recently changed hands, and they obviously kept some of the fixtures from the previous ownership, but I do hope that they will address this in the short term, as things like the stained carpets in the hallways are a bit of a turnoff and detract from the overall aesthetics of the hotel. Other than that, no complaints.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kingston, jamaica", "Title": "“Not luxury but very Convenient”", "Author": "Jamaicanyardie", "ReviewID": "UR92006316", "Content": "The hotel is literally 3 minutes away from the terminals unlike many so called airport hotels in Miami. The staff is quite helpful, professional and friendly. Check in was very easy and quite fast. The rooms are quite nice and the price includes wireless internet which is useful. Only ate breakfast in the restaurant and it was expensive - you are best taking the buffet since the individual items add up quickly. Buffet Breakfast for 2 people cost $44.00 which is a bit ridiculous. The service however is very attentive and the staff very friendly. Stayed there twice in two weeks and was on two different floors. The second time we noticed that the entire length of the hall corridor was soiled and should have been replaced so we were apprehensive about the room but it was fine inside. Another bonus is that there is a regular shuttle which does run on time. The Dolphin Mall shuttle also stops at the hotel. I did not use the fitness centre but visited it and it is very well equipped with many machines, weights etc.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Texas", "Title": "“The only thing worse than the food was the service”", "Author": "jtsttr", "ReviewID": "UR91458453", "Content": "We stayed here just one night to catch an early flight. The lobby is very nice. It makes you think you're not in a cheap airport hotel. Don't let that fool you - you are. There was trash in the hallways when we got there, still there the next morning. The bar smelled like dirty dishwater. Dinner service was terrible. The waiter forgot to bring my drink and never refilled our empty water glasses. The food was absolutely terrible. Only stay here if you must, and don't eat.", "Date": "January 2, 2011"}], "HotelInfo": {"Name": "Sheraton Miami Airport Hotel", "HotelURL": "/ShowUserReviews-g34438-d85204-Reviews-Sheraton_Miami_Airport_Hotel-Miami_Florida.html", "Price": "$146 - $232*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3900 NW 21st Street</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33142</span></span> </span> </span> </address>", "HotelID": "85204", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c4/0a/66/exterior.jpg"}}