{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Cambridge, Canada", "Title": "“Only if desperate, book this place!”", "Author": "Jan154985", "ReviewID": "UR126444290", "Content": "My husband booked this hotel the night before our cruise, without checking TripAdvisor's reviews. It seemed everything else was booked. Always check reviews! They were right: 1)mold in the shower 2) no blankets, except for a tiny, ragged grey piece of material in the closet 3) sketchy area 4) shredded door 5) sad excuses for 2 towels 6) questionable \"carpet\"--thin, dirty and stained I was very uncomfortable staying here and questioned our safety as the door was indeed shredded on the outside. The bathroom window was open when we checked in the evening and I checked for insects. That was the one good thing--I never saw any insects. Only if you cannot sleep in your car, should you stay here. I had to bring in my own blankets from our SUV, and wore my flipflops in the room. And the mold in the shower was gross. Never again!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Rochester, Michigan, United States", "Title": "“sometimes cheap is not enough...”", "Author": "Goetz V", "ReviewID": "UR125828222", "Content": "I can confirm what others have been writing about. But first I need to let you know that the staff - some funny african-american guy - did his best to make us feel comfortable. The fax with the reservation data (and also the creditcard data) was lying in the booth which somebodz here called a lobby. everybody could take a look at pretty sensitive data from the outside. Than the credit card machine didn't work and we had to pay the deposit cash and - oh wonder - we got it back the next day. The pool looked not too bad, but was closed. Furthermore in this area I would try to hide as much as I can as a caucasian guy and not expose more than necessary. The room was pretty awfull. The wooden flore is quite a good idea I guess even if the rest needs more than a little TLC. Stained walls, totally rotten bathroom. Unfinished kitchenette, no decoration at all (except the one broken mirror), the AC was at the back of the room and I don't know, where it got it's air from. There was a big new plasma TV on the wall, mounted in a wooden frame that looked as if a 3 year old had put it together. The remote was missing and they were not able to offer a replacement because all had been stolen. So it didn't work at all... The beds were too soft and not really clean. bedskirts were missing and the sheets - I didn't have my black light with me and I'm glad about it. There actually was a girl right infront of me when we checked in, who wanted a room for less than a whole night. So these rumours seem right. WLAN was working, but no internet connection possible. The area is pretty central but not nice! If you are looking for a cheap night in a dry place, this could be better then sleeping at the bus stop. If you spend 50% more (which is about 30 bucks) you can get a real room...", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Burlington, Canada", "Title": "“You get what you pay for”", "Author": "cityboy_nz", "ReviewID": "UR120525684", "Content": "Ok so this place is generally for hookers, back packers and other forms of low life. We paid for 2 nights at another hotel the hotel Roma and after one night had to check out, we ended up here at the wishes motel, instantly when I saw the \"we rent rooms by the hour\" I knew what we were getting into, however the location was good, the check in was painless, reception was just a tiny booth, they did take $50 bond which was returned. We had room 106 ground floor by pool, the door frame looked like it had been kicked in before several times by police or pimps, but it still managed to lock securly. Hardwood floors, king bed huge LCD tv on wall, 1 bedside cabinet, old clothes hanger thing on wheels, no other furniture. Sink in room with no coffee facilities or even cups. Bathroom was dated and had loose fittings and shower had no pressure. Bathroom door had a huge hole in it that they had taped over then painted, innovative but not effective, back of bathroom door had shoe prints all over the length of it. Some power points didn't work. We slept soundly and when checking out the front desk person seemed surprised we had been in 106 as the rooms on the ground floor are usually reserved for the \"hourly\" guests. The rooms upstairs apparantly have furniture. Yes is was not my 1st choice but it was better than anywhere in the NW streets of Miami.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“Don't return $50 key deposit”", "Author": "mgbok", "ReviewID": "UR119045558", "Content": "The Wishes Motel (aka Villa Cortez Motel) at 4700 SW 8th St. in Miami has a requirement now that you make a $50 key deposit when you check in. It was made on my debit card and I returned it the day I checked out and got a credit slip. After 2 weeks have passed since I checked out, I called the motel several times and got several different answers, finally leading up to; \"you have to go to your bank, because we made the credit transaction.\" It's not our problem if the money doesn't show up in your bank account. I have better things to do with my time than go to my bank and start a charge dispute, although I have been forced to.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Lancaster, PA", "Title": "“Be Afraid... Be Very Afraid”", "Author": "wildraisin", "ReviewID": "UR95824108", "Content": "Under no circumstancs should anyone stay here. I didn't even know places still rented rooms by the hour. My wife and I picked up a business partner at the airport and took her to this hotel which she had booked on her own. The \"lobby \" is a glass booth in the parking lot. The lobby is the nicest part. The room was down a dingy corridor next to an alley strewn with trash and debris. Upon opening the door to the room I thought we were on set from CSI Miami. bare floors, broken countertop, the toilet sat in a cove large enough to turn around in and sit down. The jacuzzi tub was brown with mold and crud, the drain stopper was missing and the shower head dripped endlessly. there was a gap large enough to put your fingers through between the window and the wall frame. She asked for a different room and was told they were sold out, but she could use a shower in a dirty room until housekeeping cleaned her room the next day. She asked for a refund and was told no refunds under any circumstances. My wife and I took her to our hotel and she stayed on the couch. Stay away at all costs. This place should be torn down and replaced with a vacant lot.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Scotland", "Title": "“Do not even consider this so called hotel!”", "Author": "cken55", "ReviewID": "UR92010254", "Content": "Upon arrival at this hotel, we found that the parking was on the street in a very unsavoury neighbourhood. I entered what passes for the reception area to be met with a sign which read \"No prostitution or illegal activities\" The reception was dirty and in poor condition. The person behind the counter did not end his conversation with his \"lady\" friend. We did not even look at the room as we felt totally unsafe there. Do not go!!!!!!! I would not recomment this hotel to an enemy never mind a friend.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "pittsburgh", "Title": "“worst management ever - ROOMS ARE NOT SECURE- UNSAFE”", "Author": "this-place-sucked79", "ReviewID": "UR54026391", "Content": "this place is a scam. DO NOT STAY HERE. the manager demanded i pay in cash, and we were looking for cheap place to stay for 2 nights while we were apt hunting, so we werent' expecting anything fancy.. but this place was not suitable for humans, unless you are a drug addict or prostitute DO NOT STAY HERE. after i gave the cash to the manager he informed me that there is no key for the lock on the door and the locksmith was coming 'in a few hours' to change it. i stupidly believed him, and decided to come back ina few hours after the locksmith came. came back late-- still no lock on door. i demanded room w/ door tht lockd and had a key i felt like i was in a horror movie. the furniture was falling apart, the drawers of the dresser didnt' open, and the one that did was hollow.. no bottom. cigarette burns all over the furniture AND pillows. bathroom was disgusting. manager told my bf tht people steal the keys all the time nd that' why they are constantly chnging them. i couldnt sleep there knowing that some crackhead could unlock my door at any moment. my car alarm went off twice and the manager pretended he didnt see anything. we left in the middle of the night, couldnt sleep there.. was too afraid for my safety. refused to give us refund for the 2nd night---we had to leave at 3am and drive around to find another hotel. the whole experience was a nightmare and somewhat traumatizing. DO NOT STAY HERE UNLESS YOU ARE LOOKING FOR A PLACE TO SMOKE CRACK/SHOOT UP/OR [--] A HOOKER. dont believe the pics on their website. they are old and/or fake", "Date": "January 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "fair", "Title": "“if you want prostitutes and drugs this is the place for you!”", "Author": "bigfishaquariums", "ReviewID": "UR51157346", "Content": "this is the worse place i ever stay in my life. they don't give you a key for your room. no toilet paper no towels smell like garbage . They take payment and after let you know that is no key for your room when you go to the room you realize there is no towels,soap toilet paper, so at this point you ask for refund and they say theres no money back. so no choice you have to stay, crackheads and prstitutes screaming all night long you can't sleep. finally i went to another hotel. City of miami should close this place down!!", "Date": "December 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "usa", "Title": "“Not a Bad Place”", "Author": "SatisfiedUSA", "ReviewID": "UR18773024", "Content": "I had not seen some of the reviews until a friend had asked me how my stay was. I went online to pull up the motels site to forward it to my friend. I was surprised by what I had read. I found the motel to be very acceptable for the price, it wasn't anything fancy, but i got a clean, quiet, and inexpensive room two miles from the center of downtown Miami. I only was there one night, but i had no problems with the room or staff, and i thought the price was right. Ken", "Date": "August 9, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1", "Location": "1"}, "AuthorLocation": "Green Bay, Titletown, WI", "Title": "“Horrible service, charged us and we didn't stay”", "Author": "LisaHansonGB", "ReviewID": "UR16992985", "Content": "We had booked a reservation at another hotel for February and a week before we would arrive, they overbooked and switched us to this hotel. After reading all the reviews, I decided I could not stay here, so I immediately cancelled the reservation, and they told me there would not be any charges. It is now June, and we are still disputing the charge on our credit card. Whenever I call the hotel, I get a manager named Mark, and he tells me to call back when I get a better attitude and keeps hanging up on me. This place is a scam!! And they don't even put their phone number on the charge so it's very hard to get ahold of them. We did pass the hotel on our cab ride back to the airport, and we were SO happy we had not stayed there!", "Date": "June 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Germany", "Title": "“A garbage dump! Worst stay ever! Don`t do this to you!”", "Author": "DaveGermany", "ReviewID": "UR16870867", "Content": "I don`t know where they took the pictures from but they must be old. Old like the rooms, smelly, dirty.The bathroom was pure hell. We were afraid of touching something. Even homeless sleep much better! We travel a lot thru the whole world and that was the worst dump we have ever seen! We had a wonderful trip up to this point but this experience was very distressful. I would not even let my dog sleep here. We decided to stay here because of the affordable prices and because of some good critics at tripadvisor. But who wrote them??? I guess the manager himself. As wee arrived we were shocked. First they lost our booking confirmation. Although we had printed it out they did not wanted to give us the confirmed price, so we should pay about 100USD more for the week. As we got the keys for the room and came back after 30 Minutes with the money to pay our room was allready taken by someone else! There was no room left and it was the middle of the night. So they gave us the last room they had, the worst we have ever had to stay in. No windows, smell like hell, no words to describe this garbage dump. We have`nt slept a minute. After hours of discussion on the next day, lost money for the first night, we left this dump and went straight to South Miami Beach where we checked in in a really good 3star hotel for 109USD per night. So again, please do not do this to you an do not trust any good critics reagrding this hotel. They are not real!", "Date": "June 12, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "jacksonville", "Title": "“i should of listen”", "Author": "queensheba83", "ReviewID": "UR15722060", "Content": "Thank god we went out alot , the location is great close to the beach , but the room made me wanna cry , looks nothing like the pictures, i think theres prostitution going on in there! the bathrooms were disgusting!!!!! i want my money back", "Date": "May 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "vancouver", "Title": "“worst place ever!”", "Author": "VancouverLuv2travel", "ReviewID": "UR12011180", "Content": "Based on the reviews on this site I booked 2 rooms for 2 nights. This is the worst place ever! The room is dirty, no toilet paper or garbage can. Water runs straight to the floor from the the sink in the room. Lights don't work. It is not close to South Beach by any stretch! It's a $16 taxi ride each way! I paid $80 per night instead of the $50 the people in front of me paid by just walking in off the street and not booking ahead. I had a terrible time getting out of my 2nd night's booking even though I gave them over 24hrs notice. The guy at the front desk insisted he could only take my money, not give it back - only the owner could do this which we could never get a hold of the owner even by cell phone. We had a wonderful trip up to this point but this experience was very distressful. I don't know what these other people are talking about - there was nothing positive about this place.", "Date": "December 28, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Orlando", "Title": "“Not Recomended”", "Author": "cordero528i", "ReviewID": "UR11149728", "Content": "To begin with.. I was stupid enough to think this was a hotel and not a motel. This place has junks in the hallway! I'm thinking... Why am I bringing my wife here!! A man with a dirty shirt and no shoes was by the pool and then walks to the office and grabs the phone. It gave me such a poor impression of the place. Then, we were walked to the room reserved and I see the employee strugling with the key when she decides to take us to another room and when she opens up the door.. a smell like vicks or something came out (not exagerating)but it was definetly not a smell like a clean hotel room. After all that, I was naive enough to ask for the key to stay... when the employee tells me that they don't have a key for me cause people steal them!! And \"they don't have a problem going up to open up the door for us\". That's when me and my wife decided to cancel the hotel and go somewhere else. This was 10/22/07 and until this day I'm still waiting for my refund cause no one is allow to make refund except for the owner. I paid $173 in a Holiday Inn in front of Bayside and it was very well worth it. An employee at the holiday told us how there's illness you can grab from hotel rooms in Miami so we're glad we changed our mind. If someone says this hotel is great then that person must be either crazy or that works there....", "Date": "November 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Michigan", "Title": "“Great price, the best location”", "Author": "Kimberly14", "ReviewID": "UR10409539", "Content": "I had a great stay, near to everything I needed, would recommend for the price. Felt like I was at home. I would stay there again.", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami", "Title": "“Minuets From Southbeach @ half the price”", "Author": "Knight_Crawler1980", "ReviewID": "UR8669757", "Content": "I liked my stay and the price was good. I connected great with the free wi-fi. Looks like they are renovating the place, nice firuniture big TV. They have a great sushi bar there. And i was 10 min away from the beach. Will come again .", "Date": "September 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Fast, Outgoing & Frendly service”", "Author": "Phiberoptic", "ReviewID": "UR7851269", "Content": "Checked in in the middle of the night suprised by the quality service I recieved as such a late hour and the best deal too.", "Date": "June 15, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "heredia", "Title": "“Saved Money & Time in Miami”", "Author": "hottdogg", "ReviewID": "UR7840921", "Content": "I stayed there for 2 weeks while I was looking for an apartment and was given a weekly rate of $380 that was 1/2 the price of the hotel just nextdoor. The Location was excellent right next to all the expressways and near South Beach. The Pool was Great and the rooms were better than I expected as the rate was so much less than all the other hotels. I would reccoment this place to any one that needs to save money and time when in Miami.", "Date": "June 12, 2007"}], "HotelInfo": {"Name": "Wishes Motel", "HotelURL": "/ShowUserReviews-g34438-d87096-Reviews-Wishes_Motel-Miami_Florida.html", "Price": "$55 - $67*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3530 Biscayne Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33137</span></span> (Formerly Airport Red Carpet Inn)</span> </span> </address>", "HotelID": "87096", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/be/04/4c/wishes-motel-thumbnail.jpg"}}