{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arvada, Colorado", "Title": "“Peaceful Paradise”", "Author": "ColoradoBrian5468", "ReviewID": "UR124742508", "Content": "Well we knew it was gonna be good but it was better than we could have imagined. The setting is in what we feel is one of the most beautiful places on earth. Away from the city lights of Lahaina and the commercialism of Kaanapali. If you really want to party and kick up your heels 'til all hours by all means do it........ but please don't do it here. This is a very adult oriented setting. The folks that stay here want peace and quiet with the sound of the waves breaking on the beach on Napili Bay all night. The condo had everything we needed. The bed was huge and all the appliances were in great shape. We really enjoyed the location and views of whales breeching between Napili Bay and Molokai. That was a thrill. The staff is friendly first and very professional. After a few days we felt like family. Scott, the General Manager, Mirissa, Alena and Shannon all are so guest oriented and friendly they could teach a course in hospitality. Mirissa makes the best corn bread on the BBQ on Friday morning coffee gatherings. Do not miss that. The maintenace crew is skilled and friendly too. They have a :\"can do\" attitude and if there is a problem they fix it immediately. We truly love the Napili Surf and the way we were treated as guests. This is a first class operation. We have already booked a reservation for 2013. Mahalo to the crew at Napili Surf.............you're the best.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Excellent location, good value for money”", "Author": "queen_vic84", "ReviewID": "UR123766136", "Content": "We really enjoyed our stay. Our unit was a Garden Studio and extremely comfortable - very spacious for two people. The kitchen was so well equipped to the point of ridiculous - a full spice rack, a blender, a sieve - you name it!! There was a BBQ grill for the guests' use and we did this one night, because we found the nearby restaurants (with the exception of the Gazebo nextdoor, which doesn't serve dinner) to be of a poor quality and very over-priced. The unit was cleaned to a high standard every day and towels changed etc. The only downsides I can think of (for us) is that being in our late twenties we were the youngest guests by at least 40 years. We wanted somewhere quiet - we don't like obnoxious parties and lots of noise - but we just felt very conspicuous! However everyone was really friendly, so this wasn't a big problem at all. Another is that the laundry of linens seems to take place in a truck that parks right outside the units and powers the washers/driers with a diesel engine. Not great for the air quality in the immediate proximity, but it didn't really bother us because we were out during the day. This is not a criticism, just an NB: the pool and other maintenance begins at 6am. It is impossible not to hear it if you sleep with the windows open for the cooling breeze. But, Hawaii seems to be an early-to-rise, early-to-bed kind of place, so we just went with it and it didn't matter too much! Overall, I would highly recommend this place - if you wish for a quiet, relaxing break on a great beach and don't mind driving to restaurants or making your own food, then this is the place for you!", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lynnwood, Washington", "Title": "“Great location and comfortable too”", "Author": "Kristin65", "ReviewID": "UR122733654", "Content": "On a previous trip to Maui, my husband and I happened upon Napili Bay while snorkelling in the area and we thought it would be a good location for us to look at when we returned to Maui. It turned out to be even better than we could have expected. We thought the area of low slung condos on a nice bay/beach would be more our style than a resort or high-rise type place. Our goal was relaxation and snorkelling and Napili bay offers both. A nice central area for checking out the bays on the west side of the island, walking distance to Kapalua and lovely views across the water as well. The unit we chose was a 2nd story studio that looked out toward the bay but is not considered oceanfront. The room was quite comfortable and offered everything we needed. It was nice to have a kitchen (all appliances were full sized) and we loved sitting on the lanai. One night there was a 'mai tai social' where we enjoyed complementary drinks with other guests as the sun was setting--we were somewhat surprised to find that many of the guests make the Napili Surf their vacation destination year after year. Everyone was so nice and you will likely find us here again....as one of the repeat visitors requesting the same perfect room. A short walk by beach or street lands you at the Sea House restaurant which is a great place to enjoy happy hour and enjoy the bay view. Other restaurants within walking distance: The Gazebo, Merrimans and the Pinapple Grill. Grocery store also within walking distance.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durango, Colorado", "Title": "“Excellent”", "Author": "durangotang911", "ReviewID": "UR122721044", "Content": "Our family has been going to Napili Surf Beach Resort for years. In fact, every time we're in the islands we stay here. The location is prime. The staff are great. And the hotel is perfect for a few days of relaxation. Though the beach directly in front of the hotel can be crowded at times, the snorkeling is still fair. Walk around the southern point of the Napili Bay and you'll find even better snorkeling (and many many turtles) with a bit of a rougher entry. The staff are helpful and there weekly happy hours, and weekend lei making for the kids. The hotel is very calm. The noise from the beach never really reaches the grounds. It's a perfect place to just relax and enjoy being in Hawaii.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "fca", "Title": "“a little bit of \"old Hawaiian\" hospitality”", "Author": "skatermom16", "ReviewID": "UR122324926", "Content": "When you meet someone in the laundry room whoses family has been returning annually for 22 years you know there must be a reason why. The Napili Surf embodies the best of Hawaiian hospitality without the pretentiousness of a resort. Because of zoning laws prohibiting buildings \"taller than a palm tree\", Napili Bay continues to be an enclave of low rise old Hawaiian style condos on a beautiful bay offering great value for the money. Though we were in the \"garden units\" of the Pua Mala building, the beach was less than a two minute walk away (my husband timed it at under 90 seconds - he walks faster than I do) through meticulously maintained grounds. Staff, many of which have been there for a number of years (one housekeeper will retire next year after 39 years!) treat you as family. The complex is older but well maintained. Units are individually owned so each has its own character but all come with a fully equiped kitchen including diswasher. If you find that you need something that is not stocked in your unit housekeeping can ususally find it for you. The number of returning guests was quite impressive - the Napili Surf has become a family tradition for multiple generations of families with children and grandchildren returning year after year. You could tell that returning guests felt like the Surf was a home that they were coming back to. If you want a taste of real old Hawaiian hospitality without the pretensious of a large resort, if you like quiet and aren't looking for a lot of ammenities, if you want to just feel at home and relax in a beautiful and more laid back area of Maui I would highly recommend the Napili Surf Beach Resort.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Focused on relaxation”", "Author": "exafrica", "ReviewID": "UR122004347", "Content": "We stayed in 127 and 228. I think we preferred 228 upstairs but only by a small margin. The attention on cleanliness was remarkable. Booking and check in was highly efficient and this is so comforting when you visit for the first time. Everything worked and the only maintenance issue we has was promptly fixed, Every clock in the units were correct - now that's detail! The emphasis on \"quiet\" is what attracted us and we were not disappointed. The beach was perfect but I prefer to do my relaxation on grass. They say Napili is windier and cooler. Maybe? I was more aware of rustling palm noises but can't say this was a bother. I would not hesitate to return.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Best Location”", "Author": "mauilovermomoftwo", "ReviewID": "UR120248414", "Content": "We have two children and this was our first stay at the Bay. Our unit 111 was wonderful. It had everything you need and a pull out couch and day bed so each kid could have their own bed! That was great. I could hear the ocean at night and in the morning from our bedroom which had a slider door. I love Napili. We stayed at the Napili Shores last year and this hotel is definately better. The only thing I didn't really like was that there wasn't a lot of younger people around. When we stayed in Kaanapali at the Kaanapali Beach Hotel there were a lot of younger folks (mind you I am in my early 40s) and that was nice. It seemed that this hotel has a lot of older folks who frequent it. Now we haven't gone during the normal kid vacation times so it could be different then but we did feel like we had to be very quiet even at the pool.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Wales UK", "Title": "“Didn't want to leave!!”", "Author": "Helouise", "ReviewID": "UR119352730", "Content": "The condo is located steps away from a gorgeous beach and surrounded by beautiful gardens. Guests tend to be older or couple orientated. We stayed in room 222. The unit is spotlessly clean, modern with a fully equipped kitchen which is great for not having to eat out every night. it also comprises of a huge comfy bed, flat screen tv, sofa and outdoor balcony with tables and chairs. Towels for the pool and beach are provided. There is a shopping complex nearby to pick up supplies for cooking and renting snorkelling equipment. This area is perfect for a romantic break for relaxing, swimming and snorkelling. The sunsets in the evening are beautiful. If you stay here I would recommend attending a Luau night about 15 mins drive from Lahaina. I would recommend this place and will definitely return.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“A favorite!”", "Author": "ComeFlyWithMe_Carly", "ReviewID": "UR118422688", "Content": "My husband and I have stayed here twice. Once in 2005 on our honeymoon and once in April 2010. It's not super modern, but they have been doing updates. It's super clean, the units are very well cared for, they have very well cared for gardens and property. It's like a secret slice of heaven. It's quiet, the facilities are nice, the staff have always been more than courteous and I truly hope to go back again. Napili Bay is beautiful and my husband and I enjoy watching the sea turtles ride the surf on the rocky side right in front of the hotel. Not to mention that everyone we've met that stays here is really nice too. You won't regret choosing this property for your trip.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bothell, Washington", "Title": "“Loved this small hotel on the beach”", "Author": "tinarussell1234", "ReviewID": "UR118361917", "Content": "We had a lower unit, but view of grounds were nice, room was super quiet, and loved that it had a bedroom door so if one of us woke up early , we could just go out to living room.. Bathroom area was old and small, kitchen was adequate.. Beach area is small but nice and not to loud. Older, quiet crowd. Nice location away from town but not too far from the resteraunts and shops. I accidentally left a small wallet that had fallen out of my bag that had 300 in it, I hadn't yet realized it had dropped out, when they called to say they would be returning it. Nice! Great customer service and we loved our stay.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston", "Title": "“Paradise!!!”", "Author": "Coachmdouglas", "ReviewID": "UR117812186", "Content": "We returned to Napili Surf with our boys for a family reunion after staying here on our honeymoon thirteen years earlier. Immediately, we asked ourselves, \"Why did we wait so long to return?\" The grounds are immaculate. The friendly grounds crew seem to take pride in their work each day. The daily service in the room was done flawlessly. The front office staff was always willing to answer a question or help. We appreciated the chance to mingle with other guests on their weekly Mai Tia night and the Friday breakfast. Napili Surf creates a low key atmosphere that is very relaxing. You are steps away from the pool, beach, or just a lawn chair under the tree overlooking the ocean. The sunsets are amazing! Straight out of a postcard. We loved falling asleep to the sound of the ocean each night. We will certainly return to the place our eight year old son has been telling everyone was \"paradise\". Tip: The Slack Key Guitar night (Wednesdays I think) is a short 10 min. walk from Napili Surf. It is fabulous! They begin tuning up and jamming at doors.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Yorba Linda, CA", "Title": "“Best Place To Stay On Maui!”", "Author": "2LHC", "ReviewID": "UR117637962", "Content": "We were searching for a low rise condo on the water with good snorkeling for a group vacation with family members and trusted the Trip Advisor reviews of this resort. It couldn't have been better! All four of our rooms were steps from the sand and very clean with fully equiped kitchens. (The kitchens even had a full spice rack, a pack of coffee, filters, cream and sugar.) Several of us opted for full ocean view rooms and the views were spectacular. The friendly staff members and the scheduled events, (Fri. AM continental B-fast, Wed. nite mai tais and a pot luck BBQ), made this resort seem like our own vacation home and we met many wonderful people. We stayed over the 4th of July holiday and the resort hired a dance troup that put on a luau show that was superior to the one we had paid for in Lahaina! All of the quests furnished an individual side-dish and the resort provided prime rib, salmon and chicken that was cooked to perfection. After the show and dinner, everyone went down to the beach and watched all the kids put on their individual fireworks shows. This resort is located on Napili Bay, which has decent snorkeling and a group of giant turtles that seem to come out every afternoon around 4 PM and graze on the algae covered rocks to the left. They're amazing to watch....but don't touch. Great snorkeling is a quarter mile away at Kapalua Bay. Drive out of the resort, turn left and look for the public access/parking lot next to the Sea House Restaurant. The parking fills up around 9:30 AM, but there is overflow parking across the street at a tennis club. Follow the signs. Here are a few tips: Best take-out food: Okazuya (about 3 miles south on Lower Honoapiilani Rd) and Mama's Ribs (next to Napili Market 1/2 mile away) Get the Portugese Bean Soup or Teriyaki Chicken Best Gourmet Market: Foodland Farms (in Lahaina across the Hwy from Safeway) Best Liquor Selection & Prices: Longs Drug Store (in the Lahaina Safeway Center) Needless to say, we had such a good time that we've already booked our vacation here for next year.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Berkeley, CA", "Title": "“Relaxing, Family, Fun”", "Author": "GoodKarmaTravels", "ReviewID": "UR115864534", "Content": "We come here as a family and meet friends who have been staying here for 30 years. I wish we could come every year, but alas, we are not millionaires! It is so wonderful to have your own kitchen, beautiful lanai and short walk to the beach. (0ne of the most beautiful beaches in Maui.) I hate to give away our secret, but it is a great place to stay.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Pleasantly Surprised”", "Author": "Intrepidhiker2011", "ReviewID": "UR113915682", "Content": "When we reserved this place, we didn't know what to expect. Posted pictures aren't always true to the property. What a pleasant surprise when we arrived to this well hidden piece of paradise. The suite we stayed in was very clean and the furnishings were up to date. The suite was fully self-contained and we took advantage of the full kitchen amenities. The patio doors opened up to a nice pool. We loved the gardens that surrounded the property. Everything was well maintained. The staff was warm and friendly and everything was peaceful. It's a short walking distance to the beach area and snorkeling. There are some great lava rocks on the beach for sitting on and watching a beautiful sunset or exploring the tidal pools. Good fun for families with children. It's a great location for visiting other attractions in the area. Do your research, there's plenty to do and see for all ages!", "Date": "June 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California", "Title": "“NO A/C, NO Bathtub, No jacuzzi”", "Author": "marmalade22", "ReviewID": "UR108995240", "Content": "Although a decent somewhat dated property in a spectacular location one should note: If bathtubs, air-conditioning, jacuzzi and privacy are a concern for you, try a little more upscale place like the Ritz-Carlton. It would be my choice next time.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "North Vancouver, Canada", "Title": "“Plan to Return ASAP”", "Author": "A TripAdvisor Member", "ReviewID": "UR105227179", "Content": "I read the reviews before booking this property and somewhat knew what to expect... In the end, this is our favourite place we have stayed in Hawaii, ever. And we have been here many times. When I read this property was dated, I interpreted this as possibly meaning a bit run down. We stayed in unit 222 (garden view), and a discerning customer may call the unit dated. To me, it has charm. It is impeccably clean and it's clear that the people who run the place take pride in the upkeep and cleanliness of the property. We will definitely be back. One note: the nearby Gazebo restaurant, though highly rated in many reviews, was not worth the wait to us. The view was gorgeous, the service excellent, but the food wasn't anything special and we waited nearly an hour to get in. We asked our waitress when to arrive to avoid the wait, and she said noon is quietest.", "Date": "April 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburg, Kansas", "Title": "“hope to return soon and highly recommend to others”", "Author": "kshikn", "ReviewID": "UR102324081", "Content": "great place to stay, very clean, grounds nicely manicured, well equipped kitchen, very friendly staff. Nice beach, clean pool and a picnic table with a wonderful view of the beach. There are grills for cooking out and also they provided a styrofoam cooler and blue ice for packing a picnic. Parking is close to the rooms which is handy. The only fault I could find during our visit was the outside light shined in the kitchen window all night long and there was not a shade of any kind to block the light. Only a problem if you are used to a very dark room at night. We hope to return soon.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sherwood, Oregon", "Title": "“Loved it!”", "Author": "vintagemary67", "ReviewID": "UR98719859", "Content": "This property rents (privately-owned) studio and one-bedroom units and is professionally managed. It attracts mostly older guests, but there were a few well-behaved children there too. It's smaller, and older, but very well-maintained and its location is wonderful. Many of the units have lovely bay/ocean views, and there is a nice sandy beach, plus scuba diving areas nearby. Many folks return year after year (after year!). And we intend to return too. It's so much more convenient (luxurious, in a way) than a high-rise hotel. You have your car right outside your door and a well-stocked kitchen. This isn't for young singles looking to party, not by a long shot! But there was a very congenial group of mostly retired folks there when we were there and we attended a very nice cocktail (pupus) party on the lawn. There are also some nice restaurants within walking distance. There is no A/C but we were very comfortable with the flow-through louvered doors and ceiling fans. Aloha, vintagemary67 Oregon", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Location to beach awesome, no a/c, renovations since 70-80's”", "Author": "NatePearse", "ReviewID": "UR98126233", "Content": "This place had it's positives and negatives. A previous review by one of the unit owners was spot on and this should be seen as a retirement community. If you are looking for anything beyond proximity to a good beach this is not the place for you. Positively, my room had a little kitchen, but had not been remodeled since the 70-80's and no A/C. We used the bus system to get around, but would suggest having a rental car if you choose this area. If you want a retro feeling and are not looking for modern amenities this is the place. The staff was nice and had no issues here. Since I was looking for more than the great location, this was not my ideal place, but I believe this would be great for a more mature couple.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Billings, Montana", "Title": "“Incredibly Relaxing Resort (quiet, laid back, and re-energizing)”", "Author": "jrwillies", "ReviewID": "UR97738457", "Content": "My wife and I chose this resort over a number of other reviews by reading TripAdvisor and seeing a previous persons review. The reviewer stated he enjoyed the peaceful setting and the lack of rowdy behaviour generally associated with other resorts. He also made the remark that if you were of the generation that wanted to party, play loud music, and generally behave in an ill-mannered fashion, seek other quarters. This is why we chose Napili Surf. It lived up to the reputation. Most guests at this condo association are well over the age of 50, and the resort reflects this. The rooms are very very comforatable and iwe would go again with ABSOLUTELY no hesitation. The kitchens are totally stocked with the appliances you need (blender, microwave, oven, stove, full size refrg, pots, pans, etc). The staff is very low key (and most times invisible) but very efficient. The layout of the room was beautiful with a lanai that overlooked the ocean. We spent most of our last day watching whales and turtles from our lanai, and the beach right outside.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“WHAT A GEM!”", "Author": "swansu", "ReviewID": "UR93874306", "Content": "My husband and I travel at least one a month to all kinds of destinations so we've stayed in many different types of hotels. This is our second trip to Maui. Both times we stayed in Napili Bay and absolutely love this area. On this trip, for the first seven days we stayed at a more expensive resort down the street. We had two nights left and so we moved over to the Napili Surf. First, from the minute we called they could not have been nicer. If you're into the Four Seasons or the Ritz Carlton, this is not the place for you. This feels like a mom & pop type motel. It is extremely well cared for even though it's an older building. We have an upstairs studio with a fully equipped kitchen. Right down the stairs is a high-end BBQ which we have used both nights to grill. We have met very nice people; some people that have been coming here for 35 years. The beach here is beautiful. Our room is very comfortable and the housekeepers keep it spotless. Napili Surf is affordable and the staff is very warm and friendly. We will definitely be back. We're already talking about another trip! And if you're into hiking, they have some great trails right around here.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Fantastic little resort”", "Author": "cosmosgirl", "ReviewID": "UR89806817", "Content": "My partner and I stayed in December 2010. This resort is just how you picture Maui in the 1950's. It is located right on an idyllic little beach - just gorgeous. It's very quiet and the rooms are cool and comfortable. It's clearly a hotspot with the retiree set and it's evident that many guests have been coming for years. There's a pool and plenty of lounges for sun lizards plus there is nearby place to rent snorkelling equipment. The owners are just lovely. Wifi in the room is excellent. A nice kitchen, well resourced for people who want to cook in their rooms. You are given bathroom and beach towels. In the two days we were there we found two restaurants. The Gazebo has excellent breakfast and lunch (on one day we had to wait 45 minutes in a queue for breakfast at the Gazebo). The restaurant at the other end of the beach (it's name escapes me) is fairly average. Food was poor, but the sunset view is magnificent. If you are staying, do rent a car as West Maui is an hour from the airport. You will need a car to explore or to purchase food.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vancouver", "Title": "“incredible location, a wonderful place to stay.”", "Author": "lindatVancouver", "ReviewID": "UR89364290", "Content": "we returned to napili surf to find it as wonderful as we remembered.. nothing better than getting up, swimming in beautiful napili bay, back to the patio for coffee and fresh papaya. the unit was well appointed and the staff friendly and helpful. i highly recommend this property.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, B.C., Canada", "Title": "“customer service at it's best!”", "Author": "Tina23Vancouver", "ReviewID": "UR88047804", "Content": "What a class act this place is. Totally laid back and relaxed. it is not 5-star, but we enjoyed it much more than any luxury resort. Gorgeous setting, immaculate, and great atmosphere. Wed eve's they have an evening cocktail reception where the owners/managers provide mai tai's, beer, wine and appies - a great way to meet your neighbours. Fri. mornings it's coffee and pastries, and sunday there's a hula show. It's small, quiet and right on the beach. Lovely pool, and delux Weber bbq's to grill on. We checked out all the other resorts in Napili, and this one had them all beat hands down. We totally recommend Napili Surf, but do be aware it rains much more in Napili than on the south part of the island, so take that into consideration.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkeley, California", "Title": "“If you are looking for peace and quiet ...”", "Author": "MJD1957", "ReviewID": "UR79821808", "Content": "... then NSBR is the place for you. If you are a smoker, have young children, are looking to party, are addicted to your Blackberry, are disturbed by \"older\" people who earned their right to enjoy a peaceful setting, and think Hawaii weather can only be tolerated with the door closed and the A/C turned way up-then definitely stay away from this place. You will hate it. Please stay away. Yes, I'm an old fart of 53. I have been coming here routinely with my girlfriend - then fiance - and then wife for about 10 years now and just have to laugh at those who are complaining about we \"old\" people. Yes, it is true that we are trying to get away from the Lahaina frenzy and our hectic lives outside of the Aloha state, for some R&R. If you don't like this concept, then PLEASE stay somewhere else and leave us alone. Mahalo.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland OR", "Title": "“Lovely grounds, quiet location, good value, great beach access”", "Author": "MsMacPortlandOR", "ReviewID": "UR78279477", "Content": "I stayed here August 2-13 on my own while my teen-aged daughter was at her regular summer camp. Stayed in the Garden View building in an upstairs unit, center of the building. I had stayed here for a few days in 1983 and remembered loving the location, so I wanted to return. Like most of Maui, the area has experienced explosive growth since my last stay here, but the Napili Surf is so tucked away that one can almost ignore the impacts if one just stays on-site. The beach is more crowded, partly because of the massive but very attractive development on the north end, but also just because it is such a lovely bay and very popular for safe swimming and snorkeling. The studio unit was clean, well-equipped for cooking meals, and quite comfortable. Most of the guests were courteous, friendly, and honored the quiet hours (bless them!). But sounds do carry, and you can hear each and every conversation from guests that sit outside on their lanai in the evening and talk, especially if they talk loudly to begin with. Some guests seemed to think the rules do not apply to them, and they sat around the pool or on the front lawn talking on their cell phones. Maybe the \"no cell phones in common areas\" signs need to be bigger? One person who used his cell phone also turned his cell phone speaker on and played music. Come on! Go to the big resorts if you want to do stupid and rude stuff like that! But most folks were very respectful. This is not a party place; it is a quiet, reserved, get-away-from-it-all kind of place. I loved swimming with turtles near the rocky reach just below the resort. The water was refreshing and calm, so it was easy to swim safely. Someone drowned off of Black Rock while I was there, so I was doubly glad for a safe area. Kapaulua Bay is another safe, warm water spot just a few minutes up the road. All in all, a lovely, low-key, well-maintained facility in a perfect location for relaxing and just watching the ocean and the sky.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“We loved Napili Surf”", "Author": "gazgolf1", "ReviewID": "UR74701913", "Content": "We stayed at Napili Surf in July and loved it. Unit 109 was clean with an upgraded kitchen and the unit itself was very comfortable. The complex was very friendly and quiet with nice gardens and lawns, 2 small pools and a couple of shuffleboard courts.We ate next door at the Gazebo for breakfast and the Sea House for dinner. We wished we had stayed our whole time on Maui at the Napili Surf instead of just 3 nights, I highly recommend this complex.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“The Best Kept Secret on Maui!”", "Author": "sybsage", "ReviewID": "UR68759910", "Content": "I have returned to this idyllic spot for 18 years in a row . The location is superb, on a sandy beach with excellent swimming and snorkeling; first rate tennis and golf facilities are 5 minutes away as are exceptional fine dining restaurants as well as more casual and less expensive choices. The rooms are immaculate, beautifully appointed, with fully stocked kitchens . The staff will do anything and everything to make your visit enjoyable including hosting weekly mai tai, coffee and donut mixers. I consider this my home away from home as do other repeat guests. It is a place for couples and families who appreciate and enjoy calm serenity and quiet surroundings.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Renton, WA", "Title": "“Birthday trip to see whales”", "Author": "pcwalton1", "ReviewID": "UR54416530", "Content": "This was our second stay at Napili Surf and once again it was a great stay. The room was comfortable, and had everything I needed to cook breakfast a couple of mornings. Great fun having coffee and rolls Friday morning with all the other guests. Love the peace and quiet of the area and the beautiful beach. Went out with Captain Steve and got my wish to see whales. What a great birthday present.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Perfect Beach Getaway!!”", "Author": "epbybp", "ReviewID": "UR53138203", "Content": "We've stayed here three years in a row and I'm am making reservations to return again in June. My children ages 7 and 10 look forward to our stay every year. I can't say enough good things about this resort. Just give it a try and you'll be hooked too!!", "Date": "January 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Great value, friendly management, on the best swimming beach on Maui”", "Author": "SophiesAunt", "ReviewID": "UR49496360", "Content": "We've stayed at Napili Surf 5 or 6 times before, always in an ocean view studio. This time there were four of us and we stayed in an ocean front 1-bedroom unit, number 207. It's the upstairs front unit on the second building from the beach (Lehua). We think it's got the best view in the house, with two balconies on the NW side and a big lanai on the N side. It's right above the pool so at busy times of year (holidays, summer high season) there could be significant noise from kids, but the pool was virtually unused the ten days we were there. The units are well-maintained but the sofa bed mattress in our living area, where our grown kids slept, was in bad shape, lumpy and uncomfortable. That will probably be fixed soon. Also there is no dining table on the lanai, but the inside table has great ocean views. We thought there was too much furniture in the living room for four people, but that's just us. None of the units is large, but you aren't banging your shins on the furniture to get around, either. No bath tubs, only showers. Nice thick towels. No A/C, just ceiling fans, which works fine unless there is kona weather. Garden view units are significantly cheaper and the building that houses them has great landscaping and its own pool. It's only 100 yards to the beach from that building, so if you don't care about the view it's a very good deal. In the front buildings some people actually complain about the noise of the ocean keeping them awake. The waves can be seriously loud--we love it, but others may not. The clientele is mostly either older people (many Canadians, since the property was originally developed by Canadians) and young families. Not a place to party into the night, a place where the loudest thing you are likely to hear is the wave action on the beach. There's a coffee on Friday mornings and a Mai Tai party on Tuesday evenings. Two gas barbecues that get a lot of use and are cleaned every day. The gardeners even wipe off all the benches above the beach every morning so you don't get wet sitting there with your coffee watching the waves. The landscaping is really well cared for, and there are herbs growing you are free to pick. I've read a few reviews here complaining about the rules, which made me laugh. Different strokes....seems to me like the rules are all sensible and have to do with respecting your neighbors. Simple courtesies, really. Napili bay is usually great for swimming, unless there is a big north swell, and the snorkeling is good, too, lots of little reefs in the bay with plenty of fish and sea turtles, too. We could see the turtles coming up from inside our room. It's a five-minute walk to Kapalua beach. The Napili area is nice because there are no high-rises. If you are looking for low-key and laid back, I think it's the best area on the island. There are lots of family homes in the neighborhood, though fewer every time we go. We have stayed at the Napili Bay next door and the units feel dark and not well-ventilated there. Only louvered windows, no sliders, so you can't get a clear view of the ocean or anything else from inside. The lanais are small, too, and the railings are of wood so you can only see the ocean when standing, unless you are pretty tall. Napili Surf is a much better deal, more appealing overall.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "vancouver", "Title": "“perfect place to stay”", "Author": "lindatVancouver", "ReviewID": "UR49363472", "Content": "great location, wonderful beach, nicely maintained property", "Date": "November 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“Can't wait to return!”", "Author": "KLH", "ReviewID": "UR48191196", "Content": "I hesitate to review Napili Surf since it's been almost two years since our last stay but we are true Napili Surf addicts. I also hesitate to share this special gem of a resort. We missed our now-annual Christmas visit in 2008 but are counting the days till our return this December (our fifth Christmas at Napili Surf). We've probably stayed at Napili Surf 10 or more times and have sent family, friends, co-workers. This is a small, ocean-front resort that is well maintained with dedicated fans who appreciate the less glitzy, cozier resort style. Each unit is privately owned but professionally managed and cared for. Even if your unit is a garden unit (not ocean view), the manicured lawn and sandy beach-front provide ample area for chaise-lounge viewing of the beautiful ocean and Molokai--not to mention direct access to the swimmable, often boogey-boardable Napili Bay. You'll want a car but can also find dining choices within walking distance. Larger grocery stores are a short drive, as is resort-style life (Kaanapali) and shopping (Whaler's Village). Regarding previous posts that complain of: 1) No air conditioning: It's never been a problem for us. Maybe we've been lucky with weather and the unit locations we've chosen. We've stayed during April, August, September and December. 2) Musty unit: Never experienced musty and my nose is super sensitive. 3) Lumpy bed: All our beds have been comfortable. If you don't expect the luxury bed and bedding of a Westin resort, you'll be fine. Some units have queen beds, some have kings. If I found a bed not up to standards, I'd notify the office and they would, I believe, do everything within their power to fix the problem. The staff care. 4) Too many rules: Thank goodness for those rules as people seem to need them today! More and more people are traveling with children. Kids are noisy and like to play, scream and run. Some parents forget that not everyone appreciates the constant cuteness that comes with all that joyful kid noise. It also seems there's been a decline of common sense and common courtesy in our society. Just because I'm awake and enjoying myself at 11 pm or 7 am, I can't assume the people next door want the same. Just because you can't be away from your cell phone, doesn't mean I want to participate in your one-way (usually too loud) conversations next to my patio chair or lawn chaise. You might think it's fun to throw that football across the lawn over the heads of those of us relaxing, reading, sunning, but there's a huge sandy beach 50 feet away that is full of folks who would enjoy watching your talents. No need to even mention why no-smoking rules are needed. 5) Noise from adjacent units: The resort is small, patios surround two sides of the large lawn area. Voices and noise carry. Last spring I paid $600+ a night for a condo on the Big Island and I still had to participate in the vacation trials, tribulations and joys of other vacationers. These were large, up-scale units and the screaming kids, the cell phone conversations, etc. were more disruptive and frustrating there than at little Napili Surf. Sad to say, people can be just plain clueless and rude. 6) Landscape maintenance: Either the landscape is maintained or it isn't. It often requires workers using equipment. It's been our experience that equipment use has been fairly regular but minimal in duration at Napili Surf. We've experienced far more disruption at higher-end resorts and condo complexes. We brought our extended family to Napili Surf for Christmas 2007. The young marrieds who usually travel with Hyatt, Westin, etc., loved Napili Surf. All were pleased and look forward to returning December 2010. We hope Napili Surf will continue to post and enforce the rules that enable all of us to enjoy our well-deserved vacations. Frankly, we encourage management to be even a bit more dedicated to keeping Napili Surf the laid-back aloha spot we've enjoyed on so many visits.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Long Island City, New York", "Title": "“It doesn't get better than this”", "Author": "jenn79", "ReviewID": "UR46241190", "Content": "When you're on Maui, you're probably looking for the best beaches. I can say without a doubt that Napili Beach is one of those. And just behind the beach, there's an amazing little resort offering fully equipped rooms with kitchens! The staff is beyond kind and the location is absolutely amazing. Free parking is provided and during off season I was able to snag a room for $99 plus tax. Friendly, clean and a little gem a bit off the beaten path. This is what I dream of when I go to Hawaii!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Simi Valley, CA", "Title": "“\"This place is Shangri-la\"”", "Author": "MauiPaul", "ReviewID": "UR42523585", "Content": "The Napili Surf Beach Resort is a paradigm for paradise located on Napili Bay in Northwest Maui. The weather is the best feature of this picture perfect Pacific jewel. No humidity on the grounds of the complex or in the rooms. Iâ€™ve stayed at the Napili Surf for each of the last six years and have vacationed on Maui fifteen times and never found a better resort. The beach front condominium resort is quiet and serene with immaculately manicured groundsâ€¦.the Napili Surf is a Pacific heaven.. I love everything about Hawaii except for the humidity and this is only condo or hotel complex in my experience where the trade winds constantly air condition everything in sight. The one bedroom partial ocean view or studio partial ocean view units have fantastic vistas of the Pacific ocean, Molokai, and gorgeous Napili Bay. These units are about a thirty second walk to a small swimming pool or the ocean. All the condos Iâ€™ve stayed in are updated with every imaginable amenity. If youâ€™re into golf or tennis, the world famous Kapalua Bay Golf resort is about one minute away by auto. Depending on which unit you book, your car can be parked right outside your door. Across the alley is the famous Gazebo restaurant which features their signature macadamia nut pancakes. The food is good, the prices are right and the views of Molokai and Napili Bay are outstanding. Be prepared to stand in line for 15 minutesâ€¦.but itâ€™s worth the wait. If youâ€™re looking for a Bali Haâ€™i-type, peaceful island vacation with ideal weather, a beautiful beach and comfortable condos surrounded by lush landscaping, itâ€™s all at the Napili Surf Beach Resort. This place is Shangri-la", "Date": "September 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "USA", "Title": "“ADEQUATE, NOT GREAT”", "Author": "aboymom2", "ReviewID": "UR40051027", "Content": "We stayed 5 nights at Napili. We were miserable without air conditioning! We had to keep the sliding door closed during the day when we were gone so the studio was really hot when we returned. It was never under 80 degrees in the room. It is an older complex but well-kept and clean. However, the groundskeeper spent two days doing major pruning of the bushes with a gas operated trimmer that was very loud for hours. Since you have to keep your windows open, there was no way to take a nap. We also felt like we had no privacy since everyone's windows and patio doors were open. There were rules everywhere...no cell phone use unless in your room, no smoking unless you go to the road or beach, no feeding the birds...... Overall, we would not stay here again because of the no a/c.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Pasco, Washington", "Title": "“Great simple but comfortable place to stay!”", "Author": "deleoc", "ReviewID": "UR37695245", "Content": "I agonized over whether we should stay at a fancy resort or a lesser priced, highly recommended place in Maui. We decided to go with Napili Surf because of the full kitchen and great reviews on TripAdvisor and we did not regret it for a MINUTE. This is a wonderful, clean and quiet place to stay. Although it's not fancy, it has everything you need to create a home away from home. On Wednesdays they have a Mai Tai night for their guests and we sat outside, close to the ocean and listened to Hawaiian music and sipped on complementary Mai Tais - simply heavenly! The staff was very nice and gracious. I walked by one of the larger resorts and although it had all the bells and whistles, it was crowded and noisy. Napili Surf makes every effort to create a quiet, comfortable and relaxing stay for their guests at reasonable prices. Thank you Napili Surf - you helped make our week in Maui a memorable one!", "Date": "August 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Boulder", "Title": "“A Hidden Gem”", "Author": "JKHittinTheRoad", "ReviewID": "UR34747729", "Content": "My husband, 12 year-old son and I spent a week in an ocean view room. What to say...we felt like the luckiest people in Maui. The beach is gorgeous, they cove next door has dozens of huge turtles you can snorkel with, the property is spotless, and Scott the manager runs a tight but very friendly and relaxed ship. If you want glitz and bling, nightlife, computers, or if you are single and on the prowl, don't go to Napili Surf. If you want a small slice of heaven in a spectacular, tranquil setting this is your place. I have never written a review for Trip Advisor but felt Napili was so deserving...although a part of me wants to keep it a secret. We had spent 11 days cruising Maui in a Westphalia camper van before coming to NS, so it felt extra deluxe by comparison, but even so this place is a gem.", "Date": "July 14, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "3", "Value": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great location”", "Author": "Mauilover_9", "ReviewID": "UR34325991", "Content": "The Napili Surf Beach Resort met our expectations. We were basically using it as a base from which we could explore Maui. The beach at this location is beautiful and we spent quite a bit of time snorkeling and saw many beautiful fish as well as a turtle. The room was adequate and met our needs. We went to the grocery store just up the road and bought food to cook in our room. There were also a couple of nice restaurants which we ate meals in. We did eat in the restaurant at the resort next door. They did not have a liquor license but I believe they were getting it. The resort had a tea and pastries event one day, which we really enjoyed because it gave us a chance to meet some of the regulars. I wouldn't recommend this resort for families as the clientele seemed a little old. There also seemed to be a lot of regulars who I own their own units. There is no entertainment so it is not for those who are looking for fun at night. So, overall, nothing great. I think it is a little pricey but the location is absolutely beautiful.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boise-Idaho", "Title": "“Quiet, Clean and walking distance to a beautiful beach”", "Author": "GiulioSerena", "ReviewID": "UR33263504", "Content": "The place is very quite and clean. A lot of old people and families. A plus is the Napiili beach at walking distance. We had the studio Ocean front view, unit #115 and was perfect. The only improvement was the fridge little bit too noisy. Excellent ratio price/quality. Good place for family with kids, couple looking for relax and tranquillity. You can swin with turtles in the beach just in front of the hotel.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Take It Easy”", "Author": "iac0n", "ReviewID": "UR29512398", "Content": "This place deserves its rating. Having been in Honolulu for 8 days it was great to go to a place that has such a relaxed attitude. The room was much bigger than anything you are going to find in Oahu, while dated the room was quite comfortable with unlimited internet and cable TV. The beach was better then expected, it turned out to be a great place to snorkel. We got deep sea turtles on at least 3 days, the rocks and reefs also have a lot of tropical fish feeding so you are going to get heaps to look at. The resort being geared more to adults is an added bonus. It was great to be able to relax by the pool without kids running round making noise. Two issues do affect this place. Having to pay cash is crazy! I had to carry close to $2000 australian around with me for 8 days, it would be much better for this place to take credit card and charge a fee. The other issue is the location, I loved being right on the beach but I didn't like the hike to Lahauna shops (or the 50 minute drive from the airport). A hint for anyone going to Maui, get a car otherwise you won't be able to get around! When I return to Maui I will consider staying here again, we had a great time! The shuffle board courts rock!!!", "Date": "May 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "West Palm Beach, FL", "Title": "“A lovely little resort that made us feel at home!”", "Author": "loveh2ofl", "ReviewID": "UR28159392", "Content": "We'd 'discovered' Napili Surf on trip advisor and then found other reviews on the web and in guide books. It sounded perfect for our 4-night Maui stay. We checked for the website specials and also called prior to booking to make sure we got the best rate for a garden view condo. Since the resort doesn't take credit cards, we made a $300 deposit and were able to pay our balance upon arrival. The room was beautiful and had all the comforts of home. The garden view was lovely - for some reason I thought our view would be of the parking lot - NOT!! The grounds were beautifully maintained and the beach was convenient. We were traveling around Maui a lot and the weather wasn't cooperating so didn't spend a lot of time on the premises. But we did enjoy a great afternoon on the beach and at the pool on the one warm sunny day we had! Beach blankets in the room, as well as bamboo mats available outside were convenient We ate breakfasts in our room since we were heading out fairly early each day and also brought in dinner - purchased at the Napili market a mile or so away. Convenient and far more reasonable than we were finding Maui restaurant prices. The fully outfitted kitchen was more than adequate! We highly recommend Napili Surf for a home away from home in Maui!", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Nanaimo, BC", "Title": "“This place is fantastic!”", "Author": "LoCoPixel", "ReviewID": "UR27964208", "Content": "We stayed here for 10 days in unit 115 for our 25th anniversary. It was absolutely great. Everything was very clean and well taken care of. There were people working every day cleaning, fixing, and generally keeping the place up. Our unit was on the ground floor. All we had to do was open the sliding door walk across the lawn and we were on what the locals call Maui's nicest beach. The units are very well cared for. While I wouldn't call them 'luxurious', they are very comfortable and well equipped. The kitchen had everything we need and lots of stuff we didn't. Most importantly it had a good coffee maker. We originally thought we would be eating out much of the time but we ended up eating in the condo most of the time because it was so comfortable and relaxing. There are numerous bbq's around the property. The service was very good. We arrived late after the office was closed but there was an envelope waiting there to welcome us and give us all the info we needed. Our unit was cleaned every day. On the one occasion we had a minor complaint (the light outside our door was very bright) the owner took care of it right away. There was ice in the freezer for us on arrival (very important for that first drink!). Before arriving I was concerned about the lack of A/C. Turns out it was not needed at all. Both end walls have slats which can be opened for very good cross air flow and it was very comfortable sleeping at night....and I'm a warm sleeper so having it cool is important. As an added benefit you are lulled to sleep by the sound of surf and gently woken in the morning by the birds. The resort is far enough from the main road that it is very quiet....no sounds of traffic at all. The resort is located only 15 minutes from Lahaina and there is a market just down the street (Napili Market....walking distance) and another 5 minutes away (Star market). I can't think of anything this resort could do better....wait.....maybe a hot tub would be nice. I'd return for another stay in a minute. Thanks Nipili Surf!", "Date": "April 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oak Hill, Va.", "Title": "“I loved everything about it!”", "Author": "smc01", "ReviewID": "UR27925502", "Content": "The Napili Surf was recommended to us by our neighbors who have stayed there several times in the past. After spending a little over a week there, I can see why they, and so many others go back time after time. The beach is one of the best and was great for snorkeling. There are two restaurants within walking distance (The Gazebo and Sea House) and both are excellent. The grounds are well maintained and the units are reasonably priced. We have stayed at other locations in Maui, including the Westin at Kaanapali, and have found the Napili Surf to be the best value for the price.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Honeymoon Heaven”", "Author": "ebe73", "ReviewID": "UR26896493", "Content": "After reading other reviews on Trip Advisor, we decided to choose the Napili Surf for our honeymoon and were not disappointed. The room (204) is well-appointed and the kitchen is very well equipped. Being so close to an uncrowded beach has been a wonderful bonus. We have been able to watch turtles playing in the surf and have sighted several whales from our balcony. The resort offers ample parking which is helpful as a car is definetly required to get around the island. We have been delighted by the attention to detail shown by the ground staff in keeping the gardens, BBQ's and common areas meticulously manicured and cleaned. We have also been impressed with how all the guests, old and young alike, have respected the quiet times and we have thoroughly enjoyed a peaceful and relaxed honeymoon after all the build up to our wedding. The only downside is the Resort does not accept credit cards so for international guests that do not have an american cheque book, carrying around that much cash whilst travelling to pay for our stay was uncomfortable.", "Date": "March 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "upstate NY", "Title": "“Our new home away from home on Maui!”", "Author": "boomerang86", "ReviewID": "UR24047124", "Content": "After reading all the other TA reviews on Napili Surf, I was convinced this was the right place to stay for us and we were NOT disappointed! We booked a late January vacation only six weeks prior to departure, checked out their website and started e-mailing them to inquire about availability and rates. They were terrific and always responded within one business day to all of our questions. On their website is a link to â€œAuntie Lanis Daily Dealsâ€�, with sample rates and dates for the different room categories. We called and booked a garden view studio unit for seven nights; two days later we asked to extend the standing reservation one additional night and had no problem doing so. We sent our initial deposit by check (Napili Surf does NOT accept any credit cards) and were advised we could pay the balance of our charges by cash or check after we arrived. The office is only open Monday through Friday 8 AM to 5 PM HT; however they will make arrangements if you are arriving on a late flight so you can pick up your room keys after hours. We did just that and were pleasantly surprised with the personal touch given (youâ€™ll see what we mean if you choose to stay). The keys are placed in an envelope along with a map of the resort highlighting the location of your room and where to park your vehicle. If youâ€™re renting a car during your stay on Maui, I recommend you take a compact or smaller car since this is an older property with limited, closely spaced diagonal parking in most places. We arrived just before midnight Hawaii time (5 AM Eastern time, a marathon for us), picked up our keys and made a bee line for our room. It was at the end of the building furthest from the street (Napili Place, a sleepy dead end used by the public for beach access parking) next to the service door that housekeeping uses, which was no problem at all as they were very unobtrusive (thank you, Juanita and company for great friendly service!). No fresh cut pineapple and champagne waiting for us this time but a clean, comfortable, fully furnished unit was all we could ask for and more. My best guess is that the building we stayed in was constructed in the 1970s. Everything was in good working order, clean and paint was recent. Our unit was tastefully decorated with many wooden wall accents and prints. The refrigerator even had two trays of ice cubes ready for us; kitchens had a full set of dishes, cooking utensils, small appliances, dishwasher, in sink disposal and several mismatched containers for food and beverages. Hot water was REALLY hot. Most of the light fixtures have CFL bulbs to save energy; surprisingly our shower head did not seem to have a flow restrictor. Plumbing fixtures in the bathtub were rather dated and there was no tub stopper. Our unit had a fairly new LCD television with DVD player and cable. Free wired high speed internet access from Oceanic Time Warner Cable is there too, and the resort now has free wireless internet access as well. The next morning we were awakened about 6 AM by noisy birds outside our lanai; the units have no air conditioning or heat and donâ€™t really need either due to the climate... also, the louvered glass panes on both ends mean thereâ€™s no way to keep that bird noise out, but then youâ€™re getting the added bonus of being lulled to sleep by the rolling surf just a few yards away. Quiet time at the resort is 10 PM to 8 AM and respected by all guests; youâ€™ll be asked to use your cell phone only from inside your room and not on the lanai. After eight oâ€™clock we went to the office to meet the staff, paid our balance in full and picked up our parking sticker. We took a walk around the grounds and marveled at the level of care this place receives; there is always work being done around here to keep the place neat. Each building also features an outdoor propane fueled grill and herb garden which is shared by all guests; we used the grill one time and it was SPOTLESS but took patience to ignite. Beach access is by two sets of stairs, with the east coast of Molokai just a few miles away in the beautiful view shed. There are on site laundry facilities available to guests in the building below the office 8 AM to 5 PM which consist of two top loading washers and four dryers, all coin operated (free powdered laundry soap is there too). Another thing that sets a place like Napili Surf apart from conventional hotels is that most guests are here for very long stays, sometimes two months or longer! Youâ€™ll get to meet the regulars at two socials scheduled weekly, a Mai Tai reception every Wednesday evening and a coffee social Friday mornings. The guests (mostly elderly couples or widowers, very few children) are friendly too and eager to get to know you as well as share their stories. Once you meet them and understand the big picture, itâ€™s easy to see why so many choose to return to this same place year after year. Repeat guests are given a 10% discount on future stays, which makes a more convincing argument to stop searching for a better place since we doubt weâ€™d find one more appealing. With Lahaina town a few minutes drive away and the Kapalua Resort complex within walking distance, you canâ€™t go wrong with Napili Surf!", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essen, Belgium", "Title": "“Do not miss this perfect place !”", "Author": "fvandewouwer", "ReviewID": "UR20925080", "Content": "We stayed here for 5 days and really enjoyed everything. Location : perfect near to restaurants, not far away from shops ( Lahaina about 15 minutes ) surroundings : perfect a beautiful beach not too crowded ( just as a postcard from paradise ) a beautiful garden well maintained private and all so quiet rooms : perfect very cosy and quiet with a kitchen with everything you need and a very comfortable bed , good bathroom and an everyday cleaning service We slept like a baby and felt like home what more do you need ? We would like to thank the general manager,Scott Ullrich, Mahalo for making our first Maui vacation one we will never forget. We hope to come back soon. Erwin and Frieda Belgium/ Europe", "Date": "October 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dorset, UK", "Title": "“A beautiful place to stay for a Honeymoon”", "Author": "glaciergirl75", "ReviewID": "UR20180727", "Content": "We stayed in Maui for 5 nights for our honeymoon having travelled already in Oahu and BIg Island. We were looking for a relaxing, low key experience, minimal driving and quick access to beaches and snorkeling. Napili Surf offered all that and then some. A beautiful romantic location, the condo we had (227) was just amazing. Spacious, lovely furnishings, clean and comfortable - for $118 a night it was a bargain. We even got a bottle of champagne as a gift from the resort! I highly recommend this resort as a honeymoon or destination for couples. Yes the clientelle are older - but thats nice sometimes - you chat, share stories and relax without being self conscious of yourself. The beach was lovely, strong surf. About 3 minutes walk away is a bay full of wild green turtles, and a 5 minute drive away is Honolua Bay where we snorkeled amongst spinner dolphins. At home in grey England, we received a lovely postcard from Napili and we just wanted to be back there again. Highly recommend.", "Date": "September 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“A Great Little Place”", "Author": "TexasTxtraveler", "ReviewID": "UR18644209", "Content": "My family & I stayed here for about a week. We had a ocean view condo that was very nice. It was quiet and on the beach. Our place was well equiped and very nicely furnished. They even had a cut pineapple as a welcoming gift ready to eat. If your looking for a great big resort , this is not the place but if you need a laid back place with lots of great atmosphere I would recommend Napili Surf. Our daughters got to snorkel and swim every day and see the turtles up close. The beach was just steps from our condo. Condo does not have AC but we did not need it while we were there.", "Date": "August 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "usf97j4x4", "Title": "“Not too bad”", "Author": "usf97j4x4", "ReviewID": "UR16467547", "Content": "We stayed here on our honeymoon for a few nights to save up some cash for some of the nicer hotels. It was very inexpensive and the location isn't too bad, 15 minutes or so from Lahaina. Our room was very comfortable (no AC but it was fine). Definitely the best place to stay if you want to save money. It is only 10 minutes from Honolua bay, the best snorkeling (HANDS DOWN) in Maui and equally close to Sansei Sushi (AMAZING). The place has the feel of a retirement home though, many of the people staying here were a lot older so I wouldnt recommend it for honeymooners. But, as honeymooners we were not even there much so we didnt care.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Best Value in Maui”", "Author": "fru_sorteravn", "ReviewID": "UR15935990", "Content": "We've been lucky enough to have stayed at Napili Suf twice in the past year and do not think we would stay at another place in Maui if we could avoid it. We had a garden view studio on the 1st floor, same one as we had last year. It was very clean and had everything for a comfortable stay. The kitchen was well equipped and the bathroom was spacious and clean. It had a balcony which although did not have a seaview, had a view of the gardens and swimming pool and it had alot of privacy. Since last year, the carpet has been replaced. The gardens are well maintained and someone is always doing some maintenance to keep them itidy. There are barbecues around the property for the guests use and a coffee morning on a Wednesday and a Mai Tai evening another night. There are laundry facilities so you can pack light(er), there is free parking too and none of the cleaning fee nonsense that other properties seem to have (the ones that charge it but fail to clean it for your arrival). Napili Surf are very flexible with us, since we are not from the US and they do not take credit cards, so arranging prepayments/deposits in USD can be costly, also with the arrival time being after the office closes, they make arrangements for the key. On top of that, the location of Napili Surf is fantastic, with a beautiful beach where turtles like to swim in the evenings and you can see whales in season from the beach. The water is lovely and you can snorkel. Some days it is rough and others it is like a lake. Next door is another condo unit (Napili Point?) where you can take breakfast if you don't mind standing in line and they have happy hour plus full service restaurant. Napili market is nearby for supplies although Safeway in Lahaina was our best supermarket. Lahaina is not far away for dining options and evenings out, so too is Kapalua for Sansei's.", "Date": "May 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Great spot”", "Author": "Beverley-Diane", "ReviewID": "UR14777438", "Content": "We were looking for a nice place to stay for a base and found Napili Surf via Trip Advisors. It is a complex with many accommodations. We were in the 1 bedroom units not on the beach but with a pool. The units for $139.00 per night were a bargain for what we got. Harry at the front desk was most pleasant and helpful. Actually everyone seemed helpful. The units were very clean, efficient and well appointed. In the full kitchen frig they provided a fresh pineapple and all the necessities to make tea or coffee. Nearby is a wonderful restaurant right on the beach. We even saw whales during our breakfast. All in all I highly recommend these units for the either a base station or a longer R&R stay.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“A Whale of A Resort!”", "Author": "RGW", "ReviewID": "UR14589910", "Content": "We just returned from one of the best resort experiences we have ever had, and we hesitate to share this review because we don't want Napili Surf to become so popular we cannot return. The deluxe accommodations in our one-bedroom condo with daily maid service, included full kitchen with dishwasher, newly remodeled bathroom with thick, fluffy towels delivered daily, and wonderful staff ready to assist with any request. The louvered window above the shower let the trade breezes float through as we showered after coming in 20 yards from the beach....the accommodations could not have been better. All hours of the day and night there was a breath-taking ocean view from the lanai or the bedroom windows, framed by palm trees. The living room with large, flat screen tv. also wired for Sirius FM radio. The large bedroom with king bed and excellent mattress as well as a pull-out couch and twin bed/day bed in the living room made this apartment just about perfect for a couple or a family. The apartment is not air conditioned, but ceiling fans and cool breezes did the trick. There is a 9 p.m. quiet rule since all the apartments have open windows. There is a high proportion of returning guests and owners who come for the beauty and serenity, many of whom have been coming for over 40 years, so we had no problem with noise. The grounds are beautifully maintained and the pool was placed just between our apartment and the golden crescent beach that is Napili. The sun sets over the open ocean each evening in colors so gorgeous they defy description. Best of all, the humpback whales make their way up the channel between Maui and Molokai and provide entertainment morning and night. Binoculars were not necessary to see the constant parade of spouts, tales, and completely breaching and spinning whales.....all viewed from our lanai! Napili Beach is a jewel and we hope they never succumb to the development craze in the rest of western Maui, including at the adjoining Kapalua Bay property, where the cranes and tall development with loud construction noise (our only complaint during this stay) are taking away from the peace and beauty in this magnificent part of the island. Get to Napili Surf as soon as you can....it is too beautiful to be missed!", "Date": "March 27, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "calgary", "Title": "“Perfection at the Napil Surf Beach Resort”", "Author": "CalgaryCarole", "ReviewID": "UR10880707", "Content": "We stayed at the Napili Surf from Nov 6 â€“ 16. It was absolutely perfect. We are in our early 50â€™s and wanted a quiet, clean condo and the Napili Surf fit the bill. We researched many places in south and west Maui: resorts, condos and VRBOs. We decided against resorts as we did not want to eat in restaurants for every meal, and be crowded in the pool area. Not so much a cost decision as much as we prefer our own breakfasts and lunches. We ate out most evenings. We chose the Napili Bay area because none of the buildings are higher than a coconut tree. We did not want high rise, or to have to walk through endless lobby and grounds to get to the beach. We chose the Surf based on the reviews of all the condos in Napili Bay. We chose the south end of the beach because we thought it would be the quietest. We were right. At the north end there were way more people. We also chose the Surf because we wanted a small pool (it has two nice little pools), and we wanted a grassy area where we could look over the ocean without sitting on the sand when we didnâ€™t want to. We had Unit 207, a second floor one bedroom. As a corner unit, it was a bit more expensive than the other units ($272 a night), but well worth it. There were THREE lanais: one small one off the bedroom, so as we lay in bed we could look out to the ocean (that lanai had two chairs and table); one small lanai off the living area opposite the table so we could eat and see the ocean, (that lanai also had two chairs and table); and a larger lanai off the living area that looked over the bay with a love seat, coffee table and two chairs. The other units all had the usual one lanai with at least two chairs and table, but they all looked very comfortable. The three patio doors allowed the breezes to flow as did the ceiling fans (including the one in the bathroom). We certainly did not need AC, The unit was not â€œluxuriousâ€� as in a resort, but it was spotless, well furnished and had everything that we needed. Kitchen with corian counter and bathroom with granite. Kitchen was very well equipped, blender, toaster oven, plus the usual stove, fridge and DW, and enough pots, pans and baking trays to cook thanksgiving dinner for eight, Kitchen supplied with dish detergent, dishwasher soap. Daily maid service was great with frequent bed linen changes and daily towel change. Laundry on premises with free soap. We needed help from the office staff on two occasions: once to fix a lamp and once to access our safe (we put in the wrong number!): the help was instantaneous and polite. The views from our ocean front unit were wonderful. Clear views to Napili Bay and the ocean. There were three spotless barbecues on the site. The garden view studio units were much cheaper, and although they did not have the view, the gardens were beautiful, and the area was very tranquil. Very easy access to the beach from there too. The ocean view studios were also cheaper, and directly fronted the ocean, set back by the beautiful grounds, so they would be a great deal. (I bet they would be classed as \"ocean front\" by some resorts!) There were two full time groundskeepers and one part time, and it really showed. TONS of beautiful flowers and birds. Every day the lawn chairs were wiped down and the sidewalks washed. The grounds were immaculate. There were always plenty of lawn chairs â€“ no need to bag your chair early here, and even a small sandy area fenced off from the public beach. Good choice of sun and shade in the grounds. The beach was very clean. It was a steep entry to the ocean which could be a bit difficult for little ones, but that also made for lots of fun in the waves. Just to the left of our complex was the start of the rock shore line. There were a few little areas there that would be perfect for toddlers learning about waves and the ocean. Sandy yet protected by the rocks from the big waves. We snorkeled in many areas of the island. The snorkeling in Napili Bay was quiet good on one day we went, and too murky the next day. On the good day we saw tons of fishes and four turtles. The turtles were so close I could easily have touched! The great thing about our unit was we went straight from the unit to the beach to snorkel, then back to the unit to shower. Perfect! (There were public showers on the beach, and two showers right inside the resort to wash off the sand, then straight up to our room for a warm shower). In response to the last review, there were a few kids there and they were made very welcome. There is a notice in each room to please not use cell phones in the public areas. I very much agree with this, we come on vacation to get away from such technology. ALso the whole resort is NON smoking - a pleasure. We would highly recommend the Surf for quiet bliss, cleanliness, beach access and easy access to Lahaina and Kaanapali if/when you want more action. You canâ€™t go wrong at the Napili Surf", "Date": "November 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Not family friendly”", "Author": "WandAMom", "ReviewID": "UR10275212", "Content": "We stayed at Napili Surf on September 30-October 5th 2007. I was traveling with my husband and our 2 children. We met my Mother and Father in law and my sister in law brother in law and our nephew in Maui they also stayed at Napili Surf. On the 2nd day we were there I recieved a phone call to make sure my kids rinsed the sand off their feet before we went back to our room becaus ethe maids had complained they had to vacuum outside our room. In my childrens defense (they are 7 and 9) it was not their fault there was sand outside the room my husband had shaken the towels off out there as not to bring the sand into our room. Since school is in session there were quite a few older couples staying there and they made us feel very unwelcome. If my kids made noise in the pool I got the worst dirty looks. I felt like I was in a retirement resort and breaking some rules bringing my children there. The room was beautiful and very clean. I just felt like it wasn't family friendly maybe it was a bad time of year to be there with my children but we paid the same amount of money to be there we shouldn't have had to worry our kids might offend someone by splashing in the pool. Also, some man yelled at me for using my cell phone pointing out everyone knows you can only use your cell phone in your room as not to bother other people who are trying to relax and get away from technology.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“A Beautiful Trip”", "Author": "mauilover21", "ReviewID": "UR10003717", "Content": "Our stay at Napili Surf was incredible! We stayed in room 214 with a beautiful ocean view and just a short walk down to the beach! Our room was (we were told by a friendly neighbor) recently remodeled and was a very nice room. We were welcomed with half of a fresh cut pineapple in our fridge...and fresh pineapple from Maui is the best pineapple you will have! The kitchen was fully stocked with dishes and pretty much anything you would need to cook in or out. The closet had cute little beach chairs and hangers for your clothes. Not that we watched much T.V. but there was either full cable or maybe even satellite in the room (so lots of channels!). The daily room service was great and the staff was very friendly and knowledgeable about the questions we had. The beach is just as awesome, with great snorkeling (we were lucky enough to get to see the sea turtles!) and a wonderful open air restaurant just a walk down the beach. The sunsets were incredible and waking up to the sounds of the ocean and all the birds chirping was such an experience. Nearby is a place to rent the snorkeling gear and boogie boards, and also a couple restaurants (Maui Tacos, Subway, etc) and a great smoothie place! (I would recommend the strawberry, pineapple, orange sherbet one!) This was our first time to Maui and when we do come back we will definitely stay at Napili Surf again, without question!", "Date": "September 25, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Poipu Beach", "Title": "“We live in Po'ipu Beach, Kaua'i”", "Author": "Kauaiohana", "ReviewID": "UR7819480", "Content": "Where do Kaua'i families go to vacation? Napili Surf. We haved stayed here many times and I have lived on this Island and know it well. It is on a great beach and in easy reach of several of the top beaches on Maui. We love to bbq in the late afternoon, swim in the pool and ocean and play shuffle board. Then we hop on our jet back to Kaua'i and do it all over again at home! The Sauers family, Po'ipu Beach", "Date": "June 9, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose, California", "Title": "“Nice, clean, close to the beach and close to great snorkeling”", "Author": "JoeB59", "ReviewID": "UR6836464", "Content": "After reading several reviews here regarding the Napili Surf Beach Resort, we decided to give it a try. We were headed to Maui for a good friend's wedding in October of 2006. We were in a unit on the second floor in the Puamala wing. Our unit even had an overhead fan in the bathroom which was great when it got really hot. It was very quiet for nearly all of our stay but the property between our wing of the Napili Surf Beach Resort and Lower Honoapiilani Road was being demolished during some of the mornings of the weekdays we were there. Luckily, the Caterpillar loader wasn't operated for hours and hours and the noise for us wasn't that intrusive. So that issue didn't really negatively affect our stay at all. It was too bad that some of the very old trees had to go down though. Anyway, the Napili Surf turned out to be a great location for this trip because we were either a short drive or walk to some really great snorkeling which we did just about everyday. The beach at the foot of the Napili Surf was fun as well and convenient when you just wanted to jump into the ocean. We would recommend this place for folks with kids or no kids and those who like a quiet, competitively priced, low key place to stay in West Maui.", "Date": "February 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“Reasonably priced, nice place”", "Author": "sharkleberry", "ReviewID": "UR6766240", "Content": "We stayed here for a restful 5 days when all we wanted to do was lie in the sun & swim (between more active periods on Kauai & the Big Island). We stayed in unit 104 - facing the pool & the ocean. It was ideal for our purposes - we tanned & swam every day, and barbequed and drank wine and read every night. The place is very clean & well kept. Unit 104 had a great bed and extra big shower that fit 2 people. The grounds are neat & tidy and they have comfortable furniture and killer barbeques for everyone's use. The beach is right below the condo units and was safe and swimmable even when the rest of the island had huge surf. We were there during whale season and regularly watched whales breach off the shore right from the beach. It's not a glitzy resort, it has a large 'older' population ( A LOT of retirees), but it's great value for your money in an expensive area and satisfied two pretty fussy travellers. The area has no high rises so it's also a little more cozy than the surrounding towns which are full of big box hotels. If we were to visit Maui again we would definitely consider staying there. From what I can tell, though, the ocean front units are owned by individuals (and rented out by the corporation) and are far more upgraded than the 'garden view units' which seem to be owned by the corporation and have smaller beds and less upgrades. Worth the money to rent an ocean front unit.", "Date": "February 8, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Huntington Beach, CA", "Title": "“Perfect for Families.”", "Author": "MamaAli", "ReviewID": "UR6712022", "Content": "We loved our stay at the Napili Surf. It was more than we usually spend for accomdations ($266 a night) but well worth it. We stayed in a ground floor one bedroom (#111) and it was perfect for my husband and our one year old baby and my sister and her 10 month old. It was not super fancy, but clean and comfortable. We really enjoyed the big grassy area right outside of our lanai for the kids to crawl and walk around on. The beach had calm surf, tide pools to explore and wonderful snorkeling right in front of the property. We even saw turtles and a whale. Even though our room was to the back of the property, we could still hear the ocean surf at night. My only \"complaint\" is that the front desk staff was not overly friendly. Very close to the property is a small shopping center with a grocery store and a Maui Taco (great food, vegetarian too!!). Most of the other guests were seniors, which I liked because they were all super nice.", "Date": "January 29, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "el cerrito, ca", "Title": "“Much better than expected + better than looks from outside!”", "Author": "ratNparrot", "ReviewID": "UR5434765", "Content": "FAR exceeded our expectations for a $107 room after all taxes just a week away from high season. 1/2 a pineapple was giftwrapped in the fridge waiting for us even! We stayed in room #124 and noticed that #123 has a granite kitchen... Anyway, quite clean, comfortable, and spacious. No complaints whatsoever and we stayed in the quiet, 'garden' view side as the beach is only a few steps away. This was the best value for the money of any room we had in our 14 day trip. Our reservation was for 2 nights but plans changed at the last minute and the fellow at the front desk was SO kind to us and refunded our entire second night stay without a second thought. even without 24 hours notice. I felt he went above and beyond. The downside: a VERY touristy, mall and resort-oriented area of Maui. Also, i'm sure with each of the units being different (privately owned) there _might_ be a couple apallingly decorated rooms, but ours was lovely. Housekeeping is the same all over the complex so they will likely all be quite clean. TIP: the curvy road around to the airport (a dotted line on some maps) is GORGEOUS. we drove the Hana Highway too, but this totally compares. it is a slow trip as it's 1 lane and 5-15 mph for much of it, but is a wonderful drive.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Wichita, KS", "Title": "“Nice place to stay”", "Author": "flygirl1224", "ReviewID": "UR5351868", "Content": "I enjoyed staying here. My husband and I got married on the big island on June 7, and hopped over to Maui for 3 days. The studios are cozy, but well equipt. We came from staying at the Kanoloa on the big island, and this was a little different experience. There are a lot of older couples here, but we did see a couple of other honeymooners. The beach is very nice, and fun if you like to body surf. We stayed in unit 129 which was on the back corner of the garden view units. They had this little fountain that was really loud (like it was working to hard), that I'm sure you could only hear from this room and maybe the one above it. Parking is a little tight, but adequate. They do also offer beach towels and bamboo mats which were very handy. The pools were nice, and one is heated. On the last day we were there, they were starting some sort of upkeep project, and there was a tile saw blaring at 8:00 in the morning. The price was right for the location and, other than a few minor things, we did enjoy are stay. If I was to come back to maui though, I might try another place.", "Date": "June 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Great place to relax”", "Author": "Le_Chiffre", "ReviewID": "UR4407392", "Content": "Very nice and quiet place. Far from huge hotels and traffic, couple of steps from the beach. Staff is extremely pleasant, rooms clean and cozy. Although most people staying were older couples - we had great time staying with our 2-year old.", "Date": "February 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Irvine, CA", "Title": "“Great for famlies”", "Author": "A TripAdvisor Member", "ReviewID": "UR4405522", "Content": "I have been coming to this property in November for the past 5 years. This property is very clean, amazingly close to an AWESOME beach and great deal. If you have kids, you must stay here. It is perfect for watching kids in the pool then back in the back, then back in the pool, then in the codo....lunch....and then do it all over again. Just a great gem in Maui.", "Date": "January 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Beaverton, Oregon", "Title": "“Napili Surf Resort--Fantastic!”", "Author": "lexigirl", "ReviewID": "UR3793361", "Content": "I can't say enough good things about the Napili Surf! We absolutely loved it there. We stayed in unit 218 in the Lokelani building in a studio unit. It had a full kitchen, complete with dishwasher, dishes, etc. The view was amazing, the unit was spotlessly clean, and the staff helpful and accomodating. The grounds were immaculate! If you're looking for a large, ritzy resort, look elsewhere. If you're looking to relax, unwind and laze away the days at a gorgeous place on one of Maui's best beaches, then the Napili Surf is for you. It's small, quiet and totally relaxing. It's just steps away from Napili Bay, as well as several restaurants and shopping. They even had sand mats for our use, as well as grills and shufflboard. We didn't get to attend, but they also have mai tai parties and coffee and donuts some mornings. Also on the plus side, the resort is totally non smoking! Nothing worse than going out onto you lanai to enjoy the sunset, only to get smoked out by your neighbor's disgusting cigarette smoke. For me, that alone is reason enough to stay at Napili Surf. There was no a/c, but we didn't need it, even in August. We simply opened up the slider, turned on the overhead fan, and listened to the waves crashing as we went to sleep. The trade winds kept the place plenty cool, which was great. The last thing I want to do while in Hawaii is sit in a frigid, air conditioned room. I can't recommend this resort enough!", "Date": "August 21, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Most relaxing place on Napili”", "Author": "meredithandmarley", "ReviewID": "UR3515660", "Content": "My husband and I prefer Napili Beach over others on Maui for a number of reasons: 1) good swimming and snorkeling 2) no \"meat market\" atmosphere 3) the Napili Surf The Surf is not a \"luxury\" property - however, if you stay in one of the oceanfront units, you have a better view than virtually any other \"luxury property on the island (we speak from experience having stayed in Kapalua, Kehei, and Wailea on some of our previous trips). The rooms are clean and comfortable with cable tv, kitchens, and nice beds. A/C isn't needed because the breezes keep you cool even on the warmest nights. The staff is friendly, helpful, and very accommodating. The grounds are lovely and you have everything you need in very close walking distance: restaurants, small market, snorkel rental, etc. This is a place to go if you just want to relax, veg, and do nothing but laze about. Most of the people here are middle-aged or older, but families with small children are welcome and we've brought our toddlers along the last two times we stayed there previous to this visit. There are two pools, so you don't have to walk far to take a dip and the oceanfront units are actually on the oceanfront. (If you haven't been to Hawaii before, be advised that all \"oceanfront\" rooms advertised as such aren't made equally - sometimes your view of the ocean may be through the bathroom window.....) We are going back to Napili again next month (third time in the last 6 months) and will be staying at the surf sans kids - looking forward to a restful time.", "Date": "June 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Tempe, AZ", "Title": "“Wonderful Hide Away... My New Maui Escape”", "Author": "A TripAdvisor Member", "ReviewID": "UR3369543", "Content": "If you are tired of the large hotels in the Kaanapali area just south of the Napili neighborhood, I urge you to consider this smaller, out of the way condo based resort. My girlfriend and I visited in January 2005 for ten days and could not have been happier. It was after the holidays and the kids were gone so it was quiet with mostly older (50+) couples and condo owners. We had an ocean view studio (Rm 216 in the Locilani Bldg ...see ------ ) which came with a kitchnette. One bedrooms are also available. We recommend this building with a room on the second floor, as it has direct ocean views and gets the full breeze off the ocean. Unless all the other rooms are full, we would not recommend the Garden view bldg. We saw whales and sea turtles the the small, but steep beach which was not crowded but great for snorkeling. The resort has a couple of barbeque mixers each week. As of May 2005 it will completely non-smoking. One thing - it has NO airconditioning so we picked up a $15 fan at Wal-Mart at Kahului before driving out and we needed it a couple of nights. And don't miss the FABULOUS crepes next door at the GAZEBO beach front. We'll DEFINITELY be back...", "Date": "April 17, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great!”", "Author": "Dustin C", "ReviewID": "UR2814306", "Content": "My girlfriend and I stayed at Napili Surf in January 2003. Having never been to Hawaii before, we did a lot of Web research before selecting Napili Surf. Napili Surf was true to its Web site and did not disappoint in any way. Positives: - Beautiful well-maintained grounds, clean and comfortable rooms, numerous lawn chairs for guests, two Weber grills for guests to prepare dinner, close to grocery shopping, Wednesday mai-tai party, gorgeous Sunsets, uncrowded beach, courteous staff. Negatives: - During our visit the beach was experiencing some severe and rapid erosion; the ocean was consuming it. I'm not sure if this was permanent or just due to the big waves during our visit. - Swimming in Napili Bay can be treacherous in the winter, when the big waves roll in. Some winter days can be extremely calm, too. While Napili Surf is not luxurious like the Ritz up the road, or Ka'anapli, it is a true beachfront Maui experience that lives up to its advertising, and therefore I believe warrants a rating of 'Excellent'. Indeed, I found Napili so beautiful that I proposed to my girlfriend on Napili Bay Beach. She said \"Yes\", and now we have wonderful memories of Napili Bay. Aloha", "Date": "November 9, 2004"}], "HotelInfo": {"Name": "Napili Surf Beach Resort", "HotelURL": "/ShowUserReviews-g60634-d87317-Reviews-Napili_Surf_Beach_Resort-Lahaina_Maui_Hawaii.html", "Price": "$150 - $228*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">50 Napili Place</span>, <span class=\"locality\"><span property=\"v:locality\">Lahaina</span>, Maui, <span property=\"v:region\">HI</span> <span property=\"v:postal-code\">96761</span></span> </span> </span> </address>", "HotelID": "87317", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/be/37/b6/napili-surf-beach-resort.jpg"}}