{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio, United States", "Title": "“Great place to stay away from downtown.”", "Author": "Jim P", "ReviewID": "UR126438263", "Content": "This is a great place to stay when you want to be outside of the downtown area. Staff is extremely friendly and helpful. Rooms and bed are comfortable and the hotel is never noisy. I got a business style room for $100/night which i thikn is is a great deal for Chicago. Red line train is about 1/2 mile walk. There is a lot of retail, restaurant and bar choices within walking distance. The only negatives for me are valet parking and old style TVs (need to update to LCD).", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cypress, Texas", "Title": "“Nice location”", "Author": "VallenatoJuan", "ReviewID": "UR126366969", "Content": "Stayed here last week over Spring Break. The hotel's best asset is its location. It is very conveniently located just about 3-4 blocks from the train station, the Lincoln Park Zoo & Park (free) and several other amenities such as restaurants, pubs, shops, etc. We felt very safe in the neighborhood and were happy to have chosen this location. The hotel is also very clean inside and out and has courteous, friendly staff. We also made an advance purchase for our room and got them at $88/night for a King bedroom which is a great rate. The drawbacks of the hotel are the breakfast, which, in my opinion, is truly a bare-bones continental. Rolls, waffles, doughnuts, that sort of stuff. But no eggs, ham, sausage or things that will truly hold you up through the morning. The breakfast room is also long but very narrow and doesn't seem to accomodate hotel guests too well at any one time, it always seem crammed and crowded. The actual room also seem small by most King-bed rooms nowdays. Overall, a good value when you consider we were only paying $88 for the location, but if we go and stay there again next time we'll budget for eating breakfast elsewhere around the hotel.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Coral Springs, Florida", "Title": "“Best value in Chicago!!”", "Author": "MamaFish52", "ReviewID": "UR126135592", "Content": "My son and I went on our first trip to Chicago to visit DePaul University. Days Inn Chicago was one of the recommended hotels through the DePaul website. I called several hotels and Days Inn offered a great rate. I opted for the larger room, which included 2 queen beds and a fridge. Usually, hotels look better in the photos you see ahead of time, but in this case, not only did the Days Inn deliver what it seemed to be by the website and photos, it hugely exceeded my expectations. The room itself was immaculate! The bedding was plush, white cotton, and the beds were so comfortable. I am often \"skeeved out\" by the bedspreads in hotels, but Days Inn uses white cotton duvets, which appear to cleaned and replaced with the fresh linens daily. That went a long way in making me feel the place was clean. The only drawback of this room, and I suspect the others as well, was that there is no vanity in the bathroom. The sink was a pedastal sink, making it a little inconvenient to not have a place to put down my toiletries, except for a small glass shelf above the sink. But then, I have a lot of toiletries and makeup and I'm used to spreading my stuff out. The bathroom did have a towel warmer though, which was a really nice feature, especially on the chilly mornings!! Our room was on the second floor, facing the street. I did hear some traffic, but didn't find it to be a negative. I signed up for a vacation in the city, so it was welcome. And when it snowed one night, we were able to watch the snow fall over the city street. Pretty cool (we're Floridians, so it was pretty novel for us). Best of all, there was an Urban Outfitters AND a Trader Joe's literally across the street. Loved it. The hotel is an older building (I think it was built around 1920) but has been renovated. The continental breakfast was standard fare and fine. Nothing fancy, but I'm not a big breakfast eater, so it was perfectly fine. And free. Cereals, fruit, oatmeal, bagels, juices and coffee, and make your own belgian waffles. It was enough. What I really have to compliment the most, though, is the service at the front desk. Being brand new to Chicago, I had no idea how to get around, where to go find the best deep dish pizza in Chicago, where to buy a CTA public transportation pass, etc. The folks at the front desk were so helpful, consistently. Can't say enough about them!! The hotel was located in Lincoln Park, north of downtown, and required a bus or train ride into the heart of the city. Bus took longer because it stopped every block or so, but I preferred it. Even though it took a little getting to to get into downtown, I still felt like the hotel was part of the city, which I wanted, and the rate was unbeatable. We stayed 4 nights, and it didn't break the bank. If you've never been to Chicago, don't miss Lou Malnati's pizza (walkable from the hotel), Italian Beef Sandwiches from Portillo's on Ontario Street (OMG!!), and The Field Museum. It was truly a fantastic trip, largely because of a great hotel experience!", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Decent”", "Author": "Thomas C", "ReviewID": "UR126105762", "Content": "I visited Chicago for about 5 days in October 2011 on the weekend which happened to conflict with the Chicago Marathon, so many of the downtown Chicago hotels were booked up. I ended up staying here at the Days Inn for 2 nights because of its proximity to Diversey station which took me downtown pretty quickly (~15-20 minutes depending on time of day). I wasn't expecting much for the price but was satisfied with what I got, which was a double bed room. The hotel was quiet, customer service was good, and overall a very decent stay. There was also free wifi. The only thing was that the washroom could use a little updating.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Santiago, Chile", "Title": "“Got what was expected”", "Author": "sarainsantiago", "ReviewID": "UR125659004", "Content": "After our stay in New Orleans, we are easy to please when it comes to lodgings: clean, safe, functioning wifi, and possibly a filling breakfast? Yes, please! Did Days Inn Chicago provide these? That they did. The hotel is an old building that seems to have been restored, but maintains the labyrinthe hallways that are ill-marked and make finding your room for the first time difficult - especially if you decide to carry your own luggage, as we did. Our room was small, but clean. The temperature was a but hard to control. The breakfast was buffet style with hot waffles. I was a fan ;) The staff was apathetic and not very helpful when it came to answering our questions. I'm not sure if tipping them would have helped? It shouldn't have. The big negative of this hotel is that you have to pay for parking. I know...I know it is like that all over Chicago, but a hotel needs to be very specific and tell a traveler that they should add $25 for their car's nightly room and board. Also, the parking garage that the hotel had an agreement with was at least three blocks from the hotel. Not a fun walk in the winter with suitcases! Fortunately, the hotel is close to several tourist destinations on foot - if you are into walking - and close to the train, for everyone else.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Downstate, IL", "Title": "“Well run hotel in great neighborhood!”", "Author": "bndrdndt88", "ReviewID": "UR125627354", "Content": "Booked a business room for a fun weekend. Many places within walking distance. Great resaurants, music clubs, comedy clubs, shopping. I like the neighborhood. The rooms were clean and the front desk was helpful. Only reason not 5 star was noisey furnace/heater, it really roared when it kicked in, and noisey cleaning crew. I know they have a hard job to do, but they don't have to let me hear it all day long. I swear the vacuum gal ran that vacuum all afternoon down my hall. But at least she was keeping the place clean. Used comp Ballys for a workout one day and it is a very good workout facility. That was very much appreciated. I hope they keep up the agreement with Ballys. All in all it is a great place to stay, helpful valet, helpful front desk and great location. Would stay again. WARNING: Stay away from a diner on Lincoln called Clarkes Bar and Grill: Very bad service and food. Every other place we dined and drank at was up to Chicago's high standards. Blue Man Group and Zaneys were great for enterntainment. Will go back for more.", "Date": "March 5, 2012"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Middleton, Wisconsin", "Title": "“Great location, but avoid the small \"Double\" rooms”", "Author": "Kristin F", "ReviewID": "UR125319104", "Content": "We spent just one night at this hotel while in Chicago. Location is fantastic if you're in the Lincoln Park/Lakeview area of town. Valet parking was reasonably priced; we turned the car over and walked everywhere. However, our room was one of the smallest and most uncomfortable I've stayed in. We had a double/full size (not queen) bed, with horrible pillows, and barely enough room to walk between the TV and the bed. The bathroom had no counter space at all. The shower head came out of the side of the wall, had very low water pressure and the faucet handle came off during a shower. My other complaint was that the hotel boasts a fitness center, but I found out there's not one on-site, but rather around the corner at franchised gym. Having said all that, I would consider returning - in a bigger room - simply for location alone.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Wrong information on website and little caring from staff”", "Author": "laura_w224", "ReviewID": "UR125313514", "Content": "I'm staying in this hotel right now. They say on their site they have access to a health club - they DON'T. One of the major reasons I booked the hotel was because their website says they have access to a health club right next door - we're travelling for 6 months then going home to get married and it's really important to us to exercise while we're away. We checked with the front desk girl on our first morning and she gave us directions to the gym. When we got there we were informed that the gym had changed hands 3 months earlier and there has been no agreement with Days Inn since then. We went back and the front desk guy said there had been negotiations and he would ask the GM what was going on. We went out for the day and checked back in the afternoon. One of the afternoon staff - the front desk supervisor - went and asked the GM when we got back. He returned to say no, there is no access, they are still working on it. I told him I wasn't very happy with this as one of the major reasons I booked the hotel was because they said they had gym access. He sarcastically informed me there was a lake I could run around 4 blocks away - I replied that I don't have running gear suitable for 0 degrees Celsius temperatures. I asked if he knew that it said on the website they have a gym, and he replied, \"yes, but it still says Bally's too\" - the name of the old gym franchise. I have no idea what this is supposed to do with the fact they haven't bothered to update their website information in 3 months - as I said to him, I should be able to trust the information on THEIR site and not have to fact-check. Other than that the hotel is fine. We were checked into an accessible room which was a little weird but not an issue, there is just a very large bathroom with 2 showers - I've just never had it happen before when there are other rooms available. I asked about this after we first saw the room and the same supervisor told me it was booked that way - I double checked my booking email and it just says 'standard room'. Was wondering if the other bedrooms might be larger if they don't have such a huge bathroom. Location is fine, the valet parking is easy, the other desk guy this afternoon was pleasant and the breakfast has a good selection. The health club issue is a major one for me as I feel I was misled and they don't care at all..", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wayland, Massachusetts", "Title": "“If you're staying in this part of Chicago”", "Author": "NAA304", "ReviewID": "UR125106174", "Content": "If you need to be in the Lincoln Park area of Chicago, you could not find a more convenient or comfortable place than this. It is located in a vibrant part of the city with lots of restaurants, stores and upscale neighborhood businesses. It is safe, clean, and the staff is very helpful and available. If you like a nice, old hotel with thoroughly modern accomodations, this is it! And for the price, it can't be beat. It has atmosphere, location, price and quality.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Amazing!”", "Author": "5weetooth", "ReviewID": "UR125030956", "Content": "I stayed at this hotel for five nights, and my experience throughout was nothing short of outstanding. I was at first greeting my amazingly kind staff, who made check-in a breeze. I was soon greeted by a beautiful room, which was simple, but very practical and clean. With free continental breakfast every day offering a diverse selection of goodies, I will definitely stay here again. After flying from Australia I needed a good night's sleep, and that's exactly what I got every single night. Do not look elsewhere, this is put simply the best place to be!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Urbana, Illinois", "Title": "“Comfortable, great location”", "Author": "labower", "ReviewID": "UR124503539", "Content": "Stayed two nights. Comfortable bed, clean room, good breakfast. Friendly staff, especially Anthony, who answered our questions and helped us with checkin. Not a quiet hotel -- the staff was vacuuming or cleaning a room up the hall in the afternoon. It sounded like it was right outside the door. But we had earplugs. In fact, the hotel provides earplugs!", "Date": "February 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Always the best!”", "Author": "David B", "ReviewID": "UR124245056", "Content": "We have been staying at the Days Inn, Diversey, every year since 2006. It is one of the best deals in Chicago, great location, great staff, excellent rooms, clean and they always give us the best! You can't beat the location, and if you're lucky enough to get an upgrade (or book one yourself) be business rooms are the best value in a great city! We'll be back again, for sure!", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wentzville, Missouri, United States", "Title": "“Would return”", "Author": "Carrington D", "ReviewID": "UR123614587", "Content": "We just returned from a 3 day stay at the Days Inn. It was great! The room was simple and small, but clean, inviting and was perfect for what we needed. PLUS - it was about 4 blocks from the L and everything was right there! Great Location!!!!! Highly Reccomend and will retun for sure! Staff was friendly and helpful.. Pictures online that they post are accurate. Good Job Days Inn!!", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antioch, Illinois", "Title": "“GREAT STAY!”", "Author": "Ralph K", "ReviewID": "UR123415625", "Content": "I've stayed at many hotels in Chicago. This was my first stay here. The staff go out of there duty call for the guest! They make you feel at home. The \"L train is only 4blks away. Bus stop in front of building. I forgot a RX when I packed Walgreens 1blk got my RX. Great food within a few blocks. Breakfast was cool I'm going to miss the \"easy-bake\" waffle machine. The valet parking guys that service guests were always ready to flag a cab or open a door, unload luggage if needed. I stayed 5days in a budget room. It was very comfortable. Wifi was flawless on I-pad, I-pod, XP netbook and Win7 laptop. Bed was very just right for a 6'-01\" 295lbs person. My only negative was having to checkout vacation over and go back to work.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great Chicago Value in a eclectic neighborhood”", "Author": "Fryfly", "ReviewID": "UR122362857", "Content": "I was apprehensive about staying in a Days Inn, as I am usually a four star kind of laday and usually stay downtown. I chose this hotel due to its proximity to DePaul University. I must say, that I was pleasantly surprised by the physical appearance of the rooms and the lobby! The staff was friendly and helpful, the rooms were clean and comfy and the free breakfast is good. I love the neighborhood, there are trendy national brand stores (Urban Outfitter, Trader Joes, Starbucks) mixed in with local favorites. Guests have complimentary access to Bally's. It is a very walkable and joggable neighborhood, imagine my surprise one morning when I literally ran into a zoo and beautiful gardens during one of my early morning jogs. Weather permitting, we usually walk to DePaul during visits to see our son and the discount for DePaul parents is a great plus. I appreciate the hotel's efforts at being green, though I am not so sure of what happens to the breakfast trash and would like to see more eco-friendly serveware. Try it you'll like it!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "amberes", "Title": "“A nice hotel next to Gold Coast”", "Author": "globbetrot", "ReviewID": "UR122325697", "Content": "Nice hotel with great rooms. A lot of space in the rooms. The breakfast buffet offers a lot. Making your own waffles is amusing. Reception staff gives good information. Good situation. The only negative thing is the noice on the street at night. When we asked a room on the backside, it was not possible but the nice receptionist gave us a business room (with 2 bathrooms and a sitting room) on the backside for 9$ a night!", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Nice Hotel”", "Author": "JetsForFunJourneys", "ReviewID": "UR122155826", "Content": "I had the pleasure of staying at this hotel for one night. The staff was friendly. The rooms were small, but clean. The hotel offered free continental breakfast. For parking, it is best to go to the adjacent mall and park there.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Little hot water in shower or sink, otherwise a bargain hunters delight, great neighborhood hotel--Trader Joes across st”", "Author": "2Midwest", "ReviewID": "UR121066500", "Content": "Do you like staying where the locals live instead of a downtown chain? Free use of the Ballys Health Club next door (including indoor pool). Great restaurants and shops steps from hotel. Take public transit (152, 156, Brown Line) to both airports, downtown, etc. Nice breakfast. Clean rooms. Polish speaking staff (yes, everyone speaks Polish who works there). Still, hot water is nice in the shower and while I like saving energy, I also like a little hot water. RECOMMENDED.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Excellent stay”", "Author": "Gatoric", "ReviewID": "UR120952007", "Content": "Don't let the Days Inn name fool you. I had second thoughts about reserving here, but fears were laid to rest after check in. There is a bus stop right outside the front door or it's just a short walk to the El station; lots of shopping, restaurants, and bars nearby, so the location is prime. The rates for this property, just north of downtown is much less than what you'll pay there. Parking is valet or self-park. I had a car for just one day and was able to park myself on the street and avoid both those options just 3 blocks away. If a car is an option for a longer period, the valet may be the best bet. The room itself was excellent, clean and comfortable. All the amenities you'd expect then some. Had a business room that included daily bottled water, power bar and popcorn. Based on previous reviews, requested and got an inside room that was quiet. Only once during my 3 days did I hear outside noise - that of a nearby fire truck. Breakfast was fresh and abundant. The breakfast room itself was a little cramped. Front desk staff was well-informed and friendly. An overall excellent stay - I'll be back next time I'm in Chicago.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire, UK", "Title": "“Excellent hotel in Chicago”", "Author": "JohnMaloney", "ReviewID": "UR120879066", "Content": "Must be the cleanest hotel in America! Excellent location with good bars and resturants very nearby. 10 minute walk to the 151/156 buses which will take you to all the attractions. Lovely rooms and beds. Excellent complimentary breakfast. staff endlessly helpful. Even stored our cases when we went away for three days. Diversey is a very nice area to stay in. fairly easy access to the L-line train from O'hare airport. Just get off at lake and get a cab. Again..this hotel was spotless. Highly recommended. Punches well above its star rating..", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Chicago”", "Author": "JAJ A", "ReviewID": "UR120619087", "Content": "I found the Staff to be very friendly and helpful. The location was perfect in the middle of lots of shops, restaurants, bars and transport. Since it was on a busy street it was very noisy and sometimes difficult to sleep in. Since our trip was very short (3 days) we didn't mind waking up slightly early. The rooms are very small but very very clean. I recommend this hotel for budget group stays, business travellers and for those who are planning to stay for a short weekend and want a clean place to rest their heads.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Clinton, Iowa", "Title": "“Great weekend!!”", "Author": "Marshabill", "ReviewID": "UR120601424", "Content": "We went to Lincoln Park Apollo Theatre to see MILLION DOLLAR QUARTET and wanted to stay nearby. We found the Days Inn through other reviews on TripAdvisor and we were very pleased. Yes, the rooms are small but it was adequate for a one-two night stay...very clean, front desk and other employees were very helpful and nice. The breakfast in the morning was more than ample and the attendant there was nice as well. Within walking distance of the theatre and a lot of good shopping and great restaurants. Ate at Michael Diversey's and it was wonderful as well. Couldn't say enough nice things. We used the valet parking which was really cheap considering we didn't have to worry about our car during out entire stay. It was great!!!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Very cool hotel!”", "Author": "ScottyG777", "ReviewID": "UR120536201", "Content": "It's hard to beat Chicago, it's such a great city. I haven't stayed in up this area of Chicago before but I had a couple of assignments in the Lincoln Park area and after reading the reviews on this hotel I decided to stay at the Days Inn. It couldn't have been better than it was, it's a great little hotel. I know that valet parking is a fact of life in big cities, or at almost any downtown hotel, but I'm not a huge fan of it. As a photographer, I need my car several times a day as the sun moves around a building and it's somewhat of a hassle to have to keep going to the valet folks to get my car to go to the project site, not to mention the expense of tipping everytime. But, that's a part of life in the big city. The valet guys here were super nice and super fast. That being said, the hotel itself was outstanding for such a tight space that it's in. I had a business suite which was a little bigger than a regular room and included a much-needed desk area. The bed was great and I didn't notice any outside or adjacent room noise really that I can remember. The bathroom was nice although a bit tight just because of the space limitations of such a small hotel. I didn't eat the breakfast because it was pretty carb-heavy and there was a Starbucks right across the street so I did that instead. They had a nice little sitting / dining area for the breakfast and there were quite a few folks in there when I went down to check it out. The room had a small fridge and microwave and ironing board, hair dryer, nice, thick towels and all the things you've come to expect from a hice hotel chain in a location like this. The location of this hotel is great, it's close enough to downtown that you can sneak down there using streets instead of the freeway which is quicker. Or, hop on the L which is probably a better idea since then you don't have to pay for parking once you get downtown. I paid $100 for my room which was an absolute steal for Chicago and for such a nice hotel. The parking was $24 a day, plus tips, so I probably paid $150 a day total with tax; not bad at all for semi-downtown Chicago in a super clean, nice hotel. I'd stay here again in a heartbeat and highly recommend it.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Great Hotel”", "Author": "Susyny2", "ReviewID": "UR120438627", "Content": "My husband and I have been visiting Chicago at least once a year for the last 11 yrs to visit our son and daughter in law.. Days Inn Chicago is the hotel nearest to their place, so that is the one we picked the first time. At that time the hotel was under renovations but we liked it enough to return and stay there. The only two times we have not been able to stay were because the hotel didn't have rooms available. Needless to say through the years, it has developed into a boutique hotel and it is very much in demand, to a point where we have to make reservations a year in advance to be able to get a room. The area is withing the city but away from the hustled and bustled of downtown. Transportation to downtown is easy and available.. one good point, it is close to Wrigley Field. Also have free breakfast and it is beautifully decorated during the holidays.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“\"Some improvements needed\"”", "Author": "brucegordon2", "ReviewID": "UR119973957", "Content": "This property is, as most reviews here show, clean, well-maintained, friendly staff, great location, good breakfast, etc. However, my stay was less than acceptable due to internal and external noise. Street and pedestrian traffic are facts of city life. But that said, I tried a street view room and the noise was quite disturbing. Thought of relocating to an interior room but realized the room doors bang shut and the service staff carried on loudly so this would have been moot. I believe it wouldn't take much to replace existing windows with a more soundproof variety. Only other complaint was the under-window AC/heating units, which, even on the lowest fan speed setting, would preclude a normal conversation in a room and require TV sound to be up very high to hear it. I will not choose this property again, unless and until I learn that appropriate noise limiting features have been added, and I know they could be.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Location": "4"}, "AuthorLocation": "Minneapolis", "Title": "“\"The Little Hotel That Could!\"”", "Author": "DONA C", "ReviewID": "UR119866210", "Content": "I really felt like this hotel was \"The Little Hotel that Could!\". Here are the awesome parts: The location is really good, the hotel was very clean and orderly and the staff (especially Neil at the front desk!!) was super friendly and nice. It was obvious to me that the people who run this hotel really care about providing a quality atmosphere to their guests - even the stairway was spotless and had pictures hanging at every level! My husband and I stayed there for one night, and I would definitely stay there again. Here's the downside: It is an older hotel and it shows. The TV's are the big tube kind and the decor/furniture, while super clean and in good condition, is kind of old looking. Overall, I'd say this hotel is an excellent value in a great location and it really seems like the people who run the place care.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "MI", "Title": "“Great neighborhood Inn”", "Author": "margiemi", "ReviewID": "UR119805848", "Content": "This was a perfect place for us to stay while visiting our college kid who lives In Lakeview. We were walking distance to everything we needed. The hotel was clean and everyone was very friendly. Would definitely stay here again!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Not Your Average Days Inn”", "Author": "jsguyrus", "ReviewID": "UR119723274", "Content": "I stayed at this hotel for three nights. It is located about six block from the CTA brown line Deversey Station. You can take the train directly into downtown or with one transfer to either airport. The neighborhood is very safe and walkable with numerous restaurants, bars, stores and markets within two blocks. The hotel itself is proably the most upscale Days Inn you would ever find. The building is older but has been updated. Rooms vary from quite small to roomy.A free breakfast is served until 11am each morning. All rooms have free wi-fi which works very well. Be aware it is valet only parking. It really is quite a nice hotel. The only downside is it is in a busy neighborhood and rooms that face the street get A LOT of street noise.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Repeat guest”", "Author": "Otoh", "ReviewID": "UR119438743", "Content": "I always try to stay here if possible--must book early. It's the best value in Chicago. The room is basic but comfortable. It's in a great neighborhood--good restaurants, shops, Trader Joe's, free access to Ballys Fitness Club, and a very nice indie movie theater around the corner. Steps to the EL and a manageable walk to DePaul University. Good breakfast complete with waffles is included. No complaints.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Noisy!!!”", "Author": "hudsontravel1", "ReviewID": "UR119415162", "Content": "We booked a two night stay through Priceline- although not \"name your own price\" so actually no cheaper than if we had gone through hotel directly. At any rate, our room was closet-sized and the window at the intersection of two busy streets. The noise made it impossible to sleep (did not bode well when we saw the room comes equipped with earplugs). The bed is also listed on website as a double but was smaller and shorter than any double we have ever slept in. Maybe to fit into such a tiny room? I will say the next morning when we asked to be moved to a different room they accommodated us, but it was a long, MISERABLE night of no sleep with the constant street noise of vehicles, sirens, horns honking etc. with no compensation.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winfield, Illinois", "Title": "“Fantastic!”", "Author": "rr26", "ReviewID": "UR119274867", "Content": "I was very unsure about this hotel, being so small. My daughter was getting married and my SIL arranged rooms here. What a great place! Great price, valet parking @ $22/ night (in and out privileges) was cheap (check it out at other Chi hotels) and the valet service was super fast. Room was smallish, but very nice, well appointed w/ many amenities (Microwave, fridge, safe,and coffee maker) you never see in a small hotel and some large ones. The complimentary breakfast was great. Coffee, juices, bagels, and waffles...what else could you ask? Clean doesn't begin to explain it, as it was immaculate! Special kudo to Eric (Valet, porter, the guy who brings your bags to and from the room)! You did a great job! Very fast, efficient, and friendly. We had a lot of stuff in and out all weekend and he was perfect. But so was the desk staff, maids, and valets. There were many people from out of town staying here and I'm sure they would echo my comments. I have stayed at many high to medium level hotels all over the country. This place could compete w/ them all and win. Absolutely nothing bad to say. Definitely staying there again.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Weaverville, North Carolina", "Title": "“Good location and affordable”", "Author": "cbw_1066", "ReviewID": "UR119260435", "Content": "Our stay was for 3 nights and it was comfortable.Lots of restaurant choices in walking distance.With our CTA pass we had unlimited choices for bus and train connections, which came in handy to visit many areas.The bathroom was small but sufficient for a short time.Service was good.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Golden, Colorado", "Title": "“Great Place”", "Author": "Bobman14224", "ReviewID": "UR118691417", "Content": "Great location, great room, great service, great stores (new Trader Joe's across the street), great restaurants. Pick interior rooms for better noise control due to traffic noise outside.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bismarck, North Dakota", "Title": "“Great, inexpensive hotel close to Wrigley Field”", "Author": "jstew34", "ReviewID": "UR118586188", "Content": "Location and cost are the reasons we choose this hotel when visiting Chicago. This is the third time staying there. If you want big name stores and eateries then don't stay here. The neighborhood has many boutique stores and great mom and pop restaurants. This property is old but has been renovated. The rooms are clean and the staff is very friendly. The location is exactly 1 mile south of Wrigley Field.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Iowa City, Iowa", "Title": "“Great location”", "Author": "Solotravel-lover", "ReviewID": "UR118495647", "Content": "My adult son and I traveled to Chicago to celebrate the successful completion of his cancer therapy. We chose to have 2 standard single rooms, were assigned neighboring rooms which were quite comfortable and adequate. Housekeeping services were excellent. We were able to walk to Wrigley Field for a baseball game, the Lincoln Park Zoo, and assorted other tourist-ish and shopping attractions. Lots of good restaurant options nearby. Valet parking was prompt and courteous. Front desk helpful. Room toiletries standard, except for the thoughtful inclusion of earplugs, which I've not seen at other hotels. Continental breakfast included. Rates were very reasonable. Public transportation conveniently nearby, although we didn't use it on this trip. We hope to stay here again.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Home away from Home”", "Author": "dudekennedy", "ReviewID": "UR118415634", "Content": "After moving to California three months ago away from Chicago, this Days Inn was my home-away-from home on business. I had a clean and quiet room complete with a very comfortable Queen size bed. Complimentary coffee, bottled water, and a granola bar were in my room, along with a free Continental breakfast in the lobby. I'd like to note that if any noise disturbed me, my bathroom had complimentary (wrapped/sanitary) ear plugs nestled by the shampoo and conditioner. The hotel staff were very attentive and made sure I enjoyed my stay. Great location and near lots of attractions.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Best Days Inn I've ever stayed at”", "Author": "alinemramos", "ReviewID": "UR118071752", "Content": "This was by far the best Days-Inn I've ever stayed at. We were on a family trip and I didn't want to stay in downtown Chicago, so I found this to be just the perfect location: close to Lincoln Park (and the Lincoln Park Zoo), with a ton of shops and restaurants nearby, walking distance to the subway (\"El\") stop, and literally around the corner from the bus stop for buses that go downtown (in just about 20-30min.). The room was really nice (we got an upgrade to a business place room, so couldn't complain!), spacious, clean... The lobby was just beautiful and service was extremely attentive. They also have free breakfast, which is also quite good. Excellent cost-benefit. Can't beat the location. Would definitely stay here again.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Overpriced and Isssues”", "Author": "ATLtoEUR767", "ReviewID": "UR118066139", "Content": "I decided to stay in this hotel based on the location and it was only a short walk to the Lakeview area. Unfortunately Chicago has many hotels Downtown and inside the Loop but only a few options up north in the Lakeview/Wrigley Field area. After arriving to the hotel and checking into my room it was pretty clear that I paid too much for what I got. The room was a bit dated and my view looked directly into other hotel guest rooms, I had no city or street view at all. The internet worked well, the bed was low to the ground and not very comfy. On day 2 of my stay I received a call from the front desk stating they had a noise complaint coming from my room. I told him the only noise coming from my room was the phone when it rang being that I was sleep and there was no TV or radio on in my room and I was alone. He then stated that he was sure it was my room, at this point I told him to feel free to come up and inspect and I would be more than happy to let him in my room. The whole incident was seriously annoying but the bad service doesn't end there. After leaving the hotel and getting to the airport I realized I could not find my work cell phone. I called the desk and they transferred me to the housekeeping department. The person stated that they would have to wait until the housekeeper cleaning that room was done for the day before they would know if the phone was found. She stated she would call me back by the end of the day but I had heard nothing by the next day so I called back and left a message only to be ignored again. Of course it is my fault for leaving the phone but it is about the hotel service and how it was handled that disappointed me. I would not stay at this hotel again and due to elevated prices and limited options in the specific neighborhood I will get a 3 or 4 star room off Hotwire or Priceline for half the price and stay inside the loop.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Grand Rapids, MI", "Title": "“Great value, super-clean!”", "Author": "RainefromNYC", "ReviewID": "UR117839914", "Content": "Service was excellent--the staff was super-friendly and available (they have a doorman! We did not need a taxi or anything, so we didn't utilize him, but it was nice to have a friendly face each time we left the hotel). The location was good--near the Lincoln Park area and Wrigleyville. We were not in town long, so we did not go downtown or to the \"mile\", but it is only about three miles from that area.The rooms were not huge, but that's to be expected in a city hotel. The beds were AMAZING!!! Like the \"heavenly bed\" a certain other (much higher-priced) chain offers. Our room was extremely clean, and contained a mini-fridge and a microwave (great because I had a toddler with me). The free continental breakfast was plentiful and greatly appreciated. The seating was slightly cramped, but we went at around 9am and it was starting to empty out. There was a waffle maker, cereal, coffee, juice, etc. There were some delicious donuts, but those were gone by the time I got up there again. The beds were the best thing about the room . . . I can't think of anything I liked least--except maybe that you would have to pay for parking (we had access to a friend's private parking, which helped). This was a great deal and I would absolutely stay here again!", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "milford mich", "Title": "“great location,very clean,great price”", "Author": "rei45", "ReviewID": "UR117773788", "Content": "everything is at this location..restaurants,shopping,and easy walking and close to the El and busses...everyone was very friendly at this hotel...it was very clean..the continental breakfast was fresh and lots of choices....i was actually very surprised how nice this was and the price was very fair...we will be back again...if you want to be in lincoln park and near depaul university ...this is it.....", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "NYC", "Title": "“Perfect for a Cubs Game”", "Author": "catwater07", "ReviewID": "UR117400490", "Content": "Stayed for one night last week while in town to see the Cubs. This hotel was in a perfect location, near enough to Wrigley to walk if you want (we walked, it took about 25 minutes or so), also close to a bus that goes straight there. It's also very close to Lincoln Park which was awesome to walk/run through, as well as being in the neighborhood with a bunch of smaller scale restaurants, bars and shops that looked like tons of fun. The hotel itself was nice, the beds were slightly hard, but worth it for the location, included breakfast, and nice staff. Will definitely be staying here again!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Good value and location”", "Author": "BMarshall123", "ReviewID": "UR117380820", "Content": "This Day's Inn is in a great location, I was able to navigate Chicago's public transportation and get anywhere I wanted within the city (all the tourist attractions, and the airport.) The area is nice and safe to walk in with lots of stores and restaurants you can walk to. The hotel itself is cute and clean and the free breakfast was nice. The staff was VERY friendly and helpful with anything I needed. The room is tiny, but I was traveling alone so it's all I needed. However, because I booked through a travel website, I was led to believe that all the rooms had refrigerators and microwaves, due to them being listed on the site as amenities. When I got there, I learned that those are only in the upgraded business rooms and would coast and extra $60 per night. So keep that in mind. Also, my first room had a very strong smell of urine in one particular spot on the carpet- (probably a toddler accident, it happens) and I had to complain. But they moved me to another room, no questions asked. Some of the tvs have upgraded new flat screens, some of them still have big box tvs. I don't really care about this, but I noticed when I switched rooms. (For what it's worth, the big box tv in the first room worked fine, but the flat screen was a little screwy and would randomly turn off or stop responding to the remote.) In any case, I would stay here again, but probably only pay less than $100/night. I think it's worth that. They also charge for local calls, a slight annoyance because I had the misfortune to break my cell phone during my stay. If you are booking through a travel site, make sure you are actually getting a deal that is cheaper than directly through the hotel's site.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great hotel at great price!”", "Author": "DCTraveler99_10", "ReviewID": "UR117314457", "Content": "This hotel is wonderfully located in the Lincoln Park area of Chicago, which has lots of wonderful shopping and restaurants (and is near the zoo, parks, and beaches). The hotel reminded us of a fancy European boutique hotel - it is modern, clean, very pretty, and the staff were extremely friendly. The breakfast had fine food, the room we had was spacious, and the beds were very comfortable. Guests also get to use the nearby Bally Fitness Center for free. It is definitely the best Days Inn we ever stayed in and we will definitely be returning. (Note that this hotel is not downtown, so if you need to be located in or near the Loop, it is probably not for you.)", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lansing, MI", "Title": "“Great Stay”", "Author": "mpmiller", "ReviewID": "UR117254535", "Content": "Travelled with a friend for a quick getaway. We were in a room with 2 beds, fridge, & micro(we were in room 403), room with views of Clark St. As always it was a great stay, staff very friendly, and willing to help in any way possible. If your not a continental b-fast kind-of-person, I would suggest The Golden Nugget one block south of Diversey on Clark.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good hotel BUT factor in expensive parking!”", "Author": "Heidi Z", "ReviewID": "UR117024287", "Content": "Busy location but near train station to get into city. Big tick. Slap in the face is the $20 a day parking, but seems to be expensive everywhere, saw $45 a day in Chicago city! High quality hotel, nice rooms. Did ask for a inner facing room, but still got street view room. Was a bit noisy but noise level dropped between 12-7am so it was okay. Bathroom had a large step so stubbed my toe a bunch of times which was very irritating. Got a large king size bed, very comfortable. Decent breakfast with waffles and pastries. Slow lift and pricey internet access. Was close to an Aveda store which was like fate for me! Found a very cheap diner nearby that had main meals for $7.95 and delicious Red Velvet Cake. Overall happy but add $20 to the price of the room and decide if this is in your price range.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Plainfield, Illinois", "Title": "“Great Hotel”", "Author": "Susan M", "ReviewID": "UR116728682", "Content": "I stayed at this hotel when Paul McCartney came to town. This is an exceptional property. We had a suite and it was fantastic. The hotel is immaculate, the front desk staff is friendly and really helpful. My room was ready before 2 p.m. and I didn't even request an early check-in. It's an older hotel so the elevators are small, but it is also secure as you can't get on a guest floor without a room key to activate the elevator. The valet parking is great. The breakfast was more than I expected for a complimentary offering at a Days Inn. Everything was fresh and continually replenished. Great location within walking distance to anything you could possibly need or want. I will stay here again and have recommended it to others who want to spend a weekend in the city at a reasonable price.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Davis Junction, IL.", "Title": "“We would recommend this hotel to any Cubs fan (and the 2 people who aren't)”", "Author": "Patti R", "ReviewID": "UR116615080", "Content": "On a recent visit to go to a night Cubs game, we stayed at this property. The staff was amazingly helpful and courteous. The accommodations were spacious, tastefully decorated, and very clean. Everything associated with this hotel was wonderful! We would definitely stay here again and would recommend it to anyone else, also.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Tight fit”", "Author": "MikeC196135805", "ReviewID": "UR116546951", "Content": "The hotel seemed to be an after thought between two buildings. The enterence was long and narrow leading to a small lobby and check-in desk. The elevator was small, slow, and hopped when it stopped at each floor. The room was small, but nice. The breakfast was good. I was most impressed with the service.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Good buy near Lincoln Park”", "Author": "Buzzhombre", "ReviewID": "UR116037972", "Content": "This is an older 4 story hotel at Clark in Diversey, just a couple of blocks from Lincoln Park, the Lake, and Boystown. Not far from Wrigley Park, either. The rooms have been nicely renovated, and the Business Plus rooms are particularly nice, with microwave and refrigerator. There are MANY good places to eat in the area, and a good variety of night life. A great location for gay travelers. You'll also find lots of international guests. The have the longest hours on the continental breakfast of any hotel I've ever seen--6:30-11:00. There is a good variety of offerings at the breakfast, as well. Friendly staff. Valet parking is a bit pricey, but you don't really need a car, the El is about 5 blocks away.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Rock Falls, Illinois", "Title": "“Cub Game Overnite”", "Author": "Traci09", "ReviewID": "UR115912734", "Content": "Staff were very friendly and helpful. Our room was ready early (noon) so we were able to get checked in and leave our bags as we headed to the 1pm game. The room was small and all white, but clean and the bed was comfy. The doorman had taxis for us within a minute, which was great because we were running late. The next morning I skipped the free continental breakfast, it was just too crowded. Instead, I crossed the street to 2 of my fav stores... Trader Joe's and Urban Outfitters :)", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“Good place to stay with a good location!”", "Author": "Luweez66", "ReviewID": "UR115696288", "Content": "Everyone on the staff was very nice and helpful. The room and king size bed were very clean. Our room was equipped with microwave and refrigerator, which came in handy. The air-conditioner was a bit noisy but cooled the room quite well. The free breakfast was quite good, accommodating business people, families and couples, Fresh orange juice and grapefruit juice was served, the coffee was very good, there was a good selection of cereal, baked goods, bagels & waffles. The variety of jam, jelly and peanut butter was a pleasant surprise. There was even soy milk and fresh apples/oranges. The price wasn't bad either! The hotel is in a good location to the museums, aquarium and Lake Michigan. It's not a bad area to walk around, either!", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Phillies @ Cubs - We will be back! Great Town”", "Author": "johnfizz", "ReviewID": "UR115652845", "Content": "If you have the pleasure of staying here, hopefully you get to deal with Casey. He is a younger gentleman working the front desk and he made our trip even better. He was so helpful, let us keep our bags aside before check in, let us use a room to change before the game and even got us a room for an extra night due to a delayed flight! I have stayed in several hotels and had some great service but he really stood out and made things so easy for us out-of-towners. Cant wait to go back! Go Phillies!!!!", "Date": "July 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ankeny, Iowa", "Title": "“Go Cubs Go!”", "Author": "MarriedInBarbados", "ReviewID": "UR115489159", "Content": "What a great location. Quiet in the room. Air works great. Beds are super comfy and extra pillows on each bed. Clean and spacious room. Super large closet. Nice clean bathroom. Would definitely stay here again. Cubs are about a 20 minute walk From the front door.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bakersfield, CA", "Title": "“Excellent location”", "Author": "waltonway", "ReviewID": "UR115192120", "Content": "I was very pleased with my stay here. I reserved a room with 2 double beds. The hotelâ€™s location in the Lincoln Park area is excellent, and one can easily walk to a variety of restaurants and bars. The valet parking is reasonable at $22 per day with unlimited in and out service. The complementary breakfast is good, and the WiFi is free. Access to Bally's fitness center is also free. This fitness center is excellent with a great view of the city and a great selection of machines, free weights, pool, and runing track.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“we had the best time ever! we will be returning when we travel here again soon!”", "Author": "Justine43501", "ReviewID": "UR115093592", "Content": "My family had the BEST experience here! The people were very friendly and courteous and looked out for all of our needs. I will recommend this hotel to everyone traveling to Chicago.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“A for Awesome”", "Author": "psward", "ReviewID": "UR114972677", "Content": "I usually don't spend the time to write a review, but this place is worth it. Our stay was for three days and we booked a room with two double beds. Upon arrival I was informed that we got an upgrade to have a room with two queen beds which meant also a larger room. This was great news. To me a hotel is only good if it is clean and quiet. Well, clean it is. Hotel cleaning staff was excellent and our room was kept well during our stay. No bad odors at all. Quiet, well the block itself is not so quiet, but the rooms were sound and we never heard anything within the hotel walls. I had the air on high at night and not a sound. Slept well there. It appears that the hotel was recently renovated. Everything was clean and looked good. Now don't go in expecting a high-rise hotel room. This place is quaint and quiet. Reminded me of European boutique hotels. Great location in Lincoln Park area. Wonderful non-chain restaurants within walking distance. Hotel staff was on the ball. Something you would expect from a high end hotel at 1/3 the cost. Cannot say enough about everyone who works there. OK I now sound like I am gushing, but it really was a nice stay.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bloomfield Hills, Michigan", "Title": "“Great place to stay”", "Author": "Sancho5a", "ReviewID": "UR114846149", "Content": "This is a great place to stay when you are in the Lincoln Park area. Our family was here to search for an aparment for our daughter and we were thankful for this relaxing and clean place after a long day of house hunting. We will definitely return!! The hotel itself is newly renovated, very clean and the staff is very friendly and helpful. You can do valet parking for a reasonable rate or you park your car yourself in a parking garage close by. The rooms are nicely decorated and this includes white linens and white towels. The beds are comfortable. The area around the hotel offers many lovely restaurants and little shops from groceries to clothings stores. This area gives you the best authentic feeling of the neighborhoods in Chicago. Ulrike, Bloomfield Hills, MI", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Waukon, Iowa", "Title": "“Great place to stay for a Cubs game”", "Author": "world_travelita", "ReviewID": "UR114722874", "Content": "I stayed here with my boyfriend on June 18, 2011. We were in town to watch the Cubs play the Yankees and this hotel provided a great location with only a 15 minute walk to Wrigley. Parking was extra, but worth not having to worry about our car all weekend. Our room had one queen bed, an updated flat screen tv, and an updated bathroom and was considerably bigger than others I have stayed at in Chicago. The room was very clean. The only downfall I would mention is the bed was extremely hard! (Pillows were great though!) I would stay here again.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“A good, reasonably priced place to stay”", "Author": "BunclodySenator", "ReviewID": "UR114689841", "Content": "I was visiting Chicago to see friends, the first week of June. there was an Oncologists' congress in town, so it was hard to find a place to stay. A friend recommended the Days Inn Chicago. It is NOT the Ritz Carlton or the Peninsula, or the Four Seasons (hotels I've stayed in before, and which are all superb), but it was a fraction the price. I couldn't find a room under $600/night at the previous three, because of the congress. Including taxes etc, I paid less than $200/night . I got a very large sized room, with a king bed, a kitchenette, and a bathroom. there was even a flat screen TV. It was not the fanciest room I've ever had, but it was clean, spacious, and comfortable. And also quite convenient.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Salem, Oregon", "Title": "“None better!”", "Author": "fussy10_11", "ReviewID": "UR114583126", "Content": "We found this to offer everything one could want. (Maybe we're partial because we got upgraded to the \"business suite\".) They stored our luggage when we arrived early in the day, the valet relieved us of our car and it was only a short distance to a bus to the city center at $2.25. The room was very clean and supplied the usual toiletries. Breakfast offered several choices. We felt very secure as one needs a key card to access the stairs or elevator.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Castro Valley, California", "Title": "“Chicago Trip to Meet Manfacturer”", "Author": "roc94546", "ReviewID": "UR113144558", "Content": "This was my first trip to Chicago and the Days Inn on Diversey. What a wonderful experience with both. Chicago is a great city and the Day Inn was not only clean but comfortable. I also appreciated the old fashioned charm of the rooms. Friendly staff and fantastic complimentary breakfast. I would recommend this hotel to anyone traveling to this part of Chicago.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Singapore", "Title": "“Great location but ...”", "Author": "WLL", "ReviewID": "UR113124535", "Content": "Great staff and convenient location. If you like jazz, don't miss the Kingston Mines closeby, and if you are catholic, St Clement's church is a beautiful parish 10 mins slow pleasant walk in a nice residential area.close to hotel. Hemes Indian restaurant, a street away served authentic fresh Indian food. There's also a nice variety of restaurant choices within close proximity. Easy to get to McCormick Place. Hotel bedroom tho clean is tight and small, which naturally means a tiny toilet and bathroom. However everything is clean. We had a king size bed which was lumpy and uncomfortable and the aircon was noisy. We did not feel rested despite being completely tired after full day at convention..Did not want to fuss so decided will try another hotel next year. However the hotel has written to ask our feedback and has promised to check and get back to us.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“Excellent location, service, but small rooms”", "Author": "Soniab13", "ReviewID": "UR112966764", "Content": "This hotel is a step above what you'd expect from a Day's Inn. The service is exceptionally great, and the rooms are nice but small. I got an \"upgrade\" this visit and I be afraid of how small the un-upgraded rooms are! The size of the elevator is a good indicator of the room sizes. The reception desk helped me find a good place to eat nearby and overall were very friendly. The bell staff worked very hard to get me a cab at a peak time too. The rates are high, but this hotel is almost always sold out when I try to stay there to visit a friend in the neighborhood, so I'm usually just happy to get a room. The room I was in was somewhat close to the elevator and I heard a lot of hall noise through the door. The free wi-fi is very much appreciated too. Breakfast was included too but I didn't give it a try - preferring to go to the Chicago Diner.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Wollongong, Australia", "Title": "“A homely comfort”", "Author": "TalkingTravel", "ReviewID": "UR112776072", "Content": "Days Inn Chicago lies within the northerly suburbs surrounding Chicago's city centre. The property itself may appear slightly dilapidated to some, however it provides considerably comfortable and homely accommodations. It is at this hotel that I have, quite possibly, had some of the best sleep that I have ever had (albeit with earplugs in). To begin with, I was allocated a room on the hotel's front, facing the very noisy Diversey Pkwy. Shortly after arriving to my generously sized room, I called the front desk to be relocated to a quieter room. Unfortunately, there were none available in my room type, and I was asked to wait to the following day for a room change. This was quickly arranged the following morning, and I was moved to a very quiet, interior facing room, although the room itself was considerably smaller. This did not bother me in the slightest. I might add that I was perfectly able to sleep, regardless of the street noise, as I had an unfortunate experience from my prior hotel, whereby I was unable to sleep all night. In addition, I was wearing earplugs. The new room was very much the same. Well equipped, comfortable and most importantly, much quieter; although it was considerably smaller. The room provides adequate amenities, and is very clean. The bathroom is quite small, however it is perfectly adequate. The television is an older cathode ray style set (CRT), but it works, and the air conditioning unit is also of older style, and did not appear to cool the room down in the slightest. The rooms also feature an in-room safe, which is always a positive. The complimentary breakfast is plentiful and well presented. Food items include, but are not limited to, cereals, doughnuts, croissants, freshly made waffles, Bagels, muffins, coffee and freshly squeezed orange juice. A vending machine for snacks and drinks is available in a room adjoining the front desk, in addition to clothe washing appliances: all for a very minimal fee. There were very few negatives to my stay. The first, was the fact that my room was very noisy. This was soon rectified. The rooms and their furnishing's could do with a modern update, although they are quite comfortable and adequate as is. I was never able to take a shower, as the hot water would flow sporadically. I was required to take a bath each and every time, as the water temperature was never stable. The complimentary in-room coffee and condiments were only refilled occasionally. At one time, I was required to call to arrange for some sugar and milk substitute to be brought to my room, however this request was fulfilled immediately. The property features no restaurant facilities, although it is a stone's throw from multiple restaurants, many of which are quite good! There is also no room service, spa or swimming pool. No gym lies within the hotel, however guests are offered complimentary access to a gym nearby. Days Inn Chicago is not an upscale hotel, so the fact that it is lacking these services should be expected. I will also add that I did not feel it was in the best location for my needs. To reach the city, the most appropriate avenue is via the train line, which is a 15 minute walk from the property. If wishing to visit Lincoln Park or Lincoln Park Zoo, it is approximately a 30 minute walk. It is in a very suitable location for Lincoln Park, but not if wishing to frequent the city. Otherwise, Days Inn Chicago offers a comfortable, homely atmosphere for all guests. It is by no means a classy or luxurious hotel, but it certainly does the job, and it does it well.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Perfect to see the Cubbies!”", "Author": "bellamia123", "ReviewID": "UR110358315", "Content": "We stayed at the Days Inn for 2 nights to attend a few Cubs games. We stayed in the most \"economical\" room - the room with one full-size bed. Yes, it was small, but for the rate (99 per night) and location, it was an overall good value. The room was extremely clean and had a lot of art-deco style charm, but also included the standard amenities found in any Days Inn property. The front staff was courteous and friendly and the breakfast, although just pastries and doughnuts, was clean and well-maintained and definitely much more than you could expect from a full service hotel breakfast with a $12.95 a person price tag. Yes, parking was $22 a night for valet, but if you're in Chicago, you better get used to paying that much, or more, for parking anywhere you go. Note about the location: The hotel is located in \"Wrigelyville,\" or the Lincoln Park neighborhood, which is a perfect area for walking around and hitting some great bars and restaurants with fellow baseball fans before (and especially after) a game. However, keep in mind that Wrigley is at least a mile from the hotel. Although we had no issue with the walk, and actually, rather enjoyed it, this could be problematic for some. Parking at and around Wrigely is $25-$35 and is absolute bedlam. If you can avoid it, I would not suggest driving.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Probably the Best Days Inn I've Stayed In”", "Author": "lorigirl74", "ReviewID": "UR108998150", "Content": "After checking other B&Bs and hotels close to transportation, Lincoln Park, and Wrigley Field, I settled on the Days Inn. I'm glad I did. We took the bus to meet friends once, but the L wasn't too far away. The price was great for a hotel in the city, I thought (except for the parking that was done around the corner at the mall). Our room was ready around noon and we got a handicapped room (not requested in my reservation and neither of us are handicapped) but it was a little more spacious than the typical room due to the need for accessibility. So bonus! The lobby was nice, the breakfast bar was standard, the bed was not bad. However, my two complaints would be the hallway noise (very thin walls/doors?) and the time it took for the water to get warm enough to shower (very slow in getting hot water and we were on the second floor). You would think with a handicap shower AND a lowered bathtub with shower water pressure would be better. Neither was enough to report to the front desk, but it should be noted that ear plugs were provided int he bathroom, too.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Reasonably priced, tidy hotel in convenient location”", "Author": "runawayvespa", "ReviewID": "UR107358379", "Content": "The room was large, bright and tidy. The bed was comfortable and internet was fast. Our room was only $80 a night if we booked over 3 nights, so I was happy with the price. There was valet parking, costing $22 a day. After reading the previous review I was glad to see my car returned with no dents. The noise from the street was incredibly loud. We got woken up by several times by fire trucks charging along the street, buses and rowdy people. For the rooms facing the street they need thicker curtains or double glazing, the noise was unbearable. Breakfast options were tasty and I appreciated that breakfast was open until 11, as I usually get up too late to eat complimentary breakfast in hotels. The housekeeping was annoyingly persistent as I rarely let housekeeping clean the room while I stay at a hotel. Even though we had a do not disturb sign on the door housekeeping kept calling and coming up to see if we wanted the room cleaned. On the third day they insisted the room had to be cleaned, even though we didn't want it. The do not disturb sign needs to be respected! The location is good, there are plenty of pubs and shops around. Buses stop outside the hotel and trains into the loop are a 5 minute walk away", "Date": "May 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Grosse Pointe, Michigan", "Title": "“BEWARE-DO NOT STAY HERE”", "Author": "jell12345", "ReviewID": "UR104432219", "Content": "The valet damaged my car and tried to hand the car back to me like nothing had happened. My taillight was shattered and the surrounding body was dented and missing paint. When I realized the damage they had to have known they caused, I went to the front desk to speak to the manager who gave me the worst, most disrespectful, and unprofessional attitude and offered no form of compensation or incentive to ever stay here again. Of course they wanted to avoid any blame and did nothing to reciprocate or make me ever want to stay here again. I was still charged the near 50 dollars a day for valet, despite the damage done to my car. I also had to wait an hour for a valet manager to arrive so he could make an incident report. This was my third time patronizing this hotel and surely my last. My girlfriend's mother was going to stay here when visiting her and we were sure to warn her and change her mind.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Great Falls, Virginia", "Title": "“Inviting and efficiently run ''Home Away From Home''...”", "Author": "Katshi", "ReviewID": "UR103898894", "Content": "The Days Inn at Lincoln Park in Chicago is an inviting and efficiently run, \"home away from home\" for me whenever I visit my kids in Chicago. My recent stay in March was pleasant and comfortable as I have come to expect, with the friendly professional staff from the desk and valet services to housekeeping, everyone helping to make my stay in Chicago at the Days Inn cozy and convenient! The location is great, and a nice breakfast is a bonus.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“My favorite Chicago hotel”", "Author": "xiola", "ReviewID": "UR103233294", "Content": "We were recommended this hotel by a friend in the music industry, who has stayed here many, many times. I could not be happier! Perfect location, extremely friendly and helpful staff, awesome breakfast, comfortable rooms, valet parking with the option to take your car in and out as needed - this hotel has everything you need. Check out their Facebook page for specials and packages.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TN", "Title": "“Very nice and good value”", "Author": "petesrig", "ReviewID": "UR102800815", "Content": "We were visiting DePaul U with our daughter and chose this hotel because it was on DePaul's list and because of the reviews on Trip Advisor. It was very nice. The staff was friendly and prompt and everything was clean and cared for. There is self-parking close by and valet parking as well. The continental breakfast was good with decent coffee. We are vegan and were delighted to find soymilk offered along with cowmilk. We reserved an executive level room. It was large for an older city hotel, with a walk-in closet with a mini-fridge, and an alcove with the desk. The bathroom was new and spotless. We've stayed at the Four Seasons Chicago in connection with my husband's work, and our accomodations at the Days Inn didn't suffer from comparison. The only negative was the noise level--our room was over the front entrance. Rooms in the interior and back would probably be quieter, and for this kind of location, you have to expect noise. The hotel had provided earplugs. Our daughter has decided on DePaul, starting this fall, so we'll be staying here again", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Days Inn Chicago-great budget choice during the week”", "Author": "2Midwest", "ReviewID": "UR102568714", "Content": "Yes, it's a Days Inn. But it's in a great north side neighborhood. Lots of shops and restaurants nearby. Very clean. Rooms a tad small. During the week, the place is a bargain. I paid $91 AAA rate. Weekends--unlike most Chicago hotels--are higher. So if you weekend stay overlaps to Sun-Thurs, rebook at the lower rate. Also, free use of Bally's gym around the corner. Somewhat near the Diversey Street L CTA stop.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "newcastle", "Title": "“Great hotel - with a great breakfast”", "Author": "beijarflorx", "ReviewID": "UR102181983", "Content": "Not to far from underground station. The room was a bit smaller than other hotels we stayed in in america and only had a double bed which seemed small compared to the other hotels. Hotel spotlessly clean - bathroom - breakfast included and had a impressive variety of things. Would recommend definitely.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Utica, Illinois", "Title": "“Excellent service, good location, awesome breakfast!”", "Author": "ktmac250", "ReviewID": "UR101372269", "Content": "My boyfriend and I stayed here for a quick weekend trip to the city. It was perfect for the amount of time we were there. The room wasn't very big, but being only there for one night it wasn't much concern. The staff was very professional, helpful, and friendly. Be sure to grab breakfast before you leave! There were a lot of different food options and all very good. If you are looking for a good little pub there is one a few blocks away called the Duke of Perth. We stopped in to grab a quick bite and some drinks before heading to a concert.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“This is a GREAT hotel at a reasonable price”", "Author": "Labatt", "ReviewID": "UR100248288", "Content": "I came to Chicago for a quick trip to see friends in a show, and picked this hotel for its proximity to the theater. I didn't expect much from a Days Inn, but the price was right. But the place has the great charm of an old hotel, and is very well maintained, spotlessly clean, and really quite nice. I would have expected to pay far more for a Chicago hotel. It's in the Lincoln Park district, so not in the Loop area, but there are trains nearby. It's a very solid choice, and I'll be back if I have reason to be in this area.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cincinnati", "Title": "“This place is funky”", "Author": "jmmr", "ReviewID": "UR99048153", "Content": "We have stayed twice here in the last 3 months. Oyur daughter is planning on attending DePaul in the fall so we have been attending events etc. The staff are wonderful, especially Neil and Anthony. We paid the DePaul rate of $85.00 plus $22.00 for valet parking a night. Complimentary breakfast is good,wit a waffle maker and great fresh squeezed orange juice. wifi in the lobby. Worked well. Free wifi in your room. The rooms are so-so but the surrounding area is fabulous for shops and restaurants. The burger place next door is amazing(but expensive). Overall good value for your money.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“Great place to stay!”", "Author": "Dorian_6_7", "ReviewID": "UR95832936", "Content": "Our stay was very nice. The room was very clean and the staff was very friendly and helpful. We did have an issue arise as we were packing up to leave and the manager was very accommodating in helping us resolve it. Thanks to the wind in the \"Windy City\" the bellman's cart rolled off the curb and into our car. The manager quickly came out to look over the damage and assured us that they would take care of it. She was very helpful through the whole process and covered the charges of the body work without our insurance company getting involved. We really appreciated the service we received during our stay and the cooperation we received resolving our car damages. If you are looking for a clean place to stay that offers great service I would really recommend this hotel.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Beach, Florida", "Title": "“A perfect base in northside Chicago”", "Author": "ntfraz", "ReviewID": "UR95322065", "Content": "We've stayed here several times and have found it to be consistently reliable for quality of rooms, friendly and efficient service (front desk, valet parking, breakfast room - everything), and a good night's sleep (ask for a quiet room). It is an outstanding value for the location.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Recommended to me by a well-traveled Chicagoan!”", "Author": "sinanissimo", "ReviewID": "UR93486682", "Content": "I'm a well-traveled, recent graduate and I do love traveling within budget without sacrificing on the quality. First of all, this is not your typical Days Inn near the highway exit and gas station. It is a small boutique hotel at a great, great location! So, I decided to make a quick trip to Chicagoland, but wanted to avoid the expensive and touristy Downtown area hotels. The lady where I work who is a Chicago native told me that they always tell their friends to stay at the 'Days Inn Lincoln Park' and I kinda raised my eyebrows when she said that, having not really great experiences at other Days Inn hotels. So, overall: - Feels like those small inexpensive hotels in Paris or other European cities. Practically chic boutique Days Inn. - Great location! Very close to L -Diversey station and Jamba Juice, Movie Theatres, Walgreens, nice restaurants are all within couple of blocks! Seriously, the location can't be beat. - Usually great price! - Free breakfast & free fast wi-fi! - Very clean and well-kept rooms! - Friendly and professional staff! I mean, for the price I paid, I really couldn't have asked for more! I'm definitely going to stay here whenever I can!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mableton, Georgia", "Title": "“Love this hotel!!”", "Author": "gieret", "ReviewID": "UR93236305", "Content": "This was my 3rd trip to Chicago & I've stayed here all 3 times. It's the cheapest hotel around, but is in no way cheap! The staff is wonderful & helpful, the rooms are always very clean; some are small, just depends on what you ask for. I always get the exact same room because I liked it the 1st time I was there. The beds are like heaven! They are so comfy & the pillows are like sleeping with your head in God's hand! I came home & ordered some for myself!! Close to pretty much everything you'd visit Chicago for; close to Wrigley, tons of pubs & restaurants, the lake & pier, and all the theaters, which is why I was there each time. I went to Chicago knowing nothing about the location of these places or where to stay or how to get around & the staff here were of the greatest help. Will always stay here every time I go back!!", "Date": "January 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Minneapolis,MN.", "Title": "“Ok, but will go elsewhere next time!”", "Author": "jenmal1", "ReviewID": "UR90042783", "Content": "The hotel is in a great location for exploring Lake-view and Lincoln park, which is what we wanted to do, but the rooms are small, and we paid extra for a large business class room and it was small. No exhaust in the bathrooms, and a noisy storage closet that was frequented by staff constantly. It's not a bad place, but for the money (125.00 a night) we expected more. Now the reason we will not be returning is we left the room to venture out, and left the do not disturb tag on the door, but upon our return we noticed that someone had been in and left a note on our laptop stating that if we continued to smoke, we would be fined 200.00. We don't smoke! We did notice someone partaking in a little ganja, but it was not us. Now while I can understand the need to remind guests of hotel policies, I do not feel it was necessary to enter our room, with all of our valuables laying out, they could have easily slid it under the door, or called us, but instead someone basically made us feel unsafe by just walking in when it was obvious we were not interested in being disturbed. This was a safety issue, and one I am not willing to take another chance on at this establishment! Safety and privacy at this hotel needs to be addressed, because if I were in the room asleep and just did not want to answer the door, or having fun with my wife and did not want to answer the door, someone would have just walked in on us!", "Date": "December 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“You can do better”", "Author": "Vidlar", "ReviewID": "UR88473043", "Content": "We knew the room would be small, and it was. The towels were also small and thin. The bathroom did not have an exhaust fan. It was difficult to close the bathroom door and then difficult to re-open it. You could hear other hotel guest coughing, and even blowing their nose. The TV is an older picture tube model, but there are plenty of cable options. The location is fine, but for the money, I would keep looking.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Loved it!”", "Author": "capitalgull", "ReviewID": "UR84724766", "Content": "There is very little not to recommend about the Days Inn Chicago. Although not in the heart of downtown, the transport system in the Windy City is good enough that you are never far from anything either by bus or the 'L'. DIC is a matter of a few minutes walk from the Brown Line and only 20 minutes from downtown if you hit things spot on. The hotel itself is surrounded by bars, cafes, pubs and restaurants of varying nature and should really satsify just about every taste you could think of. The room I had on the second floor was very near the tiny lift, but I never heard it at all, and the hotel in general was quiet despite being obviously fairly busy during my three nights there. The beds, as another reviewer commented recently, were ultra comfortable and my only slight complaint, being tall and fairly stout, was that the toilet in the bathroom was very close to the wall and very uncomfortable to sit on properly. Facilities were, in general, superb and the breakfast was worthy of having every morning I was there. Plenty of choice and nothing ever seemed to run out. My only other observation - if you have a laptop and want to carry it with you when on holiday, then take it to the DIC - their public access computer is, frankly, hopeless and crashed every time I tried to use it after only a couple of minutes. But I am not going to let small details like those spoil what was an excellent stay in a quirky little hotel with excellent staff and comfortable rooms. I'll be back!!", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Brilliant- Beautiful little boutique hotel!”", "Author": "HirschAustralia", "ReviewID": "UR84505176", "Content": "Beautiful little boutique hotel. Had one of my best sleeps there! Rooms are lovely, clean, great beds and bathroom was great. Free Wifi; great and diverse free breakfast. Friendly and accomodating staff. Restraunts were close and within walking distance. Felt like a safe neighbourhood, could walk aroud day and night. Would stay there again happily next time I'm in Chicago. I've stayed at a lot of Days Inns and this was by far the nicest!", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Quality doesn't have to cost a fortune”", "Author": "ryanmfitz1", "ReviewID": "UR82987551", "Content": "My first stay at this hotel was over the 4th of July weekend. I was beyond impressed with the location in comparison to other hotels, not only the cleanliness of the rooms or the professionalism of the hotel staff, that prompted me to stay again for my birthday in August and this is where I found out just how the could amaze me even more..y best friend came with me and had a fantastic birthday, at your establishment. As always, the staff was top notch, and can't find even one complaint. So I wanted to let you know how impressed i am with the house keeping. To let you know how fantastic of a cleaning job they did, i hadn't shaved in a week and thus, i had lots of facial hair. I trimmed it first, prior to shaving which left trimmings unfortunately scattered around. The next morning, when we left to let housekeeping do their thing, when i returned, I swear there was not even 1 hair trimming from the night before, ANYWHERE in that bathroom. I was amazed. I felt bad when i left that morning but their cleaning seemed virtually magic. I was impressed beyond belief. I would recommend this hotel to anyone. You don't have to spend a fortune to have great service and even then, doesn't guarantee you top notch service. I am spoiled by your hotel and everything/everyone. Top notch all the way and will never stay anywhere else when i come to chicago and as u see on facebook, i recommend and give the highest praise to your property", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“The service and welcome here are really notable”", "Author": "JaneLondon_10", "ReviewID": "UR82904901", "Content": "I have been here many times and have always intended to write a review because the staff here are so good, so friendly and informative and it is a real home from home in its approach to guests. It is not a luxurious hotel, but very clean and functional and good value for money. It is well located for restaurants and transport and in a nice little neighbourhood. I am writing this from reception which is small, welcoming and a friendly place to be. The meeting room is good and good value. it is right by reception so if you need anything the staff are right there. Jane from London", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ellicott City, MD", "Title": "“Clean, reasonable priced hotel on North side”", "Author": "EllicottCity_MDMoose", "ReviewID": "UR82644848", "Content": "I have stayed in this hotel twice as it is convenient to people that we visit in Chicago. The first time I stayed I had a room located \"off the street\". It was very quiet and I was quite pleased. The second time I stayed I ended up with a room that overlooked a busy street. It was ok but not very quiet due to fire engines, motorcycles etc. The free breakfast is quite good with a number of choices. Free internet is also a plus. I will stay here again, but request a room not facing Diversey.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great value and location in Chicago”", "Author": "skirooster", "ReviewID": "UR82536760", "Content": "I've found Days Inn hotels to be reliable - clean and really good values. The Days Inn at Lincoln Park is a really nice hotel. Don't expect 5 star luxury; just clean, nicely furnished rooms at very reasonable prices. A really good choice -", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Des Moines", "Title": "“We would stay again”", "Author": "ebennett", "ReviewID": "UR79525832", "Content": "We stayed at Days Inn while we were in town for a game. We would stay there again. The staff was so nice. The room we had was big. However my sister in law got just the 1 bed room and it was really small. I say pay the extra $10 to get the room with 2 beds. It was a nice location. Walking distance almost anywhere. We walked to the Cubs game. It was never loud or dirty. The breakfast nook is a little small. But breakfast was good. Also I like the added security they have. You can not use the stairs or the elevator with out your room key.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Wonderful location+great rate+comfy sleep = awesome Windy City stay!”", "Author": "lau2359", "ReviewID": "UR78376818", "Content": "I booked this hotel based on 2 things: the reviews here on TA & its location! First the hotel: We parked across the street at a meter and went to check in. One of the first people we saw was the man at the valet stand. He lifted his head to look at us walking through the door, but didn't say a word. We next passed the bellman, who didn't even meet eyes with us, much less say hello. They were the only sour notes. The check in was pleasant and the front desk people were very friendly. Our room had 2 double beds and was huge! Room was clean & beds were comfy. We were right on the street and it would be loud at night if you don't travel with a fan...we don't leave home without ours. : ) I loved people watching out our window...and Walgreens right across the street came in handy a few times. I didn't ever personally make it to the breakfast, but my hubby did and came back to the room with different yummies every morning. Free breakfast with the awesome low rate can not be beat! Now location: Lincoln Park is a wonderful base for your next trip to Chicago...we parked our car at the hotel with in/out privileges for $22 a day, but never took it out. We walked to Wrigley Field for a Cubs game and enjoyed some \"dolla no holla\" tacos at The Bar Celona where the service was excellent We walked just down the street from the Days to The Half Shell for killer crab legs and then headed to Kingston Minds for some rockin' Jimmy Burns Blues starting at 9pm on Wednesday and trust me, Jimmy knows blues! We also did Chicago Near North Food Tour and it was just okay...not the best, but not the worst. We did end up renting bikes at Bobby's Bikes ad going along the lake, through the Lincoln Park area including the FREE zoo, and back to some of the neighborhoods that the food tour took us through - Old Town is a great place for lunch. Stay here...you won't regret it. Our next trip is already booked!", "Date": "September 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great Location”", "Author": "canadaguyToronto", "ReviewID": "UR77971269", "Content": "This old Days Inn is in the heart of Lincoln Park and a short walk to Boys Town.The hotel was clean and the free breakfeast was a big hit. My only complait are the bathrooms. Time to upgrade! They all have this 3 inch step up which is just great to trip over at 3 am in the dark. Other then that this is a nice hotel.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, KY", "Title": "“absolutely fantastic”", "Author": "travelerIrvine_KY", "ReviewID": "UR77827981", "Content": "I have been staying at this hotel for 11 years and will only stay when in Chicago - staff is wonderful and Steve the manager is always willing to help", "Date": "September 1, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Clean, safe, large rooms!”", "Author": "Shakeandblake", "ReviewID": "UR75107538", "Content": "Cheapest decent hotel in Chicago that I could find. Nice large room which was pretty modern looking considering the age of the building. Appreciated the free WiFi and the fact that you have to swipe your key to get on the elevator or stairs- extra security (though somehow the pizza delivery guy was able to get up to our room, must have an agreement with the hotel.) Street noise didn't bother me too much. Breakfast was great, although the room was a little cramped. The only complaint I have is that its hard to pull up to the front of the hotel to get valet parking ($22/24 hours) Great hotel.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southern Ontario, Canada", "Title": "“Great value and good location”", "Author": "ld4ivy", "ReviewID": "UR74770418", "Content": "The Days Inn Chicago is an great value in a city where hotels and parking can be quite expensive. The hotel is located about 6 blocks from both the Lincoln Park Zoo and the El stop (subway). It is on the border ot the Lincoln Park and Lakeview neighbourhoods, which gives you more of a feel for the city than staying in the central business district. The neighbourhood is safe and you are close to good entertainment and Wrigley Field. The transit system is easy to use and a multi-day visitor card is both convenient a good value. Ths staff is both friendly and helpful and the complimentary continental breakfast is good. The rooms are clean. There is no noise in an inside room even though other travelers have said that nosie is an issue. I would recommend this hotel and stay there again when I return to Chicago.", "Date": "August 11, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Small room, but clean and nice!”", "Author": "Dara123", "ReviewID": "UR74695417", "Content": "I stayed here by myself the night before a group tour and got a single room, which came with a double bed. The sheets are soft and there four pillows on the bed! Awesome. The room is perfect for one or two people. The area is great, although not serviceable by the train, it has buses to the city. The area itself is really upbeat, with a young crowd. Great little shops, restaurants and bars. I'd stay here again for sure if I were in Chicago. It's a nice alternative to the large downtown hotels.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“PERFECT HOTEL TO EXPERIENCE CHICAGO”", "Author": "ricaniam", "ReviewID": "UR74666442", "Content": "I have stayed at this hotel many times and everybody that works there is so great but the one that stands out is Paulina strezelecka is the best helpful friendly. I love this hotel its so close to everything and wont break the bank a must stay.", "Date": "August 10, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“My wife and I were only in Chicago for a...”", "Author": "themightycasey", "ReviewID": "UR73269994", "Content": "My wife and I were only in Chicago for a quick few days, and were looking for a hotel that would be a good jumping off point for a cram-packed schedule (mass transit nearby, busy streets where you could easily flag a cab), at a decent price. Days Inn, in Lincoln Park, neatly fit the bill. Casey checked us in quickly and was full of advice on just about anything I asked about. He became my go-to guy for the next 3 days! At one point, he suggested we check out a specific local band, and even checked online to see when and where they were playing. As well, any of the other guys I talked to on the staff for our stay, were helpful and cool. It's like they staffed the joint with a bunch of my friends from college! Real comfortable. Real convenient. And real cool. I will be telling my friends to stay here in the future.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Perfect Stay”", "Author": "dogpeopleca", "ReviewID": "UR72801793", "Content": "This is the fourth or fifth summer I have stayed here for a few days. They offer exceptional service and real value pricing. Wifi is free in every room and the gym/pool around the corner is either free or cheap for hotel guests. The hotel staff is just wonderful. It is mid-price and sort of middle of the road in style and amenities and they always make my stay nice with genuine service, not the type trained in with plastic smiles from corporate headquarters. This is much cheaper than downtown hotels or hotels on Magnificent Mile and easy to reach from those area. Lots of buses go to the stop that is just four blocks from the hotel. Very safe neighborhood with enough places to eat and basic shopping, a nice Borders, a pleasant and quiet Panera with free wi-fi for cafe customers.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vincennes, Indiana", "Title": "“Fantastic mid range Hotel in Great Neighborhood”", "Author": "abrigg", "ReviewID": "UR71189975", "Content": "We visited Chicago for the first time to see a play. This was the closest hotel to our destination. It is a wonderful old Downtown hotel in the Lincoln Park area. Great neighborhood with plenty of shopping, restraunts, and bars. Pet friendly area (not a pet friendly hotel), close to everything in Lincoln Park. The Staff was fantastic, went over and above for us several times. We had a Double Queen business room and it was very clean and roomy. The beds were divine! Haven't slept that well in months. They also have a very nice continental breakfast that includes Belgian waffles (my fav). Valet service was great and there were cabs available at all times. Also has a bus stop out front if you are going to stay for awhile to make the visitor ticket worthwhile.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“This is a wonderful place to stay in the Lincoln Park neighborhood.”", "Author": "kathywhoryou", "ReviewID": "UR70216168", "Content": "I had stayed at this hotel years ago. I was pleasantly surprised by the great rennovation that had taken place. The room was fresh and clean, with duvets on the bed. How nice not to share a blanket with strangers! The room was well supplied and the valet parking well priced at $22 with in and out privellages. The breakfast was included and adequate, although bananas would be a nice addition. Every staff encounter was pleasant. It is obvious that the staff is invested in customer relations. The only negative about this hotel was the noisy AC/heating unit that is in the window. It is very loud. Management is aware of this and supplies ear plugs. They may help some but we found the noise disruptive to a good nights sleep. However, even with that it is a good value for the $ in an expensive city and we would consider staying there again on a return visit.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gunnison, Colorado", "Title": "“Great Stay for a Great Price!”", "Author": "Coloradoroadtripper", "ReviewID": "UR69088276", "Content": "This hotel has all the quality and service of an upscale boutique hotel with the price of a budget hotel. Staff was helpful and knowledgeable, the room was huge and very comfortable. Located in a fantastic neighborhood. This is a GREAT value!", "Date": "June 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Okla", "Title": "“A nice stay”", "Author": "ilovevegasbaby", "ReviewID": "UR68675584", "Content": "This was our first trip to Chicago so we had no idea what to expect of any part of the city. We wanted to stay around the Loop area so we would be closer to things, but there was a large convention in town and the Blackhawks were also playing for the Stanley Cup. I read some pretty good reviews so I felt comfortable about choosing this hotel. When we arrived on Sunday around 1:00 we were unable to check in as a room was not ready. The girl at the front desk said a room may be ready in an hour or it would be guaranteed at 3:00pm. She said we could check our luggage at no cost until that time. This was fine with us because we were ready to eat lunch and take a walk down to the beach near the lake. By the time we returned it was very close to 3:00 and our room was ready. There was a different person checking us in and when he pulled up our information he said that we were now upgraded to a larger room. We didn't know what we did to deserve the upgrade, but we were very happy about it as I heard some of the rooms were very small. Our room had plenty of room. We had a small fridge, microwave and coffee maker. It had a futon type couch in the room that would double as a bed for someone (sheets and blankets in the closet). We did not have a view because we were facing the inside of the building which was fine with us as I had heard the outside rooms were a bit noisy due to the traffic on the streets. The airconditioner worked really well in the room. Of course it was pretty rainy and cool while we were there so it wouldn't have had to work too hard. A plus to the airconditioner is that it helps drown out noise from other rooms. While we didn't hear our neighbors too much you could hear all activity in the hall. They do give you one set of earplugs just in case you are bothered by noises. The bed was very, very comfortable. The room and bathroom area was very clean. The front lobby is very nice and would always have people gathered around the seating areas which seemed so inviting. The breakfast area is very small and narrow though and felt too cramped when we went down two mornings. We only grabbed a coffee and juice because there were too many people. The elelvator is very small and only room for about 4 people - without luggage. The hallways to the rooms are very dark, but not scary. The numbering to the rooms is confusing. The staff was always very friendly and very helpful when we had questions. The elevated train is about four blocks from the hotel and very easy to use. There are several shops and good places to eat close by. I was very pleased with our stay. The hotel has a great follow up email program so you can express your opinions about your stay. I would stay here again.", "Date": "June 25, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sycamore, Illinois", "Title": "“BAD”", "Author": "Luvmotox", "ReviewID": "UR68179314", "Content": "1. Called to see if there was valet parking and was informed that there was. However, there were cars parked directly in front of the hotel, so we self parked around the corner. 2. Scary elevator 3. Room numbering is a mess,,,,, 4. Corner room, VERY tiny. had to walk in the door sideways 5. Tiniest bathroom on the planet, no counter space at all. 6. Whenever anyone else in the building or adjacent rooms or what have you, flushed or used water-the temp of the shower water SKYROCKETS!! This happened to me as I was washing my face. Nothing compares to scalding hot water!!! 7. Front desk staff very impersonal I would definitely not stay here again.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Caney, Kansas", "Title": "“Outstanding accomodations and staff”", "Author": "Ralph24", "ReviewID": "UR67351125", "Content": "We book the room several months ago because of our Amtrak connections. Was very pleased with the accomodations and the staff were all very helpful by providing directions that were needed and helped load our luggage when we left. The breakfast was very good and plentiful. Everything kept well stocked and fresh.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Westchester, NY", "Title": "“CUBS GAME - CHICAGO WEEKEND”", "Author": "Ndee", "ReviewID": "UR66035074", "Content": "Very nice hotel - not your typical Days Inn - in cool area of Chicago with bars/restaurants all around and close to other cool areas on the North side ... FUN 15 walk up Clarke to Wrigley and close to beaches. We took cabs & walked a lot so no input on bus/train.... Breakfast was a little above most with belgian waffles and a few other niceties... Place was pricey but we stayed over holiday weekend during Cubs/Cardinals so take that into account......... I would def stay here again, especially if back for a Cubs game.....", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbus, Oh", "Title": "“Another great time in the Windy City!”", "Author": "soloonthego", "ReviewID": "UR64098524", "Content": "I've been flying in from Ohio for Cubs games 3X's a year for the past 5yrs & this is my 1st choice in hotels! Quick, courteous staff, easy in/out, great location & always a clean room! Good selection at the breakfast buffet, though as mentioned a little tight in that area..I sometimes arrive early & have never had to wait for a room & they keep my bag free after checkout until after the game. Front desk staff is always available w/helpful info & suggestions. Location is great--dozens of excellent shops & restaurants within walking distance, though I always make Renaldi's Pizza (on Broadway, just down from Wal-Greens) my first stop even before checking in! Another trip planned for Memorial Day, hopefully back again in June!", "Date": "May 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warren, Michigan", "Title": "“NICE PLACE TO STAY CHEAP TOO EVEN AT LAST MINUTE”", "Author": "railfanMichigan", "ReviewID": "UR63791754", "Content": "Nice place easy to get too near a main bus line. I ended up staying here for national train day. Its a nice hotel from the lobby with bell hops and everything.. checked in at 3:30PM no problems. nice staff. Has free WI-FI but it's SLOW . Its T1 and compared to comcast high speed it's slow. when you check in they ask if you brought a laptop with you and if yes they give you the password for the wi-fi. room was nice and clean but overlooking a ally. I noticed in the bathroom they provided ear plugs and for good reason. if you open the window for air its noisy. every hour there was a fire truck or ambulance going by. the A/C wall unit if on fan only is LOUD. for heat it was quit. also someone was always slamming a door or something.I never used the earplugs though. when i went to wash my hands the water was rusty for a couple seconds but cleared up. was not rusty anymore after. Later when i wanted to take a shower i could not get any hot water. trying both handles. after a while i figured out the problem. the handles were backwards. the H for hot was on cold and the C for cold was on hot so once that was figured out shower was nice and hot. bed was nice and clean and fluffy. and 2 different kinds of pillows. soft and hard so i mixed them for sleeping 1 soft 1 hard.checkout was fine. overall so far i would stay here again cause im not picky.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "chigaco", "Title": "“great stay and great location.”", "Author": "jamesvia", "ReviewID": "UR61227320", "Content": "Our apartment was being painted and the fumes were so bad we needed a hotel. The Days Inn was great. Room was very clean and employees very nice. It felt like a little vacation for one night. Thank you Days Inn Chicago, did not even know you where in my neighborhood. We will send our family and friends there when visiting.", "Date": "April 13, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "1", "Service": "3"}, "AuthorLocation": "", "Title": "“SCARY!”", "Author": "Do_not_enter_", "ReviewID": "UR59188454", "Content": "We are currently sitting in this hotel writing this review. We are so afraid to even walk down the hallways by ourselves. This place has a very scary feel to it that makes us a little but weary and nervous. The worst part about all of this is that the lock on our door was putvon incorrectly, and thus it does not lock. We currently have a chair in front of the door and we are in the process of stacking our bags in front of the door as well. Knock knock! who's there? Orange orange who? orange u glad that u stayed at the days inn in Chicago! No! The rooms are clean and it's in a great location but I'M FREAKIN SCARED OUT OF MY MIND and I want my mommy! Hope this review helped! Oh btw the remote doesn't work and the toilet won't stop flushing! And the walls are paper thin. The people next door are taking a shower and we can hear it very clearly!", "Date": "March 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dayton, Ohio", "Title": "“decent stay for a weekend trip”", "Author": "melissaosu", "ReviewID": "UR58842448", "Content": "Very clean but we weren't all that impressed with size of the room. The bathroom was very small - virtually no counter space. Bed was also very small but at least the sheets were clean. We just went for a weekend trip over St Patrick's Day so we didn't plan to spend much time in the room. We joked the biggest object in the room was the television. Our hotel confirmation listed \"Private Parking for 22.00 a night\". After we circled around the block, looking out for a garage, we called the front desk and they told us it's valet parking only. 22.00 a night we thought was reasonable. Breakfast was good and open till 11am unlike some other places which only offer till 9 or so. Only complaint is the walls are PAPER thin. We could hear word for word conversations from next door. Really not a bad place to stay for a quick trip. No bad vibes here.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Great value for Chicago”", "Author": "imasportsluvr", "ReviewID": "UR57994837", "Content": "We just stayed at the Days Inn Chicago when we were visiting DePaul University. First the good news. The staff was wonderful. Very friendly and helpful. The hotel is located 3-4 blocks from the El -- very convenient. Breakfast is included and had everything from cereal to waffles. The orange juice, although from a machine, tasted like fresh squeezed. The neighborhood is nice, too. Now the not so good. The hotel is old but updated as much as possible. We hated the heater in our room -- didn't work right and we melted the first night. Someone fixed it the next day and things were better but it was very noisy. The bathroom is old and very small. The housekeepers took our box of tissues after the first day which was bad because my daughter had a wicked cold. It's the only hotel I've ever stayed in which provided ear plugs along with the soap and shampoo (no conditioner provided by the way).", "Date": "March 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Ultra Clean and Friendly”", "Author": "oooooooooooo", "ReviewID": "UR56421847", "Content": "Without question, we would stay here again! Excercise facility is around the corner at \"Bally's\" no charge for suana/steam, lap pool, or equipment. I have walked further in a mega hotel to get to the suana so this was not an issue for us. Great bus and taxi access. \"AA\" for attitudes of staff and management. This facility is a great value for the cost. If you do not care for smaller spaces or need bigger for special occasions do not take the value room. There are double queen rooms with desk, safe, ironing board, and good sized bathrooms. Shower pressure is great and housekeeping is impeccable!!!! Everyone knows the story of why you don't lie on the bedspreads. Well these actually get laundred here!! Washer/dryer on premises. Driving? Valet parking here is $22,(this is approx 1/2 the rate of other hotels, especially in the loop). Leave your car and do bus (5.00 all day or 2.25 one time)or taxis, anywhere from 8 to 15 with tip just about anywhere!! Movie theater within 1 mile and food galore, in this Lincoln Park section. Also there is a FREE breakfast in the am and coffee all day!! Good luck and happy travels!", "Date": "February 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Fantastic value in the heart of it all”", "Author": "h0teln0mad", "ReviewID": "UR55133354", "Content": "The staff at this hotel were extremely gracious and went out of their way to welcome me. I arrived early and the staff had a room cleaned and ready for me promptly. Property is located right in the heart of Lincoln Park and there are numerous dining and nightlife options at the property doorstep. I will definitely return to this property. The Days Inn brand gets a serious upgrade in my mind with properties of this character.", "Date": "February 3, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Rock Falls, Illinois", "Title": "“Good for the price”", "Author": "MarcyS4", "ReviewID": "UR54367595", "Content": "Beds wern't too comfortable and rooms were small but didn't spend a lot of time in the room anyway. Staff was friendly and welcoming and the breakfast was very good and offered a lot of variety, rooms were clean. nice neighborhood. Id stay here again.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Stay here instead of inn at Lincoln Park”", "Author": "consumer01", "ReviewID": "UR53632581", "Content": "Nice staff, clean rooms, newer, good value", "Date": "January 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ann Arbor", "Title": "“We'll be back...”", "Author": "RoyaleWithCheese71", "ReviewID": "UR53497428", "Content": "Such a great place to stay in Chicago! What this hotel is not: Fancy (although the lobby has some very nice seating areas). What it is: Affordable, clean, quiet, and convenient, with a genuinely warm and friendly staff. I booked a few months in advance to make sure I wouldn't be scrambling to find an affordable room for our short May visit. I explained that it was just myself and two children, that this was the kids' first visit to Chicago, and that we'd need to get around the city via public transport. When we arrived in May and checked in, we had been upgraded - at no additional charge - to a suite, so that we would have more room to stretch out. The king bed was massive enough to comfortably sleep all three of us, and there was a separate dressing area with full-length mirror, which was a nice bonus. The bathroom was tiny but immaculate (and anyway we didn't come to Chicago to hang out in the hotel bathroom). The free breakfast was a godsend, with two hungry kids ready to take on the city each morning. We did the \"make-your-own-waffle\" routine - fun and really pretty tasty - but the kids seemed to prefer the donuts and juice (go figure). Location-wise, the hotel is in the Lincoln Park area, so it's a bit off the tourist-beaten track (which, it must be said, I prefer.) But it's close to a number of bus and El lines, and within walking distance of both Lake Michigan and the Lincoln Park Zoo, which is free. (Did you catch that? Let me say it again: FREE.) With younger kids in tow, I found it necessary to pay for transportation to the farther-flung attractions in the city, but one could feasibly walk downtown if one had enough time to spare and the right pair of shoes. Best of all: The staff was marvelous, directing us to the closest bus and El stops, and helping us plan routes to the sites we visited each day. At one point my MP3 player refused to charge on the laptop I'd brought, so they helped me locate a place to charge it up (thank God, or I'd have gone nuts on the long, late train ride home). When an old friend stopped by with a bottle of wine one evening, they lent us a corkscrew. The doormen hailed cabs for us. Every member of the desk and door staff, and even a couple of the housekeepers, recognized and remembered us as we came and went, frequently asking about our day and how our outings had gone and if we'd enjoyed ourselves. We plan on making another trip to Chicago in the next year or two, and I would definitely stay here again. I've also recommended it to a number of people. Lovely!", "Date": "January 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Oklahoma City", "Title": "“good value”", "Author": "jgthompson2", "ReviewID": "UR49002287", "Content": "A bit long in the tooth, but a very friendly staff, free continental breakfast and reasonable price given location ,make up for it!", "Date": "November 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "sussex, england", "Title": "“big breakfast buffet”", "Author": "auditgirly", "ReviewID": "UR48846225", "Content": "stayed here for 2 nights. good location with plenty of restaurants nearby. staff helpful although not even their service could prevent the free wifi fiasco with printing. internet cafe nearby solved the issue. easy transport on the el with a transit pass only 2 blocks away. get a quiet room at the back - we didnt and the noise from staff in the side alley having a cigarette til past midnight was unpleasant. the big breakfast buffet was fab - waffles, breads, pastries, cereals, coffee, juices, fruit - yummy! good value and we loved chicago. hotel has apologised for the noise and wifi issues and promised me a free upgrade next time - shame its such a long way from the uk.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "melbourne", "Title": "“pleasant stay”", "Author": "floralbrigades", "ReviewID": "UR47945095", "Content": "i only had a night in chicago, and this was close to a few restaurants and bars i wanted to check out. the neighborhood was cool and had some good shopping. i had a hard time getting into the city from here, mostly because i got confused with the buses, but it's still in a good spot. the rooms were clean, and my room was quite large, so i was pleasantly surprised. the staff were so nice and really helpful they drew up plenty of maps for me. the website had mentioned that it used to be a bit of a rock and roll hotel, and sure enough one of the bands i was in town to see were staying there! but thankfully the walls must be thick because i a very quiet, peaceful nights sleep!", "Date": "October 28, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Girl Time!”", "Author": "falexander123", "ReviewID": "UR47218027", "Content": "Very Awesome! Close to everything! Rockin' City! I love Chicago!", "Date": "October 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Iowa", "Title": "“Excellent service and value”", "Author": "JPIowa", "ReviewID": "UR46787002", "Content": "Our family stayed at the Days Inn for the Chicago Marathon. The price was an excellent value compared to what we would have been charged for a downtown hotel. The location is still very good, in a neighborhood with many hip restaurants that looked very safe, and a few blocks from the metro/subway. Neil at the front desk was outstanding in helping us with our needs, going beyond the call of duty to ensure we had a pleasant stay. No problem with valet parking. Breakfast included the opportunity to make humongous waffles. The room was spacious, clean, about what I expected. We also had free wifi. I would definitely go back to the Days Inn.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "janeyfJaneyf", "Title": "“Nice enough”", "Author": "JaneyfJaneyf", "ReviewID": "UR46161430", "Content": "This was my second time staying here and i really like the place, the staff are great and really helpful, there was one guy in particular who has been on the front desk everytime i have stayed, i cant remember his name but he seems to be senior and he is really nice. The room was a little small but there was enough space and you are right up the road from wrigley field. Breakfast is ok, nothing too healthy on it but still ok.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Birmingham, Alabama, USA", "Title": "“Good Choice, Convenient to Everything”", "Author": "ATallOne", "ReviewID": "UR45455570", "Content": "I stayed at this hotel for a three nights toward the end of September, 2009. I had booked a standard king size room, but at check-in, was upgraded to a business suite, which we appreciated very much. This is probably one of the cleanest hotels I've ever stayed in; and also one of the quietest. I had a room facing interior courtyard and heard absolutely no street noise the entire stay, and very little noise from the hallway. They offer an excellent free breakfast, with delicious make-your-own waffles. Every one I spoke to at front desk were very professional, very attentive to your needs, especially a young man named Viktor, who had some excellent choices for nearby restaurants . I would absolutely stay at this hotel again, and have recommended it to several friends. Chicago's a great city with lots to see and do, and this hotel makes an excellent home base. Close to L station (Diversey - three blocks) and in the middle of a great neighborhood.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Just a nice place”", "Author": "RIKKASDAD", "ReviewID": "UR45271535", "Content": "We spent two nights here toward the end of September, 2009. Our room was spacious, bed was comfy, and bathroom bordered on elegant. The building is kind of an odd shape--almost a square with a \"courtyard\" in the middle. We were on the 4th floor facing into the courtyard, and our room was very quiet. I'd guess that the lower level rooms on the Diversey or Clark might get noisy--there is a fire station nearby. Elevator is SMALL--last time I saw one like that was in Rome. We flip flopped our reservation a couple times, and service was still pretty good. Location in Lincoln Park is terrific--it is a vibrant and diverse neighborhood, but still felt pretty safe evenat night. Not a place for single F walking late at night though--it is a city after all. Parking is tough. Twenty plus bucks a day. The whole city is not car friendly.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Good price/performance ratio”", "Author": "OmerErol", "ReviewID": "UR43065920", "Content": "The hotel is relatively close to the downtown. it takes about 20 minutes to Magnificent Mile to the heart of the city by bus. Room was tiny but clean. Its comfort is more than enough if you just need a place to stay at night. Probably you would prefer to spend your time out Chicago.. Days Inn is good choice.. My only negative comment is about the guy at the receptionist. he was not nice and does not know anything about hospitality..", "Date": "September 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Des Moines, Iowa", "Title": "“Okay but not great.”", "Author": "gymlver", "ReviewID": "UR39380971", "Content": "This hotel is in a super location: lots of restaurants, good transportation nearby, shopping, attractions (zoo), bars, etc. The one problem we had was that the doormen or bellman (hard to tell which were which) had bad odors. It hits you as soon as you get in the doors. They hand out just inside the front doors to the hotel. I think the check in staff should be awarre of this since they have to walk past these smelly guys too. Otherwise, I don't have many complaints. The rooms are a little small but you really can't beat the price for the location. The front desk is very nice and very good about answering questions. There is one computer in the lobby - two would be better since it is hard to get on it most of the time.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great Location, Nice Room...noisy in the morning.”", "Author": "cjdeperro", "ReviewID": "UR37533589", "Content": "I picked the Days Inn because my friends lived 2 blocks away, and it seemed to be in a nice neighborhood. Well the neighborhood is great....a 2 block walk from the L, passing all sorts of mid and upper range restaurants, fast food, Walgreens, CVS, Borders, Starbucks....all very nearby. The hotel is very nice too, nicer than a standard Days Inn. The room I had was in a far corner with no view except of an alley, but that was fine and kept it quiet--overnight anyway. The bed was great, internet was great, though the bathroom was a bit small. There was a fridge and microwave in the room. Unfortunately, I was located near the staging area for the housekeeping staff and they did not seem to know to 1) keep their voices down in the morning; 2) not slam into the service door with the carts, and 3) OIL the darn service door, it creaked like crazy! Fortunately I'm an early riser so I heard most of this while already awake, but I can't say that on principle it didn't bother me. I would however stay here again, just not in that corner of the hotel. Oh and the continental breakfast...nice, but if the hotel is full plan on taking things to your room, there are not enough seats.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dayton, Ohio", "Title": "“Phenominal value”", "Author": "FamilyTravelSeries", "ReviewID": "UR35581751", "Content": "Obviously this is not a 5-star property in the terms most people think of it. My rating is based on the fantastic value a visitor gets in a very expensive city. I write travel books and am doing one on Chicago. I thought this would be a great base of operations for one of my trips: in Lincoln Park, good bus and L, continental breakfast - all for under $69. It was all I hoped. The rooms are very small, but all I wanted to do was sleep and write, not have a party. Things were very quiet, staff was extremely friendly and helpful. There were absolutely no downsides. Tip: Save money and time on the valet parking and do it yourself. There's a 24-hour-a-day self-park garage about fifty yards up Clark Street (north of Diversey). It's several dollars cheaper than valet service and you don't have to wait. Just walk there in two minutes and get the car. The free wi-fi is great for somebody there to work.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bloomington, IL", "Title": "“Great hotel for the $, great location & EXCELLENT customer service!”", "Author": "tnl69", "ReviewID": "UR33516774", "Content": "My girlfriend and I came up this last weekend for PRIDE. This hotel is above & beyond what I would, stereotypically, expect from a Days Inn. The location is perfect for PRIDE or a weekend in \"Boystown\". This hotel is very welcoming to LGBT travelers (as evidenced by an in-room informational sheet on the PRIDE parade - which by the way, goes right by the hotel!). Everyone from the valet folks, to the bellmen to the front desk personnel were VERY helpful(they even offered to call a local eatery, to see when they closed, for us). The $22/a day for valet parking is well worth it as street parking in the area is hard to come by. It also affords the option to come and go as you please, w/out additional fees. The continental breakfast is pretty good too! We will definitely stay here again and will recommend it to others!", "Date": "June 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Pretty good”", "Author": "Dan1113", "ReviewID": "UR33485141", "Content": "This is a pretty good hotel, located close to buses and the metro. The rooms were decently-sized and had all the amenities we could need. The negative sides: -The computer is really restrictive, pop ups do not work for example. My boarding passes were in pop ups so I had to go to an internet cafe in order to be able to print them. -Weak breakfast. Donuts for breakfast, seriously? -Noisy, but we did have a room facing the main street. But these are pretty minor points. I would stay again.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cleveland", "Title": "“Great value and nice people too”", "Author": "barbcleveland", "ReviewID": "UR33369721", "Content": "I stayed 4 nights beginning June 21. I arrived late at night and I was given a very small, nice, but very small room. I asked if I could be moved the next day, as I was staying for 4 nights. Neil was so nice and helpful and I was moved to a bigger room. Anthony was helpful too, as was everyone there. It was an easy ride downtown on the Broadway bus, and there are restaurants and a Borders very close to the hotel. You can use a gym that is just several doors away. There are bigger and smaller rooms, with different shapes and sizes, so it is nice if you can get a larger room. All rooms seemed clean and modern and with nice bedding and beds. I would stay again in a minute. Book as early as you can, as it fills up. Have a great stay.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Woodland Park, CO", "Title": "“Great hotel in a great location! You can't go wrong.”", "Author": "Joel85", "ReviewID": "UR31744987", "Content": "This is not your typical Day's Inn. This is a completely renovated, modern older hotel in a great neighborhood. Found this is Hotwire for $53, cannot be beat in Chicago. Room was immaculately clean, beds very comfortable. Coffee, microwave and fridge in room. Free wireless internet with access code that they change every 2 days so you may have to get it updated. Free continental breakfast with fresh squeezed juice and the ladies work very hard to replenish. Staff very friendly and helpful. Always at least three employees at desk and lobby area and they usually hold the door! I highly recommend this hotel. You can't go wrong. L about 8 blocks, bus stops right at hotel.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Charming, but not for everyone.”", "Author": "blueleo65", "ReviewID": "UR31143022", "Content": "First, let me just say that I had a nice time staying at the Days Inn in Chicago. I chose the hotel for it's location close to the Halstead nightlife. I wouldn't have chosen it if I wanted to be downtown in the traditional tourist area. The front desk and valet ($22.00 per night, isn't bad for Chicago) clerks were very professional. The Lobby is in my opinion very nice and tasteful, for a hotel at this level. The furniture and decor were charming without being over the top. The building itself is very old, and the renovations did not seem to have changed the original layout of the building. That in my opinion would cause some to think of this hotel as less than adequate while others will find it very charming. I stayed in a room with a single double bed on the 4th floor. It was small. and the view wasn't exactly exciting, overlooking a made up courtyard, I'm sure done up as a joke. the bathroom was tiny, and didn't have much room for toiletries, but for my purpose, it was adequate. I did enjoy using the facilities at the Bally's Fitness around the corner, which were complimentary (excellent value). Overall, if you don't mind some the disadvantages of the building itself, it is a very charming and nice hotel.", "Date": "May 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Good hotel close to Children's Memorial”", "Author": "Lesmira1960", "ReviewID": "UR30801454", "Content": "We only stayed one night. Room was clean and comfortable.Breakfast was plentiful. Front desk recommended a good Italian restaurant for dinner. Computer for guests use was slow and kept crashing! Quite frustrating for a number of guests!", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Gwangju, South Korea", "Title": "“Close to Everything! Very clean!”", "Author": "lyoung88", "ReviewID": "UR29588389", "Content": "We are a young couple on a budget and enjoyed staying at the Days Inn in Chicago because it was economical, clean, and close to a bus line (2-3 blocks) that took you anywhere in Chicago. Staff was extremely helpful when it came to explaining the bus routes, etc and the continental breakfast was very nice. Rooms were teeny tiny but comfortable and clean. The hotel itself was older, but had been renovated in a modern way. Parking is close - you can bypass valet and park yourself two blocks away. It is cheaper but you can't move the car in and out like you can with valet. The diversey park area seemed safe and had a college-town vibe. Lots of good places to eat nearby and hole-in-the-wall pubs - loved it!", "Date": "May 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Oahu", "Title": "“Days Inn at Diversity and Clark â€“ an OK stay! Why? NOT anything special!”", "Author": "DreamyOahu", "ReviewID": "UR29198831", "Content": "Iâ€™ve stayed at this property off and on since 1993. Iâ€™ve seen this property grow from an almost raunchy hotel to an American standard hotel. My last stay at this hotel was in March 2001. PLUSESâ€¦ 1.) rooms are significantly cleaner than back in the 90's and 2001 2.) lobby is much nicer 3.) mattress is very good, entirely better than back in the days CONCENRSâ€¦ i.) Polish speaking nationals. yes, they now have 99% Polish speaking personnel in the hotel which either do NOT speak ANY English or too little to make heads or tails of anything they attempt to say or even comprehend. This is NOT positive! The United States is an open door, however, we MUST insist that people who are employed in this country at some point MUST speak some English; even if they are predominantly in housekeeping. How do these people have their working papers for the country anyway? They probably don't ... sharing SS#! ii.) toilet brush REQUIRED in the bathroom iii.) no iron or ironing board in the room iii.) no refrigerator in the room Also, I didn't appreciate leaving U$100.00 smoke security. In addition, they quabble about 800 phone calls. It is a good hotel for one night. It is what I would refer to as a quickie hotel. U$85.00/night including the tax is too much! The best price is U$69.00 including tax.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "ky", "Title": "“It is an excellent value.”", "Author": "mikek01", "ReviewID": "UR27305935", "Content": "We were very pleased with the staff and our room. Public transportation was a short walk away. We felt safe in the neighborhood, and there was many dining options with in walking distance. The staff was very friendly and helpful to us as we were first time visitors to the city. We would definitly recommend and stay again.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kansas", "Title": "“Enjoyed staying here.”", "Author": "elocs", "ReviewID": "UR26827363", "Content": "I came with my 16 year old grandson on spring break. The room was excellent. Clean and the bed was comfortable. The staff was very friendly and helpful. Security of having to use your room card for the elevator was nice. The continental breakfast was good. The location was handy to bus and train transportation.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "georgia", "Title": "“Enjoyable stay, no surprises!”", "Author": "airguy", "ReviewID": "UR26534237", "Content": "I had a wonderful stay at the Days Inn Chicago. The staff was friendly, the breakfast was excellent, the room was comfortable and clean. I woke up refreshed and relaxed. The hotel is about five blocks from the transit station, a walk that I found easily manageable. I also enjoyed being able to get in a workout at the Ballys Fitness next door. While the hotel was not \"luxurious\", it was well kept, functional, and definitely reasonably priced for the location and amenities offered. I would definitely stay here again.", "Date": "March 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Edinburgh, UK", "Title": "“Nice place, good option.”", "Author": "silicon_rain", "ReviewID": "UR24167891", "Content": "A great hotel - just what we were looking for. Days Inn is just a middle-of-the-road chain hotel, so don't expect anything fancy and you will be very happy. The lobby is beautiful, with very nice staff. The room was a little on the small side and not brilliantly modern, but spotlessly clean and completely adequate for those not looking to spend their holiday in their room. The bathroom could have used a bit of an update, though, and the air-conditioning was pretty loud. The free breakfast was fantastic - one of the best I've had. Just about anything you could want and lots of it. The DIY waffles were especially tasty. The location was pretty good. We had to get a train and then a bus from the airport, which took a while and wasn't that easy to navigate. Once there, getting to downtown was easy on the bus (the hotel staff directed us to a place around the corner where we could buy tickets from), but we walked a couple of times (although it is a good 45 minutes walk each way, so I wouldn't advise it if you're not a strong walker). The neighbourhood was very nice, with some nice places to eat and such nearby. The Lake Michigan shore is not far away, and walking along the beach to get into town was a lovely stroll. The Lincoln Park Zoo was just 10 minutes walk away and is well worth a look since it's free. On the whole, if you're not looking for anything massively fancy, then the Days Inn Chicago is definitely for you.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Awesome Value in Windy City!!!!”", "Author": "blockthatkick", "ReviewID": "UR24001531", "Content": "What's up with this place?! It is the cheapest hotel in the city, and it is right in the middle of the city! The room was clean, staff was attentive and helpful to the out of town guest, and the breakfast was very yummy! Book this place.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northampton, UK", "Title": "“Excellent value in an expensive city.”", "Author": "Maltloaf", "ReviewID": "UR23177849", "Content": "I've only got two issues with this hotel, it's a three block walk from the nearest El and the air con is noisy but apart from that it's terrific value. It's in an interesting and safe neighbourhood with good bars and restaurants within easy walking distance. The staff are amazingly helpful and the rooms are clean, the bed comfortable. What more do you want? There are buses nearby which go into downtown and when i go back to Chicago, this is where I'll stay.", "Date": "January 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Excellent hotel in a great city”", "Author": "kickice", "ReviewID": "UR22979056", "Content": "First things first, I couldn't quite believe how cheap this hotel was (under Â£35 a night for a room), but then I was staying in the middle of winter! But after being used to New York hotel prices (where that kinda of money wouldn't even get you a grotty room with a shared bathroom), this was a very pleasant surprise. Location wise, the Days Inn is in the very cool neighborhood of Lincoln Park. It's easy enough to get to downtown from here - the #22 bus stops right outside the hotel, and runs day and night. The Brown Line El runs quite close too (Diversey is the closest station, not Belmont as a reviewer down the page states!). It's a few minutes walk to the station. You can buy transit cards for the CTA (buses and El), from the Currency Exchange store across from the hotel on N Clark St. Lincoln Park is an ideal base as well for theatres (Steppenwolf, Victory Gardens, 2nd City and others are in the nighborhood), and it's close to Wrigley Field. It was absolutely no problem at all staying out of the downtown area, and in fact it was nice being in what is a lively, interesting residential neighborhood. The hotel is a good size - not too big, but not a tiny place either. Staff where pleasant and ready to help - but to be honest, the place was so well run I didn't need anything, or have to ask many questions anyway. Room was a decent enough size. Clean, comfortable, with desk, big closet, drawers, chairs, TV, coffee maker. Bathroom was small but perfectly adequate. Breakfast was included, and was available from 6.30am. Plenty of coffee, juices, cereals, bagels, muffins, toast, danishes and waffles. I would be more than happy to stay at the Days Inn again.", "Date": "December 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Absecon, New Jersey", "Title": "“No Problems, good service!”", "Author": "parabolove", "ReviewID": "UR21978960", "Content": "This was my first trip to Chicago and Days Inn made it even better! It is a great bargain especially for the location. The hotel was clean, the staff was so darn nice, the free bfast was mmm soo good- the muffins were amazing, fresh squeezed juice, and even make your own waffles. The only complaint is the drain in the shower wasn't working as smoothly as it should have been. I can't see how anything could go wrong here and even if it did, front desk was just so ncie!", "Date": "November 18, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Indiana", "Title": "“Great hotel in a great neighborhood although the rooms are small”", "Author": "2Midwest", "ReviewID": "UR21517473", "Content": "Do you like paying $265 to stay in the loop at a chain hotel or would you rather pay $90.10 and stay in the Lakeview North neighborhood just a short CTA subway ride up the Brown Line. If you are like me, you will save your money for the great restaurants and bars in the neighborhood. Yes, the rooms are small. And the elevator is small. But this is not your typical Days Inn. Clean as a whistle thanks to the Polish speaking staff. And quiet. Perfect for the single traveller on a budget. And oddly , this is one of the few Chicago hotels that has lower rates during the week (and higher rates on the weekend). Lots of Cub fans I guess. In any event, Chicago is an over priced hotel market that has only gotten worse in the last year. This is one of the few bargains.", "Date": "November 3, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“good price”", "Author": "daniel g", "ReviewID": "UR21440191", "Content": "Surprisingly good. I've stayed at a few Days Inn (typically bad experiences) so I was hesitant about booking this one. Using Hotels.com I couldn't beat the price so I decided to give Days Inn one more chance. (Reading the reviews from Tripadvisor gave me a little more courage than I would have otherwise given this chain.) Clean accommodations, decent location and a convenient 7 minute walk to the 151 bus line (Diversey and Sheridan), which travels the length of Michigan Avenue. The hotel is also near DePaul University so there are a lot college-aged kids walking around. Parking at the mall (Century Shopping Centreâ€Ž self-park) was $18 for 24 hours (somewhat below average as far as Chicago area parking is concerned.) My wife and I enjoyed dining at El Nuevo Mexicano Restaurantâ€Ž and Sushi 28; both are just a few minutes walk from the hotel. Weâ€™d consider staying at this place again.", "Date": "October 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "South Carolina", "Title": "“upstairs downstairs”", "Author": "SouthCarolinaMax", "ReviewID": "UR20815731", "Content": "Our hotel visit was booked through Hotwire. We were given a single double bed. . The desk clerk made it clear that we couldn't have two beds since we booked through a \"third party\". After finding a place to park a few blocks away (parking is atrocious in that area and the hotel clearly pushes their expensive valet parking) but it is possible, although the clerk also warned that it was nonavailable due to permit parking and meters. We didn't use the car again until we left, opting for CTA passes. The common areas of the hotel downstairs were pleasant. The breakfast room was comfortable and the continental breakfast sufficient, surprisingly offering \"real\" orange juice. The entire hotel was kept very clean by the friendly and professional staff. Access to the Bally gym next door was certainly a plus. Upstairs was a disappointment. Our room was really tiny. The old closet was deep and dark so retrieving items was a challenge. It appeared that the upstairs was not sprinkled anywhere, making their nonsmoking policy mandatory (although one evening we smelled someone smoking near our room). The room was incredibly stuffy and there was no way to get fresh air, nor was there any exhaust fan in the bathroom. As a result, it was necessary to run the huge and very noisy air conditioner nonstop. I guess the old clawfoot bathtub would be a novelty to some, but the corner showerhead made for difficult and long showers, since the pressure was low and modulating water temperature almost impossible. Pluses: location! cleanliness! common areas! Minuses: room I would probably recommend booking directly with the hotel in order to ensure a better room.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MO", "Title": "“Great hotel!!!!!”", "Author": "MoTravelin_girl", "ReviewID": "UR20652356", "Content": "We booked this hotel for a girl's trip to Chicago. I booked solely on written reviews....and boy were we impressed!!! For the price, this hotel is PERFECT!!!! The beds were great, rooms were very clean, breakfast was the best....waffles...YUMMY...and the staff was so helpful and friendly!!!! Great location to public transportation. Highly recommend this property!!!!!", "Date": "October 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ypsilanti", "Title": "“Loved it!”", "Author": "feltephant", "ReviewID": "UR20039771", "Content": "I loved this place! My husband and I stayed here for the first two nights of our honeymoon roadtrip. It was a great location. There were many places for us to shop (used bookstores, vintage clothes, quirky boutiques), lots of good restaurants, as well as a drugstore right across the street and it was a nice, safe walk to and from Wrigley Field. Also very short walk to Oz Park, Lincoln Park Zoo, and the train. The price was decent for the area, free internet in the lobby, adorable elevator. The room was pretty small and cramped but we weren't there to hang out in the room all day. It was cozy. Cool little bathroom with claw foot tub. I can't say enough about this hotel. We really enjoyed our stay there and will definitely stay there again when we return to Chicago.", "Date": "September 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "brisbane", "Title": "“A real gem!”", "Author": "princessvixen", "ReviewID": "UR18897899", "Content": "This hotel is gem.The rooms are huge.We had 2 queen size beds and so much room you could fit an army inside! The bathroom was tiny but it didnâ€™t bother me.My friends were on a higher floor and they had a frige,microwave and an even bigger room.Staff at front desk always friendly and free internet a bonus.Location is excellent and no problems!", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Gem in the ciy”", "Author": "indy4192", "ReviewID": "UR18724867", "Content": "We stayed at the Days Inn in Lincoln Park on our baseball trip to chicago. We picked it for two reasons. First and foremost was cost. We got a room with 2 double beds for $117 for the night. Second it was within walking distance (1.5 miles) of Wrigley. Well the hotel was great. The room was clean and the beds were comfortable. There was a huge closet and the bathroom was clean, big and the hot water in the shower was perfect. The hotel people were more then nice and the free morning breakfast hit the spot. The location while might be \"nosiey\" for some, didn't bother us after a day at the game the walk up and back. We were also close to the \"L\" and was able to hop it to downtown. If you are looking for a clean, comfortable room, with a great location at a reasonable price, then this Days Inn is your choice.", "Date": "August 7, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Perryville, Missouri", "Title": "“Fantastic Hotel!”", "Author": "merchieb", "ReviewID": "UR18403625", "Content": "We stayed at Days Inn Chicago, 644 W. Diversey Parkway, July 15-July 17, 2008. Fantastic Hotel! I can't say enough good things about this place! The location was great, close to train and city bus stops. The staff was very friendly and helpful. The rooms were clean, comfortable, and quiet. The bed was so comfy! The free breakfast was tasty. Best of all, the price was low compared to other hotels in the area. A quality hotel for the money. When I return to Chicago, I will stay at this hotel again and recommend it to all my friends.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“A well-run hotel -- and an exceptional value.”", "Author": "exmontrealer", "ReviewID": "UR18155627", "Content": "I've stayed at the Days Inn Lincoln Park North for years, but returned this month after a two-year absence. The property's actually better-looking, better-run, and better appointed than my last visit. The staff -- who field guest requests literally 24 hours a day -- was unfailingly courteous, the valets and bellboys helpful, and the housekeeping staff thorough and polite. The manager couldn't have been more solicitous when he happened to overhear a question I had about directions. I've spent much more at hotels that delivered a lot less; this perfectly located hotel is an exceptional value.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Great stay!”", "Author": "timer13", "ReviewID": "UR17988479", "Content": "Not too much to add to previous reviews. We had a room overlooking the interior courtyard and we thought it was quite spacious, but looking at the floorplan on the door revealed that there are other courtyard rooms that are a bit smaller. Our bathroom was not small, but there was very little space in the toilet area. A very large person would feel a bit cramped. The step up into the bathroom is a bit dangerous even with all the signs. Loved the a/c. It cooled the room and provided good white noise for sleeping. Complimentary breakfast was good. Staff were very friendly and leaving our luggage for several hours after checkout was no problem. Wrigley, Boystown, and the El are all walking distance.", "Date": "July 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Great Place to Stay for Cubs Fans”", "Author": "lovesthecubs", "ReviewID": "UR17887439", "Content": "We were in Chicago last week to catch a Cubs night game, and picked the Days Inn Lincoln Park mostly for its price (about $140 including taxes for a double-bed room) and proximity to Wrigley Field. Although I expected only the most basic lodging for that price in this area, we were pleasantly surprised with the cleanliness, comfort, and hospitality this hotel provided. The bed was very comfortable, A/C fully functional, floors and carpets were clean and free of stains/wear, service personnel friendly and attentive. The area itself is full of shops, convenience stores, and restaurants all in close proximity. Parking is a nightmare, however - we resorted to the hotel valet which was a reasonable $22 per day. The valets also provided outstanding service. The only negative was the bathroom. Although it was very clean and the water pressure adequate in the shower, the bathroom itself was extremely miniscule, making getting ready for the day a little tight for the two of us. A minor drawback for such an outstanding value. We walked to and from the game, which took us a little over a half-hour. The area felt reasonably safe, even when hoofing it back from the game at the end of the night. We will definitely be staying here again.", "Date": "July 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Warsaw, IN", "Title": "“Great hotel! Glad it was only for one night...”", "Author": "zoohouse", "ReviewID": "UR17237529", "Content": "We had a great time at the Days Inn in June. We parked around the corner and it was an easy walk to the hotel entrance. (No need to bother with valet service.) The front desk staff were friendly, efficient, and helpful. The manager directed us to a great pizza place, Lou Malnotti's (sp?). He said that it is better than Giordano's - and we had to agree that it was just excellent. Really excellent staff all around! The hotel is located in a great neighborhood. A one mile walk to Wrigley Field and a 10 or 15 minute walk to Lincoln Park Zoo. The el station was about four blocks away and the bus stop was around the corner. The neighborhood is nice and there's lots of places to eat and stores to check out. We went to Second City and it was a blast as usual. The reason I was glad it was for just one night is that the room was TINY! It honestly felt a little like a glorified closet. I'm sure there are larger rooms there...but whoa, ours was small. I did like the character and feel of the place though, even though it showed a few signs of age. The bathroom had only a shower, but it was a very nice and clean shower. I would stay here again for an overnighter in a fun neighborhood.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Days Inn is the best in Lincon Park”", "Author": "BrianTheMusician", "ReviewID": "UR16934006", "Content": "I have been staying at the Days Inn for years. The current staff is amazing. They are very helpful and they will go the extra mile. The hotel has been rehabbed over the years and is in it's best condition it has been in. Get a business room if you want a little bigger room with a little nicer experience. I am not saying the regular rooms are not nice, they just tend to be on the tight side. But I stay in both types and if you are looking to save a little for dinner each night, get the regular room.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Des Moines, IA.", "Title": "“Days Inn Lincoln Park North very cozy”", "Author": "Kari24", "ReviewID": "UR16449043", "Content": "The room was very clean and cozy. Bed linen and pillows extremely comfortable. Coffee maker, iron, ironing board, safe, hair dryer, microwave, refridgerator, and snacks all included. Definetely would stay there again. Reasonable price for the location. Valet service kindof confusing, still a great hotel.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cary, NC", "Title": "“good location”", "Author": "Frogee", "ReviewID": "UR16086241", "Content": "This Days Inn is a good value. Rooms are quiet, at least if you are not facing the street. A variety of interesting restaurants in the area, such as the Creperie and Pars Cove. A short walk to buses which go downtown. Unless you feel the need for valet parking, park around the corner at the Century Parking Lot and save a few bucks.", "Date": "May 16, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "lousiville", "Title": "“Days inn Rocks!!”", "Author": "bereakentucky", "ReviewID": "UR15102818", "Content": "I stay here exclusively and get homesick when I am not able to make a trip to chicago! The staff and management are the best. The breakfast is great, rooms are too, and its the best bargain in terms of location. Most people think staying on Michigan Ave is the thing, but in terms of things to do at night, proximity to events, restaurant choices, and simply the neighborhood....well, this place cannot be beat. It has been my best kept secret all these years....if you want fancy, this is not your hotel, but if you want a place to be thats near all the places to be, its Days Inn Lincoln Park for me!", "Date": "April 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ft. Smith, AR", "Title": "“Better than expected!”", "Author": "geoffg32", "ReviewID": "UR14486794", "Content": "We booked 5 nights through choosechicago.com and got a nice rate (under $100). The rooms and bathrooms were very clean and fairly spacious. Best bed I've had in a hotel. Free breakfast was decent. The staff was friendly and the Lincoln Park location was convenient (15 minutes downtown by bus). Certainly not a full-service, downtown hotel, but more than adequate and much, much cheaper. Will definitely stay here again.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Better than expected”", "Author": "lennon2004", "ReviewID": "UR14000827", "Content": "I stayed three nights at this hotel. I was pleasantly surprised by my room here - I expected something small and cramped, but I found the room to be spacious. The bathroom was a little small, however, but still not bad. Every staff member I encounted was friendly. And the breakfast is worth getting up for - a variety of juices, breads, pastries, and waffles are offered. It's a little out of the way for tourist-y attractions, but I felt it was worth it. It was easy to hail a cab out front. The one downside I found was that the stairwell was rather narrow; however, the hotel does offer an elevator.", "Date": "March 2, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Loved it!”", "Author": "pumpkinhead2010", "ReviewID": "UR12468150", "Content": "I stayed at the Days Inn on my first trip to Chicago. The price was very reasonable, the rooms very clean and the staff friendly. The surroundnig area of Lincoln Park was very nice, although a way out from the Loop. Would definately stay again.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Decent Place and Location for the Money”", "Author": "cubsgirl72", "ReviewID": "UR12300246", "Content": "Stayed here for one night on New Years Eve 12/31/07-1/01/08, since we were clubbing in the area. Great location to Clark/Broadway/Diversey. Great neighborhood. The hotel staff was very friendly! The room was a double queen bed room, the beds were more of the size of a full bed. Bathroom was ample in size. The hotel rooms vary in size because the property used to be a condo bldg converted into a hotel. The room I had faced out to diversey, considering it was New Years Eve, it was very very noisy with people passing by all night and talking loudly. It's a run of the mill hotel but it was better than anticipated. The breakfast buffet in the morning (9am - 11am) was free and it had fruit, cereal, waffles, bread, bagels, muffins and croissants. It also had coffee, and dall different types of juices and milk. Very unexpected and a nice touch! This location would be good for those that want to be close to Lincoln Park Zoo, Wrigley Field and tons of bars. You are also a short cap ride away from Downtown.", "Date": "January 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Best Days Inn”", "Author": "1NicePerson", "ReviewID": "UR10777908", "Content": "This is a great hotel. The rooms are small (European style) but the housekeeping is first rate. The staff are very accommodating and helpful and the hotel is extremely well managed. It's in a lively location, convenient if you're traveling by bus. Bus 22 and 36 stop right on the corner as does 76. From O'Hare, take the Blue line to Logan Square then the 76 bus to the hotel. With all the subway construction on the Brown line, it's just not practical to take the subway to get to the hotel. One word of CAUTION! There are about four rooms that do not have the combo heat/AC units installed yet. If you're \"lucky\" enough to get one of those rooms, you probably should request a room change. Those rooms have a small air conditioner in the window with side panels that let the cold winter air right through. Supposedly the steam radiator provides heat but it \"cycles\" on and off and no one seems to know whether it will cycle on during your stay (or even your lifetime) and it does get cold in Chicago during the winter. But if you get one of the other 120 or so rooms you will find a modern HVAC unit that will keep you comfortable all winter long. Not sure why the hotel has not installed these in all rooms yet.", "Date": "November 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Great hotel, great location and great service”", "Author": "ash2882", "ReviewID": "UR10302199", "Content": "I came to Chicago for business October 24th. I searched all of downtown for a good deal. Everything seemed to be so expensive or gross and scary. I came across the Days Inn in Lincoln Park and found it to be fairly close to downtown. It is a hike from Ohare but fairly easy to the city. There is plenty of restaurants and stores within walking distance. The rooms are quiet and very clean. All white bed linens. Not the biggest room (queen size bed) but it is exceeds your expectations of a Days Inn. The bathroom is very clean and nice. I found the front desk to be very helpful and friendly. For my first trip into a big city alone, the hotel made me feel very safe, secure and comforted. An unhappy hotel experience was the last thing I needed. I would highly recommend and encourage others to stay here.", "Date": "October 24, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Great location, good value”", "Author": "jvsgooch", "ReviewID": "UR10198087", "Content": "We actually live in the suburbs of Chicagoland, but had family coming for the weekend who wanted us all to stay downtown so they could see the sites and go \"clubbing\" at night and could grab a taxi back to their hotel afterwards rather than having to drive back to our house at night--wise choice! Unfortunately, it was a busy weekend, most hotels were booked solid, and, the only rooms available downtown started at $400 per night--at least according to the various hotel booking sites on the internet. According to the Days Inn central reservations, this hotel was also booked solid, however..... ...Important Tip! Even if all the internet hotel reservation sites and central reservation center for a hotel chain CLAIM that a particular hotel property doesn't have any available rooms, it is usually worth a shot to try calling the hotel property directly, as they usually \"hold back\" a few rooms for phone reservations and their regular guests. I like to call the hotel after midnight and talk to the night auditor, which is what I did, and sure enough, he was able to \"force\" the system to book a reservation irregardless--and was also able to give me a special \"package\" rate of $132--really good rate for this particular weekend! (When calling the hotel, do not select the menu option for reservations - \"1\" as it will transfer you automatically to Days' Inn central reservations; Instead press zero '0' to speak directly to the hotel's front desk staff.) In truth, I called 9 other hotels as well which were supposedly booked solid, and found only 2 that had not held a few rooms back. However I booked at this Day's Inn because of its reputation and exceptional Lincoln Park location--an upscale neighborhood which is safe and secure, close to Lincoln Park Zoo (free admission!) with numerous eating establishments and popular clubs--walking distance to Cub Stadium (about 1 mile) and easily accessable to Navy Pier and \"the Loop\" via subway, or by hailing any one of numerous taxis that run directly past the hotel at all hours of the day and night. Taxi cabs in Chicago charge very reasonable rates, our ride to Navy Pier, for example, was under $5. OK, so maybe this hotel isn't The Drake or a Hilton, but far superior to any other Day's Inn we ever stayed at. The beds are all \"triple sheeted\", meaning there are 2 top sheets that completely encase the blanket for added cleanliness. The furnishings were a little older, but very clean. The free deluxe continental breakfast includes fresh Belgum Waffles which you make yourself by pouring the preprepared batter into Waffle Irons, along with complimentary copies of USA Today, and complimentary day membership to the Bally's Gym next door. Free \"wifi\" and expanded cable are also included. Parking: You can either park your car yourself in the self-parking garage located next to the hotel ($14.95) or use the hotel's valet services ($20). There is also metered parking available on the street outside the hotel if you don't mind returning every couple of hours to \"feed\" the meters. Overall, we found this hotel to be a good value for the price paid.", "Date": "October 21, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“I like the Lincoln Park Days Inn”", "Author": "tudomany", "ReviewID": "UR10055193", "Content": "I have stayed at this hotel several times over the past 15 years. It is quiet, clean, moderately priced, and very conveniently located near several bus lines. Clark Street, on which it is located, is a major shopping street, and there is parking at the nearby Century Mall. I have found the staff to be friendly and helpful.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“So good that I almost don't want to tell anyone about it!”", "Author": "NKC", "ReviewID": "UR8516053", "Content": "Forget your impression of the Days Inns as being a chain of down market, shabby properties. This place is not only the best Days Inn I have ever seen; but also one of the best places to stay in Chicago -- even though it's not in the Loop. The good points: Location! North Clark and West Diversey in the heart of the Lincoln Park residential and shopping district -- an easy, safe 1-1/8 mile walk from Wrigley Field past great shops, bars, and restaurants, and about the same distance to Lincoln Park Zoo and the waterfront. Valet parking is $20 per night, fast, and reliable -- a bargain for Chicago. Every room has very fast wireless internet service at no charge. The executive rooms are apparently newly remodeled and refurnished, quiet, very clean, and fully appointed -- and about half the price for a comparable room in a downtown hotel. Service is exceptional by any hotel's standards. Everyone -- from the valet parking attendant to the bellman to the front desk staff -- rank among the best I have encountered in Chicago. We left a valuable item in our room when we checked out. In many hotels it would have been lost. The Housekeeping staff secured the item and left a message at our home phone number before we were able to call them. Nothing at this hotel could be considered a \"bad point,\" but here are three very minor issues: Because of the structure of the building (which apparently was not built to be a hotel) the hallways and rooms are very dark. The included buffet breakfast is a good value,but the dining room is small and sometimes uncomfortably crowded. Again, there is not much that the hotel can do about this without cutting into the quality of the breakfast. The hotel could use a second elevator, Bottom line: Great location (especially for a Cubs fan) and exceptional value for Chicago! No wonder this place has been recognized as the best hotel in the Days Inn chain.", "Date": "August 27, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great value!”", "Author": "latinboy1976", "ReviewID": "UR8382439", "Content": "I enjoyed my stay at this hotel. It is in a great local, Walgreens across the street, my bank a few blocks away in both directions, Jamaba Juice next door and my favorite coffee shop Intelligentsia in Chicago only a few blocks north. Yes the rooms are small but I have stayed in smaller (Beverly Terrace in Beverly Hills). But I found the room very clean as well as the bathroom. The front desk folk were great on advice on transport and local eats. The only issue I had with the hotel is at least with my room there should be a sign posted next to the bathroom watch your step. Upon entering I had to use the restroom and almost killed myself since I hadn't turned on enough lights and tripped on the step up to get in the bathroom. The second , third and forth things I didn't like about the hotel was the lack of water pressure, hot water for the shower unless it is morning but even then it is lacking and the VERY SLOW drain in the bath tub. As for the very slow drain in the bath tub I just chalked it up as having old pipes. I unfort. forgot to mention this upon check out as I had an early morning flight and was still half asleep. If anyone mentions this to the staff what is/was their reply? Over all though I did enjoy my stay and just now booked a room for a couple days to let my hair down in Oct.", "Date": "August 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Upper Michigan", "Title": "“Great, clean and friendly place to stay”", "Author": "JennyStar00", "ReviewID": "UR8361501", "Content": "I stayed at this hotel with my boyfriend for four nights. We went to Chicago to see a Cubs game and do all the tourist things as well. I have to say it's a great location if you want to be close to downtown, but not right smack in the middle. First: The Room We had a single queen and the room is a bit smaller than most hotel rooms, but it was perfect. There was a nice section in the room to but all of our luggage and shopping bags, and they stayed out of the way. The bathroom was nice, a large mirror. The downside is there really isn't any room to put your toiletries in the shower, and their isn't a fan. The A/C worked the entire stay and kept our room very cozy. The best part was the bedding. Soft, comfortable down comforter and pillows. I did't want to get out of bed some mornings! Second: Breakfast This was nice. I had a bagel and cereal and OJ every morning. There were tons of other selections as well. I even was allowed to take the food to my room. Third: Shopping Right as you exit the hotel there is a Jamba Juice, Barnes and Noble, Walgreens, and many restaraunts. Renaldis pizza is less than a block away. Also a shopping mall is less than a block away. If you walk a little further you will find a Best Buy, more shopping and more eating. Fourth: Valet The Valet service was very good. I never had to wait more than 10 minutes to get my car. They were very friendly to me. I even forgot something in my car, and the man went and got it for me, instead of having to get my car and take it out myself. That was very nice. EVERYTHING ELSE: The L train is like straight two blocks, when you take a right out of the sliding doors of the hotel. This station was closed during my stay, but the next one was only two blocks down. The L is very easy to take, and was my first time and I used to get all over Chicago. This is a great place to stay. Staff was helpful. Clean hotel as well.", "Date": "August 6, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toledo, OH", "Title": "“Good Location, Okay Room”", "Author": "DukeFan91", "ReviewID": "UR8355746", "Content": "My husband and I recently stayed at this hotel for one night as it was one of the only hotels in Chicago that had rooms and wasn't outrageously priced. The hotel is in a nice area with a bus stop to Magnificant Mile only 4 blocks away, however, the Diversey EL station is closed for the next year (it was only 2 blocks away) making the next closest station a bit of a distance away (7+ blocks) so traveling the EL is somewhat difficult from this hotel...stick with the bus if you can until summer of 2008. The staff was fine, no problems with the valet, and breakfast decent b/c of the make your own waffles...without them, the breakfast would not be so good. The hotel is quite old, the lobby is nice, but the rooms were not as nice. Our double bed room was tiny!!!! There was a bed, a small desk, a nightstand, and a TV stand making it packed. The bathroom was updated, however, the shower was impossibly small. Honestly, the room reminded me a lot of my dorm room in college (ha, that room was really pricey too and not that nice!) Overall, the hotel was okay, but I would recommend staying at the Red Roof Inn just off of Magnificant Mile...it has comparable rates and nicer rooms.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Minneapolis", "Title": "“Worst Chain Hotel in Chicago”", "Author": "ChickenandWaffles", "ReviewID": "UR8136501", "Content": "Where to start? The rooms are shabby. The beds are undersized. The bedding smelled of bleach. The elevator is impossible. Valet parking took 1/2 hour with nobody ahead of us. Staff is pleasant enough but has no knowledge of the city. We booked this due to its contingency to DePaul University, but that (relative) convenience did not make up for everything else. Extremely disappointing.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Great Value, Great Location for a Different Chicago Experience”", "Author": "haasmail2006", "ReviewID": "UR8128479", "Content": "We arrived at the Days Inn Lincoln Park late in the evening after an exhausting day of travel that started 14 hours earlier. The directions on their website were excellent so we had no problems finding it despite being tucked into a residential / retail neighborhood and they even made sure that we approached from the right direction so we could take advantage of the valet service. The front desk staff may have been the best I have ever experienced. Not only did they help us find Chicago deep dish delivery, they got us menus and coupons and even offered to order it for us. When there was a problem with our room key, they sent someone up with us to make sure that our new keys worked. The hotel is an older building that has been refurbished. The room itself was comparable to other rooms in this class of hotel. The bathroom was small and dated, but clean. As I mentioned, itâ€™s in a mostly residential /retail neighborhood, and on a busy corner. If you are light sleeper, you might have a problem with the noise, but it didnâ€™t bother us. Be sure to request an upper level floor if one is available. The next morning, we enjoyed their complementary continental breakfast including belgian waffles and coffee. We were spending the day in the city before driving back to Ohio, but we didnâ€™t want to get our truck out of valet parking and leave all of our luggage in there after finding new parking. The front desk stored our bags for the entire day for us and didnâ€™t charge us anything extra to leave our truck there until that evening. The hotel is walking distance to Wrigley Field, brown and purple line CTA trains, and Lincoln Park. The neighborhood itself is also great and has good shopping. If you are looking for five stars, this place isnâ€™t it, but it is an excellent value in a great Chicago neighborhood. We will definitely stay here again.", "Date": "July 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Loveland, Colorado", "Title": "“Great place to stay for a cubs game!!”", "Author": "Strongs", "ReviewID": "UR8123125", "Content": "This was our 2nd time to this hotel and it was even better than the first time. Room was clean and comfortable. Perfect place to stay when in town for the CUBBIES!!! Giardinos pizza, cold stone creamery , walgreens, jamba juice and even a shopping mall all just steps away. Staff is nice and helpful. Great free breakfast in the morning. Ask the front desk sometimes they have coupons for free or discounted prices for things nearby. They gave us 5 free coupons to get into Zanies comedy club!!!!", "Date": "July 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "chicagopace", "Title": "“Basic but clean hotel for the price and amenities”", "Author": "chicagopace", "ReviewID": "UR7942451", "Content": "Read a number of reviews which for the most part were correct - the hotel is very basic, older, has the a/c units hanging out the windows but does offer a good value for its location in Lincoln Park. I took a flight into Midway, took 1 hour to take the two trains and walk three or so blocks to the site. For $2, not bad and the train ride was pleasant. Just down the street is Einsteins, Walgreens etc. Unforuntately, the hotel had a problem with their power, ConEd had to replace 3 transformers so no a/c, no free internet during the evening and morning. Had to cancel and book another hotel. All in all - just realize there's no frills, the finishes are old and rooms are very small. Friendly service, but not sure why they were Hotel of the Year which to me was misleading.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“TINY TINY ROOMS....”", "Author": "nicebizguy", "ReviewID": "UR7591297", "Content": "First, this hotel is technically in Lakeview, one neighborhood north of Lincoln Park. The neighborhood is great, just wanted to clear that up. The hotel is in good condition, the rooms clean, but boy, is the room and the bathroom are very tiny. Very much a New York sized room. The photos on their website are not really accurate. If you are going to a Cubs game, or just want to get more of the local flavor, this is a good choice. But paying $130 a night for this iis overpriced. If you can find a deal under $100, grab it. Otherwise, I might suggest looking elsewhere via hotels.com for a better deal at a more luxurious hotel for the same price.", "Date": "May 12, 2007"}, {"Ratings": {"Service": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Westwood Los Angeles County, California", "Title": "“Clean and quiet”", "Author": "ExperiencedTravelers", "ReviewID": "UR7482932", "Content": "We stayed at this hotel for a weekend in April in a suite. This consisted of two very small rooms that the connecting door was taken off of and one bath converted to a closet. The remaining bath was tiny (reminded me of European baths). The window overlooked the roof - which made the room very quiet! The hotel was full and only once did we even hear noises, and they appeared to come from next door. While the towels were pretty flimsy, the nice bed and pillows made up for that. The \"continental breakfast\" was one of the better ones I have seen, with make-your-own waffles, cereal and really good donuts. The desk staff and everybody working there seemed to go out of their way to be nice. Don't expect anything close to luxury from this place, but it is worth the price.", "Date": "April 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Great Deal”", "Author": "jrs47", "ReviewID": "UR7406957", "Content": "I was attending a workshop on the north side of Chicago and I wanted an inexpensive place to stay that would be convenient to the workshop (further north) and also to sightseeing in the loop. After reading about the small size of the double bed rooms I upgraded to a queen size bed room. It was spacious, and it faced the inner courtyard so it was also quiet. I got what I was looking for - inexpensive, a safe location, a comfortable bed, and very clean. The Brown Line el station is a 4 block walk, and there are buses going north and south (to the loop) right on the corner on Clark St that run frequently. With respect to other people's comments, the elevator is small but it can easily hold at least 4 adults. The water pressure fluctuates, but the shower control regulates the temperature so there are no surprises! I would stay there again.", "Date": "April 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cincinnati", "Title": "“Good value in a good neighborhood”", "Author": "ssara", "ReviewID": "UR7351900", "Content": "I stayed here with two friends for one night while we were in town for a concert at the Aragon Ballroom near the Lawrence El. We got a business room with 2 double beds and a roll-away. A somewhat older hotel, but clean and adequate. Located in a busy northside neighborhood, with a Panera, Chipotle, Starbucks, Jamba Juice, and the like nearby, plus a good sprinkling of ethnic restaurants. The hotel is an easy few-blocks walk to the Diversey El. Service was a little uneven. We had requested early check-in, but when we arrived at 1:30 our room wasn't ready, so we had to occupy ourselves for half an hour or so. Also the roll-away bed we had requested hadn't been placed in the room until we asked about it at check-in. Valet parking was convenient and easy, and the $20 for overnight on-site parking seemed reasonable for Chicago. On either end of our stay, the staff let us leave our bags in secure storage while we walked around the neighborhood, unburdened. The front desk staff were knowledgable about options for getting to the airport the next morning. The free continental breakfast was nicer than usual and offered in a pleasant sitting area. I would definitely stay here again.", "Date": "April 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hertfordshire, UK", "Title": "“Very nice hotel”", "Author": "Rogoashear", "ReviewID": "UR7281250", "Content": "This is a comfortable hotel in a great location, with some shops and restaurants within the immediate vicinity and Diversey Station about 5 minutes walk away granting access to downtown. The rooms were nicely decorated, albeit a little small compared to most places in the states. Very cheap considering the location too.", "Date": "April 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "East Lansing, Michigan", "Title": "“Great value, fine location”", "Author": "GelEGuy", "ReviewID": "UR7047444", "Content": "I stayed here for two nights in April 2006 when I was in town for a conference and overall had a great experience (so much so that I've booked the same hotel again). Overall, you're not going to do much better with a hotel in this location (not very far from the Loop, although not really within walking distance to any major attractions) for this price. The accommodations are pretty basic, but for me the biggest plus was the free wireless Internet (really fast connections, too). Some downsides: 1) The breakfast ain't gourmet. But there was an adequate selection of things to choose from, and I left pretty sated. 2) Getting an iron and ironing board my first night was a bit of a hassle. It took about an hour before one was finally sent up to my room (in fairness, they did tell me it would be a long time when I first requested one). 3) The staff really varies in friendliness. I encountered some less-than-chipper people, and one person working the front desk made me feel stupid for not being able to find the elevator (hey, in fairness to me, it's pretty small!) Don't expect to have the red carpet rolled out for you.", "Date": "March 12, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "cd", "Title": "“Still the best!”", "Author": "xxxxx4", "ReviewID": "UR6714514", "Content": "Have stayed and reviewed this hotel before, but felt the need to write another review! Best rooms to book are the \"business\" rooms, which are considerably larger and great for sharing. Staff is most pleasant & willing to help with any requests.Location is a bit north of downtown, if you are planning alot of \"miracle mile\" activities....any price saving could be lost in cab fairs! That said...the neighboorhood is great (Lincoln Park)...interesting shops and very safe....and if you don't mind taking the bus on Sheridan into downtown it's only $2.00! Also, if you are staying more than a night or two, use the parking garage around the corner on N.Clark for $5.00 less per day (and no tip)...It's where they will park your car anyway! :)", "Date": "January 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“I'm glad I stayed here”", "Author": "biztravelor", "ReviewID": "UR6063899", "Content": "I am a business traveler on the road at least 5 months out of the year. That's a lot of nights in hotels. While I love to stay in the big cities' downtown districts when I get the chance, my travel budget won't allow for $200 plus per night hotel stays. That's why I rely on the reviews in trip advisor to help me make a choice. I have seen some mixed reviews on the Days Inn Lincoln Park north. It's common to see some negative reviews, one can't be something for everyone. But I can say I do not have any thing negative to say. My room was a double. It had fresh paint and carpet. Yes the room was on the small side, but again this isn't a $200 plus per night hotel on Michigan Ave. It had a metal tub (often hotels have the fiberglass ones). The water pressure in the shower was fine. The bathroom was clean. My sheets were clean - new mattress. After watching so many news stories on hotels, I always peel back the corners of the sheets to see if I can find any bugs - none here. I had a window overlooking Clark, Diversey and Broadway. The hotel had a conceirge (very nice) as well as valets for parking your car. I called the valets for my car before leaving my room and by the time I went downstairs my car was there. Security was on site late in the evening. I was suprised that none of the reviews mentioned anything nearby. There's a mall beind the hotel with a movie theatre. A Walgreen's next door. Barnes and Noble across the street. Borders next door. Also at the doorstep is a smoothie place, a nuts and popcorn store, Panera Bread, Chipolte, Buca Di Peppo and lots of mom and pop restaurants and cafes. Boystown was just a short walk away - had a blast on Halsted and felt very safe walking back at wee hours of the morning. The lake is a quarter mile walk east. The continental breakfast was great. My favorite was the big waffle machine. The pastries were fresh. The staff was very nice. I did not have any negative experiences. I would absolutley stay in this hotel again and can't wait until my next visit to Boystown Chicago.", "Date": "November 6, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Gem of a Hotel in a Great Loc”", "Author": "bernamac", "ReviewID": "UR5773089", "Content": "We miss this hotel! We were so surprised at the value, especially during the weekday. Now, I am saying COMPARED to other options in Chicago, its a GREAT value. It's not the best place I've stayed. BUT, tell me where you can get a hotel room for under $100 in Chicago that is clean and in a SAFE area. The staff was very friendly. Breakfast is decent, better than most \"continental\" breakfasts. I'm sorry that others only gave it a 1 or 2. We've stayed here at least 3 times and have recommended it highly to others. Maybe those with only bad things to say have higher expectations in a $79 per night hotel in the city or are inexperienced travelers? If you are looking for a clean, safe hotel and know the right kinds of questions to ask (eg, parking and valet fees), then this is your place.", "Date": "September 6, 2006"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Mahomet, Illinois", "Title": "“Stay away from this place!”", "Author": "whiskfern", "ReviewID": "UR5626765", "Content": "The convenience of being within walking distance of the Loop is outweighed by the incompetence and rudeness of the people at the desk. When we checked out, we saw that we had been charged a $20 valet parking fee, when we had arranged our own parking. We asked the desk person to remove the $20 charge, which he supposedly did. HOWEVER, I just received my credit card bill, and discovered we had been charged TWICE by this Day's Inn: $317.60 (no valet parking charge) AND $337.60 (includes the valet charge). When I called to straighten this out the person I talked to was not very interested or concerned, told me there was no one there that could help me, and that I would have to call back the next business day.", "Date": "August 19, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Great Hotel”", "Author": "Koei-Seun", "ReviewID": "UR5606514", "Content": "Stayed here for one night in August 06. Had a \"business\" king room and a \"business\" dbl. queen room. Both rooms were very spacious and comfortable.That said, I did happen to see the inside of a standard one bed queen room and it was VERY small. The lobby and common areas were all very clean and updated. The neighborhood is safe and walkable.Every staff member was friendly, competent, and kind! Not sure where the writer of the review titled \"\"SRO Accomodations\" (6/26/06) stayed....but it couldn't have been here. Would stay here again anytime I want to be in N. Chicago! :)", "Date": "August 13, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Days Inn - Not bad, just not great”", "Author": "BusyMom1961", "ReviewID": "UR5564578", "Content": "Hi everyone, I just arrived home from spending the last two nights at the Days Inn on Diversey. The hotel room was clean and wasn't really small. We were in Room 211. It had a coffee maker and iron, but no microwave or frig,(but neither was expected). The staff help was hit or miss. Some of the staff went out of their way to help you, where others couldn't be bothered. The valet people were very friendly although we didn't use their services. While asking directions to different attractions, some of the clerks gave them and were very helpful, others would have gotten me lost. The continental breakfast was nice, they had the usual bagels, cereal, juice milk, waffles. My real complaint was with the showers; very little water pressure and then you would get a shot of cold water, then it would go back to hot. You could tell when this happened by the scream from the bathroom. Our room faced Diversey and it was loud from street noise. I never heard any noise from the hall ways it was all from the street.. Stair way was narrow,(never used the elevator - it seemed to take way too long) but much quicker than the elevator. Overall, I might stay there again, but would have to really think about it . $300.00+ for two nights seemed a little high for what we got.", "Date": "August 6, 2006"}], "HotelInfo": {"Name": "Days Inn Chicago", "HotelURL": "/ShowUserReviews-g35805-d87571-Reviews-Days_Inn_Chicago-Chicago_Illinois.html", "Price": "$93 - $176*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">644 W Diversey Pkwy</span>, <span class=\"locality\"><span property=\"v:locality\">Chicago</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">60614</span></span> (Formerly Days Inn Lincoln Park - North)</span> </span> </address>", "HotelID": "87571", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/20/c4/20c468a21f62941d2b58260f061c197d7large.jpg"}}