{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Perfect boutique hotel in shopping paradise”", "Author": "Worldfoodies", "ReviewID": "UR128156178", "Content": "Stayed here with a girlfriend for a shopping expedition of Barcelona. The hotel is located on a beautiful walking street in the area of Eixample. This is where all the upmarket shopping and dining is in Barcelona. The hotel is about a 15 minute walk to the Ramblas area but away from all the noise and tourists to enjoy a peaceful nights sleep. The rooms are quite small but furnished beautifully and we had a small balcony which we had coffee on each morning. The concierge desk was extremely helpful and both the bar, restaurant and breakfast were fantastic. The bar had an exclsuive outdoor area on the walking street where you can have drinks and food and watch the world walk by. There is no pool here but you head over to their sister hotel \"Hotel Majestic\" and use their incredible roop top pool and bar. Even if you don't go for a swim, head over to take in the sunset and 360 degree views of Barcelona with a cocktail in hand. The spa at The Majestic is also incredible and I had the best manicure and pedicure here. A top notch place to stay!", "Date": "April 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great Location for the Apartments”", "Author": "BlindTom", "ReviewID": "UR127991980", "Content": "We stayed in a two bedroom apartment with terrace, so I can't comment on the hotel rooms. The apartment was great, around the corner from the hotel down a slightly more quiet alley full of restaurants. The apartment was quite spacious, and is perfect for a family (particularly one that has been travelling together for a while). The room was modern, and all of the appliances worked properly. The washing machine was a bit of a challenge, but that is always the case in Europe. Housekeeping was a little spotty in places, but that is just quibbling. If you are looking for somewhere to stay in the Eixample, this is perfect. Close to the shopping and attractions, but also close to the neighboring Gracia -- probably the most underrated part of the City.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Truly an experience with great modern touches”", "Author": "slurer", "ReviewID": "UR127904062", "Content": "First time in BCN in Nov 11 and weather was great. Murmuri has great feel to its contemporary, and fusion-like decor, completed with modern touches to the finer details of room lighting to cater for different moods. You could see the level of details placed by the designer - sound systems, mood lighting and overall decor. Concierge/front office was helpful. Internet costs in Spain is generally expensive but was not a must during my vacation. Definitely worth returning as a couple stay! Looking forward to my next trip there!", "Date": "April 15, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Nice, but could do better for the price”", "Author": "proffesser", "ReviewID": "UR127823019", "Content": "Stayed here for 3 nights over a long wkend. Location is good, close to some good restaurants and attractions but far enough from la Ramblas to be quiet and relaxing. Hotel looks nice and staff were polite and reasonably helpful, but did not extend themselves beyond answering direct questions (if you didn't know the exact question to ask, don't expect a helpful answer). One complaint was the fact that our room wasn't made up one day (by 5pm) and after calling reception the maid appeared at the door apparently annoyed that we should ask! Also, do not expect tea/coffee facilities in the room and a late checkout will cost you a fair bit. On the plus side, there is a small roof terrace, the rain shower in our room was great and the hotel seemed very quiet (didn't hear neighbours). I would go back if the price was right.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Hmmm.... back-up hotel only”", "Author": "Dainis K", "ReviewID": "UR127762233", "Content": "I been traveling to Barcelona frequently. I like the city, the spirit, food, wine and people. Parties and clubs as well. There are stylish hotels and Murmuri I expected to be one of them ( by web page). And it is true, or more precisely: it was true. Right now my filing was: this hotel was overtaken by the bank and now run in lowest possible way. Hotel has great location. However, do not expect to have exactly the same room as you can see on web page. Instead of superior room with the sun beds you may receive small room with small balcony. And room safe small and dark, indeed. Some personnel is nice and friendly, bat majority is very unprofessional. They may promise to book the restaurant, but never do it. Breakfast is OK for 3-star restaurant, but not excellent for 4-5 star place. Please, tomatoes for breakfast are not expensive in Spain! You may use gym at the neighbor hotel Majestyic. Unfortunately this is small and terrible 4 square meter place. Double bad was just two beds close to each other and not useful for sleeping for 2 persons. Well, this pricy place definitely not wort it. There are plenty other options around.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Hotel needs restoration”", "Author": "Ekaterina_Siver", "ReviewID": "UR127674350", "Content": "Location is good, generally hotel is nice, bar is great, service is good but all the furniture is really old, hot water is working really bad.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Gorgeous boutique hotel in a great location”", "Author": "kirstyrae", "ReviewID": "UR127612831", "Content": "We stayed at Hotel Murmuri over the Easter Bank Holiday and we were so glad we booked this hotel! Our room (211) was beautifully decorated and spacious and the bed was so comfy. Also, the air conditioning was great as we could adjust the temperature to just how we like it. Our room also had a spacious terrace where we could enjoy a drink and watch the world go by. Another plus is that, although the hotel doesn't have it's own spa, you can go to their sister hotel The Majestic - which is just around the corner- and charge everything to your room.The hotel is in a fantastic location; it takes about 15 minutes to walk to Las Ramblas and the Gotic area and is just around the corner from some of Gaudi's famous buildings. It also has loads of great places to eat all in walking distance, plus the Metro is a minute's walk from the hotel. The hotel staff were excellent and they recommended some fantastic restaurants. The hotel also has a restaurant and a bar, although I'm sad to say we didn't try either. We will definitely try both when we return to Barcelona and we will absolutely be staying at the Hotel Murmuri again!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stylish Hotel, Stylish Location.”", "Author": "jonnychick", "ReviewID": "UR127606566", "Content": "This Hotel is situated in a fabulous location in a lovely part of town.The Hotel is very stylish and its staff are friendly and attentive. I highly recommend this hotel, brilliant!!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Chic hotel in excellent location”", "Author": "Paul C", "ReviewID": "UR127376639", "Content": "Great little boutique hotel smack in the middle of upscale shopping outlets, and one block away from Gaudi's stunning La Pedrera. Fashionista shoppers will hit all major brands within a 6 square block radius. Hotel's design is modern and chic. Front desk staff are friendly and helpful. Wifi is free in the lobby but not in the rooms (12 Euros / day). Rooms are nicely done (not big though) and clean. Bathroom is nice too with embroidered linens. Water temperature is a bit unstable so you might get surprise stabs of cold water during a shower. The only gripe I would have is I asked for some hot water and they delivered a jug to my room but charged me 3 Euros for it...which I thought was a bit odd since hotels rarely charge for hot water. Other than that, our stay was pleasant and enjoyable.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts, United States", "Title": "“Great, Centrally Located and Modern!”", "Author": "Joen J", "ReviewID": "UR127181691", "Content": "Were in Barcelona for the marathon and stayed a couple of days to the sites (Gaudi - Sagrada Familia). The hotel was centrally located so we could easily walk to the sites or take the metro which is excellent in Barcelona. The hotel has a modern but very comfortable feel to it and the receptionists were very helpful in making good restaurant recommendations (Cachitos is close by and a great tapas place) There is also a very nice roof deck where you can take a cup of coffee and read a good book in peace and quiet. If I was there on business the only downfall would be that the hotel doesn't have a gym and you can really go for a run in that part of the city. However, for site seeing and traveling through Barcelona it's a great hotel.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“First night with outstanding interior, but let down with room service.”", "Author": "c D", "ReviewID": "UR127043955", "Content": "This is a lovely, airy, open building with natural light able to create a lovely environment. The rooms are a generous size with comfy furniture and a variety of drinks to choose from at prices not even a millionaire would pay for a coke. The staff are more than welcoming, smart and helpful, room easy to find with good security and the variety of lighting within the room gives you the opportunity to customise your room how you want it. Bar is not great though, quite and un lively and room service it not good either when waiting for your complimentary drinks and nibbles. We will have to wait to have them tomorrow now as we had to go out, after waiting an hour. This is all just for half a day.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great Stau”", "Author": "TaliesinH", "ReviewID": "UR126925556", "Content": "Second time staying at Murmuri- and it was great as the first. Best location at the top of the Ramblas and close to the Diagonal, the restaurant food is about the best I could find, and the designer style throughout of this small street-front hotel feels good. Rooms are not big but bathrooms nicely designed. The only negative is the cumbersome and expensive wifi system that cost $10 per day and it is annoying to have to keep logging in. But overall Mirmuri is highly recommended.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colorado", "Title": "“Hotel is better than apartment”", "Author": "RWWColorado", "ReviewID": "UR126703171", "Content": "I booked a stay last week in a one bedroom apartment at Murmuri. While I can see the advantage if you need a kitchen, I didn't like the location very much. It is down the street and around a corner and not attached to the hotel itself. There was no bathtub. After 2 nights there, I asked to be switched to the hotel and found it much nicer. The rooms were lovely and the amenities very nice. The staff is, for the most part, very helpful. I would stay again.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kirkcaldy, United Kingdom", "Title": "“First Visit to Hotel Murmuri”", "Author": "Neocis", "ReviewID": "UR126639931", "Content": "I stayed in this hotel for two nights towards the end of April 1012 whilst on business. The room was a \"privilage\" double room which is slighty more expensive than the normal (slightly bigger and with the possibility of a terrace). The room was perfect in every way; stylish, spotless, quiet etc. (the iPod dock is a nice touch) and staff could not have been more helpful. I managed to get a terrace but since it was raining a good part of the time I didn't get the chance to use it. It was fine but you would have to be quite tall to see properly over the walls - the view was not really good but that was really the \"luck of the draw\". Breakfast was separate and expensive for what it was (11 euros) - buffet style but not a huge choice on offer but this seems to be the way for other hotels in Barcelona I have stayed in. Wi-Fi Internet access is free in the lounge and free for one hour in the second floor lobby (although since I used the service in the room so I can't vouch for this). Wi-Fi in the room is only worth it for 24 hrs (11 euros) and I suggest to take a network cable and plug it in , rather than depend on the wireless. Location is excellent and Metro is 5 mins walk away although as warned everywhere hang onto your valuables.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Hotel and location”", "Author": "Berylruth", "ReviewID": "UR126548013", "Content": "Stayed in Hotel Murmuri Barcelona for a long weekend. Great little hotel and a fantastic location for the tourist bus, shops. Hotel has a really sophisticated feel. Really nice room with a small terrace. Staff very helpful. A perfect place for a short city break.", "Date": "March 23, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Loved This Hotel”", "Author": "A K S", "ReviewID": "UR126528415", "Content": "We stayed at hotel Murmuri for four nights in mid January. We booked a Privilege Double room and requested that our room have a balcony overlooking the Rambla de Catalunya. We were very pleased with the room we were given. It was spacious, nicely decorated and had a nice little balcony. The staff at the hotel were very good. We had some great tapas and cocktails in the bar happily served by Nick, who was very helpful in what to see and where to go for nice food, so many thanks to him. Overall we were pleased with all aspects of hotel MurMuri. It is sure to please those who enjoy the boutique hotel experience.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Great ambience, friendly staff”", "Author": "Sam M", "ReviewID": "UR126304358", "Content": "Hotel Murmuri was great. Very nice comfortable rooms, mellow atmosphere. Francesco at the front desk gave me some great tips for where to go for dinner and a drink on a late Sunday evening. His advice led me to a nice spot on the ocean. I highly recommend Hotel Murmuri.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Great hotel!”", "Author": "love2travel1985", "ReviewID": "UR125898490", "Content": "I traveled with my 10 year old daughter. The hotel is beautiful and clean. The staff was very friendly and helpful. They were exceptionaly kind to my daughter. All their dining recommendations were right on target. We had an awesome stay. The hotel is situated one block from Gaudi's La Pedrera, great shopping and a Metro stop. Perfect location.", "Date": "March 10, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Saratoga, California", "Title": "“Great location & Beautiful Boutique Hotel”", "Author": "Jen B", "ReviewID": "UR125817613", "Content": "I've stayed at the Hotel Murmuri a hand full of times while visiting Barcelona on business. It's on a great street and has a nice staff. The rooms are a bit small, but are nice. I enjoyed my room with a patio facing the side street vs. facing the louder front of the building. The beds are comfortable and the rooms are very modern. I recommend this hotel especially with their location.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "São Paulo, Sao Paulo, Brazil", "Title": "“Beautiful and confortable”", "Author": "gusmansur", "ReviewID": "UR125612082", "Content": "The location is perfect just in Rambla Catalunya and with de Metro station just on the corner. The staff very frendly and rooms with a beautiful design as all the hotel. The rooms very quiet and more comfortable than I was already in Spain. But some points need to improve: 1. Wifi is one of the most expensive I've ever seen. For a hotel of this quality I expected that the internet connection was a courtesy. In the room I got the wifi only worked well in my notebook. On my iPhone and iPad simply not connected because the signal was very weak. Big disappointment! 2. Another downside for this hotel is the breakfast. With a very limited buffet for a high cost of 16 euros. The options are exactly the same every day. For those 7 days it was enough to be annoying.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fairfax, VA", "Title": "“What a wonderful place”", "Author": "MrsLokita", "ReviewID": "UR124932928", "Content": "Hubby and I spent the first two nights of our trip at the Hotel Murmuri during our September 2011 vacation. What a lovely place to stay! The staff was incredibly friendly, very young and happy people :-). The hotel is pretty small with great atmosphere. The room was also small but VERY nice and clean. The locations is great...it is located in a very safe neighborhood; very close the the chic and trendy \"Paseo de Gracia\" and Gaudi's masterpieces La Pedrera and Casa Batlo. There are a lot of great cafes and pastry places around the area. If you want to stay away from all the noise of La Rambla this a perfect place to stay!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very well placed hotel with helpful staff.”", "Author": "realesclarmonde", "ReviewID": "UR124676043", "Content": "We only had three days at the hotel and wished we could stay longer. Lovely balcony, enormous bed and huge bathroom. Room service was good and fast. Chocolates left on bed for the night. Cannot wait until our next visit.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Love the Murmuri!”", "Author": "TerriAmosBritt", "ReviewID": "UR124560179", "Content": "I love this hotel and the staff! I came to Barcelona for three weeks for a cutting-edge spine surgery at the nearby Chiari Institut de Barcelona and had planned to only stay at the Murmuri for three days until I could find an apartment. However, after seeing how comfortable the hotel is and centrally located, as well as how safe it felt, I knew I wanted to stay longer. Plus, the staff was amazing! As I healed from my surgery, I was able to travel a little and went to Montserrat for a couple of days to stay at the monastery hotel. The Murmuri hotel staff didn't even blink. They took my heavy luggage and stored it for me until I returned. As I continued to add days here to my stay, going back and forth, they constantly gave me great rates, instead of jacking them up to the current daily rates. I am still here right now as I write this. I am looking to take another trip away this weekend for a few days and still can't lug large suitcases around. I know without a doubt they will hold my big bags until I return for my last few days here. What a relief to know that I am taken care of and can trust that all is well!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What a wondeful place to stay!”", "Author": "SLMKC", "ReviewID": "UR124234514", "Content": "The service was excellent, especially Francesco who was a great help to us and was most gracious. The hotel is beautiful, clean, safe feeling and in a fantastic location. We will stay there again for business or pleasure.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“Gorgeous hotel with lots of closet space”", "Author": "Saffolein", "ReviewID": "UR123314718", "Content": "I stayed here with colleagues for about four days, and shared a room with one of them. The room was a regular double room, I think, and absolutely gorgeous! And it had the most closet space I have ever encountered in a regular double room. I was very impressed, haha. The room was quiet during the night since it was facing the inner yard, and the beds felt very nice. The different lighting options of the room also was a nice touch. A cute corner balcony came with the room, and bathroom very cool. BUT the shower, being a bit hard to clean properly, had some mold between the tiles. Too bad, bc it brought down the look and feeling of an otherwise great bathroom. Also, the lobby bar is really nice. Needless to say, the location is great and close to \"everything\". All in all, I would love to stay there again, as long as I get a fresh bathroom. :)", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“fantastic hotel apartment in great location”", "Author": "suzannemcgeachan", "ReviewID": "UR123075349", "Content": "we stayed here for a long weekend at the beginning of December and had the most fantastic time, it is a really well located hotel, we booked the 2 bedroom apartment (Liceu) which was a brilliant apartment, spotlessly clean, fully equipped kitchen, well furnished and loads of space with a lovely private terrace. I would highly recommend this place for a stay, the hotel staff were really helpful with maps and suggestions of places to visit and booking restaurants for us and the hotel is so well located that you are right in the middle of some fantastic restaurants and bars and a 10 minute stroll down to Las Ramblas. We didn't eat at the hotel as there were so many places around to try that had been previously recommended to us but we did have a late night cocktail in the bar one of the evenings and they were lovely .... but VERY pricey.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Excelent option at the best part of the city”", "Author": "Fernando G", "ReviewID": "UR122892577", "Content": "We just stayed at Murmuri and it is a place to come back as many times as possible. We were 4, me, my wife and our 2 kids. We took one of their apartments (Liceu) and it was an excelent choice. Since the reservation, made by the website, we received a nice, usefull service from the kind staff. The apartment is clean, quiet, has a well equiped kitchen, a Nespresso machine and everything we needed to enjoy our stay. As I said, the staff was nice the entire time and we recommend this place with no remarks.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“great stay”", "Author": "tissiou", "ReviewID": "UR122844642", "Content": "I stayed at the Murmuri in August and was thrilled. The location is really central, the hotel itself isn't that big but has everything you could expect of a big hotel. The service is top notch, the staff is really nice and helpful, the concierge recommended very good tapas bars and restaurants. The rooms although aren't that big but they're really nice, and the bed so comfy and cosy. The decoration was exquisite. In room breakfasts weren't ever the same, different sizes of fruit juices, not thhe same breads and with or without milk for the coffee, but still, all in all it was a truly great find. I really had a great time and would defenitly go there again.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Little gem”", "Author": "WeekendAdventurers", "ReviewID": "UR122718782", "Content": "Our friends chose this hotel as part of a package for a 5-day getaway to Barcelona for the 4 of us. We loved it! The location is fabulous for great food, shopping and relaxed rambling around the city. Lots of modern touches you might expect in a boutique hotel - great mattress, preset lighting programs, built in closet with lots of shallow stacked drawers that make it easy to sort clothes, towel warmer, etc. The restaurant's asian fusion tasting menu was on par with the better restaurants we found here in TripAdvisor. We loved being able to have access to amenities like the fitness center at the hotel's \"big sister,\" the Majestic without having to stay in a bigger hotel. Staff was very friendly and helpful, particularly with respect to offering an early check-in on arrival from a transatlantic flight.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Central Scotland", "Title": "“Lovely room and friendly service”", "Author": "HighlandRacer", "ReviewID": "UR122621502", "Content": "I travelled to Barcelona for a short business trip with an overnight stay. The hotel is well located - close to shopping and not far from the main tourist attractions. The staff were extremely helpful - checking within a few minutes of arrival that the room was to my liking. I will stay here again on my next visit.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Love this Hotel”", "Author": "Derek Z", "ReviewID": "UR122466352", "Content": "I cannot say enough good things about this hotel. My wife and I stayed here for the second part of our honeymoon, which we took two years after getting married (have to save up money for a trip to Europe!). Coming from London on our anniversary, we arrived and were led to our room quickly. The staff knew it was our anniversary, and had provided us with some sparkling wine and strawberries. The room was large, and we had a balcony overlooking the Rambla Catalunya. A ten minute walk south on Catalunya brings you to the city square, and Las Ramblas, the big street of Barcelona. Throughout our stay, the staff at the Murmuri were very attentive and quick to respond to any questions. All in all, this hotel exceeded all of my expectations. As a bonus, staying here gives you access to the rooftop pool of the Murmuri's sister hotel, located only a few blocks away. Show them your room key, and they have towels and everything for you!", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ringwood, United Kingdom", "Title": "“Excellent choice”", "Author": "MJS1983", "ReviewID": "UR122456255", "Content": "I would highly recommend this hotel as the price, location and service was excellent. When we arrived we were told that our room was not ready and that we would be moved to their sister hotel, The Majestic. I was not concerned as I has stayed at The Majestic before and it was a superior hotel to the Murmuri. The staff escorted us the short walk to The Majestic and we were given a suite for the night and told that our room would be ready the next day. They even collected our bags and took them back to the Murmuri. When back at the Murmuri we were not disappointed. The room was well decorated and very clean. The staff at the hotel were so helpful, recommending places to eat and things to do. The location was great, on a quieter street but an easy walk to the main streets. The hotal has a lovely bar with seating on the street, again the service was excellent. We loved our stay in Barcelona and when we return would certainly stay at the Murmuri again.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Excellent stay and friendly services”", "Author": "WSFSingapore", "ReviewID": "UR122443951", "Content": "We had a wonderful stay in the hotel from 15 Dec to 18th Dec 2011. The room is clean and spacious and the service is friendly. We had a good experience with Mr Francesco who is managing the night shift.He is helpful and friendly. We would like to stay in the same hotel in our next visit to Barcelona. Woo from Singapore", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Modern Hotel, Friendly Staff, Perfect Location”", "Author": "Ptk813", "ReviewID": "UR122443809", "Content": "We would return to Hotel Murmuri over and over. The staff was superb, friendly, knowledgable, helpful. The rooms were well sized, bright, quiet, well appointed. The location was ideal. I really felt at home, which is strange, but that is how you were made to feel. The one negative was the internet connection. A real pain. You had to get a new password each hour...this should be handled. Finally, the decor was just right, comfortable and attractive.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia, United States", "Title": "“\"Good location\"”", "Author": "bonnevie100", "ReviewID": "UR122290004", "Content": "We stayed at the Hotel Murmuri for 6 nights during our last trip to Barcelona and selected it based on the recommendations on Tripadvisor and the upscale-ish location. The hotel is located on a tree lined street that is very charming with shops and restaurants. After first being given a room that overlooked a basketball court, we were relocated to a much better room with a balcony overlooking the street. I was very disappointed by the staff who barely acknowledged us when we would walk in and out of the hotel. We had a hard time sleeping at night because of the music blasting up through the vents from the club downstairs. I have stayed in many higher-end boutique hotels and never dealt with such standoffish hotel staff. In the end, I would have rather paid to stay in a warmer environment with a staff of people who want to make our stay memorable!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely modern small hotel”", "Author": "42ChrisS", "ReviewID": "UR122058100", "Content": "I stayed two nights in mid December, and would return to the hotel again. My complaints are minor -- limited hours for room service, and the restaurant serves a kind of tired nouvelle Asian fusion cuisine that one can get anywhere -- not worth it when Barcelona has such good food elsewhere. On the plus side, I checked in to my \"privilege\" class room, and was given 407, facing the back of the building, with a kind of glassed-in sitting area instead of an actual balcony. So I asked for a balcony room, and was immediately switched to 410, which was perfect. Great little iron balcony on the front facade of the hotel, with two chairs and a table and a wonderful view all the way down the Rambla de Catalunya to the Placa Catalunya. Room was tastefully furnished, big bathtub, everything worked, no complaints whatsoever. As for noise, the glass door to the balcony was double or triple pane glass, and there's a blackout curtain to pull across the window at night, plus the Rambla Catalunya is a quieter street than most in this area. So I barely heard a low-level of street noise, really not a problem. Would definitely stay here again, especially as a solo traveler or on business. It's clean, convenient, maybe lacking some of the charm of Barcelonas more architecturally interesting hotels like the Banys, but a worthwhile trade off.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "CAIRO", "Title": "“Excellent botique hotel in great location”", "Author": "ICE-MOH", "ReviewID": "UR121866386", "Content": "I stayed with my family at this hotel for a week during our last visit to Barcelona. The hotel was not our first choice, as we are regular guests at the majestic hotel in Paseo de Gracia. but hotel Murmuri did not disappoint. the location is great and in walking distance to many cafes, restaurants and stores. Rooms were large and clean, With a nice bathroom. The front office staff were very helpful and attentive. We would definitely chose hotel Murmuri again.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Chic boutique hotel in a trendy area”", "Author": "FSR99", "ReviewID": "UR121744329", "Content": "In Eixample (not old Barcelona) but in a beautiful neighborhood on the Rambla de Catalunya - a beautiful boulevard lined with cafes. Shopping is mostly Rodeo Drive level. Near a cople of amazing Gaudi buildings and a short metro hop from the Gaudi Sagrada Familia. Entrance to metro is 1 half block away so the city is literally at your doorstep. \"Privilege double\" room was on the small side but beautifully fitted out. Included breakfast was more than adequate. My only complaint was the outrageous Internet rates as noted in other reviews. Hard to understand when even McDonalds offers free access. I do not choose to carry my laptop on outings so I was stuck!", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Beautiful hotel in perfect location - as long as you don't need convenient internet service.”", "Author": "TravelProGa", "ReviewID": "UR121707681", "Content": "Stayed here in November 2011 for 5 nights. Being a part of a membership group I was entitled to \"free\" interent service. Well, this is partially true - as it was free for one device. However, traveling with a smart phone and an iPad - you could only be logged onto one device at a time - and logging in and out was an absolute complicated pain. The staff almost seemed embarrassed that this was the case and although they said the right things - one knew that they were well aware of how frustrating it is to guests. Rest assured this was not their first complaint. As a traveler who was expecting to be able to research the area quickly, send texts and emails to family and friends, this was made exceedingly difficult. Thank goodness Mauri, a lovely bakery around the corner, had free, reliable and uncomplicated internet service. I finally gave up on trying to use the hotel's service - and just visited there and enjoyed pastries and cafe. Needless to say, all I recieved from Murmuri was \"we're sorry.\" As the above states - stay here if you like clean uncluttered style in an ideal location - but with no need for internet service. Can't imagine how many travelers these day that will work for - but if so - you'll love it.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cyprus", "Title": "“Lovely!”", "Author": "misstraveler1", "ReviewID": "UR121431426", "Content": "Stayed at the Hotel Murmuri for just two nights on a short city break, the staff was very helpful and polite, the rooms clean (althought a bit small) and the location fantastic!! A plus would be to add more items to their breakfast buffet! I would definately recomend and stay there again.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Fantastic Hotel, Great Location & Reasonably Priced”", "Author": "Nitra315", "ReviewID": "UR121156916", "Content": "I could not have been more pleased with my decision to stay at Hotel Murmuri for a Thanksgiving week mini-vacation with a friend. The hotel is located on Rambla de Catalunya with restaurants and shops lining the street. It was steps away from the Diagonal metro, parallel to Paseig de Gracia - a major high-end (window) shopping destination that's also home to Gaudi's La Pedera/Casa Mila (among others), and a 10-15 min walk from La Rambla. It was literally walking distance to everything, so the location could not be beat! This hotel is the equivalent of a boutique hotel in the U.S. - small, but efficient, quiet, clean and modern with beds, bedrooms and bathrooms sized like US hotel equivalents. I booked a room on the top floor with a private terrace and 2 double beds for under $200USD/night. If we needed new towels or an iron they were just a phone call away. My only pet peeve was that they did not have wash cloths (only handtowels and regular towels), so I would suggest that you bring your own to plan to buy them in town. The front desk staff spoke English fluently and ensured that we were able to check-in immediately upon arrival at 10am. I unfortunately neglected to get the name of one of the women at the front desk who made fantastic lunch and dinner recommendations (Tenorio and Tragaluz respectively) - she was our culinary savior after one too many meals at sub-par tapas restaurants near La Rambla. When we checked out of the hotel at 5am, they promptly called us a taxi that arrived within minutes. Needless to say, I had a great time, and if my travels take me back to Barcelona, there's no question I would stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Good hotel for price”", "Author": "dgaronce", "ReviewID": "UR120769079", "Content": "We loved the location, and the rooms were great. Standard boutique hotel- not too cheapy feeling. Do not expect a concierge with knowledge of great local spots (his #1 suggestion for a night cocktail was the hard rock cafe)- but if you have your own plan, which we did, this is a great base in a cool neighbourhood.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Poor Customer Service”", "Author": "Rob V", "ReviewID": "UR120687079", "Content": "We arrived at the hotel at approximately 10am. We were told we had to wait for our room and for our invonvenience we would be upgraded. We decided to go do some sightseeing. We retuned at approximately 1pm and were told our room wasn't ready and would be ready in a half hour. We had some drinks in the hotel while we waited. We went back to the front desk at about 2pm and still they said our room wasn't ready. The front desk manager then made a phone call upstairs and said our room wasn't ready however, they said we were being downgraded back to a standard room because a big group which had booked a bunch of standard rooms had just conveniently cancelled and now our standard room was available. We finally get to our room and the safe is not functioning. We get that rectified and and there way of compensating us for our inconvenience was providing us with free wifi for our stay (about half a day) mind you it barely worked and we couldn`t get a signal and so really they gave us nothing. Finally, we had to leave the following day and had a arranged a taxi for 11am. Of course, the front desk messed it up and the cab arrived 15 min early so we were rushing and of course he had started the meter. Keep in mind this wasour final stop on our honeymoon and we were heading home. Long story short, the taxi driver drops us off at the wrong terminal and we have to take another taxi to the next terminal. Total cost: 70 Euros or approximately $100 CAD. Our worst stay by far on our honeymoon. Avoid this hotel at all costs. Poorly managed and they don`t know how to treat their out of town guests.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Exceeded Expectations!”", "Author": "Ann R", "ReviewID": "UR120447093", "Content": "We took a long weekend to Barcelona and found this hotel to be fantastic. It quite honestly exceeded our expectations in so many ways. We love boutique hotels and this did not disappoint. The decor is beautiful - upscale contemporary with a great, hip, yet comfortable, feel. We stayed in a Privilege category room with a balcony - the room was a typical European size, not enormous but certainly not too small. We loved the \"mood\" lighting with lighting panels throughout the room - with one touch - the lights dim to a cozy atmosphere - or get brighter (4 options). The bathroom was fairly large and simply beautiful. We used the fitness facilities at their sister hotel - it was a 5 minute walk down the street. The only drawback, I will say, is their internet access is a bit spotty. But... the staff is what made our stay so memorable. Roberto bent over backwards to make sure we were comfortable every time we walked by the front desk. Absolutely work with Francesco, the concierge, who literally created our vacation experience for us. He made countless phone calls, got us into last minute tours, switched venues around to accommodate our changing schedule and was just flat our amazing! We highly recommend this hotel and we will be back!!", "Date": "November 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "moraira", "Title": "“Great Location”", "Author": "barnyardMoraira", "ReviewID": "UR120409345", "Content": "We booked through the website Mr and Mrs Smith on arrival the hotel had upgraded our room to one with a terrace, the room was small but very comfortable and nice, a little on the dark side, however was a little suprised that this room was a step up from the one I had originally booked so am not sure what that would have been like. The staff were pleasant and polite. The breakfast however was horrid, the buffet was fine but we made the mistake of ordering poached eggs and bacon, truly terrible, inedible, and for 16 euro unacceptable, normally I would have complained, I had a terrible cold and just could not face the hassle. Our first night we had dinner outside on the terrace, I was sorely disappointed, very expensive.So yes all in all excellent location, a pleasant enough room just terrible food. So just dont eat there.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Nice hotel, nice staff and great location but internet charges are expensive”", "Author": "Lillias", "ReviewID": "UR120317696", "Content": "My husband and I stayed here in two rooms with our two teenagers for a couple of nights en route to the UK. We arrived straight off a long haul flight at 10 am and they had one room available for us immediately and I was very grateful for that. The rooms are very small. I don't normally bother that much about size as you are on holiday and usually out and about but with large suitcases in tow, it actually makes quite a difference. Our second room was avalable about an hour and a half later which was really great. The only drawback was that the rooms weren't near each other. Even though my kids are teenagers, I like our rooms to be nearby, it's much easier when we're sharing suitcases and one night someone tried the door on our room. This was probably another guest who'd made a mistake but at 3 am, if it had been the kids' room, and they aren't next to us, they'd have got a scare. After our early check in, we came back in the evening and our rooms had been cleaned with fresh towels provided since we'd all had showers that morning. A nice surprise. The hotel is really nicely decorated, all the staff are very nice and very helpful and the location is excellent. The drawbacks are that the rooms are small, as previously mentioned and there was no tea/coffee making facilities in our rooms and the mini bar was expensive, as is usually the case in hotels (over 3 euros for a small bottle of water). My big complaint is the internet charges. This is an expensive hotel, so I do think it should be complimentary. I was told I could have one hour free on the lobby computer for the length of our stay (even though we had 2 rooms). This wasn't very good as apart from anything else, I couldn't access Facebook and it took up valuable time trying to get around in Spanish. I decided to buy internet access for our room which was 15 euros for 24 hours and it was pointed out to me that this was continuous and not 24 hours in total use. Plus it was only for one device (we have 2 ipads) Some might say you're on holiday and don't need Facebook etc but I was trying to contact friends who were also in Barcelona, trying to make bookings for the next part of our trip and trying to check on bank card statements that were on Australia time, never mind 2 teenagers who love their Facebook. All in all, I liked this hotel. If it had internet included I would definitely stay again if I were ever visiting the beautiful city of Barcelona. One tip is be careful when the hotel orders you a taxi. Though no fault of the hotel, I didn't realise that the taxi meters start the minute you call them and we got stung for 45 euros for a taxi to the airport, when it only cost us 29 euros in the other direction. There's plenty outside in the street to just grab one.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“I recommend it for its modern style & for its location next to subway station (Diagonal) but not for their service.”", "Author": "Engaa", "ReviewID": "UR120311344", "Content": "I recommend it for its modern style & for its location next to subway station (Diagonal). Lightening in the rooms are so creative and has many options like ( relax, welcoming and ambition) Reception did a reservation for us in a good Mexican restaurant :) note: when we ordered hot water at 7:30 a.m we were told that the service will charge u for 5 Eur which is not fair comparing to other hotels where they offer heater for water,", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dortmund", "Title": "“Overrated. Overprized. Lacks the details.”", "Author": "Alecprime", "ReviewID": "UR120078366", "Content": "The Murmuri at first seems to be like a great place to spend a couple of days in Barcelona. The location is perfect, cannot be any more central than here. However, there are some mayor drawbacks that make it impossible to recommend the hotel to someone else. First, the regular (\"superior\") rooms are horrible, Marriot-like chambers with no space, and some even lack a sight (there is a window, that opens to a wall with pipes and electricity, you dont see the sky though). Nevertheless these \"chambers\" still cost 120 Euro a night. We asked for an upgrade and took the \"Priviliged\" Room. These rooms are alright, ours had a little terasse, nice bath (no bathtub though), small mini bar, small flat TV (No HDTV). Well, the rate for this room was 220 Euro, which is ridiculously overpriced. Plus, the free Wifi that was promised in the reservations does not apply for the top rooms! Its another 10 Euro for 24 hours. For a hotel claiming to have four stars, this is simply unacceptable. Further drawbacks: There is no spa in the hotel, no sauna or steambath. You can walk to the sister hotel for a treatment... In summary, the murmuri reminds me of a woman with too much make up, that tries to cover its deficiencies under a pile of want-to-be-glam. Three points, since the staff, at least, was very friendly.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kerrville", "Title": "“Well kept secret in Barcelona”", "Author": "marianne a", "ReviewID": "UR120025930", "Content": "Friends and I were delighted with this find in Barcelonal. Centrally located, but just enough off the \"path\" to offer quiet nights and safety. The staff is very accomodating, nelpful and friendly to language challenged guests. Breakfasts are terrific offering superb breads/sweet pastries, along with meats & cheeses, eggs, coffee and teas; then, you can request cooked-to-order directly from the kitchen for a few eruos more than the standard breakfast fare. Rooms are very clean and large with a neat seating area/balcony with windows overlooking interesting housing and roof top gardens. We enjoyed watching waiters from a nearby restaurant take their \"smoke breaks\" on the roof of one building. They were telling jokes, laughing, smoking and in general having a great time on their break. Fun to see, even if we couldn't hear them.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bunbury", "Title": "“Lovely Hotel,great location.”", "Author": "harrybBunbury", "ReviewID": "UR119931322", "Content": "Great Small hotel,Pleasant & helpful staff,comfortable beds and rooms.Best Location in Barcelona.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Apartment hotel”", "Author": "RoboRuth", "ReviewID": "UR119863452", "Content": "We had a very spacious, ultra-modern, clean 2-BR apartment attached to the Murmuri Hotel for 439Euro/night. It had a kitchen (with dishes) and a large deck (with deck lounges and table-and-chair set). View out the back is nothing to write home about, but the apartment was quiet and centrally-located. Internet use was only 10Euro for 24 hr. Hotel has a lovely bar and small restaurant, and there are plenty more to choose from in the neighbourhood. Would definitely stay here again!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Lots of positives but a few noteworthy minuses”", "Author": "TxTree", "ReviewID": "UR119773924", "Content": "My family and I recently stayed for five nights in one of the 2 bedroom apartments (Liceu). There are lots of reasons to like this hotel, but a couple of annoyances kept me from loving it. First, the big plusses. The location is absolutely fantastic: right on the Rambla de Catalunya, near the metro, shopping, restaurants, and just a few blocks from Casa Pedredra and Casa Batllo. Really convenient and lovely. The apartment itself was spacious and comfortable, with a beautiful terrace. The hotel staff were very nice and accommodating. The bar was fabulous. And it was great to have access to the very nice Hotel Majestic fitness/swim facilities. Now, the big minus. It seems that there is a restaurant kitchen just below the Liceu apartment, and we were kept awake (or were awakened) by crazy restaurant and kitchen noises, including most irritatingly a regular \"thump\" sound - maybe a swinging door? - that echoed throughout the apartment every minute or two. It wasn't so bad on Wednesday and Thursday nights. But Friday, Saturday and Sunday were really bad, and went until 1:30 a.m. The front desk claimed no one else had complained about the noise, but I find that hard to believe. A couple more quibbles. WiFi. As many others have noted, there isn't free wifi in the rooms. The hotel is moving in the right direction by offering free wifi in the lobby. But this seems hardly adequate. Sure, I'm on vacation, but I want internet access to be able to book tickets online, research restaurants, check flights, etc. (never mind about work). I don't understand why the hotel can't fix this issue. Coffee. The apartment came equipped with a nespresso machine. Which was great. Except that there were only a few nespresso capsules provided and we didn't realize (because no one told us) that even these were not replenished daily. We were supposed to scout out nespresso capsules during our vacation in Barcelona? That seemed really silly. Someone eventually brought us additional capsules (thank you!) but only after I complained and only the next afternoon. I do hope to return to Barcelona soon and I would stay at Murmuri again if I didn't have to deal with these issues.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "north carolina", "Title": "“Wonderful boutique hotel”", "Author": "mumiller1", "ReviewID": "UR119488095", "Content": "My husband, another couple and I stayed here on our last night in Barcelona. It was our favorite hotel the entire stay. It's in a wonderful location-close to dining, shopping and Gaudi architecture. The staff is extremely welcoming and helpful. The rooms are small and clean, but make the most of their space. We ate dinner at the restaurant in the hotel our first day there and it was delicious. We would definitely stay here again", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palm Beach Gardens", "Title": "“Staff and Service excel at this Barcelona Hotel”", "Author": "Kendotm", "ReviewID": "UR119335374", "Content": "A well trained attendant staff makes our 5 night stay on the Rambla Catalunya as delightful as expected and much more. The receptionists/ hosts seemed to eagerly answer your queries regarding diner, sightseeing, transportation options and all of your needs in a quite professional manner; and always utilizing custom marked maps highlighting your needs. The bar was well manned and intimate. The area surrounding the hotel offers fabulous Tapas and Catalan diner options, chocolate shops and local breakfast at cafe Francesco around the corner had great fresh squeezed OJ, cafe cafe con lesche and a traditional ham or veggie sandwiches. Location ideal for all public transportation including the Aerobus from the airport. Props to Maria C, Roberto, the movie star look-a-like, Frank, and Nick.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halton Hills, Canada", "Title": "“Without hesitation”", "Author": "dtvl", "ReviewID": "UR119310424", "Content": "Great stay for two nights post a Med cruise. The Privilege Double room was large w king bed & very comfy. Bathroom offered all the comforts of home: clean, robes, slippers. Street noise on a Friday night wasn't too disturbing. Hotel bar is very pricy. Cafe Mauri around the corner is great for a snack/coffee, tea, etc. Enjoy the city and walk your legs off!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Meet expectations”", "Author": "Petracca", "ReviewID": "UR119286643", "Content": "The location was good if you prefer to be away from the hustle & bustle of la ramblas. Very expensive to eat & drink at the hotel bar & restaurant, however why would you when there are so many outside your door. Room was clean & looked like the photos however quite small. Internet was in Spanish only", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Charming and Welcoming”", "Author": "DandDToronto", "ReviewID": "UR119074936", "Content": "The best hotel of our two-week visit to Spain. We had a good-sized room overlooking Rambla de Catalunya: a lovely view over a busy avenue but no noise due to excellent soundproofing. The room decor was top notch in both quality, practicality and style. Special mention must be made of the cleaning staff who left our room in perfect condition every day. In fact, staff throughout the hotel were all very good and spoke excellent English. As mentioned by a previoius reviewer, the temperature of the shower water was uneven. Loved the lighting system which set the room up with different moods. Breakfast was good although, given the cost of staying here, an additional price for a cooked breakfast was a surprise. The bar was too noisy for us with loud piped \"music\". The outdoor cafe was pleasant but the service erratic. It appeared that there was only a single English language newspaper in the lobby each day; a common problem at Spanish hotels which we did not expect here. The location of the hotel is perfect. A charming area away from the hustle of the city centre but within easy reach of evetything.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“We were WOW'd right from the beginning!”", "Author": "Luttrell", "ReviewID": "UR118960876", "Content": "First off, the staff at Hotel Mur Muri is fantastic! My wife and I arrived at the hotel early (10am) and I knew that check in wasn't until 3pm. I asked the ladies at the reception desk if by chance they had a room available. They informed us a room was available and we were welcome to check in early. Music to our ears considering the experience we had with another hotel in Barcelona one week prior. From the moment we walked into the hotel, we were WOW'd. From the decor to the friendly staff (who informed us that they had upgraded our room), and the attention to detail in our room. The bed was extremely comfortable - wonderful pillows - bathroom fantastic - large, plush bathroom towels - warm colors - very, very nice. Hotel Mur Muri is in a great location as well. Right out the door you'll find great restaurants, fantastic shopping and tours of Barcelona (the hotel staff can sell you tour tickets at the front desk). Hotel Mur Muri has a bar that is a great place to have a glass of Spanish wine. Don't miss it. But rarely do you find this kind of personal service. The morning we were leaving, I wanted a cup of Starbucks coffee (which is only 1 block away). It was early and to my dismay, Starbucks had not opened. As I was walking back through the lobby, I asked the staff what time Starbucks opened and was told around 9:30. Mentioned that I really wanted a cup of coffee but oh well...I'll just have to do without. At that moment, one of the staff said - \"I'll go into the bar and make you a cup\". WOW! Within 5 minutes, he made me the best cup of cappuccino...it was perfect. What GREAT service! I highly recommend you make Hotel Mur Muri your hotel of choice in Barcelona. Don't miss this hotel - it's splendid.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good central location, overall very good”", "Author": "Peter G", "ReviewID": "UR118951158", "Content": "Hotel Murmuri is probably 15-20 minutes walk from the Placa de Catalunya, and all around are great shops and restaurants. It's alos close to the hop-on/hop-off tourist buses. The room was quite nice, although there wasn't much room to put the bags. The bed on the other hand was ridiculously large - I would have preferred a smaller bed and more floorspace! We stayed for 3 days prior to our cruise, and were upgraded to a bigger room the second time we stayed after the cruise. The staff were all pretty helpful. The only thing that let it down for me was the internet access. The wifi didn't work in either room, and we use it when travelling to Skype the kids and grandkids at home. We had to go down to the fixed computers on the first floor, and then of course we couldn't use Skype. On top of that we had to pay extra to use the internet, and this was the first hotel we stayed at in Europe where it wasn't free (though far from the cheapest!). Apparently their internet is subcontracted to another company, and their service sucks! The staff were apologetic and clearly could do nothing to help, but it detracted from our stay. Starbucks is around the corner and for the price of a cup of coffee you get 45 minutes of internet access included!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent Hotel in great location”", "Author": "RonanJC", "ReviewID": "UR118940676", "Content": "Would highly recommend this hotel as it ticks all the boxes. Its in a great location with the Diagonal Metro stop just around the corner which serves the 2 lines that run to all the main tourist attractions. It has loads of little cafes and eateries for all tastes close by. We did not deal with the staff much but they were very friendly and courteous when we did. The apartment was modern and chic and the bed was the most comfortable I have ever slept in. All in all the perfect experience.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Highly Recommended”", "Author": "nandm1388", "ReviewID": "UR118771459", "Content": "We spent 3 nights at Mur Muri and must say that the room and especially the service we got was exceptional! It's a pretty cool hotel with all the trimmings you would expect from a 5 star. A special thank you to Francesco at reception who went out of his way to help us from finding our power adaptor which we accidently left behind to securing accommodation at our next stop in Costa Brava. Excellent work guys! Will recommend this hotel to our friends most definitely!", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“A great way to stay in barcelona”", "Author": "hseofbel", "ReviewID": "UR118635772", "Content": "wish you had your own place, your own apt in barcelona...well you can the hotel Murmuri has apts lofts that are great. we were three traveling and it worked out great, with a kitchen, washer and reg size fridge....no better stay. We were fortunate to have Francesco as our captain on the sailing cruise he arranged...see him -- he is a master at getting your needs met... Francesco...send the pictures please!!!!", "Date": "September 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good location, BUT not so good service”", "Author": "eeheeh C", "ReviewID": "UR118633299", "Content": "I recently stayed at Murmuri with my sisters for 4 nights and chose this hotel mainly for its location and that it received decent ranking from tripadvisor. I normally use trip advisor to choose hotels because it is generally accurate and had really good experience through its recommendations. Given that the room rate is quite high at ~US$320 per night (we even booked 1.5 month in advance) for a 2 person room and that it is situated in one of the best neighborhoods in Barcelona, we expected service to be just as good. However, the service was a disaster and here are a few bad experience that we experienced. I have never complained on trip advisor, but really feel I should this time since I don't want any reviewers to stay there without knowing the following: - Upon check in, they gave me a room located on the 1st floor. Given that I am a light sleeper, I asked to change room to a higher floor. The manager that was serving me literally rolled her eyes and said \"no\", with no further explanation. Afterwards, the male staff standing next to the manager took over and suggested and magically found me a room. Just surprised me that the staff was more nice than the manager. Perhaps it's an European thing. - They are extremely understaffed and don't think they even have room service reps. When i asked for hotel slippers, the check in rep came to my door with the slippers. Very odd. - A few days later, my sister called the concierge (which also happens to be the same check in rep) to ask for recommendation on restaurants and she asked my sister to call back later because she is busy. I've never been asked to \"call back later\" by a concierge, not even when I stayed at Best Western etc. - I had originally prepaid for the first night through an online booking agency. When I was checking out, they said they never got the prepayment from the agency (very large agency) even though I provided the confirmation. They later acknowledged the confirmation but still asked me to pay in full and that they will later credit the amount back to me once their accounting office is open again (I checked out on a Sat). I told them that I don't live in Europe so it will be difficult to communicate later should I not receive the credit. They weren't happy that I refused to pay extra, literally. - After the check out dilema, I asked to leave my suitcase and to pick it up when I head to airport later that evening. When I went back for my suitcase, it was right in the middle of the lobby where I have left it hours ago. Some safe keeping there!! - Also, don't get worked up with the gym that they offer at another sister hotel (Hotel Majestic) because it is really not worth walking 2-3 blocks. It's tiny and the shower is horrible, worse than my high school gym and locker room (from 10+ years back). Perhaps others experienced better times at Murmuri but I definitely will not return there. This hotel is definitely not worth the money.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Recommended”", "Author": "kdc4", "ReviewID": "UR118545378", "Content": "We stayed in a nice, 5th fl superior room. Great view of the street and very comfortable yet modern furnishings in the room. The hotel is one block off of Pl de Gracia and generally well situated. Got a nice bottle of cava as a surprise welcome gift. Lovely touch. Would recommend.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gloucestershire", "Title": "“Excellent - a top quality hotel in every way”", "Author": "gloucesterbloke", "ReviewID": "UR118479070", "Content": "My wife and I stayed in the Murmuri 6-9 September for our wedding anniversary. The hotel is stylish, the rooms are very well finished, and the aircon is excellent - important in Barcelona ! The hotel staff were just the best - polite, helpful, and very knowledgeable about all things Barca. The location is possibly the best bit of all - less than 10 mins walk from the top of La Ramblas, but far enough from the mass crowds, and in a very smart part of Barca - great shops, street cafes and restaurants from right outside the door. Final tip - the Murmuri has it's own pavement restaurant outside the front on Pl. de Catalunya - and it is excellent. We've travelled a lot over the years, and you expect to have to make some compromises each time, but this hotel is top quality, without exception.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Perfect Location!”", "Author": "Eliza53", "ReviewID": "UR118415773", "Content": "We spent six nights at Hotel Murmuri and it was a very nice staying. Pros: 1-The staff is very polite and always helpful, ready to give you information, directions, suggestions, etc - this is a major point for us while choosing a hotel. 2- The hotel is very clean and the room, although very small, was nicely appointed. Very comfortable bed and good bathroom . We took a privilege room with a private terrace ( room 603)- it is incredible tiny! It is difficult for two people to move around the room and the luggage block your passage. The door that leads to the terrace doesn´t open wide because the bed is too close to it. The front desk woman did warned me about the size of the room and offered as an alternative to take a privilege room without the terrace, which is indeed much better in terms of space. We refused because we wanted the terrace. If you don´t mind the terrace, pick this one without the terrace. 3- Location could not be better. The hotel is in a neighborhood called Eixample, which is very nice, safe and with lots of good restaurants, bar and upscale stores. It is in Rambla de Caltalunya ( don´t mistake it by Las Ramblas, which is noisy, crowded and dangerous). From the hotel you can walk to the the historic center, a nice walking , take a bus or metro. There are bus stops and a metro station (Diagonal) a block away. Hop on hop off buses also have their stops a block from the hotel. The hotel is a block from Paseig del Gracia which is a beautiful avenue, with its high-end stores and nice bars. You are a block from La Pedrera ( Casa Mila) and a few blocks from Casa Batlo, Gaudí´s wonderful buildings. 4- We didn´t try Restaurant Murmuri because somehow it didn´t attracted us, but in our way back to the hotel we always stopped at Terraza Bar Marfil for a few drinks and tapas ( a nice outside area on the avenue, good for watching the movement ). Good service. CONS: 1- The breakfast is far below reasonable. Few options, very poor buffet, terrible coffee. If you ask for anything cooked like a simple omelete you have to wait for a long time. The service is terrible, the staff here doesn´t speak English and it is not properly trained. They don´t clean the tables right after the customers leaving which leaves the general impression of a very dirty place. Sometimes the cups and cutlery are dirty. You get the feeling that the breakfast area doesn´t belong to the hotel and complaints are just ignored. That is the only point why I am giving this hotel a 4 stars instead of 5. However, right around the corner you have an excellent pastry called Mauri, where you may a have a very good breakfast. 2- Internet at 15 euros/day.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Peaceul retreat in the center of downtown”", "Author": "TheFoliage", "ReviewID": "UR118393658", "Content": "We selected this hotel for our honeymoon in Barcelona, and we were looking for two things: central location where we could get to everything, and a quiet, secluded room to escape. Murmuri blew us away on both counts, and threw in a couple of surprises as well! Our room had a balcony overlooking one of the main streets in the city. It was small, but perfect for sitting out with a drink and watching urban life from a 4th story perch. When we came inside and closed the balcony door, it felt as quiet and peaceful as a private getaway - not a sound from outside - it was amazing! Close the blackout curtains and you wouldn't even know that there was a city outside your window. Now that would have been plenty for me to write a glowing review - but Murmuri deserves exceptional recognition for going above and beyond. The room and all public areas were immaculately clean, the staff was always friendly and helpful, our room was cleaned every day no matter what time we left the room, and they surprised us with a complimentary bottle of champagne and a fruit plate our first night there to welcome us to their hotel and to the city. I do agree with some of the other reviews, that I was disappointed they did not offer free wi-fi. But that would be my only gripe. We were halfway across the world, in a foreign city that speaks two largely unfamiliar languages, and yet this hotel felt like home. After a long day exploring the nooks and crannies of beautiful Barcelona, I was always happy to see the great front door of Murmuri. I would recommend this hotel to anyone looking to be right in the thick of things, but who wants a place to escape when they need a break from the city and a good night's sleep.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Great location”", "Author": "booknerdEngland", "ReviewID": "UR118367891", "Content": "I stayed here recently with my daughter who was taking a break from interrailing around Europe. We had a classic/standard twin room with beds touching. The room was indeed v small and at the back of the hotel overlooking roofs, a basketball court and residential properties. So, not a great view, but surprisingly quiet, even with the window open. There was a flat screen TV which appeared to show only Spanish progs (mainly football), but not an issue with us. The furnishings were stylish and clean, but the black furniture was beginning to look a little worn. Disappointingly we only had a shower, but this was probably because we had booked one of the cheaper rooms at Euros 165 per night through hotels.com. The shower cubicle itself was enormous, but its design meant that, instead of water draining through a plug hole, it dripped over the edges and stained the floor of the cubicle. Otherwise, the room and bathroom were v clean and the chambermaids did a good job considering the debris left around the room from my daughter's backpack. (Sorry!) Housekeeping also collected and returned her trousers promptly for cleaning (at Euros 11). The location and stylishness of the hotel are its best bits. It's an easy taxi-ride from the airport at about Euros 27, but also within a stone's throw of the fast, efficient, clean Metro. Along the median running through the boulevard outside (La Rambla de Catalunya) is a succession of restaurants. We tried the recommended Cerveceria Catalanya on the first eve for good tapas, but surly service from a Rowan Atkinson lookalike waiter. El Fornet, just down from the hotel towards Placa de Catalunya, has lovely pastries for breakfast. Also good for dinner was Meson Cinco Jotas nearer the hotel and on the opposite side of the road. We did not try any meals in the hotel itself as it seemed prohibitively expensive and I preferred Spanish food to Asian fusion. But we did treat ourselves to cocktails, which were excellent but dear (Euros 11 for a Martini) and we ended up paying extra for nibbles, which seems a bit mean. We visited Casa Battlo, which is v close, and Parc Guell, which isn't. (Tip: go by Metro; it's a long way on the No.24 bus, although you do get closer to the top). On a wet day, we went to the Picasso Museum to find an enormous queue at 5.00pm. So, even if we'd bothered to stand in line, the museum itself would have been packed. Overall, it was an enjoyable, if expensive trip. Free wi-fi in the hotel would have been so useful for my daughter checking reservations, etc, for her onward journey. The staff were generally most helpful, esp when we wanted to leave our luggage before checking-in and after checking-out. A good hotel if money is no object or for an occasional splurge.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Best Boutique Hotel in Barcelona!”", "Author": "anita b", "ReviewID": "UR118317052", "Content": "We spent 6 nights in Barcelona and this hotel was one of the highlights of the trip. Roberto and Regina and all of the staff were always smiling and accommodating. The room was beautiful, spacious and sparkly clean! Can't wait to go back!!!!!", "Date": "September 19, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Up graded”", "Author": "K E", "ReviewID": "UR118258492", "Content": "My husband and I where staying in Barcelona for one night only. We booked a room at Hotel Inglaterra as we'd stayed there before (excellent hotel). On arrival in Barcelona I was contacted by Inglaterra and informed of a double booking. To compensate us for this mistake we were offered an 'up-grade' to their sister 'Boutique' Hotel Murmuri. Our room in Murmuri was smaller then in Inglaterra, it may have had mood lighting and extra (pointless) fancy pillows, ridiculously low hanging chandeliers and all the bells and whistles one might expect form a 'Boutique' Hotel but I almost felt uncomfortable staying there. The Murmuri bar and local restaurant prices are extortionate. It's a fancy area but if money is an issue, stay at the other end of Plaza de Cataluña. On the plus side the staff where very helpful and friendly.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Very good hotel but missing things from my luggage”", "Author": "ClaraPeter", "ReviewID": "UR118240945", "Content": "I had a very pleasant stay at this hotel. Comfortable beds and room. When I came home 3 pieces of my clothes were missing! I have a very bad feeling about this.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wonderful Stay.”", "Author": "Angela L", "ReviewID": "UR118227811", "Content": "My husband and I have just returned from a four night stay at the Hotel Murmuri. We really enjoyed our stay, the room was elegantly designed, the bed was fantastically comfortable and the level of cleanliness impeccable (all bed linen and towels were changed every day). The air conditioning was great and the lighting could be dimmed which was very relaxing at the end of a busy touristy day. The breakfast was delicious and the waitresses were charming. All the staff were helpful, good humoured and prompt to respond to any requests. It was the combination of their friendliness and professionalism that set the hotel apart from other hotels we have stayed at. We felt very welcome and would love to return one day.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Tranquil, Elegant and Well-Located”", "Author": "Di_bigapple", "ReviewID": "UR118122636", "Content": "We just got back from 4 days in Barcelona and we were extremely pleased with our stay at Hotel Murmuri. The location is perfect and in the nicest neighborhood in Barcelona. Hotel is boutique size, next to a metro stop, 20 minute walk to the Gothic quarter, lots of great restaurants nearby, very safe and elegant area, with the best of Modernist architecture all around you. Staff was very helpful. We had a superior room, which is very quiet; rooms are well-equipped and nice size, as are the bathrooms. The lighting in the room is also very well done with multiple settings for various needs. Rooms have flat screen tvs, ipod dock/clock, ample closet space, a safe and a mini bar.The hotel restaurant is lovely, with a good menu of Asian fusion dishes and fair prices. The only disappointment was that the hotel does not have free WIFI. I also got a good deal by reserving through Tablet Hotels. I highly recommend this hotel.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Altos Hills, California", "Title": "“Sieze any opportunity to stay here.”", "Author": "Richard B", "ReviewID": "UR118068915", "Content": "My wife likes a large space to spread out her makeup and I originally booked the 2 bedroom apartment so we would have two bathrooms. As luck would have it, the apartments air conditioner needed repair and the hotel notified us it wouldn't be ready. Some might argue this was a reason why it was good we used a travel agent. I won't use a travel agent next time but deal directly with the hotel (www.murmuri.com). Their site shows availability and rates that we had to point out to our travel agent, and from our experience with the staff, I have complete faith that we wouldn't have arrived to any unpleasant surprise. We wound up in the one bedroom apartment Romea. It is fabulously spacious and has a guest toilet. It also has a combination washer/drier and a nespresso machine. It is noisy at night until you realize that there are electric shutters which come down over the windows (HINT: point this out to the guests). The Murmuri is very conveniently located; 10 minute walk to Cinc Sentits (as wonderful for food as the Murmuri is for lodging - we had lunch the 1st day here) and the Hoffman (we had an excellent dinner the following night), 5 minute walk to Mary's Market (Valencia) and Cerveceria Catalana (Mallorca), and a 2 minute walk to the Metro line 3 There is a connection from various metro lines to line 3 at Passage de Garcia. It is a very long walk. WIFI from the Murmuri is expensive. Buy a microsim card around the corner on Provenca from orange. (Before leaving get a microsim to sim holder if you need one.) 3.5 Euros for 24 hours or 35 Euros for a month. Next time I won't try to buy sim cards in the states (Happy worked for voice not data), I will bring a small packet of laundry soap, I might bring a stick of nespresso although there store is very close at Gracia and Valencia and I will deal directly with TraficoBCN@aerocity.com for transfers between the hotel and airport. I also will pay very close attention to the type of plane and might adjust the visit around availability. The Airbus 320 1st class from SFO to PHL was good in terms of comfort, food, and service; the 330-200 Envoy class from PHL to BCN was luxurious in terms of comfort, food, and service; whatever Airbus we had from BCN to PHL was mediocre in terms of comfort and horrid in food; the 321 from PHL to SFO was at best fair in comfort but fair in food.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Excellent boutique hotel in a great part of town”", "Author": "LATraveler90046", "ReviewID": "UR117885489", "Content": "If you're considering the MurMuri, book it and feel good about it. The hotel and rooms are well appointed, and the staff is overall very friendly. The hotel is in a great part of town, close enough to great shopping, architecture, very central to plenty of restaurants. It's close to one of the Red Barcelona City Tour Bus stops (highly recommended, too). But, it feels just slightly removed from some of the hustle and bustle, although there's plenty going on nearby.. Perfect choice. Downside- no pool, and no free wifi (can pay, but it's pricey). Can use pool at nearby Majestic, and go to the Starbucks around the corner for 45 free minutes of wifi. Also, the Boca Grande restaurant around the corner looks great!", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "BVI", "Title": "“Great location and design but wifi was a ripoff”", "Author": "dovebvi", "ReviewID": "UR117805199", "Content": "My husband & I stayed in Hotel Murmuri at the end of August. Our room was small, but nicely designed. If we had stayed more than two nights I think space would have been an issue, but it worked okay for us. I was wishing that we had upgraded to a larger room and would probably suggest this to anyone else booking. The bathroom was fab and I loved the large shower. The hotel is in a great location- close to lots of restaurants and shopping but away from the really touristy areas. My main gripe was the RIDICULOUS charge for wifi- it came out to nine euros for 45 minutes (they actually add tax to the charge so that is the total). The hotel isn't cheap and any decent hotel that I have ever stayed in in that price range has offered free wifi. We stayed at the gorgeous Viceroy in Miami a week later and not only did we get free wifi, but our room was three times the size and about two thirds of the price of the Murmuri. I think that it is tacky for a hotel of this standard to charge such a rate for wifi. One of the restaurants we went into for lunch had free wifi so why on earth wouldn't a 200 euro a night hotel offer it? It makes it very clear that they aren't attracting business oriented clinetele. I also have to agree with another reviewer about being pushed to do the tacky bus tours around the city. I think the front desk staff must be on comission because we got a 10 minute spiel about the bus tour and were really pressured to book a two day tour! I would imagine that most of the clientele that stays in this gorgeous boutiqe hotel would be too sophisticated to be interested, it seemed quite unusual. To sum up I would say that the hotel is beautiful and well located, maybe the management should just re-examine some of the smaller details that takes away from this truly being the high end boutique hotel that it should be.", "Date": "September 7, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Stayed in Two Bedroom Murmuri Residence Apartments - Very Nice”", "Author": "ensco3", "ReviewID": "UR117582213", "Content": "We stayed for two nights in the suites that are part of the Murmuri (they are about 50 meters down the laneway adjacent to the hotel. Very nice, with a lovely patio. Would have got a 5 star from us but for some odd service issues (only two towels provided for a group of six, long wait when we requested more, kitchen was missing basic items eg tea towels, dishwasher soap etc). Would consider again, as hotel was clean/beautiful, and very central.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ridgewood, New Jersey", "Title": "“Very nice hotel”", "Author": "Peter S", "ReviewID": "UR117361244", "Content": "Our family had two rooms and totally enjoyed our stay at this hotel. The location was great - our rooms were very clean and comfortable. The staff was very helpful, knowledgeable and courteous. Definitely recommend this hotel!", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Indianapolis", "Title": "“A Lot to Like”", "Author": "HonkHonk", "ReviewID": "UR117327752", "Content": "The Murmuri Hotel is an excellent choice in the Rambla area of Barcelona. It is a small boutique on the far north end of Rambla de Catalunya, close to the action but in a much quieter area; a perfect location actually. Though I was there for business, I was impressed by all the shopping, dining, and nightlife around the hotel. My room was comfortable, reasonably large, clean, and well equipped with plenty of closet and drawer space, robes, slippers, safe (large enough for a laptop), minibar, hair dryer, toiletries, and other amenities you would expect a good hotel to provide. My room was on the fourth floor facing Rambla, but I was not disturbed by street noise. The room also had a cool little balcony with chairs. High points: * An iPod dock, which was convenient and could be used as a wake-up alarm. * The room had a fairly sophisticated lighting system that allowed several different settings for different moods and uses. * Wireless internet was no charge – at least for me. My colleagues were unable to find a complimentary connection. * The air conditioning was superb. I was able to get the room down to about 19C/66F. This is a particular concern for me in European hotels, where air conditioning often seems more like an after-thought and I end up sleeping poorly because of a hot, stuffy room. Downsides: * The bathroom had a variety of hair plastered to the sink, tub, etc. The tub had some grunge that was not very attractive. Otherwise, the room and common areas were clean and appeared well maintained. * My room rate did not include breakfast but given that my room rate was only 157€, I would not really expect it. However, there was no in-room coffee either and this was inconvenient in the mornings. Nevertheless, they did offer breakfast at 12€ if (I think) I agreed to buy it for each day of the stay. I declined, but this was a pretty good offer considering many hotels want as much as 30€ for breakfast. I was very pleased with the Murmuri and I definitely recommend it when in Barcelona for business or pleasure. Hope this helps. .", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Blagoveschensk", "Title": "“Elegance and Style”", "Author": "IreneBlag", "ReviewID": "UR117299776", "Content": "Style is the first association with Murmuri hotel. Every single detail corresponds to that: room design, decoration of the hall or pillows, breakfast service, even receptionists’ appearance and manners. We stayed in Romea – 2-bedroom apartment with 2 baths and fully-equipped kitchen including coffee-machine provided with coffee-capsules. The washing-machine was most convenient; Barcelona was the 2nd city on the trip, so our stuff needed washing. We were granted a gift voucher to enjoy their restaurant gastronomy with a 15% discount. Separate thanks are to Gaspar and Francisco who were most welcoming guys on the reception. Thank you all! Oh, the wooden floor in the shower was a special treat!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great location, comfortable acommodations.”", "Author": "southpasstiger", "ReviewID": "UR116866200", "Content": "Great location in the center of the city. Rooms were well-appointed. Staff was very helpful and courteous. Big fan.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "colorado", "Title": "“Lovely boutique hotel!!!!”", "Author": "beth06", "ReviewID": "UR116824401", "Content": "Our family had 2 rooms for one week and we thoroughly enjoyed it...one room was a bit smaller-2 beds for the kids, and the larger room with one bed. Both were very nicely appointed and quite comfortable. The location cannot be beat...beautiful cafes and restaurants all around and easy walking distance to most of the city. The concierge staff was great and recommended lots of great restaurants. We also did a fat tire bike tour of the city which was a highlight of our stay in Barcelona.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“A lovely boutique hotel in the center of Barcelona”", "Author": "RIPEPINEAPPLE", "ReviewID": "UR116632286", "Content": "I stayed a week here,on business, and didn't get tired of comfy little boutique hotel in the center of lively Barcelona. Great design, everything is in the right place,great bathroom with both bathtub and shower cabin . A lovely bar downstairs is open day&night, perfect breakfast with hamon and brut cava included. The location is ideal for shopping and sightseeing, but nothing like crowded and littered Rambla streets, all you can wish for to enjoy this grand city!", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Perfect Stay!”", "Author": "SMK77", "ReviewID": "UR116558805", "Content": "Spent two nights in their Deluxe Suite and I am coming back for more! Wonderful property, great interior design, fantastic front desk. Location is also very good and the additional facilities at their partner hotel come in handy. I am usually very loyal with Hyatt but as there is no Hyatt in Barcelona, I was looking for an luxury getaway in the city - and I found it. Highly recommended! Internet connection was the only minus - didn't like the slow connectivity by a third party provider which is charging 15 EUR a day.", "Date": "August 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Excellent Hotel, great location in the middle of everything you could wish to visit with excellent service”", "Author": "ForestFan1001", "ReviewID": "UR116434051", "Content": "Booked the Hotel for 2 nights in early August for a family visit to Barcelona. Everything about the Hotel was excellent; rooms, service, decor & staff. I have stayed in many Hotels around the world over many years & these are THE most comfortable beds, ever.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Truly wonderful stay”", "Author": "Dolldie", "ReviewID": "UR116342132", "Content": "We have just got home from a absolutely wonderful stay at the MurMuri. Beautiful hotel in a lovely location. The are was not as busy as some of the more central area's but it was such a plus that after fighting crowds at all the tourist attractions all day you could come home to a beautiful relaxed area. Great access to the Metro with Diagonal station practically outside the hotel door. The staff were so friendly and helpful. They helped us book tickets to go see an amazing Flamenco show and gave us great advice on planning days out. All the staff spoke beautiful english. We will definitely be back for another visit! My only slight criticism was that there was not any wi-fi available which was a bit inconvenient but not the end of the world.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Fabulous hotel - a must for a special weekend!”", "Author": "00_traveller_00", "ReviewID": "UR116314807", "Content": "Superb hotel and outstanding service from the friendly and knowledgable staff. We stayed in a superior room for 4 nights and was impressed at the quality for 115 euro a night. Location is great, as it is walkable to everywhere, but not too close to the booze crews of the Ramblas. The staff really know the city and recommend great locations for food, drink and sightseeing. The rooms are excellently appointed, with every detail considered. We didn't eat there, but enjoyed a drink in the comfortable and stylish bar. Use of the spa and rooftop pool at the sister hotel (Majestic) was a nice bonus. Murmuri really is a 5* experience.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Reading, Berkshire", "Title": "“A great central hotel, away from the Ramblas crowds”", "Author": "robcan88", "ReviewID": "UR116177924", "Content": "Away from the constant swell of people on the Ramblas south of Pla Catalunya this hotel is convenient placed close to metro Diagonal on the Rmbla de Catalunya (~10 mins walk). Very convenientty placed for the Manzana de Discordia, Casa Batló, La Pedrera, Sagarda Familia, Tapiés museum, and also the less well known but highly recommended Fundacio Godia (Carrer Disputacio). Francesco on the front desk was very helpful and knowledgable; if you require suggestions for things to do he is your man. Rooms are large and comfortable and bathrooms are well designed, clean, and showers have a good strong jet. We ate in the restaturant ajoining the hotel one evening and were pleasantly suprised by the food quality. All in all a very enjoyable stay.", "Date": "August 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Service is fantastic”", "Author": "vindoc2000", "ReviewID": "UR116127198", "Content": "Stayed for a day. Boutique hotel in a very upmarket street. Great bar and the rooms were very comfy with clean showers. Step out of the hotel and there are restaurants everywhere. The service deserves a special mention. They were efficient and fantastic. Go for it.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great Self-Catering Apartment”", "Author": "Toute_le_Monde", "ReviewID": "UR115780204", "Content": "We stayed in one of the apartments as a family of four for two nights. Terrific. Really worked for us. Had two bedrooms (queen and two singles) plus dining area, sitting room, kitchen (with laundry) and a great balcony. The apartment was spacious, clean and chic. Intranet was an additional cost . Service and staff were great. The location is great. It is a relatively long walk to the Rambla and Barri Gotic, but the walk is doable. The trade-off for the long walk to the very touristy areas is that you are not staying in the very touristy areas. You are staying in the well-to-do boutique area. It worked for us. We would definitely stay at the Murmuri again. First rate boutique hotel.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Lovely boutique hotel, clean chic and excellent location”", "Author": "Shellfisk", "ReviewID": "UR115715122", "Content": "Location:on rambla catalunya surrounded by shops and restaurants and cafes (go for taller the tapas, a 5 min walk from the hotel) Room: clean chic in black and white. If u booked a privileged room make sure u get a king size bed instead of two single beds. Bad amenities causing allergies, unfortunately Molton brown seemed to be a victim of cost cutting. Bar:friendly but slow service,rather expensive compared to other bars in the area Service/front desk:ask Francesco for a restaurant recommendation if u are looking for seafood or Catalan cuisine.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“One of the best hotels I've stayed in”", "Author": "DinahTravels", "ReviewID": "UR115610305", "Content": "We were SO pleased with this hotel. Simple, modern design focused on comfort in probably the best location of the city. The staff were incredibly helpful organizing reservations, assisting with parking and generally making our stay as easy and comfortable as possible. If you stay, be sure to visit Mauri, which is a few doors away, for the set lunch menu and delicious pastries. Thanks Murmuri!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic Hotel in Great Location!”", "Author": "Jules1277", "ReviewID": "UR115323531", "Content": "We recently stayed at the Murmuri for a Company celebration trip for 19 people... the group had a fantastic time and some have even rebooked to come back to the Murmuri later this year... Hotel staff and general ambience, along with beautiful rooms helped make the trip a very special one... the food and drinks were fantastic and we would highly recommend that if travelling to Barcelona you book a room at the Murmuri. The location is perfect - stepping right outside to all the beautiful shops and restaurants...", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location, nice people, great design”", "Author": "Rodolphe", "ReviewID": "UR115144430", "Content": "Great design hotel in the heart of shopping and business district, 15 walk to Gothic Quarter and very near to public transportation. Great young staff, very helpful, Manager Maria does a really good job", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“PERFECT BOUTIQUE HOTEL&GREAT LOCATION”", "Author": "CozSydney", "ReviewID": "UR114972710", "Content": "Absolutely couldn't fault anything about this hotel. Loved the location as it was in a quieter part of town with some FANTASTIC restaurants close by. The staff were really helpful with restaurant recommendations including Cerveseria Catalina which is about 5min walk from the hotel. (we ate here 3 times in four days!) The rooms were extremely generous in size, immaculate, great furniture, big bathroom, loved everything about the room!!! Loved this hotel and would highly recommend staying here to anyone!", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Lovely Boutique Hotel”", "Author": "kvrn84", "ReviewID": "UR114935963", "Content": "Beautiful hotel in the heart of the Ramblas Catalunya and walking distance from Paseo de Gracia, which is a street over, and the Ramblas. Casa Mila is actually like a two minute walk from the hotel and so is the most expensive street in Spain. Moving on to the hotel, the entrance is lovely with soft colors and modern art. We stayed in a junior suite, which was beautiful, but small. I expected that considering that is the middle of the city. The bed was so soft and heavenly, the only complain is that the King bed is actually two twin bed put together so whenever we moved the beds would move apart since they had wheels. The bathroom was nice, but the shower had half a glass wall with no door to close so when I showered the floor would always get wet and the tub had no friction so I almost slip every time. The staff was very friendly and helpful, no complains there. Even though we were in the middle of a busy street we did not hear any noise during the day or night. We had a balcony, but the view was of the back alley and not that great so if I stay there again I would not get a balcony again is not really worth it. Our stay included breakfast; which was ok, but it was better than spending money every morning somewhere outside because the expenses adds up. Overall, great stay and would stay there again in a heartbeat; I definitely recommend it to everyone.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Chic hotel in a great neighborhood”", "Author": "paige_davis24", "ReviewID": "UR114618505", "Content": "The Murmuri is a fabulous little hotel situated in a great part of Barcelona - just steps from La Pedrera, Casa Batllo and other spots, and an easy walk down to La Rambla (metro is very accessible as well). Our room had a spacious balcony which we enjoyed after walking around all day. The bed was beyond comfortable, and the bathroom was spacious and sleek. We didn't have much room for our suitcases, although there were 2 small wardrobes for hanging and storing clothes. While we loved the nice touch of a bottle of cava upon arrival, we were disappointed in the lack of professionalism displayed by the staff. It's almost as if it were a hotel run by very fashion forward and cool teenagers. They lack the experience that you expect from a 4* hotel (They walked into our room despite the \"do not disturb sign\", randomly came in to \"check the mini bar\", forgot to call us a taxi for the airport....) I was also surprised to see that most of the staff doesn't speak Spanish (at least as a first language). My husband is from Argentina and I speak fluently, so it was unsettling to have to speak English to the front desk/reception staff. Every time we walked through the lobby it seemed there was another staff member there. Not very consistent. Pros: -Location, room, restaurant (really delicious), design, amenities - guests can use the spa and pool at the Majestic (a 3 block walk) Cons: -Wifi is not free, staff needs better training, nice sun terrace but no pool. Overall I would recommend this hotel and I would return, but with hopes that the staff are trained adequately by then and that maybe they realize if you're going to pay several hundreds of Euros for your stay that wifi should be free!", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great value”", "Author": "Stew7601", "ReviewID": "UR114327744", "Content": "We don't normally stay in these kind of \"chic\" hotels, but we got a GREAT deal on their web site (540 EUR for four nights) if you purchased in advance, and we were not disappointed. The service at the front desk is exceptional. All speak very good English, are happy to help with recommendations and reservations. Our room seemed small (other reviews indicate there are much larger ones) but well deigned. Loved the bathroom. And it's a very good, central location for seeing the city. You will not be disappointed. P.S.: No need to buy their expensive breakfast, there are 2 great bakeries around the corner for a quick croissant or brioche.", "Date": "June 19, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sydney", "Title": "“Ideal appartment in a wonderful city”", "Author": "TravellerSydney6", "ReviewID": "UR114297109", "Content": "We stayed for a week in the wonderful 2 bed apartment attached to the Hotel. Location is great and the set up of the apartment ideal for a family with 3 teenage children. The apartment is very well equipped and well located for touring and shopping. Great street with lots of activity and things to see. We loved Barcelona, and would go back to Murmuri.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely little boutique hotel”", "Author": "khm007", "ReviewID": "UR113791163", "Content": "We chose this hotel for a romantic couple of days away from the kids! It was lovely and the hotel personnel were all very pleasant and helpful. The breakfast was fair, the restaurant served goods food and the bar was very relaxing.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“LOVED IT.”", "Author": "10aldridge", "ReviewID": "UR112965388", "Content": "I pride myself on doing hours of research prior to our travels. My hours will hopefully pay off for you if we have anything in common and you are very picky. First i don't burn money but i have great taste. I must have certain amenities in a hotel. This one had them all. Murmuri is a best bet and after my trip i am certain of it now. First of all i reviewed all of the neighborhoods and chose L Eixample for location. it was very convenient to food, metro, shopping. While we do not spend too much time in the hotel, i need the luxury. The bed was great, sheets were amazing, pillows perfect. Staff friendly. Quiet on the fourth floor. CLEAN. Great bathroom, great mirror in the bathroom and clean towels daily of course. Turn down service in the room was nice as was the lighting. all in all the room was a ten for the price. Location was a ten as well. it is within a short distance to Casa Mila and all of the upscale retails stores. Great little pastry shop to the right and down the next side street. We had coffee and pastires there every day. Maudi is ok but this was better. We took the Metro to Familia and La Ramba. Easy to get on and off but we did do the tour bus the first day to make our way around the city. Nice to recover from your travel by sitting up top and getting the lay of the city. Not necessary but it helped. We skipped food in LaRamblas and was glad after taking the better advice of the locals. Within walking distance is the Catalana restaurant -by far the best tapas in the city ...you must try the Cabreaos. Try all of their desserts especially the Catalonian Cream. We ate there three times and had completely different meals on every occassion. Sangria is great too as is their local beer Estrella. This too is a short walk from the hotel. The Majestic was rated high on the list in Trip Advisor and is located a few blocks down. I didn't like the big scale of it and the Murmuri is actually owned by the same company...so for a boutique experience and smaller size, this was for me the best. I saw the locations of many of the Trip Advisor options and still would book this site over any that i saw. The photos on the web site are accurate and we had a Superior Room. The LaRambla tended to be a big disney like stroll with hundreds of people which at night would be nothing but noise if you are trying to sleep. If sleep is not an option you are reading the wrong review and you will find many options for less money and more noise. The Murmuri has a sexy bar attached and an upscale restaurant attached. We did not typically eat past nine and this restaurant didn't open till 8. We didn't opt since we had other options. We hit the high spots of the city and glad we checked out Parc Guell with its beautiful gardens. We took a cab since the walk was straight up. Only about 5 euros. We also went up the Columbus column again great views worth it. We did Montjuic via the tour bus and got off for some Sangria at the first stop to catch the view. The Picasso museum did not have his full collection but seeing his first works was very enlightening. Don't go on free days line is crazy. Gaudi's Casa Mila was great doing the tour to the roof. The Familia was sufficient just doing the exterior. The lines were hours long. We took a half day trip to Montserrat and it too was worth the trip. We took the train about an hour out of the city and it stops right at the base of the mountain. Take the cable car to the top. We skipped the three hour line to see the Madonna and instead used our camera zoom to view the small statue from the sanctuary. You can check the weather from a webcam online before you go. If you only have a few days in the city, stick to the old parts of the city if you have not traveled to Rome or Paris. It will be enough to keep you intrigued. When you are leaving, don't forget to appreciate the beautifully designed air terminal. It was an architectural high. The only other mention would be our travel time was in June and the weather was great with no humidity. Trip Advisor comments have always paid off for me so i hope this helps you. This is not Rome but cleaner and you don't have to pay to pee. This is not Paris but the waiters are not snobs and they don't pee on the street. We loved the city, the people, the music, the tapas and sangria at Catalana. Adeu.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good hotel, Great location”", "Author": "saintlouisan", "ReviewID": "UR112639768", "Content": "We stayed for three nights before leaving on a cruise. The room was clean, reasonably large, with nine foot ceilings and a small balcony overlooking the street. Big, newer bathroom with good water pressure. Good linens and towels. Minibar (expensive) but no coffee maker. Flat screen TV, good closet space. Breakfast buffet was so-so, but no worse than many other European hotels. Location is right on the northern extension of La Rambla with many nice shops and eateries nearby. Big Metro station half a block away.", "Date": "June 10, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Seattle", "Title": "“We loved it and we'll be back!”", "Author": "barcel0nal0ver", "ReviewID": "UR112233410", "Content": "The rooms in the front on the 2nd floor are the roomiest and nicest. The rooms on the 6th floor are much smaller although they have a nice sun deck. Francisco and Roberto at the reception area were fantastic and extremely helpful. I can say enough about Hotel MurMuri.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Crawley, United Kingdom", "Title": "“great place”", "Author": "grahame261", "ReviewID": "UR112193715", "Content": "we stayed here one night before our cruise fantastic hotel from the minute we arrived porter was great reception reception staff very good and our room was first class only one down side room service was hopeless other than that i would recomend to everyone", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great location, modern design, wonderful staff!”", "Author": "dhlipson", "ReviewID": "UR110974138", "Content": "Just returned from a three day stay in Barcelona. It was my first visit to Barcelona and I loved the city! Great shopping, arhcitecture, sights with both a cool city scene and a beach! The MurMuri is a modern boutique style hotel with a warm staff. Look for Francesco at the front desk -- a handsome, charming man who is always ready to help ake your stay more enjoyable. If you don't need a handicap room , make sure you let them know. Otherwise, the beds are super comfy and the bathrooms are terrific. Love the shower! The location is perfect. On a charming street full of great shops and one block off the major (and busier) shopping street. One block away from the metro entrance and taxi stand. Can't wait to go back.", "Date": "June 1, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Saint Augustine", "Title": "“Delightful!”", "Author": "EastBeachBum", "ReviewID": "UR110802995", "Content": "We stayed two nights prior to a cruise. We arrived before check-in time, and the gentleman at the front desk couldn't have been more accommodating and nice. He took our luggage and when we arrived back at the hotel a few hours later, the luggage was already waiting for us in our room. The room was spacious (by European standards) and had a wonderful large terrace. The room was spotless and well designed, and the bed was very comfortable. The location was excellent, on the \"quiet end\" of Las Ramblas (an extension thereof). The area was very pedestrian-friendly with plenty of restaurants and shops nearby.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Perfect base for a visit to the sights of Barcelona”", "Author": "DavidSue35", "ReviewID": "UR110523653", "Content": "This was our base for a 5 day trip to Barcelona - our first - and we couldn't have wished for a better one. From beginning to end the staff were very helpful and kind. The restaurant attached provided a great breakfast (tip - get a rate that includes breakfast) and we had a coupple of very good evening meals there too. The hotel rooms are about what you'd expect for the price, but very comfortable and quiet. It's some way from the Ramblas - and if you want to spend the evening there and roll back into the hotel in the early hours then this probably isn't for you, but if you want somewhere that's an oasis to get back to after a days sightseeing then go for the Murmuri! Very convenient for the Barcelona metro - which we found easy to use - and a short stroll from some of the very best Gaudi houses, and some great shopping! Highly recommended.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "4.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Highly disappointed about the long waiting time for a simply food order..”", "Author": "m0nika77", "ReviewID": "UR110498559", "Content": "Because of the positive hype, the highly recommendations done by friends of mine, I have tried by the last Friday the bar at the ground floor. Have to say that this is a really charming hotel,located in the heart of Barcelona with a lot of character... Even more higher was my disappointment and frustration as I been waiting really long time to get served a simple food order,rice noodles as main and chilled strawberry as desert. I would come back but just because of the friendly and helpful staff in the bar lounge which make my stay highly comfortable. Can not get it in my minds how a high quality product can provide that bad service even though the order has been made out of the busy time, by aprox.11pm. Hope deeply that you can work on it...", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Excellent Hotel, In the Heart of it All”", "Author": "POSitiveBrett", "ReviewID": "UR108996759", "Content": "Excellent boutique hotel located in the heart of everything that is Barcelona. Within a short walk of several great Gaudí sites, including La Pedrera and Sagrada Familia, and Plaça Catalunya. We also walked down to La Rambla, which was well worth the extra distance, though Rambla Catalunya was just as nice, and less busy. The hotel is very modern with a fantastic bar and restaurant (they also extend the bar out onto the Rambla in front, which is really nice for people watching). We were very impressed with the staff, and the service we received... they had taxis scheduled and waiting when we needed, and were helpful in every way. Highly recommended.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, Brazil", "Title": "“Great Choice”", "Author": "MLAMJMB", "ReviewID": "UR108135315", "Content": "Fantastically located boutique hotel in the midst of what Barcelona offers best - historical sites, cultural centers, restaurants and shopping. Along the Rambla de Catalunya in easy walking distance from everything that counts. Modern, very well-decorated, comfortable, clean and willing-to-help staff. Breakfast very good. Highly recommended", "Date": "May 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Best of Barcelona!”", "Author": "cooks2", "ReviewID": "UR103523405", "Content": "We just came from a great hotel in Madrid and yes the Murmuri topped even that. The manager Maria made sure as did her staff that every detail was attended too. We had the time of our life with the help of Roberto and the entire staff. Newspapers to cream for our coffee and salt needed to fix our son and his roommate dinner, getting us what we couldn't find was a pleasure not an imposition. Our son was studying in Barcelona and they thoughtfully suggested staying at the apt. that is part of the hotel instead of our reserved room. How great was that, what a great place it was. Thank you to all the staff for making our trip truly a great one.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Hotel”", "Author": "NYdodger31", "ReviewID": "UR103162624", "Content": "This hotel has an excellent location, staff, and price for what it offers. It was extremely comfortable stay with everyone at the hotel extremely helpful to my wife and I. The room was not large by any standards, but very comfortable with a spectacular balcony and view of the city. So close to everything I would def go back!", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Warwick", "Title": "“Great location, great room and fantastic coffee!”", "Author": "WarwickLeamingtonian", "ReviewID": "UR102041951", "Content": "Booked through Expedia with flights by BA. It all went well until I had my wallet stolen in The Rambles. Please be aware, the pick pockets are about. Anyway, the hotel staff were lovely and nothing was too much trouble. The room, on the front of the building, was a little noisy but you soon got used to it. We had an upgrade to a superior room and it was clean, well equipped and the bed was fantastic...really big and comfortable. If there is a criticism, there should be coffee making facilities in the rooms, it would make the mornings so much more enjoyable! We used a lot of restaurants and coffee houses up and down the street but no one could beat the Murmuri for quality and temperature. I would definitely recommend this hotel, almost faultless!", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fond du Lac, Wisconsin", "Title": "“Murmuri is a perfect hotel in Barcelona”", "Author": "TerryG49", "ReviewID": "UR101558687", "Content": "Murmuri is a delightful boutique hotel, decidedly upscale, and in a great neighborhood. On the Rambla Catalunya, it is only a block from the Gaudi Mila building and about 4 blocks from the Gaudi Battlo. We walked to Sagrada Familia, and all along Las Ramblas into the old section of Barcelona. But, Murmuri is in Eixample, where the streets are wide and buildings just gorgeous. The subway is half a block away, and the No. 24 bus (to Parc Guell) is only a block away, so the location is very convenient. We initially booked a smaller \"design\" room but upgraded to a superior room with a balcony overlooking La Rambla Catalunya for not a huge amount more. That was a real treat. The room was large enough, though not huge, but nicely appointed and furnished, with a very large extremely comfortable bed (2 twins together) with lots of comfortable pillows. We loved the balcony--great place to have a glass of wine and watch the strollers on La Rambla. The bathroom was huge, and very nice, with large tub with shower in it, towel heater, thick, large plush towels, robe, slippers, nice toiletries, and openable window. The flat screen gave us ready access to English-speaking news channels. We used the room safe which was very easy to operate (with English instructions.) Plenty of closet space. The staff was very courteous and solicitous-extremely helpful. We wanted ice-they brought it. A wine bottle open-they opened it. The glass elevator and sleek modern interior were neat features. The building itself is very attractive. We didn't use the bar or restaurant, as we ate in neighborhood places while out touring. But both looked inviting. The hotel was quiet, had turn-down service, and made one feel pampered and taken care of. I would highly recommend the Murmuri, and would absolutely stay there again if we return to Barcelona. It is a 4-star hotel, but is a very \"high\" 4-star and probably at least four-and-a-half. The room rates were certainly reasonable for what one got.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, Ohio and Kaua'i", "Title": "“Great location, charming hotel”", "Author": "Last1", "ReviewID": "UR101270682", "Content": "Murmuri was a perfect spot to see the architectural beauty of Barcelona. A small boutique hotel, very stylish, nice room, though quite small as is the case in many European hotels, great bed and pillows. Excellent Thai-Catalan restaurant, I know it sounds weird but it was outstanding. Nice bar, great place to walk, right near the Passage de Gracia.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Great location, staff, and room made a great hotel”", "Author": "SammySafarini", "ReviewID": "UR101011847", "Content": "I stayed for 3 nights this past weekend at Murmuri hotel, a boutique hotel with lots of character in a very convenient location in Barcelona. It offered me a delicate mix of privacy and personalization. The staff were very helpful and friendly. Very comfortable bed and well-chosen amenities. The restaurant and bar at the ground floor kept busy around the clock. The experience I got at this hotel exceeded my previous four stays at other 4 and 5 star hotels in the city. I cannot think of a single item of improvement besides the fact that there were no laundry bag in the room. I look forward to coming back.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Lovely boutique hotel”", "Author": "shop4fun", "ReviewID": "UR96877659", "Content": "This hotel was in a very central location to many shops and restaurants. If you enjoy walking, you can get to all of the major attractions from here. We did. If you prefer other transportation, the hotel is close to the local subway and the train that will take you to other towns close to Barcelona. I loved the style of the room decor (very contemporary) and the views from our balcony. I'd definitely stay again. One downside was that the hotel did not have a business center, but we were able to use the internet of a sister hotel which was close by.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ubud, Indonesia", "Title": "“Hidden gem on the Ramblas Catalunya”", "Author": "deepsapphyr", "ReviewID": "UR93819028", "Content": "Stayed at the Murmuri during the summer of 2010, a beautiful historical building right off the Ramblas Catalunya, it does not get a lot better regarding location. The staff was excellent, made me feel very welcome, I had some goods send to the hotel prior to my arrival and staff looked after it excellent. The standard rooms were a bit too small for my liking and would advise to take a bigger one. They have a very nice bar and breakfast is excellent. You are within walking distance of the Ramblas and Plaza de Catalunya, one of the best chocolatiers of Catalunya is on the next corner and would advise anyone to have a breakfast/lunch there.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "glasgow", "Title": "“Just OK!”", "Author": "katrb", "ReviewID": "UR92913588", "Content": "We stayed from 7th January for 3 nights - the day we arrived was my birthday (which my husband had mentioned to the hotel on booking). Prior to booking I confirmed with the hotel that they would be able to provide a smoking room - especially with the smoking ban coming in on 1st January and we were told that this would not be a problem. On arrival I asked if it was a smoking room and was told no, that due to the smoking ban there wasn't smoking rooms! Well I would never have booked if that was the case my husband is a very heavy smoker and won't stay where he can't smoke. I explained that I confirmed this at the time and the receptionist said that no requests were guaranteed! Anyway she said she would speak with her manager so we went to the room on 3rd floor and were greeted with the smallest room ever. Nicely decorated but tiny and terrible view - not quite what we expected. We decided to go out but didn't unpack and on return the receptionist said she had spoke to her manager but we would need to pay for an upgrade to a smoking room - another £180 for the 3 nights! I refused and asked to check out where she said she would speak to her manager again. At this point we went back to the room and were coming to the conclusion that we would need to pay this so not to spoil the holiday and my birthday. A chap on the door and she had a new keys and a new room and we were moved to the 5th floor. Room wasn't much bigger and I would have been very disappointed if we would have paid the £180! At least though the holiday wasn't ruined. After that we did enjoy the hotel, bed was comfy and nice big television with english channels, we ordered room service as well which was nice. The hotel was very close to subway station and on a nice street. I do think though that we could have booked something just as good much cheaper as the hotel wasn't anything special.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Room Great Location”", "Author": "kiddy888", "ReviewID": "UR92424982", "Content": "My fiancée and i stayed for two night's 7th / 8th Jan 2011. This hotel is fantastic for a city break all we needed to use it for was a bed of a night and somewhere close by that we could get showered and changed before we head off for a night out. It fitted the bill perfectly and the fact that it is fitted out so nicely , the modern decor works really well and you feel like you are in a much more expensive hotel than 125 euro a night which was the deal we got. The rooms are a little small but they were so well finished and had a really good bathroom with huge shower we didnt need anything more. We have stayed in 5 - 7* hotels all around the world and i couldnt fault the hotel for what we needed. The front desk were helpful and attentive during our stay and also prompt to reply via email when i had asked questions ahead of our arrival. The location i good as well you have a great street to walk down safely into the heart of Barcelona right outside the door or you have a taxi stand 20 meters to the right of the hotel. You are close enough to the husstle and bustle but its quite iof you want a drink in an outside bar without having people walking past all the time. Cabs from the airport cost 27 euros so it was easy to get to and from the airport. We did not eat in the hotel as we found so many great places to eat around town. We will deffinatly go back to barcelona and there is no reason not to stay again at Murmuri.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Really disappointed”", "Author": "Flurry2011", "ReviewID": "UR91243197", "Content": "Yes a great location, but ... service is really poor- one and a half hours to deliver breakfast; no help with booking museum visit; poor knowledge of access to key monuments; had to pay for wi fi; no business centre to print documents; small rooms which are tired - dirty carpets and scratched fittings; awful lights which do not adjust; no tea or coffee or irons in rooms; reception staff really unfriendly and unhelpful. And i agree smoke smell comes through vents into non smoking rooms. Six nights in 2 \"privilege\" rooms and I have no idea what the privilege is! Odd \"gift\" left in room on new year's eve of \"love\" package including a body crayon and condom. This was an odd gift for a married couple traveling with daughters aged 8 and 13. The hotel looked so lovely on the Internet, I am very disappointed.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Mixed Feelings...”", "Author": "Happytravels74", "ReviewID": "UR91082070", "Content": "We spent five days of our honeymoon staying in one of the apartments (Romea) attached to the hotel and have mixed feelings about Hotel Murmuri. Good - the location is fabulous! There is a metro station just a few steps from the apartment door, lots of restaurants, shops and bars nearby and Murmuri's proximity to the major Gaudi attractions was excellent. The welcoming bottle of Cava and fruit platter for our honeymoon was also a lovely touch. The apartment itself was very well designed and an excellent size. It had a well designed bedroom, including a desk area and quite a lot of cupboard space, reasonable size bathroom with large shower, excellent lounge and kitchen area complete with dining table and a separate laundry with second toilet. It was lovely to come home after a busy day of sightseeing and be able to relax in our lounge room before heading out again. I must note that having access to a clothes washing machine and dryer was fabulous and saved us lots of time and / or money. Booking several months in advance and taking advantage of the long stay offer meant the apartment was extremely good value for money. Not so good - the reception staff were aloof and not very helpful at all. There are no maps or tourist related information in the rooms so it was just as well we were equipped with reliable guide books. The cleaning staff's attention to detail was also a little haphazard. For example, the room set up was different most days and some days they forgot to collect the rubbish and on one day they even left the large garbage bag with our rubbish and the rubbish from their cleaning in the middle of our apartment entrance way. The apartment was also not as described on the internet when we booked. We booked the one bedroom apartment with terrace however on arrival discovered that they do not have a one bedroom apartment with terrace. (It was still however a well appointed and spacious apartment however a terrace would have been a treat and as we booked this we were expecting it). The supplies in the kitchen were very limited so if you were wanting to cook you would be quite restricted with what you could make. Similarly given there was a laundry in the apartment I expected there would be an iron and iron board however not so. After waiting around an hour an iron and ironing board were delivered to our room however I would recommend that they update their iron as this was very old and fairly ineffectual. Also the apartments are located directly opposite a construction site so even with the roller shutters (excellent light block out) the construction noise was very loud. This started from 7.30am with lots of shouting and truck unloading followed by power tools starting at 8am. There was definitely no opportunity for a sleep in. Finally the other negative would be the cost of wifi. To access wifi you had to buy a card which was reasonably expensive, particularly when everywhere else we stayed had free wifi. So for location, the convenience of having more space in an apartment and the excellent price we received I would recommend Hotel Murmuri. I do however feel with just a few improvements the Murmuri could be so much better.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, NJ", "Title": "“Excellent Boutique Hotel - Great Location!”", "Author": "GigsNJ", "ReviewID": "UR89020101", "Content": "MurMuri is an all-around great hotel for a stay in Barcelona. The rooms are very nice with situational lighting, large bathrooms with robes and plenty of closet/shelf space. The restaurant has an excellent, reasonably-priced price-fix lunch (nice for day of arrival). They kept the kitchen open at 3:55 for us. The bar is a nice setting as well. The front desk was very accomodating with making reservations. Book early for the best deal!", "Date": "December 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "laurendavis", "Title": "“Cigarette Smoke & a Moldy Bathroom”", "Author": "laurendavis", "ReviewID": "UR88920331", "Content": "I did a lot of research for a hotel in Barcelona. And while there were several others that were less expensive and a bit closer to Plaça de Catalunya, I was smitten by the reviews of Murmuri so I booked it. I was very unhappy with my hotel choice and would not recommend it to others. Here's why: Pros: - Friendly staff - The privilege room is very large, there is a sitting room that we never used (it overlooked a basketball court) Cons: - The hotel has an onsite bar & restaurant directly off the lobby that allows smoking. They leave the doors to these establishments open and every time you walk in the hotel, if the bar & restaurant are open, you are hit in the face by smoke. - While we were on a non smoking floor, there was a ton of smoke coming through our vents. Maybe someone was smoking in their room? Although we complained more than once, nothing was done about it. My husband heard the front desk person say (as we were walking away), if someone wants to smoke in their room, what can I do? Also, they said they were fully booked and could not move us. - There was mold on the bathroom ceiling (quite a bit) - The bathroom ceiling was peeling - Our room overlooked a school's basketball court, which was mainly fine until that one day we tried to take an afternoon nap. - Okay location, but in hindsight, I'd rather be in the Old Town or no more than one block from Plaça de Catalunya - After our stay I sent them several emails about a bill question and also called and left a message for the manager - NONE of these were replied to. I really can't understand the positive hype for this hotel, I can imagine there are far better choices in Barcelona.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“Sophisticated hotel...tasteful decor.”", "Author": "Skier1400", "ReviewID": "UR88700269", "Content": "This was my first trip to Barcelona, and I was happy with my hotel choice. My room was small, but furnished very nicely with a beautiful bathroom. The only criticism I have is the price of Wifi. I think it was 7.50 euros for an hour or 15 euros for 24 hours. My room was reasonable...141 euros including tax. I would definitely go back.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Great location, nice hotel, customer service needs improvement”", "Author": "chachi07", "ReviewID": "UR87214828", "Content": "Recently stayed at the hotel for five nights. The hotel is in a great location, right on the upper Ramblas, and walking distance to many of the Barcelona sites. A subway station about one block away gives you great transit to other areas of the city. However, for a 4 star hotel, the customer service at the hotel needs improvement. I requested an iron and ironing board upon arrival and was told that they would bring one to the room. They called back a few minutes later indicating that none were available at the time as they only had one in the hotel and all the other ones were broken. It was late and I decided that I would ask again in the morning. The next day they assured me that they would locate one and bring it to the room. Three days later still no iron or board. I called the front desk again and complained and they offered me the laundry service at 9 euros per shirt (the full price). OK, this is a 4 star hotel with 53 rooms and only one functioning iron! An iron finally appeared in the room the last night we were there. If they want to be a four star hotel, they should have iron and boards in every room. Although this is a nice hotel, the whole issue with the iron and the lack of attention to the guests really tainted the overall experience.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South West", "Title": "“Excellent stay”", "Author": "UKTravel37", "ReviewID": "UR86244574", "Content": "The hotel is located in a great location very near to the main shopping streets. We travelled from the airport via the train (for 3 Euros each) and got off at the Passig de Gracia, and then walked the 5 minutes to the hotel. This hotel was one of the better hotels we have stayed in, especially considering it is in the very heart of the city. Rooms were clean, well equipped and looked attractive. Our room had no bath only a shower but the shower was large, gave a great flow and was refreshing. Our sleep was comfortable with no noise at night but our double bed was actually two single beds pushed together, this was the only disappointment during our stay. The hotel restaurant had a nice atmosphere and both the food and the services was very good. We would recommend you eat there at least once. Overall we would definitely stay here again, it is a good centrally located base and an excellent hotel.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood, Florida", "Title": "“The Perfect Barcelona Experience!”", "Author": "jgr0ve", "ReviewID": "UR86186880", "Content": "Stayed at the M for October and had a great time. Location was perfect-not too touristy, not far out- walking distance from everywhere. Stay in room 601. Quiet, large, great balcony overlooking the Ramblas. Staff was very helpful, providing plug when needed for electronics, reservations, etc. Room service was good. Very clean and modern. They have a great private car service, Mercedes, driver. Great way to explore. Ask for Felix the driver. We will be coming back again. Highly recommended.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“a pleasant location”", "Author": "Shi Hu", "ReviewID": "UR85657156", "Content": "We especially enjoyed the pleasant location of the hotel on Rambla Catalunya. Our room #602 was rather small and unimpressive but it did have a small patio with no view but the weather was great so we did sit outside briefly to relax and catch up on some reading. The beds and pillows were especially comfortable. We generally prefer small boutique hotels but the Murmuri was nothing very special. The staff was sufficient and the restaurant and bar were convenient but neither interesting nor charming. Charging extra for wifi is a big a rip-off! So, all in all, the Murmuri was adequate but I will definitely try another hotel on my next visit to Barcelona.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "athens, ohio", "Title": "“great location”", "Author": "luckylynn", "ReviewID": "UR85081339", "Content": "Murmuri has a wonderful location near all the best shopping and 'modernisme' buildings, north of the Ramblas, on the Ramblas de Catalunya a much quieter and nicer street to stay on, just off the Passaig de Gracia. The room we had was small, but very well appointed. The bath had a shower, no tub, but was very nice. We booked on Expedia a long time ago and got a great price, so did not mind the small room. The staff were very helpful and the restaurant was terrific. We ate breakfast each day on the corner at (may be spelling it wrong) Maurio's which was great, very local. This was walking distance from most sights and I would definitely stay again.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NASSAU", "Title": "“chic hotel in a great location”", "Author": "drnassaugal", "ReviewID": "UR84567239", "Content": "great boutique hotel... modern design in a great location for shoppers and easy access to the metro, underground and main thoroughfare..... Do wish at the rates that WIFI was included. or even if its for a limited time.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Hampshire", "Title": "“A Pokemon Boutique”", "Author": "MaxHants", "ReviewID": "UR84479182", "Content": "As the saying goes, Either style or comfort, and this one is definitely the former (if black marble and disproportionately large standing lamps, which seem to be the current fad among those designing these \"boutique\" disasters all over the world, is your kind of style) and NOT the latter. A Kelly Hoppen who designed this hotel, which she claims she is most proud of among her creations (oh please save me from staying in another one of them!) says (BA inflight magazine October 2010) that the two most important things about a hotel are the bed and the concierge service.... Kelly, let me tell you that a double bed in Murmuri's superior room is actually two singles pushed together and held together by nothing but gravity and any sort of cross-bed travel that you may decide to undertake for whatever reason is likely to get your bottom bang onto the cold floor between the two of them. Let me tell you also that there is no concierge in this hotel at all and the reception people are sleepier than Siberian bears in the middle of January. Rooms are tiny. Water from the (swanky, stylish, boutique and generally glamorous) tap trickles into the equally glorious sink with at such vertiginous speed that it takes only about half an hour to wet a toothbrush. The haute couture shower seemingly lacking a thermostatic valve flips between boiling and freezing at its own discretion quickly and without warning. And don't try to change the angle - it gets worse! I have sat on my shares of uncomfortable WC's but theirs beats them all by a mile and a half. Was told by the reception they were moving me to another room, got up early, packed my things in the morning, came down to discover they were not moving me. Asian restaurant is bad for lunch and dinner. No spa, gym or pool. Redeeming features: a lively bar with descent service and music, good jamon serrano for breakfast (although menu is short), clean and relatively quiet. So not all bad but definitely not my choice at the price.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Fabulous stay - highly recommend”", "Author": "ems066", "ReviewID": "UR82064010", "Content": "We also booked well in advance of our trip via the Internet and received a discount. Our room was fantastic (601) and we loved the large, private terrace. The hotel staff is quite welcoming and helpful, providing great dinner reservations and assisting with printing our boarding passes. The location on Rambla Catalunya was perfect for us - near the Gaudi houses and plenty of restaurants and shops - as we do not prefer the touristy hum of areas like La Rambla. Barelona is easily walkable, and the hotel was in a great \"strolling\" area. The metro system is very easy to use as well, and there is a stop near the hotel. I would also highly recommend taking the time to visit the terrace at the Hotel Majestic to enjoy a drink and the incredible view. Another highlight of our time in Barcelona was attending a guitar performance at the Palau Musica Catalana. There are concerts scheduled most evenings and it is a wonderful opportunity to enjoy great music and beautiful architecture. Believe the hype - this is a great choice when selecting a \"home base\" for you stay in Barcelona.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Luxurious boutique hotel - Exceeded expectations!”", "Author": "urbantraveller1", "ReviewID": "UR81139229", "Content": "I booked this hotel 4 months in advance and secured a deal for around 110 Euro per night, for a standard room - a very steep discount from the rack rate. The hotel decor was modern and airy for a relatively small building. The lift reminded me of the Apple Store in Tokyo - all glass and again very modern. The rooms were well appointed, they've definitely invested proper infrastructure with dimmer lights at the room entrance and next to both beds with options for 'sleep / tv / ambiance / bright'. There was a large flatscreen TV with ample choices (English and Spanish), 2 fullsize wardrobes, a small desk, oversized arm char (this could be eliminated which would offer more space). Beautiful marble washrooms with a large shower and invisible drain under the 'floating' marble flooring. I'm a fan of clever design and the bathroom was definitely impressive. Cleaning staff were not them most attentive and needed to be reminded to clean the room twice in a 4 night stay. This room is by no means large but it is well planned, comfortable and functional. Front desk staff were fabulous. The murmuri doesn't haev a pool but has use of the Majestic Hotel's pool around the corner, it's on a rooftop and would definitely pass for the backdrop of a fashion photo shoot, ample loungers and great cocktails poolside. Also check out the tapas restaurant Catalana which is just next to the MAC store down the street, it's fantastic and very reasonable. The hotel is in a great location for shopping, sightseeing and a short taxi down to the beach.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Swank Stay”", "Author": "JasonWG", "ReviewID": "UR80121276", "Content": "Trendy and modern hotel in a good location. We like staying up the Passieg de Gracia. Won't be preferred by most - it is a long walk to the Born district or Bari Gottic. But there is a great feel up here and this hotel is a funky little place to stay. It is not cheap for what you get, but the rooms are more than comfortable and a wonderful place to come back after a long day of touring. Lots of great cervecerias nearby (Tapac 24 and Cerveceria Catalonia are fabulous, Divinius is good as well). Thing with Barcelona is there are so many hotels it is more about getting a deal in the category of choice. Murmuri is a good bet if you get a competitive rate - but there are a lot of hotels that can match it. We've stayed in Barcelona 8 times and have only returned to the Arts hotel more than once. The rest we keep touring about to find new places.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Location -”", "Author": "ChateauLM", "ReviewID": "UR79560163", "Content": "The location of this hotel cannot be beat - convenient to all the sites and hot spots in Barcelona. Minutes to the Metro, great tapas bars and walking distance to many great tourist areas. The hotel is typically trendy boutique. The bar is lovely - drinks are pricey but good. The room was beautifully designed though very compact. Very limited space for luggage. The bathroom had great shower facilities though I was surprised at the mold on the ceiling. Great bed and quiet for sleeping. Only negative was the check in / check out service. The gentleman was not particularly pleasant and had no knowledge of the Visa Infinite Program or Preferred Hotels Membership benefits (despite the brochures in their lobby!). We did not get the upgraded room we were expecting at check-in nor the free WIFI. When I raised the gap in expectations they were not accomodating or interested in resolving. Given there are many amazing hotels in Barcelona I wouldn't rush back to this one in light of the service received. We also stayed at the ABaC while in Barcelona and there is simply no comparison when it comes to service - ABaC gets it and is a true 5 star.", "Date": "September 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "washington, D.C.", "Title": "“Location and style; good place to stay”", "Author": "jeanniedc", "ReviewID": "UR77282379", "Content": "We booked two rooms at the Murmuri before a cruise this July. There were several very good features of this hotel: 1) LOCATION - we loved this about it. Was only a block from a metro which we used a lot. Is in a very safe part of town on a pretty and fairly quiet street. 2) We had two separate rooms, but there was a door outside both that could be locked while our rooms were open. This was a nice feature when traveling with kids. 3) Rooms were nice with good lighting; slightly small, but ours had a little sitting area in the back which made it feel more spacious. 4) We booked a package that came with breakfast - very nice. 5) staff was very pleasant and helpful. 6) Hotel restaurant was excellent and not too crazy expensive. My only negative comment would be about the bathrooms. They were very large, but the use of space was not good. There were literally no hooks in our bathrooms, and the shower was huge but the fixtures were not well placed. Other than that, this is a great place to stay in Barcelona!!!", "Date": "August 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“A great hotel experience in the centre of Barcelona”", "Author": "Ozdu", "ReviewID": "UR77000889", "Content": "The Murmuri is very central to main attractions. It is a modern design hotel but with a warm, soothing feel to it very friendly & helpful staff great bar serving an excellent espresso martini and great fingerfood. Rooms are good and well appointed with modern design (but not the modern design that can make hotels dysfunctional). Breakfast is not included but the €16 is well spent is you are a breakfast person, otherwise grab one the english breakfasts for €4 at one of the cafés on paseo de gracia (where the hotel is located) - PS: the espresso's are good and included in the €16. Staff was very accommodating and provided solid restaurant recommendations, booked the restaurants and even called us on our int mobile phone to let us know which restaurants they're able to book for us! We spent out first night in room 604 - a great terrace but the room itself is just too small. So avoid the rooms with a large terrace as it goes at the expense of the room size. Next day they moved us to room 405 - same category buy more spacious and more closets as well. Balcony is smaller than 604 but it's there and big enough to lounge if you want to (and we did one morning).", "Date": "August 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Highly Recommended”", "Author": "brodmktg", "ReviewID": "UR76464362", "Content": "We just returned from a three night stay and greatly enjoyed Murmuri. (It had been recommended by a Barcelona-based relative of my wife's business associate.) For my wife and me, we booked online the spa package which included daily breakfast and a massage and hydrotherapy and the grander Hotel Majestic, a five-minute walk. For our teenagers, we booked room-only as they preferred to go out for breakfast at a nearby bakery. I concur with all the positive comments I had read before booking: outstanding location in the city, stylish/comfortable rooms, and so on. My one major quibble was that the front desk staff did not seem to have a handle on suggestions for restaurants for dinner. They were happy to book a table...but couldn't come up with great suggestions. Also, would've expected free WiFi. Bonus points: they were happy to keep several of our suitcases in storage for three days at no charge, while we travelled to Mallorca, before returning to Murmuri for our final night.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Just Perfect”", "Author": "rakibey", "ReviewID": "UR76167326", "Content": "We stayed at Murmuri in July over a weekend. There was nothing negative to say, only positive. Rooms are very nice and fresh. New feeling to it. Cool design of both the hotel in general and rooms, glass elevator etc. The staff was very friendly and spoke an excellent english, which is not seen so many places in Spain.. The area of the hotel is very nice, just next to the exclusive shopping street in Barcolona. A very good and safe area, in walking distance to La Rambla if anyone would wanna go there:-) In our opinion though, La Rambla is just a totally touristic place, the area of the hotel is exclusive and more calm. The hotel did not have a swimming pool, but had a 5 star sister hotel that we could go to and have a swim in their very small swimmingpool at the roof top. Very nice view from there though, so go and have a drink at this location. Go ahead and book this hotel without doubt.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“PERFECT BOUTIQUE HOTEL”", "Author": "kostas72", "ReviewID": "UR75264515", "Content": "We stayed at the murmuri for five nights in mid August. We had a great experience. The location is beautiful, the room was pretty and clean, service was excellent. Breakfast was very tasteful. The hotels restaurant had great delicius dishes (keep in mind that it is rather expensive) . In a few words \"the right hotel to stay in barcelona\". HOLA! Kostas and Eva Tzellos.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "paris", "Title": "“Excellent hotel, Excelent location, Great value”", "Author": "zipili", "ReviewID": "UR75244168", "Content": "We really enjoy our stay at the Murmuri. Le location is really great, the design cosy, elegant and this is really a 4 Star hotel. Personnel is nice . I recommend really that hotel for a short stay in Barcelona", "Date": "August 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“Boutique Hotel in a great location”", "Author": "sd28", "ReviewID": "UR74025049", "Content": "Hotel Murmuri has what you would expect in a boutique style hotel. Clean, spacious with efficient staff. Our room had a terrace that was beautiful. The hotel is conveniently situated close to all the major shopping areas and a nice walk to lots of major attractions and great restaurants. It was also about a 20 minute walk to Sagrada Familia. The continental breakfast was perfect to start off the day. Staff is a little slow in the morning. Overall the hotel was everything we had expected and the weather was perfect in June!", "Date": "August 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai, India", "Title": "“Lovely hotel, superb location & connecting rooms!!”", "Author": "ajmita", "ReviewID": "UR73527864", "Content": "The Hotel Murmuri in Barcelona was the perfect place for our family of four to stay during our recent visit to Barcelona. Our children are ages 10 & 14 and need a separate room but I prefer it to connect to our room. I cannot tell you how few hotels offer connecting rooms! The Hotel Murmuri does offer connecting rooms that are at the end of a hallway, so you shut one main outside door and then can keep both room doors open. Very convenient for families with older children! We reached the Murmuri at around noon time but having been on a short cross Atlantic redeye flight, we were in desperate need of sleep. It was wonderful that our rooms were ready and that we could sink into the comfort of bed as soon as we arrived. Both our rooms were very comfortable. Our room had a large separate seating area while the children's room had a balcony. The children's room had a large wardrobe near the entrance, while our room had slightly less storage space. The desk in our room was directly at the foot of the bed making the room feel a bit smaller than it actually was. The front desk staff was extremely friendly and helpful. They were happy to help with reservations, tours, etc. As most reviewers have repeated, the location is superb, on a wonderful street and close to many of the landmarks of the city.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Armagh, United Kingdom", "Title": "“Fantastic Hotel”", "Author": "Wendy021065", "ReviewID": "UR72574270", "Content": "Thoroughly enjoyed my stay at this hotel. Hotel was modern and clean and staff were very helpful. Use of the sister hotel (Majestic) was a wonderful experience. Hotel Restaurant was beautiful..", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Perfect for a Barcelona Break”", "Author": "acdublin1980", "ReviewID": "UR72570076", "Content": "Murmuri is simply a great boutique hotel (usually the adjective 'boutique' makes me run a mile!) We stayed for three nights in a superior room which was a good size for a city hotel (but not big by any means). The king bed was FANTASTIC, the bathroom ultra modern and well kitted out. Everything in the hotel is chic and trendy but never poncey or uppity. Prices were very reasonable when booked a few weeks in advance and I couldn't recommend it more highly. The location is great if you want to be right on Rambla de Catalunya in the heart of Barcelona. The Metro station is literally 75 yards from the door, too. We did spend most of our time in the old town and we probably could have done with being a little closer to that than having to use the Metro to get there. Not a big deal though and Murmuri is at the centre of a lot of action. We were on the street side of the hotel and never heard any noise at night whatsoever. One last thing: As I always gripe about places who charge for Internet then it would be unfair not to gripe at Murmuri! Come on, it's 2010 - you can't justify charging over €17 a day (after tax) for providing Wifi! A minor issue in an otherwise wonderful boutique hotel.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Location, location, location!!!”", "Author": "Accounting Professor", "ReviewID": "UR72160451", "Content": "One can't beat the location. My husband was attending a meeting at the Palais de Congress just below Montjuc. He had a 15 - 20 minute trip via Metro. The Metro station (Diagonal) is one half block from the hotel. The Rambla Catalyuna has a wide pedestrian median with narrow one-way streets on either side. In the median are many outdoor cafes, bistros, etc. One block over is Barcelona's equivalent of Michigan Avenue in Chicago.; the Ple de Gracia is lined with top designer stores. On the side treets are the top restaurants in Barcelona. On every block there is a bank, a pharmacia, a parfumeria, a bakery, a lingerie shop, a shoe stores etc. The \"all important\" Starbuck is an immediate left down a side alley. 45 minutes of internet access per purchase. For Americans, it is one of the few places with \"Amercian or British or French style morning coffee. The Catalans drink espresso either straight or with \"latte\", i.e. milk. I love espresso in the evening, but I need my large drip or french press coffee in the morning. Did I mention that the Familia Sagrad is a mere 2 metro stops away? We stayed in 301, which fronted the street and had a king size bed. There was no street noise at night. It is a lovely street, but it is not a \"main drag\". I noted in an earlier review the mention of lack of drawer space. Not so! The two small wardrobes had ovehead shelves and two bottom shelves. The night stands each had 2 drawers and the TV stand had drawers. It is hanging space that is in short supply. Only one wardrobe had hangers. Those with many suits, dresses, etc. will have limited space. The bathroom has a large amount of storage space due to a shelf under the sink and counter. My only complaints were first the lack of an iron in the room. Yes, housekeepig delivered a board and iron upo request, but the iron was a puny appliance incapable of reaching a hot temperature. My second issue was the TV. It is a lovely,flat creen TV. Sadly, the hotel advertises that international channels are provided. International must mean Catalon and Spanish. There was not one English speaking channel. French and German did not exist either. Given the nationalities of the cliental, this must be remedied. We have relocated to a Hilton managed property which has over a dozen English channels includinging CNN, FOX, FOX News, CNBC, BBC, Europsorts and several French and German channels. Murmuri can do better. I don't understand the \"pricey\" comments. What do people expect to pay for a designer boutique hotel in a prime location in a major European or USA city. If yo expect ot pay much less than $200 a night, you are living in a fantasy world. We spent 5 nights and prepaid around $1000. This is money well spent!", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Beautiful hotel. Great location. Amazing staff.”", "Author": "TomTomB", "ReviewID": "UR70766351", "Content": "While location and hotel were great, it was the quality of the staff that left the biggest impression. Most helpful staff I've experienced. Excellent choice of hotel.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york city", "Title": "“Small and Perfect”", "Author": "kemmy", "ReviewID": "UR67817310", "Content": "The hotel was fabulous. The service was great, the staff was helpful, the location was absolutely perfect. The room was on the smaller side and if you do not pack light, you may not have enough drawer space for your things. The room was clean, they left yummy chocolate on your pillows, and the decor was modern yet classic. The bed was absolutely comfortable and the hotel was a nice respite. They do have an odd breakfast offer that is unnecessarily expensive given the eateries surrounding the hotel such as the Fornet, Mauri, and the coffee bar around the corner. They did not have free internet and it was absurdly expensive given that you can get internet at starbucks for the price of a cup of tea. I did not like their recommendations for restaurants, they were often overpriced and geared towards tourists. I would stick to recommendations by locals and some of the restauranteurs who are very helpful in making suggestions.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boca Raton, FL", "Title": "“Both chic and friendly, Hotel Murmuri is a boutique hotel in a great part of Barcelona.”", "Author": "BocaTraveler09", "ReviewID": "UR66982006", "Content": "Hotel Murmuri is a small hotel with style and flair, located in the L'Eixample area. The rooms are contemporary with surprisingly large bathrooms and luxury amenities. We chose a \"superior\" room and, with an advance booking rate, found it worth the money. Although the room wasn't large, it was efficiently-designed and had lots of storage. The staff was friendly, attentive and helpful. I spent a lot of time reviewing the various areas of Barcelona and am very happy that we chose L'Eixample. It is upscale, with wonderful shops and eateries and wide boulevards. It is close to many wonderful Gaudi buildings and a long walk or inexpensive cab ride to all the other attractions. We were happy not to be in the more crowded, touristy parts of the city. We enjoyed time in the bar and dining in the Asian-Spanish restaurant.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Modern but small”", "Author": "Raineaway", "ReviewID": "UR66195892", "Content": "This is a classy, modern and clean hotel. The rooms do look as nice as they do in the website's photos. However, the rooms are very small. We travelled with an infant and the stroller barely fit in the hallway. They also allow smoking in the bar by the lobby so the smell seem to permeate the hotell. I suppose it's not just a Hotel Murmuri issue. Cigarette smoke seems to be tolerated everywhere in Spain.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Would return in a heartbeat!”", "Author": "stacy1259", "ReviewID": "UR66076028", "Content": "We stayed on the Hotel Murmuri for 8 nights in May and loved the hotel! The location is perfect. Its located 10-12 blocks from the tourist chaos of La Rambla. Great shops and cafes everywhere around the hotel. The Metro is a block away which was perfect! We stayed in the Design Room, with no complaints. The room is well decorated, nice TV, great bathroom, very quiet, and gets nice and dark with the shades drawn. We slept great every night. For breakfast, the cost at the hotels is not worth it. There are a ton of amazing places right around the hotel where two people can eat for 5-10 Euros. The hotel charges 16 Euros each day or 10 Euros if you agree to do breakfast there everyday when you check in. The hotel bar is very convenient...yes their listed cocktails are overpriced, but they do have affordable options. We spent a lot of time at their sidewalk bar. We had dinner there one night and we loved it, it exceeded my expectations. It was great food and sometimes a break from Tapas is warranted. I wish the hotel would include internet or at least make it more affordable. We paid 7-8 Euros for 45 mins and there wasn't a printer which made checking in for flights annoying since you were dependent on the front desk. Also, if you want to use the gym while you are there. The hotel does not have one, but you have access to the Majestic Hotel's which is a 5 min walk. I am crazy with research, so trust the reviews on this one...its a great hotel choice in Barcelona. Walkable to several sights, away from the tourist traps and so easy to get around from.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Felt like home!”", "Author": "Gloryb32", "ReviewID": "UR64869438", "Content": "We were very pleased with this hotel. We arrived prior to 9:00am after an overnight flight from Philadelphia thinking we would just drop our bags at the hotel. We were pleasantly suprised to find that we could get into a room. We were treated like family and made to feel very welcome. The room, although a little small, suited our needs. The bathroom was large and decor was modern. The staff was always pleasant and helpful. They answered all of our questions regarding restaurants, directions and metro travel. I travel often for business and stay in various hotels depanding on location. I would definitely go back to Hotel Murmuri for business or pleasure. You can't go wrong with this hotel.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yardley, Pennsylvania", "Title": "“Outstanding Service!”", "Author": "stepdon", "ReviewID": "UR64812141", "Content": "Everyone at the front desk is a concierge, cheerful and always available for your every need and at any time. they were most helpful for anything we asked for, including info on the metro, restaurants ,directions, and anything else when you need some hand-holding in a strange city.Edourd, the manager, and Damian practically became our new best friends! The European-style breakfast was very serviceable, and a good value at the promotional rate of 10 euros, and we like the convenience of breakfast at our hotel, so we can freshen up in our room afterwards. Our bathroom was spacious and had all the modern amenities. If anything, we would say the room was a tad small, and we would get larger room the next time. The location is ideal, being in L\"Exaimple, near many Gaudi buildings, chic Paseo de Gracia, and being on Rambla de Catalyuna which has a lovely island for walking, great restaurants, and within easy walking distance of the busier areas of the Ramlas. We will definitely return to this hotel.", "Date": "May 20, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Santa Ana, California", "Title": "“would not stay again”", "Author": "robinchristenson", "ReviewID": "UR64627916", "Content": "Our room was amazing BUT it was absolutely filthy when we got there--also they were very late getting our room ready--ALMOST 5pm and it was still dirty--bedspread was wrinkled and stunk like old smoke--shower smelled of mildew--ended up at the Omm after 3 nights there- Only saving grace is beautiful design", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huesca, Spain", "Title": "“Outstanding! Awesome! Simply Perfect! Amazing!”", "Author": "Vavinana", "ReviewID": "UR64185857", "Content": "We stayed in this incredible Hotel and it was fantastic. We had a really great time, the small boutique Hotel has everything you are looking for. The room was spotless, the matresses are so comfortable and the food in the restaurant is just delicious. The staff, specially Robertus in front desk is so helpful. I was robbed in The Rambla de Catalunya and he run after the thieves and catch him and he saved my life! It was just a dream! We had the chance to have a few conversations with the General Manager and he is very profesional and smart. He is doing a great job. Thank you for this lovely experience, Miss Singa", "Date": "May 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Nice Boutique Hotel”", "Author": "GavT", "ReviewID": "UR63137596", "Content": "This hotel was recommended to me by a guy I met on a plane going to Vegas, he seemed well travelled and well versed in quality hotels so i thought why not trust a complete stranger. Well, he was right it is a lovely hotel, well decorated and in a good location. On arrival we were advised that our \"special request\" of a double bed could not be granted which to me was shocking. If they hadnt had a double at the time of booking then I would have gone to the 'W' or 'Hotel Arts'. They didnt back down and the attitude on this subject was bad, still its not like we were spending a few hundred Euro's or anything. The staff are all very pretty, but at the same time helpfull and courteous. Food and Drink prices border on the ridiculous, 5 euros for a small draft beer and between 11 & 15 euros for a cocktail. But theer are plenty of other places in Barcelona to eat. Room wasnt ready on arrival but was a nice room and well decorated. Bed was comfortable (even if they were twins pushed together). All in all more than happy to recommend the hotel just be prepared to not get your choice of bed.", "Date": "May 3, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "LA", "Title": "“Unbelievable! (and not in a good way)”", "Author": "manglwurzl", "ReviewID": "UR62792669", "Content": "I had the same experience as newyorkold (\"Livid\" 5/23/09) almost a year later. My colleague and I arrived at the Murmuri ~ 10:30PM exhausted from a long work day and flights from Amsterdam. On arrival, we were greeted and asked inside, then we were told that unfortunately there were no rooms available (although we had both booked through American Express - our corporate travel booking agent). We were then asked to wait for a cab that would then take us their \"5-star sister property.\" Remarkably, I recalled reading the review, and objected, but was told there was no option. On arrival at the sister property, we were greeted in a rather ambivalent manner and given our rooms. I suggested that for the inconvenience, perhaps the hotel would like to buy us a drink. I was told no, but given the option of an upgraded room. I agreed. When show to the room, I looked around and saw no windows; sure the room was big, but there were no windows, only 2 small skylights. 5-star in this case was well beyond questionable. When I objected, I was taken to a much smaller room with a window (and a view of scaffolding) that smelled oddly of bacalao, body odor, and egg. Pissed-off, but with no obvious alternative, my colleague and I went to dinner. Over dinner, we relaxed a bit and decided to switch hotels. We moved after dinner at ~ 1AM. Best decision ever. There is no possible way I can recommend this hotel. However, he following afternoon, we did stop in to the sister hotel to speak with the manager and verify there would be no charges. She was very gracious, and a radical departure from her nighttime staff. She presented her card, and requested that next time I plan a stay in Barcelona, I call ahead and she'd guarantee a room in the Murmuri. I'm willing to give it a second chance, but will defintely not waiver from this review until that time.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Midlands", "Title": "“Absolute gem, one of the best hotels we've stayed in”", "Author": "Sam715", "ReviewID": "UR62784019", "Content": "Brilliant hotel, lovely large rooms, trendy 'cosmopolitan' decoration, absolutely massive walk in shower, molton brown toiletries and excellent location - in the exclusive shopping district. Would def stay here again, exceeded all our expectations.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Fabulous gem of a hotel”", "Author": "KatieBS", "ReviewID": "UR61838239", "Content": "A surprise 3 day trip to Barcelona to celebrate my husband's impending 40th birthday took us to the Hotel Murmuri in mid April. We stayed in Room 602 which I believe is shown on the hotel's website photos showing a Privilege Room. Small(ish) but has all the amenities and comforts we could have asked for. The kingsize bed was so comfortable and there was no noise at all from the busy street outside. The curtains are blackout curtains allowing for a quiet and restful night's sleep. French doors opened up to a very sizeable terrace with 2 sun loungers and a table/chairs for 2 - a joy in a busy big city like Barcelona. The bathroom had everything we needed and a great bathtub - be advised there is a window overlooked by neighbouring rooftops but we came to the conclusion that noone could actually see in and threw caution to the wind as we stood and showered by the window! I took baths which were blissful but my husband's mild complaint was that the 'raindrop shower' didn't give much pressure. The hotel is perfectly located. It's a short stroll to Gaudi's Casa Mila & Casa Botllo (on the parallel street Passeig de Gracia - where all the high-end luxury brands have their stores). At the bottom of Passeig de Gracia (or the hotel's street/Rambla de la Catalunya) is Placa de Catalunya, the other side of which is La Rambla. Don't confuse the hotel's elegant street with La Rambla - a bit rough round the edges these days and full of tacky tourist attractions although still worth a visit. Diagonal metro station is about a 2 minute walk from the hotel and from there you can go north to Gaudi's fabulous Parc Guell, or head in the other direction (just 2 stops) to the incredible Sagrada Familia or go 2 stops to Passeig de Gracia where you can switch lines to head to the Barrio Gotico, Barceloneta or a host of other hot spots. I really can't think of a better location in Barcelona from which to go sightseeing. We returned from a rather enthusiastic sangria drinking evening by the Cathedral and popped in the bar at the hotel for a nightcap. This was a bit disappointing - a very narrow bar with beautiful decor but funnily enough very little ambience. The drinks were way overpriced as they often are in hotels. I would suggest bypassing the hotel bar and instead finding alternatives. If you have a room with a balcony as we did, and fancy an early evening aperatif, there is a small supermarket about a block away which sells very cheap beer & wine (3 EUR for 6 San Miguel beers). It was a nice end to our jam packed days, to return to the hotel, wrap ourselves in the luxurious robes and 'slice of heaven' hotel slippers, have a shower/bath and then head to the terrace with an ice cold beer and a book to unwind before heading out for the evening. There aren't a lot of amenities at the hotel (no fitness room, etc although they do have a partnership with the larger Majestic Hotel about a 5 mins walk away for spa treatments) but if you're looking for a huge chunk of comfort, close proximity to all the main sights of Barcelona, wonderfully friendly staff and a lovely room, this is the place for you.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "United States", "Title": "“Fantastic!”", "Author": "O2BCyrus", "ReviewID": "UR61227045", "Content": "We just returned from Barcelona where we spent three nights at Hotel Murmuri. The hotel was very clean (and we're picky about that point), and the staff was extremely helpful to us -- we simply could not have asked for more accommodating hosts! Other reviewers have done a good job of describing this modern hotel's features, but I wanted to answer for others a few of the questions I found unanswered before my travels. 1) This is a very nice neighborhood. No worries there -- it's probably the nicest (and safest) part of Barcelona. If you're looking at the tourist guidebooks, the neighborhood is called Eixample. 2) In addition to the Bar Marfil and Restaurant Murmuri on the hotel premises, there are plenty of cafes and restaurants nearby. Be aware that many of them will be closed on Sundays, but some will remain open (your number of choices will be diminished, but you won't go hungry!) 3) There are a pleasant number of people on the streets in the evening. Rambla de Catalunya is NOT Las Ramblas (which is the loud and noisy and screaming area with a lot of bars and horns honking and whatnot). There is plenty to see and plenty of people to watch, but not the level of noise and revelry that will keep you up late at night. You can walk or Metro to Las Ramblas if you want the activity, but then escape to more civilized surroundings when you return to your hotel to rest. 4) There is LOTS of high-end shopping in this area. Not my thing, but if you want to gawk at Gucci and other high-end design stores, this is the place to be. 5) You're one block from Le Pedrera (Casa Mila), and the local tourist bus stop; 2-3 blocks from the \"Block of Discord,\" where Casa Batllo is one of three stunning Modernista buildings; 1/2 block from Diagonel Metro stop, and right around the corner from a fabulous coffee and pastry shop (Cafe Mauri). 6) The staff at Murmuri are incredible and very helpful. They do speak English very well, which was helpful to us as our Spanish is poor (at best!). 7) The rooms do not have universal electrical adapters, but Murmuri has them -- just contact the front desk. 8) The hotel doesn't exchange currency, but there is a bank across the street that does, as does the more staid Hotel Majestic, which is located about 2 blocks away (Murmuri and Majestic are both owned/operated by Majestic Hotel Group). We thought exchange rates were decent at both places. 9) The rooms are spacious by European standards (less generous space than American travelers are used to, but our room at Murmuri was certainly more spacious than at the also-fine Majestic (see separate review for our first night stay at Majestic). Here are a couple of hints: HINT #1: Keep the hotel address at hand. This is not a giant hotel that every driver knows (in Barcelona, there aren't a lot of 1,000 room Hiltons -- it's full of the smaller, boutique hotels like Murmuri), so it's important to have the address in hand. It's also important to know the cross streets to look for so that you can find it (Carrer de Provenca on one side and Passtage de la Concepcio on the other); I recommend printing out the map on the hotel's website just to be sure you won't miss it the first time you look for it. HINT #2: Know that you will need to look directly AT the building to see the sign for Murmuri -- it is tucked inside the alcove to the doorway, rather than standing out at right angles so oncoming traffic can see it. Murmuri is an old building that has had a wonderful makeover on the inside, but the outside edifice still the traditional stone facade. (I'm probably not explaining this very well: what I'm trying to say is it's a great hotel, but the signage isn't great and you need to look AT it or you'll miss it. See their website at murmuri.com to take a look at their photo of the sign and you'll see what I mean -- I mention this because we almost passed the hotel without noticing it.).", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Beautiful hotel, gorgeous room and great location”", "Author": "EnglandBeach_lover", "ReviewID": "UR61101005", "Content": "Stayed here for our 10th wedding anniversary and got a great deal on a privilege room. The room was stunning, really quiet so we slept well and perfectly located for the Metro. We even managed to watch to the beach the first afternoon! Would recommend this hotel to anyone!", "Date": "April 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“just perfect”", "Author": "ARobinson_10", "ReviewID": "UR59938477", "Content": "We had the most perfect stay at the Murmuri, location is great, right near the nicest shops and the best restaurants....rooms are a bit on the small but really gorgeous nevertheless. The bar is very sexy and the restaurant serves very interesting asian tapas, try the fishcakes. However the best thing about this hotel that makes it stand out from so many others is tha fabulous service , everyone is so genuinely brillliant at their job, thay make you feel at so at home and welcome in this wonderful city and don't have any of that awful attitude that most fashionable boutique hotels have. best boutique hotel I have ever stayed in because of the service.....by far", "Date": "March 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent, England", "Title": "“Great location, lovely rooms, fab bar, but breakfast can be shambolic”", "Author": "cheryltheperil", "ReviewID": "UR59810560", "Content": "Really well appointed room including ipod dock and moody lighting. Lovely bathroom with a proper, walk in monsoon shower and a seemingly endless supply of towels. The bar is very cosy and definitely a nice place to come for a post-dinner drink. The location is perfect with many shops and cafes close by, which brings me on to the only downside - breakfast at the hotel takes a good hour, no mean feat when you consider nobody is actually cooking anything. That isn't to say that breakfast isn't good - it is. Just very slow on some mornings. It wouldn't stop me coming back here but it would make me consider whether to include breakfast.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Hotel Murmuri - will stay there again”", "Author": "jviel", "ReviewID": "UR59349516", "Content": "The hotel is well located along the ipper end of La Rambla. You can walk to many shops and restaurants, and the metro is just steps away. The architecture is very modern, and the rooms seem recently updated. All the fixtures and features are very modern and convenient. There is plenty of storage and closet space, and the beds are reasonably comfortable. Our room was in the back and had a nice balcony. There was no view, but frankly we did not plan to stay in the room much. We never tried the restaurant or lounge so we cannot comment on it.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Outstanding!”", "Author": "LondonShopgirl", "ReviewID": "UR59061969", "Content": "Having never been to Barcelona, I spent some time researching hotels and took a fancy to the glossy website of the Murmuri. It was a good price for a 4 night trip for my mother and I, and I booked with my fingers crossed. The hotel was superb, the staff were very friendly and helpful, the room was beautiful and spacious, with a huge walk in shower and luxury toiletries...much higher standard than I was expecting for a standard double room. The hotel is flawless in design, and the standard of cleanliness and service is never compramised. Each day we returned from our sightseeing/shopping, the bed was turned down, the side lamps switched on and chocolates on the bed,- a welcome touch!The bar and dining area is also exceptional, with great views of the busy streets for you to sit and 'people watch' over a coffee. Surrounded by beautiful architecture and shops, its a perfect location all round", "Date": "March 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, UK", "Title": "“Very convenient location and excellent service in comfortable hotel”", "Author": "TCSCambridge_UK", "ReviewID": "UR58959967", "Content": "Excellent break at this hotel very conveniently located for shopping and sightseeing in centre of Barcelona. Room was very quiet, comfortable bed and all facilities worked very well. Hotel staff at front desk extremely helpful in arranging a day trip out of town and provided faultless service at breakfast and when eating in hotel. Food very good in hotel's own asian-accented restaurant one evening. Only very small quibble was that room only had a shower not a bath - but our fault for not checking this out when booking - but it was a superb shower!", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nyack", "Title": "“Wonderful, Excellent, Terrific. Thank you Eduardo”", "Author": "NyackWeekender", "ReviewID": "UR58661997", "Content": "I stayed at Hotel MurMuri for 3 nights last week. My family members travelling with me had one room, and I had another. and can honestly say it was one of the best hotel experiences I have ever had. *The room was spectacular *The Front Desk staff was exemplary; (Thank you Anna et al.) *The food and beverage operations were outstanding. *The comfort was over the top *The room rate was attractive *Breakfast was delicious *Dinner in the restaurant was perfect *Drinks in the lounge were appropriately alcoholic and served in a cozy atmosphere * Eduardo, the General Manager, was a great representative for the hotel, seemed to be everywhere 24/7, and made sure our stay met our expectations in every way. I couldn't ask for anything more. Thank you Murmuri. I wouldnt stay anywhere else in Barcelona", "Date": "March 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“Not good for people who don't like smoke.”", "Author": "143JTKC", "ReviewID": "UR57657472", "Content": "Good things about Murmuri: 1) Excellent location (i.e., just steps form Gaudi's works; Metro is right on the corner; the famous Mauri cafe is also right around the corner). 2) If you like a modern, boutique hotel, Hotel Murmuri is just that. Bad things about Murmuri (as you can see, the bad outweighs the good): 1) We asked for a \"privilege\" room, but were put in a room of lesser quality and were charged for it; we asked to be moved the second night. Tip: Make sure that you get the room that you paid for! 2) The concierge staff does not speak English very well. They are also not very helpful with directions and don't seem to know the area very well. Some of them seem a little ditzy. 3) The bathtubs are very slippery and narrow. You could easily crack your skull in there so be careful! 4) The rooms are EXTREMELY smokey. If you don't like smoke, this is not the place for you. We were on the sixth floor, but we could still smell the intense cigar smoke from the cigar bar rise up to our level. We had to open up our window to get any semblance of fresh air in. 5) The pillows feel like rocks. 6) The breakfast is not included, very expensive, and doesn't have much variety. Hope this review helps!", "Date": "March 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Donaghadee, United Kingdom", "Title": "“Great hotel overall - just needs to look at breakfast arrangements”", "Author": "highfly", "ReviewID": "UR56219627", "Content": "The Murmuri location is great. The area is nice and there are plenty of places to eat and drink around it. Very convenient for Gaudi houses and only 15 mins pleasant walk to Place Catalunya (and bus to/from airport if you want) The hotel is very stylish and all fittings seem to be high end quality makes – bath, washbasin, shower, TV etc. We had booked a double superior and were initially allocated 202 which was a smoking room. After a bit of a wait we got room 302 which was non smoking. Our info in advance had said that designated smoking rooms were available on request whilst in practice it seems there is a need to specify non smoking. The room was very nice – a huge bed, good lighting with choice of settings – relax, ambient etc, good bedside reading lights and room light controls at bedside. Small balcony which was a pleasant bonus –not really for sitting out but nice to get fresh air. Three narrow wardrobes at different points of the room gave adequate storage, although a bit tight on space to access the room safe in wardrobe beside chair and near window. Access to mini bar almost impossible as opened against the room where chair blocked robe door. Bathroom beautiful and all aspects worked well. All areas very clean and housekeeping did a good job – as if by magic (never saw them once anywhere in the hotel) TV had about 500 channels but we couldn’t find one in English. A call to reception on day 2 solved this and girl pressed analogue button I think which gave access to English channels, so don’t assume they aren’t there. Breakfast was the main let down. The food was fine, but somewhat limited. Choice of 3 juices, cereals, croissants, pain au chocolat, some bread, nice preserves, smoked salmon or ham salad sandwiches, cheeses, ham. The highlight for me was the scrummy fruit kebabs. Have to say staff were not quick to replenish items. Also, breakfast was supposed to be until 11am but the food was whisked off about 10.50. Hot food was available to order but was all at an additional charge. One euro for bacon, 2 euros eggs, 3 euros for omelette. What a cheap move. I know times are hard but when you are paying these prices that is cheap and shoddy. However, the system/service was woeful. No one to greet you so you just sat down. You would wait ages until anyone came near – and they were only interested in asking your room number(which they usually forgot and had to ask again.) No interest whatsoever in offering tea or coffee (getting blood from a stone comes to mind) Tea was half a cup of luke warm water from a flask with a teabag to follow unless you asked for a pot. Never in 3 days were we asked would we like tea or coffee or would we like more tea or coffee. Easiest just to get up and go to the workstation and get it yourself but usually they had run out. There was a bottle of cava in an ice bucket on the way in at the opposite end of the dining room from the rest of the breakfast but it was certainly never offered by the staff. Maybe you had to ask for it…on the basis of charging for bacon maybe you had to pay. I’ll never know!! The bar was pleasant for a drink and was usually quite busy – seemed to be a place to be seen. However, as with everywhere in Barcelona smoking is prevalent ( if you are used to UK and Ireland no smoking in public places laws and don’t smoke it can be very off putting but that’s just something you have to get used to. Great for smokers though!) Overall a good stay but let down by breakfast.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "N.J.", "Title": "“Great hotel, great staff, great location”", "Author": "kft11", "ReviewID": "UR54662236", "Content": "Some friends and I stayed for nearly a week. The regular rooms were clean and well appointed. Furnishings were new. Bathrooms were new and pristine. The hotel staff was superb and provided excellent guidance about where to dine and what to do. The city has become one of my favorites and so has this hotel -- it has a boutique feel with great quality. Reminds me in that respect of the Sagamore in South Beach.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "irelanf", "Title": "“Amazing hotel, excellent location”", "Author": "IrelanfNicole13", "ReviewID": "UR53669037", "Content": "This hotel is fantastic, the rooms are big and spacious and very modern. The bathroom is the exact same. The staff are very friendly and very helpful. It has an excellent location which means that you can walk anywhere, there is also a metro station close by for longer trips. The hotel has a bar which is nice but quite expensive for drinks. Along the strip outside the hotel there are numerous restraunts and tapas bars.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“More than a place to sleep”", "Author": "lyrums", "ReviewID": "UR50455120", "Content": "What a great hotel - great rooms, great service, excellent staff, fantastic restaurant, top location. If you're looking for somewhere to stay in Barcelona then the boutique Murmuri is it. It is close to many of the Gaudi houses but far enough away from the mayhem of La Rambla. The Metro is almost at the doorstep, too. We stayed in a Privilege room, which has a great extra room where we put a three-year-old in a fold-away bed and a one-year-old in a cot. The room has a sliding door that can be closed to allow parents privavcy and rest! Our only complaint - the restaurant doesn't have a high chair for babies.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Perfect hotel”", "Author": "Torpegart", "ReviewID": "UR50373438", "Content": "We stayed at Murmuri for 3 nights, and everything was perfect. Great location, beautiful rooms and very friendly staff, who knows the city. The Bar Marfill on the hotel is a very cosy place to enjoy a drink or some snacks, but the restaurant was a little bit of a letdown, compared to everything else in the hotel. Would recommend it to anyone, if they aren't on a budget. Will stay there for sure next time I'm in Barcelona.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“A lovely little hotel”", "Author": "LondonsSweetTooth", "ReviewID": "UR49984377", "Content": "We stayed at Murmuri for three nights in November 2009 for a short city break. The hotel was well located within walking distance to many sights and close to bars and restaurants. The room (£92 per night, booked through Expedia special rate) was a good size with a nice bathroom, but no shower. The only drawback was the lack of tea/coffee making facilities in the room. Hotel staff were helpful during our stay, answering any questions we may have had and generally being polite and efficient. I would stay here again without hesitation. LST", "Date": "November 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Rafael, Calif", "Title": "“Quiet Elegance”", "Author": "Kezarkid", "ReviewID": "UR48011444", "Content": "A very nice boutique hotel located in the Eixample district. Very good staff and hotel was very clean.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Brilliant location, lovely, relaxed, stylish hotel.”", "Author": "mikeyc75", "ReviewID": "UR44889365", "Content": "First time in Barcelona and this was a great spot for exploring all this wonderful city has to offer. Situated in a great shopping area and with the Diagonal Metro station just a very short walk away. We spent 5 night here and the staff were professional - a couple of staff members in particular were very friendly and welcoming and the hotel barman makes a fantastic dry martini! The rooms, although on the small side, were well proportioned and the bathroom was a good size with a great shower. We did have to ask a couple of times for the clock/alarm/ipod dock as there wasn't one in the room when we arrived (which is supposed to be standard in all rooms) but this was delivered by the second day. Overall the hotel contributed greatly to our stay and was an ideal base for discovering Barcelona.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mexico City", "Title": "“Great Hotel BUT needs more cleaning”", "Author": "jpmex", "ReviewID": "UR44259088", "Content": "We loved the hotel. Its location, the rooms, the amenities. We stayed for 3 different occasions during the month. First we were upgraded to room 104 (Junior Suite) which was really nice and big. Then we were at room 604, perfect! small, but had a very nice terrace on the top floor, and finally we stayed at room 508 (AVOID THIS ONE), it is really nice, but seems the bathroom is enclosed and with no air vent, so there is mildew in all the shower area and the smell is terrible. We asked housekeeping the next day for a better cleaning but no change. Staff is very friendly BUT they are no locals, they seem to be from other countries, so they are not very familiar with the city, restaurants, nor services needed. In general I do recommend this this hotel but do not expect 5 stars.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Good but could improve on cleanliness”", "Author": "Serin", "ReviewID": "UR43090128", "Content": "Perfect airconditioning system in the room, soft but comfortable beds, totally soundproof windows and walls, a large bathroom and plenty of storage space were the nice features of this hotel. I chose this hotel because I was fed up with the poor service and stained carpets and bed covers at the Casa Fuster. Murmuri also has stained carpets and bed covers, which I was not expecting for the price paid. The hotel could also consider providing free internet sometime in the 21st century. The restaurant Petit Comité a few metres from the hotel serves very good Catalan dishes.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“Good choice in Barcelona”", "Author": "SASNY", "ReviewID": "UR42964711", "Content": "We stayed at Murmuri for 5 nights based on reviews here at Tripadvisor. All in all, I recommend the hotel, with just a few reservations. We had a privilege room which was clean, comfortable and nicely decorated. The highlight was a large terrace that looked right out over Rambla Catalunya. Breakfast, included in our rate, was quite good, with a choice of fruits, yogurts breads, hams and cheeses, etc. One could order eggs as well. We liked the fact that the hotel is new and modern. It is also very well located-- only a 10 minute walk from the Rambla, but we were happy to be staying in a more upscale area, out of the noisy and touristy hub of activity. On the downside, the atmosphere in the hotel was very \"hipster, trendy.\" Accordingly, while the staff looked the part, we found them not particularly warm or friendly, and they ran the gamut from fairly competent to totally inefficient. We had asked the desk to make reservations at the hotel restaurant (located only a few feet from the front desk), but when we arrived for our dinner they did not have our reservation. The staff at the restaurant and bar were almost laughably incompetent. Also, the hotel itself did not have much character-- it was pretty sterile in tone. Aside from the bar and restaurant, there were no common seating areas. For this reason, we were especially thankful to have our terrace. We tend to like the smaller boutique hotels because they have a more unique personality than chains, but we did not find this to be the case at the Murmuri. Despite these issues, we thought that the Murmuri was a nice hotel and a good value compared to other similar hotels, and thought the location was perfect. If we returned to Barcelona, we would definitely consider staying there again if the price/value ratio remains the same.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Excellent combination of quality, location, and value”", "Author": "davidxray122", "ReviewID": "UR42672934", "Content": "We stayed 3 days at Hotel Murmuri and were totally happy with the experience. The hotel has an excellent location, is very quiet - without the street noise common to Spain, the rooms were modern and clean, and the staff was helpful. The price was extremely reasonable for the quality of the hotel. Would highly recommend to someone looking for a high quality hotel at a reasonable price", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Excellent hotel, beautifully designed, great location - will defenitely come back”", "Author": "AbuBooboo", "ReviewID": "UR39978951", "Content": "The hotel is located is excellent - not far from the Ramble, and inches from the Metro station. The hotel is beautifully designed and maintained, sophisticated and elegant. The staff are very helpful and forthcoming, and provide fast accurate service with a smile. The room is spotless clean, as well as the shower - both very spacious. I would (and already have) recommend this hotel to friends coming over to Barcelona.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "gentbrugge", "Title": "“great hotel with helpfull staff”", "Author": "dd220786", "ReviewID": "UR39127721", "Content": "We spent 3 nights in Murmuri in July 2009. We had a great time. The hotel is located near the main shopping street, La Pedrera (Gaudi) and at walking distance to the mayor sights and to the metro. It is a real design/boutique hotel. The rooms are well appointed with all the possible facilities (docking station Ipod....). and very clean.The staff are wonderfful, helpful and very friendly. It is a four hotel with a 5 star service. We would not hesitate to recommend this hotel and will definitely stay there again. Hope they can keep up this standard.", "Date": "August 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County, California", "Title": "“Went Beyond Expectations - Five Star in My Book!!!”", "Author": "JaniesWorld", "ReviewID": "UR37147393", "Content": "We loved everything thing about this hotel. The rooms were sleek and comfortable. The pictures on the website were exactly the rooms you got. No deceptions here! The beds and pillows were comfortable, the bathrooms were big, plenty of counter space and great water pressure in the shower. Lots of room to move about. Very clean. The hotel was very quiet and in a very nice part of Barcelona. It was a quick walk to all the attractions and most of the action. The service was friendly and accommodating. The staff were wiling to help you and look things up for you on the computer and any problems were taken care of immediately. We arrived at 10am and our rooms were ready. We went to Venice for two days and they stored our lugguge. When we returned from our trip, after midnight, our luggage was already waiting for us in our room. I can't say enough about this hotel, we had an excellent stay.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Style and substance - a beautiful hotel with fabulous service”", "Author": "prbod", "ReviewID": "UR36736751", "Content": "We have just had a lovely long weekend in Barcelona at this fabulous hotel. We booked a Premium Room, and at first were allocated a spacious room on the third floor. Although lovely, we had twin beds rather than a double, so asked to move. Without fuss, we were given a smaller room on the sixth floor, with the most wonderful terrace - very peaceful, beautiful furnishings, and thoroughly comfortable. Breakfast is languid and lavish - going on until 11, with a choice of delicious fresh fruit, cheeses and meats and the option of the lightest scrambled eggs and bacon, finished with rich, flavoursome coffee. The restaurant is quiet in the evening, but we ate outside at the terrace bar, and the food, though not cheap, is fresh, modern, clean Asian. Wine is good value. The staff are helpful, friendly, and bi-lingual, and happy to help with requests for recommendations. The location is fabulous, it is easy to walk around, or get the cheap, clean, and air conditioned tube to any of the multiple attractions. When you get too hot, you can go to their sister hotel, The Majestic, for a cool drink on their terrace and a dip in their pool. We loved, loved, loved this hotel and would definitely recommend.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Boutique Hotel in a Great Location”", "Author": "msbelgianian", "ReviewID": "UR36644543", "Content": "I stayed at Hotel Murmuri for a week based on the suggestion of my client. At first glance, I wasn't sure I found the right place; there was a closed big black door obstructing the view of the lobby. Checking in, the staff was nice, almost too shockingly nice. The person directly helping me was new as the manager was \"hovering\" in a polite way. The thing that really gave me a strange feeling was when the staff escorted me to the room and showed me the amenities of the room (how the lights worked, wardrobe with safe, etc.) The hotel room itself was really nice. Warm inviting chocolate/beige textiles and modern bathroom fixtures. No issues with the size. Large enough for me and my husband (who stayed for half a week). On the top floor, there is a terrace for sun bathing and a table. My colleagues and I used the table to do some work. Hotel Murmuri has a sister hotel, about two blocks away, where you can use their amenities...fitness center, spa, pool and larger terrace with a good view of the city. We walked in without any questions and were able to use the lounge area near the terrace to work. The only downside is that I thought it was a tad expensive (but I haven't traveled to Barcelona for work before). For example, two drinks (cocktail and sangria) from the bar were approximately 22 Euros. The internet daily rate was 15 Euros. Overall, Hotel Murmuri was a comfortable place to stay for a week. Great access to public transportation, restaurants, shopping and Gaudi sites (e.g., Casa Milo, Casa Batllo). I'm not sure if I would stay here if I had to pay for it myself.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "wales", "Title": "“I'll definitely be back”", "Author": "Lleisiau", "ReviewID": "UR35609129", "Content": "An excellent hotel . Lovely location at the top of Rambla De Catalunya, within easy reach of Diagonal Metro and walking distance of many sights .The rooms look exactly as the photos suggest . I booked a superior room ,through an agency and had an excellent deal for bed and a huge breakfast.Though around the corner is Mauri , a great , but not dirt cheap , cafe ! The room had the most comfortable hotel bed I have ever slept in and everything was beautifully clean ;sheets and towels changed daily .", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“The best find!”", "Author": "shermani", "ReviewID": "UR34780101", "Content": "Hotel was excellent from the location to the amazing service we got. In addition, we had the best meal at the hotel restaurant for dinner.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "sydney", "Title": "“Awesome hotel”", "Author": "sherwoodbaby", "ReviewID": "UR32960596", "Content": "Had a wonderful trip to Barcelona and a lot was due to this lovely hotel. It had just opened when we went and we found it to be very comfortable and had all the amenities you could want! Highly recommended.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Underwhelming--High style, but poor service and small rooms”", "Author": "Inveterateexplorer", "ReviewID": "UR32188092", "Content": "Though it has a terrific location and occupies a pretty 1900 vintage building, the Murmuri is clearly a victim of its own success. Check-in in the small lobby took forever, and the scene at the front desk was a mad house. Upstairs, we found the rooms extremely small for the money and also very noisy--they definitely need to put breaks on room doors, which slam all through the night. Despite a DO NOT DISTURB sign on our door, two different chambermaids opened the door within a half hour, and breakfast was a dreary affair with little choice and mediocre quality. They're many better options in Barcelona.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris", "Title": "“Excellent hotel - would highly recommend to anyone - and have done so already!!!'”", "Author": "karrieParis", "ReviewID": "UR32166631", "Content": "Very helpful, friendly staff who really aimed to please on all fronts - We stayed for 3 nights but had flights at odd times and they were so kind and adapted to our needs and requirements with a warm and helpful attitude. I would return with no hesitation and have already recommended to a number of my friends...", "Date": "June 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Great hotel, great location, would definitely go back!”", "Author": "HappyFroggy", "ReviewID": "UR31685601", "Content": "Really enjoyed staying at Hotel Murmuri. It's extremely well situated on Rambla de Catalunya, within walking distance of plenty of tapas bars/cafes/restaurants/tourist attractions (la Sagrada Familia is a 20-minute walk) and there's also a tube station just round the corner. Rambla de Catalunya is really pleasant as it has a pedestrian area in the middle where all the bars and restaurants have their terrace. The hotel bas (Bar Marfil) has a good atmosphere and lovely cocktails! The restaurant looked nice but we didn't end up eating there (too many tapas bars and local restaurants to choose from in the area). The hotel has no fitness center (really not a problem as far as I was concerned!!) but if you want you can use the facilities in the Majestic hotel just 5 minutes away. I'd booked a Superior room and was not disappointed. Quite often the photos that hotels put onto their website are not quite representarive of what you get but in the case of Hotel Murmuri I got exactly what the website showed: a bright, spacious and stylish room with plenty of gadgets (iPod docking station, ambiance lighting in room and bathroom, flat screen TV etc...). Bathroom facilities (and size) were excellent, and everything was very clean. As we were going for my boyfriend's birthday I'd ask them to get a bottle of Cava ready in the room. They rang me up the day before to confirm time of arrival and we found the Cava perfectly chilled when we got there. Front of House staff very helpful and polite. Breakfast buffet was also very good in my opinion with a decent selection of pastries, bread, cheese, cured meats, fruits, yogourts, omelettes etc... Shame that on day 2 the waitress in charge looked like she was having a bad day and was not exactly welcoming, but that really didn't stop us from enjoying ourselves!!! In summary, had a great stay and would definitely go back to Murmuri again. If you manage to book early enough you also get really good rates for a cit like Barcelona (the superior room with breakfast was 150 euros a night, well worth it!!!). Enjoy your stay in Barcelona, it's a FANTASTIC city!", "Date": "June 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Day 1-4 of our Honeymoon In Europe”", "Author": "garth1968", "ReviewID": "UR31012372", "Content": "We arrived from Boston and found the hotel charming. this was the first stop of our 4 stop European honeymoon. We had booked through the hotel manager directly and all went very well considering the previous claims from someone else in the reviews. The hotel rooms we had booked, a privilege room, was big by european standards and had a private terrace/balcony with a partial view of Sagrada Familgia. Great for late night wine! Housekeeping was a bit unlike other hotels of this standard as we were told we could not get turn down service after 9pm on a Sunday night? Also, on another night we asked for the service and did not get it at all. The concierge serivice was so-so. At times excellent, but when we asked them for a local place to grab a slice of pizza, we ended up getting sent on a 2 mile search to a place that closed 25 minutes earlier. I believe if you are going to charge these prices, you should at least make sure you are sending clients to restaurants that are opened and close by! The Wifi was weak so we had to settle for an ethernet cable given to us by the hotel. Breakfast was so-so as well. Eggs/ meat was an extra charge and a toaster was not in sight? All in all, the hotel was in a great spot, is charming and has potential to be a dynamite place. It was also, very clean and the showers were great! With a few attention to details this could be a much better place to stay. Regardles, we enjoyed our stay very much and look forward to coming back. Make sure to go over the the Majestic Hotel ( their sister hotel) and to the top where there is a bar at night and an unbelievable view of the Passeig Gracia.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pacific Grove, California", "Title": "“Perfect small hotel and location for visit to Barcelona”", "Author": "fpanda", "ReviewID": "UR30599149", "Content": "Trendy design and decor, small hotel with wonderful restaurant and a Tapa's bar. Good breakfast buffet. Several blocks away is the sister hotel - the Majestic on Passeig Gracia which has roof top pool, bar and spa, and downstairs gym to which you have access. Murmuri is convenient to shopping on the Gracia...as well as close walks to the Pedrera and about 10 blocks to the Segrada Familia. Around the corner from the Murmuri is the Mauri, one of the best pastry shops in town. A signature dish in the bar at the hotel is the Baby back ribs in Chocolate sauce...not to be missed. The bar in the late afternoon was a gathering spot for locals. Our room came with a balcony.....perfect for a glass of wine and recap of the day. Staff very friendly and helpful. Avoid the old part of town on Las Ramblas....pickpockets abound!", "Date": "May 23, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "new york city", "Title": "“Livid”", "Author": "newyorkold", "ReviewID": "UR30580701", "Content": "Just one word, LIVID. We just arrived in Barcelona and were totally screwed in a bait and switch by hotel murmuri. Despite having made the reservation six months ago and having confirmed it last week, we arrived and were given a lame BS excuse that the computers had 'lost' our reservations (which is absurd and probably impossible). Instead of contacting us or rejecting our reconfirmation, we had to fly across an ocean to get screwed in person. Instead of a cute boutique hotel on a quieter street, we were given a really terrible, dirty room in a stuffy,charmles, Marriot-esque hotel affiliate with a view of pipes on the charmless, noisy Passeig de Gracia. The staff have done nothing to rectify the situation and have insultingly persisted in insisting that we're actually in a nicer hotel. I would not recommend this hotel under any circumstances. For your 'understated hipster hotel' experience, I would urge anyone to look elsewhere.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Netherlands", "Title": "“fantastic hotel”", "Author": "naat61", "ReviewID": "UR30502864", "Content": "i like to recommend this hotel because it's a beautiful place to stay... nice employees, great room with clean sheets and towels everyday, super restaurant and the breakfast was very good. the lounge is also very nice... so next time were off for Barcelona.... MURMURI is our place to stay!!!!!", "Date": "May 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Excellent. Modern, Clean, and Very Comfortable”", "Author": "mikeyp626", "ReviewID": "UR29707389", "Content": "My fiance and I stayed at the Murmuri for 3 nights while we were in Barcelona. We were very impressed as it had a boutique feel but also had the comfort and luxury of a 4 star hotel. Just a little background on us for some more color. We like to travel and typically only stay at 4+ star hotels. Currently in this recession we are able to get great deals and Murmuri was no different. We live and work in NYC, so we enjoy the finer things and are willing to pay a little more to have them. OKAY, now for the review. First off, the place is small and has a boutique feel. The front desk/concierge was very helpful and friendly and allowed us to check into the hotel when we got in which was around noon. The room was good sized for two people and had all the amenities that we would expect from a 4 star hotel. The bed was clean and comfortable and the bathroom was well appointed and had a great shower (pressure/rain-like head). Also, one of the features I liked the best was the ambient lighting. You could choose from Ambient, Relax, Welcome, even TV mode. There must be something like 10-15 lights in the room that are programmed to dim and brighten with a touch of a button. It was a definitely a nice touch. I really enjoyed my stay and it was a nice change of pace from the cookie cutter 4 star hotels like the Marriott, Hyatt, Westin, etc. Don't get me wrong, I really do like the Westin, but it was a nice change of pace. Breakfast was included with the room and had everything you would want from a continental breakfast. Fresh fruit, croissants, fruit juices, cold cuts, cheese, small pastries, etc. Overall, I had a wonderful stay and would definitely stay at the Murmuri again if we ever went back to Barcelona.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“nice, modern hotel”", "Author": "anutaNY", "ReviewID": "UR29262593", "Content": "The hotel was a nice, quiet hotel just a few blocks off most busy Barcelona streets. The rooms were clean and roomy, and while originally we were given two single beds by mistake, the next morning we were moved to a double room with minimal hustle. The rooms were very clean and modern but the light switches had only digital controls and were counter-intuitive. The complimentary breakfast was excellent. Although we did not eat at the restaurant, few drinks we had at the bar were great if pricey. There were few things that did not live up to our expectations. There was no free wifi, and the third party wifi service that was available was very expensive, around 8 euros for 45 minutes or 15 euros for inseparable 24 hours; on top of that it was painfully slow. It felt like nickel-and-diming considering the price of the room and the negligent cost for actually providing this service. Also during our stay the water system had to be repaired so we could not take showers or otherwise use the water for anything but flushing from 10a.m. to 5 p.m.; the next day there was also some scheduled power outage. While the hotel had no problem communicating with us via email over some billing issues, they did not bother to notify us about these scheduled repairs until our check-in, and did not offer any compensation for the inconvenience.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Jose, CA", "Title": "“We loved this little hotel!”", "Author": "xntrc2b", "ReviewID": "UR28953681", "Content": "The Murmuri has a wonderful location at the 'top' of the Placa de Catalunya. Its quiet, charming, and amidst great shops and bars/restaurants. The location is perfect for a short walk to the hop-on-hop-off bus, some of the greatest Gaudi sights, and a little longer walk to the hustle and bustle of the rest of Barcelona. The staff was more than friendly and went the extra mile towards being helpful. The breakfast included with the room rate was wonderful. The rooms are clean, modern without being cold, and very comfortable. We would absolutely stay in this hotel again without even researching other places to stay. The hotel is fairly new and there were new employees that were 'just catching on' but it was never a problem. Just make sure, when you ask for directions, you have the name of the street and which corner you turn on . . .", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great Value, Great Location, Very Good Restaurant”", "Author": "Mecnyc", "ReviewID": "UR28576350", "Content": "My partner and I stayed three nights at the Murmuri. The room was small and clean. The shower had a faint odor of mildew--nothing serious. There was the smell of cigarette smoke in the hallway a few times, but not in the room, which was good. These are the only negatives--the rest was great--nice design of the hotel and rooms, elegant bathroom, cool lobby and elevator. Smoky bar, but the restaurant was isolated from this. We had a great breakfast there every day, and ate dinner there one night as well. For dinner, the menu is thai/continental fusion, which is probably not what people go to Spain to eat, but it was DELICIOUS. For 146 Euros, breakfast included, it was a superb value compared to other four star hotels we have stayed at. And the location couldn't be better--right by the subway and on the Rambla Catalunya. Staff friendly, helpful, and completely fluent in English.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "greater manchester uk", "Title": "“pleasant stay”", "Author": "christine2008", "ReviewID": "UR28417317", "Content": "stayed here for 4 nights Thurs to Sun. Stayed in a privilege double/early booking offer. For this you pay up front for the room at a preferred rate and cannot cancel the booking. Included in this rate was breakfast. Firstly the hotel. small hotel in a nice part of town. Thursday night was very quiet but Friday and Saturday there was some screaming and shouting in the street, goodness knows how people cope with sleep in La Rambla, it must be a nightmare. Staff were pleasant and helpful. All bedrooms either look out onto placa de catalunya or a side street. We stayed in room 210 which looked out onto placa de catalunya and had a small balcony with 2 chairs. The room was on the smallish side but adequate, but this was perhaps due to the extremely comfortable HUGE (approx 7' wide) bed. There were two full length mirrors and you could choose from seductive lighting or full room lighting. There was a large flat screen TV with BBC and ITV channels and news channels. The bathroom was average size, lots of towels and the White Company products. There was a fairly powerful shower over the bath. Unfortunately the bath was a disaster. Being a shower perswon myself this is not usually a problem, but after hours of trumbling around Barcelona, a nice long soak was on the agenda. I sat in the nice deep bath lay back and nearly drowned. It was totally impossible to lay back in the bath without sliding under the water and drowning. The same happened when my husband tried the bath. I ended up laying on my stomach - I kid you not! The bar is very comfortable with seductive lighting and a nice atmosphere. There were people of all ages coming and going. Unfortunately the drinks were very expensive 11 euros for a coctail, 5.50 euros a glass of wine, 6.00 euros for a spirit plus 3 euros for a mixer. Perhaps not too bad when the exchange rate is better. After 2 nights dining in one average restaurant and one terrible restaurant, we decided to try the hotel restaurant which is thai/asian cuisine. The service was excellent, the portions very small, the food extremely tasty, and the price for 2 approx 100 euros (including a bottle of wine at 18 euros (the cheapest). This by comparison to other nearby restaurants was about average, many other restaurants were much much more. The breakfast was good - plenty of choice - cereal, fresh fruit, yoghurts, pastries, meats and cheese, toast and eggs of any type - scrambled, boiled, omlette, etc. but no other hot choices except bacon. This was included in my booking but i would not pay 20 euros for it. all in all we were very satisfied with the hotel, would recommend it and would go back if we could get a good deal.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Nottingham", "Title": "“Would definitely return and recommend to family & friends”", "Author": "StrumpetNottingham", "ReviewID": "UR28341614", "Content": "We had a fantastic stay at Murmuri at the begining of April. We were lucky enough to be upgraded to a room with a private balcony but unfortunately the rain spoilt every chance we had of using it which was such a shame. The room was perfect and very clean & comfortable. The staff were always curteous and very helpful. We asked for advice on a few things, such as a good seafood restaurant in the area, and were never disappointed. We only had breakfast at Murmuri (which was delicious) and didn't end up using the restuarant but that was only because we wanted to explore. We did go to the bar a few times and enjoyed well made cocktails, which were very expensive by British standards, but then that was down to Barcelona itself and not the hotel. Overall we found Murmuri to be a very efficient, comfortable and chic hotel which we wouldn't hesitate to return to and recommend to any of our friend and family.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“Spectacular location, beautiful hotel”", "Author": "ArthurLondon", "ReviewID": "UR28072532", "Content": "Just spent 4 nights here with my family. Location is great. Its 10 minutes away from all the noise and action of the tourist areas. Located in the heart of the most upscale residential area with great shops and restaurants. Around the corner from famous gaudi apartment. Connecting rooms perfect for families. Its a style boutique hotel which unfortunately means service is a little off. Rooms are a little tight but well laid out. Small closets, nice bathrooms. Really good breakfast and active, smoky bar. AC is quiet and bed is very comfy. They don't keep a corkscrew or ice bucket in room. All around you can buy great cheap wine but hotel makes it hard to drink. Must wait for someone to bring up the one cork screw to use. Plus must bring up wine glasses and ice to chill. Only complaint. Concierges not as good as more full service hotel.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Elegant hotel”", "Author": "jgodic", "ReviewID": "UR27281935", "Content": "My husband and I spent 3 nights here on vacation. Overall we were fairly pleased. It is a very attractive hotel, the decor is pleasant and understated. Some of the design aspects leaned towards annoying (light switches), but overall it worked. Our room was fairly small, but we were comfortable. It was spotlessly clean. The location is pretty good, far enough out of the fray to be relaxing but close enough to walk to most of the sights. Although the people at the front desk were very friendly, they gave us a poor recommendation for dinner our first night (Tragaluz, around the corner, avoid at all costs) and botched our dinner reservations another night. Breakfast was excellent. I'm not sure why wi-fi wasn't included, it was quite pricey, and the room rates aren't exactly cheap to begin with. If I were to visit Barcelona again, I would probably check out Casa Camper or another hotel. Murmuri was fine, but didn't blow me away.", "Date": "April 2, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Dorset", "Title": "“Excellent in every sense”", "Author": "bee21", "ReviewID": "UR26391527", "Content": "My partner and I stayed at the Mur Muri this March. My partner surprised me with a trip away and we had a fantastic time. On arrival the staff were friendly and approachable. Nothing was too much trouble. The entrance is stunning and its individual style is classy and unique. Our room was spacious and stylish with an immaculate bathroom. Towels and bath robes were provided along with toiletries and a make up mirror. The terrace and our balcony were immaculately presented in fitting with the rest of the hotel. The breakfast in the hotel was fantastic. there was a wide spread offering almost anything you might fancy. Once again the staff provided an excellent service. My partner proposed to me during our stay and we have left having the most treasured memories with the hotel playing a massive part of our enjoyment. I would recommend this to anyone.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new hampshire", "Title": "“Wonderful boutique hotel”", "Author": "madge21", "ReviewID": "UR24633876", "Content": "My daughter and I stayed at this hotel for seven nights in February. The MurMuri is a lovely hotel. I had requested an early check-in since I arrived in Barcelona after an overnight flight. My room was ready and waiting when I arrived at the hotel. The reception desk staff were outstanding - always friendly, pleasant, helpful. All questions were answered fully, and if the staff member wasn't sure about something, they would go online to look it up or check with another staff member. The room we were assigned was on the 6th floor (top floor) and had a terrace off of it. It was quite nice as was the bedroom. The room was not huge, but there was plenty of storage area for clothes and suitcases. The terrace had two chaise lounges on it and an umbrella table with chairs. There is also a larger terrace that is open to all guests on the rooftop. The bathroom was very large, modern, with a deep tub and shower and, a fully closing glass sliding door, something you don't often find in Europeon hotels. The room and bath were very clean and modern. Our room came with a continental breakfast which was about the same each morning. However, I never tired of it as it was quite good. It offered cereal, a choice of five or six pastries, sliced cheeses and meats, fruit juices, coffee and tea, and the very freshest and delicious fruit. The sliced fruit included kiwi, pineapple, watermelon, musk melon, oranges, grapefruit and whole strawberries. The fruit was top quality. I enjoyed the breakfast very much. There was an option for ordering off a small menu if you preferred a larger breakfast with eggs, etc.and I assume this was at extra cost. My daughter and I never felt the need to do so as the continental breakfast was so lovely. The continental breakfast was available from 7-11am so it gave us plenty of time to eat even when we slept in a little later. Because this is a smaller hotel, there is not a large lobby with sofas and chairs so it is not a lobby in which you gather there to meet, chat, or read. The reception area is somewhat long and narrow and there is only one sofa against a wall that was located right by the front door. It seemed to be a place to sit for only a short wait. The other thing I should mention is that there is a flat screen TV mounted on the wall in the bedroom, but I couldn't locate any English speaking stations on it. The hotel was very quiet and I did not hear much street noise. It is located in Eixample so it is a bit of a walk to Catalunya square, maybe fifteen minutes or so, depending on your pace. We thought the hotel was in a good location and we appreciated being in a quieter area, but within walking distance of much of what we wanted to see and do. There are many good places to eat in the area, and there is a Metro stop a short walk from the hotel. We have stayed at many hotels over the years in many areas of the world and this hotel was quite lovely. I will definitely stay there again when I return to Barcelona. I booked there because of reviews I read on Trip Advisor, and I am so glad I did. I think the hotel staff sets the tone for how you feel about a hotel, and this staff was surely outstanding in both making us feel welcome and always being helpful and pleasant. Diane", "Date": "February 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great choice!”", "Author": "Philleas_Fogg_uette", "ReviewID": "UR23696352", "Content": "We had a great stay at this hotel in late December. Our superior room was even better than we expected. The room size was fine, the bed was huge and very comfortable, linen great, towels and bathrobes all brand new and fluffy and the bathroom was very large with great pressure and rain-shower head. The air conditioning was very efficient and quiet and soundproofing was excellent. Quality bath products (white company) where a nice touch and we also liked the ambience lighting. Staff are very friendly and helpful and made great effort to recover our luggage which was lost by Alitalia. It was great having someone to make several phonecalls a day to the airport, instead of ruining our vacation by making these phonecalls ourselves and getting stressed and agitated all the time. That's the kind of service that makes a quality hotel like this worth every penny. Apart from that we thought that hotel's breakfast was great with eggs very well cooked to order and many other items of good quality. Plus we thought the location of the hotel was fantastic, and the area around it very upmarket and safe with lots of good restaurant options. We tried Botafumeiro on our last night (recommended by the concierge) and what a great choice it was! We would highly recommed this hotel and we will choose it for our next stay in Barcelona!", "Date": "January 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect location”", "Author": "lex2901", "ReviewID": "UR23565555", "Content": "We stayed at the Murmuri during New Year's week. Perfect, central location near the Passeig de Gracia. Great shopping area and Gaudi sites all nearby. There is an AMAZING tapas restaurant just a few blocks down - Cerveceria Catalan. We ended up eating there 3 days in a row it was so good. The hotel itself is small but stylish. We booked the basic room category but realized that it was too small. Extremely small. We asked to change rooms and were given another room, slightly bigger. Both rooms were nicely furnished and very modern. The bathroom features a rain shower and modern decor, as well. Very nice and comfortable stay. I would recommend to others.", "Date": "January 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“very nice”", "Author": "jjpinney", "ReviewID": "UR22420774", "Content": "Loved the hotel, we were upgraded on our 2nd night to a very nice room. The only negative is that it is a few blocks from Las Ramblas. Very quiet and nice.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Galway", "Title": "“Fantastic Murmuri oozed class”", "Author": "mickrick1", "ReviewID": "UR21943667", "Content": "My wife and I stayed at the Hotel Murmuri for 4 nights in early November and what can I say. When we arrived we were shown to our rooms by a smartly turned out and friendly receptionist. The room itself although compact was exactly what we wanted. The bed and furnishings were very impressive and the bathroom was full of mod cons. The shower had excellent pressure and there were more than ample towels. Toiletries were by Moulton Brown which was a nice addition. The location is just perfect - near enough to all the action but far enough away in the evening. I would highly recommend this hotel to anyone and will definitely stay here again if I am back in Barcelona.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "miami, fl", "Title": "“outstanding value”", "Author": "barranqtraveler", "ReviewID": "UR21901100", "Content": "This is a top bang for your buck. Great location, just half a block from fashionable passeig de gracia, where most of the luxury stores and hotels are. Standard rooms are a bit on the small size but otherwise great.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Very nice hotel in a very nice city”", "Author": "ka2Europe", "ReviewID": "UR21643720", "Content": "I liked the rooms and the location a lot. This is a very well kept hotel - not very cheap but the quality was very good. Everything was clean and nice, and i liked the details like Molton Brown toiletries etc. The decor of the room is teh standard Euro-almost-luxury stuff, nothing suprising, but nothing problematic. Apart from the staff at the bar being slightly slow (but this is Spain!), i have not encountered anything negative and would recommend it.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South East", "Title": "“Great Style , small rooms”", "Author": "p_c37", "ReviewID": "UR20914794", "Content": "Chose this hotel after seeing a review of it in a magazine , and certainly the location and decor can't be faulted . Modern , minimalistic style , simple and yet luxurious . Room was lovely , but small , though I suspect this is the case with many of the central hotels .Bathroom stylish , but shower not as powerful as you would expect from a recently refurbished hotel . That said , beautiful basin, Molton brown toiletries , lovely fluffy towelling robes and slippers , plenty of towels. nice flat screen tv in room etc . 2 minutes walk from the Diagonal metro station , and on a tree- lined street with plenty of outdoor cafes . Staff pleasant and helpful when asked , silent otherwise ! Had an excellent meal in the restaurant , a little pricey , but the service was perfect , and food good . Reasonable portions but not for those with a hearty appetite! Great location for a pleasant walk to all the central attractions , including La Rambla ( main street) . had a\" Barcelona card \"which covered all travel for the trip , including train from the airport to the city centre . Also gives small discounts on some attractions . definitely saves money if you are planning on covering a lot of ground , but probably not worth it for only a day . 3 day one definitely good value . Final note - BEWARE PICKPOCKETS ! My bag was stolen from by my feet in a restaurant , and the police station was full of people who had suffered the same fate . Obviously this is a problem in most cities , but it is certainly rife in Barcelona , and I have since spoken to countless other people who have had bags and wallets stolen there - it certainly seems to have a much higher level of pickpocketing/ mugging then any other City i have visited. Would definitely stay here again - but double check your room request - I requested a kingsize bed on booking several weeks in advance , but was still given twin beds , and was unable to switch as hotel fully booked .", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“A reasonably priced boutique hotel”", "Author": "travelermiddleclass", "ReviewID": "UR20679275", "Content": "Wonderful location, nice rooms, good value for the money. Wonderful location: in an upper class neighborhood, walking distance to Gaudi's buildings, Barri Gothic, and El Born. Near low key fine dining (read the nytimes.com travel article on creative plates at a good price), breakfast is easy -- go next door to Cafe Mauri (a Barcelona institution for locals) Nice rooms: brand new, real queen size beds (not the 2 beds pushed together you tend to find in Europe), nice furniture (not the cheap stuff that you find in the budget modern hotels). Only negative comments: The bathroom could have had better ventilation, a musty smell bothered my wife. The hotel is new and lacks the concierge team with connections to get you into places that are difficult to reserve.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Beautiful Boutique hotel. Great location”", "Author": "tomfrombkk", "ReviewID": "UR20669601", "Content": "Came to Europe with my wife and spent 4 nights at the Murmuri. This is a fantastic hotel. Nice decor and great service which, for us leaving in Bangkok, means a lot. The quality of the fabrics, the sheets in the bed, the lighting with different ambiance, the overall atmosphere is relaxing and fresh. The service is also excellent from the reception to the maids, the bar and the restaurant. Everything was perfect. We were happy to hear that the famous thai chef Ian Kittichai took over the cuisine of the restaurant which is a subtile mix between mediterranean food and asian cuisine. You have to try it if you get a chance to have a table. We had great recommendation for dining out from the reception and located on Rambla de Catalunya, you have a lot to do around. Location is perfect, not right on the Barcelona buzz of the Ramblas but not far either (10 minutes walk). You do not want to stay there anyway. The location of the Murmuri is far more better, next to the prestigious and elegant Paseo de Gracia and next to some famous Gaudi houses. Our trip to Barcelona was great but our stay at the Murmuri made it fantastic. Stay there!!!", "Date": "October 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“5 STAR IN EVERY ASPECT”", "Author": "Jx2000", "ReviewID": "UR20298000", "Content": "Starting in April 2008 we booked 15 rooms at the Hotel Mur Muri in September for a 4 night stay for 30 people on an Incentive Trip. From the very first moment until check out I have not had one problem with the service provided by this hotel and in fact it leaves many of its competitors far behind: To summarise: The Hotel: The hotel is a newly opened boutique hotel that offers a real and viable alternative to any 5 Star Hotel in Barcelona and with its elegant styling and modern conveniences set out throughout it goes well beyond many expectations that you may have. The Staff: Impeccable is probably the easiest way to describe them, on hand 24/7 to ensure that your stay is what it is meant to be, perfection, front of house, bar and restaurant, cleaning staff and management were all great throughout the stay. The Service: We had 30 people all wanting different things from Barcelona during their stay and the service that the Hotel Mur Muri provided ensured that these expectations were delivered. The Restaurant: We had meals here on two of the nights and also breakfast every morning during the stay, excellent cuisine that is of the same standard of what has been set out above. The Bar: Class, World Class, brilliant service and great drinks. The Rooms: Designed with both flair and intelligence, simple touches such as the I-POD docking stations made for a great stay. On departing many of the Guests commented on wanting to bring the bed and pillows home with them as they were so comfortable. The Location: Ideal, close to everything but set in a calm street with little or no noise pollution I have organised many incentive trips for many people but the Hotel Mur Muri will set the standard for many years to come, brilliant service with the right attitude. Thanks to all the Staff at the Mur Muri, Edouard the General Manager and Raul the Group Sales Manager, you all should be very proud of what you have achieved. Recommendation: I recommend if you are in Barcelona that you don’t miss this Gem Alan Bateson", "Date": "September 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Heavenly Murmuri”", "Author": "BobfromNYC", "ReviewID": "UR20084841", "Content": "Beautiful hotel in great location, in the Rambla de Catalonia. Easy walk to anywhere and a just a block from Gaudi Pedrera. We just spent 3 nights there and loved it. We had a very nice room with a little terrace. The staff was very friendly and professional. We had great restaurant suggestion from the concierge during our stay but also decided to try the asian restaurant that the hotel offers. It was fantastic. It is Thai/japanese with a spanish feeling. Interesting. Overall our experience at this hotel was great and recommend it to anyone.", "Date": "September 15, 2008"}], "HotelInfo": {"Name": "Hotel Murmuri Barcelona", "HotelURL": "/ShowUserReviews-g187497-d877814-Reviews-Hotel_Murmuri_Barcelona-Barcelona_Catalonia.html", "Price": "$212 - $430*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Rambla Catalunya 104</span>, <span class=\"locality\"><span property=\"v:postal-code\">08008</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "877814", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a4/34/a434e48a6b82980c91d39145d22a1d276large.jpg"}}