{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Katwijk, Netherlands", "Title": "“Fulfilled our primary requirements”", "Author": "Triguena81", "ReviewID": "UR128231824", "Content": "Downsides: roomkeys not working properly and having to be reactivated almost daily, bugs around the pool, breakfast was minimal, transportation to and from the airport would've been handy. On the up side: the location is great with a bus stop right in front, many restaurants and shops on walking distance, shuttle service to multiple parks, simple but quiet rooms (we slept very well), microwave and fridge in the rooms which is a real plus, friendly and helpful staff (including the cleaning lady and shuttle driver). This last point was particularly pleasant to us being from Holland and needing more information than a local guest would, so we had some nice chats with mr. B. (front desk) and felt right at home. All in all, the good definitely trumps the 'bad' :)", "Date": "April 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Not to good - especially breakfast area”", "Author": "Bella1202", "ReviewID": "UR127987350", "Content": "The price of the room was good, but I'm not so sure worth it. The front desk manager Cheryl was very nice. The room was ok, but the bathroom didn't seem so clean. The breakfast room was terrible. When we went down there it was so overcrowded. Only 4 tables and lots of people standing in line. There was no coffee, cups, or cereal. There were 4 people standing behind the front desk. You would have thought someone would have re-stocked the breakfast area. We stood there for a few minutes to make a waffle and then turned around and left and went to a restaurant for breakfast. They charge a fee for internet and shuttle. We never used either one. We have stayed in many motels and I am not a picky person, but I think it could have been a little better, especially the breakfast area. There are tons of motels in the area. I'm not sure I would stay there again.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Never again!”", "Author": "Mrs B", "ReviewID": "UR127870099", "Content": "I had actually booked a 4 night stay with a resort in the Celebration area and decided to stay another night in Florida. Unfortunately, I was unable to add an additional night due to resort overbooking the hotel. I went online and searched for a reasonable one night stay elsewhere of which I had booked on Choicehotel.com. Online, the price advertised as $49.99 and somehow the charges totaled to almost $70 upon checkout. The bathroom was filthy with hair all over the floor. I did strip down the beds to search for evidence of bed bugs but luckily there weren't any. I did notice that there was splashes of blood on the side of one of the mattresses. I started to wonder if this room was a part of a crime scene and checked the carpet for blood as well. My kids were not comfortable here at all and I didn't blame them not one bit. All I can say is NEVER again and most definitely, that room was NOT worth $70. More like $7 if you ask me. Not to mention they did not keep the breakfast bar stocked being that it was spring break. This property needs renovation and better service.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CHTAEAUGUAY QC", "Title": "“Great quality at a terriffic price”", "Author": "THE-HAWK2_0", "ReviewID": "UR126915260", "Content": "I am a cancer survivor and for the past 7 years I have been travelling to Kissimmee to enjoy ten days of golf.We have stayed at various locations in Kissimmee and finally found a motel that suits our needs quite nicely. The staff and management can not do enough to make sure our stay is a pleasent experience,if at some point there is a situation that requires addressing the maintenance staff are there to rectify the problem very rapidly. All we had to do was bring it to the attention of the front desk and it was taken care of. I have read some of the negative comments and quite frankly I find that most of these comments are undeserved.With any business there might be some minor problems but by asking the front desk to look into these they can be addressed.It is easy enough to write a negative comment if you did not bring it to their attention. I have been staying at this motel for the past three years now and I look forward to going back each year. the whole staff from management to the workers bend backwards to make sure your stay is pleasent. Great value and terriffic people. Keith Parker Chateauguay Quebec Canada", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Whitby, Canada", "Title": "“Econolodge Inn and Suites, 4669 West Irlo Bronson, Kissimmee, FL”", "Author": "lovebarbiegirl15", "ReviewID": "UR125763246", "Content": "This motel was quite nice. A little pricier and there are some standard fees that you must pay which add to the price eg. $2.95/day for InterneT (whether you use it or not). There is a computer in the room but I didn’t like it and preferred to use my own. It is clean, has a pool and a better breakfast – this one has a waffle maker! The mango juice is really a drink not a juice but they did have some fresh fruit. There are guest laundry facilities. If there is a problem, the maintenance guys are available pretty quickly. Staff was friendly and helpful. Breakfast area was always pretty busy and small and sometimes items didn’t get replaced very quickly. There was also a Breakfast Garden with some picnic tables. For 6 nights our room was $224.94 but State Tax, County Tax, Hotel Services Fee and Internet Access added another $81.00 to our bill. I used the laundry facilities and they were adequate. The machines told you how long each cycle was which was helpful. No coffee maker in our room. Bed was a double and I did not find it overly comfortable. Room had a couch. There is also a shuttle to Disney which we did not require.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“I Highly Advise Against It!”", "Author": "RobynMay28", "ReviewID": "UR125525500", "Content": "If your used to higher class hotels, or even average, don't come here. I had a king size bed and the bed was so hard and uncomfortable it was litterally the worst bed ive ever slept in, in my entire life. It made my hips ache, and my back hurt, and when I got up to check it I found I was pretty much only resting on springs, there was no padding at all. I had to walk down to my mom's hotel room and sleep in the double bed, because for some reason the mattress there was normal. They claim they have free wi fi but it would not connect at all, even though I tried all the different channels for it. When I called the front desk the guy told me it must have been something wrong with my computer and he didin't know anything at all about it and couldn't help me. Poor customer service! This is why my computer can connect to all other Wi Fi connections, just not his, because MINE has something wrong with it? The couch that was in my room was not really a couch, it was a sofa bed with barely any support or padding. When I sat on it I sunk all the way down. The phone was a wreck. I tried calling my husband and it kept up with a busy signal even though I knew he was waiting for my call. I tried calling later and it said it was the wrong number, and again later and it wouldn't dial at all. Plus the phone was very old and outdated and you had to push the numbers in really hard. I knew I punched the numbers in right but the phone had it's own ideas of when it wanted to work. My alarm clock was plugged in but was not on at all and didin't appear to be in working order. The tall lamp near the couch had it's handle totally broken. The good- The air conditioner worked well, hotel was moderatly clean, sink was nice, shower and bath worked very well with hot water, Decent working TV The man at the desk was nice and friendly .Over all unless you live in a shack, and expect no less, don't go here unless your desperate.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Jose del Cabo, Mexico", "Title": "“It's the first time I stayed here...”", "Author": "carmen r", "ReviewID": "UR124627321", "Content": "I stayed here and I liked it very much. When I come here next year, I will stay again here with my family. Thanks for every thing. It was pleasure.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Not Bad for a Budget Stay...”", "Author": "Dave677", "ReviewID": "UR124259721", "Content": "My wife and I had business to take care of in the area and needed a place to lay our heads for the night. The rate at this location was very cheap and was convenient for where we needed to be. The hotel is located near everything from food to stores as well as to a few attractions. The cleanliness of our room was acceptable for an older hotel. We always check the beds and bathroom upon arrival to any hotel and found them to be clean. However, the shower/tub was somewhat small. The in-room computer was not working either. The biggest downfall for us was when we came to the included continental breakfast which was over at 9am. My wife and I got there at 8:59 am. We were the last ones in line and were next for the waffle maker. The attendant stopped what she was doing, came from behind the counter, looked directly at us, and removed the waffle mix as we were about to make ours. WOW!!! I guess it that serious to not serve your guests at 9am. Otherwise, I guess I got what I paid for...", "Date": "February 7, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Surprise \"resort fee\"”", "Author": "n0rmanprince", "ReviewID": "UR123439058", "Content": "Inexpensive but shabby motel, and a \"surprise\" $9 per day \"resort fee\" on top of the rate agreed upon at the time of the reservation. The dishonesty leaves a sour taste.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Sarasota, Florida", "Title": "“You get what you pay for!”", "Author": "travelers22011", "ReviewID": "UR123220274", "Content": "If you want to book this hotel, just remember, \"you get what you pay for\" ..... cheap prices, cheap room. Breakfast was \"okay\" ..... 1/2 hour before the END of breakfast time, there were 2 pieces of bread ..... no coffee from about 8:30 to 9:30 a.m. ..... \"it's still being made\" ! Coffee pot in our room had not been cleaned for ???? days ..... yuk! Since we arrived at 10:00 p.m. and were out of there by 9:30 the next morning, it was \"do-able\" ... probably would not stay there again, however. Orlando has many, many nicer hotels!", "Date": "January 17, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Cary NC", "Title": "“Hotel should be reported to the Health Department”", "Author": "MissC1219", "ReviewID": "UR122940779", "Content": "This hotel should be condemed. The place was filthy dirty. Semen stains on the bathroom walls. Dirt and grime all over the walls. Mold and urine in the bathroom. The pictures in the ad of this hotel do not reflect the curent condition. The toliets didn't work, nor did the hot water. The hotel staff was rude and the manager still has not returned my calls. The grounds of the hotel were just as dirty as the inside, trash, dirty clothes and other items liter the halls and stairs. This hotel was a living nightmare!!!!!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Don't Stay Here!!”", "Author": "32travel32", "ReviewID": "UR122463361", "Content": "When I first arrived, there were homeless people and the employees little kids playing in the parking lot. I got to Orlando a little early. I wanted to check in about 10 minutes before their check-in time. They wanted to charge me a $20 early check in fee.....for 10 minutes!!! So I told them I would come back in ten minutes. I went down the street, got something to eat, and came back to check in. They make you pay a mandatory $10 resort fee. When I got to my room, it was filthy. The bathroom had all kinds of nasty stains all over the walls and I don't even want to think about what they were from. There was no TV remote in my room, so I right away went down to the office and asked if the room was supposed to have a TV remote. They told me that a maid would bring one to me shortly which she did. I later discovered that the hotel charged my credit card for a missing remote. The breakfast area was very, very cramped. I got there about 15 minutes after they started serving breakfast, and they were out of most everything. The staff was all standing outside the office smoking and ignored everyone inside. I will NEVER stay here again.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“\"Resort Fee\" ripoff”", "Author": "norman586", "ReviewID": "UR121568901", "Content": "Beware of the extra $9 per day \"resort fee\" - for \"extras\" such as flushing the toilet - whether you avail yourself or not. Why isn't this fee included in the nightly charge? Is it to fool you into thinking the rate is a bargain? For the nightly rate, the hotel was a good deal - basic hotel for a budget price. Add this fee and it is a ripoff.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nasty Hotel”", "Author": "Robert E", "ReviewID": "UR121418624", "Content": "Stay away from this hotel. It should be reported to the board of health. It is disgusting. The bathrooms are filty with mold and urine around the rims. The bed is old and hard and there might be bed bugs. The tv is old and the remote was broken. They charge for computer use (highspeed) but this is the slowest computer I've ever used. The doors are full of dirt and the entire experience was terrible. The kitchen area where food is served is plain nasty. The seats are stained and i wouldn't feed anyone pet let alone a human in that dining room. This hotel is not worth the price or anything. The front desk staff was so busy swipping my card before I had a chance to express my viewpoint. This is a terrible hotel. Stay away.", "Date": "December 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "4", "Service": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“More variety”", "Author": "Guest R", "ReviewID": "UR120198731", "Content": "You guys have good rates. I was travelling for pleasure. I decided to stay at this hotel because I found it on the internet.", "Date": "November 5, 2011"}, {"Ratings": {"Location": "3", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Dont bother, much better place around”", "Author": "Kimba005", "ReviewID": "UR118042825", "Content": "Previous to checking in we had seen some reviews in regards to the smoke smell in the non smoking rooms. We thought it couldn’t be that bad and decide to stay. Upon arrival, the maid simply removed the ash tray from our room to make it a “non-smoking” room. You are not able to open the window so the AC simply recycles all the smoke. EVERYTHING we had in the room needed to be cleaned when we left, it is very bad. Lady at check in was very rude and un friendly, however the man the next day was better. Continental break available and is ok, coffee, pastries and pink sugary things but only two chairs. Bus to theme parks, however it is NOT included and you pay extra upon arrival, also the hotel is first pick up and last drop off as well as takes about 1hr each way and the last bus leaves before the parks close. Some shops close by. Not the worst hotel, but many much better places around so i would not stay here again.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Washington, DC", "Title": "“Worst Hotel stay ever... STAY AWAY!”", "Author": "xyberq79", "ReviewID": "UR117744470", "Content": "Let me start off by saying... My standards are very low for a cheap hotel room. However, this hotel is by far the worst I've ever stayed in. We come to Orlando at least once a year for the past 10-12 years. I wish I had it to do over again and I would stay somewhere else for 4 nights. First off the hotel isn't Maingate it's more like 20-25 mins away from Disneyworld. It's close to alot of places to eat and a Super Target if you like that. The extra service fee's you pay there is a joke. They charge 5.64 per day service fee and an extra 2.95 a day mandatory fee for a computer in your room. The computer in the room (at least mine) did not even connect to WIFI and their is no printer. So this was useless. If you want a coffee pot you have to go to the front desk and ask for one because they are not in your room. You also have to go to the front desk every day to get coffee unless you run down the maid because they will not leave it. The free breakfast is a joke. You get the following.... Toast, some white donuts, a waffle if you make it and coffee or mango juice... That's your selection... The breakfast area is very small near the front desk and you can't even get in there. So your extra \"resort\" fee's are a joke!! Take the money you pay on resort fee's and this cheap hotel rate and do yourself a favor and get a better room closer to Disney on this same strip. As far as the actual room.... It is nasty! The walls are dirty and have like spilled juice or something all over them. The carpet is nasty and smells of musk and dog pee. The bed linens are dark to hide all the nasty stuff i'm sure is on it. The bathroom shower is full of mildew that hasn't been cleaned in awhile. Don't expect the safe to work because our's did for a bit and then had to call maintence to come and open it and then wouldnt lock back. They can get into these things afterall so I wouldnt trust leaving anything in them in this shady hotel. One night we had teenagers hanging outside our door at 3am yelling and screaming and drinking. Called front desk once... nothing happened... Called again to complain and front desk got attitude with us for reporting noise at 3am. Crazy! Oh and they have a swimming pool but, if the room is any indication of how they keep up that pool I wouldn't get into it. Positive things about room: Has working TV Frigerator, Microwave Really cold AC That's about it! In closing... Avoid at all costs! Try Master's Inn, Best Western Lakeside, Ramada up the street they are far better and have stayed there before with no problems.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Good location GREAT SERVICE !!!”", "Author": "CarlosTampa", "ReviewID": "UR116590287", "Content": "EconoLodge Maingate is a very good place to stay ,price is great ,rooms are clean and comfortable Service is great , Mike at front desk is very professional and helpful Don't wait to the last minute to get a room , is always sold out on weekends.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Marianna, FL", "Title": "“Cheap and it's obvious WHY”", "Author": "MrsMonk1010", "ReviewID": "UR115425334", "Content": "The room was a non-smoking room yet was stale with the smell of smoke! I was scared to take a shower because the bathroom was so dirty. There was no bolt on the door to make us feel safe and the bed sheets didn't even match. One was really soft whereas the other was a very rough blanket. The walls were very dirty throughout the room and the ceiling was cracked. There were hidden fees, but it didn't surprise me because MANY hotels have them now days. The computer in the room wasn't any sort of compensation for the dirty feel of the place. I wanted out of the room ASAP! We only stayed one night and I was tempted to just cut our losses and stay somewhere else, but we decided just to deal with it. We went out for a while and only came back to sleep. We got up and left at 5 am the next morning. I was just ready to get out of there. To be completely honest, it looks like it used to be a raggedy old hotel and they are trying to fix it up by putting computers in each room and microwaves and a fridge, but they aren't cleaning or making sure the bathrooms and doors are in working and good condition. The walls need to be SCRUBBED and re-painted to try and get the smoke smell out of there. I never even looked at the pool because it was raining.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Awesome price.”", "Author": "Funnguy", "ReviewID": "UR115386123", "Content": "I was here with my wife and was pleasantly surprised by what I got for the money. The hotel is close to everything and the room was very clean. I really liked the free breakfast, they have waffle makers, not something you normally see in a hotel at this price. Their staff was really nice, Cheryl and Michael made sure we had everything we needed. Even our maid, Sasha, made sure we were comfortable. We will be back next year. Thanks!!!!", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“very terrible motel”", "Author": "maherhanna", "ReviewID": "UR114921042", "Content": "a lot of bed bugs,carpet so dirty, no body change pillow sheets or bed sheets every day,bathroom is so dirty ,blood around ,blanket never cleaned 10 years ago, lady manager did not care ,not suppose to be a manager at all ,breakfast so bad ,it was a terrible motel ,i do not recommed it at all.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Palm Beach, Florida", "Title": "“Filthy, Disgusting!!!”", "Author": "catedratico02", "ReviewID": "UR111204875", "Content": "I would not recommend this hotel to anybody, the bathroom was full of mold, blood aroung the toilet the bathtub was unsanitary. Very nasty, Mike the assistant manager will lie to you with his best face very hipocrit!!!! stay away for your own safety.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "United States", "Title": "“Not very clean, not very friendly”", "Author": "IGO", "ReviewID": "UR110069406", "Content": "We stayed at the Econolodge because of the low price, but because of add-ons, it did not turn out to be a bargain. We dismayed at the dirty room, walkways and breakfast room. We would not recommend this hotel to anyone at any price.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Hidden charges, not a clean feeling”", "Author": "MommaBea", "ReviewID": "UR108816086", "Content": "I have never written a bad review before but this hotel warrents one. My college daughter and her friend choose this hotel because of its close location to the parks, they choose the Econo Lodge because of the ADVERTISED PRICE, they called that day and decided to take the room for 6 days. (They did not book a hotel because they were origionally staying with friends in the area but decided for the advertised price it would be worth the additional cost.) Upon payment they were charged an extra $9.00 hidden fee per night, they decided the breakfast will compensate for the extra fees; don't believe it; in addition the hotel also charges an extra $10.00 for weekend days. When they settled into the room they were uneasy about the cleanlieness and even cranked up the heat so they did not use the blankets; they felt the bathroom floor was unsanitary, and found hairs on the linens. They called to tell the desk they would not be staying any more days and they were informed that they were going to be charged for an extra day reguardless of the situation. So I called the front desk to inquire about pricing and checkout policy. The MANAGER, Mike, outright lied to me about the hidden cost until I told him I had read in the review about the extra cost, then he hesentantly admitted to the fact there was a $6.00 SERVICE FEE and a $3.00 computer FEE regardless if you use it or not. The hotel was unwavering and charged the girls an extra nights fee even with them checking out at 8:00 AM. They switched to Disney All Star for very little difference in final cost. The girls now feel a lot safer and cleaner. In addition the cost at the Disney hotels included free disney parking and ulimited Disney transportation and additional park usage hours to hotel guests.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“very pleasing experience”", "Author": "monstersb", "ReviewID": "UR105436368", "Content": "stayed here for 2 nights and I enjoyed myself. the guy that works there, Mike, was very helpful on things to do in the area. when I go back to Kissimmee, I will stay here again", "Date": "April 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Pompano Beach, Florida, USA", "Title": "“Bed Bugs & Hidden Charges”", "Author": "MissScarlette", "ReviewID": "UR103662142", "Content": "Thought we were saving money but we would have been better off spending an extra 10-20 bucks a night somewhere else. Hotel has bed bugs. Also has a mildew odor and dirty carpet. Breakfast was so sparse it was a joke. Hotel seems like an old run down place with a new coat of paint. After we discovered we had been sleeping with bed bugs we were also suprised by a $5.64 additional services fee which raised the rate to be comprable with other better hotels - that probablty smell better and don't have bed bugs.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Halifax, Canada", "Title": "“Great location, met all our needs.”", "Author": "thedeekster", "ReviewID": "UR103322639", "Content": "The room was clean, the housekeeping staff was exceptional. Close to all attractions and golf, within walking distance to restaurants and shopping. We enjoyed our stay. Thanks Michael (nice hair)", "Date": "April 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Burlington, Canada", "Title": "“Yuck! Only Suitable as an \"By the Hour Hotel\"”", "Author": "Linderful", "ReviewID": "UR101226679", "Content": "Suits travelling workmen who don't really care about where they stay. Not suitable as a Couples or Family stay hotel. Thinking about it still makes me feel nauseous. Freezing Pool - No Towels. Office staff don't know what they're doing. SEMEN stains on the sofa. Checked three rooms before we found one that I could actually tolerate. Re: Coffee Maker; I had to wash it thoroughly by hand before I could even contemplate using it. WORST PLACE EVER!!!!!!", "Date": "March 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Montgomery, Alabama", "Title": "“SCARY, SCARY, SCARY!”", "Author": "wardk30712", "ReviewID": "UR100891749", "Content": "My family and I stayed at the Econo Lodge while on a trip to Spring Training at ESPN Wide World of Sports and it was horrible! First the hotel was in a very scary part of Kissimmee, second the outside of the hotel was very dirty, and third the website wrong (No coffee maker in room). The amenities were very bad also. The breakfast only had bread, coffee, waffles, and juice NOTHING ELSE! I have had a better b-fast at a Super 8 Motel. And the pool was next to a highway and also looked scary. I would think long and hard before I would ever even think about staying at this hotel and we will never stay at an Econo Lodge again especially this one.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "South River, Ontario", "Title": "“Not impressed”", "Author": "Echo02", "ReviewID": "UR100545992", "Content": "The sign flashed \"clean, clean, clean\". We had the dirtiest shower/tub we've EVER had in a motel, although the rest of the room was decent (but very outdated and worn). Biggest beef was finding out there were so many extra charges for the night - $5.95 for hotel services and $2.95 for computer in room (which you pay for whether you use it or not.). I know you get what you pay for but this added $9 to the bill and did not get value for our money. Also, the breakfast was not desireable (we went to McDonalds for breakfast).", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Kissimmee Econolodge”", "Author": "Moi98765", "ReviewID": "UR99808824", "Content": "Good clean motel very convenient to our destination. Manager, Mike, very friendly and helpfull.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Indiana", "Title": "“Filthy and Nasty!”", "Author": "mrleo", "ReviewID": "UR89421608", "Content": "The owners of this hotel should be charged with false advertising. The sign outside was flashing \"CLEAN CLEAN CLEAN\" in bright red letters, every time I saw the sign flashing I had to laugh to myself. I had originally booked this hotel for a 4 day stay as part of a hotel flight package through Expedia. I was relieved when I found out I would be spending two of those days in Naples instead. So since the room was already paid for, I went ahead and checked in when I arrived in Orlando. Check in was fine, aside from the fact that all of the lobby furniture was sitting out in the parking lot since they were having tile put down in the lobby. I went to check out the room and when I walked through the door was immediately hit in the face with a musty, moldy odor which was ineffectively masked by a strong perfume smell. It is clear they have a moisture problem in this property as there are cracks in the ceiling of the bathroom where it looks like the ceiling could fall down, specks of mold on the walls. The bathtub, shower enclosure were just not clean, and it was clear they had not been clean in a while, with more mold evident. The bath tub did not have a plug, not that anyone would want to soak in it. The bathroom door and main entry door had clearly suffered some violence. It looked as though someone had kicked them in and busted it open. The sheets on the bed had holes that looked like cigarette burns. The only nice thing in the room was the marble or granite countertop with sink which had a crack in it and appeared to be sloping downward to one side. There were always dodgy looking people loitering around the property which did not give me a feeling of security in the least. I always saw the doors to the rooms being left slighlty ajar by housekeeping even when they were not in the rooms themselves which was bothersome to me from a security standpoint. The carpet had high traffic wear and was frayed at the entry to the bathroom with loose strings sticking up. It was an all around disgusting experience and I hope this review will save someone else from a similar fate. There are plenty of safe, clean properties in this area that are reasonably priced, there's no need to settle for this one. One last thing, they claim to have a continental breakfast. If you like oatmeal pies, sugary kids cereal, white toast with margarine, the you'll be happy. Do not expect fresh fruit. They did have an old brown banana that was swooped up by some desperate soul early in the morning, but there's no bagels and cream cheese or really anything much of any redeeming nutritional value served. I left and prayed I When it was time to go back to Orlando I really didn't want to return to Motel Hell, but I figure I've camped in the wilderness, I've faced hardship and adversity, I can do this.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "5", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Key West, Florida", "Title": "“NEVER AGAIN, HORRIBLE!!, DIRTY!!, ROACHES!!, DISGUSTING!!!!!!!”", "Author": "Ikuto90", "ReviewID": "UR84343797", "Content": "well as everyone else i chose this room since me and my husband were going to be pretty much out half the time we didn't think it was necessary to get a more expensive room , so we got this hotel for 4 days. The room itself wasn't that bad it was pretty much what i expected but the problem was there was freaking roaches in our room! when we told the front desk they said they were bell beetles or something like that my husband told them \"No there roaches!!\" but the front desk wouldn't budge so we stayed in the room cause they said they didn't have anything available and they said they were going to send a person over to take care of it, honestly i don't know if they did or not since we were out at the time, and thank goodness we really booked ourselves this trip so we wouldn't have to deal with this crap. Than things got worse my husband was sleeping while i was watching tv and a damn roach was on the bed i FREAKED! i jumps up and threw the remote at the roach so it fall off the bed i could sleep that night at all. Also one of the morning i didn't want orange juice for breakfast since they only let you get a little out of this kid cup so i was going to get a soda from the outside vending machine and it ate a quarter of mine so i didn't put anything else in it so i went to the front desk to let them know it was broken and the person there told me that earlier had there money eaten so i told the person in the front desk that maybe they should put a sign on it letting people know it's not working i honestly didn't even say it with attitude or anything and he got ANGRY got a quarter out from the register slammed it on the desk and said \" here don't freight\" i was so shocked on how he treated me jeez i didn't say anything rude or mean but i left and didn't say anything else. So we were going to leave the next morning but me and my hubby decided to go to sea world at last minute and moving to another hotel would be to complicated so i extended the stay to one more day the woman at the front desk was so kind and sweet and explained everything about sea world and even changed our room to a suite for no extra charge when i told her about the roaches the room was soooo much better so honestly are last day was the ok one but really i would recommend this hotel there rude, dirty, bugs and roaches everywhere, just plain disgusting DON\"T GO! even if your looking for something cheap try to spend a little more for something better trust me you'll regret it.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Moore Haven, Florida", "Title": "“not so cheap of a room”", "Author": "drygonflyer", "ReviewID": "UR84045404", "Content": "i booked this room on priceline, thought i was getting a deal but after the $5.64 hidden fee and the $2.95 fee for shutting off the computer screen so i could sleep, which i did get that back, this hotel is about the same price as everyone else. there was a large mildew stain on the ceiling near the front door. and guests fighting down stairs for a few hours. i have my paperwork still to this day and there is nothing stating the extra fees, nor did i see anything on pricelines website. so buyer beware. if you only need a bed and shower than this is the place. oh, and can't forget the customers peeing outside the resturant next door, in front of my car with a beer in hand.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Lynbrook, New York, USA", "Title": "“NEVER, EVER AGAIN!!!!!”", "Author": "Renfaire234", "ReviewID": "UR82612564", "Content": "Unlike others reviewing here, I didn't have a problem with the front desk staff. They were all pleasant and helpful. The rooms are another story! The first room they gave us reeked of mildew and the floor was soaking wet! I went right to the front desk and they moved us to a different room. The second room didn't smell and wasn't wet so it seemed better. Boy was I wrong! They must never clean their air conditioner filters. I was sick the entire stay! My allergies were at their worst in this hotel. Not a way to spend a family vacation visiting Disney World and Universal. The free continental breakfast at this hotel is a joke. Little Debbie Honey Buns, terrible coffee. The coffeemaker I requested for our room didn't work. Next time I'm staying at the Super 8 down the road.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "MS", "Title": "“Great location”", "Author": "Onesirian", "ReviewID": "UR66599923", "Content": "Stayed here during the 1st week of June 2010 - down in Orlando for family vacation. It is a very basic 1* hotel. However, after getting it through priceine for 90 bucks for an entire week, I couldn't complain. Cons: Not much by way of customer service, exterior cleanliness nonexistent. Pros: EXCELLENT location - just minutes away from WDW, ample shopping and restaurants close by (Including dinner shows), not far from I4. Free wireless internet - bring your own laptop. Decent pool. Can't beat it for the money - good for FAMILY travel when a super nice hotel is not that imporant.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Old Orchard Beach, Maine", "Title": "“Good value”", "Author": "karen04064", "ReviewID": "UR62147356", "Content": "We stayed for 2 nights, you will be surprised that there is a 5 dollar plus \"resort fee\" per day, we bought through Priceline and that is not incuded in the price of the stay. The room for what we paid was clean. We did have internet access in our room via our laptop, there is a computer in the room but we did not use it as they want your credit card to access it. The only thing I can find negative about our stay is that when we came back to the hotel after being at Sea World for the day, we walked into our room to find housekeeping did not make our beds, there was a note on our table stating basically that since we had personal items on our bed, they can't make them, hheeellllloooooo, it was one pillow! It was a disappointment but the trash was emptied and we were given clean towels. As for the continental breakfast, I would suggest going to one of the many local breakfast buffets. My 13 year old loved the pool and it was great to lounge around it whild the laundy was being done. I would stay here again, but I will make sure to move my pillow so I can at least have my bed made for me while on vacation, but hey, at least I dont have to tip the housekeeping staff!", "Date": "April 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Puerto Rico", "Title": "“JUST AWFUL....NO WORDS -50 stars”", "Author": "Soldierpr", "ReviewID": "UR61765634", "Content": "First of all i'm a cheap traveler and believe me i had stay in cheap hotels but this one it beats allll of them. First the place is so freaking far away from everything, second bed were all messed up(i could have sleep in the floor and have been better. Room smell like humidity and the shower smell awful. NO INTERNET! they say internet computer in every room but it never come up. Just bad take my advice forget the price for 5$ more u stay at a nice motel 6. Ohh and manager or hotel owner before you answer me on this think about it, because i'm so dissapointed with this i would call econolodge corporate to report this. So' please sir put more effort in the hotel and NO the price, some of us prefer 35 a room and a better matress and not the floor.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Cromwell, CT", "Title": "“Don't ever stay on this hotel! Don't be fooled by the price! And end up paying more!”", "Author": "BewareEconolodge", "ReviewID": "UR61682454", "Content": "This is the worst place we stayed at! This MOTEL is the smelliest, ugliest hotel ever existed! They advetise CLEAN, CLEAN, CLEAN on their big screen but it's the exact opposite! DIRTY, DIRTY, DIRTY! And don't ever get fooled by their pricing! They have hidden charges I've never heard of before! If ever you stay here never ever eat their breakfast! If you want to eat cardboard then go ahead!", "Date": "April 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“Don't let the bad reviews scare you away!”", "Author": "Jes_with_1_s", "ReviewID": "UR59770908", "Content": "I recently stayed here with my boyfriend.. we were a little weary of making reservations because of all the bad reviews but our stay was enjoyable. The front desk staff were very friendly as well as the housekeeping staff accommodated us with everything we needed! The bed and pillows were super comfortable which surprized us. The only thing(s) that disappointed us was that they charged us a little over 5 dollars a day for some hotel fee they didn't explain to me when I made my reservation and their \"shuttle\" to Walt Disney World only runs ONE TIME to the park and ONE TIME back to the hotel.. in other words.. the shuttle leaves at 7:15 in the morning and again at 10 at night. It really frustrated me because I specifically asked the lady at the front desk if the shuttle runs continusly but apparently she was thinking about the city bus. Overall, the place was decent and a rate I couldn't refuse.. I'd definately stay there again. Oh yeah.. if you want to take a good shower with strong water pressure take the shower head off but don't forget to put it back on before you leave!!", "Date": "March 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Bradenton FL", "Title": "“Rude man at the desk”", "Author": "Aurora0422", "ReviewID": "UR47819960", "Content": "The air was broke, and there was no hot water. When I called to report the issue, the d- - - at the desk baically told me too bad, then hung up on me. Cheap rooms come with cheap service.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "florida", "Title": "“Great Value Hotel”", "Author": "coffeegirllb", "ReviewID": "UR46327637", "Content": "We stay at this hotel everytime we stay the weekend in Orlando usually when we go to seaworld, or one of the other attractions. This hotel has the best price, and still has clean, decent rooms. The staff has always been friendly and helpful. Another plus is that they offer breakfast in the morning.It doesn't have all the choices that the more expensive hotels offer, but it has enough for us, especially traveling with two young children, who always wake up hungry! This hotel also offers a shuttle to the close attractions, though we have never actually used theirs.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New Jersey", "Title": "“Never again”", "Author": "LeisureGroup", "ReviewID": "UR38788423", "Content": "We picked the motel due to the location and price. The staff is RUDE. The carpet and chairs were filthy. Bathrooms were probably never mopped. Not even light. A room for Four didn't even have 4 towels or napkins. We called and said we had to go pick it from the office. No \"apology or sorry for any inconvenience\". The website says they provide breakfast but when we went for coffee there was no milk/half&half. I've stayed at econolodge before but never again... The management really need to do something about the front desk staff. They can start with warm welcome or \"hello how may I help u\"?", "Date": "August 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "FL", "Title": "“F-”", "Author": "pvitticeps", "ReviewID": "UR36631837", "Content": "I will never EVER stay at Econo Lodge no matter how inexpensive it is. Me and my boyfriend picked this place to visit Sea World (after all, we were going to be at the park from morning to night..) but we were horribly disappointed the moment we walked in. The person in the front was rude and unresponsive while checking us in. And no, I wasn't expecting a Ritz-Carlton quality hotel - just a decent place to stay. As soon as we opened the door we noticed the room reeking of humidity smell and no surprise - the COUCH AND CHAIRS HAD MOLD GROWING ON THEM! (Not one bit of exaggeration here) Consequently the pillows and the bed sheet were WET & MOLDY! The lock bolt on the door was broken. There were also visible wet stains from the ceiling. Basically for 2 nights we slept in a room with a damp bed that smelled like a wet dog. There is also NO wifi so don't be fooled by their false advertisements. I wish I had taken pictures to describe how awful it was so everyone could see that there is no exaggeration here. All in all, stay AWAY from this place at all costs!", "Date": "August 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "SW Florida", "Title": "“Stay away from this one”", "Author": "Dizney_Girl", "ReviewID": "UR34025558", "Content": "I went to check in at the front desk and stood directly in front of the Asst. Mgr. She ignored me so I started to say I would like to check in when she rudely said “I’ll be right with you” which she wasn’t. She kept me standing there for several minutes. Very rude! Once I got my key I went to my room to discover that the bathroom door was locked. I called the front desk and the maintenance man was sent. He was unable to get the door open. He left to get a tool, returned and still could not get the door open. I called the front desk and asked for anther room and was told there may not be one but they would check and she would call me back. I called the Customer Service number from my member card and asked to be booked into another hotel. She checked reservations and said they had other openings at this hotel and would call them. When I finally got into my new room it was terrible. It was as though they open up a room that was meant to be closed for repair. The toilet was not secured to the floor and rocked when sat on. The bathroom floor was filthy, there were no amenities for the coffee machine, the clock by the bed was not plugged in and had no easy access to an outlet, the one outlet I could find was broken and did not work. The room stank of mildew and cigarette smoke and should have stayed closed and not been opened for use. I was totally disgusted with the room and my treatment by the front desk staff. In fairness, the maintenance man and maid were both courteous.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Alabama", "Title": "“Run as fast as you can. Carpet filthy, employees rude. no wifi. a dump.”", "Author": "kkpa2", "ReviewID": "UR32393324", "Content": "This place was horrible. Carpet was filthy , breakfast was terrible, Employees were rude and talked like trash. Refused to put more food oout in the morning after people had toted it all to their rooms. No wifi in rooms and no transportation to Disney as advertised. Called choice to complain, they were no help. I now stay anywhere except for econo lodge.", "Date": "June 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very Surprised”", "Author": "Tracykim", "ReviewID": "UR30750372", "Content": "I booked this hotel BEFORE I read the reviews and I am glad I did. Not only did I get a great price for the 2 nights we were there but it was a GREAT room!!! The location was just as I expected because I looked up the location prior to the reservation. I knew about the service charge prior to the reservation and called the hotel to see how much it would be. Even with that add-on charge it was a steal for what we got. When we got there the staff was super nice and was very helpful with all of the questions we asked. This was a small get-a-way from the everyday hazards of life. We went to the Pirates Dinner Adventure on the first night there and he next day we spent at Universal. The hotel does have a free shuttle to the park but we chose to drive because we didn't want to be on their time frame. When we got to our room (214) I was ready with the can of Lysol because of the reviews I had read. NOT NEEDED!!! This was a very large room with a couch and coffee table and a King Size bed. Everywhere I looked was spotless. They even had a small coffee maker in the room and we went to the front desk and asked for coffee stuff to be able to make coffee, thinking that they would charge us, and nope, it was all free and they loaded us up. Even soda that they sold in the lobby were only $.75. I was shocked!!! We will be sure to book this hotel again the next time we want to \"get away\"!!!", "Date": "May 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Citra FL", "Title": "“Would stay again”", "Author": "fatboyx27", "ReviewID": "UR28795024", "Content": "Reading past reviews I was prepared for a disaster. Going in I expected a dump. If you go in expecting the Ritz-Carlton you will be disappointed, I went in expecting to have to find another room for the night. I am currently planning another trip to Seaworld and Busch Gardens now and will stay again. Thank you for the night.", "Date": "April 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Maine", "Title": "“Do not EVER stay at this hotel!!!!!!!!!!!”", "Author": "mindy5648", "ReviewID": "UR26230666", "Content": "We arrived at this hotel on March 12th. The store at the hotel consisted of pop tarts and candy bars with a cash drop box to pay. We pull into the parking lot near where our room is. We have to drag our luggage up the stairs to our room on the second floor. They do not have an elevator. We walked into our room and we are instantly hit by a gross musty smell. As we brought our luggage in I opened the shades to find face prints all over the windows. We knew that this hotel was not going to be the cleanest beacuase you get what you pay for. We immediately knew that we can not stay at this hotel just beacuase of the god awful smell. I attempted to log into the free wireless to look for another hotel. The photo that I provided is what the chair looked like when I pulled it out to sit at my computer. I was done at that point. I used the bathroom really quick. Once I closed the door I noticed that there was a large pile of pubic hair behind the bathroom door. We were in the room less than 10 minutes!!!! We knew that this hotel was not going to be spotless however I wasn't expecting to contract an STD the moment I walked into the room.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "florida", "Title": "“Out of the way, good value”", "Author": "mhirschberg1", "ReviewID": "UR26055368", "Content": "We stayed for only one night using a value coupon. We found the room to be better than average. It appears to be recently remodeled. Had a granite bathroom vanity, firm matress, and a working tv. It also had a good flow of HOT water. The buffet breakfast was good, and consisted of juice, coffee, bagles, and dannish. They also had toasters. The lobby/breakfast area is small but sufficient, and they supply USA TODAY. Over all, it's a good value.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Rochester, NY", "Title": "“Find another place”", "Author": "emsspark", "ReviewID": "UR24947284", "Content": "I was very disappointed with this hotel. I have travelled to Orlando many times and never had a problem with my hotel stays. The rate was reasonable for the off season. We came in from the Daytona 500, so it was late, about 12 a.m. The lobby was closed, so we had to go around the side and use the window access. The gentleman was busy watching t.v. at first. He checked us in quickly, which was great. The room was a surprise. It was large and had a sofa, but we had no washcloths for 2 out of the 3 days we stayed, the sheets had stains on them, the bath tub faucet leaked all night. The continental breakfast was a joke. We got down there the first morning at 8( served from 6-9 it states). All that was there was juice, coffee, 5 honey buns and bread for toasting. The 3rd day, we were later, about 8:40, but it had all been cleaned up. There was nothing. The other thing was the extra fees imposed. I had booked online and my account was charged right away. There was never a mention of any other fees, until I got my receipt from the clerk at checkout. There is a safe in the room, but we didn't use it, but they charged us for it anyway. I asked the clerk about it, stating we never got the code to use it. She said that they always charge for it anyway. They also charge a hotel service fee. I'd liked to know what service that was! I had also stayed at another hotel on my way down from NY and back. That stay was wonderful and it was only $20 more a night than this one.", "Date": "February 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Longview, WA", "Title": "“Never again.”", "Author": "kendyray", "ReviewID": "UR24691439", "Content": "The person at the front desk was slightly rude to begin with but when we arrived in our room...the horror set in. It was the last room available. So gross. There was a gigantic stain on the carpet that looked like it had never been cleaned. I didn't want to take off my shoes for fear that my feet would mold upon touching the nasty floor. There were blood spots on the bathroom wall next to the toilet paper and on the door. It wasn't a very good neighborhood and we were charged more than we signed for. I would never suggest anyone stay there. I would suggest sleeping in your car instead.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“Would have been almost ok, but”", "Author": "standbye", "ReviewID": "UR23504428", "Content": "I spent the night climbing to my side of the bed. I thought I'd survive the curved king size bed but the back pain kept me up the last half of the night. There where other details I wouldn't have brought up if it weren't for the hidden fee (\"an incidental fee of 5.64\" said the front desk). The front desk person said hotels.com had it printed on the confirmation/reservation page, so I paid and went on my way. Now 2 days later I decided to check on the site, and couldn't find it anywhere. The Hotels.com rep couldn't find it either. Hotels.com called the front desk and the hotel person said it's there (Denying what the hotels.com rep can clearly see on her system!). A small Incidental LIE that made me write this up so you know they play the I'm cheaper than the rest and skim/scam a 10% fee. Other things that I didn't care much for, but now will put here where: Loose toilet, loose faucets, dirty carpet.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Norwich, NY", "Title": "“Cheap one night stay until our flight time”", "Author": "lawtonjl2002", "ReviewID": "UR23468022", "Content": "We needed a cheap one night stay until our flight time as the friends we were going to stay with had an ill family member. We booked several weeks prior to our visit but ended up with a smoking room even though we requested non smoking. We did call the front desk to seek a change but were told the hotel was full and no rooms were available. This hotel does charge a small fee when you check in about $6. We did have clean sheets, towels, and toiletries. There was so much smoke smell in the blanket and comforter that we did not keep them on the bed. Thankfully there was a Super Target nearby so we bought some Frabreeze to spray around the smoke stained room. I would have like to see a non-smoking room because it may have looked different without the smoke stains on the ceiling and bathtub. If your on a budget and are visiting the Orlando area this would be an adequate place to stay.", "Date": "January 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "san antonio, tx", "Title": "“Great For The Money”", "Author": "txpageant", "ReviewID": "UR23291885", "Content": "Called for a room when the Old Town Suites scared us! They found us a family suite for all 5 of us. 2 adults 2 teens and one 5 year old. It was 2 rooms each with own bathroom, tv, fridge and microwave. one room had a queen bed and full size pull out sofa sleeper. other room had 2 full beds with table and 2 chairs. rate from 12/22/08-12/27/08 was $350. had plenty of towels. the only thing that irritated me was that housekeeping (who speaks no english) only cleaned our room once. she told office she cleaned our room but it never was. we felt safe as there were plenty of other families there. it was quiet and you could not hear noise from street traffic. they have a laundry center with 2 commercial size washers and 2 commercial size dryers. we were given free dryer sheets at front office. they washers and dryers worked like a charm! would stay there again.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Georgia", "Title": "“OK for the price.”", "Author": "JTDawg", "ReviewID": "UR23205433", "Content": "Stayed at the Econo Lodge Maingate for several days before New Years. We were in town for the Capital One Bowl and didn't want to waste a lot of money on hotels. The price we paid here was $44 a night. The hotel was OK. Very friendly staff. Fairly convenient location. Hotel felt safe. The room we had (108) had a very strange smell to it though. So strange that we walked to the Dollar Store across the street and bought some air freshener. Rooms could have been cleaner. The carpet looked like it was only vacuemed in the main areas, as there was considerable dust around the walls. When they cleaned our room they took the dirty towels and wash clothes, but did not leave us any clean ones. However, the front desk gladly supplied us with clean ones as soon as we asked. They offer a very meager continental breakfast. Packaged danishes, toast and bagels (with no cream cheese). Also coffee and juice. Breakfast area is very small, so if you want something, go early or you will wait in line for the meager food. Since most hotels offer free breakfasts that are really a substantial breakfast, we were very dissapointed with this. Overall, if you want to save money stay here if you get a good price. Next time, I will probably check reviews for comparable priced hotels, and try somewhere else however.", "Date": "January 2, 2009"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "England", "Title": "“Words can't express”", "Author": "pigginpotty", "ReviewID": "UR19308014", "Content": "Oh my word what can I say. Booked for 3 nights initially. Arrived after a long flight at 9pm and was the last drop off in the coach from the airport. Hotel very dark exterior and uninviting. I was travelling with a child who was also quite alarmed by the location of this property after seeing all the previous drop off locations prior to ours. We went into the lobby area which smelt rather musty but the check-in person Bobby Jo was very pleasant and attentive and gave us the key to our room. Another guest at the hotel also filled us in with some LOCAL advice which we found very helpful namely only walk if you have to especially after dark and if we did decide to walk then only go in one direction as it wasn't safe in any of the other three directions. Room was ok, pretty standard for a motel in the middle of the Bronx at least the sheets were clean or at least looked it. We didn't bother going to get anything to eat that night but if you like pot noodles the reception sell a vast choice obviously due to lack of eatery outlets after dark. We settled into bed (didn't bother to unpack) to be woken up at 3am by people kicking our door and shouting outside the room. Needless to say we were even more frightened after this incident that we decided to leave ASAP. After a few calls we managed to arrange a booking at a more suitable hotel for our needs and left just as sun began to rise on the hotel's free shuttle to Disney which was what attracted us to the hotel in the first place. We opted to not partake in the complimentary breakfast provided which was as described continental. Dried up old bread and juice with luke warm coffee. Needless to say we will not be returning and i am waiting contact from the Quality Group after filling in a survey regarding my stay. How this chain can associate it's name with this establishment is beyond me. This place is not for families on holiday but is a stop off only for travellers in need of a cheap bed for the night or of course people of a very strong disposition. This was not an enjoyable experience. On the otherhand the hotel we checked into was for more up my street. Check it out The Florida Mall and the rates were not much different to what we had paid at the Econo Lodge.", "Date": "August 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Fort Lauderdale", "Title": "“OMG Stay away Roach infested mess!!!!!”", "Author": "FortLauderdaleBigBoy", "ReviewID": "UR18608335", "Content": "OMG!!!! STAY AWAY.....ROACH INFESTED DISCUSTING PLACE!! THE PHOTOS ARE FAKE!!! Please do yourself a favor do not stay here. It is discusting and will be VERY sorry. The staff does not care and are rather rude. Please do yourself a favor do not stay here. The blood stains on the carpet and furniture and many and nasty. If you have children stay far away!!!! The breakfast is old and spoiled.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Cheap”", "Author": "CARL99", "ReviewID": "UR17133824", "Content": "The room was fine for one night stay. The beds were broke down and very uncomfortable, but if just looking for a place to lay your head, then the price is right.", "Date": "June 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "East Lansing, Michigan", "Title": "“Reasonable cheap hotel but transportation is problematic”", "Author": "cbowen4", "ReviewID": "UR16971605", "Content": "We stayed five nights in the Econo Lodge Maingate Central for a Disney trip. It's a place to sleep; nothing more and at $27 a night, I can't complain too much about the room. It did smell musty, but the sheets were clean and the bed comfortable and the air conditioner worked. The main things I want to make clear are the transportation issues for Disney. The bus picks up at 7:45am to go to the Ticketing and Transportation center. You stop at a LOT of hotels along the way to pick up. This is the only trip to Disney. The return bus picks up at 10:15pm at Epcot and 10:25pm at the Ticketing and transportation center. Epcot closes at about 9:15 after illuminations, so you are stuck in the parking lot for about an hour exhausted and with no place to sit. The fireworks at Magic Kingdom end at about 10:15, so there is no way to make the bus. They pick up too late at Epcot and too early at Magic Kingdom. We had to pay a $35 cab fair so my daughter could see the fireworks, one of the highlights of the trip. If you use the hotel shuttle you are basically forced to be up at 6:30am and in bed after midnight. Try that for a few days with children! The bus forgot our hotel one morning, so we gave up and took the city bus. They told me the next day the bus did make but over an hour late. Unacceptable! A good thing is the city bus stop (Lynx) right next to the hotel. Bus 56 runs to the T&T center and costs $1.75 for adults and $0.85 for children. It will get you there faster than the hotel shuttle will, though you have to wait for a bus (they come every 30 minutes). They bus stops running at 9:45pm, though. We slept in one day out of pure exhaustion and just took the city bus in. We also used it to get to the park the day we arrived (mid-day) and return the day we left (again, mid-day). If you can, stay on property for Disney. We would have, but the Value resorts were all booked up at the time and the other resorts are out of our price range. Even with transportation costs we saved a couple hundred dollars over the value resorts, but it would have been money well spent.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "sharkbait466", "Title": "“Roach Motel”", "Author": "sharkbait466", "ReviewID": "UR16840407", "Content": "I recently stayed at the Econo lodge maingate central in Kissimmee florida and I have to say that place is a rat hole! Its in a crapy part of town surrounded by a bunch of crack motels. The website said there were resturaunts and shopping near by. When I arrived I saw no resturaunts and no shopping, except for the Nike outlet store, dollar tree, and the shell station next door. I asked about the resturaunts and I was told there was a wafful house a few lights down and the rest are about 1 mile or more away. After a long and painful check in I went to my room only to find probably the crappyest most out of date room I ever saw. (and this was after the website said it was renovated) but no worrys I can let things go. The thing that got got me was the lack of housekeeping and maitnence. There were hairs all over the tub, trash under the bed, and no towels. I called the front desk and asked the front desk clerk who made it sound like she was doing me a favor by taking care of these problems. I was moved to another room and it was a little better(not much mind you) there were still no towels, This time when I called I spoke to a guy and he told me I had to come down to the lobby to get the towels because there were no one else to bring them to my room, so once again I had to go to the lobby. When I got there there were about 4 other guests just screaming at him about the same problems I had( bad housekeeping) by the time I got to the counter he looked like he was ready to pull his hair out. I got my towels and went back up stairs, ever thing was great until I woke up in the middle of the night to a roach crawling on my cheek I turned on the light and saw about 10 of them running for cover. I called the desk and was told there were nothing that could be done about it tonight and he would request maitnence to take care of it first thing in the morning or I could check out. I stayed but I couldn't sleep the whole night. In the morning I went down to breakfast and was very dissapointed, bagles, honeybuns, bannanas, and coffiee. I know it was just a continental breakfast but it was nothing like it said on the internet. The cofiee was great thoe. I decided to take my room issues to the front desk and was told by the very rude blond girl “were taking care of that” My family and I went to the parks and had a great day at Disney, only to come back and see the dirty towels lying on the floor where we left them, the beds not made up and the trash still in the room along with the roaches still running around the room. I called the front desk and demanded to speak with the manager. She took the phone and I told her the problem, but keeping up with the rest of the staff she did nothing. Within 20 minuts of hanging up the phone We were packed up and checked out by the night guy. If I had a dollar for everytime he apologised it would have paid for the room itself. Take my advice people DONT STAY HERE!!!", "Date": "June 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“Great, if you aren't a complainer!”", "Author": "jmbeaucoupvoyager", "ReviewID": "UR16635762", "Content": "I was nervous about staying here after reading a lot of the reviews on this site, but as most of them were old, and I was getting an amazing rate (around $21/night in a package deal from Expedia), we decided to go ahead and book it anyways. The hotel isn't a four star hotel, but it doesn't claim to be, and if you're expecting that at the rates that are charged, you are a fool and deserve a bad experience, in my opinion. Our room was clean, had a lovely comfortable king sized bed, sofa (probably was a sofa bed, but we didn't think to check), dining table, working mini fridge/freezer and microwave, etc. The bathroom fixtures were dated (discolored from age, not from dirt). The room was cleaned every day and cleaned very well, the staff was amazingly friendly and helpful, and the location was great. The free shuttle got us to Disney before the parks opened, which allowed us to get on the best rides before any lines, and if we didn't want to wait for it to return us to the hotel (it ran later at night) we could take the bus (I believe the 56 LYNX) which ran directly from the front of the hotel to the Magic Kingdom, took no more than 30 minutes, and cost $1.75 (the public busses are great down there!). Also, the 55 takes you up and down the 192 where you can eat at any number of restaurant, buy groceries (Super Target and Publix are within an easy walk, and a Walmart Supercentre is a quick bus ride away). Down the street is an awesome teppenyaki restaurant called Kuboki (I think?) that has unbelievably good prices, and copious amounts of delicious food. We're not from the US and therefore aren't used to the staggering portion sizes that are available, so we would take our leftovers back to the room and use the handy fridge and micro to have a pretty good breakfast each day. Our only \"complaint\" would be that the breakfast was kind of lacking (two kinds of bagels, toast, and packaged honey buns along with coffee and juice, and bananas) but as I said, the fridge and microwave made up for that anyways. Considering we paid $20 a night for a free shuttle, free breakfast, and a clean, safe, quiet place to stay, I really can't complain. I wonder if a lot of the people reviewing this place brought any of their \"problems\" to the attention of the staff, or just waited until after their stay to complain? (Whether to ask for a discount after the fact, or just to write a negative review of the place). I'm almost sure that the staff I met would have been more than accomodating to any of these \"problems\". If I could give advice to a friend going, I would say, stay here, get the best of the best Disney pass available, with the water parks etc option, with the money you save, use the water parks and everything available to you at Disney and then come home to a great place to sleep and stay. If you want a place where you can sit by the pool and hang out in the hotel all day, look elsewhere. Otherwise, this is great.", "Date": "June 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“A nice Surprise”", "Author": "edinman", "ReviewID": "UR16368746", "Content": "It was with some trepidation that we booked five nights in this hotel but for the price you really could not ask for a better hotel. The bed sheets were spotlessly clean, carpets and toilets were clean the air con was a bit noisy but very efficient. The staff were very friendly and helpful and I must single out James on the night desk for being especially helpful above and beyond any expectations you would have for hotel staff.", "Date": "May 24, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Hudsonville,", "Title": "“Find somewhere else.”", "Author": "heatherheck", "ReviewID": "UR15959922", "Content": "We arrived late, after a long day at Disney. This room was booked over the phone with a Choice Hotels customer service representative and we specifically asked for someplace NICE in the area with a pool. The person working the front desk when we arrived was friendly and helpful enough, but that's the only good experience we had here. Unfortuately we weren't able to use the pool since we had an early flight, but just as unfortunate was the room. My first impression when walking in was that it smelled awful, almost urine like. The bathroom door had a hole in one side, like someone punched it, there were cracked tiles and the tub, toilet and floor all looked stained and less than clean. The shower faucet was not properly attached to the wall either and looked as if it may fall off. The faucet handles on the sink were pretty grimy too and there was no handsoap to be found (lucky I always have hand sanitizer). The bedding was also questionable. I couldn't sleep all night because I was unable to get comfortable because all I could think about was how dirty the room was and how bad it smelled. If we would have checked in earlier, or had been leaving later (we were only there about 6 hours) I would have asked for a different room, but that wasn't really an option at our late hour of arrival. I'm not a super picky person, it doesn't take a lot to make me happy, and this place couldn't even do that, I would seriously recommend paying a few dollars more and staying elsewhere.", "Date": "May 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "new york", "Title": "“Mixed Bag”", "Author": "cuddly1", "ReviewID": "UR7294359", "Content": "i was just recently at this hotel. before making a reservation there, i read all the reviews here and they were mixed. however, the most recent one was very positive, so i thought it was worth a look. however, i still approached this place with trepidation, and rightly so. when we exited our car, the area around the hotel wreaked of cigarette smoke. this is the one thing i absolutely cannot tolerate in a hotel room cause i cough from the smell. i think part of the experience there may depend on which room you get. well our room did not smell from smoke, thank goodness, altho there was a smell of air freshener, like the ones you hang in the car. frankly, i hate that smell. i think often that is used to cover up a smoke smell, but i didnt sense that in this room. this smell dissipated within a day. the carpet was fine. this is big for me cause i feel really uncomfortable if i have to constantly keep my feet covered. however, it was dusty under the luggage stand, as if they didnt vacuum there cause they would have to move it. i can confirm what i believe most of the posts say about the employees. they are very helpful and courteous. esp. the hotel manager. she was very receptive to my questions and requests. the toilet was very sad. it was clean, but it looked like it had been washed many times cause the plastic was fading. the seat was also broken, where the seat and the back of it are attached, and my husband had to fix it about half a dozen times. there was crud under the shower nozzle. the cost wasnt cheap, at least in comparison the the $27someone posted below. we spent $60 a night for a 2bed room, with microwave and fridge. of course that was over the high demand spring and holiday breaks. if the room had been in better condition, it wd have been worth the cost. the beds were ok. my husband and i felt they were too soft. my daughter liked them. the linen was clean, but there was a hole in one of the sheets. that really turns me off. however, perhaps this is nitpicking. i believe one of the amenities this hotel boasts is a better than average free continental breakfast and this is what we found. there were bagels, muffins, oranges, apples, a variety of cold cereals, oatmeal, yogurt, danish. the only complaint i had was that they put the milk and yogurt containers out sparingly.", "Date": "April 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Qc", "Title": "“Economical, friendly service, and close to attractions”", "Author": "lisamsutt", "ReviewID": "UR6504680", "Content": "We stayed at the Econo Lodge in November and although this hotel had very basic amenities ... the price was right. We paid only 27$ a night for 2 people. So, we overlooked the little imperfections. The staff was very friendly and helpful and by the end of our week there, it almost felt like home.", "Date": "December 27, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Waukegan, Illinois", "Title": "“Not what was expected”", "Author": "A TripAdvisor Member", "ReviewID": "UR4734885", "Content": "We stayed at this hotel only one night. Reservations were made approximately six weeks in advance. A non-smoking room was requested. Upon arrival at our room, it was obvious by the pungent odor that escaped when the door was opened that this was not a non-smoking room. The additional clue was the ashtray and book of matches on the desk. We then requested a different room and were informed by the front desk that our room was a non-smoking room and that there were not any other rooms available. The parking lot was barely full, so were were not sure if that was accurate or not. If we could have been guaranteed a room at a different hotel, we would have left. It was OK for one night, but if the occasion were to arise where we would be in the Kissimmee area, this place would definitely not be on our list of choices.", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "MD", "Title": "“dissappointed”", "Author": "Bluemoon319", "ReviewID": "UR3504778", "Content": "I am not pickey about hotels when I go to Disney area because I am at the parks all day. So I'm not at the hotel much anyway. However in March the parks close earlier & unfortunately I was at the hotel much more this time. This is the first time I booked a hotel through a travel agent & wish I hadn't! The only reason I did not rate this hotel as terrible was because the staff was quite friendly & did try to be helpful. Also the pool temp was great! The photos in previous review do not exagerate. My room also had open hole in the shower surround & missing grab bar. the toilet ran most of the time, the light in the bathroom was broken. So the door had to stay open when you were in there. The light by my bed started smoking when I turned it on. The next day the light in the bathroom got fixed, but the only thing done with the light by my bed was that the lightbulb was changed. this clearly did not fix the problem. As I had reported, this was a major safety hazard. the person sent to fix the problem was not a true maint. person & in fact I ended up having to explain what needed to be done to resolve the fire safety hazard. The man did not have the ability to fix it & the only solution available was to unplug the light ( which the maint. person did not even realize was possible until I pointed it out). The sheets were too small for the bed although they were clean. the bedspreads, however were not, including cicarette burns (this was a nonsmoking room). Breakfast was coffee, juice, & packaged honeybuns or cereal bars. The pool was in the parking lot. On the positive side, the staff was friendly. Even the maint. person, although not qualified, was clearly trying his best. the pool, although in the parking lot was almost as warm as a bath. The weather was quite chilly & I have never been in a pool as warm as this one was! It was so well appreciated & I have told many about it. The pool area was clean. Clearly it is the only saving grace for this hotel. Although this hotel was budget priced, so are MANY hotels in this area & I would have expected to spend about 1/2 of what I paid for this hotel. Had I been in the area for more than 3 nights I would have changed hotels.", "Date": "May 27, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Hamilton", "Title": "“If it had guards, it could pass for a prison”", "Author": "travelnazi", "ReviewID": "UR3233699", "Content": "They screwed my reservation up, I had booked 2 queen beds. The room smelled bad, we immediately went across the street and bought spray. Every corner was dirty. The bath tub had open holes where a grab bar used to reside. Non smoking room had ugly cigarette burns on the vanity and tub. There was a disgusting stain on the kids comforter..we wouldnt allow them to use it. Garbages were over flowing the whole 4 days we were there, as well there was broken glass on the path to the pool that never moved. There were many lights burnt out outside. The vending machines didnt work. Then to top it all off, when I checked out..they were overcharging me. Refused to make the adjustment because I signed when we checked in. Check out the pics..its a real paradise. After complaing to head office about being overcharged..I was sent a check for the adjustment.", "Date": "February 27, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "White Lake, MI", "Title": "“Really friendly place”", "Author": "A TripAdvisor Member", "ReviewID": "UR2207993", "Content": "The people were very friendly; the rooms were clean and nice. We had a roll away bed also it was very comfortable.", "Date": "June 20, 2004"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Halifax, Nova Scotia Canada", "Title": "“Unfortunately - Not a great place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR1711633", "Content": "Stayed here on Feb 22 - just needing an economical overnight location before heading to the airport the next day, we agreed to pay $51 for a room for two. The beds were probably the worse we've ever experienced in a hotel and the room was sub standard. The continental breakfast the next morning consisted of packaged pastry and coffee or juice. There was no TV changer in room but was given one from front desk when requested. On a positive note the pool was nice and managed to get an hour of sun on the pool deck just before headin to the airport. Not recommended for a stay of more than one night. Rates are very competitive in the area and I'm sure one could fine better deals even for an overnight. Sorry I acnnot say anything nicer ---", "Date": "March 7, 2004"}], "HotelInfo": {"Name": "Econo Lodge Maingate Central", "HotelURL": "/ShowUserReviews-g34352-d88134-Reviews-Econo_Lodge_Maingate_Central-Kissimmee_Florida.html", "Price": "$30 - $50*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4669 West Irlo Bronson Hwy</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34746</span></span> </span></span></address>", "HotelID": "88134", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/31/e1/31e103e1d3b58fa0d275989d70a080a14large.jpg"}}