{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Absolutely Horrible”", "Author": "Holly P", "ReviewID": "UR126302156", "Content": "We requested a fridge in our first room, which took them forever to bring. When they did bring it it reeked of rotten fish. So we called and asked for another one. We waited an hour for it then left to go to a concert. Six hours later when we returned we still had not got one and the nasty one was still there causing our whole room to smell awful. They switched us rooms and gave us another fridge which did not work at all. This rooms shower was broke, as were the phones unless you put it on speaker. The sheets were stained and we also found reeses wrappers in the bed that night when neither of us had eaten reeses. THe mini bar had someone elses old shrimp cocktail and leftovers in it. We did not even bother to complain about this stuff because everytime we tried to say something about anything they were rude and took at least an hour to get anything done. Our room temp alternated between insanely hot to insanely cold, back and forth, even though we kept it on fifty. Awful place. Will NEVER stay there again.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Mediocre”", "Author": "Melinda18550", "ReviewID": "UR126068976", "Content": "Other than this hotel carrying the Westin name, it is a second rate facility. It appeared tired, slightly dirty and the room was small, dark and uninspired --even by chain hotel standards. My key wasn't coded, the bathroom toilet had a loud dripping sound all night long, the room was hot and stuffy, and, I didn't receive a newspaper in the morning despite repeated requests. My recommendation is to stay somewhere else.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Nice stay based on the price.”", "Author": "cprussel", "ReviewID": "UR126038907", "Content": "I am basing this review on the price $120 after taxes which I feel was very good for the date we stayed and the location of the hotel. This does not include the cost of parking (hotel garage $32) and any other incidentals. Watch out for the $4.00 bottle of water. It is on a pressure plate. One move of the bottle and you are billed. Thankfully we were tipped off about this from another reviewer and we did not have an issue. The hotel is within walking distance to about everything downtown. We were in town for the Big Ten tournament. It was about a 10 minute walk to Bankers life field house which was great. This hotel is home base for Michigan State fans it seems although other some other fans were present. Overall the hotel seemed better than the last time I stayed here. The room we had was in nice condition and for the two of us plenty big. Bathroom is very small, room for one person at a time. Overall the front desk staff was good. The gentleman that helped check us in seemed a little burned out. All other requests during our stay were granted and timely. Pool is subpar for this class of hotel . Very small, the times we visited the kids using it seemed to enjoy it none the less. The main complaint I have with this hotel is the parking. You must valet your car at this hotel and in order to get your car you must wait on valet to bring it up. During busy times plan on waiting a good 15 – 30 minutes to get your car. Please plan accordingly. The nice thing is you should not need your car if your activities are all downtown due to the nice downtown location of the hotel. This is really more the norm for most if not all downtown hotels. Plenty of options exist in the area if you need other parking. In summary if I would have had to pay more for this hotel my review may have been more critical. Since the price was so fair I give this hotel a 4 star for my stay.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Perfect location in Indianapolis”", "Author": "Bill W", "ReviewID": "UR126004657", "Content": "This Westin Hotel is in the center of fine restaurants, the convention center and Lucas Field. The room was small, efficient and quiet. Access to the rooms is with your room key in the key slot in the elevator, not very convenient when you have items in your hands. The standard-size beds are small and not as comfortable as advertised...opt for the KS room. Westin has a member's point bonus program where you get an extra 500 points if you skip having your room cleaned, bed made and fresh towels everyday...questionable value. Great wine bar at the Conrad Hotel, two blocks from the Westin...wines from all over the world, decent pricing.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "St.Louis", "Title": "“Works well”", "Author": "BillParker", "ReviewID": "UR125812668", "Content": "Excellent location with enclosed walking bridge to convention center. Upgrade for Platinum member was not available and room I received was quite worn and dated. Still I would stay here again just for the location.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“First and last time to stay in a Westin.”", "Author": "NewYorker27and1", "ReviewID": "UR125672084", "Content": "Let me begin by saying I am a Starwood loyalist. I am a seasoned traveler. I stayed in this hotel a few weeks ago and hoped the bad experience might soften before I wrote the review. But whenever I think of that hotel, I think about my lovely relaxing get away from New York, as ruined by this experience. I went the weekend AFTER the SuperBowl, so you would think Westin property a few blocks from the stadium would have it's act together. Also the fact that this is a HUGE convention hotel. OK, convention hotels are not always the swankiest, but usually very service oriented. This one gets zero circles for service. First I had a rental car. When I pulled up at about 11 p.m., there was no valet/bellman/doorman who came out. I waited awhile and even honked my horn. It was a snowy night and I was nursing a broken ankle. After about 10 minutes, I had no choice but to lock up the care and hobble in. They said they only had one bellman on duty and he was helping someone else. One guy at the front desk also helping someone else. I was given a room with a burned out light in the bathroom. So I called downstairs. They couldn't tell me when maintainence would come up, so I asked if I could just change rooms, since I hadn't even unzipped my suitcase. So it took a while, but they come up with a key for a new room and floor. It was fine. As I started unpacking, I heard a lot of noise in the hallway. I waited about 15 minutes and it seemed to grow more. It was now midnight. I opened the door and I saw kids sitting in the hallway and drinking...show no signs of leaving. I said how much longer are you going to be out there, and they just looked at me. I called downstairs and asked if they could intervene. They said, Well a fraternity has booked the hotel, so there is not much we can do. I said, OK, do you have any floors without a fraternity party going on? They said they would move me. So I waited. and waited. I called down and they said the bellman was on his way. He never came after about 15 minutes. Back downstairs and the poor front desk guy, still alone, helping others. At this point, I am distraught. Bad ankle, tired from a long flight, and hungry. He put me in a room he said \"where the pilots and flight attendants stay.\" The poor alone bellman tries to help me move. He was very sweet, but I said, it seems only three people are working tonight, you, the front desk, and the guy on the phone. And he said, pretty much. I couldn't believe it...the hotel is huge and they were nearly booked as it was the weekend before Valentine's Day. I got to the room, it was fine, no view, but it was quiet. I unpacked and called room service, nearly 1 a.m. now (wasted all this time getting to a decent, quiet room). They only had a few items to offer...nothing hot. And really cheap wines (well, I could see I am not at the W!). I asked how long it would take and they said 45 minutes. So it would be nearing 2 a.m.. It was near 0 outside, so they sent me to the attached restaurant, which was nice enough,and they were closing up, but took pity on me and had some bar food which was hot which I carried up to my room (very glamorous!) I then went to take a shower and the \"heavenly shower heads\"...only one worked so it was not so heavenly. The bathroom was smaller than most in New York and the lighting was very dim. The towels were super thin (definitely not heavenly), and there were only one bath towel! Then went to sleep in the so-called heavenly beds, which felt just like any old hotel bed. Nothing special about the linens either. The next morning, I went to use the phone by the bed, and it did not work. Had to get up and go over to the desk. I called down to ask for a manager to share my experience and see if I could get these items fixed while I went out for the day. They said they don't have a manager until 1. I said ok, can I leave a message for him? I was doubtful that they took the message, I went to the front desk on my way out (there is no concierge at this hotel)....again waiting in line, although there were now 2 people at the front desk. I told my person a little bit of my story, and she was very rude. I left my number again with her for the manager to call me on my mobile So, the entire day, no one called me. I got back to the room thinking there was a message, and again,none. The shower was not fixed, nor was the phone. The sheets were not changed. Even though I put the little card on the bed that said \"change the sheets.\" When I left the hotel, I will say there were a few more people at the bell/valet stand than at night. But when I stop to ask them for the best directions to the location (only about 7 miles!), it was if I had asked them how to get to Memphis. They totally could not give me directions...didn't seem to know the streets at all. Very odd. They asked if I wanted to talk to a manager, and I just laughed and left, using my Google map on my cell phone...difficult to use as the roads were slick. When I returned late at night, I experienced the same problem with no bellman/valet. Had to turn the car off and come in. Same thing at the front desk...one lone guy. Well only one more night of this. When I checked out I stopped by the front desk just to be sure they had my entire bill, including valet (which incidentally they did not as I was charged for that a few days later). Again a very cold staff at the reception desk. This is not the Indy I remembered. I finally said, are you interested in my Westin experience at your hotel? The woman seemed a little shocked. She asked if I wanted to speak with a manager. I said yes, but it would have been nice to have someone to talk to DURING my stay, not as I am checking out. I left my cell phone number if they were interested in my experience. I will tell all who read this review to beware of this hotel. It really gave me a poor view of downtown Indianapolis after all the hype. As far as staying in a Westin...never. To all who may be forced to stay here, just know this is a very old property with some renovation in public areas. The rooms are clean enough, but very dated. Bathroom is so dimly lit, you need to put on your makeup in the bedroom (so bring some extensionn cords). In terms of my rating, if there were an option for no circles, that would no circles too many.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Logan, Utah", "Title": "“good location in a nice city”", "Author": "worldtraveler0632", "ReviewID": "UR125667848", "Content": "Nice hotel overall. Was there on business. Careful with mini fridge/bottled water. If you pick up the bottled water they will charge you. Staff was friendly and helpful.The hotel is well connected to the convention center as well as overhead sky bridges which lets you access a whole bunch of stores and restaurants.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Westin Downtown Indianapolis: Thanks John at the Front Desk”", "Author": "A O", "ReviewID": "UR125655663", "Content": "Hi, this is a great hotel. John at the Front Desk provided great service to our family (We parked in the wrong garage, he fixed that; we needed a larger room, he found us a suite with a view). I couldn't find my Starwood number, he let me stay in the line anyway:). The room was fabulous; soft beds; very nice lobby. Also, it was my first time using hotwire and the rate was fabulous. It was an emergency trip & I only booked 3 hours before arriving. I know technology provides integrated systems between all providers, but there are many horror stories about rates not being honored or other snafus. This wasn't the case. Tip: Our Navigation system didn't have the correct directions once we got to downtown Indy. We went around the 'very long block' a few times before finally finding the street that led us to the Westin. Everything else was fab: Thanks John at FD. Thanks: A.O. from chicago.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The bed was like sleeping on a cloud.”", "Author": "Flybynight21122012", "ReviewID": "UR125411173", "Content": "Clean, quiet room. Staff was friendly and extremely helpful. Special kudo's to \"John\" who checked us in. His knowledge and strategies of parking and dining kept our visit within budget.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canton, North Carolina", "Title": "“Yet another great stay at the Westin Indianapolis”", "Author": "Bill L", "ReviewID": "UR124979693", "Content": "This is the2nd year for me staying at the Westin Indianapolis. My foundation stays at the Westin for the Motorcycle Dealers Show. The Westin is a great hotel and has a walkway to the Convention Center. We have always found the Westin staff to be very professional and try to meet all our needs.There are great restaurants within walking distance and you can take the \"gerbil Trail\" (walkways) to local restaurants and a shopping mall within 3 blocks. Great overall experience and I know that our Foundation will use the Westin again next year", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Very Good”", "Author": "Kevin S", "ReviewID": "UR124558591", "Content": "It is a clean and modern hotel with comfortable bed. The room was wide, as anywhere else in North America. The cleanliness was very good. The location is good with many restaurants & shops around. A little bit on the luxury side, but the price is also on expensive side.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "La Grange, KY", "Title": "“Hotel Room Good/Front Desk Staff Not So Much”", "Author": "KatieLaGrange", "ReviewID": "UR124291983", "Content": "I have stayed at this Westin before and enjoyed it. I like the rooms, I like the restaurant on site. I like the proximity to the convention center. I don't like the way the staff at the front desk treats you. We were there for a cheer competition and it was very busy - so I can cut them a bit of slack. But if you are not cut out for being able to handle busy - you may need to continue your hotel career in a hotel that is not busy. The problem I had was that when I checked in they held my entire 2 day stay on my check card. I was told it would be one night not the entire bill plus the $50.00 incidentals. I went down to switch my card and the girl said it may take until Monday for the funds to be released or Tuesday since Monday was a holiday. It took until the following FRIDAY TO RELEASE MY MONEY!! This was a check card not a credit card. This happened to several of our folks. The front desk seemed to shrug this off like \"not my problem\". I am not just a \"CHEER MOM\" I travel a ton and actually plan events for my company and I like to be treated like a Gold Club member not an inconvienence.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vietri sul Mare, Italy", "Title": "“Westin Quality”", "Author": "Lex59", "ReviewID": "UR123639273", "Content": "Some hotels, such as the Hilton, offer no actual consistency in quality. They are a brand once known for their quality and have degraded into franchisees that take pride and put money back into the property, or do not. The Westin must have better regulations for their franchisees because in general they have a very uniform code of cleanliness, impeccable and modern rooms, helpful staff, and unsurpassed service. This was no different! I err on the side of caution with hotels but this time I can truly give an unsurpassed seal of approval!", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bloomfield, Indiana", "Title": "“Great Hotel ... in high style!”", "Author": "jp_edwards", "ReviewID": "UR123622281", "Content": "We stayed at the Westin to be close to the Madame Walker Theater. The location rocks ... the hotel is all dressed up for the Super Bowl and it is connected to the convention center and the Circle Center Mall. I didn't try the food here but the pool and workout area is fantastic. It's usually pretty pricey but I got it on Priceline for less than half price. The beds were perfect and the dual head shower made me rethink our bathroom design at home.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Service beyond the call of duty”", "Author": "Steve R", "ReviewID": "UR123582432", "Content": "My expierience was great before I even arrived with attention to detail I did not expect. When I did arrive at the Westin I was running late and found the front desk to be friendly and accomodating as I needed to be at the Premiere of a movie and was late. John Rabold went into action and made me feel very calm by taking control and speeding up my process moving me to another room with a better view that I could get in right then and now. I found out John was the front desk supervisor, and that made sense as his staff rallied behind him like the true professionals they are. They struck up a conversation and made me feel at home before I had even arrived at my room. They hand delivered me a card signed by the staff welcoming me to the hotel. This is the kind of personal service that has been forgotten in many hotels in my travels.I went up to my room and was so impressed with the view of downtown Indianapolis and the room was beautiful. I could see from my room I was close to everywhere I needed to go and after I dropped of a bag I went down to the lobby and once again the front desk staff was the best. I asked about parking and they explained my options. I asked about directions and they were like a human Garmin. They did all this with a smile on their face. If I thought Siri in my Iphone was helpful, these people put her to shame. I returned to the hotel late and stayed up very late to enjoy the view and the comfort of the room. I slept so well in the comfortaqble bed and luxurious comforter that I over slept and once again the front desk came to the rescue. I could say everyone from the valet parkers, to the front desk made my stay at the Westin one I will repeat. In a competitive world the Westin goes above and beyond the call of duty. See you again soon", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland", "Title": "“Great Property and Great customer service!”", "Author": "eggnelle", "ReviewID": "UR123559853", "Content": "I am loyal to the Starwood brands, love their properties. The Westin Indianapolis is no exception. Beautiful hotel, great rooms, and great staff. A big thanks to John Rabold for is incredible customer service! I highly recommend this property!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Excellent Location - Unsurpassed Service - You Need to Stay Here!”", "Author": "NaptownRadioGirl", "ReviewID": "UR123356679", "Content": "I have stayed here several times over the years but am finally writing a well-deserved and long overdue review. I was attending the Premiere of a film called, \"Naptown Rock Radio Wars\". The staff, particularly the front desk supervisor, John Rabold, was extremely professional, friendly and accommodating to my need for a late check in, holding my luggage, making sure everything was the way I wanted it. The rooms were VERY nice. I couldn't have been happier! And the beds.....aren't they called 'Heavenly Beds?\" Yes...they are! The location downtown was fantastic. Close to everything. Anyone coming here for the Super Bowl should put the Westin at the top of your list! There's a great restaurant (Shula's) inside the Westin. If you're looking for a GREAT NEIGHBORHOOD Pub that's casual- right next door is Loughmiller's (pronounced lock-miller's) Pub & Eatery. Great food, friendly staff, excellent drinks, fun atmosphere. You get the best of everything when you stay at the Westin. Can you tell I had a good time? *******Thanks everyone!*******", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "chicago", "Title": "“Updated upgraded downtown Westin”", "Author": "f1orchid", "ReviewID": "UR123351017", "Content": "This Westin recently went through some renovations and upgrades. Most notably the lobby got a make over with new interior design. The rooms are the same but in great quality shape. The upgrade has come in two areas. Finally they fixed their wireless internet which was horrendous in the past, now works like likely split. Additionally the front desk service is much improved with agent John Rabold on hand. He assigned me a great room location. The hotel still needs more accessible power outlets for the business traveller in each room rather than a crawl under the desk for only one open plug in.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Great location very helpful staff”", "Author": "Paul M", "ReviewID": "UR123317316", "Content": "This hotel offers a magnificent view of the city and is just a few blocks from everything in downtown Indy. The staff was extremely helpful. In particular I want to single out John Rabold who checked us in, learned of our plans and made very helpful recommendations about our evening.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Virginia", "Title": "“Fresh new lobby do the rooms next”", "Author": "careyhc", "ReviewID": "UR123181993", "Content": "Stable Westin with outstanding service, wonderful shower and heavenly beds. Rooms are beginning I to look dated especially the carpet but you cannot go wrong with the location across from the convention center and only a shortwalk to numerous restaurants", "Date": "January 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kent, Washington", "Title": "“Not the best by a long shot”", "Author": "Nigel1970", "ReviewID": "UR122410359", "Content": "I have stayed in this hotel twice in the last year- first time was decent despite problems with keys repeatedly not working- this time was another matter- We showed up at 5pm and the hotel was pretty full- despite requesting one king we were given two doubles in a room that was tiny- it hink it used to have one queen and that would have been ok- the bathroom was old and needed a major overhaul- the shower heads only partially worked, some of the jets were clogged and the closet was so small it was barely usable- the fitness center is great- no complaints there- except for a fairly pervasive odor- like mildew covered with industrial cleaner that was present on the 3rd floor leading to the gym and the second floor all the way into the upscale restaurant. The staff was helpful- sort of- I wanted a town car for the ride to the airport and there was serious confusion about arranging that- they kept trying to put us in a taxi- overall, next year maybe the Marriot or the Hyatt that are both right next door.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kentucky", "Title": "“Just perfect for New Years stay”", "Author": "kbass0001", "ReviewID": "UR122385648", "Content": "Overall, very pleased with our stay. Great location in the heart of downtown near the Wholesale District. Located within walking distance to several restaurants, Circle Center mall, night life... The hotel was very modern and enjoyed our weekend stay.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Indianapolis, IN", "Title": "“Lobby is wonderful...Everything else is honestly a disappointment”", "Author": "ZMAN3411", "ReviewID": "UR122034269", "Content": "Stayed here with wife and friends for a Sports Weekend (College Basketball Saturday, Colts-Titans game Sunday). We have stayed at a few different hotels in downtown Indianapolis and all four of us agreed- this was our least favorite. Positives: 1) The Lobby is very welcoming with a Starbucks, Shula's Steakhouse, and nice decor. 2) The location is great- walking distance from anything you want to go to downtown! Negatives: 1) There is an additional cost for EVERYTHING...Be careful not to touch the water bottles in the room, mini fridge, etc.- it will show up on your bill. 2) Parking cost is outrageous...I recommend parking off site at the Government building around the block! 3) Hallways and rooms need renovations! Though the lobby looks very nice, the hallways and rooms make you wonder if you are really at a Westin. I must tell you that this review is coming from someone that is not very picky...This is actually my first review that I am not labeling as \"Excellent\" (5 Stars). If I paid $70 or less for a room here- I would say it is Average to Above Average...but since I paid a price for a Westin room- it is well below average.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Great hotel!”", "Author": "ops79", "ReviewID": "UR122004088", "Content": "I stayed one night on my way to Chicago for Christmas. The hotel is beautiful! It looks recently renovated. My room was super clean, the carpets looked brand new, and all of the staff was great. It is really close to shopping and restaurants. I would stay at this hotel again.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Superior help in an emergency”", "Author": "Margaret611943", "ReviewID": "UR121708550", "Content": "We stayed at the Westin for a conference at the Indianapolis Convention Center. The Westin is the most convenient of the 3 hotels attached to the Convention Center. We enjoyed the hotel and everything there is very nice, but were most impressed when one of our friends became ill during a meeting. General Manager Dale McCarty responded immediately when I requested help. Dale and his staff quickly brought a roll away bed to an adjoining room, towels and water for compresses. They checked back frequently and had a staff person check vitals. After an hour our friend agreed to let EMS be called and Dale took care of that. We had planned to check out at noon, but when we needed to go to the hospital with our friend, Dale took care of holding our room at no charge until we were able to return. Thankfully, a potentially scary situation ended well, in no small part to Dale and the staff's response to our needs.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Decatur, Indiana, USA", "Title": "“Maitre d' at 15th Floor Courtesy Bar Fine Example for Entire Staff”", "Author": "Teryl S", "ReviewID": "UR121419953", "Content": "Darren Fish, the Maitre d' of the 15th Floor's Courtesy Bar, was very professional and genuinely interested in his customers. He is a fine example of the overall professionalism of the entire Westin staff. -Terry R. Smith", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Odessa, Texas", "Title": "“Excellent Hotel”", "Author": "HAD1974", "ReviewID": "UR121353212", "Content": "Stayed here 3 nights for a conference. The room was very clean and spacious. The hotel is connected via Skywalk to the mall which was very nice as I didn't have to walk on the street at night. Several very nice restaurants nearby.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Heaven at Westin Indianapolis”", "Author": "Elijio L", "ReviewID": "UR121061904", "Content": "Traveled by car from Atlanta Georgia to Chicago Illinois to visit family for thanksgiving, On my way to Chicago I stopped for a night at the Westin as I was very tired from long hours of driving. From the moment I stepped into The Westin Indianapolis I had a heavenly experience. It was 2am and I was greeted by the Front desk Supervisor John. John treated me with such wonderful Westin-heavenly hospitality. He asked me which type of room I was looking for, even though I did not care what room I was put in because I was very tired he gave me a complimentary upgrade to a King suite which was beautiful. The housekeeping staff sure does know how to clean rooms and everything was fully stocked. I was able to unwind, and refresh my spirit in the Westin signature heavenly king size bed. Upon checkout, I was greeted by lovely front desk agent Dagny. She was very polite and well mannered and full of the Westin spirit. For anyone looking for a heavenly stay at a hotel with energetic staff in the Indianapolis city, I highly recommend \"Westin Indianapolis\".", "Date": "November 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Mediocre at best”", "Author": "uwdsr1", "ReviewID": "UR120889382", "Content": "We traveled to Indianapolis from Chicago as a small getaway/road trip with our young son and while it is a fun and underrated city, this was one of the worst hotel experiences we've had. I am an SPG Gold Member and I've had much better experiences at hotels such as Holiday Inn Express and Hampton Inn, even Comfort Inn. We will definitely return to Indy but we've stayed at the Omni in the past and will likely return there or to one of the other many hotels in the downtown Circle Center area. When we pulled up to the valet, we were not greeted. We removed the luggage ourselves, when the valet finally arrived. He took our key, did not give us a ticket, and then disappeared, and we spend 10 minutes looking for him while bringing our luggage in ourselves. I had booked a club room suite. I was told we'd get a suite and we'd have club access, but we would not be on the club floor. Our keycards did not work and I had to go back down to the front desk to tell the person who checked us in (who was the manager) that we needed new keys. My wife forgot something in the car - 30 MINUTES for them to bring it up to retrieve something. They did remove the valet charge for both nights. The club room is a joke, especially at night. First, when we entered on Friday night, the stench of bad food and trash was so bad we almost had to leave right away. There was a pathetic display of Townhouse crackers and cheese (crackers still in the carton) and veggies, and apples with bad brown spots on the side. The smell was likely coming from the frozen dumplings they had heated up. After I mentioned the smell, the next night, it was gone, but the food was no better. Breakfast was somewhat better, with eggs, potatoes, sausage and oatmeal, as well as cereals, bagels, etc. If you stay here, you'll do as I did and laugh out loud when you realize your reservation uses the phrase \"contemporary decor\" and then you look at the rooms. The rooms, elevators, and hallways are in need of a major renovation. The decor of the room and hallways is what I'd expect out of an unrenovated Holiday Inn, not out of a Westin, with stains on the sofa, unfinished molding on the ceiling, chipped paint, dents in the elevators, etc. In addition, our room had a sofabed. They gave us one very old-school green wool blanket for it. I asked for an extra comforter and they said \"we don't usually keep extras.\" Really? You have the exact number of comforters for the exact number of beds? What happens in an emergency, such as a spill, etc? Next, a big draw to the hotels in Circle Center is that they are all connected by Skywalk to the mall and to each other, as well as restaurants, etc. This weekend, the Skywalk was closed. However, if you looked on the website beforehand, and clicked on \"special conditions exist at this hotel,\" there is no warning about this. I realize this is out of the hotel's control, but if you are going to have a \"special conditions\" section, use it. All in all, this was not a good experience and I'd recommend this hotel get its act together, because there is a lot of competition in the area and despite having SPG Gold status, I'd stay anywhere but here when returning to Indianapolis. There even seemed to be something about the heavenly bed that wasn't that heavenly - maybe it was just that the rest of the hotel was so disappointing. As an aside, we HIGHLY recommend the Indianapolis Children's Museum. You could spend all day there with your kids and they will not get bored. It's the largest in the world and it was a lot of fun.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Night out”", "Author": "Chris B", "ReviewID": "UR120818458", "Content": "Wonderful Hotel with access to all of downtown Indy.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "georgia", "Title": "“Clean, Friendly Staff, Great Location”", "Author": "s w", "ReviewID": "UR120702352", "Content": "I love this motel and always stay here when I am in Indy. The staff will always go overboard to accomodate you. (Like finding you an umbrella when its raining) :) This is an extremely clean, well maintained motel and the location is excellent. You can use the skywalk to the convention center, the mall and many restaurants.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“Wellmaintained friendly hotel”", "Author": "lelou18", "ReviewID": "UR120575807", "Content": "We were on a conference in the hotel. Very nice and friendly staff. Very professional treatment. clean and cosy despite the vastness. it is connected to other hotels and the mall by a skywalk which make it easyto walkaround from one place to another in cold weather without suffering. good location and nice scenery. Clean, professional and friendly place", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Illinois, United States", "Title": "“Customer Servoce”", "Author": "jkdevoe", "ReviewID": "UR120442022", "Content": "I got lost in downtown Indianapolis finding the Westin Hotel; when I called the hotel, I was fortunately transfered to Ms. Terri Coleman; she stayed on the phone until I was in the driveway of the Westin. What a help./ Then when I checked in . they went overboard anbd let me have access tro the Priorty Room where Mohamad was so accomadating. I felt very cared for and appreciate the extra service they boyth provided.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lansdale, Pennsylvania", "Title": "“Fair price, friendly staff”", "Author": "ando19446", "ReviewID": "UR120360902", "Content": "I was very pleased with a stay at the Westin Indianapolis in late Oct. 2011. The price was very reasonable (even with the added Internet access fee) and I was pleased about the $5 off food coupon in return for not having the room made up after the first night's stay. The Westin Indianapolis provides very clean, pleasant, and comfortable accomodations and very helpful and friendly staff. I would definitely stay there again on any subsequent business trip to Indianapolis.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Centerville, Indiana", "Title": "“Westin Hotel”", "Author": "efields4", "ReviewID": "UR120356621", "Content": "We stayed at the Westin for a weekend get away. The hotel was under some construction at the time (lobby). Be careful with the in room drinks, if you just lift the beverage up they will charge you, even if you don't drink the beverage. The people at the front desk were ok, but I expect more of friendly smile than what I received. Rooms were average at best. Clean for sure. Overall it was ok.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Comfortable city stay”", "Author": "EvanL", "ReviewID": "UR120215414", "Content": "I stayed in a room on the 9th floor at The Westin, Indianapolis over a weekend in late October, 2011. The Westin is a higher-end hotel, conveniently located (joined) next to the Indianapolis Convention Center but some parts of the hotel are beginning to show their age. Check-in was relatively fast at the counter. concierge and counter staff were knowledgeable and efficient. The room was clean and well-kept, although it was evidently more than a few years old. The beds came with 5 pillows each and were very soft and comfortable (probably the most comfortable hotel beds) I've slept in), tiny fridge (no room for my stuff other than the snacks or drinks you get charged for using), desk and chairs and flatscreen TV. Bathroom was well-annoited (with the expected shampoo, conditioner, soap, and hairdryer) but was on the small side. The rooms were fairly well soundproofed, which is important as I'm a light sleeper. The gym (with 10 treadmills) was open 24 hrs a day and the heated indoor pool and jacuzzi were open till 10pm. The pool was showing its age - one of the support beams of the ladder was broken. Checkout was a breeze, with a receipt slipped under my door on the day of checkout. There were 2 restaurants on site (plus a Starbucks which closes by 3pm everyday) - Shulla serves expensive steaks. Stay away from their salmon - my colleague and I both came down with diarrhea the next morning after having grilled and blackened salmon. Two issues I had with Westin were: the tag on the bottled water said something like the drink is on us (complimentary) but I was charged $5.32 for it at checkout. And there was a card that said if you don't want your room cleaned (to be green), you can leave a card on your door and receive a $5 voucher at Starbucks, but the next day I received a note that this offer was not available that day. It was OK for a short business stay in Indianapolis and very convenient for meetings at the Convention center.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“this hotel has done nothing, but go downhill”", "Author": "gigidev", "ReviewID": "UR120115963", "Content": "Stayed there an annual conference October 30-November 1, 2011. Have always enjoyed my experiences in the past but this time, not so much. Although a good size, my room was dark, dingy and in need of repair. The light at the door, that was supposed to light the closet as well, did not work. I went to the front desk three times to report this and they were so busy, I didn't stay. The carpet was frayed and pulling up and the crown molding was incomplete... a really odd sight. The bathroom light was so dim I wasn't even sure what my makeup looked like. the magnifying mirror was a nice touch, but again... not effective in the dim light. . The fitness center was nice...equipment was nice and it was clean and well lit. Room Service was adequate but really overpriced. Having to pay for internet is another offense. Hopefully the conference will be moved to another hotel... I don't want to have to stay at this westin again. It gives the Westin brand a very bad name.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Clean, quiet and very comfortable”", "Author": "Stephen368", "ReviewID": "UR120111354", "Content": "The hotel's location downtown was perfect and the room was clean, quiet and very comfortable. Nice decor and helpful staff. It was definitely what I was looking for.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chesapeake, va", "Title": "“Good Location/No Big Complaints”", "Author": "produce592", "ReviewID": "UR120093314", "Content": "I stayed at this Westin from 10/28 - 11/1 after having a horrible and God-awful experience at the Hyatt across the street (see related post). I showed up at the Westin's front desk with no reservations, seeking a three nights' stay. John, a front desk manager in the evenings, was most helpful. He was able to provide accommodations for two nights but told me that he could not promise anything beyond that. He asked me to keep checking back. I did, and he was able to accommodate me for a third night. Thank you, John. The hotel has a spacious lobby. There are six elevators, so there is not usually a long wait for one. My room (1337) was clean, and the bed was very comfortable. There were plenty of clean towels. Many reviewers have noted the small bathrooms. This is true. They are small, but I managed. It was not a problem for me. The tub drained a bit slow, so as you shower, you might be standing in a few inches of water. Internet service is reliable but not free (10.00 a day). There are snacks and bottled water provided on those motion sensitive machines, so if you touch the snacks or the water, even if you don't eat or drink, you will probably be charged for it. It is better to take the Indy Go Green Line Shuttle from the airport for $7.00 one way as opposed to a $20.00 or more cab ride. The shuttle boards at the Zone 6 ground transportation area and stops near most major hotels in the downtown area. The Westin is centrally located. Lucas Oil Stadium, the Indiana Convention Center, and the Circle Centre Mall are all accessible by the sky bridge from the hotel, so you do not have to walk on the city streets if you don't want to. Walking the streets is not bad, however. I never felt unsafe, but it is still good to use common sense to avoid poorly lighted areas, and do not jaywalk. There seems to be a beggar/panhandler on almost every corner, but none seemed aggressive in any way. If you do not wish to be bothered, simply ignore them, and keep walking. My stay was a nice one. Either I am too easy to please, or some travelers are very critical. Probably the slow tub drain and the $10.00 a day Internet charges caused the most concern for me, but I do not think that it would stop me from staying at this Westin again. One final note of caution: Stay away from the Hyatt Regency next door!!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Comfy beds, friendly staff”", "Author": "colette2", "ReviewID": "UR120063511", "Content": "I enjoyed my stay here. The bed was very comfortable, and the room had all the amenities, including a fluffy white bathrobe. I even had a treadmill in my room (though I'm told it would normally be an extra cost of $30 had I not gotten the luck of the draw on my business reservation)! Convenient location, and staff always went out of their way to ensure my comfort. One thing I didn't like was the $9.95/day internet charge--why is it that I can get complementary wireless at an Econolodge but not at an upscale hotel (Marriott, this means you too!)? Also, the hotel had no airport shuttle service, so if you're coming by taxi it's between $30 and $40. If you miss the $7/each way Indy Go Green bus (like I did), it's either taxi or a limo service (which you should reserve in advance--$17). Overall, though, I enjoyed the experience and would stay here again.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "evansville, in", "Title": "“Sold on Starwood”", "Author": "paul b", "ReviewID": "UR120033953", "Content": "Westin Indy is my home away from home. Great service, friendly staff and the best beds in the industry. A bit pricey, but you get what you pay for. I have spent over 200 nights in the Westin Indy in the last 10 yrs and it is always my first choice.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Carolina", "Title": "“Nice Hotel, Great Location”", "Author": "MCCLAJW", "ReviewID": "UR119974432", "Content": "Stayed one night at the Westin in Indianapolis. Once we found the hotel (rush hour traffic, one way streets, kept missing the entrance), the hotel was very nice. We had a package which included parking, club level (evening snacks, breakfast) and internet access all of which was a great deal! Our room was clean and nicely appointed and the bed was comfortable. The staff in the club lounge were very nice and accomodating. The Pedways to the mall, convention center and other areas downtown were a great feature!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Woodmere, New York", "Title": "“Nice hotel and nice rooms!!!”", "Author": "egellman", "ReviewID": "UR119916432", "Content": "Hotel is nice and the rooms and Beds were comfortable. Nice gym. Starbucks on property. Hotel is in a great location.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Johns Creek, Georgia", "Title": "“Horrible Customer Service and unsympathetic Executive Office”", "Author": "roswellga1", "ReviewID": "UR119736087", "Content": "Except for the Engineering Staff (Barbara and Mark) who was truly sympathetic with their apologies (and offered free internet and free pay per view for the inconvenience,and tried to fix the problems), forget getting any sympathy from the front desk and of all places the executive administrative assistand (Gail H). For a $179/night, what you get is a toilet that does not flush, telephones that don't work, poor room service, and poor communications at the front desk and empty, unsympathetic \"apologies\" form front desk and Executive Office. In addition you have to pay $10/day for internet at this rate. I complained 3x about toilet not flushing. 1st engineer temporarily fixed the problem but said if it occurred again, inform the front desk that the mechanism has to be changed. When it happened a 2nd time I told front desk what engineer said.about replacing part. When it happened a 3rd time, the front desk said they had no record of any replacement request. I asked to be transferred and they were able to find one and gave me a room that did not have a King bed (which is my original reservation) that had both phones inoperable so I had to call front desk through my cell. They did not even provide room service for the day. I complained to the Executive Office to be transferred to the king bed and she had the gall to ask me if I had a Preferred Guest and how many more nights I was staying. When I asked what difference does it make if I did not have a Preferred Customer, she got defensive and grumpy. She said she would find a room. Since I had to run to a meeting, she said she would call my cell to see what she could do. As soon as I got of the elevator from their 3rd floor office to the Lobby (within 2 minutes), I got a call that there were no rooms available. Sure sounds like they really put an effort to accommodate a regular (non-Preferred Status) guest!!!", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Typical Westin; nice location”", "Author": "randomj", "ReviewID": "UR119482857", "Content": "I stayed here for a conference being held nearby. Everything in the downtown area is within walking distance and the Westin is centrally located. This is a typical Westin so the beds are very nice and room furnishings pretty good. The bathroom, though, is very small and feels very cramped. The public areas of the hotel were very nice including a large lobby, a Starbucks downstairs, free wifi and a very friendly staff. It also has a club lounge but you either have to pay extra ($40?) or get upgraded as a platinum SPG. I'm gold so I got nothing. Even the SPG floor was full so they relegated me to a lower floor. Sometimes I wonder whether it's worth being a gold SPG - I can get the same benefits without all the stays. Anyway, although I asked for the upgrade to the club level, it was politely denied. The Westin has an aboveground covered walkway that can take you to other parts of the city through a maze of tunnels. It's great when the weather is bad. Overall, it's a decent hotel in a nice location. However, it's getting a little old and they are a little stingy with upgrades.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis", "Title": "“Getaway Weekend Succes”", "Author": "ajcgocats", "ReviewID": "UR119404279", "Content": "We were going to a concert downtown and wanted to getaway overnight. The Westin proved to be the perfect spot to get this done. Check-In was easy and they were very friendly. There was alot going on - but they didn't let that bother them. Our room was very good - plenty of room - a chair to relax in and quite the view out of our 14th floor window. There was plenty to do within walking distance, or easy to do nothing if that is what was wanted. We will definitely stay at the Westin Indianapolis again anytime we are staying downtown.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Appleton, Wisconsin, United States", "Title": "“Good for a Conference”", "Author": "Julie H", "ReviewID": "UR119293577", "Content": "I attended a conference at the Westin and found most of meeting rooms spacious, well lit, and ready for presenters' internet access/projection of PowerPoint presentations. My king bed was comfortable. When I arrived, the bathroom seemed to be clean (new towels, drinking glasses, etc.), but there was no new shampoo or conditioner. Instead, the half-used bottles from the previous guest were left in the shower! I'm all for reduce-reuse-recycle, but this was unexpected. A friend picking me up at the end of my stay had difficulty finding the hotel (the maining address does not match the street address of the pick up/drop off area in front of the hotel when entered into a GPS).", "Date": "October 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Decent property but far below the typical Westin experience”", "Author": "DublinCityCruiser", "ReviewID": "UR119169138", "Content": "I was really disappointed with my stay here. The physical property was, on the whole, good. I received a reduced conference rate, which made the nightly rate affordable. The hotel room was average, but was nothing special and certainly not worth the regular room rate. Where the property fell short, in my opinion, was with the guest experience. They nickel and dimed me to the point that it became frustrating. The fridge was packed with their items at exorbitant prices. Remove a bag of candy from the fridge shelf to read the ingredients and a sensor in the fridge records this in their system as a purchase. The same for the bottled water on the cradle. I wanted to make a little space in the fridge so that I could store my sports drink and a yogurt and housekeeping suggested that I rent a fridge from them for an additional $20 daily fee. Why must they do this when there is a fridge in the room already? I had a package delivered from Amazon while I was staying in the hotel and I was charged a $20 receiving fee by the hotel. Room service was also ridiculous. I ordered an already overpriced meal from the menu and was hit with an additional 22% service charge. I really felt that I was being taken advantage of for every service that should be delivered as a courtesy and with a smile. I will not be back.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“I would stay here again.”", "Author": "Nemokota", "ReviewID": "UR118812283", "Content": "I had stayed here a few years ago so I wasn't too worried about finding it but I should have been! In the dark, in a rental car with poor visibility, with street construction and relying on Google directions using their address of 50 S. Capitol - I circled the block a few times and made two calls to the hotel to find it. If you call the hotel they offer a voicemail menu of directions but that was not helpful since the choices depend on what direction you are coming from and I had long lost any sense of north, south, east or west! A call to a live person finally got me there. The problem is you can't access it from Capitol street so you have to use a west Washington St address for your GPS. Happily when I got to the self park I got a space directly in front of the door. I found the self parking easy and pretty well lit but expensive at $26.00 which you pay at a paystation - not through your hotel bill and there is no cashier. Valet is $32.00. The good news is that when I stayed here at the end of September the construction in the lobby was almost totally done and it was very nice. I also got upgraded to a very nice two room suite with a nice view but it still had a very small bathroom. The Executive Lounge was somewhat of a secret even though it should have been accessible to me since I am Platinum. I asked about it at the desk and was told they had one and my key would let me access it. I got to my room, realized I didn't know where the lounge was, called and asked, was told the 15th floor and assured my key would work. Went to 15th floor and of course my keys didn't work so back down to the lobby and was told then that there was breakfast served there. I didn't make it up to breakfast but was able to grab a Diet Coke, orange and bottle of water there about 9 pm. Think I missed whatever else may have been offered in the evening.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Worcester, Massachusetts", "Title": "“NOT WORTH THE MONEY, STAY SOMEWHERE ELSE”", "Author": "Diane S", "ReviewID": "UR118754752", "Content": "Dear Westin Hotel - Indianapolis, When I stayed there this past August my ipad was stolen from my locked room. I reported it missing as soon as I noticed, which couldn't have been more than a few hours, tops. I felt really violated by the fact that someone had managed to get into my room, and that something so personal was taken. Today I got the letter from your insurance claim adjustor ( who is no longer with the company, I called and that is what they told me), that they weren't liable for the theft or replacing the item that was STOLEN from my LOCKED hotel room. I hope keeping the few hundred dollars was worth the loss of a LOYAL customer, because my husband and I will never, ever stay at your chain again. Thanks for nothing, D. Salvatore", "Date": "September 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "roadwarrior124", "Title": "“Not the expected Westin expereince”", "Author": "roadwarrior124", "ReviewID": "UR118676352", "Content": "I've been Starwood Platinum for 6+ years and am an enthusiastic Westin fan but I recommend my fellow travelers take a pass on this property. The construction is sloppy and deteriorating, frayed carpets, bowed walls, peeling wallpaper and water fixtures falling off the walls. My room was not serviced and the Service Express operator told me I must have left the Do Not Disturb sign on the door. That was not the case (I travel frequently and always check), No apology, no offer of fresh towels or a late service call. I requested coffee refills that usually come with a room refresh - never arrived. The Shula's in the lobby is actually pretty good but understaffed and busy. I guess I really only needed that one beer I was able to get. Most Westin's really know how to take care of the business traveler and I almost always have a great stay. Simply not the case here - try elsewhere!", "Date": "September 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dayton, OH", "Title": "“Look elsewhere!!”", "Author": "Mholten", "ReviewID": "UR118433848", "Content": "We stayed at the Westin Indy for two nights. First the good: Location is good, beds are very comfortable and pool/ workout area are fairly nice. Now the Bad: Small rooms with even smaller bathrooms that have mold and need some serious deep cleaning. Expensive parking $32 for valet and then had our car vandalised by one of the valet or bellman. No return phone calls from security for several days. Awakened Sunday morning by a barking dog in the room next to us at 6:30 in the morning. This was told to front desk at check out with no apology but instead simply, \"oh, that's not good, you should have called down to us\" $10 wi-fi charge, no refigerator in the room (other than the ridiculously priced self service mini-bar). That should about sum it up. Not what one would expect from a Westin Property.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Great Hotel! Wonderful customer service!!”", "Author": "teacherash88", "ReviewID": "UR118289543", "Content": "A group of 4 of us stayed here in July for my friend's bachelorette weekend! Immeadetly upon check-in we were upgraded to a club level suite (despite the fact that we paid very little for our room after booking on Hotwire) after informing the man checking us in that we were there for a bachelorette weekend. The room was large and spacious and anything we needed was quickly attended to by the hotel employees! Everyone we encountered while staying there was incredibly friendly and helpful providing us with suggestions for where to go, places to eat, etc! They were in the process of renovating the hotel so I can only imagine how nice it will be upon completion. I'm not sure how much the regular rate of room was- we paid only $80 on Hotwire which was an absolute STEAL for the service we received!!", "Date": "September 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Overpriced luxury”", "Author": "GStroud", "ReviewID": "UR118163963", "Content": "One would think that a Westin would be nice, maybe a little higher quality than a Holiday Express. This hotel was dirty and staff not friendly. Let me give a couple of examples. There were three people in the lobby registering guest. A airline pilot and assistant entered the lobby. Immediately they were ushered to the front of the line. I am in line and nothing said to me, explaining why they get to register first. When I got to the guy I asked and he said they just do that - can understand that at the airport, not hotels (unless they are trying to get to the airport). My bathroom towels were threadbare. The tub was dirty and the floor tile cracked. Last point, there were two coffees in the room, both decaffeinated - never could get that straightened out.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Nashville, TN", "Title": "“Come back in 2012. They might be up to Westin standards by then.”", "Author": "setcarp", "ReviewID": "UR118097051", "Content": "This property is under heavy renovation and is really not up to the Westin standards. The first sign was seeing the front desk built with some make shift parts left over from a trade show. The rooms were not bad. Because of the pouring rain I was not able to watch the TV (the remote did not work to boot) or get internet very well, so I discovered a walkway on the second floor that goes all the way to Circle Center Mall without stepping outside. That was an awesome find. I tried to take a shower at night only to find out that there was no hot water. I woke up and still no hot water. Upon Check-Out when I complained about the TV, TV Remote, Internet, and Hot Water I was told that the entire city was without hot water. A little hard to swallow, but ok. I know a lot of hotels that would leave a note for every guest to inform them that they would not be able to shower during their stay. I am sure by 2012 they will have this place up and running like a Westin should be.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Donegal Ireland", "Title": "“Not in a hurry back”", "Author": "denverDonegalIreland", "ReviewID": "UR117992660", "Content": "Hotel a bit of a mess doing some renovations, check in desk dont seem to have all the booking info,operating from what looks like an ice cream stall, but great they have a Starbucks but problem only open from 10 am to 4 pm (most likley times you are not there) Breakfast not great very basic (was looking foward to a big Amercian one) got only low fat yougourt and no Muesli only cornflakes", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Plymouth, Indiana", "Title": "“This Weston needs basic maintenance and a good cleaning!”", "Author": "IndianaNana", "ReviewID": "UR117800092", "Content": "We visit Indianapolis quite frequently and The Weston has always been a favorite place to stay. It is sad to see how bad it has become in just a short amount of time. It is in need of some major maintenance and a good cleaning. We recently attended a conference at the hotel and found the hotel in general, and our room in particular, in very poor shape. The wallpaper was coming off the walls in the bathroom, the cover on the bathroom light was broken and hanging down (this was plastic so it would not have been expensive to replace), the plug in the bathroom wasn't working, and there was very visible dirt and dust around the base of all the furniture. It appeared that it hadn't been cleaned well in a long time. The carpet in the elevators was stained and unsightly. This hotel reflect poorly on the Weston name and we will not stay here again. If we attend a conference at the hotel we will stay somewhere else and walk to the conference. Even at conference rates, this hotel is not worth staying at. I'd rather pay a little more and have a clean, well maintained room someplace else.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "5", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Elkhart, Indiana", "Title": "“HORRIBLE EXPERIENCE!!!”", "Author": "Mommyof478", "ReviewID": "UR117797901", "Content": "Horrible experience this past weekend!! The rooms at this hotel were nothing like they look like on the pictures...bathroom was DIRTYand VERY small. About the only good thing was the beds. A kit kat was 5 dollars!!!! And to top it all off, the 50 dollars we gave them for incidentals, conveniently disappeared and they had no record of me paying the 50 dollars!!! Went thru quite a few stressful hours of describing the girl that helped me, etc. They had to check security cameras, only to discover that because of their \"remodel\", they couldn't zoom in..therefore couldn't prove I paid her!!!!!!!!!!! We ended up getting the money back, but not without a dirty look, like we were lying about it. UGH, NEVER AGAIN!!!!! WORST HOTEL I'VE EVER STAYED IN!!!", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Indiana", "Title": "“NOT worth the price”", "Author": "mwbs1234", "ReviewID": "UR117530730", "Content": "I was very disappointed with my stay at the Westin. To start, the hallway was Very dark and the carpet was torn in a couple of places. The room was in a state of disrepair and it was dark. There were stains on the chair, the curtains were dirty and there were not amenities like a refrigerator or microwave. The bathroom was nasty, mold and mildew in the tub. The bathroom lighting was poor and falling down. The tempature in the room swung from freezing to boiling. There are many nice hotels around Indy, call around and you can get an updated, clean hotel for half the price!", "Date": "September 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“It's all about the location”", "Author": "tarmac_ted", "ReviewID": "UR117191864", "Content": "Ideal for any city centre event otherwise nothing exceptional. Very expensive in bar/restaurant but I'm sure other major hotels are comparable. Was very surprised that in-room WiFi was $10 per day as this was the 7th hotel we stayed in on a 3 week tour and the ONLY hotel to charge - come on, Westin, Internet in the room is now as much a utility as water and air. Valet parking was convenient but, again, required deep pockets - parking in the city anywhere is not cheap. Hotel was undergoing refurb but this didn't spoil our stay. We did experience problems with room keys not working and our bill being messed up but these were sorted out reasonably quickly. Room was clean and in reasonable condition -fridge had to be requested. Overall not bad for a city centre hotel but Westin could differentiate themselves by making small changes.", "Date": "August 24, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Portland, Oregon", "Title": "“Exceptional Service”", "Author": "Tracy78978978", "ReviewID": "UR117148945", "Content": "I travel every week for work, frequently to Indianapolis. The staff there always remembers me, and makes my stay enjoyable. This morning, though, I was completely surprised. As usual, I went to the Club Room for breakfast. Steve is the attendant, and he is always gracious and thoughtful to the people who rush through. Today, I had 10 minutes to eat. I was disappointed because they were out of yogurt, but it wasn't a big deal. On my way by, Steve pulled me aside and said, \"I saved a yogurt for you, would you like it?\" This particular act of kindness was amazing to me because of everything that went into it. First, he had to review the list of people the night before to see who might be coming to the Club Room that next morning. Second, he had to remember the names of the guests. Third, he had to remember each person's preference. You see, Steve and I had never actually talked about yogurt. So, he had observed on his own that I ate yogurt every time I came to the Club Room. Fourth, he must have been watching the supply run low and then saved one for me. It's a small thing, but it was incredibly impressive. Thanks, Steve, you're the best!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Evansville, Indiana", "Title": "“A bit faded compared to the newer downtown hotels”", "Author": "tbowes", "ReviewID": "UR117112013", "Content": "The Westin is still a decent hotel in an excellent downtown located connected to the convention center. However, the public areas and rooms are showing signs of needing renovated. Schula's is a nice place to have a night cap before bed. My biggest complaint is that the hotel removed their vending machines. When I called the front desk to confirm that, they informed me I could walk to the Marriott, that they had vending machines. Being late at night, I did not want to do that, so I took a coke from the mini bar not paying attention to the price, but knowing it would be a bit higher. To my surprise the next morning, I woke up with a bill under the door, and that coke was over 5 bucks with tax! And it was just a can!!! Dont use the mini bar!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“very hard to find..dont count on your gps”", "Author": "amylee87", "ReviewID": "UR116862107", "Content": "Took me 20 minutes to actually get to the hotel. The physical address leads you to know where. I had to call the front desk to get help. The hotel is under renovation but clean. I stayed over a week and my key locked me out after 5 days? they said it was automatic. That seems a bit silly and wasted my time waiting in line. Room service is decent and the pool is ok.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Needs Major Renovation, There are Better Options Nearby”", "Author": "AtlantaRes", "ReviewID": "UR116561432", "Content": "Many recent reviews have pointed out that this Westin is undergoing a renovation. That renovation, however, is limited to the lobby/check-in area. Many more renovations are needed! The corridors are dreadfully dreary. New carpeting, new wall coverings, lighting all are needed. The wireless internet is an added fee, and functional. The fitness center is adequate, but I would expect better from a hotel in the Westin tier of properties. One small positive is that there is a real Starbucks in the lobby. That and the potential for low rates are the only things I see recommending this property. I stayed at it because it was the site for my meeting, and therefore I got an extremely low rate. Otherwise I would opt for either the Hyatt or JW Marriott nearby.", "Date": "August 11, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“This hotel will sell your paid room if you are a late arrival”", "Author": "MaxbMax", "ReviewID": "UR116288216", "Content": "Max. Very poor regard for reservations paid in advance if you arrive late for check-in. They will sell your room to someone else and tell you they are sold out due to overbooking and try to put you somewhere else. Like Sheraton North, 40 minutes north of downtown. The entire purpose of booking there is to be downtown. Several months ago I made a reservation for my son and his family to stay August 3, 4 and 5 for the annual GameCon event. Due to his wife's father have to have emergency surgery they could not leave until Late Thursday the 4th. Both Westin res line and the hotel direct told me since I had already paid for the room with my hotel points the room would be there for him regardless when he checked in. Notes were place on the reservation to make sure. About 9 PM Thursday I received a call to my cell from John at the hotel asking if someone would be checking in. I called back within an hour and said yes, my son, his wife and two small boys were on there way from Chicago. He said they were oversold and had no rooms. I said they had no right to sell our room. He said they did. I guess our attorney will find out. So much for customer loyalty. I understand another 20 people were having the same thing happen. I think Jerry Jones pulled the same thing for the Superbowl to fans that traveled from all over. Now my son will have to drive from Sheraton North to an early event he has scheduled and leave his family at Sheraton North. When they go it will have to be by cab or Sheraton van. This should be covered by the Westin since it is their fault. I actually thought Westin would be above this kind of thing but John says they overbook all the time. So make sure you always arrive early to avoid your room being sold as well. Anyone experiencing the same treatment at this hotel during this week please contact me for a group complaint to the owners of the hotel, Westin Corporate and maybe something else. mlb0803@aol.com", "Date": "August 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Generally nice hotel but currently under construction for remodeling”", "Author": "Spunkykiki", "ReviewID": "UR116262959", "Content": "I have stayed here many time before, but I was surprised to check in to find the property under construction. I am slightly annoyed that the lobby is a mess and the Starbucks has not been operational for the past 2 days. Conditionally recommended - this place should be better post renovation. Until then, there are many other options", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Gaithersburg, Maryland", "Title": "“Friendly, under construction, promising”", "Author": "HJT4", "ReviewID": "UR116084452", "Content": "Stayed here on my way home from a family trip, time away for my wife and I. It had a wonderful location in downtown Indy. The hotel itself was quite old, undergoing refurbishing, probably why we got the nice deal that we did, including valet parking. Everyone was pleasant, had a club level room and access to the club w/ the rate. Was surprised at how little was offered in the club in the evenings . . . diet coke, coke, sprite and coffee/tea and some fruit. It was quite sparse compared to other clubs that I have been in. I was surprised, but another review had mentioned it, so I was not completely shocked. However considering that this was a Westin, I was still surprised. If I had paid a premium rate for the club access, I would have been extremely disappointed. Breakfast was nice, I was late getting there (after posted hours), but they still had enough that I was satisfied and it was well prepared. The gentleman that staffed the breakfast was very helpful. The room was nice, plenty of room for two and the bed was comfortable, but the refrigerator situation was weird, never used it but never really figured out what it was all about. The bathroom was very small, adequate for the two of us, but smaller than in any of the last 20 hotels that I have stayed at, again I was warned in a prior review, so not surprised. Finally, another funny point, there was only one bathrobe available (even though the reservation was for two adults), luckily my wife desired one and I did not, could have been problematic if we both wanted it. Overall, nice, clean and we had a good deal, would stay there again under the same circumstances, but would not want to pay more than we did.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Indianapolis", "Title": "“Just so-so”", "Author": "warriorforkids", "ReviewID": "UR115971220", "Content": "It is easier to not be critical when you aren't the one footing the bill (the company did) but I would be upset if I had paid high prices for this one. They advertise a spa-like shower experience, but we just had a regular shower and it leaked too. Beds are comfortable. Room is just like a standard hotel room. They did do a good job of feeding and entertaining our large group--just wasn't impressed w/ the room. Also, no free internet either, but that seems to be the norm in the room.", "Date": "July 29, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Columbus, Ohio", "Title": "“bad situation made good”", "Author": "JJS479", "ReviewID": "UR115540772", "Content": "I was here for the Kappa event and just wanted to voice an opinion. We stayed at this hotel and it started off really nice the hotel accomidations were ok. We had an issue one day with the room and went down to talk to someone about it at the front desk I believe the guys name was Ed, i think he said he was the manager. He was not very nice in fact he was a bit rude to myself and others in my party when we were trying to get everything situated. He didnt want to hear anything we wanted to say and just kinda shooed us away. I was a bit heated so went back to the room and called down, in hopes of getting someone who would be a bit more helpful. I spoke to a girl I think her name was Jess or Jessica. Anyway, she was GREAT, complete opposite of the other guy. I explained the situation to her, and not only did she remedy it but she even gave a follow up phone call to make sure we were all taken care of. Kuddos to her.", "Date": "July 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Disappointed”", "Author": "AJWCMW", "ReviewID": "UR114964395", "Content": "My husband and I were celebrating our anniversary and wanted to live it up for a night so we thought the Westin was a good choice. When we walked into the hotel we were very impressed but that didn't last long. The room was very dated and extremely small. The bathroom was so small the door couldn't open all the way and the shower sprayed up and out over the shower curtain. I was hoping for a room like what was pictured on the site and it was far from it. The bed was very comfortable and clean so I will give them that. It was in a great location as well so that was a plus. We just wanted something a little more luxurious for the money we spent.", "Date": "July 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Just fine.”", "Author": "Juliatheprofessor", "ReviewID": "UR114747226", "Content": "Stayed for a conference since the new JW Marriott was sold out. First room had a rattle in the AC so I requested a room change which solved the problem. Everything was clean, elevators are fast and the skywalks connect everything. Internet is around $10 per day which is annoying for a $140+ room. GPS will say you have 'arrived at destination' but parking is tricky.", "Date": "June 25, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“not so great for cost”", "Author": "Solange72", "ReviewID": "UR114583546", "Content": "Very expensive...costly, so-so front desk, so-so breakfast, costly parking", "Date": "June 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Very nice hotel, but everything is extra”", "Author": "spaceheartl4", "ReviewID": "UR114436684", "Content": "Got this hotel at a discount. The room was clean, the view overlooking downtown Indianapolis was beautiful. Just beware the internet is extra ($10/day), as is parking (about $25 for 24 hours), but paid parking is common in the middle of a big city. Also, DON'T TOUCH the snack/mini bar items, they are weight sensitive! Seems to be a common issue though since they came to check and saw we hadn't eaten ours so we weren't charged. The bar downstairs was about what you would expect (~$10 cocktails) but service was a bit understaffed. Fitness center had plenty of cardio machines, all were very nice with towels and headphones with individual tvs on the screen. Didn't use the pool or hottub but they seemed clean. Very centrally located hotel, riverfront only about 3 blocks away.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Southern California", "Title": "“Overrated - Overpriced - Smallest Bathroom Ever”", "Author": "BadDiver", "ReviewID": "UR113463371", "Content": "My entire family was booked here for a family wedding. While the central location was great, the rooms ... not so much. This was absolutely the SMALLEST bathroom I have ever seen in an \"upscale\" hotel. Barely room for one person to stand; inadequate counter space; plugs that wouldn't stay plugged in, mold in the shower, etc. They did provide a bathrobe - ONE bathrobe for two people. I asked them if we were supposed to flip a coin over who got to wear it ... they finally said they could send another up to the room. The only restaurant onsite is Shula's Steakhouse (super expensive) and a Starbucks. The onsite parking is ridiculously expensive!!! On the plus side, the exercise room is phenomenal and the lobby is very nice. However, I was there for three nights ... after the first I should have checked out and gone to the Holiday Inn Express across the street; I'm betting the bathrooms there were more spacious and they throw in breakfast as well!", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bedford, Texas", "Title": "“Always a great experience”", "Author": "Lex682", "ReviewID": "UR113169498", "Content": "This is my second time staying at this hotel - both times for business. It is close to everything. The staff is always professional and easy to work with and the rooms are clean and well appointed. I would highly recommend this hotel as a great place to stay in Indianapolis.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "New Albany, Ohio", "Title": "“Just okay, a little long in the tooth like most CBD Westins”", "Author": "OSU_Sux", "ReviewID": "UR111368217", "Content": "Like the Westin Crown Center in KC, this one needs a serious job on exterior windows. That said, this property is nice and in reasonably good condition. I was upgraded to an SPG corner suite which is impressive and has a wonderful view of the capitol. So here it is straightforward: THE GOOD: - central location with good access to downtown area - sharp lobby, great SPG lounge - easy access in and out, valet is fast - nice corner suite with great views for upgraded SPG - room appeared and felt quite clean THE BAD: - the bathroom is very tight, and the toilet bowl is small to sit on - pool had a mysterious odor and was very basic - hot tub in pool area needs a scrub down - no free booze in the SPG lounge - no plastic laundry bags - dirty panoramic windows - bathroom was a little dingy and smelled musty (lack of consistent vigorous cleaning of commode) All in all I would stay again as I did not hear great things about the JW and it is inconveniently located to the center of action, however the Conrad would still be my first choice, rate permitting.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chantilly", "Title": "“Okay, but not great.”", "Author": "Shadow1999", "ReviewID": "UR109256330", "Content": "Looks very nice from the outside, but rooms smell funny, mold in the shower. Internet expensive. Front desk staff did not seem knowledge and in a hurry to get rid of you. Someone standing in line with me was told he could not get a receipt for his stay. Would not recommend to others.", "Date": "May 21, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Service was phenomenol”", "Author": "CRMays", "ReviewID": "UR102338930", "Content": "I fell outside of the hotel at the end of the drive. I couldn't get up immediately and a bellman named Gerald ran to help. Not only did he pick me up, but he walked me in holding my arms. He was a very humble and kind man. Once inside everyone was very accomadating. I have stayed in this hotel many times. The service has always been good, but this was above and beyond.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Perfect”", "Author": "Ttklein40", "ReviewID": "UR100444173", "Content": "We stayed at the Westin for the Women's Big Ten Tournament. Every staff member went out of their way to make sure we had everything we needed and that our stay was a good one. The room was spacious and clean. The location downtown is within walking distance to many restaurants and shops and the mall.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hoopeston", "Title": "“Wonderful!”", "Author": "kle1974", "ReviewID": "UR100076305", "Content": "I love this hotel! We were in Indy for a race at Lucas Oil and were within a few minutes walk to the stadium. Great location! The room was great! We were in room 1008 which had an awesome view of the Capital Building. I had read reviews that it was has a small bathroom but I didn't think that at all. I was very satisfied with the size of the bathroom and the room. We didn't use the parking at the hotel because there is a garage on the other side of the Marriott that was half the price. I was very happy with this hotel and I would stay there again!", "Date": "March 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NE Indiana", "Title": "“Good stay in downtown Indy”", "Author": "MLandLM", "ReviewID": "UR98951650", "Content": "Overall a good stay. You have to pay for parking on top of the room. The desk staff wasn't really on top of things and the hotel is showing it's age. Overall a nice stay and very close the everything downtown.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Internet Cafe feeling.”", "Author": "youngworldtravelers", "ReviewID": "UR97755357", "Content": "It was my first time at a Westin in Indianapolis and I was a bit disappointed. Lets start off on a positive note though, the rooms were nice! Comfortable bed and clean! The food at Shula's was also delicious! I would definitely recommend Shulas! The big draw back was the internet. I was traveling for business and needed to send a few emails. The internet in the rooms was not free which is totally standard and understandable. Since I only need to do a few things I decided just to walk down to the business center only to find out that it was just like an internet cafe! .49 per minute 3 min minimum! You are kidding right? Not only am I paying close to $200 per night but there is not internet and no breakfast. Sorry Westin but that was a bust!", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Indiana", "Title": "“Nice hotel, but don't plan on sleeping through the day”", "Author": "BackYardDad", "ReviewID": "UR96388201", "Content": "Feb 2011 - Indianapolis, massive ice storm. I was stuck downtown and not able to get home and my company put me up in the hotel for one night so that I could get some rest. I work nights and had a 2 day reservation so that I could sleep during the day. Arriving at the hotel is what is expected, nice lobby, nice staff. Check in was okay and quick. Like others who reviews this hotel, I did have problems with the room and stay. First, the cordless phone did not work. But there was a corded phone there and it worked. Everything cost, I was scared even to sit on the bed, wasn't sure if there was a surcharge. Water $4.00, candy bar $5.00...wow. Well the bed was comfy, lots of pillows, but I could hear everything that was happening in the room next to me, the TV, the water running, the toilet flushing. I figured since I got there in the morning (to sleep all day) that it would end soon....I was wrong. I heard all of housekeepings duties, heard door's opening and closing, heard people talking in the halls, heard loud bangs. The rooms do not have a nice loud A/C or heater to drown out the noise. Needless to say, I did not sleep well during the day. But I figure most people sleep at night so the noise probably not so bad then. Like other people, I found the bathroom extremely small, lots of mold and rust in the bathroom, but it didn't keep me from using the facilities. Just if you are a large person, don't expect to get in the bathroom and close the door. If you plan on staying here, high speed internet is $10.00 per night.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“My Favorite Indy Hotel!”", "Author": "DallasGatr", "ReviewID": "UR95707100", "Content": "I was stunned to see this facility rated so low. Beautiful hotel, standard great Westin rooms, good fitness room, great location. I've stayed here many times over the years and have always enjoyed my stay. Highly recommended.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“never again”", "Author": "homeykat", "ReviewID": "UR93638513", "Content": "The first impression I got was okay, the lobby is nice, but it smelled of natural gas. We checked in and got our room. We went to the room and the halls were narrow, dingy, and dimly lit. The room at first glance was fine. I forgot something in my car so I went to the valet desk and asked for my car so I could retrieve my forgotten item. The valet gave me my keys and directions to the valet lot and my parking spot number. Not sure why I paid extra for valet. We were at an event at the convention center, so the walkway to the convention center was wonderful. The bathroom was filthy. There was mold in the shower and on the door hinges. The phone didn't work, you couldn't answer it. The desk kept calling and we had to call them from our cell phone to tell them the phone was broken. They never offered to send someone to fix it. When we shared our concerns at checkout, the man at the desk was indifferent. We had pictures of the bathroom and he didn't look at them. He told us they would take the room off the market to get it cleaned. I asked to speak to a manager and none was available. It took me 2 days of calling the Westin and their corporate office to get a response.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Nice Hotel”", "Author": "panhandleguy", "ReviewID": "UR92528140", "Content": "My wife and I stayed at the Westin for a night away and to attend the Colts game. Parking was expensive but it was about the same as any other hotel in town so no big complaint there. The room was very nice with a great view of the City, I just thought the room and the bathroom was a little small. The staff was nice at check in and we had no problems with our room so I didnt have any other interaction with them, we did not eat at the restaraunt (although I would have liked to, time just didnt allow with a playoff game) I wasnt really a fan of the \"snack bar\" in the room that had overpriced snacks sitting on sensors that alerted the desk and billed you if one was removed, but I guess its a way to make money so I understand. The hotel is very nice and convienant to downtown with attaching skywalks to several places. We have stayed at alot of hotel downtown and this one is at the top of the list, I liked it alot better than the Hyatt, but not quite as well as embassey suites (which is closer to the circle but farther away from lucas oil) All in all I'd say you cant go wrong staying here.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great place and great food!”", "Author": "HungryBackpacker", "ReviewID": "UR91419391", "Content": "While this is as good as any other westin, what I loved was the restaurant on site - Shula's. It makes your day when you can end it with the salmon and sides and Shula's and then snuggle back to your room upstairs with a bottle of wine! Definitely recommended; especially if you are on a business trip. I could find no other hotel in the downtown area that was more comfortable and convenient. Make sure you reserve though; I find it tough getting a room here at short notice.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arnold, Missouri", "Title": "“Outstanding Service”", "Author": "Colmklein", "ReviewID": "UR89994127", "Content": "I am writting this review to commend John the front desk associate at the hotel. Due to a winter storm me, my wife and teenager daughter were forced to extend our stay one more night after a Cheerleading event (12 Dec). John was a savior finding us a room in record time and helping us in every way possible. What a wonderful experience under stressful conditions . Please commend this fine individual for a job well done!", "Date": "December 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“The staff is WONDERFUL!!”", "Author": "MsTasia2U", "ReviewID": "UR88422653", "Content": "The hotel is a nice hotel. The beds are very comfortable. I did have problems with the internet and my drain and I know things like this do happen. However, Bob Miller with the Engineering was very helpful. He was very polite and fixed my internet even though that isn't what he came up to fix. The rest of the staff was wonderful as well.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Denver", "Title": "“close to downtown mall and restaurants”", "Author": "Jeanette49", "ReviewID": "UR87536389", "Content": "Hotel could use some upgrades. Room service hours have been decreased over the recent past, Shula's service/food has gone down (hotel restaurant).", "Date": "November 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Courteous Staff, Otherwise Average Accomodations for an Above-Average Price”", "Author": "easy1toplease", "ReviewID": "UR87444926", "Content": "The staff are extremely smiley and nice, but the hotel itself is just average - and IMHO overpriced for being so average. The phone in my room didn't work, the showerhead in the bathroom was extremely scaly, the towels were rough and scratchy . . . and a yogurt in the morning costs $6. The bottle of water they placed in the room cost $4. And it costs $10 for wireless! There's a bar-b-q joint my town that offers free wireless, but you pay $150 for a hotel room and they can't throw that in too??? There is also a business center whose computers you can use, but it costs $0.59 cents/minute - no thanks! Also, when I tried to call the front desk (with my cell, because the phone in the room didn't work) the most appropriate choice on their menu of options was for Reservations. When I got in touch with Reservations, I discovered that a) the employees taking reservations are in CANADA and b) they don't give out correct information anyway. I was asking if they have toothbrushes if you forgot yours and was told NO. Later I found a card in the room that listed free amenities - and guess what? - they DO provide toothbrushes. I would have left all the above on a comment card, except NONE was provided in the room. In sum - Motel 8 accomodations, Four Seasons prices!", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "LaPorte, Indiana", "Title": "“Very nice hotel, excellent location!”", "Author": "erjer08", "ReviewID": "UR87301323", "Content": "My husband and I stayed here for our anniversary the hotel was great. I loved that it has a Starbucks right in the lobby.It is also in an ecxellent location so close to all the great spots, the mall, musuems,bars, cafes,restaruants. The only think we didnt like at all adn would not recomemmend was the Restaraunt \"Shulas\" located in the hotel. We had heard this place was a great place to eat. However our steaks were not cooked the way we had asked, so we sent them back and they still werent right, so we ended up leaving most of the steak on the plate. My was so chewy I felt like I had peice of tough bubble gum in my mouth, my jaw hurt from chewing that I couldnt even finish. It was way over priced for what we got and they didnt even offer a discount off the food!!", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plainsboro, New Jersey", "Title": "“The Westin, Indianapolis: Why Stay Anywhere Else?”", "Author": "leichlit", "ReviewID": "UR85726908", "Content": "Although I stayed at the Westin for business, it was \"all pleasure.\" From the quick and courteous check-in, to the extremely comfortable room, to the equally quick and courteous check-out, I was more than pleased. The conference facilities were excellent (except for a few heating/cooling issues that were quickly remedied) and the staff was attentive and efficient. And I appreciated the \"green\" options. I would highly recommend the Westin for visitors to Indianapolis. It is centrally located to many other city venues within walking distance, and a short walk over the enclosed skywalk allows vistors to access the mall without braving the weather. I wish I could have stayed longer!", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Westchester, NY", "Title": "“great location, nice hotel”", "Author": "NYBuddy33", "ReviewID": "UR85221248", "Content": "The Westin Indianapolis is a nice (not great) hotel located in an ideal location attached to the convention center. The rooms ae comfortable and the heavenly beds are indeed heavenly. The hotel is large, but smallish compared to those located in big cities. Service is good.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Well-located”", "Author": "Lo_in_WI", "ReviewID": "UR85153330", "Content": "After the large group of high school students left, the hotel became a fine place to stay. On the first day of a three-day stay, my room wasn't cleaned until after 6 p.m., but given the capacity crowd, I guess that was okay. The hotel is in a great location with sky-walks to the mall, convention center, and restaurants. Given that we had nasty weather, the location was perfect. The fitness center was clean and well-appointed. Good selection of machines. I wish they had a shutte to the airport, though.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmond, Oklahoma", "Title": "“Beautiful, friendly, but has its problems”", "Author": "OKCChildpsych", "ReviewID": "UR84924463", "Content": "I'm going to say I'll recommend this Westin, but with a strong reservation. If you need spotless, continuous Internet, bring your own connectivity (front desk staff say the system is about to be replaced, but it hasn't happened as of this posting). The hotel is beautiful and ideally situated for downtown activities and conferences- we never had to take a taxi and during foul weather citygoers can stay inside to get to almost every attraction and restaurant. There is one staff- Jason, to be exact- who goes out of his way to provide excellent service to each customer he sees. I didnt get to know the others as well, but I only experienced friendly staff throughout the stay. It also houses its own medium-sized workout facility and indoor pool/jacuzzi. It is missing a spa, which would have been great as I had two back-to-back trips and could have used some TLC. But th at's not a complaint- most hotels here don't have in-house spas. I only have two issues of concern: the close presence of the restaurant- which is starting to smell less 'fresh,' has seeped into the lobby carpets and even the elevator landings. I could smell it all the way up to my room near the top floor. Secondly- and this is my chief concern- the ibahn Internet system at the hotel has significant issues. The hotel ended up comp'ing my internet (for which I'm eternally grateful) because neither wireless nor cabled internet was working in my room. The hotel also advertises free lobby wifi service, but, along with 5 or 6 other lobby denizens, I was unable to keep the connection going for more than a few minutes, and the staff was baffled by repeated complaints, unable to give anyone a working answer or look into the problem while we were there. Will I stay here again? Probably- they host a conference I attend on a yearly basis and the rooms are terrific, as well as the staff I met. I strongly suggest they either get ibahn to permanently fix the connectivity and signal issues, or find a new provider. And maybe replace the food-smelling carpets.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toms River, New Jersey, USA", "Title": "“Nice Stay..”", "Author": "hoaty", "ReviewID": "UR82192154", "Content": "First off I got a good deal with Priceline, so I can't say anything about the cost. And I was very satisfied with my stay as far as my room went. Second, I did not need to park so can't comment on that. I was there for four nights. I needed 2 days of Internet, so I paid the $20.00 for that. Personally I think all, and any high end hotels should offer free internet. Or at least not $10.00 a day. .. I did not eat at the Westin. The first morning I looked at the room service menu and saw 2 eggs any style for $12.00. At $6.00 an egg we decided to go out. Right next door there is a Patachou and we had a very nice breakfast there. In fact we went there every day to eat breakfast. Upon check-in the clerk nicely suggested that the snacks in the room are on a sensor. \"So even if you pick up a snack and place it back down, you will be charged\" he warned us. Needless to say I tried not to bump into that obstacle for fear I might shake up the candies! All that said the stay was nice. The room was clean and bathroom spacious. Breakfast, Lunch, & Dinner were done out in Indianapolis. I was there during the Colts - Giants game, and the Giants were staying in the hotel. As well as Archie & Olivia Manning. So it certainly has a good rep. I did use the gym and the pool. Both well maintained...Clean, quite, comfortable, Overall a very nice stay. But wasn't involved in some of the things that a lot of complaints seem centered on. .. oh one quick note, the room has a flat screen tv, very nice, and the remote stopped working. I called down and they said they would send a service man right up with a new one, and 4 minutes later with a knock on the door came a new working remote... can't leave a man without his remote !!!", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brookfield, Wisconsin", "Title": "“Just Okay but Great Staff”", "Author": "caliey", "ReviewID": "UR82109760", "Content": "Pros: Clean; comfortable bed; nice TV; The staff was great. Cons: Thin walls (could hear everything in the hallway and in next room, slamming doors); extremely dirty windows (note photos). Maid service didn't come until 4:00 one day, so she had to clean the bathroom and make the bed while I was there. The room had been empty for 4 1/2 hours (11:00 to 3:30). A bit of an inconvenience when I wanted to lie down and relax after walking the entire city. Was there with my husband who had business meetings. Food was just okay for the luncheons that the hotel supplied. Starbucks right off the lobby. The bathrooms were small but fine for the two nights we were there. The two headed shower was very weird. No one could figure the \"why\" of it. Shula's was excellent. Loved walking the city. Great looking museums, architecture, etc.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Evansville, Indiana", "Title": "“Not worth the cost”", "Author": "Allie218", "ReviewID": "UR81953755", "Content": "The Westin did not live up to our expectations for a 4 star hotel. The positives: great location, great view from our room, beautiful lobby, comfortable bed, and a Starbucks in the lobby. Those are probably the only good things I can say about this hotel. The walls were paper thin and we were awakened time after time at night by noise from the hallways. While in the bathroom, I could hear someone in the room next door relieving himself. Gross! The carpet in the room and hallway was stained. There was a pile of extension cords and wires behind the mini-fridge that not only looked very tacky but also like a fire hazard. Forget ammenities, there is an extra cost to everything at the Westin. The self parking cost was outrageous. I expect to pay a parking fee downtown but with this garage, ANYTIME you parked for more than 2 hours and left again you were charged $26. As a paying hotel guest, I expect a daily charge that doesn't change no matter how often I come and go, not to be paying every single time I leave. If you plan on driving anywhere during your stay, do not stay here! They tried to talk us into valet but that was also at a high price. I think it is a joke to pay for high-speed internet in this day and age and they use a per computer charge, not per room charge. My husband and I both needed to use our laptops when there and it was going to cost us $40 for two days of internet use. We called the front desk to ask if this was indeed the case and a nice man agreed that it was crazy to have to pay per computer and waived us the cost of one of them. We won't be staying here again as there are much nicer hotels nearby that are a much better value.", "Date": "October 3, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "san francisco", "Title": "“some hotel staff steals valuables from guest rooms”", "Author": "12samos12", "ReviewID": "UR81269032", "Content": "at check-in a staffer evidently noticed my watch, which, along with my wallet and iPodTouch, were all stolen later from my room. Yes, of course I had locked the door! Obviously an inside job. The staffer evidently made several months' worth of income from that little heist.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver,CO", "Title": "“Diassapointed”", "Author": "Denverfoodlover", "ReviewID": "UR80046257", "Content": "The hotel was not up to my expectations of a Westin hotel.I was disappointed upon checking into my room. The bathroom floor was not clean and was missing the shampoo and conditioner. The bathroom was very small. The bedroom was very clean and the beds were very comfortable. The other disappointment was the breakfast. We were seated at a table with a dirty placemat and only one serving. We opted to move down two tables where the table was complete with silverwear and napkins. The plus with the hotel is that is is close to the convention center.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Mechanicsburg, Ohio", "Title": "“Not what we expected”", "Author": "timzmail", "ReviewID": "UR78554929", "Content": "We decided to visit Indy on a whim. The first time in 28yrs we had gone away for a couples get away and not a family vacation. We booked thru hotwire so we can't complain about the price we paid for the room. The room did need updating. We noticed something smeared on our comforter and it was quite noticeable. After the room was \"cleaned\" we discovered they had only flipped the comforter so that the stain was at the bottom of the bed. Guess they were hoping we wouldn't notice? Also, we had only one bar of soap- no shampoo, lotion, etc. And our alarm clock went off both mornings- at 5:30 am and the next morning at 5:40!! Tend to think housekeeping moved the button while cleaning. Overall just an ok hotel but the location is great.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“The hotel was okay, BUT DO NOT VALET YOUR VEHICLE!!!”", "Author": "bhaywardjr", "ReviewID": "UR74430484", "Content": "Overall, my colleagues and I enjoyed our stay minus the mold in the refrigerator and the valet that decided to pilfer a book of postage stamps from the console in my vehicle. Considering the additional charge for valet, you would think that you wouldn't have to hide something as simple as a book of stamps. Other than that, the treadmill and workout equipment in the rooms came in handy and Shula's Steakhouse was excellent.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ky", "Title": "“ALL YOU CAN ASK FOR AND MORE”", "Author": "buya40", "ReviewID": "UR74304109", "Content": "Please take full advantage of all the hotel offers Heavenly beds, great food, centrally located, professional staff, quiet during sleeping hours, well maintained, nice linens Need i say more? self or valet parking, housekeeping pronto, refrigerators upon requests, updated rooms, city views, skywalk connections to shopping, convention center and short walk to Lucas stadium. Overall a luxury hotel with affordable prices.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "south bend", "Title": "“still not a bad place to stay”", "Author": "3duckdave", "ReviewID": "UR71486852", "Content": "After staying at this hotel before and reading many reviews, I don't understand why people have so many problems when they stay here. We booked a night here again using Priceline, got a great deal. I had no problems checking in or out. The desk attendant mentioned/ warned us about the vending machine/ mini bar in the room. Which I already knew to avoid. One thing I didn't notice before was that the bottle of water on the TV stand is also weight sensored like the mini bar. On this visit we had room 1136, on the eleventh floor. The room wasn't very big, but still felt spacious, even with a King bed. It had chair as well as a business center/desk area with office chair, and about a 32 in. flat screen TV. The bathroom was very small, and also very dark. Great water pressure and plenty of hot water. The bath tub did lack any kind of traction tape. I was apparent that there had been some at one time, but none was present during our stay. Be warned the tub is slippery when wet. I should mention that you will need your room card to enter the room with the ice machine and soda machine, kind of a pain. Other than that i still think the Westin is a good place to stay.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“NOT a 4 star hotel”", "Author": "heartshoes", "ReviewID": "UR71403026", "Content": "Terrible hotel. I've stayed at other Westin's and they have been wonderful. I still can't believe the Westin chain would put their name on this hotel. It felt like kids were running the hotel and they all seemed completely overwhelmed. 1. The bed was lumpy and hard 2. There was no noise control 3. Our room key had to be reprogrammed after every entry 4. The staff didn't know where anything was 5. We wanted a cab and they told us to go get one. They called one after WE suggested they get one for us. 6. The air conditioning was completely out of wack. The heat would go on if the thermostat hit 68 degrees 7. Carpet was dirty 8. Someone spilled some kind of beverage in the elevator and it was there waiting for someone to slip on for over an hour I'm hoping they were remodeling because the overall feel was very generic and had no style. We will never stay there again and I'm very hesitant to ever stay at another Westin.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Boca raton", "Title": "“What a fiasco- avoid this hotel!”", "Author": "DocBocaraton", "ReviewID": "UR71354313", "Content": "We just stayed at this hotel, with no awareness that this was across the street from the Black Expo. We literally could not return to the hotel last night, as all streets were blocked off, with no forewarning from the hotel! We literally had to circle the area for 2 hours before a policewoman finally succumbed to our begging. In the restaurant, the dishes and glasses were dirty. The \"concierge\" desk was unavailable dueling our entire stay. I was shocked by the lack of communication on the part of the hotel staff with the hecticness of the place. I would strongly recommend avoiding this hotel, as there are so many other choices. Shame on the Westin!", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Loved the bed!!!”", "Author": "LolaFamilyOfThree", "ReviewID": "UR68972574", "Content": "This was the first time at a Westin and my husband and I loved it! It was nice, clean and comfortable. It was just walking distance from the places we wanted to go. My favorite part, the bed!!! I want one, slept like a baby! And a great view from the 14th floor.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Really, Westin - You've Done So Much Better In The Past”", "Author": "AimeeLeigh", "ReviewID": "UR64547822", "Content": "The valet drivers and people at the front desk were very nice and polite...but the hotel itself? Ick. Leaking faucets in the bathroom, no cold water coming out of the taps, filthy shower, a broken AC (the room was hot and humid and we couldn't do anything about it), questionable towels, and paper thin walls...it was really disappointing, actually. Especially since the other Westin hotels I've stayed in have been GLORIOUS. The location is ideal - you're close to downtown but you don't get all the noisy foot traffic - and their restaurant downstairs isn't that bad, either. All in all, very disappointing, but I'm still going to stick with Westin hotels when I travel.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“This hotel has seen better days”", "Author": "jsilva12", "ReviewID": "UR64431262", "Content": "The lobby area was nice as was the exterior. It was in a excellent location but that's the best of it. The room was worn and had seen better days. I was shocked how bad the rooms were for a Westin. I don't think I would stay here again, the Hyatt down the block was a much better stay...", "Date": "May 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Washington, Indiana", "Title": "“Never again!”", "Author": "confused_1987", "ReviewID": "UR63129900", "Content": "The hotel lobby was probably the most appealing thing about the hotel. The elevatiors where fast but the doors opened before it stoped so please don't stand to close. The the tables in the hallways looked like the came from a used store and the layed marble on top of them, they where scrachted all over. The carpet looked like it was the carpet they installed when the hotel opened. When walking into the room it looked like any other room but we soon found different. The bathroom was so small you had to squeeze between the sink and toilet just to shut the door. The sink itself was falling out of the counter the only thing holding it up was the drain pipe. There was what appeared to be gum stuck on the floor. The showerhead was nice but not what it was made out to be by other reviews. The bed was probably the nicest thing about the room but the pillows where stained. The little fridge was full of the hotels stuff and was very over priced $7.00 for a bottle of water. The chair and foot rest didn't match and had a spring trying it's best to come through the seat of the chair. The parking was way over priced they charged us $30 dollars a day. They left our lights on and in the the car needed to be jumped. Please read this review before considering staying at the Westin in Indianapolis I would not recommend this hotel to a friend or anyone for that unless you are desperate.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Indianapolis, IN", "Title": "“A hotel with a fantastic location but needs new housekeeping guidlines”", "Author": "deejayplus2", "ReviewID": "UR59778840", "Content": "We spent 2 nights at this hotel to celebrate our anniversary. The location is fantastic with the skywalk that lets you get around downtown Indy without getting out in the elements. Unfortunately, this hotel needs help with cleanliness. When we checked into our first room, there was a smear of what we assume was chocolate and crumbs over the white bedding. Yuck! We called downstairs immediately & they gave us the room to a new room and told us to meet them there. We went to the new floor & stood outside the room for awhile waiting for someone to meet us. Finally someone else came to occupy the room so we had to go back downstairs to get another room. After finally receiving a 3rd room, we were all set. The room had a great view & was quite spacious. Unfortunately, the shower was nasty - little curly black hairs & other gross stuff smeared on the wall of the shower, plus the back of the bathroom door. I dropped the back of an earring on the floor in the bathroom and was greeted with all kinds of dust bunnies under the bathroom sink. The bed was clean so we decided to go ahead & stay. The room with the pool was dirty as well. There was trash and spilled food items all over the floor. I understand that a group could have just been there but we came back hours later and the mess was still there. The pool water was cloudy & you could not see the bottom. The hot tub was also dirty and the jets were on so strong there was nothing relaxing about sitting in the hot tub. That is the first hot tub I have ever sat in and had water continually, violently splash me in the face. The location of this hotel was fantastic but their housekeeping department really needs to kick it up about 10 notches. Ewww!", "Date": "March 28, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Mt Carmel", "Title": "“Whilwind Weekend was worth every penny”", "Author": "ravey_baby24", "ReviewID": "UR58830581", "Content": "It was my first stay at a Westin and it was a tad expensive on our budget but the 2 night stay was well worth it! The staff was friendly especially the bartender we met at Don Sulah's Steakhouse. The bed was so comfortable I looked into purchasing the type of mattress they had in the room! We would happily spend another anniversary weekend at this Westin!", "Date": "March 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Wireless issues”", "Author": "ChicagoSPGPlatinum", "ReviewID": "UR56427578", "Content": "I have been coming to your hotel for the past few years - on average about 7/8 times per year. I am a platinum member of SPG - and stay at various SPG properties across the country. The wireless service in your hotel is by far the worse I have experienced in any SPG property. And has been for the past 1.5 years. I have complained numerous times (and always ensured it will work better the next time), but every time I come back - it is the same issues. Will it ever get fixed????? Makes me wonder why I keep coming back.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Indianapolis", "Title": "“the sheets were crunchy”", "Author": "jkwitt", "ReviewID": "UR56055922", "Content": "OK. my husband and i stayed here just a random saturday night, after dinner and drinks in downtown indy. i'm not sure if we're just spoiled by our amazing bed at home... but the bed was very uncomfortable. and the sheets were crunchy. and, by accident, the bottom sheet came untucked and there was blood stain on the mattress! uck! paint was peeling off the vanity in the bathroom. room was small. view was nothing spectacular. honestly, we recently stayed at the sheraton in downtown indy and it was a much comfy-ier experience. rooms are more updated at the sheraton (and much better view of downtown indy). with all of that being said, the service at the westin was attentive and friendly. but save the money. stay at a different hotel in downtown indy.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Bellevue", "Title": "“You are not valued at this hotel....”", "Author": "affliction711", "ReviewID": "UR52389687", "Content": "We booked the hotwire.com, got a great value, but upon arrival, it seems they treat us differently because we didnt book directly thru them. No apologies when our King room wasnt available...was moved the next night to a king size bed....ON THE 13th FLOOR! I wasnt too freaked out about the 13th floor until we barely missed being hit by a car and hearing gunshots....most hotels skip floor 13....we became freaked out and asked to be moved to a different floor to ease our comfort level....we were told to ask for Eric and he would take care of us. Im assuming Eric is a front desk manager, but he was gone by the time we got to the desk. I lady by the name of Mary was cold and unaccomodating from the moment i began talking to her. I explained my situation and she told me she had no rooms availble...3/4 of the hotel was empty!!! Then told me to explain it with management in the morning......it would be irrelevant by then! I told her Eric wwas working with us, but she said he left no notes for her...i asked her to make something happen to satisfy our request, then she got on the phone and claimed she was being discriminated against!!!! The only ones discriminated against was us....we prompty left the hotel and called to check out...all she did was say, you wont get refunded....if you want to be treated badly, stay here. If not, I advise you to look elsewhere. Happy New Year....", "Date": "January 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Clean, modern, enjoyable experience”", "Author": "V22_Osprey", "ReviewID": "UR51088878", "Content": "Stayed at the Westin during the 2009 MLB Winter Meetings, as did many others from the baseball community. Real nice place, very friendly check-in staff, very clean, good location. Would definitely recommend staying here. The good: bed and pillows were super comfortable, room was very large, clean, modern and had a super large window view of dreary downtown Indy. Nice big LCD HDTV, bathroom was very clean and had plenty of towels, soap, etc... $5 \"green\" voucher is a very cool idea for saving room service. Elevators are fast and there's a bunch of them. Shower was nice too. The bed and pillows were incredible though. The not-so-good: my room, which had two beds, lacked a dresser or place to store clothes besides hangers in the closet (the TV cabinet actually just had some liquor glasses and a safe for valuables. Oops; I left my clothes on the bed in my luggage). The wi-fi/internet was not free, although co-workers at nearby hotels had free internet... I was jealous. Wanted to print my airline boarding pass, but you needed to swipe a credit card before even using a computer... ouch, I didn't bother. A cleaning lady actually keyed into my room at 9am on my last day while I was sleeping, not sure why... check-out is at noon. That's probably not a typical incident though -- overall the Westin is a nice place, I slept very well, the restaurants downstairs are cool, as is the lobby and the location to the convention center and other nearby hotels and restaurants/bars in town. Honestly don't know the room price, it was covered for me. Had a very enjoyable stay, would recommend. Related, other co-workers did not enjoy the nearby Crown Plaza.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "USA", "Title": "“Very Disappointing”", "Author": "iloveItalyUsa", "ReviewID": "UR50266687", "Content": "We had high hopes for this hotel. The location, lobby and employees were very above average. As soon as we stepped into the room, it was a different story. The rooms are small, dingy and depressing. The bathroom is very small and had mildew in the shower. We had two rooms and the other room was worse than the one my husband and I stayed in. The beds for us were not comfortable but most people like the \"heavenly\" bed. The bottom sheets are not fitted (we are in the US, not Europe) and both nights my husband and I woke up on the bare mattress. There was a hefty fee for internet service, found out later other hotels in the area had little or no fee. The carpets in our rooms were stained, and worn out, we wore shoes when we were in the room at all times. I think it is time for major renovations in the guest rooms, I have stayed at the Westin in downtown Charlotte and it was everythning this one wasn't. Also, the second night we were there, there was a football championship, rude and loud kids were everywhere, running up and down the halls screaming all hours of the night. We called the front desk and were told it would quite down at midnight, no such luck, I should blame the parents for this, not so much the hotel. Anyway...I would not stay here again unless I was told the rooms had been renovated, overall as you can tell, we were not the least bit impressed.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wellesley, Massachusetts", "Title": "“NIce, basic Westin - Can't go wrong, but not remarkable”", "Author": "BeantownBriggs", "ReviewID": "UR50068709", "Content": "Really a very nice business hotel. Rooms were clean, the bed was fantastic (as usual with the Heavenly Beds), and the staff was very friendly though check-in was a bit slow. The front desk folks pointed us to some local restaurants, and they were always very genuine. Starbucks is in the hotel. As a big business hotel, it is not particularly unique - just sort of your basic Westin.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“This is a Great Hotel”", "Author": "MissTravellerToronto", "ReviewID": "UR49549417", "Content": "I was hesitant to stay here; I am in town for a conference and had to stay here for five days. It was not within my budget because I could not get a roommate for the conference; but I needed to be close to the Convention Centre. Every review I read on line was awful. So I am here to refute that...I know my stay is not over yet, but I want to tell you about Eric who works the front desk. I came in on Tuesday night and I had a serious glitch with my pay and my credit card!!! Not fun...I had just purchased an airline ticket the day before and I was in another hotel earlier that morning in Canada which froze part of my funds. My pay is transferred automatically to my card, but that had not happened yet!!! So, I could only cover one night; at a time when the hotel was overbooked. First of all Eric, was wonderful because a. he did not cancel my reservation, but let me pay for two nights and then put notes on my account. He was patient, and I feel went over and above his call to duty in helping me. I can honestly even say that as a Black Woman I was not treated with any prejudice or preconceived notions. He told me he trusted me...and I thank God he was so pleasant, patient and professional. My pay did come in early in the a.m. the next morning as promised, and I paid my balance about 4:00 am, as I said I would. So, yes its expensive, yes sometimes the people at the desk when you call are comical and I have had a few experiences with that. But, at the end of the day, its how you are treated as a client that matters. Eric, to me did an excellent job, and I am very thankful for that. Now I have three more nights left here, and so far I have had breakfast at Shula's Steak House and again I found the staff friendly and breakfast to me was pretty average for a hotel. $12.00 or eggs, potatoes, toast. So to all of you who complained an almost made me stay in another hotel less convenient...I can say that so far I don't have any complaints.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Gainesville, FL", "Title": "“Overpriced business hotel in a good location”", "Author": "HolaGatitos", "ReviewID": "UR48369388", "Content": "As others have said this is the typical business hotel where rooms are overpriced, internet is never included ($10 a day??--I was able to connect to the Indiana free wireless service coming from the capitol?), and other amenities are either missing or forgettable. I have never understood why Westin makes this big deal about a \"Heavenly Bed\" I mean what is the point of having a so-called heavenly bed if you are going to use sandpaper for sheets. And the special dual shower head???....I would just settle for water pressure instead. Public areas are kind of small and there is only one restaurant/bar (Shula's) where they serve overpriced steaks, watered down drinks, and indifferent service.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Indiana", "Title": "“Very average”", "Author": "IndianaTravelmom", "ReviewID": "UR48087605", "Content": "Stayed here with our young children while taking in some of the family friendly attractions available in Indy. Found this to be a very average Westin. Lobby area is fine, rooms are average with small bathroom. Location is convenient-walking distance to many restaurants and shopping. Beds are extremely comfortable. Check-in was very slow. We were #6 in line on a Sat at 4pm with only 1 person working the desk. Pool was uncomfortably cold(wouldn't have stayed here if we'd known that). We ate at the restaurant for breakfast(Shula's). The service was poor, food wasn't particularly good and was overpriced. We had booked the deal where breakfast is included-note that they give a set amount of credit on your bill. There is no breakfast buffet and with the prices they charge this was no great deal. Would definitely not book this type of package and would have breakfast elsewhere(there was a Starbuck's in the lobby and there is a shopping mall with restaurants and a Cinnabon's about 2 blocks away). We are frequent visitors to Indy and are still looking for a top notch hotel experience. Have had mediocre experience at the Hyatt(although a few years ago). Will probably try the well reviewed Conrad Hilton next time. Looks like there is a JW Marriott being built in downtown Indy so something to look forward to!", "Date": "October 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Naperville", "Title": "“Showing signs of wear and tear...”", "Author": "gopoets", "ReviewID": "UR47475511", "Content": "The Westin used to be the top choice in Indy...but not any more. The hotel is really starting to show signs of heavy wear and tear. The location is still good but the rooms are beaten up and the public spaces are just OK. They still have the Westin beds but that's about it. With the new Marriott going up 1/2 a block away and the Conrad about two blocks away, the Westin is now longer THE spot to stay in Indy. I think I'd rather stay at the Marriott almost right next door. Kind of sad to see the decline at the Westin.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Fort Wayne, Indiana", "Title": "“I could overlook the updates that are needed if the service was good.”", "Author": "jtjaknepper", "ReviewID": "UR47051896", "Content": "Plain and simple, the cold snub given by the man behind the check in desk when you get there, just drives home any other flaws that you may find with this place. Just keep going and find a place to stay that has friendly staff. It was as though our arrival at the hotel was a real inconvenience to this person. Too bad.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lubbock, Texas", "Title": "“Great Hotel...Fantastic Weekend!”", "Author": "robbyc", "ReviewID": "UR45775515", "Content": "My wife and I had an opportunity to stay at the Indy Westin while I was in town doing some radio business for the All State 400 at the Brickyard and the Indianapolis Convention and Visitors Association between July 24th and 26th. We arrived just after dinner time after spending the Friday at the track, and really wanted to relax and rest up for a fun day Saturday. As other reviewers have mentioned, even though the address is Capitol Avenue, you need to go around the block to pull into the drive. We didn't have a big problem finding the entrance. Yes, self parking in the underground garage is $25 a day with no in & out. Valet parking is $28, and you can come and go as you please. With only 3 dollars difference, do the Valet. The Westin isn't a cheap place by any stretch of the imagination. The in room vending machine is expensive (refrigerated mini bar), internet access in the room expensive and I would assume there are charges to use the phone and computers in the business center. (I didn't look too much into it as I had just stayed at a Starwood Hotel in Minn. a couple of weeks earlier so I wasn't shocked at the extra charges.) The hotel had a Steak House in it (too rich for us), a Starbucks (went there every morning!) and a gift shop. The gift shop very convenient, but obviously, pricey. Being out at the track on Friday caused my allergies to act up and I wound up paying $13 bucks for a 5 pack of 24 hour Claritin. The Candy Bars and Pop are also expensive in the gift shop. Heck, even the ATM had a steep charge. I do think, though, for this type of hotel in a downtown metropolitan area, that's just something you have to expect. My wife and I found our room to be very clean, comfortable and it had a great view of the plaza by the Simon Mall Headquarters. There was a flat screen TV, good selection of channels, a comfortable sitting chair, desk and a clean bathroom. The Starwood Hotels do an awesome job when it comes to the bed and bedding. No scratchy sheets or bedding, nice, soft and comfy. The beds themselves are fantastic. My wife though, thought the pillows were a little wimpy, and next time would bring her own. That Friday Night, we decided to stay in and get a pizza. When the pizza came, the pizza place forgot to give us napkins and plates. We called down and they brought us a couple of plates, one of which wasn't washed properly and had something on the bottom of it. The front desk also helped us with a list of restaurants and the front desk person was helpful with suggesting a couple of pizza places he thought were worthy of trying. On Saturday Night after exploring the Mall, seeing a movie (it was rainy till mid afternoon) and exploring downtown we returned to our room and the hotel had left us a bottle of wine and some chocolates with a little note from the hotel wishing us the best during our stay and expressing their hope that we'd have fun at the race Sunday. (I suspect they probably did this for everyone who was a guest of the Indy Convention Association.) I thought it was a very classy touch. And it wasn't a regular bottle of wine, the bottle had the All State 400 at the Brickyard logo on it. A very nice keep sake after enjoying the wine! We did want more than a taste of chocolate, so we opted for dessert from room service, which was not as good as we expected. Sunday was race day, so we were grateful to have a comfortable room to relax in after a long, fun day at the track. What I noticed and liked a lot about the hotel was it's location. There are many food and bar choices a short walk from the hotel. Lucas Oil Stadium, Conseco Fieldhouse, Victory Field are all walkable from the hotel. The Indy Zoo and White River State Park are probably walkable too, if you're a motivated walker. For the rest of us, a very, very short drive. My wife and I really enjoyed our comfortable room at the Westin, thought the staff was great, and a terrific weekend in a great, friendly city that has lots to offer. A couple of notes: If you're planning a trip to Indy do check out www.visitindy.com. The Indy Convention and Visitors Association can really help you plan a great getaway with their resources. Also, take a drive out to the Indianapolis Motor Speedway and go to their museum. The Brickyard is an awesome site, whether you go for a race, or just to see the track and check out the museum it's well worth it.", "Date": "October 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Well presented hotel - Superb location !”", "Author": "applestrudel", "ReviewID": "UR43428659", "Content": "Just returned back from a great weekend at the Westin. My husband booked this hotel for an Anniversary break as it was close to the Lucas Oil stadium where he had booked concert tickets, for the Saturday night. Once I knew the hotel, I logged straight on to trip advisor and the mixed comments really had me concerned. Getting to the Hotel. We didn’t really have any problems finding the hotel, it is located just off S. Capitol Ave on Washington Street. (opp the Capital State Building). Car Parking Not too sure what all the fuss is about regarding parking. Basically you have two options, self park for $25 a night. If you are using this option your car has to stay put for the duration of your stay. Should you wish to take your car out then use the valet parking at $28 a night. We chose the self-parking option and the entrance is easy enough to find, the car park is called Capital commons and just before the hotel. I know other hotels in the area are charging $32 plus a night for parking. For me living near Chicago, where parking is far more expensive I really did not have an issue with the parking rate. I felt my car was safe where it was parked and that was all that I cared about. Room. We had a gorgeous suite with sitting room, bedroom and bathroom. The décor was in calming shades of cream and green. Very serene and relaxing. The king size bed was heaven to sleep on. We felt as though we had full panoramic views of the Capitol state building and downtown Indi. Very clean, presentable room. The bathroom once again was well appointed, the only negative was that it was rather on the small side. But I loved the double showerhead and the illuminated vanity mirror. Towels were a little course but the bathrobes luxurious. Wi-fi Free in the reception area, although a fee to use in rooms. There is a business centre available, but once again a charge is made for that service. Location. For us the location was perfect, only a very short walk to the shops, restaurants and bars of downtown. The lucus Oil stadium only 10 minutes away and numerous museums very close by along with the central canal, which is a very enjoyable walk. The city was so accessible that we left our car in the lot and went everywhere on foot. Restaurants/Room Service We did not eat in any of the restaurants as we chose to dine in town. We took advantage of the room service for Breakfast. Eggs, Bacon, Hash Brown, Choice or bread, tea or coffee and fruit juice priced at $18.50 plus 18% service fee. We enjoyed breakfast and it was very well presented. Not the warmest breakfast I have ever eaten and maybe not the tastiest either and at a total of around $55 for two, I guess it was not the best value meal I have eaten!!! Negatives On our second day at the hotel, we were out all day and only returned to our room for one hour to get ready for the concert in the evening. This was at 4pm and we were surprised to see that our room had not been cleaned. We left for the concert and returned at 11;45 pm. Our room had still not been cleaned. I called down to reception and she was very helpful and apologetic, but it made me laugh when she asked me if I was sure that my room had not been cleaned! They offered to send a member of housekeeping up straight away, but at this time of the night I just wanted to get into bed so declined. Our bill the following day believe it or not was incorrect, not sure I have ever checked out of a hotel yet and not been overcharged, they were trying to charge me $7.80 for 2 bottles of water which had a complementary tag around their neck in our suite. Reception put the mistake right for us with no fuss. Summary I know we had a couple of problems, but I would stay at this hotel again without any hesitation. The public rooms and bedrooms were well appointed, beautiful décor and very clean. All the staff we encountered were very friendly and knowledgeable and the location could not have been more perfect.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Piqua, Ohio", "Title": "“Not as bad as everyone claims...”", "Author": "mbucha4", "ReviewID": "UR42804972", "Content": "My husband and I took a trip to Indy to catch a concert @ Conseco Fieldhouse. After reading many reviews on different sites about this hotel, I was a little worried. We got a steal for a room, so I couldn't pass it up. From reading reviews, we found out that you cannot get to the hotel entrance using a GPS if you put in '50 S Capitol Ave.' The entrance is actually on Washington. You can valet park for $28 overnight or self-park for $25. We were told that with the valet, you have in&out privileges, but with self-park you do not. We used the valet. The doormen were VERY helpful and polite, asking if we needed help, told us where to go, etc. Check-in went smooth, and we got the room that we had reserved. Upon entering our room, we found it to be clean and comfortable. The bathrooms are a little on the small side, and the mirror over the sink is a little small, but it served the purpose. The pool area was very nice, and although we were not traveling with kids, we noticed the pool is 4ft all the way around, not very kid-friendly. The fitness center was HUGE, the largest i've seen in a hotel. Not sure about the internet, we did not have a need for it. We used the skywalk to get to the mall, that was nice. The hotel location was wonderful, less than a 10 minute walk to Conseco Fieldhouse. Check out went smooth, and we did not have to wait long at all for the valet to bring our car around. Overall, the hotel was very nice, but I probably wouldn't have paid more than $130-$160 a night for a king size standard room. Yes, parking could be considered expensive, but it's the same in any big-city downtown location. Oh, and on some travel websites, you have the option to pay a little more for a \"city/fountain view\"....the city view would be nice if you care about that sort of thing, but the fountain wasn't working when we were there. Otherwise, you get a \"nice\" view of the Mariott behind the hotel, maybe some scenery on the sides, luckily view wasn't important to us. In the future, my husband and I would definitely stay at this hotel again- we had a very pleasant stay!", "Date": "September 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "kansas city", "Title": "“Nice hotel EVERYTHING IS SOO EXPENSIVE HERE”", "Author": "danigirl48", "ReviewID": "UR41187556", "Content": "I stayed at the westin because hotels.com showed it as being really nice for the money, and well YES is is like a 5 star hotel compared to where i stay, great location, but DAMN 25 dollars for parking each day, and the restraunt there for 2 cheeseburgers and kids chicken it was 55 bucks and sonic is better then those burgers. i never slept because all i heard all night where doors slamming shut and peopl talking. all the restraunts around this hotel were EXPENSIVE as well. The hotel was nice rooms were nice but to expensive for us.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "seymour", "Title": "“Not worth the price and worst service I ever received after reserving a room months in advance”", "Author": "august31", "ReviewID": "UR38195446", "Content": "Reserved a room with two double beds for the first weekend in August 7th& 8th. Prepaid at the time of reservation also. Called Saturday at 3pm to say I would be checking in later around 10pm was told no problem your room is already paid for. Arrived at 10:30 after drving around looking for 50 S. Capitol Ave. which is not the address you want to use for directions( would have been nice to know earlier.) Arrived to find no room available for us, had to wait in lobby for half an hour while one was being cleaned, having no choice we waited. The room was a suite, one king bed and a sofa sleeper. Not what I wanted , no one wants to sleep on a hide a bed. Filter in air conditioning vent was filthy, king bed was nice but definitely not worth what I paid for a room. Then I receive my credit card bill today and besides the 28.00 I had to pay to park for 9 hours, I have an extra charge of $5.86. I tried to call but if I want to find out what its for I must send an email to accounting and wait for a reply. Filled out a comment card and left it in the drop box at checkout have had no reply. Stay else where.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Monroe, LA", "Title": "“Way overpriced”", "Author": "agoodall", "ReviewID": "UR38110522", "Content": "We stayed at the Westin during GenCon. The price was one-fifty-nine a night, plus taxes, obviously higher than \"non-peak\" times. The hotel is attached to the convention center, which helped out a lot, particularly as my wife had trouble walking great distances. They warned us about the minibar when we checked in, and we made sure not to touch anything in it. The pricing was high at $25 a day. We weren't going anywhere, so I didn't bother with valet parking. Regardless, they charged us valet parking even though we weren't in the valet section. They did remove this from our bill. They seem to have trouble with their elevators. I saw another review about people stuck in the elevator. This happened to us (a total of 12 of us), too. Unfortunately, our 10 year old was skittish about elevators and all the way up to Indy he asked if we would get stuck. Sure enough, we did. We ended up missing a dinner engagement as we tried to calm him down. What did the hotel do to compensate us, given that we got grease on our clothes from the rescue? They had water available, and they called to see if we were okay. That's it. I'm not sure what I expected, but a laundry service would have been nice at the very least. For the money, the hotel was absolutely nothing special. The beds were okay, but the padded cover is not elasticized and kept riding up on me at night. The bathroom was an okay size, maybe a little on the small size. The big cost ripoff is their wireless internet. It's free if you log in on the first two floors (well, the first floor, anyway) and ten dollars for the privilege of checking your e-mail from your room. Why they nickel and dime you on this is beyond me. I had to traipse down to the lobby every night to check e-mail. The free internet is free for 24 hours. You can renew, but once I tried to renew on the 2nd floor (having connected for free from the second floor) and it wouldn't let me in. I had to go to the first floor, disconnect from that server then reconnect before it let me in again. Totally unnecessary, and just another way of gouging you. The lobby looks nice, but behind the nice lobby is an average hotel with high prices.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hawesville, Kentucky", "Title": "“Decent hotel but some snafus”", "Author": "JenRae", "ReviewID": "UR36626394", "Content": "This hotel has decent rooms that are comfortable. Had some problems in knowing where to park our car. One valet tried to tell us we couldn't park in a certain area, but then two others said we could. Didn't like the hefty price of $25 per night to park. We had a Club Floor room, and their breakfast offerings were very nice with courteous staff. Overall, was please and will stay again.", "Date": "August 3, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Dallas, Texas", "Title": "“Rip off do not stay”", "Author": "Shamrock1656", "ReviewID": "UR35965746", "Content": "I paid for 9 days in advance. Due to the death of mother in law arrived later than expected. They had charged my credit card and re sold the room to someone else. They got paid twice for the same room for the whole 9 days. They refuse to refund any portion of my payment!! Howeve I did find accomadations at the LaQuinta on Post road and found the staff wonderful.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Hartford City, Indiana", "Title": "“One horrible thing after another”", "Author": "kerbear737", "ReviewID": "UR35253158", "Content": "Right off the bat, things did not go well. My directions told me the hotel was off S. Capitol...so I ended up circling a very busy block (it was Black Expo when we went and the traffic and pedestrian traffic was understandably busy at that time) about 4 times before I figured out that the hotel entrance is actually off Washington instead. Every single one of my friends said they had the same problem. Check-in was ok, but when we got to our room we discovered that our sink was leaking water everywhere on the counter. When we called the front desk for maintenance we discovered that the battery in our phone was dead and the only way to get ahold of someone was on speakerphone. We were told someone would be right up. A maintenance man did come to our room while we were headed out for the evening, but when we returned, the faucet was still broken and leaking. When we called again, they said someone would be right up. An hour later...nothing. At this point, the faucet was so bad it wouldn't even shut off, so for about an hour we just had the water running constantly because the faucet would not shut off. When we called a third time, the maintenance man came and did fix the faucet, but he said we wouldn't have any hot water on that side and that we'd have to climb under the sink and wrap a towel around the pipe or something because a part was missing. Um, what? During this time, my friend was still waiting for her bag to be brought up from the valet....nothing. She called the desk and was told \"we'll bring it right up\"...without even asking for her valet # or what the bag looked like! Needless to say, the front desk did NOTHING and she finally gave up and went down to the parking garage herself to get her own bag. (On a side note, the parking fee was ridiculous and the hallways were dark and had filthy dirty carpet.) We did not even attempt to try to go to sleep until around 2 AM...partially because of the insane amount of noise in the hallway from the other guests. I understand it was a particularly busy time in Indianapolis with the Expo going on and that the hotel was booked to capacity. But I'm sorry, people running and screaming and talking and slamming doors ALL NIGHT LONG is ridiculous. We called to complain several times but absolutely nothing was done, even though we were assured that they had a \"full security staff\"...where were they? Could they not just periodically walk the hall to maintain peace and some semblance of decorum? We got no sleep all night. This hotel has a responsibility to all of its guests. It's clear that, even though Indianapolis is home to several large conventions and tourist events like the IBE, no advance planning was taken to ensure that the hotel was able to operate efficiently, especially for those guests not necessarily there for the event. Service was the worst I have ever experienced at any hotel....and was especially disappointed in this from a 4-star Westin. When we complained AGAIN about our long list of problems we had...we were given an obviously rehearsed but insincere apology and were told that we would have to call or email the manager. He wasn't even AVAILABLE! I'm sure he was hiding from all the guests. We could not have been the only ones with problems there. The bottom line is that we paid a lot of money for services we did NOT receive. We paid for a place to sleep....we did not sleep. We paid for a place to use the facilites...those facilities were broken. We paid for a reasonable about of service from the hotel staff....we got blown off and waved away. I will NEVER stay at this hotel again and I emphatically suggest no one else does either.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago Burbs", "Title": "“A Very Nice Stay”", "Author": "14clubs", "ReviewID": "UR34942099", "Content": "We stayed overnight to attend a wedding. Registration was friendly and welcoming. Room was perfect with a view of the capitol and rest of downtown. Plenty of towels, high end amenities, real water glasses. Parking valets were always prompt, friendly, and efficient. All what you would expect from a Westin. Everything in downtown and the convention center is within walking distance. Two or three blocks max. If we go back to Indianapolis, we'd definitely consider the Westin. On the downside, and not just specific to the Westin, internet and parking are extra charges. At least the Westin valet parking is much more reasonable ($28) than other hotels close by. P.S. We read other reviews and the warnings about the \"refreshment center\". When we checked in, I looked it over carefully and saw that ours had a sign/menu on it specifically stating it was that and not a refrigerator. Maybe the others didn't see the sign or it was missing.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Newport Beach, CA", "Title": "“Not what I expect from a Westin”", "Author": "siucarnpb", "ReviewID": "UR34539140", "Content": "Visiting for the summer from California, decided to get a room for the delayed fire works, since we could see them from this hotel if it rained again. Check in was fast and easy, but got a big surprise when I left the hotel to pick a friend up. The parking garage that the hotel has a sign out for is 25$ after 3 hrs with no in out privileges. Nothing was said to me. I argued with the front desk about waving the valet charges, which they did after 10mins of yelling. 25$ in indy to park, I pay that in San Francisco,. So make sure to valet park as it is on 28$ a day. The rooms are nice ( westin room ), but the hotel is showing it's age.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Louisville", "Title": "“Not great service”", "Author": "Louisville-Lindsay", "ReviewID": "UR34049296", "Content": "I was very disappointed with my stay at this hotel. The place was slightly outdated, but the location was nice. I was very unhappy that nothing was done by the manager or hotel when myself and 9 other people had to be rescued from an elevator. We were stuck for 45 minutes and the manager did get our room numbers but did nothing to compensate us. I thought in the very least we would have received a phone call to check on us.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "south bend", "Title": "“Better Than Expected”", "Author": "3duckdave", "ReviewID": "UR32824191", "Content": "After reading all the reviews of the Indy Downtown Westin i was a little nervous about my travel plans. I booked the room through Hotwire.com, and got a great deal. As mentioned in a previous review the address is a bit deceiving. The main entrance isn't on Capitol Ave. at all, it's half a block west of Capitol Ave. So if you are approaching from the north get in the far right lane and prepare to turn right on either Washington or Maryland. Yes parking is $25 per night in the closest garage, but you pay this in just about any garage in downtown Indy or any other major city for that matter. Check in was a breeze, walked in stated my name, I was asked what kind of bed I preferred and handed my key cards, and shown to the elevator. We had room #1107, it is a corner room with a modest north facing view. The room is probably a little narrower than most, since it is a corner room and there were 3 rooms at the end of the hallway. Two corners and a middle. The room did have a stuffy smell upon entering, but once the air conditioning ran for a short while the stuffiness dissipated. No stains on the carpet or furniture. The room had a table/desk setup with internet connections and a phone. It had a HD flat screen TV, presumably LCD, I don't remember, roughly in the 40 inch class. The \"Heavenly Bed\" was wonderful, it didn't however keep me from snoring, much to the dismay of my girlfriend. She also enjoyed the bed very much. The \"Heavenly Shower\" was also great, good water pressure and plenty of hot water for each of us to take a shower in the morning. The bathroom sink also spit out instant hot water. The in room vending machine IS NOT A REFRIGERATOR!! The card inserted in the top of the door states this and even goes so far to inform you any accidental movement of the items inside may result in charges for those items moved. We forgot about this and moved a orange juice to make room for a water bottle and at 2:30 am we got a bill for $3.90 for the orange juice. So don't touch anything in their unless you intend to eat or drink whatever you touch. All in all it's a good place to stay in my opinion.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Kentucky", "Title": "“Nice hotel but a little over priced. Go to Priceline and get it for $80.”", "Author": "sorency", "ReviewID": "UR32213209", "Content": "Me, my husband and 2 year old went to Indy for a buisness meeting and to go to the childrens museum. I checked the room rate online and it was 228 (wow) tooo expensive. So I went to priceline and got the room for 80 per night (better). I called the hotel while on the road to find out if there was anyway that we could check in early because our 2 year old was fussy. NO PROBLEM. We were allowed to check in at 9am. GREAT. Check was a breeze and my daughter was greeted by a childs bag that included a night light, first aid kit, child socket covers and a rubber duck. Then we went to our room and the bed was very comfortable, but the bathroom was a little small. So, while my daughter took a nap I was looking at all of the hotel amentities. They brought us a small potty for my daughter that played music, a step stool so she could get on the bed without any assistance, and a extra robe for my husband. The list of extras were a mile long. Also if your children are getting a little restless before dinner you can go to lobby around 5p and they offer fruit, cheese and crackers. The pool was ok, it did not have stairs (just ladders). The work out room was nice but if your kids have to use the restrooms when using the pool they have to go through the workout room to get to the restroom. The floor was slippery and a little uncomfortable to have to walk through the workout room to use the restroom when you are soaking weat. The childrens museum is about 3 miles away. There are plenty of resturants, movie theaters, shopping and sports venues close to the hotel. Also there is a skywalk that can take you plenty of places. Hotel was difficult to find on the GPS but we found it after going around the blocks a couple of times. Parking was expensive. Breakfast was delivered on time in the morning.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Illinois", "Title": "“Good Service, OK hotel”", "Author": "jillybean2", "ReviewID": "UR31951437", "Content": "OK. Let me start off by saying this hotel is not up to Westin standards and I would not pay the rack rate of $259 a night for this hotel. Now having said that, this was a nice hotel. We paid $76 dollars a night , the beds were very comfortable, service was excellent. I didn't wait for my car, the staff always had a smile, held elevators, etc. The valet parking is 28$ a night, but you are in the downtown of a city. That's pretty standard in my experience. We walked pretty much everwhere because of it's very central location. I really don't understand all of the negative reviews.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Madison WI", "Title": "“Average hotel, nothing exceptional”", "Author": "msn58", "ReviewID": "UR31739472", "Content": "Spent one night here on business, and I wanted to stay downtown rather than out in the 'burbs. No problems or complaints, but it also was nothing exceptional. Staff I encountered were friendly and helpful. The lobby and facilities were nice but my room seemed less luxurious than the usual Westin experience. The location is great -- adjacent to a conference center and other hotels, and across the street from the state capitol. Several restaurants are a block or two away. Check-in was effortless, though I had to wait a few minutes for someone to appear. My king room was quite small, but functional and very quiet. Bathroom was small but well-lit. A separate closet was very dark. Internet access was $10/night. A basic fitness center is located on the 3rd floor with cardio machines, some free weights and a lap pool. There is no locker room. Valet parking was $28/night; self-park in the adjacent garage is $25.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“Just OK, not great”", "Author": "pinball29", "ReviewID": "UR27168907", "Content": "I stayed here on a business trip. It is just OK. Physically, the room I stayed in was small and looked out onto a cavelike enclosure but I hear there are different rooms. The bathroom is tiny, (you have to shut the door to use the toilet) and I was provided w/ one small bar of soap on checkin. Got an additonal bar when the housekeeper made up the room after the first nite. Being a Westin, the bed was great, as it always is. There are very few dining options (basically one, Shulas steakhouse) but a short walk will put you in the middle of a mall-like area w/ many restaurants There is a 'Champions' in the Marriott next door that is a better option for cheaper eats. Room service is shockingly expensive, w/ a 3.50 service charge and a 21% (!!) gratuity tacked on to very high menu prices. Youll pay about 30.00 for a basic egg breakfast. Dont even touch anything in the minibar, or youll be charged whether you eat/drink it or not. Dont even open it. I found the staff very accomodating, esp the shipping dept and the catering/meeting services dept. For a business class hotel, I was surprised at how substandard it was to a typical Marriott or Hyatt hotel.", "Date": "March 31, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Los Angeles", "Title": "“AVOID THIS HOTEL. Miserable, Rude Service.”", "Author": "Traveller11235", "ReviewID": "UR25650528", "Content": "My girlfriend stayed there for a conference over Valentines Day. I sent her a present Priority Mail. I called the hotel before sending it to see if I needed any special information for the package to get to her. They said just her name. Don't worry. She never got it. Three weeks have now passed and I've been calling them every day to find someone who'll look for the package and return my call to tell me what they found. I've found the staff, rude, curt, nasty, disrespectful and profoundly unprofessional. don't stay there and whatever you do, don't send anyone something of value there. The staff will lose it and then accuse you of never having sent it.", "Date": "March 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“average hotel”", "Author": "photocellist", "ReviewID": "UR23903685", "Content": "This Westin must primarily serve folks visiting the area on business. It's connected to the convention center by a skywalk which was nice during January. Upon arrival, my room smelled of cigarette smoke. It was obvious that a neighbor was smoking. I called down and was told that the entire hotel is non smoking. Thankfully, they assigned a new room for me without delay. Hopefully they found the culprit. Because it must cater to business folks, I am surprised at the mediocre service and quality of certain room details. While I found everyone at the hotel friendly and professional, I wasn't happy with the late room servicing (my room was never serviced before 4pm). The hotel has thin walls as I could easily hear neighbors talking, alarm clocks going off and people going up and down the hall. It made for poor sleep. The bathroom is small--can't imagine more than 2 people sharing a room. The room temperature was hard to control and caused some discomfort. The bed was very comfortable--the best part of the room. Like other reviewers, I was charged for items from the minibar. I never opened the minibar--I don't even know what was in it. I asked to have the charges removed and my request was met with reluctance. If I return for business in the future, I will be sure to try a different hotel.", "Date": "January 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ohio", "Title": "“Horriffic Experience!!!!!”", "Author": "lp8", "ReviewID": "UR23756792", "Content": "Terrible is an understatement!! Checking in was only the beginnng of my horrific nightmare. After check-in I went out to find my car had been taken by the valet WITH THE LUGGAGE IN IT!!! The valet instructed me to go to the garage and my luggage would be waiting. It was waiting...still in the back of the car with NO LUGGAGE CART and my room was on the 11th floor. We finally got the cart and luggage to our room only to find a dark hallway and musty smelling room. The view was a dark alley and very disappointing. Upon waiting for a bell-hop my phone fell behind the dresser and I discovered a condom on the floor!!! OMG....my daughter (10 yrs old) asked many questions and I had no answers appropriate for a 10 yr old. It took over an hour to get this removed and when turning down the bed for the night we discovered dried blood on the pearly white comforter!!! OMG...I was appauled!!! I called and the housekeeping staff came and changed the bed, only to find a huge urine stain on the mattress and no mattress pad! After MUCH complaining we were upgraded to a larger room and free breakfast. As many other guests have noted we were also charged for the mini bar,,,,,$111.00 and we didn't eat anything out of it. We had moved a few things to keep our milk cold in the refreshment center since there wasn't a refrig in the room. The valet parking was $56.00 for a 2 nights stay and wasn't worth it. After all of my trouble we were only compensated with a room upgrade, free breakfast and a few additional points added to our starwood guest card. NEVER NEVER AGAIN!!!", "Date": "January 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Colleyville, txl", "Title": "“just average”", "Author": "mombilt", "ReviewID": "UR22345230", "Content": "Staff was very courtious and the check-in ws breeze. The room was very average for a westin. We stayed 3 nights. On the 2nd and 3rd day we came in after being gone from about10 til 4p.m. to find our room not cleaned. We complained on the last evening when we got home at 11:30 pm to again find our room not cleaned. We had to call earlier at around 4p.m. to ask for the service. The manager brought clean towels, shampoo and toilet paper but never apologized and didnt even take our 2 days worth of dirty towels that we had neatly piled at the door. We will be coming back to Indy next yr but wont be staying at the Westin.", "Date": "December 1, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Chicago", "Title": "“Stay problematic”", "Author": "MsZie", "ReviewID": "UR22089502", "Content": "Difficult to access-centered on two one way roads. Valet parking is inefficient. Average wait to get car > 15 minutes- even when calling ahead. First time retrieving car took 25 minutes and made me late for an important meeting. Room was average. Cost money to use business center. Internet in room cost fee and was inoperable. One of two phones broken. Lightbulbs out. In town on business- stay at hotel obviously plagued by problems. Prefer the Crowne Plaza and Omni- in that order.", "Date": "November 22, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Crown Point, IN", "Title": "“Once we found it we loved it”", "Author": "klittrell", "ReviewID": "UR22082207", "Content": "Several families stayed at the Westin the weekend of Nov. 15th for my daughter's wedding. We loved it, very clean, very modern, very friendly. Only problem was finding it as the address states that it is on Capitol Ave but the check-in is actually nearer to Maryland Ave.", "Date": "November 22, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Unprofessional and Disorganized”", "Author": "MovieDoug", "ReviewID": "UR22005517", "Content": "I have traveled and stayed at Westin properties all around the world. This one by far is the worst one. The valet service was very disorganized, rude and unprofessional. Lost keys were a daily occurrence. Waiting more than 20 minutes is the norm. They have the largest driveway I have ever seen at a Westin Property, but they still will not allow you to call down and have the car pulled out and ready for you, so you must go downstairs, give them your number and wait. The bathrooms were substandard for Westin Properties, smaller than normal and the A/C electrical outlets were placed by the door near the floor, which means if you were using a hair drier, you would have to crouch down by the door without a mirror. The mirrors were skinny and small. I would not recommend this property until the staff goes through some training !!", "Date": "November 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Nice Hotel- Slippery Showers”", "Author": "CATrvl08", "ReviewID": "UR21369484", "Content": "The hotel is located downton within walking distance of shops, restaurants, and historic monuments. Upon arrival we valeted the car ($28/day) and had lunch at Shula's (they made us special sandwiches since we were both vegetarians and there were no other lunch options offered. The hotel is average looking inside, the showers are very slippery and no bath mats are put down. My sister and I btoh fell when we used the shower. Management brought a pack of ice and a bath mat, but you would think next time they would keep these mats out just to keep people safe. The club lounge left something to be desired. Overall it was an average hotel.", "Date": "October 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "indianapolis", "Title": "“High overrated”", "Author": "joecr5", "ReviewID": "UR21256432", "Content": "We booked a room at the Westin in Downtown Indianapolis because we were having our bathroom redone and needed a place to stay with running water. We found a good price on Hotwire and decided to book it and it turned out to be the Westin. When we arrived, the valet was prompt and very courteous. Check-in was a breeze with no problems at all. The room itself was average. It was rather clean, however, it was an older room from the looks of it. There was some water damage (dark spots and possible mold) on the ceiling above the shower. There were no fitted sheets on the double beds, only flat sheets. With that said, the sheets were clean and the room didn't smell particularly bad. We did realize that you absolutely have to pay for everything, even internet access, which is 9.95 a day. There is also a stocked refrigerator with all kinds of stocked goodies for outrageous prices (can of coke was 4.00 + 21% service charge). The real problem began when I went to purchase 2 bottles of coke from the vending machine in the ice room. It conveniently did not take dollar bills (I had one dollar bill and 4 quarters for a 2.00 bottle of coke). So I went down to the front desk to get change for a 5.00 dollar bill so I could try the machine on the floor down. I went back up to the 12th floor (the floor which I say staying) and tried the coke machine another time just to make sure it wasn't working and it wasn't. I proceeded to the 11th, 10th, and 9th floor, and each coke machine didn't take dollar bills at all. I went back down to the lobby to see if I could get 16 quarters (for 2 20oz drinks out of the vending machine). I waited in line for 10 minutes because there was only one attendant on duty (which was very understaffed since there was a huge FFA convention in town). When it was my turn and I asked for some quarters, he let me know they did not have any quarters, he gave an excuse because they were busy. I said it was awfully convenient that none of the coke machines worked and it was basically forcing me to purchase a 4.00 can of coke out of the stocked refrigerator. I was very perturbed at the time and asked that he comp. a can of coke from our refrigerator for my troubles of having to come down twice because of problems with the hotel's equipment. He stood there and said that he couldn't do that. By this time it was after midnight and I was tired and all I wanted was a drink. I asked him why he couldn't comp my room a 40 cents can of coke. After 5 minutes of arguing he finally agreed to comp the can of coke. I know it seems silly to get so upset over a drink, but it was the mere fact that none of the coke machines worked, and I am lead to believe they don't work for a reason, and the fact that the attendant argued with a guest over a 4.00 can of coke (which they paid around 40 cents for). However, I checked my final bill in the morning and everything was correct. I have also noticed I have small bites on my body, I cannot assume they are from the beds in the hotel. However, they were not there before I stayed there. I will not be staying there again.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“They charge you for everything!”", "Author": "cheesegromit", "ReviewID": "UR20479217", "Content": "We thought we got a good deal through Hotwire ($69 for a Saturday night). That deal quickly went out the window when we found out that they charge $9.95/day for wireless internet access. They do not include any sort of breakfast with the room price, but you can order 2 eggs for $17. You could grab a little snack from the mini-fridge at $3 for a candy bar. Then when we left the next day, we got kicked in the nuts again as they charged $25 for parking in their parking garage overnight! We won't be staying there again.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Great stay at a downtown hotel”", "Author": "soon2bjweave", "ReviewID": "UR20349454", "Content": "We booked an King Executive Suite for our wedding night back in January of 2008. Due to the Kenny Chesney concert and MotoGP in town this weekend we had been unable to reserve a room for just one night, but we found this on Expedia and were very happy with the accommodations. The room faced the state house on the 5th floor and had a separate seating room facing the Simon building. The bed was very comfortable and the shower had great water pressure. The bathroom was a bit small, but the room made up for it by being very spacious. The hotel front desk was very accommodating in allowing my husband to check in (and early at that), even though the reservation was under my name because it was our wedding day. All in all it was a great stay and we would choose the Westin again if we had to house guests downtown in Indianapolis.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“A very comfortable stay”", "Author": "betch78", "ReviewID": "UR19936815", "Content": "I recently stayed at the Westin while I was in town on business. I am surprised at the negative comments on this site, since my stay was very pleasant. The service was wonderful (very friendly), especially since it was an extremely busy weekend for them. (The first regular season Colts game of the year & the Chicago Bears were staying at the hotel.) And I don't know how you could beat the location -- near the stadium, Circle Centre Mall, Convention Center & the beautiful capitol building. Sure, I've stayed at more luxurious hotels, but I have absolutely no complaints.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Indiana", "Title": "“Not a 4 Star....”", "Author": "mcgillicutty", "ReviewID": "UR17864565", "Content": "I booked my trip at the Westin through Priceline and paid $60/night. If I'd had paid full price I would have been very angry. The property seems to be very run down. Definitley not to Westin standards. My husband and I stayed at the property about 7 years ago and it was great, but nothing has been updated. The hallway's are in need of updating and repair. The toiletries offered in the bathroom are sparse (a bar of soap and a lotion). You would expect more from a 4 Star Westin. The bed sheets had holes, the lamp shades were cracked and on wrong. And BEWARE, the bathrooms are BEYOND tiny. Another thing to keep in mind is that the hotel charges you $50/per day of your stay for incidentals (which was never mentioned to us). Most hotels generally just put an initial hold on your card at check-in. This may be an issue for some people. We did get room service one morning and it was delicious and really fast. Overall, we were mildly satisfied with our stay. The Marriott just next door is beyond nice and newly remodeled. If you are going to pay full price I would HIGHLY recommend a newly remodeled room at the Marriott. Much nicer.", "Date": "July 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Location is what you pay for”", "Author": "fourforfun", "ReviewID": "UR17062390", "Content": "Beautiful hotel, but I expected more for a Westin. They didn't do housekeeping two days of my week-long stay and I had to call late at night to have towels brought up. I was disappointed, but the beds were great, and the proximity to the convention center was worth the poor housekeeping issues.", "Date": "June 19, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Great place & Great location.”", "Author": "jerzamat", "ReviewID": "UR16979529", "Content": "Got a good deal on Priceline. I priceline Downtown Indy all the time. First time at the Westin for $65/night. Great hotel. Very clean, modern, comforting. Room was great. Great bed! Starbucks on site. Great location downtown w/in walking distance of many restaurants & things to do.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Good Location, Very Nickel and Dimey”", "Author": "kdmr", "ReviewID": "UR16782078", "Content": "Don't get me wrong this hotel is in a great location in the city and has the Heavenly Bed which is usually a very pleasant experience. I have a very specific issue with this hotel and others following this trend - I was disappointed by the hotels approach to in-room expenses. My room had not one, but two, minibars. It also had the required bottle of water, available to you at charge, on top of the minibar. This bottle however was on top of a sensor and if moved placed the water charge on your hotel bill. When staying at a higher quality level of hotel I expect to not be faced with cheap attempts to get my money. If I drink a bottle of water, fine charge me for that act. Do not make me come down to the front desk and explain that I accidently bumped the bottle and put it back on its sensor and I shouldn't be charged. It is an annoyance and an action I would expect from a far lower class of establishment.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“Great Stay”", "Author": "notoriouslrg", "ReviewID": "UR16397512", "Content": "The Westin is great. We were able to walk to any place in downtown in minutes. The hotel staff was more than wonderful they were great. The rooms offer a great view of downtown. The only problem we had were the other guest. We met two of the rudest ladies (if you can call them that) ever. The beds were so comfortable!!!! Bathrooms were clean and there are duel shower heads. Our entire group had a great time.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "MUNCIE, INDIANA", "Title": "“Not Impressed with the Westin Indianapolis room 1227”", "Author": "vickisachicken", "ReviewID": "UR15939614", "Content": "The weekend we stayed at the Westin was a very busy weekend but the staff got us checked in fast [and checkout was faster] and were fairly friendly. The \"No Name Lounge\" was a nice and relaxing place to sit and have a few drinks. The weather was rainy so the skywalk that connects to the mall was GREAT to have!! I read a few reviews before going to the Westin and was on the fence about what to expect. I would have to say I was definately NOT impressed by this hotel. It was very NICE to look at...but the rooms [and bathrooms] are definately on the small side. We had a few problems with the toilet-after about 5 flushes it wouldnt fill...and the double showerhead-i had to screw the 2nd one back on...also the sink would \"gargle\" in the middle of the night... The \"Heavenly\" bed was not as comfy as everyone claims it is...but thats my opinion...TOO SOFT...and there was almost no substance to the pillows at all... Our mini bar was not stocked when we got there...and they didnt fill it when they came to check it...but we went up to the Lounge for drinks [not too pricey but still steep for a bottle of beer]. The housekeepers came around way to early for my taste...9am is a bit early for a \"stayover\"...we were up and ready...but if i was sleeping I would have been upset! Great location for sure...but overall i think the rooms are a bit expensive for what you get...", "Date": "May 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Pleasant Stay at Westin Indianapolis”", "Author": "KerryWho?", "ReviewID": "UR15935457", "Content": "My wife and I read the previous reviews here and noted several critical of the accomodations. However, our overnight stay here was very pleasant. Professional and helpful staff, clean and quiet room, a \"heavenly\" bed, and great location to downtown attractions. We valet parked our car ($25 for overnight, which is typical for downtown metropolitan parking almost everywhere) and the valet service was extremely helpful and accomodating to our needs (having car ready when needed, placing luggage in car while we went for breakfast, etc.). The check in procedure was effortless (though the desk clerk could have smiled a bit) as was our express check out. The rooms were also nicely furnished, and did not appear to be old or outdated as some previous reviews mentioned. We did not have time to sample the restaurant offerings at Shula's Steakhouse, but walked through and thought it looked quite inviting. One tip: Don't use the smart bar (mini-bar) unless you plan to pay big bucks for junk food and beverages. The hotel is in the process of replacing the mini-bars with \"sensor detection\" type smart bars. So, don't even think of opening them (for use in placing medicine, etc. for refrigeration purposes). You are asked to contact the front desk to get a mini-refrigerator if you need to refrigerate items in the room. I would highly recommend this hotel and would stay here again in the future.", "Date": "May 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Nice room, helpful staff”", "Author": "Milkaholic", "ReviewID": "UR15197432", "Content": "I stayed at the Westin for three nights while attending a conference. My room was lovely and clean and quiet. The rest of this review probably won't be helpful for the typical traveler (unless you tend to forget things like I do)... But I'm going to share since I think it speaks to the trustworthiness of some of the staff there. After I flew back home and unpacked my bags, I remembered that I left my jewelry in the safe deposit box (unlocked). I called the hotel at 1am and the operator informed me that someone was already using the room. They transferred me to the security office, and the man on duty said he'd check it out and call me back. I didn't get a call by the next afternoon, so I called the operator again. The security person that I spoke with this time quickly checked out the room, and I got a call within 10 minutes from the hotel's shipping department - they sent me my jewelry within two days. Fantastic.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Nice hotel, rooms need updating.”", "Author": "cprussel", "ReviewID": "UR14633946", "Content": "The Westin downtown is located in the heart of Indianapolis. Very close to all of the hotspots. This is a great hotel. Our room however was not that great. The hallways and room were dated and in need of refreshing, Refrigerator in the room was setting in an awkward place and electrical wiring was strewn about and looked tacky, Overall a good stay for the money. Parking as always for a downtown hotel was $24 a night. Much better hotels can be found at this star level, but we were satisfied.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Usually good but poor response this time”", "Author": "runningwoman", "ReviewID": "UR14080162", "Content": "I go to Indy frequently for business and usually stay at the Westin because of the little touches like the relaxing white tea fragrance that hits you as soon as you enter the lobby and the massage/fruit/cheese \"happy hour\" they provide on certain nights. My stays usually go without a hitch and my room is usually set to go and clean. This time I happened to be typing at the desk when an enormous cockroach crawled up my arm. I killed it with my wallet (wasn't thinking clearly enough to just use the pad of paper nearby) and called the front desk to let them know that I had found a cockroach. Usually when you find one there's probably a few more of their friends just around the bend. When the shift manager came up, he just removed the offender and offered to (had to) move me so that they could fumigate the room and the rooms next door. Instead of being moved up to a similar or better room, I was brought to a room that wasn't on the club floor and had a broken chair. No other concessions. sadly he was more concerned that I might tell our company's meeting planner (we use their conference rooms for meetings quite often) and asked to confirm the name of our meeting planner so that he could let him know that it was taken care of. The manager only offered measly points only after I had asked what else they could do and gave me the excuse that they can't do much about the cockroaches because people bring food into the room and it's out of their control. I was surprised at how he ignored that this could be seen as a symptom of serious sanitary conditions in the rooms. When I walked into a room at a Marriott that didn't have a clean toilet, they gave me a free dinner at their restauraunt and a enough points for a free stay in the future and acknowledged that it was not acceptable and apologized profusely. It's too bad the Westin handled it the way they did seeing as how most hotels go out of their way for their members with status. Still waiting to hear a response from them. Until I do I'm planning on staying at the Conrad or the Hilton.", "Date": "March 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NW Indiana", "Title": "“Great hotel and location!”", "Author": "racegrrl", "ReviewID": "UR14008016", "Content": "We had a trade show in Indianapolis to attend, so I used Priceline to see if we could get a deal and boy we did! We ended up with the Westin - which couldn't have been more perfect as they have a skywalk to the convention center where our event was being held. We were so pleased with getting the Westin for the price we paid as the location was perfect and our stays with Westin in the past have always been terrific. This time was no exception though we were not in the room as much as we typically are. Check in was 3 pm, but we were allowed to check in 1 1/2 hours early. Very nice man at the front desk. We parked in the garage next to the hotel - very convenient but pricy - $24 for 24 hours. There are garages that are less expensive for overnight, but you will have to walk a few blocks. We paid for the convenience and it was worth it. Our room was on the 12th floor looking west toward the Marriott. Room 1203 was nicely appointed, two double beds, chair, desk, tv, minibar (don't even touch anything unless you want to be charged for it!), hair dryer, safe, iron and board, lighted vanity mirror. Bathroom was nice, a bit small, and a bit too dark for our taste. But there are two mirrors in the main part of the room, so other than shaving, anything else can be done out there in the daylight. Only other negative was the drain in our tub - very slow. Water was up to my ankles when I finished with my shower, not a deal breaker, but an inconvenience. The best part of the room - the beds. Oh my goodness, they are exactly what they call them: HEAVENLY! My Alex enjoyed one of the best nights sleep he has ever had away from home! They are firm and soft at the same time, and are just perfect. The location of the hotel to all that's fun in downtown Indy makes it a perfect place to stay. Two blocks from the City Centre mall, lots of restaurants right down the street, a half block from the Capitol building, across the street from the Indiana Convention Center and the RCA Dome . . . it's all right at your fingertips! We also found the best breakfast place about 6 blocks away - LePeep on the corner of Illinois and New York streets. The best pancakes in all of Indy! Check out was a breeze since we had no charges to the room. A few steps to the elevator which took us to the parking garage and we were on our way in less than 5 minutes from front desk to leaving the garage. Very convenient. We would stay there again in a heartbeat, especially if we were going to any event in downtown Indy.", "Date": "March 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern Indiana", "Title": "“The best beds ever!”", "Author": "t2andc2", "ReviewID": "UR12359267", "Content": "We spent just one night at the Westin in Indy; however, it was a great night. The Heavenly beds are just that....heavenly. They are the most comfortable hotel bed I have ever stayed in! The staff was very friendly and accomodating.", "Date": "January 5, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wheaton, IL", "Title": "“Nice hotel, bad service”", "Author": "dknelson", "ReviewID": "UR12298996", "Content": "Nice hotel in good condition, seems to be understaffed. On check-in there was a big bag of smelly garbage by my door, when I came back 4 hrs. later, it was still there. As I was checking out they had ONE guy acting as the bellhop and valet. He said because an event at the RCA center was letting out my car was blocked in (not true--I checked, but couldn't drive my car without keys). As it turned out, there was some professional basketball team also checking out at the same time. Although I was first in line, it seems that they took precedent because: A) He anticipated a larger tips? B) They are more important than me? C) ???? So this ONE guy went up and down the elevator for each player until the their bus was packed with all their bags. Wait for my car: 1 hr. + If you're not a sports celebrity, get ready to feel like a VUP at the Westin!", "Date": "January 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Very nice hotel”", "Author": "hohohaha", "ReviewID": "UR12100270", "Content": "I spent a day at this hotel for Christmas party. Arrived at the hotel a little after 9AM, and was gladly accepted to check-in early. A bit of late check out was also accepted. Overall quite pleasant stay. Check in/out: Even though check in was 9AM, I was able to check-in. Asked late check out at 1PM, and it was also very pleasantly accpeted. Room: Is a bit outdated. Although the \"Heavenly Bed\" was really nice and comfy. Found a refreshment center which was locked. Thought it was mini fridge and refreshement center but found out that there is no mini fridge. Asked mini fridge and it was brought up a bit late. Had also trouble with chair, and asked replacement. Air conditioning was a bit old, and sound a bit odd. Bathroom: Need improvement immediately. Quite old, and noisy. Also, need to wait a while to get real \"hot\" water. Overall: Nice stay but the hotel need to make some \"renovation\" or \"improvement\" of its facilities.", "Date": "December 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Indiana", "Title": "“Good business hotel”", "Author": "oshtemo", "ReviewID": "UR11461975", "Content": "Just returned from a 2 night stay for a conference and felt this was a good downtown hotel if you're in town for business. I thought the conference rate was very good; $110 nightly. The room was fine; good work area with comfortable chair and internet access. Clean and well maintained. The bed was definately \"heavenly\", probably the big selling point for this hotel. I thought the bathroom was very small, but enjoyed the dual shower heads. The staff was efficient and professional. No one was rude but I didn't get a real friendly vibe either. Didn't eat at their signature restaurant, Shula's, way out of my price range. But they are connected to the mall and plenty of more affordable eating options there. You are also within walking distance of some decent quality restaurants that won't break the bank. Overall I can recommend this hotel if you can get a pretty decent rate.", "Date": "December 10, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Chicago", "Title": "“Need to work on room maintenence and housekeeping”", "Author": "mktozd", "ReviewID": "UR10714252", "Content": "Normally I am a big fan of Westin's. However, I was deeply disappointed in the cleanlyness at this Westin. I actually had to switch rooms for a very disgusting incident in the first room. They did quickly move me to another room, but that one had issues as well. They really need to work on room maintenence and housekeeping. The service was OK, but nothing exceptional. The lobby was cold and drafty. Would stay elsewhere next time.", "Date": "November 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Standard Westin Experience”", "Author": "travelure27", "ReviewID": "UR10617353", "Content": "Consistent Westin level quality, but nothing extraordinary. My experience with housekeeping, room service, & front desk was great. Only complaint- The bathroom lights were extremely dim in my room.", "Date": "November 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "new jersey", "Title": "“loved the bed”", "Author": "muffyf", "ReviewID": "UR10296155", "Content": "Very nice Westin. I loved that there was a real comforter and not a gross bedspread. There was a Christian Teenagers Conference going on at the hotel the weekend I was there but they were pretty well behaved and quiet. Conceirge was really helpful and staff were very nice. It is about a 30 minute drive from the airport.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hartsville, Tennessee", "Title": "“The Westin was in a great location”", "Author": "sister003", "ReviewID": "UR10285224", "Content": "I stayed at the Westin during a conference. It is in a great location, within walking distances to most of the city. The room was nice and the beds were great! The lighting in the bathroom was horrible.....I like bright lights in a bathroom. There was a washcloth from the previous person still hanging on the shower curtain. I thought that was sort of gross. Other than that, I would probably stay here again if I am ever in Indianapolis.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Fine, but no Westin”", "Author": "josiecat", "ReviewID": "UR10059299", "Content": "The reviews here are pretty true - decent place, but not the usual Westin quality hotel. With the exception of the Heavenly Bed (R), you'd never know that you are at one. Service was OK - traveled for business and was not able to check in when I had arrived (1pm). This was tough since the afternoon schedule was booked. I had to head back down to the lobby (with the rest of the convention folk) and wait in line a few hours later. I would have expected this to be coordinated if they cater to conferences. I didn't have shampoo in the room when I got there (important for traveling in the carry-on age) and didn't get any until I made multiple calls. Good location - close to everything downtown. I would stay there again, but wouldn't be too thrilled about it.", "Date": "October 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "digby32", "Title": "“Needs to be updated”", "Author": "digby32", "ReviewID": "UR10053016", "Content": "Stayed 3 nights. Rooms are small and very dated. Hotel needs an emergency facelift.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Sub-standard service, noisy”", "Author": "TripBlazer", "ReviewID": "UR10028347", "Content": "The Westin Indianapolis has aspirations of being an upscale hotel, but doesn't know how to do it. The property itself is nice, and the location is great -- right across the street from the state capitol and near all of the restaurants and sights in the downtown area. But they need to upgrade and enter the 21st century. Note to the Westin: Hotels don't charge for Internet access anymore, especially when that access is spotty at best. I spent most of my stay trying to get the hard-wired Internet connection to work. After two visits from technical help with no luck, I gave up and used the wireless access -- which ranged from slow to none. I had flashbacks to my dial-up days. A place like this should have flawless high-speed Internet access for free. Period. Instead, I paid ten bucks a day for slow wireless access that died out frequently. The hotel suggested I request a small in-room refrigerator rather than use the honor bar, but when I did request it they didn't deliver it. So I asked again. No luck. A third call. No refrigerator. Finally, after an irate fourth call, I got the refrigerator. So the place has some technical and service issues. Finally, as always, I had the room across from the loud family, who apparently booked two adjacent rooms and spent the entire evening -- til 1:00 am -- opening and closing each door so they could go back and forth. It sounded like they were opening the doors right next to my bed. A little soundproofing would be helpful -- expecting courtesy from one's fellow guests is, of course, a thing of the past.", "Date": "October 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice enough place in downtown Indy”", "Author": "Juilletdix", "ReviewID": "UR8673568", "Content": "I had some meetings in Indy and decided to go up the day before. I used Starpoints to get a free night here. I think the rate was close to $200/night, so I'm glad I got it for free. We drove up from Chicago. Self-parking at the hotel is $12 with validation. The room was pretty nice. Westin beds are always nice, so that was a plus. We got a room with a nice view - part of which was the rooftop swimming pool. Unfortunately, we did not have time to check that out, but it looked very nice. We had dinner in the bar, service was pleasant but a little inept. There was another couple sitting next to us, we were all trying to watch the Bears game on the big flat screen - and the bar had the easy listening music on the sound system cranked way up. I asked the server if he could do something, seeing as how the only customers there (10:30pm on a Sunday) were trying to watch the game. He said he didn't know how. Eventually, a manager came by and turned it down, but by then, we were ready to call it a night. The next morning, the sounds of a jackhammer greeted us. The property used to be a Radisson and I guess they are renovating. Anyway, this would have been a problem if we'd been staying more than one night. My Starwood status got me a late (4PM) checkout, but my meetings went super late and it was closer to 6pm before we got back to check out. I called the hotel around 4:30, once I realized that we wouildn't be back in time and they were quite gracious about the whole thing. I was worried I would get charged for this, but they just waved it off, which was really nice. It's a nice enough place - I'd check on the status of the renovation before staying again, though.", "Date": "September 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Schererville, Indiana", "Title": "“Great, except for the water charge”", "Author": "kiwifuz", "ReviewID": "UR8401255", "Content": "My husband & I stayed at the Westin downtown Indianapolis the night of July 21. We stayed thanks to Priceline and paid $80 for the night. We had a great room, #911. It's on the front side of the hotel & faced into downtown. The Capitol was to our left, the Simon office directly in front of us, the Hyatt behind that, and the Convention Center to our right. The view was pretty decent, but Indy isn't that pretty of a city so whatever. The front desk worker made it out to be something spectacular when we checked in. My biggest gripe with this hotel was the parking. To park in the Westin garage is something like $25, with no in & out privileges (not something I've experienced at other area hotels). The other issue is that the location isn't the greatest on the block. The address is on Capitol Ave, but since Simon built their new place you can't actually see the hotel until you have passed it. All of the pretty pictures that Westin has on their website are obviously from the pre-Simon days when you could see the hotel from Capitol. In order to enter the hotel driveway you have to turn right from Capitol to Washington, and then take a pretty quick left to the hotel. The garage for the hotel has entrances on Washington & Maryland, right about in the middle of the block. The issue we had was that since there was a large convention (final weekend of Black Expo '07) it was hard enough to turn in & out of the driveway, I can't imagine using that garage would had worked too well. We ended up parking over at Pan Am Plaza, which was $18 for the night. The room itself was a bit small, but not too small. The furniture was really basic. Plain armless desk chair and basic desk, coffee maker with Starbucks pods, mini fridge that's a mini-bar stocked with overpriced food & drinks, etc. The bathroom was very small but adequate. I just wish the whole room had better lighting. Even the bathroom had pretty dim lights. It was nice though that there was light-up make-up mirror in the bathroom which helped the lack of lighting. It looked like there was a decent selection of movies, and a decent snack selection in the mini-bar. The vending machines had 20oz bottles of Pepsi products for $2 which isn't bad at all for a hotel in my opinion. Especially since there's isn't really anything too close where one can buy soda & snacks. The only odd thing that I had never experienced is that I had to have my room key to get into the vending area. The placed seemed to need some TLC. The pretty (should be shiny) stainless steel looking objects around the room, were pretty smeared & splotched with water spots. The shower head was pretty crusty with hard water gunk & wanted to spray every way except down. The shower was pretty odd, it had 2 shower heads. My husband was really impressed with the \"Heavenly Bed,\" I thought it was all right, a bit too soft for my liking, but nothing like the foam that Marriott uses. The staff was great. Well except for when we checked out. When we received our bill under the door early in the morning we found a $4 charge for a bottle of water. The issue is, we hadn't drank the water, heck even if we had no one had been into the room to verify the whereabouts of the water. We called downstairs & asked for it to be taken off. When we went down to actually check out & drop off our keys, the front desk girl bordered on rude when we asked for a new bill that showed $0 in charges. She just kind of said nothing to us from that point, not like it took much to click that print button. But whatever, don't charge for your overpriced water, or raise the Aquafina price in the machine to a charge that wouldn't yield 2 bottles for the price of the 1 in the room. I don't think that this place is worth the going rate on the Westin site, or any travel site, or [--]. However, for $80 on Priceline for that busy weekend with the location of the hotel in relation to downtown it was great. I'd definitely stay again, a great option while downtown Indy. The parking isn't too bad I guess as long as you're willing to spend the few extra bucks to park at the hotel & don't plan on leaving in your car until you are checked out. Of the other 4 star options I do think that this is not the best, not the worst. I would prefer the Omni Severin (although it lacks real parking) over the Westin; however, I prefer the Westin to the Hyatt that's right on the other side of Simon.", "Date": "August 12, 2007"}, {"Ratings": {"Business service (e.g., internet access)": "2", "Overall": "1.0", "Location": "3", "Value": "1"}, "AuthorLocation": "Nashville", "Title": "“Security and Service Issues”", "Author": "travel195409", "ReviewID": "UR8373534", "Content": "When I arrived late (with a reservation) they indicated that they were overbooked (a common occurrence according to the clerk). But, it was the woman that walked into my room, screamed, and then left the hotel that was the most disturbing part. As you can see through these reviews, this hotel has a very mixed reputation, especially for a 4 star hotel. I understand overbooking as I am frequent traveler. Since there were no rooms in the area, this \"4 star\" hotel brought me a roll-away bed and put me in a meeting room / bar. Nice. It was two rooms with a large (open) double door in the middle. While I was, well, in the bathroom, someone came in the other side and started unpacking. It turns out the front desk gave a woman the room connected to mine without closing the large doors. She was so frightened she screamed. I immediately called down to the front desk and they were in no hurry to respond. I told them they needed to get there \"now.\" The lady was very upset and left. And I was furious. I can’t imagine how I would have reacted if my wife had a similar experience. This morning the supervisor's response was not particularly concerned. His \"yeah, sorry about that\" attitude did not impress me. I will never stay there again and would caution others to avoid this hotel.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "usa", "Title": "“The Wonderful Westin”", "Author": "lifeliver", "ReviewID": "UR8369969", "Content": "Had a wonderful stay at the Indy Westin. Very clean, comfortable rooms with a modern aesthetic. Great location, friendly staff. Added bonus Starbucks in the lobby. The fitness center could use an update but does have nice machines and weights.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Wonderful Hotel in Downtown Indianapolis”", "Author": "PGarcia", "ReviewID": "UR8282574", "Content": "I booked this hotel through Priceline and got a 99.00 rate. This is a very lovely hotel, with upscale touches and atmosphere. Smack in the middle of downtown near the state capitol, it was a busy weekend when I stayed there, as a major convention was in town. I had trouble finding the entrance (by car) and with all the commotion, it was noisy outside. Inside, though, it was quiet and pleasant. The Westin is noted for their comfortable beds, and the Indianapolis location is no exception. I rested very well my two nights here. This hotel is convenient to the downtown restaurants and shops, and is across the street from the RCA Dome. One thing I wish it had was someplace other than a Starbucks concession to grab a quick snack. $3.00 for a drip coffee is a bit much but oh well...This hotel is also convenient to major interstates and attractions. All in all, a great value.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“You get what you pay for.......”", "Author": "betucantdoitlikeme", "ReviewID": "UR7636539", "Content": "I obtained my room through Hotwire for $100 for the night. An incredible rate for the Westin I originally thought. Once I arrived in my room, my opinion quickly changed. We've all heard the phrase \"you get what you pay for.\" I definetly understood what that meant at the end of my stay at this property. The bathroom was small to put it nicely but was sufficient for our needs for the evening in spite of the fact that there was no fan for ventillation. Upon further inspection I noticed that there was a good 1/4 gap where the grout from the floor had separated from the tub. I dont know if this caused the carpet outside the bathroom to remain wet, but that carpet stayed damp from the time we showered until the time we departed. My room (901) was right next to the laundry room and from the start there were small problems that cause big headaches. The room had a stale cigarette smell. I immediately called the front desk and inquired why I was placed in a smoking room when I requested non-smoking. I was told that all rooms in the hotel were smoke free, but I could clearly tell my room had recently been switched over. The front desk girl told me someone would be up to deodorize the room....to my surprise this meant spraying a green liquid in what looked like a windex bottle. After seeing what the housekeepers would use, I told them not to worry about it. After a few minutes in the room I thought that if the thermostat was turned down the smell may be minimized. I turned the AC down to 65 degrees, and yet there was no change in room temperature. This was a HUGE problem since the heavenly bed has a down comforter on it and the temperature outside was in the low 80s.......it made the heavenly bed experience slightly less enjoyable. Moral of the story: If you get a room thru Hotwire dont expect much. They must save the crap rooms in the hotel for the people who get a deal. Just my two cents.....", "Date": "May 17, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ohio", "Title": "“Loved the Westin! Loved the Heavenly Beds!”", "Author": "reunitedOhio", "ReviewID": "UR7616912", "Content": "Besides getting a great deal on Priceline, and an unbeatable location, this place was awesome. Make sure to ask the desk clerks about specials at Shula's Steak House, such as comp. appetizers, drinks, and messages! If you cant get a free parking meter on the weekend, you can have your parking ticket validated with any purchase at Shula's. We didnt need this, but were told by another guest. We grabbed a muffin and coffee at Starbucks, in the lobbyand saved our appetites for all the great restaurants that were in walking distance. The covered walkways would be great in the winter months when you might not want to be outside as much.", "Date": "May 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "chicago", "Title": "“Will Not Be Back”", "Author": "carztraveler", "ReviewID": "UR7428337", "Content": "I wrote a review on this hotel last year shortly after it had been remodeled, and thought at that time that this was a good property. Well, I have changed my mind. Check in was difficult. I had booked a concierge floor room at $189.00 on a Saturday night. I am a Gold member. The check in desk was manned by a trainee who took quite a long time to check me in while the other clerk appeared to be on a personal call. I had notated in my original reservation quiet room and gold member. Apparently neither of these came through on the reservation. I expressed again, my desire for a quiet room, after a long day's drive. An hour after check in, I was surprised to hear people charging down the hall, repeatedly. After that I heard people outside my room on cell phones, along with other noise from the party. As other reviewers have noted, soundproofing is lacking at this hotel. It turned out that there was a convention party 2 doors down in the Presidential Suite, and it had been causing problems with noise all week! I called the front desk who sent security up. He said the party was \"in order\". Not so, if I could hear it in my room. I had to move all my stuff to another room, which was missing not only amenities, but furniture! The security guard finally offered to help with my luggage, but not until we were halfway to the new room. Last time I had room service here, it was expensive but great. This time it was expensive but a gooey ,salty mess. The rooms are remodeled, but not comfortable, except of course, for the Westin Bed which is always great. The bathroom was not as clean as it could have been, and quite small. All in all, I will not return to this hotel.", "Date": "April 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Springfield, Virginia", "Title": "“Nice, but missing the finer points”", "Author": "jatravel", "ReviewID": "UR7271419", "Content": "I stayed at the Westin for one night on a business trip. I called ahead to ask for a good view and was told that I had a \"fountain view.\" I actually looked out onto the side of the building and an industrial plant. When I entered my room there were pieces of something black on the floor which I picked up with a tissue (must not have been vacuumed). The room was well appointed and the furniture all looked pretty new. The bed was comfortable as advertised, but the sound proofing was lacking. I was woken up by the alarm clock in the room next to mine and could here that person's shower running loudly. The robe in the room was a nice touch, but was very scratchy. There were just little things that could have been nicer for the price. They charge for everything including internet access. Definitely don't move anything in the mini-bar. The latest check out that they will accommodate is 1 pm. They had a portable phone in the room which was a plus. We paid about $145 which was a group rate since we were meeting in the hotel. If I were paying for the room myself, I would only stay if I got it for half the price.", "Date": "April 2, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Indiana", "Title": "“The Westin Indy, Never Again!”", "Author": "Indiana_Robert", "ReviewID": "UR7191790", "Content": "Although connected to the Convention Center in Indy, this is NOT the place to choose. With advance reservations of more than a month, the reserved roll away was not available at the time of the visit. All paperwork showed it reserved. It did not exist. I called for any other option, I got 3 sheets. So for $224 I slept on the floor with 3 sheets and no blanket. On checkout, I found that the Westin does nothing to assist customers in parking. The lot says \"reserved for Westin Guests\" . The desk calls it public parking. The price of my stay was increased increased by 1/3 with parking costing $47 for 1 day. Not what I would expect, or have experieced from The Westin in the past. I stayed in Chicago and had a good and as expected stay. I think it is just the Indy Westin and I think it is because of poor managment and planning.", "Date": "March 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kiwi on Tour", "Title": "“Everything I expected”", "Author": "AJMartin", "ReviewID": "UR6532572", "Content": "Worth the visit. Beds were comfortable - Star Bucks in the lobby. Great place to stay", "Date": "January 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grover Beach , CA USA", "Title": "“Nice... not Super”", "Author": "beachtravel", "ReviewID": "UR6059259", "Content": "Stayed four nights in Indianapolis on business... and got the Westin for $100.00. ( Probably could have bid lower in retrospect but I was happy with that price.) The hotel is right downtown within easy walking distance of shops and restaurants, which was great. The lobby is showing it's age but they had some great scented candles that I liked. At check in, I asked for the room that over looks the state buildings that is shown on the website and the counter person told me that \"none of the rooms \" had that view. Very Strange. He did , however, give me my Starwood points for the stay, in spite of the fact that I'd booked on Priceline. Very nice. The room was small... just okay... very clean though, and the bed was comfy. This hotel is showing it's age in decor and in the bathroom fixtures. The turkey sandwich I had from room service was worth every cent of the $30.00 I paid, it was a great sandwich! I certainly wouldn't pay full fare for this hotel but I'd Priceline it again... and try for maybe $75.00.", "Date": "November 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cookeville, TN", "Title": "“Loved it!”", "Author": "teacherwoman", "ReviewID": "UR5932401", "Content": "I just returned yesterday from a one-night stay at the Westin Indianapolis. My husband and I went to Indy for a Colt's game. The Westin was fabulous. Parking was plentiful (but expensive at $23 per day), check-in was a breeze, and our room was very nice and clean. The bed was the most comfortable I've ever slept in! I was a little concerned because they do allow pets, but I saw no evidence of a pet whatsoever. I loved the skywalk to the convention center and Circle Center Mall. I would definitely stay here in the future.", "Date": "October 9, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Just OK”", "Author": "NJ Family Traveler", "ReviewID": "UR5545935", "Content": "I stayed for 3 nights recently at the Westin to attend a conference. Front desk - Very helpful and friendly (they had my package which I shipped earlier and delivered it for me, as well as giving me a Fed Ex that came) Parking/BellHop - Very helpful and friendly in arranging for taxis when needed, and storing luggage on moring of checkout until I finished with the conference Room - small but adequate, nice bed. Bathroom - very small as others have pointed out and only one showerhead worked, but good water pressure and plenty of hot water Room Service - ordered a cheeseburger one night which was great (properly cooked, hot when delivered, etc., fries were stil crispy) but that alone cost $25.00! Location - great/convenient for conference and centrally located in heart of City. Housekeeping - The worst! This is my main complaint. No service to my room after my first night. Second day - while they remade my bed, they did not empty the garbage cans, did not remove used glasses or provide fresh glasses, did not remove used towels left on other bed or provide fresh towels, did not replace toiletries. Definitely not worth $200/night. Will be sharing my review with the Westin.", "Date": "August 3, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lexington, ky", "Title": "“great location and room”", "Author": "travelang", "ReviewID": "UR5530594", "Content": "My husband and I stayed here for a weekend get away. We pricelined it and after a few bad experiences with not knowing what we were getting until we had bought it, we were a bit worried. We thought that for what we paid, it couldn't be too disappointing because roadside hotels outside of town were not too much less for the weekend. We were pleasantly suprised at our excellent room location, the location of the hotel in relation to the attractions and the overall quality of the hotel. We have stayed in very nice and very pitiful hotels and this was one of our favorites. The bed is great! Look for street parking right near the hotel on the weekends. We parked all weekend (left the car and walked everywhere, which is easy to do) on the street for free (as opposed to the $23 a day in valet) and could see our car from the window of our room. I tried to come up with a negative point or two for balance, but I really can't think of one. The previous reviewers must have really high expectations, have stayed before the renovations or paid a lot more than we did (about $50 less than the current travelocity rate).", "Date": "July 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Nice hotel”", "Author": "Coriann", "ReviewID": "UR5397760", "Content": "We stayed at this hotel (in a suite) on the weekend of June 23rd. The bedroom had a beautiful view of the capitol. The bathroom is a little small, but very nice. The bedroom and sitting room were very spacious. And, yes, the beds are heavenly. As other reviewers noted, be careful of the mini bar. My husband opened it to see what they had to offer, but we did not take anything. We ended up being charged for 2 beers anyway ($5.90 each!). I called the front desk and they had the charges removed, but their mini bar policy is the harshest I've seen. Next time, I probably won't even open it. The hotel is in an ideal location - right across the street from the capitol and within easy walking distance to Monument Circle. I would stay at this hotel again. If it is your first time in Indy, I would highly recommend going to the Rathskeller - it is a German restaurant in a beautiful building with an amazing beer garden. It is a very short drive/cab ride from the hotel and well worth it.", "Date": "June 28, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“fine accomodation”", "Author": "forestgreen", "ReviewID": "UR5237868", "Content": "My husband and I spent a weekend at the Westin in Indianapolis. We had plenty of hesitation staying at this hotel based on the reviews. I was relieved that our stay did not approach the negative experiences that others had. While we found some of the critiques to be well-based (small bathroom, ridiculous refridgerator policy), our overall experience was quite nice. The rooms were on the small side, but comfortable for our purposes ... but we don't require a lot of space when traveling. The Heavenly Bed lived up to expectations. And my most important concern after reading these reviews - a lack of hot water - was not the case at all during our stay. We took several showers with terrific water pressure and temperature. The staff were quite helpful and courteous. When we returned from a morning run, one of the valet staff offered us towels and bottled water.", "Date": "May 31, 2006"}], "HotelInfo": {"Name": "The Westin Indianapolis", "HotelURL": "/ShowUserReviews-g37209-d88186-Reviews-The_Westin_Indianapolis-Indianapolis_Indiana.html", "Price": "$162 - $282*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">50 South Capitol Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46204</span></span> </span> </span> </address>", "HotelID": "88186", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/09/64/096445f6c2c05d6f6f925076f06269027large.jpg"}}