{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Minneapolis, Minnesota, United States", "Title": "“Worst \"hotel\" ever!”", "Author": "Caitlin F", "ReviewID": "UR127271682", "Content": "Hmm where do I begin? First of all, I arrived at the hotel at 12:00pm with my 3 year old daughter. I wanted to check in and they said check in isn't until 430. So what am I supposed to do until then? We decided to go to Disney world and they were trying to sell me tickets that were clearly a scam, do NOT buy their Disney tickets! They called a cab for me that charged me $50. When I arrived back to the hotel there was this really rude lady who gave me the key to the hotel, she didn't acknowledged me and decided that having a personal conversation was more inportant. Wifi doesn't work, there is no food or coffee. The room is horrible! It smells and it's very dirty. I can't believe this place is legal! It looks like how I imagine a meth lab would look. Not a friendly envoironment. I don't care if they would charge $10 per night, not worth it. Oh and I called the front desk to call me cab and she said I dont know any cab numbers.... What do you mean? You called one for me a few days ago! I'm not a picky person. All I want in a hotel is safety, cleanliness, and a friendly staff and they didn't meet one of my expectations. Oh... Don't eat at the waffle house!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Buford, Georgia", "Title": "“Awful! Checked out after 10 minutes.”", "Author": "xoxo149", "ReviewID": "UR126586223", "Content": "This was the worst hotel room I have ever been in. And we're not ones who are extremely picky or need immaculate accommodations. While the location and staff was nice enough, the room was disgusting. There were gnats, smelly stained towels, lumpy bed mattress and pillows, sticky nightstand, floor, and doors, an open pack of boxers(!), food crumbs around the tv, shower rod held together with duct tape, stained bathroom walls and door, hairs on the sheets, no stopper in sink.... the list goes on. I cannot see how anyone could stay here. Save your money and go elsewhere!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Charleston Sc.", "Title": "“What a total rat hole. I would have done better to have slept in my car.”", "Author": "kingtut210", "ReviewID": "UR121936198", "Content": "This place is a total [...] hole. Avoid totally. I am here at this place right now. A/ C. Does not work, we had dirty sheets on the bed and the hotel clerk was a joke. I will be on the phone with wesh 2 news in the morning to expose this health risk. Yes I am pissed right now to say the least. This place has the nerve to tell me no refunds? That's absolutely laughable. I am on a mission now to expose this place to the world. Thank God for the www. As I will spread my review across the web.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Hollywood, Florida", "Title": "“Worse than camping under an overpass...”", "Author": "mbargerhuff", "ReviewID": "UR120572497", "Content": "Wow... are these places even allowed anylonger? I think the place needs Bio Hazard tape across the front! ...imagine a motel that feels like it was abandoned for decades and cleared of all items (beds, mirrors, lights, tvs, etc.)... then one day someone comes along, buys, it, and throws some 'stuff' in there to make it a motel room; never painting where the old stuff was, leaving plaster repairs unpainted, and placing a itty bitty tv on top of the original rusted chrome post; sitting so low that if you lay in the sagging bed, you cant even see it. Imagine a bed with holes in the linens, no fitted sheets, a mattress cover that is so small, it could serve as a diaper. A shower that fills with ankle high water as you clean yourself, and housekeeping that feels cleaning your room is 'optional' each day. An advertised 'Contentantal Breakfast' in a hotel room that is nothing more than a coffee dispenser and a front desk clerk (probably the owner) that tells you when you complain that housekeeping never showed up, \"Ok, we have towels up in the front lobby if you'd like to come get them\". Surrounding one of our mirrors (that were probably bought at a thrift store), there was the old paint color that obviously was behind a much larger mirror some time ago, laid dead bugs that were stuck to the wall. I woke up with back pain each morning, and my wife and I were both fearful to sleep without being fully clothed. I don't even want to think about what was in the carpet! Needless to say, the pictures DEFINITELY do not match the experience - BEWARE!", "Date": "November 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "san francisco", "Title": "“decent price and decent folks”", "Author": "unaisi", "ReviewID": "UR115984387", "Content": "This was a a pretty nice simple place to stay at whilst attending a convention across the street at the Wyndham. The price was very moderate and the staff were the sweetest. The location was great I wish they would have offered more in the way of snacks and pastries for sale. Access to the main driveway for the shuttle for early morning pick up was a bit of a bother as the main entrance to the lobby was locked and we had to go all the way around to get outside with our heavy bags - that was the only real problem experienced at this hotell.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“served its purpose”", "Author": "missdnell", "ReviewID": "UR106854991", "Content": "My husband and I stayed at this hotel before we went on a cruise we were looking for a \"cheap\" hotel to stay in that wasn't to far from all of the attractions. It was a little worn out and needs a some upgrading. However the room was decent the bed was comfortable sheets clean the water was hot. Didn't really have a bad experience. We have stayed in 5star hotels with bedbugs and bad service. For the most part it served its purpose.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“No no no no!”", "Author": "Manny36", "ReviewID": "UR105418503", "Content": "So I read all the awful reviews wich pretty much made me cancel the reservation, then they tell me that their gonna charge me for the night since I canceled 9 hours before , so when I tell then ok then I'll stay the night that you charged me then , the lady proceeds to tell me that she's gonna charge me for another separate night in addition....wtf.... Never ever ever go to this place.....ever", "Date": "April 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "gross64", "Title": "“GROSS GROSS GROSS DONT SPEND A NIGHT HERE”", "Author": "gross64", "ReviewID": "UR105103460", "Content": "no mattress cover on bed, holes in blanket wet bath tissue balls in bathroom stuff spilt on dresser. gave us another room tub was gross sheets were to big for bed.holes in blanket the fridge was rusted no internet like they say. the pool was broke you couldnt use that. it was just gross next day my cousin got another place to stay. my cousin travels all the time i booked this room for us not knowing how bad it was going to be, she said it was the worse she has ever seen. save your money or spend a lil more and get a place were you can put your head down and have nothing crawl on you. it was gross gross gross.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Laconia, New Hampshire", "Title": "“No Bedbugs, and slightly below average....”", "Author": "Love2travelHamptonNH", "ReviewID": "UR104438442", "Content": "Check your room before renting, if you can overlook torn carpet, a running toilet that sounds like a water fall, ( Kind of nice ) and a below average cleaning, you will find the price semi reasonable for what you get. Wore my flip flops around the room and in the shower, but after staying at a Super 8 from hell, this property seemed like a stay at a Disney Property. Again, if you want cheap, this is certainly not the worst on 192 !!", "Date": "April 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Rude Service, Nasty, Moldy, Disgusting Hotel”", "Author": "india818", "ReviewID": "UR103925156", "Content": "My Daughter is writing this for me I would not recommend this hotel to anyone, not even my worst enemies. The rooms are ugly, old and broken, the sheets look like they were not changed, with stains and dirt. Holes in most of the sheets, the beds are from when they first opened the hotel. The room service or housekeepers are rude and questionable to say the least, was there for a week and they never came into my room, had to go to the front to ask for towels and the lady, I think her name was Teresia or something was rude to me, only because I do not speak english, she told my daughter that we are in american and that I should speak english. I would never stay at this hotel again. They have cars parked on the side like if they are a mechanic shop, the maintenance worker looks like he is high on drugs and the housekeepers smell like they were drinking on the job....the carpets are dirty, the bathrooms are moldy and smelly, the shower curtains had mold on them and the outside of that place is dirty, the pool, my God the furniture is broken and the water is green, I would not let my kids get in the pool for fear that they would get sick. I even took a bath with my flip flops because i was afraid to get contiminated with whatever is in the tub. Breakfast, if you can call it that, consist of bread butter, juice and cereal and they call that continental breakfast. The health inspectors should go in and inspect all the rooms. Please do yourself a favor and find another hotel to stay at...we left after that week and went next door to the travel lodge, clean and w/ heated pool.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“Beware!!”", "Author": "disneyfan007", "ReviewID": "UR100448502", "Content": "Horrible place. They rent out by the week and the people they attract are very sketchy. The staff is extremely rude especially the management. Their blankets have holes in them and look for bedbugs!! You do get what you pay for, but this place was overpriced for the trashy interior and staff. Felt extremely unsafe. In a word, just plain NASTY.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "NYC", "Title": "“The WORST experience I've EVer HaD in customer Service. Don't stay Here.”", "Author": "TorotravelerNyc", "ReviewID": "UR100077876", "Content": "We planned a trip to Orlando and looked up this hotel. We paid for two decent rooms at a good price. Got my confirmation number with AA.com. We spend our fist day at the parks and it was time to go an check into this nightmare hotel. When we arrived  there was one front desk attendant. She looked overwhelmed with calls from rooms. She said hi. How can I help - her name was Lissie? Or Liza?  We gave our confirmation number and she looked at papers on a very messy front desk. She said \"sorry you don't have a reservation here\". She continued answering calls from rooms asking to be changed because the rooms were dirty/ no towels/ and one lady that came into the office demanding to speak to the manager- we alsoasked to speak to a manager and were told by Lizzie. \" I am not a supervisor or a manager\" she is not here. I am alone here tonite. When we called AA and told us we indeed had a reservation at the hotel- the front desk agent Lizzie said. We call all companies yesterday  and told them we were sold out. She was not helpful and was getting angrier by the minute- she was annoyed by us telling her we did not have a place to stay in Orlando. She said sorry and to get out of the office. This sorry excuse of a hotel did not want to take responsibility for  their mistake. I would never stay in a ace like that. This kind of stablishments do not deserve anyone's money. Before getting out of the  office we asked for the non existing manager's name and were given only the fist name \"Amy \". When we asked for last names the rude front desk agent said\" I cannot give you either last name- it is too personal\" what kind of hotels that? sTAY away from that place. They deserve to go out of business. When we were leaving there was another couple in the lobby with the same problem. They take your money- give you a confirmation number and when it is time to check in you dont have a room. I demand a refund. Any other descent hotel would have made  arragents to \"walk\" you to an alternative hotel. The Masters Inn in Kissimee Orlando is the Worst place to stay.!!!! Stay away from them.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“HORRIBLE!!!!!!!!!!!!!!!!!”", "Author": "s0uthernbelle75", "ReviewID": "UR95328992", "Content": "This hotel was absolutely the worst place to stay along I 192. The room was smelly, the carpet was wet, the furniture was broken, there was no toilet paper and when the front desk was called to bring some, the Maintenance guy showed up 30 minutes later with 1 roll! Thank goodness for the Waffle House next door, because the\"breakfast\" was a joke. To sum it up.....this place sucked!!!!!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Don't Go”", "Author": "Ovidio1", "ReviewID": "UR89876639", "Content": "This was the worst experience ever. The room didn't have a clock,there is no bathroom vent. I asked for a iron I had to give ID for it and they don't have ironing boards. Breakfast is bread that is still in the bag and if the person before you decides to go to the bathroom and not wash their hands I don't have to say much more. They claim that there is wifi but no Internet in the entire hotel. The service was also awful and the staff really rude, they even sat and watched over you while you were at breakfast (or lack of it). Do not ever stay in this hotel!!", "Date": "December 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Orlando, Florida", "Title": "“The motel is the worst I have ever stayed at in my life.”", "Author": "paristravels1001", "ReviewID": "UR89573686", "Content": "First of all, we arrived, as soon as we pulled up, a strange maintenance man approached, offered to clean our lights and mirrors on the car. I use the internet for work, and although, they advertise \"wifi\" there was no such thing, when we called the desk, they assured they would take care of it, have the maintenance man reset the wifi connection, yet the whole time we were there, we had no internet access, [but the travelodge next doors wifi showed up] Night time came, no fitted sheets, and the beds sucked, when shower time came, the water was luke warm, there were no trashcans in the room, AT ALL, and no ash trays, even though it was a smoking room. Early the next morning a kid knocked on our door and ran off. This motel is in a good location I-192, but overall it sucked. I will NEVER stay here again.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "MEXICO México México", "Title": "“AWful”", "Author": "ILLIEBB", "ReviewID": "UR72096510", "Content": "Very bad service, they did not clean the room 2 days and the did not have soap and tissue, internet only in the lobby, the room was old, the breakfast was poor, only cereal and coffee,", "Date": "July 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New Orleans", "Title": "“Ouch!!”", "Author": "kerriag", "ReviewID": "UR62044960", "Content": "I've stayed in many different hotels down 192. I have to say that this one was very scary. When we initially arrived in the room, it smelled so musty that I pulled out the Lysol and started spraying. It was the smell of a shoe locker. The room appeared to be funky, with dirty carpet, trash behind the night stand, and mold around the sink and tub. I went down to Target and purchased more cleaning products just to get me through those few days. I totally understand that these are cheap hotels and in an older location, but this was really bad compared to the others. After sleeping in the bed the first night, I could barely walk my back ached so bad. The mattresses were so old that they had no cushion left to them, just sunken in and as hard as the floor. I again ended up at Target, but this time to purchase an air mattress. I paid $40 for that and the pump, and slept on that the rest of my nights there. I never made it to their so-called continental breakfast because they locked the room before 0930 every morning. The breakfast room was merely an ordinary hotel room without the beds in it, with a table and chairs. The only good thing was that Waffle House was walking distance!", "Date": "April 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "MIAMI", "Title": "“Filthy, nasty, smelly and moldy hotel to stay in !!!”", "Author": "qbanfifi22", "ReviewID": "UR60053199", "Content": "when we first stepped in the lobby it smelled like wet dogs .i wanted to throw up . they gave me a room in the second floor and it was so dirty that the toilets were dripping down with pee and the floor nasty dirty. the bath tub were dirty with stains like if they dont clean it at all . i wouldnt dare take a bath in there. IT WAS FULL OF MOLD . i may catch some type of disease there . specially if u have kids along with u . The comforters and spreadsheets were full of holes like if rats were chewing on them. With big pee stains on them . Roaches all over the room. Discusting !!!!!.I strongly will not recommend this hote to anyone specially if u have kids !oh and if ure satisfied with your room , they do not give u ure money bak so please !!!!!!!!!!!! Donot make reservations here ! Is just insane of how dirty and nasty this hotel is .They need to do do a deep cleaning with a few bottles of clorox or better yet make a new hotel completely new!!! They have the worst front desk customer service and very rude people too . The pictures on the internet are from the hotel was first made ...They are liars and scammers !!!! ... IS INCREDIBLE NASTY AND UNSANITARY FOR EVERY US HUMANS. THEY ONLY NEED ANIMALS TO RENT THERE .. IM JUST GIVING U GUYS A HEADS UP .. BE CAREFUL WITH MASTERS INN HOTEL. THEY ARE SCAMMERS AND VERY UNPOLITE FRONT DESK PEOPLE ..THEY HAVE NO CUSTOMER SERVICE EXP. AND THEY TREAT YOU VERY BAD. OH AND THE POOL WAS JUST FILTHY.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "virginia", "Title": "“Nice Place”", "Author": "hitsVirginia", "ReviewID": "UR59782904", "Content": "Wow. Moderate rate ,We were on a trip in Master Inn during a holiday weekend and happened upon the Smart Motel. How nice to be able to check in and go straight to your room without having to interact with anyone. Desk clerks are a so nice, but it was so much quicker especially after having driven most of the day and just wanting to get to bed. The room itself was great, clean and so much more than adequate. Would so stay here again. Nice Heated Pool after i was tired from my driving i was spent rest of the time in Heated pool. Awsome Place", "Date": "March 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "2", "Rooms": "1"}, "AuthorLocation": "New Jersey", "Title": "“HORRIBLE”", "Author": "travelgirl65nj", "ReviewID": "UR52702610", "Content": "We were scheduled to stay at Masters Inn Maingate but were switched to this one, because the other one was undergoing renovations (wrong hotel renovations needed if you asked me, the other one is just fine stayed there 3 times) The heater did not work, we were told we had a \"weekly rate\" and they never made our beds and we had to ask for new towels. I had to call because we ran out of toilet paper. The travelodge next door looked like ritz carlton next to this s**thole The drawers did not work properly will never ever stay here again.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Miami fl", "Title": "“What a piece of crap”", "Author": "positogirl", "ReviewID": "UR48090986", "Content": "I've stayed in this hotel every time we would go to orlando because the rooms were pretty clean and well maintained but now is not how it used to be. The bath tub was clogged , the water would reach over the ankles, There was a big hole on the wall in the bath room,also the bar that holds the towels was on the floor broken, there was another hole where the AC goes, and the blanket was so nasty looking that i thank god i took my own. I mean this place is starting to look like one of them lil cheap roach motels that are around miami. if i was you i would go else where.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "So. Maine", "Title": "“adequate, no frills”", "Author": "shaskellyrabbit", "ReviewID": "UR46146263", "Content": "Good Location, great front desk help and waitstaff at the next door Waffle House", "Date": "October 7, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Fort Lauderdale", "Title": "“A bunch of TLC needed”", "Author": "easytravler11", "ReviewID": "UR41960737", "Content": "Stayed there when I was called for an emergency business trip. Got done with first day of business and started to hunt for lodging nearby. This place looked O.K. from the street so I checked in. The room rate should have been my first clue but I figured the season just ended and that was the off-season rate. Wrong. My room had all the original furnishings from like two or more decades ago. This might have been branded a Holiday Inn originally. The metal post of the TV stand was rusted the bathroom was FILTHY. No coffee maker. no iron or board (asked to borrow one from front desk NOPE). Linens must have been acquired from a thrift store. Noisy AC. This is a fledgling chain that went so far as to put thier logo on cheap cups but no housekeeping discipline. Checked out the next morning and stayed at the Quality Inn (Sand Lake Rd) the next two night which was worth the extra drive.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“The Most Unkept Hotel In My 5 Years Staying In Hotel's In FL. MASTER'S INN IS THE WORST!!!”", "Author": "MISUKZ", "ReviewID": "UR34506032", "Content": "If I can rate Master's Inn \"0\", then here it is... 0!! The swimming pool is so filthy that you can see guest room key cards on the bottom of the pool that was their for weeks. My best bet/advice, DON'T STAY HERE!!. When I leave to go to the Disney Parks, I put out the sign on my door that says :\"Please Service Room\". When I put that up, I WANT THEM TO CLEAN MY ROOM. When I get back from the parks I expect my room to look clean. Every, single day I leave and come back ONLY 1 of my beds are made. The second bed is left the way it was when I woke up in the morning. They left that same bed like that for 4 days straight. And when you tell the manager, nothing seems to be done about it. I hope the public knows that MASTER'S INN IS A WASTE OF PEOPLE'S TIME AND MONEY!! We all known it's a ressecian but please, the Master Inn's wouldn't make a difference. Good luck to each and every one of you who choose to stay at the Master's Inn. Last but not least, the breakfest that they promised, not true. Some of the juice dispencer's don't work, and most of them dispence water other than juice.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "holland", "Title": "“Stay away from the Masters Inn”", "Author": "lowieHolland", "ReviewID": "UR19048631", "Content": "Was booked here for 2 nights through tour operator (Kuoni). The worst hotel of our 22 day tour. Looks like renovation is due immediately. Old and dirty looking blankets on the bed that was very old and ready to be replaced (like everything else in the room) uncomfortable. noisy airco. Breakfast (complimentary) was a choice of sweet rolls from a carton box and coffee. Pool was OK. Wifi only in lobby.", "Date": "August 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dewitt", "Title": "“Good budget option”", "Author": "Dewitt_traveler", "ReviewID": "UR17923068", "Content": "We recently stayed at the Master's Inn for four nights. This is not a luxury motel, but a good option for those on a budget looking for a place to crash at night. I gave the motel a 3, which I believe is a fair rating for the price group it is in. At the price I booked it for I don't expect perfection. I've had much worse rooms that cost 2-3 times as much. Positives -- Easy to find location with lots of dining options within easy walking distance. Within short drive to all area attractions. Friendly helpful, staff. Large pool. Negatives -- Furnishing showed some damage. Room did not have remote control (asked and received) or an ice bucket (asked, promised, but didn't receive). Water also dripped continually from the shower. Room could have been cleaner, but not disgusting. No Internet service available. Continental breakfast of watered down juice, coffee and unappealing variety of rolls and muffins (We ate at nearby breakfast buffets for $4 a person).", "Date": "July 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gloucestershire UK", "Title": "“You get what you pay”", "Author": "hannahdoll", "ReviewID": "UR16416420", "Content": "This hotel was ok. You basically get what you pay for, with a hotel like this your not to expect 5 star service and acom. Room was clean and the cleaners came in everyday to clean it and put fresh towels down, bathroom was kept clean, room also had mini fridge and tv which was handy. Pool and surroundings were nice to look at. The staff were kind and helpful. The only dissapointing thing is that there isnt anywhere to eat on site apart from a very small breakfast room. This hotel is ideal if you just want somewhere to sleep and your out during most of the day and dont expect anything special.", "Date": "May 26, 2008"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Disgusting”", "Author": "patsibee", "ReviewID": "UR14342963", "Content": "Absolutely Disgusting room - had to find somewhere else to go, spiders, broken air conditioner, dirty and very smelly.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wilson, NC", "Title": "“Lesson Learned”", "Author": "bshaw96", "ReviewID": "UR13577231", "Content": "We stayed here Feb.8-15. Not a pleasant experience at all. Read several bad reviews prior to trip, but decided for the price, to give it a try. We definitely learned our lesson. If you're paying 35.00 a night on average, you'll get a room worth 35.00 a night. First off, we're not extremely picky. And we went with an open mind. But this experience was horrible. We rented the king, non smoking room. If it was non smoking, you wouldn't know it. It smelled horrible, not sure if it was smoke or mildew? Or a combo of both. There was a cigarette burn in the comforter and pillowcase. Next, there was mildew all over the shower curtain and walls. The water regulator in the shower apparently did not work as throughout the shower the water changed from cold to very hot, actually burned us a few times. Learned to take a cool shower just not to get burned when it surged to a higher temp. They gave you 3 towels for 2 adults, and would not give extras until you turned in your dirty ones. Never changed the sheets. If you wish to sleep in and plan on not leaving until after 10am, make the bed yourself. They won't come back. AC controlled the temp terribly. Went from hot to cold on its own. Beds were horribly uncomfortable (And we spend our weekends in the summer in a pop up camper- these beds were no more comfortable!) The continental breakfast was actually in an empty room. It was loud. Not sure if we were next to a fire department or not, but heard fire engines and police cars all hours of the night. It never gets quiet, and you hear people talking outside your door constantly. I can say nothing positive about our stay. We stayed at a Master's Inn on I Drive and had a much better experience. This was another reason we felt safe trying this. NEVER AGAIN! As I said, for the price, we weren't expecting the Hilton, but we were expecting to feel safe and comfortable.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great Deal for the price”", "Author": "PR_Bob", "ReviewID": "UR13122577", "Content": "Pleasently surprised. It was clean, convenient, Friendly staff and cheap.", "Date": "January 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto, ON", "Title": "“Wouldn't do it again”", "Author": "rileyzmum", "ReviewID": "UR8690940", "Content": "My friends and I stayed here from August 20-25. Location was great. We were pretty much central to all the things we wanted. Service was horrible. Be aware that there apparently is a deposit to use the phone in the rooms. We were not told about this so even though we had phone cards for free calls they were going to charge us and disconnected our phone without telling us until we complained about 3 times. Pillows are low quality and when we asked about extra pillows we were only aloud 2 more even though there were 4 of us. Cleaning wasn't so bad except they never left us toilet paper and when they did on our last day they left us a half used one. If you're looking for somewhere just to sleep I would semi recommend but if you plan on spending time in your room it's not worth it. Staff gives lots of attitude when confronted about problems or questions.", "Date": "September 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Terrible service!!!!!”", "Author": "meetoo64", "ReviewID": "UR8494337", "Content": "I stayed at this property from August 11-20 2007 and i must say in all my travels this was the WORST!!!!!!!!!. It started off with my checki-in i was told that the quote i received for my billing online was not correct. The representative gave me alot of attitude!! 2. The room was non-smoking and it smelled like smoke from the door all the way through the bathroom and when i enquired i was told it is non-smoking the representative didn't even enquired further to give a solution. 3. The linen and towels are over used and worn 4. The continental breakfast is only a dounut plastic wrap with tea & juice. Nothing else!!!!! 5. If you have friends or family calling please be prepared to not get calls because when they call 8 out of 10 times they get no answer. The location is good but the service is terrible!!!!!!!!!!!!!", "Date": "August 24, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "stoke on trent", "Title": "“great”", "Author": "StokeOnTrentSharon", "ReviewID": "UR8038456", "Content": "me and my partner stayed here 4 2 weeks and i have to say i was really apprehensive after the reports i had read on the place.but i was pleasantly surprised,the room was basic wich was all we needed as we didnt spend a lot of time in it,but the bed was comfatable,the shower was good and the air con was a life saver!the room was cleaned every day,the staff were always helpful and the pool was immaculate.i would recomend it to anyone whos lookin for a cheap comfatable and pleasant stay in orlando,plus you ave amazin bars and restaurants rite on the doorstep.dont listen to negative reports try it for yourself,id stay there again definately.", "Date": "July 2, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ludwigsburg", "Title": "“Can't recommend”", "Author": "Esche72", "ReviewID": "UR7987179", "Content": "They don't really care about their guests. We got no pillows, dirty sheets, room wasn't clean, sink stopper was out of order, air-condition was ugly, remote control was out of order. Other familiy switched three times their room (1. dead bugs, 2. broken air-condition, 3. dirty sheets), staff helped but weren't really friendly, pool was out of order.", "Date": "June 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kent,England", "Title": "“Not fantastic,but cheap!”", "Author": "haymay", "ReviewID": "UR7639831", "Content": "We stayed here in January and booked through Virgin Holidays. I was a little taken aback as to the condition of the hotel rooms, but we didnt pay much for our holiday. The location was great, as we would end up eating at Longhorn's steakhouse right next door, and thought the food was very good. We found the reception staff were very helpful. The main problem with the hotel was the fact that it was used as a truck park and we would be woken up at 3 in the morning by lorrys pulling up. Also, the doors didnt seem very secure in the rooms, you could still open the door from the outside and the only thing stopping someone breaking in was a latch you pulled over. One evening my boyfriend left his shoes outside our room for an hour as we had just got soaked at a theme park, and they were stolen! In all it was ok, but out of the 6 times ive been to kissimee, its fair to say this was the worst hotel i've stayed in.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Liverpool, New York", "Title": "“2 Nights were 2 too many!”", "Author": "thevopro", "ReviewID": "UR7301213", "Content": "We went from a beautiful room in the Florida Keys to a disgusting rat hole. Wow! 2 nights were 2 too many! We reserved a non-smoking room and were put into a smoking room. Too tired to request another. The carpets were stained with something (too vulgar to mention), the room smelled like a huge ashtray, no remote for the TV, no phone, worn away caulk in the bathroom, paper thin walls, pets allowed and are roaming the halls outside, a digusting Continental breakfast where people were acting like they have never eaten before - grabbing everything insight and throwing the wrappers in the parking lot (who has Continental Breakfasts in Room #'s for crying out loud!). The gentleman at the desk kept calling us \"bro...bro\" and we knew then we were in trouble....when he mentioned the Continental Breakfast in Room 106 - we knew we were doomed.....and we were. I will never stay at a Masters Inn ever again. Be aware everyone - like dad always says - \"You get what you pay for\" - and we did. Spend the extra money and sleep comfortably!", "Date": "April 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester,U.K.", "Title": "“not as bad as the reports”", "Author": "MarilynMcCarthy", "ReviewID": "UR7244758", "Content": "this motel is not the ritz but then neither are the prices.we fond the rooms reasonably clean etc but i would say the place is ready for refurbishment.good location,staff were helpful and friendly only failing was lack of hairdryers in rooms,but would stay there again,don't be a sheep and following the flock,make your own judgement on the place.", "Date": "March 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Visé", "Title": "“Great Stay”", "Author": "bibamonseur", "ReviewID": "UR7164974", "Content": "We had a great stay in MI, Kissimmee ... Our room was clean, as well as bathroom. We had clean towels every day! Car parking facility is big, breakfast is ok (muffins, coffee, delicious orange juice ...) and staff is very friendly! I would recomment it! Price/quality is excellent ...", "Date": "March 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "ct", "Title": "“Rip off”", "Author": "mastersinn", "ReviewID": "UR6583778", "Content": "This hotel was the most disgusting place i've ever seen, not even worth what we paid!!! It only does shuttle service once a day to 1 park (not all disney parks like they say) and you'd be lucky to get on it -it was so full. They told be I should just take a cab ($18.00 each way). Holes near electrical outlets exposing wires. Room smelled like Body odor and sewage, fruit flys around bathroom sink and shower. No toiletries are given, room wasn't cleaned/vacummmed sufficiently. Mattress pad is way smaller than the bed, no fitted sheet over mattress-springs poking through bed- we got back a f ew day's ago and my back STILL hurts!!! And on top of if- the people who worked there were rude!!!", "Date": "January 12, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "NC", "Title": "“Horrible!”", "Author": "kendel72", "ReviewID": "UR6533309", "Content": "We just spent about 5 nights @ this hotel and it was by far the worst place I have ever stayed at, @ check in the guy who checked us in reaked of alcohol so bad my wife had to walk off. The water smelled like sewer and for the first 3 mornings we barely had lukewarm water to take showers, every evening we came in and turned on the tv the channel was on SPANISH channel! Evidentally the maid was watching BOTH of our tv's while she was suppose to be cleaning so this makes me wonder what else she was doing in our room!", "Date": "January 1, 2007"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Service": "1"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Do Not Stay Here!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5008069", "Content": "We were a group of three chaperones with eight school aged girls. If it weren't so late upon arrival, we would have left. Good thing it was only one night. They allow pets here. That part is alright, but they happened to miss changing the pillow cases after a dog stayed in one of the rooms. Dog hair on your pillow! Another room had dirty bedsheets. Dirty, not stained. Our non-smoking room smelled thickly of smoke and while I needed to keep all four rooms together, the option of trying another non-smoking room wasn't available unless we split to both sides of the hotel so I tried a smoking room which ended up being less smoky than the non-smoking room. While discussing the smoking issue with the front desk clerk that night, he sarcastically mentioned how they \"would have to remind guests not to smoke in the rooms\" and looked at me and smiled. The toilet did not flush properly in another room and there was food left in the refrigerator from a guest that stayed before us. BRING SHOWER SHOES! The bathtubs must be too old to clean thoroughly. (right) BRING HOUSE SLIPPERS or wear socks in the room. Those floors are NaStY! The next morning we saw how important the smoking issue was; housekeeping smokes from room to room while \"cleaning\". Do not expect any of the following in these rooms: shampoo, conditioner, coffee pot, clock/radio. Room DOES comes with bath towels and soap. \"Continental Breakfast\" (located in one of the hotel rooms downstairs): Four cardboard boxes, laced with crumbs on the bottom containing individually wrapped muffins and a coffee machine that poured coffee with film mixed with coffee grounds. Gross, gross, gross! Topping it off, we packed our cars in the morning to see someone had scratch \"THE\" terrible four letter word into one of the car doors. Front desk associate said he would let the management know. How many front desk clerks do they let wear a tag that says \"Manager\"? I just walked away.", "Date": "April 25, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "United Kingdom", "Title": "“How to Kill The Magic In Orlando”", "Author": "A TripAdvisor Member", "ReviewID": "UR4997530", "Content": "Just to clarify, we travelled from the UK on a budget package, so weren't expecting the Ritz, but never thought it would be this bad! A word to the wise - we read the reviews on Tripadvisor and still booked - please don't make the same mistake we did. To be fair though, there are two hotels in Kissimmee called the Masters Inn - the other one is nearer Old Town, and seems to get slightly better reviews. The one we are talking about in this instance is near the big \"Orange\". This hotel may be cheap, but it will (in our opinion) spoil your memories of Florida. Let's put it this way, we were booked to stay there 9 nights, and left after just one. The thought of having to return to THAT room for 9 nights was just too much to cope with. The hotel staff seemed more like ex-prison officers than customer-focussed individuals. In fact, we found them quite intimidating. The room was, as has often been used to describe the Masters Inn in these reviews, grotty. To give you a flavour, there was a hole in one of the blankets you could put your hand through. The sideboard looked as though it had previously been dropped off the balcony, and had seen much better days. The room was cold, the steam from the shower kept setting off the fire alarm, there was a layer of crumbs and grime beneath the TV stand... I could go on. There was also a dog barking in a nearby room, and we both felt itchy and suffered from asthma whilst in the room. Could this have been bad housekeeping we wondered? For the first time in Orlando, I actually felt scared in the room, and the flimsy door opened out to the whole wide world - and the two flights of dingy stairs up to the rooms (no elevators) were not nice. The free breakfast was served in a room that made a shed look posh. The vacuum packed pink cakes were something else ;-) And another thing; we took this hotel because it was advertised in the UK as a 'non driving option'. It really isn't - you've got a long walk to Old Town, and anything else worth seeing in Kissimmee, and the free transportation only goes to Disney, so you'll be looking at a taxi to Universal. Talking of taxi's the hotel guy booked us one with a \"highly recommended friend\" of his, and it cost us $27 for a 2 minute journey. We really do try to find the best in things, but couldn't find any redeeming features in the Masters Inn Kissimmee. We've now stopped in 4 different hotels in Orlando, and this was by far the worst. All these bad reviews must be telling us something :-)", "Date": "April 23, 2006"}], "HotelInfo": {"Name": "Masters Inn Orlando Kissimmee", "HotelURL": "/ShowUserReviews-g34352-d88577-Reviews-Masters_Inn_Orlando_Kissimmee-Kissimmee_Florida.html", "Price": "$37 - $50*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5367 W. Irlo Bronson Highway</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34747</span></span> </span></span></address>", "HotelID": "88577", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/57/91/5791fb5749944b6f1dfd1703dea905303large.jpg"}}