{"Reviews": [{"Content": "For business travellers rather than tourists I stayed in June 2005. This accommodation is very big, sometimes I felt like I was in beehive 1980's style鈥?However I have no complains: smooth chick in/out, spacious and quiet room reasonably clean. The hotel is to be suggested to business travellers rather than to tourists since it is far from the charming French Quarter (which is approximately 20 minute walk). The hotel's area, very close to Superdome, is almost deserted at night.Considering that there are a number of rooms, this is the case in which you can get a good price over the internet (I booked through a on line bid: 80 USD, very good value).", "Date": "Aug 26, 2008", "ReviewID": "UR372388135", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "RSMDMuser"}, {"Content": "A Blast!!!       Me at Dooky Chase's Restaurant w/ our host T. Chase.", "Date": "Aug 25, 2007", "ReviewID": "UR471340817", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "shakiralovejamison"}, {"Content": "happy at the hyatt This was one of the best hotel experiences I have ever had. I am writing this review because now I am trying to re-book and there are no rooms available. Everything at this hotel is superlative, from arrival to departure. Friendly, professional, accommodating staff; fast room service (good food); clean rooms; access to everything in New Orleans via shuttle bus...I cannot say enough other than when will a room be available for me???", "Date": "Nov 16, 2006", "ReviewID": "UR905332315", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "2forthepriceuv1"}, {"Content": "Nice hotel       Hyatt Regency", "Date": "Aug 9, 2005", "ReviewID": "UR816646973", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Cruise,J.D."}, {"Content": "Quality stay at the Hyatt The Hyatt Regency New Orleans offers a more laid back and safer alternative to the hustle and bustle of the French Quarter hotels which are approximately a 15-20 minute walk. Located dowtown on Poydras Avenue, the Hyatt is a very large, atrium style property accomodating many business people in town for conferences. That being said, many leisure travelers will benefit from the various amenities such as a trolley style shuttle to Bourbon Street, a rooftop pool overlooking the skyline, as well as on-site restaurants and an adjacent shopping mall (average but covenient in a pinch). Another selling point is that the New Orleans Superdome is right next door.I stayed for four nights during a public health conference and had absolutely no complaints with the cleanliness of the rooms or the professionalism of the staff. However, this hotel, along with two other Hyatts where I have stayed, needs an interior facelift in that it has a bit of a 1980's feel to it (particularly Hi-Tops, the sports bar). All in all, this is an above average hotel where you can stay at a great price if booked online. Having visited friends at the Sheraton, I can safely say that this was a nicer hotel and would recommend the Hyatt for future travelers.", "Date": "Jun 12, 2005", "ReviewID": "UR597881708", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "We enjoyed out stay at the hyatt I don't know why there are so many negative reviews for this hotel. Our room was not small or dirty. The complaints about the bathrooms were not what we experienced. The staff were friendly. After the desk clerk assigned our room, our daughter asked for a room high up and he changed it without any problem. The housekeeping staff was very friendly and the concierge was helpful. The attached mall isn't that great...not many stores. The shuttle was fine, just remember it is leaves every half hour, they have a lunch and dinner break (ask about the times) and if there is a rider that has a wheelchair that will extend your wait time. Since we had our daughter with us, it was nice to not be near the FQ. We were able to visit during the day and enjoy the quite at night. My hubby went for business and I went for vacation so his company paid for it, but I would go back there on my own dime.", "Date": "Jun 9, 2005", "ReviewID": "UR237438967", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Vanilla New Orleans hotel The Hyatt downtown is definitely a vanilla accommodation -- stand in your room and blink and you could be in any run-of-the-mill Hyatt anywhere in America. It's probably best for business travelers or someone needing to be downtown. If you're here to party and hit the Quarter, then you might consider staying there because it's a long walk back at night (not necessarily scary, although I'm a big guy who lives in a big city -- anyone who feels vulnerable in urban areas at night should NOT make the walk from the FQ back alone).I too got the room via Hotwire and thought it was a more than fair rate. I got exactly what I expected and was satisfied, although only because I was there on business. I'd rather spend the same money for a slightly lesser property in a slightly more convenient location if I were there for pleasure.", "Date": "May 24, 2005", "ReviewID": "UR489506501", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "thebabs"}, {"Content": "Better than Expected Was a bit leery, given some of the reviews but, great rooms, good svc. Two things: next door to the Superdome, but kind've far to walk to the FQ. Their shuttle only works every 30min. We wanted a room w/a King and the first night we got in late and all they had left was 2 doubles and so we had to switch the 2nd day. Overall, pretty good.", "Date": "May 20, 2005", "ReviewID": "UR674238742", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Average hotel perfect for eating your way through New Orleans! The reviews are right -- if you paid more than $90 for this hotel, and you spent your entire vacation at the hotel instead of out and about eating and experiencing New Orleans, you may feel ripped off. My husband and I bought our room from hotwire and believe, because we only used the hotel for sleeping and showering, we received a good value for our three-night stay at $85 per night. Our room was clean but nothing about it that made it feel like New Orleans or any different than any other run-of-the-mill convention-center hotel in any other city in the U.S. Of course, you must add money to the cost of the hotel for cab fare anywhere. The hotel is definitely not close enough to the Quarter for a quick walk and back. A cab ride, however, is only about $6, and the shuttle from the hotel is very prompt and easy to use. If your only plans are to hang out in the city, we highly recommend not renting a car. A cab ride from the airport is only $28, but parking is about $20 a night at the hotel and you'll never find a place to park if you try to drive to the Quarter.We learned our lesson here -- on vacations where we plan to stay in, we like staying in exclusive little hotels with charm. When we are going on a trip like that, we'll definitely not use hotwire.com -- you never know what you're going to get!", "Date": "May 20, 2005", "ReviewID": "UR210890132", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "DallasNewYorkCity"}, {"Content": "not happy apparently if you did not book it thru priceline your got raked! I stayed during Jazzfest, the rooms are small and dingy. It is not close to anything! I waited 30 minutes to get my car! I will not stay here again!", "Date": "May 9, 2005", "ReviewID": "UR403918188", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Get it on Hotwire or Priceline We got it during Jazzfest for $95/night through Hotwire, which is about all I'd pay on a busy weekend like that, and I'd pay $75 tops on a non-busy week. The hotel's just OK, rooms are clean enough but very small, pool and workout room are nice. Park in Macys/mall garage for $12/day. There's a Cafe Dumonde franchise shop in the mall (connected to hotel), go there for coffee/breakfast. Avoid all extra costs, they gouge there for everything.", "Date": "May 5, 2005", "ReviewID": "UR753896208", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "ChrisR35"}, {"Content": "great employees this hotel is not in a prime area but a cab ride is only $6 that is sooooooo much lower than a cab would be to get to any major entertainment area in any major city. there is a shutttle that will take you if you chose to wait, now the employees are the main reason to stay there they make you feel like family", "Date": "May 4, 2005", "ReviewID": "UR541336118", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Super Hotel...       view of inside courtyard from elevator", "Date": "May 4, 2005", "ReviewID": "UR712628306", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "For the Right Price, A Decent Hotel We stayed at the Hyatt for Jazz Fest. We booked through Priceline ($60), so the value was absolutely terrific. The hotel is a typical Hyatt open atrium design. The towers are all non-smoking. The smoking rooms are in a seperate five story building and have balconies. All of the rooms in the hotel (with the exception of suites) have the same layout, furniture and amenities. The hotel was built in the early 80's and so does not compare to a new hotel in terms of quality of furniture, TVs, bathtubs and the like. But it has been very well maintained. The pillows and beds are comfortable. The bathrooms are clean. The towels are good. The carpets are not new, but clean. The blankets are double sheeted so you don't see or touch them (a nice touch). The hotel restaurant and sports bar are typical hotel fare -- other than convenience there is no reason to eat or drink here. There is an attached mall which has a Macy's, Dunkin Donuts, and a convenience store which sells cold beer and liquor. Again, nothing fancy. The location is not ideal unless you are attending a superdome event but is within walking distance to the French Quarter and waterfront if you like walking. For the savings, we were happy to walk and take cabs back at night. I did not use the hotel shuttle but apparently there is one to certain tourist destinations. The valet parking is $30 a day. If I had rented a car, I would have parked in a nearby open lot for $6 and walked a block back to the hotel. I would recommend this hotel if you were able to get a reasonable price. I would not pay a premium to stay here.", "Date": "May 1, 2005", "ReviewID": "UR108328021", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "PragmaticTraveler"}, {"Content": "New Orleans Hyatt We just arrived from New Orleans where we stayed at the Hyatt. It is next to the Superdome so it is a walk to Bourbon Street. This hotel really was great for staying at while at the Jazz Festival. There was a jazz fest shuttle that was at our hotel...the only other one was at the Sheriton and it was always crowded. The food was a bit pricey...but when in New Orleans, not too many people eat at the hotel. Rooms were clean, and an average size, and had a great view of the city. The toilet had no pressure and was a bother...but other than that an enjoyable stay.", "Date": "Apr 30, 2005", "ReviewID": "UR615331217", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Cinnamoncyndi"}, {"Content": "Good stay for Jazz Fest I stayed at the Hyatt last week for Jazz Fest. First off, this is not a four-star hotel, but it's not bad if you can get a deal (I got a good price on Hotwire).Pros:* Location is pretty good. It's a 15 minute walk to the Quarter, but not a bad walk in the morning. Shorter walk to the St. Charles trolley and Mother's (mmm).* One of two hotels served by the Jazz Fest shuttle.* Easy to get taxis out front.* Nice staff.* Rooms are clean and pretty well-kept.Cons:* Bathrooms are clean, but not immaculate. My tub had a strange dark stain that I conclude was just due to the enamel wearing away. I requested a rubber mat and all set.* The walk back at night along Poydras is a bit deserted. Take a taxi.", "Date": "Apr 29, 2005", "ReviewID": "UR543433547", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Stay at the Hyatt We stayed at the Hyatt Valentine's Day weekend and really enjoyed it. This is my 7th trip to New Orleans, and my first stay at the Hyatt. I booked the room through Priceline for $55.00, and for that price it was a steal! The staff was very friendly and eager to please. The room was on the small side, but it was very clean and quiet. Parking was pricey, but it's reasonable for New Orleans. The drinks at the sports bar were expensive, but we always went with the happy hour specials, which were cheap. I would definitely stay here again for the price that I paid. I would not stay here if I had to pay $200 for a room.", "Date": "Apr 18, 2005", "ReviewID": "UR501844138", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not too bad - pleasantly surprised I traveled to New Orleans for a business conference in March 2005 and stayed at the Hyatt Regency next to the Superdome. I had read some fairly lukewarm to bad reviews of the hotel on TripAdvisor.com and was not expecting to have a good time. However, I must admit that I was absolutely pleased with my stay at the hotel. My room was comfortable and clean, and the hotel staff was very courteous to me. I stayed at the hotel for 5 days and 4 nights and the location was fine. I really enjoyed their free shuttle service to the French Quarter -- very convenient and easy to use. Plus, it wasn't that far to walk to catch the St. Charles Street street car to the Garden District. The worst thing that happened to me was that my room was located in a place where the wireless internet signal was too weak for me to use my laptop. I called the front desk and they provided me a booster device that got me linked up quick -- and at no charge! I really had a good time and would stay at this hotel again.", "Date": "Apr 2, 2005", "ReviewID": "UR449770685", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not one good reason to stay at Hyatt This was a terrible part of a dream trip. I thought I'd spoil myself at an expensive 4 star hotel for once in my life, but I did so in the wrong hotel! I wish I read reviews first!! First of all this is just a basic hotel room, no character or charm what so ever. Inside you'll see it could be any motel 6 or quality inn or comfort inn, which makes me appreciate all the money I've saved over the years going to them. The fan was extra loud and staying by myself would have preferred a king to two doubles. Fortunetly I didn't have to hang out in the hotel, but it sucked putting out all that extra money, and also the shuttle constantly was early, late or a no show and they have no recourse. Save your money for Bourbon St. or Harrah's and stay in town, a free shuttle means nothing if you can't get it and have to take a taxi. People were friendly, but very unhelpful. I finally changed rooms to a nice quiet one with a king, but the damage was done. I met a nice young lady staying at another hotel who's room kicked major butt over mine so I stayed with her. Well, for other reasons too. Anyway, don't bother with this hotel, either save your money and stay close cheap, or spend the extra and make sure you do your homework!!! And have a great trip, don't miss a thing! :0)", "Date": "Mar 24, 2005", "ReviewID": "UR354478383", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hyatt makes you think it's a Caddy, but it's really a Chevy I booked the Hyatt on Hotwire for $88 a night. That's about what the hotel is worth. The hotel is nice enough, and has nearly every service immaginable. However, that's about all I can say about it. When I checked in, I requested a corner room with a king bed. The clerk told me that they only had corner rooms with double beds, so I requested a regular room with a king bed. When I got to my room, it was neither a corner or a king. I called back to the front desk, and they did not have any more kings available. Furthermore, the pay per view movies did not work. During my stay, the phone quit working. The beds weren't uncomfortable, but they were nothing special. The shower was no better than a Comfort Inn. The business center charged $12.50 an hour to use a computer, which are complementary in most hotels of this class. The location of this mega-hotel is horrible, unless you are going to the Superdome. Many other paid over $300 for the same room at this hotel. They got ripped off. It is not worth more than $90 a night. I will not stay at Hyatts anymore. Marriotts, Hiltons, and Westins are superior.", "Date": "Mar 18, 2005", "ReviewID": "UR801137561", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Tennreb"}, {"Content": "Poorest I have ever visited! Mr. Michael Smith:We booked a room for the Josh Groban concert.Our reservation was screwed up and it took almost an hour to check in.The room was extra small for the price.We could hear everything from the hall and adjoining rooms.After the concert we found the back entrances locked causing us to walk blocks to re-enter the hotel via the front doors.The room had been cleaned but the alarm had not been turned off. I had no need to wake early but the alarm went off @ 0515 hrs -- wide open. Couldnt find a way to turn off -- moved bed and unplugged the thing.The breakfast buffet was luke warm and could have been powdered eggs. I have had much better @ Shoneys.My wife and I travel frequently and will never stay at another Hyatt if at all possible.Surely this will make you no difference, but I thought I needed to voice my concerns.Ron Gauthier", "Date": "Mar 17, 2005", "ReviewID": "UR725890461", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hyatt Great for Any purpose I've stayed here twice -- once for jazz fest, once for business/pleasure. The Hyatt is in the CBD, a short ride ($5 cab) from bourbon st and all quarter destinations. There is a free shuttle to and from the quarter every 15min, large rooms with city views, a rooftop pool and jacuzzi (24hr), and a hotel top rotating restaurant/bar. Great value on discount internet sites (around 100 bucks). If you want quality/convenience a short distance away from the quarter, this is it.", "Date": "Mar 15, 2005", "ReviewID": "UR473915093", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Classy hotel with a great view of the French Quarter We had an excellent time at the Hyatt Regency New Orleans for our anniversary. The hotel has beautiful chandilers in the lobby, and you go up the ecalators and enter a huge atrium spanning the heighth of the entire building. It was very impressive!!! When we arrived about an hour before check in time, our room was not ready yet, however, the girl assisting us let us leave our bags with the bellman and go down to the french quater to have lunch on the hotel's shuttle service. We had requested a room on a high floor with a view of city, and our request was honored with a room on the 25th floor. The elevators are glass and it was kinda scary being that high up and looking down through the open atrium, but it was great. Our room was nice and not as small as we were expecting after reading other reviews. The bathroom was a little on the small side, but adequate. WE HAD AN AWESOME VIEW OF THE CITY AND BRIDGE!!! It was especially pretty all lit up at night. The staff at the Hyatt are very affable and friendly. They were very understanding and joked around with me when my husband had a little too much to drink on Bourbon street, and lost our room key at 1:30 am, and gave us another key promptly. If there is any draw backs to the Hyatt, it is that they charge $33. per night for vallet parking with out any other parking options. They do offer a free shuttle to Harrah's and the riverwalk from the hotel, but it is quite a walk to Bourbon street from both areas. I think over the course of 2 days that we probably walked 10 miles, but at least it helped us walk off some of the calories from the great creole food we ate. We got a great value on the Hyatt, especially since we booked on hotwire, and I don't have any signifcant complaints. I had an awesome first trip to New Olrean's, and I have told my husband I want to go every year for our anniversary. By the way don't gamble at Harrah's, the slots are very tight. Save your money for Bourbon street.", "Date": "Mar 14, 2005", "ReviewID": "UR936861835", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Aliciarr28"}, {"Content": "definitely not 4 stars It was like opening a beautifully wrapped present to find an old sock inside.Although the lobby was lovely and the staff THERE seemed polite and efficient, I cannot recommend this hotel for several reasons...the rooms are dark, small and in disrepair. the shower dribbled  the faucet spewed metallic specks every time you used it. As we were with a corporate event (on their dime) didn't ask for an upgrade til our days there began. We asked the manager because the two times we asked housekeeping for something it never arrived. We were prompty accomodated and moved to the concierge level. ...The bath was totally functional but the room was smaller (?) and just as dark. There was NO LOUNGE. When I inquired if it was just closed because it was Sunday, I was told, No, it is always closed and offered two breakfast coupons. ...Location is poor unless you are attending the Superdome or Arena. It is a good 20-30 minute walk to the French Quarter and 10 just to the St. Charles trolley. With so many other choices - just not worth it....", "Date": "Mar 8, 2005", "ReviewID": "UR120942213", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ortley"}, {"Content": "Somewhat Disappointing, Even for $79/night This place only gets 3 stars based on the price that I payed. If I'd have payed anything close to rack rate, it would have gotten 2 stars. This was the second Hyatt in which I've stayed. The other was an all suites property outside Atlanta, which was SUPERB, so perhaps my expectations were too high. Located next to the stadium, this is a huge facility. I can imagine what a zoo it must be when it is at capacity. I was there with my two brothers over Christmas 2004 when it few guests, so it felt kind of echoey. The good: nice building, complete with mall inside (which was entirely shut down, since it was Christmas - understandable), we had adjoining rooms on the 23rd floor with a beautiful view of New Orleans (remember, though, this isn't in the French Quarter - but they do have a shuttle). I had not complaint with the rooms - not big, but I've stayed in a lot smaller in Europe, and they were well kept up. The bad: I totally agree with an earlier comment that this hotel's size makes it feel like a factory. You feel like a widget instead of a guest. There was only a skeleton staff working (Christmas - again understandable, but made it difficult to find any assistance if you had a question or a problem). There was also a big temperature problem in the building. Because of the traditional Hyatt open atrium design and the incorporation of the mall space which was on minimum climate control, the place was freezing inside, a fact of which the desk staff was WELL aware. The business center was closed and the fitness center had what I considered to be unreasonably short hours. The most personally irritating thing to me, however, was the fact that the in room coffee machine only came with enough coffee for ONE cup. And this was not a housekeeping omission; I was told at the front desk that management had instituted that practice as a cost saving measure (and some lame excuse about the coffee going stale in unused rooms). I've never seen that at a Motel 6! Now, I recognize that part of my experience was due to essentially one-off seasonal conditions (the upside was that we got to see it snow in New Orleans for the first time in over 100 years), but there are real problems with this Hyatt. It was ok for $79 (website special), but not worth anything more, IMO.", "Date": "Mar 5, 2005", "ReviewID": "UR524620323", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "PlainVanilla"}, {"Content": "Priceline.... What a deal!!!! My boyfriend and I got a great deal on priceline for $60.00 per night, who can beat that! Ther hyatt can $60.00 for a suite read on.....Once we checked in we inquired about upgrading and paying more for a suite, but we were upgraded for no extra cost. The regular rooms are not so nice, but the suites are great very roomy.I would def. stay in a suite if you have the option. Beware of a few things the parking is very very expensive it is 33.00 a day, room service closes at 12:00 not at 2:00 am, and they are very pricey breakfast costed us $65.00. Dry cleaning guarentees you will have your clothes back by 7:00 the same day they really mena 8:00. Other than those few things the hotel was fine, very close to the quarter and the riverwalk.", "Date": "Feb 16, 2005", "ReviewID": "UR724730866", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "jewels123"}, {"Content": "go to hotwire and select 4 star for $100 +/-...it's hyatt! this hotel is NOT the most convenient location for getting to and from bourbon street, french quarter, and definitely not the riverfront...but for about $100 a night thru hotwire (it's the mystery 4-star rated one you will get at that site), and assumedly you can't plan over a month in advance anyway, this is not a bad place to stay. are there better places? yes, there are. if you can tolerate the noise, you can get the quarter house, or monteleone for that matter. the marriott down close to the river is nice, too. if you stay here, park at macy's. and don't get stuck down on bourbon street hoping to catch the shuttle back to the hotel around midnight or 1 a.m...it won't happen, so enjoy your mile walk.", "Date": "Jan 31, 2005", "ReviewID": "UR145186900", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "juliebob07"}, {"Content": "Great package deal!! My husband and I just returned from a 4 night stay at this hotel. We found a great package deal on travel zoo, and then got free breakfast buffet from the hotel. We parked at Macy's, which was more reasonable, and very convenient. The rooms were adequate, nothing fancy, but clean. The breakfast was wonderful. They have a shuttle that takes you to the french quarter, which was also pretty convenient. Everyone at the hotel was very helpful, and for the same price, we would DEFINATELY stay again. Thank you !!!", "Date": "Jan 26, 2005", "ReviewID": "UR379771979", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "pamelaM"}, {"Content": "You can do better in New Orleans You can get a better location, better service and a better value elsewhere in New Orleans. No need to stay here unless it's for a convention or you have Hyatt Points or something. It's a massive, over-run hotel that is geared toward conventioners and the service reflects that. The rooms are only average and they gauge you at every turn.", "Date": "Jan 20, 2005", "ReviewID": "UR366839764", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ewoo"}, {"Content": "Don't let the lobby fool you!!!! My husband and I and some friends stayed at the Hyatt Regency New Orleans over New Years Eve (2004/2005) and were very disappointed! We are from Chicago where our Hyatt Regency lives up to its 4-star rating. As you walk into the Hyatt in New Orleans the lobby is decorated beautifully, obviously this is where all the money is being spent, as the rooms are neglected. Our room (as well as our friends room) were both horribly dated, run-down and musty smelling. Our bathroom sink was clogged the whole 4 nights we stayed there and it was never fixed, even after numerous phone calls to the front desk. The sink even exploded one night leaving water and hair everywhere in the bathroom. It was disgusting! The front desk help are poorly trained and misinformed us in just about every question we asked. They will tell you anything to get rid of you and onto the next customer. What gets me the most is that this hotel has a 4-star rating on the website I booked it on. I wouldn't give it more than 2-stars and I am truely not a picky person. An excellent place that I have stayed in New Orleans and wish I would have done so again is The Sheraton on Canal Street. This hotel is truely a 4-star hotel!!!!", "Date": "Jan 10, 2005", "ReviewID": "UR577368210", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "StuChicago"}, {"Content": "Purchased on Hotwire for $163 per night. And after reading some of these reviews, I was pretty worried since I'm pickier than most people about where I stay. We had asked for a room with 2 double beds because we had two children travelling with us, which we were unable to get. They did give us a roll-a-way for one child, and the other one had to sleep in a chair with an ottomon or else with us in the king bed. The room was bigger than average, and the only negative I can say was regarding the tub. It was badly stained.The first couple of nights they were hosting a youth convention, so it was hard to get an elevator, but after the kids cleared out it was fine. The hotel has a nice sports bar, but since minors aren't allowed to even step foot in the place, we weren't able to take full advantage of it.Definately park at Macy's instead of the hotel parking. It's convenient, and you can't beat the price, $12 per night.I prefer getting away from the French Quarter, so the location was not a problem for me, but I do think they should offer the shuttle later into the evening. The last shuttle leaves the French Quarter at 10pm. Our shuttle broke down on the way to the French Quarter one evening, and the driver made us get off the bus, which meant we were getting off right into traffic. Sounds like this happens often.All in all, I would stay here again.", "Date": "Jan 7, 2005", "ReviewID": "UR889924108", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Blakeandbrookesmom"}, {"Content": "Hyatt has alot of potential if managed properly! I just returned from a 3 day stay at the Hyatt. We had a little family get together for New Years and rented 5 rooms there. The rooms were rented 2 months in advance and the types of rooms wanted were verified at that time. Imagine our suprise when we arrived and none of the rooms we booked (3 doubles  2 kings) were available (they had given them to other guest as they arrived). This may have been a error in our favor because I found that they have nice suites which they call parlor rooms. They offered us these in place of the other rooms (it was the only rooms left). The parlor rooms were quite nice. I opted for a king bed room which suddenly came available and discovered the small room that some have mentioned before. It was clean and comfortable but it was the smallest hotel room I think I've ever stayed in. The hotel was cleaner and more up-kept looking than it had been on my other stays (not that it was dirty then, Sugarbowl maybe???). The shuttle which use to run every 15 to 20 minutes was running only every 30 minutes. There were some problems that could have went either way, trivial or major. If the management would take alittle more pride  initiative in reservations and maintaining commitments this place could be a gem.", "Date": "Jan 5, 2005", "ReviewID": "UR653770869", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "tooltimeterry"}, {"Content": "Okay hotel for a business stay -- not if you have acrophobia I stayed at the Hyatt on business for a conference. The company paid the conference rate of $120 a day. I had a room with 2 double beds that was the usual business hotel double. Nothing special, but everything I needed. It was clean and the housekeeping staff did a nice job. Since I was going to a conference in the same hotel, the location was perfect. My colleagues who had king rooms however were incensed by their small size. There was barely any space in the room except for the bed. I would urge everyone to not reserve a king bed unless it is absolutely necessary.We took the shuttle to the French Quarter several times. It worked but it was very odd, with non-regular hours. In fact, the shuttle that was supposed to bring us home from the French Quarter broke down before ever picking us up from the French Quarter. After waiting for a very long time (45 minutes?), someone called the Hyatt to ask what was up. The Hyatt nicely told us to take cabs and that we would be reimbursed.Finally, if you have a fear of heights, this is not the hotel for you. The hotel is built around a central atrium that is 30 stories high. You cannot get to your room without walking close to the edge of the atrium. A coworker of mine was afraid to go in and out of her room because of the atrium. Personally, I enjoyed the atrium once I got used to it.", "Date": "Dec 24, 2004", "ReviewID": "UR296747785", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hated it!!!!!!!!!!!!!!!!!! First off, the prices were rediculous. Not only were the rooms completely over priced, but anything and everything you need from the Hotel is overpriced. Here is a small list of some of the prices I had to pay. (1 beer at the sports bar $4.25.. (1 Cheesburger and order of Fries from the sports bar $12.. (1 order of chicken strips (10 strips) from room service $10 for the food, $3.50 delivery charge and 20% service charge, plus tax.. that is a total of $16.40 for 10 chicken strips.. ($30+ per night for mandatory valet parking.. there is no parking lot for this hotel.. ($2 for (1) 20oz bottle of coke from the vending machine.. there are no food items in the vending machines.. and once the restuarants close you either order roomservice or have to go somewhere else.. Ate breakfast in the adjoining mall and was sick for (2) days, as was two other people who ate the same thing..Will never stay there again..Sink in the bathroom leaked and they tried to charge me a dollar a piece for local calls..Rooms were also small and very unimpressive..", "Date": "Dec 12, 2004", "ReviewID": "UR690437237", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel is Great, but don't eat at the restaurant The room was awesome, and I loved that it was connected to a mall, and The Superdome. The restaurant was overpriced with bad food. My husband ate off the buffet which was hot, but not much variety, and I ordered from the kitchen and had cold food. Our room came with 2 full breakfast coupons, and we were only allowed to eat fruit or a pastry. I don't know how fruit and a pastry is a full breakfast, but live and learn. The Top of the Dome Steakhouse is closed which noone bothered to tell us or we would not have stayed at this hotel. Park at Macy's it's $12 a day!!! The Hyatt does have a shuttle that will take you to 3 sperate locations in the French Quater. But like I said the room was great and they brought us anything that we needed promptly.", "Date": "Dec 6, 2004", "ReviewID": "UR968589663", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Mandatory Valet Parking There should be some type of warning that you will be paying $33/nite for valet parking! This is not an option - the only other choice is to park on the next block for $20/nite. For the price it was not a bad deal - priceline is a good way to go. The employees were nice but still did not get the room with double beds as requested. That probably had something to do with the fact I was not paying full price. I would not stay at this hotel again mainly for the valet and room service prices!!! I can go to a hotel cheaper than that and park without paying and drive through Taco Bell if I am hungry!!", "Date": "Nov 24, 2004", "ReviewID": "UR315453189", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not good Unless you are going to spend your entire vacation at the Superdome, it's location is difficult -- you need to walk or take the hotel shuttle (which I never got on because it's a little shuttle and lots of people want to take it). You can't walk home at night, because it's too isolated. Food is outrageously expensive at the hotel. Rooms are so-so, bathrooms are awful. No lighting in the shower, and the shower head just squirted water. And there was construction on the floor below me -- it started at 8:45 in the morning -- and I called the front desk and they put me hold for a manger who never picked up. And no one could reach me -- the front desk never transferred calls correctly, and whenever I called the front desk for a wake up call or whatever they didn't answer. There are so many great hotels in New Orleans, there is no need to stay at this one.", "Date": "Nov 14, 2004", "ReviewID": "UR301089149", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "NYCTravels032570"}, {"Content": "Very good value! My boyfriend and I stayed there over Halloween weekend and were very pleased with the hotel. Location is about 3 miles from the French Quarter but it's walkable and they have free shuttle service which was a great benefit. Great to take advantage of. The hotel itself and our room were very clean. Compared to the other hotels I researched, I later saw that it was not in the congested French Quarter like the rest. I got it for $80/night on hotwire when it was going for $215 on the Hyatt website. Great deal. We would definitely stay there again.", "Date": "Nov 10, 2004", "ReviewID": "UR355481371", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "hermars"}, {"Content": "Great price, good shuttle, average stay Stayed at the Hyatt, NO, over Labor Day weekend. We got an awesome price on Hotwire at around $50/night, so it was worth it; however, the parking was quite a rip-off. There was a Saints game the first night, and people going to the game got to park in the Hyatt garage for cheaper than hotel guests! Parking was about $35/night for guests-$20 for fans. I would suggest parking in the Macy's garage across the street for $12/night if you're parking your car. One good thing was the trolley from the hotel to the French Quarter. It ran on time and was efficient at picking up passengers and dropping them off. We didn't spend much time in the room because we were out sight-seeing, which is what we were there to do. For this reason, I didn't mind staying here. However, if you're looking for something luxurious, this is NOT the place.", "Date": "Sep 30, 2004", "ReviewID": "UR439865637", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Yuck! Dirty and run down We got a good rate, so it was bearable, but we were really unimpressed with this hotel. Our initial room was noticeably dirty. There was hair on the bathroom floor from the moment we set foot in there, which is a pretty gross start to your stay somewhere. The rest of the room was just generally grimy-feeling and really seemed worn down. I was surpised it was a Hyatt. We ended up moving rooms, which was ok, but there was nothing impressive about our new room, either. Whatever you do, don't stay at this hotel during the Essence Music Festival unless you are an excited festival-goer. Even though we were there for the festival, we didn't expect to hear nonstop, obnoxious music every night, all night, coming from the street below (and we were 20-some floors up). Of course, I know that's not the hotel's fault. It's just something to keep in mind if you're someone who likes quiet at night. Overall, I was very unimpressed. I would never stay there again, and I would never recommend it.", "Date": "Sep 24, 2004", "ReviewID": "UR307088318", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "SUPER, SUPER, SUPER, SUPER, SUPER What more could you ask for.Excellent location.Excellent room.Excellent shopping.Excellent valet service.Excellent food. Drawback - only stayed 3 days", "Date": "Sep 8, 2004", "ReviewID": "UR348888155", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Jessie James handles parking OVERPRICED , the amount you pay for a room and any service you use $25 a day for GUEST to park should be against the law!!!! You would think they could do a lot better on the parking,that alone will stop me form staying here again. one good thing the staff was very helpful and nice to deal with.", "Date": "Aug 16, 2004", "ReviewID": "UR393711833", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "gafffremd"}, {"Content": "I liked it! I thought that this hotel was very nice. The room was average, but I got a great deal on Hotwire. It was out of the way from the loud French Quarter, but they offered free trolley rides to 2 locations near the quarter. The concierge desk was VERY helpful. I recommend this hotel, as long as you can get a great rate.", "Date": "Jun 29, 2004", "ReviewID": "UR175291758", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very Pleasant Stay Great Room Great Staff We stayed at the Hyatt from June 11-13, 2004. We come to New Orleans frequently and this is the first time we had stayed at the Hyatt. It was a very pleasant experience. The staff was great, from the valet parking, bell staff, front desk staff and the trolley drivers. The housekeeping staff did a great job as well. Some past reviews mentioned dirty rooms, I did not see that at all. Our room was in the North tower and had a balcony overlooking the pool. The room was nicely furnished and of average size. The only problem with the room was the sliding glass door did not work properly, but did work and was not real issue with me. Staff came up and addressed the issue promptly and explained the situation. The trolley service was great for going to the French Quarter. We did not have the opportunity to get to any of the restaurants or bars in the hotel. We would definitely stay there again. Again it was a pleasant stay and the staff should be commended for their assistance and courtesy.", "Date": "Jun 23, 2004", "ReviewID": "UR794281919", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not bad if you get the right price!! We got a rate for Hyatt at $50 on priceline.com. For this price the hotel was great. Most other hotels in New Orleans were at least $100 dollars. Most of what we read in the other reviews are accurate and we would have been disappointed if we paid more than $50. For the most part the elevators were speedy, parking is expensive at $20 a night (suggest parking in another public lot, if you are not using your car), the bathrooms were small and dirty and the shuttle did not always run every 15 mintues as stated. But staying away from the French Quarter does allow you to get a good nights sleep and the location is not that far. New Orleans is a great walking city and you can walk to attractions, wait for the shuttle or pay a small fee for a cab. The staff are friendly and when we checked in we got a room with two double beds rather than a king but they easily fixed that for us when we called down. So If you can get a rate this low and don't mind a few problems try the Hyatt. We would probably stay again for this rate.", "Date": "Jun 22, 2004", "ReviewID": "UR585831168", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "not worth it! my mom and I passed through new orleans on a mini-sightseeing trip. I booked this room through priceline.com and when I called to confirm the reservation the guy I spoke to acted like I was bothering him or not a real customer when I told him I booked this on-line. The hotel is a little difficult to find, and we got lost, when I called the hotel the lady I spoke to was rude when I didn't understand her instructions. There were offices and other businesses in with this hotel so getting to the front desk is a little confusing. We waited about 5min. to get checked in, and the bellmen pointed us to the elevators and didn't even bother to ask if they could help us with our luggage. Our room air conditioner did not work properly and when we called they sent someone up, but he didn't fix the problem and the staff didn't offer us another room. I was glad we only had to spend one night. The next night was at the Marriott Courtyard which was wonderful (and it was booked through priceline as well)", "Date": "Jun 3, 2004", "ReviewID": "UR485053261", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great location The rooms at the hyatt are nice and spacious. Also, the hotel is conveniently located to nearby attractions, perfect for the family. There are a number of nice restaurants nearby and the hotel staff is always willing to point you in the right direction.", "Date": "Apr 13, 2004", "ReviewID": "UR256691177", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Four Stars -- More Like One Star! This is definitely NOT a four-star hotel. The location was inconvenient to the French Quarter and the trolly ran every 40 minutes (NOT every 15) from down there, if you could get on. The bathroom was dim, dirty and worn out and housekeeping NEVER replaced any toiletries. This hotel was mediocre at best with no amenities, but on the positive side, it was quiet.", "Date": "Mar 24, 2004", "ReviewID": "UR788732986", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Jan. 16-19, just fine.... This was my first visit to New Orleans with my friends. We stayed at the Hyatt for three nights. The hotel was fine for the $69 rate we were able to obtain. I would not pay much more for a night. The room was fine-pillows were very soft and we weren't sure if the room had air conditioning or not. The bathroom toliet was quite filthy and looked like the toliet bowl had not been cleaned for some time. Also our room was very dusty-desk, tv etc. The housekeepings staff did a lousy job in making beds each day-we would have been better off making our own. The most annoying thing was our first night there we returned to the room around 12:30PM and we had a message light-I called to the desk and she told me that I had a message at the desk that I needed to come and pick up. I get all the way downstairs and it was a promo letter for the hotel- how annoying this was as it was vey inconveient for me to have to go all the way back downstairs (26 floor) at 12:30 at night and to find out it was a junk promo piece from the hotel. Why couldn't they just have put it under my room door? I thought it was quite unprofessional of them....We also thought the sports bar could use a paint job- it is painted black and it made it look very cheap.....As for the good things- the staff at the desk were kind and friendly as well as the helpful bellmen and women. We loved the free shuttle and found it was very timely! I have to agree that Dennis the shuttle driver had a good sense of humor and we found him to be the life of the party. Even though it was too cold to use the pool- the pool looked very nice and big. Overall I would stay again in this hotel....it beats staying in the French Quarter with all the noise etc. But I would make sure to only pay $69 or less....", "Date": "Jan 21, 2004", "ReviewID": "UR680108611", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "stillwigirl"}, {"Content": "The Good, the Bad, and the Ugly about the Hyatt! Stayed at the Hyatt in early September to attend a college football game. I picked the Hyatt solely because it was next door to the Superdome. My experience ran the gamet from the Good, to the Bad, and the Ugly.....THE GOOD: The location was great, right next door to the Superdome and not that far away from the French Quarter. The vintage shuttle trolley they have (that I didn't know they had until I got there) is great! The large mall attached to the hotel was also a welcome surprise, although I wonder how many novelty/T-shirt stores selling the same New Orleans/French Quarter trinkets do you need in one mall...man! Also, the price was right at $69 a night.THE BAD: The rooms themselves were OK but I agree with those that criticised the bathrooms. And the place was like a ghost town with very few guests coming and going, which only added to the perception I had of a dying strip mall. Also, the parking situation is sub-optimal shall we say. When I got there, I found out the only two parking options were to use the Valet Parking service (at what seemed like a million dollars an hour) or park in the attached Parking garage (for only a half a million a day). The saving grace for me was discovering that the ticket booth where you pay your fee as you exit the parking garage is not manned on Sundays. When I was leaving, the little gate arm was raised up and the booth was locked and empty....so I just drove right on out! Additionally, the single restaurant there in the hotel wasn't very good. The breakfast buffet was overpriced and the food cold and the lunch and dinner menus had a limited number of items that I liked so I wound up eating a couple of meals in the food court in the mall!THE UGLY: When I got there, I figured out why the rooms were discounted so much. The whole place appeared to be getting a little long in the tooth and had seen betters days. Definitely time for a make-over.Overall, if your looking for an affordable (other than parking) and convenient place to sleep while you take in the sites and sounds of Nawlins', you might consider the Hyatt Regency....as long as you eat your meals outside the hotel...and leave Sunday afternoon!", "Date": "Jan 16, 2004", "ReviewID": "UR504425518", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hyatt New Orleans We booked through expedia, and I was happy to choose Hyatt, even if outside the French Quarter. I expected the worst, however, after I came to this site to read the reviews. The problem is you never know what certain people's tastes are so you can't tell if their claims are exaggerated or just completely specific to their individual experience. Some of the reviews here made it seem like a horrible hotel. It wasn't. Our stay was fine. We stayed from Dec. 30-Jan. 3. The Pros: I found the bell staff and concierge very friendly and outgoing. Registration and restaurant staff were a tad slow, but also very friendly. I was also glad to be staying outside of the French Quarter. This was my first time in NOLA, and I can't imagine being able to sleep at night in the FQ. Also, our experience with the shuttle was great. We never waited more than 10-15 mins. And if we hadn't quite made it back to the designated stop, we just waved the shuttle driver down and he or she always stopped for us. Dennis, one of the drivers, is one of the most hilarious people I have ever met in my life. He always had an entertaining story to tell on the way down. You'll love his voice too:-) We also took cabs because on the first few nights the shuttle stopped at 1045, which was a bummer. The cabs were usually $4-5.In addition, the location next to arena and the mall was cool too. The hotel itself was well appointed and clean. I don't know what happened to others, but the elevators were nearly supersonic for us. Very fast. Rarely a wait. The room. Excluding the bathroom, the room was great. Nice and spacious and comfortable and clean. Our room was cleaned promptly. I never heard the AC. After spending the day out, especially in the FQ, you come back so tired, you'll knock out very easily. My husband did not like the pillows on our bed. I don't care about pillows much. The bed wasn't as comfortable as I expected, but that was me comparing it to other places we've stayed fairly recently (Sandals, Vegas, eg). Again, it wasn't horrible; it was fine. Now the bathroom is where I have to agree with other comments. First off, I was very tired when I got there, because we missed our flight and had to fly standby and make a transfer. I really wanted to lie down in a tub, but our tub was a touch dingy. It was probably a long time since a major overhaul. We also did not get our shampoo and soap replaced. There was also no shower cap or a few other amenities that should have been standard. (Okay, I admit, I collect hotel soap, shampoo, conditioner, mouthwash, etc. But never a towel, I swear). The water pressure in the shower and the sink was excellent, but toilet flushing was a bit more of a challenge. That was pretty annoying. We were on the 15th floor. I think we were on the 20-something floor in Vegas the last time, and we never had such a problem.We also took a dip in the pool and the hot tub. The pool was heated and so comfortable, I could have stayed there all night. It was never crowded, so it was nice to have our own corner. Overall, I would the hotel a B. My only major complaint was the bathroom being in need of a little renovation.", "Date": "Jan 14, 2004", "ReviewID": "UR809543744", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Falls short of expectations   showReview(1527341, 'full');", "Date": "Dec 23, 2003", "ReviewID": "UR467759590", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Best deal in town   showReview(1495825, 'full');", "Date": "Nov 21, 2003", "ReviewID": "UR729542065", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "arstrobelt"}, {"Content": "Stay in the Hyatt   showReview(1386085, 'full');", "Date": "Oct 13, 2003", "ReviewID": "UR159239426", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not worth it!   showReview(1354510, 'full');", "Date": "Sep 23, 2003", "ReviewID": "UR732462271", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "I was NOT impressed...at all   showReview(1342598, 'full');", "Date": "Sep 16, 2003", "ReviewID": "UR707949896", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice hotel, not great service   showReview(1231071, 'full');", "Date": "Aug 18, 2003", "ReviewID": "UR983496898", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good value for the price - for business, that is. . .   showReview(1109602, 'full');", "Date": "Jun 26, 2003", "ReviewID": "UR404797469", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kalexia123"}, {"Content": "Definitly, a bad experience!   showReview(1029152, 'full');", "Date": "May 26, 2003", "ReviewID": "UR963570263", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not worth the cost   showReview(985953, 'full');", "Date": "Apr 30, 2003", "ReviewID": "UR921173212", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Getting old   showReview(861478, 'full');", "Date": "Feb 26, 2003", "ReviewID": "UR959999547", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "銇°倗銇ｃ仺瀵傘倢銇︺亜銇俱仚...   showReview(21747294, 'full');", "Date": "Jun 13, 2003", "ReviewID": "UR101881948", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60864-d89079-r19384511-Hyatt_Regency_New_Orleans-New_Orleans_Louisiana.html", "HotelID": "89079", "Price": "$214"}}