{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bromont, Canada", "Title": "“It is a no go”", "Author": "B265", "ReviewID": "UR127815662", "Content": "this hotel was part of a group trip to washington; terrible-terrible; outdated furniture- some broken; carper has seen better days; blanket had holes; I cant comment on employees as reservation was handle by our guide but I can say that the manager wear tongs and was improperly dressed up for an hotel; moreover the breakfast room was in an other building- so we had to go outside for our meal (imagine during cold weather); the room was awfully small and could not contain us all- had to wait in line outside; this hotel in a no-no. thats all.", "Date": "April 13, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Leesburg, Virginia", "Title": "“Bed Bugs!!!!!”", "Author": "L K", "ReviewID": "UR125027561", "Content": "Arrived late, room smelled terrible, furniture and rug was filthy. My son layed on the bed and was bitten by something in the bed. The bites were consistent with a bed bug bite. We left and found another hotel.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Good stay”", "Author": "B S", "ReviewID": "UR123819035", "Content": "I have stay there a number of times. It's been clean, the staff friendly, the price good, the ;location is right off I-695 north of I-70, and good places to eat with a short distance.., .", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“stayed many times for business in the area, clean rooms, good staff, good rates”", "Author": "Jason G", "ReviewID": "UR121536336", "Content": "I have stayed at this location many times for business and only had one bad experience which was due to the behavior of other guests being too loud and the motel being full and them having no place to move me to. Other then that, my experiences at this location have been mostly positive. The remodeled rooms are nice, it's always clean, and with the exception if one time out of about 20 nights I spent there I had no trouble sleeping. The front desk staff has always been helpful and accommodating and the breakfast is nice as well. If you need a cheep place to craswh for an evening or stay near Baltimore and don;t want to pay Inner harbor prices, then this is the place. Also, avoid the other two hotels in the vicinity, the Motel 6 and Leisure Inn (I think it used to be a Clarion or Comfort inn) like the plague, they are havens for prostitutes, drug dealers/users and other unsavory characters. That being said, the Days Inn itself doesn't attract that element. Also if you are looking or a bite to eat, there's a lot in the area, they have and Indian place which is attached to the hotel which is really good, also Wendys and Dunkin Doughnuts just down the driveway, across the street there's Citiview (get the crab cakes!), and in the shopping center behind the BP station there's a Subway and another great local eatery, The Salsa Grill. The nearby Security Square mall also has a great selection of eateries as well,.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "salem,va", "Title": "“will stay again”", "Author": "offunspirit", "ReviewID": "UR120799143", "Content": "Rooms are clean with comfortable bedding and the heat is temperature controlled. The gentleman at the front desk was pleasant and helpful. The heater was blowing cold air instead of warm and within 15 minutes I was switched to another room. I didn't notice road traffic noise. The sleep timer was not working on the remote and there was not a menu button on the tv to set it manually. A good place to stay as an alternative to the higher priced hotels downtown and the drive to Johns Hopkins was no more than 15 or 20 minutes longer than staying downtown and I left the hotel at 8 am on a weekday. For the price, this is a good value and we will stay there again.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Southern NJ", "Title": "“Maybe in a pinch”", "Author": "Stooge01", "ReviewID": "UR120704930", "Content": "The front desk people were friendly when I checked in and when I checked out. The hotel itself needs remodeling/updating badly. My room faced the highway (should have changed but was too tired). If the temperature controls could have set so that the fan was running all the itme it might have drowned out the road noise. The TV reception was not the greatest (could have been from the rain), paint was hanging down from the ceiling from an old water leak from the second floor, and the choices on the continental breakfast could have been better. I had no trouble connecting to WIFI and the heater worked well. There's a Wendy's down the hill which was convenient for dinner. The on-site restaurant served Indian style food, which I am not a fan of.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Milton, Kentucky", "Title": "“Outstanding”", "Author": "RSV5100", "ReviewID": "UR120557428", "Content": "Our second stay while on tour in Baltimore. Very clean rooms with all the conveniences of home. Front desk clerks are extremely nice and helpful. Housekeeping does exceptional job. Will be on our list of stops for all visits to Baltimore.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "phila PA", "Title": "“Surprisingly polite people, clean rooms”", "Author": "katrina_traveller", "ReviewID": "UR119724139", "Content": "I read some reviews and didn't book this hotel first, but ended up in the middle of the night with a few places to go so called in and got the room. It was clean, had a fridge, microwave and a tv. The bathroom was clean, the beds were clean. I didn't expect anything else. And every single person working there was polite and nice. I agree that breakfast could have more choices (or may be we came too late). But it still was enough to eat. Heating is controlled by a thermostat on the wall, not the unit itself. So don't complain it's not working until you try the right way. Baltimore is a 20 minutes mostly highway drive away. With a AAA rate we got a very good value for the money. Thanks, Days Inn!", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Owings Mills, Maryland", "Title": "“Peaceful and relaxing, I had a very nice time.”", "Author": "jtjr638944", "ReviewID": "UR119227621", "Content": "Days Inn located at Baltimore West, Security Blvd. is clean, quiet, comfortable, conveniently located, has free parking and offers a complimentary continental breakfast, has an easy check-in and out process; there are shopping amenities and eateries (i.e., a mall and food outlets) nearby. The employees I encountered were curteous and very customer friendly. It also has an exercise room (which I did not use) and an outdoor pool which was closed for the season. Being from the Baltimore/Metropolitan area, I'd never experienced the comfort of Days Inn...but felt I had struck gold when I visited them for two days to relax and obtain some peace and quiet from the hustle and bustle. The outward appearance is unassuming, but the accomodations for the value were divinely affordable and inviting. I recommend it highly.....and will be back!", "Date": "October 12, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Putnam Valley, NY", "Title": "“Just one night”", "Author": "shilo2", "ReviewID": "UR118214065", "Content": "The staff is friendly and helpful. The hotel is \"vintage\" but clean with doors that open directly to the parking lot.. We had a king size non-smoking room with a large screen TV. Be aware that for the convenience of being near the beltway, you can hear the cars all night from the beltway. Fortunately, I am a heavy sleeper. If you aren't, bring your white noise machine. The free wi-fi was great and the free breakfast was adequate with toast, bagels, cereal and danish, and of course coffee or tea. It is a low cost hotel so it is well worth the money for a short stay.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "west warwick ri", "Title": "“VERY CLEAN AND VERY NICE”", "Author": "bigdaddycool0807", "ReviewID": "UR115755430", "Content": "this was very nice 4 the money.managment was very nice and let me in our room 3 hours early to catch some sleep..we arrived 11am and check in is at 2 so that was very nice of them..last year did same thing with days in near washington/balt and owner made me wait in lobby 4 four hours, this man got me the 1st room that was cleaned and let us in..rooms were very nice,clean.pool was clear and nice and being taken care of daily by someone at poolside daily.every store posdsible you would need is close by.15 min from camden yards.breakfast was real good and they also have room with workout machinery there..4 the price this was very good and i will be back there next year no doubt about it..very happy with my stay", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Good value compared to other Baltimore hotels”", "Author": "chilltown76", "ReviewID": "UR114921892", "Content": "I have stayed at this hotel a few times this year. It's much more affordable than anything near downtown, but it is only a 10-minute drive from the Harbor if you don't hit much traffic. There is also a bus stop right by the hotel with an express bus that can you get downtown in 20 minutes. Even though I've had a car on my trips here, I've used the bus a couple times just because it's so convenient and parking near the Harbor can be expensive. The rooms I've stayed in have been clean and the staff has always been friendly and helpful. You can't beat the price here, so I plan on staying there again on future Baltimore visits.", "Date": "July 1, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Syracuse, New York", "Title": "“Very nice hotel for the price”", "Author": "cjwill2424", "ReviewID": "UR114905259", "Content": "My family just returned from staying at this Days Inn. The service staff was very friendly and the room was very big for the price we paid. It was also very clean. My only complaint would be that the pool, which was very clean and refreshing, was not open long enough. The pool hours was from 12 - 7 and I was hoping that it would be open from 10 -8 or 9 since most people are not at the hotel in the middle of the day. Othe than that, I would recommend this hotel if you are looking for a basic, clean hotel for a good price.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Chenango Forks, NY", "Title": "“Never going there again!”", "Author": "jddavis008", "ReviewID": "UR111680405", "Content": "My friend and I got into the room and were unable to turn the lights on because they had all been unplugged and it was quite dark so luckily neither of us were injured. Then we discovered that the bedding was not clean. There were stains on both comforters and the blanket under the comforter on my friends bed had multiple stains. There was also an area on that blanket which appeared to have dried semen on it. The bedding did not seem to have been cleaned at all! needless to say neither of us will ever stay at this hotel again!", "Date": "June 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eastern Shore, VA", "Title": "“Exceptional value for the price!”", "Author": "AngieEasternShore_VA", "ReviewID": "UR97832106", "Content": "Well appointed room with unexpected amenities like a refrigerator, microwave, desk, iron and ironing board, hairdryer, and coffeemaker. Comfortable king bed and large, clean bathroom. Basic, but good continental breakfast included. All employees were pleasant and accommodating. Only complaint was traffic noise and noisy heat/AC. Overall, a terrific value!", "Date": "February 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Quiet, clean and friendly”", "Author": "GreeceWithTim", "ReviewID": "UR87097156", "Content": "I had a multi-day stay and the staff was flexible and helpful. Low foot traffic and easy access to gas and groceries made my stay during treatment at Johns Hopkins restful and quiet. I definitely recommend this hotel for anyone visiting Baltimore who wants easy access to City Center and Inner Harbor without having to sleep downtown.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“BED BUGS!!! This hotel was below my lowest expectations”", "Author": "Morgankleckner", "ReviewID": "UR83862558", "Content": "My boyfriend and I were recent guests at the Days Inn at 1660 Whitehead Court in Baltimore, Maryland. Frankly, our stay was not enjoyable or even at the lowest of our expectations. I contracted a rash after my first night in my hotel room. I went to the walk in clinic and they confirmed that they were bed bug or mite bites. There simply was not any other reason for this rash that appeared on my body. It had only got worse throughout my stay. We had taken a nap and after I had woken up I noticed that the rash had gotten worse. I went down and told the evening desk attendant who wasn’t wearing a name tag about my concerns. Not once did he apologize. Rather, he insinuated that I had gotten a rash from going out during the day into the city. Even though I was permitted to spend two days here by the staff knowing that I am under 21 (because I have a credit card to guarentee the charges,) the attendant simply said that there will be no compensation because I am under 21 and that I should have come down when I first woke up instead of waiting until later in the afternoon. I told him that I wasn’t sure where this rash had come from but when I woke up from my nap it had gotten considerably worse. I asked for housekeeping to change the sheets or to inspect the bed and he told me that there is no housekeeping on the premises and he “wasn’t going to call someone to come in just to change the sheets.” He changed our room and said nothing else. There were people with carts outside the room at 8 in the morning and you can hear the highway from your room. Whenever I had called to speak to the manager he was never there and the same front desk attentant continually hung up on me. I wouldn't let my worst enemy stay in this hotel. Our stay was not enjoyable or even at the lowest of our expectations", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“AWESOME”", "Author": "tonyjonesmusik", "ReviewID": "UR83014644", "Content": "I must say this is one of the first times that I have stayed at a hotel that every person on the staff that I came in contact with was simple PHENOMINAL. One of the friendliest staff i've ever seen in my life. The room was extremely clean and very nice and up to date. I will be sure to tell my family and friends to stay at this hotel whenever in Baltimore because I was very suprised and impressed with the level of service my assistant and I received.", "Date": "October 11, 2010"}], "HotelInfo": {"Name": "Days Inn Baltimore West, Security Blvd", "HotelURL": "/ShowUserReviews-g60811-d89325-Reviews-Days_Inn_Baltimore_West_Security_Blvd-Baltimore_Maryland.html", "Price": "$63 - $90*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1660 Whitehead Court</span>, <span class=\"locality\"><span property=\"v:locality\">Baltimore</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21207</span></span> </span></span></address>", "HotelID": "89325", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fa/af/faaf1919c4ff9c6ed0eb68c1abe037da7large.jpg"}}