{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Not great, not bad”", "Author": "Christa B", "ReviewID": "UR128183233", "Content": "There was hair in the bathroom sink and sugar all over the table with the coffee maker on it. Other than that the room was nice enough for the price. The location is not ideal if you want to do inner harbor touristy stuff but its not a bad cab ride (or walk weather permitting). There weren't many options for dinning the immediate area but again options were a short cab ride away.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Highland Lakes, New Jersey", "Title": "“Nice old downtown hotel”", "Author": "NJTracyJean", "ReviewID": "UR127726227", "Content": "Stayed here with my husband just one night (3/29/12) for a wedding and was quite satisfied. The hotel is one of those older (historic?) hotels that has been well maintained. Not elaborate but very nice. I was immediately impressed by service of the valet team who could not have been nicer. Same for front desk staff. Our room was very nicely appointed and also very clean. Not huge but comfortable for two people. Nice view of the city. Comfy beds. Really quite nice and reasonably priced. We had breakfast in the hotel restaurant with all the wedding people (group of about 15-20) without prior arrangements and I can't say enough about the patience of our server. Believe me I don't think I could have been as kind! Only two complaints: never could get wifi although for the short stay I didn't follow up with front desk so... My second complaint is that the bar stops serving around 11 which is quite early. Not realizing, we ordered shortly before that and before even finishing 1 glass of wine were told we needed to leave and would have to bring our drinks down to the lobby or to a small table in the hallway to finish?!? Don't know if that is somehow related to their liquor license but it was annoying. Aside from that though a very nice stay.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“This hotel was amazing!”", "Author": "Katmlee", "ReviewID": "UR127703689", "Content": "I picked this hotel originally based on value, but they met and exceeded our expectations. From the car service they recommended from BWI to the friendly hotel staff we were not disappointed. From the moment we walked through the door to the time we left we were met with first class service along the way. We were traveling with young Kids and the staff was great to them. Although this hotel is a short distance from the harbor, it was nice not having to deal with the chaos of the harbor. It was just a short ride away on the free circulator from the harbor and short light rail ride to Camden yards. I would highly recommend this hotel and as a person who works in the service industry I have high expectations.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“The Good, The Bad, & The Ugly”", "Author": "gratzt", "ReviewID": "UR127665161", "Content": "We stayed at the Wyndham 4/7-4/10/12 The Good: Staff- Very friendly and eager to be helpful Price- We paid 84 per night The Bad: Hotel décor- very old and dated (carpets were worn/torn and dirty, unfinished painting in stairwells) Very small elevators- a family of 4 with luggage cannot ride the elevator at the same time Hot soda in vending machines The Ugly: There was a mouse in our room! We had to pack all of our things at 3am and move to another room. The hotel gave us free breakfast for one day as compensation- Big Deal!!! We should have gotten a free night. We will not return to this hotel.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Westchester, New York", "Title": "“Very nice but could be even better”", "Author": "WestchesterMomof2", "ReviewID": "UR127551479", "Content": "This hotel is in an older building and the rooms are tastefully appointed and well kept. I booked two rooms and while one had a nice street view form two window, the other one was completely devoid of any natural light since it faced an adjoining building. Check in was pretty painless - I was able to get into one room early and the front desk called me when the other was ready. I was also given a list of local restaurants. The location is pretty good - it is right around the corner from the Walters Museum, which is free and a lot of fun for the kids. The waterfront/pier area is about a $10 taxi ride each way but is also accessible by public transport. We had our car with us (valet parking at the hote is $29/day) but did not want to deal with finding parking. Bathrooms are clean and spacious with a nice selection of Bath and Body Works toiletries, hair dryer and towel warmer. Bed were a little too soft and pillows were too clumpy for my taste. Wi-fi was horribly slow, even by typical hotel standards. Printer in the business center needed new toner. The room service is reasonably priced and only adds a 20% gratuity (no delivery charge) There is no mini bar or microwave, but there is complimentary bottled water and coffee/tea. HOWEVER, the room service cards were never picked up from our doors. The next morning I ordered over the phone and the food came rather quickly but it was cold! At least the food was pretty good! Overall this is a charming, clean hotel with some service hiccups that I hope the management can improve upon. Everyone we encountered was gracious and helpful - this place can be even better than it is!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“Mixed bag”", "Author": "vacationer71", "ReviewID": "UR127488933", "Content": "This property is a distinctly mixed bag. The good: Rooms and hallways are recently renovated and comfortable, clean and ordelry too. Valet parking and front desk service were efficient (valet is not cheap though, and there are cheaper secure parking alternatives very near by). The location is nice for downtown, albeit a $10/10 minute cab ride away from the Inner Harbor or Fells Point. The entry is not glamorous but is efficient. Requiring key cards for elevator operation at all times and all floors is probably a good idea. The televisions were new 40\" LCDs with a decent HD channel selection, properly configured, although cheaping out and having Showtime and not HBO is an odd move. The room service, at least for breakfast, had the lowest prices I have seen in a hotel in twenty years -- a full American breakfast for well under $10, and no delivery charge (20% mandatory gratuity added). A value in itself, and interesting as a business strategy. We stopped by the bar for a late night drink and dessert and were similarly impressed by low prices. (Room rate was good as well, a pricing trifecta). The bad: uneven service on several dimensions. That room service, even with its attractive pricing, was very poorly executed. The delivery time we'd specified on the door hanging card came and went the next morning, and a check outside the room revealed why: no one had picked it up, even though we'd left it there before 8 p.m. We called and placed the order, and when it arrived it was delivered with no water and (bizarrely) one paper packet of salt (for an order for four people including eggs and potatos) and no pepper. (The food was satisfactory, though.) The Wi-Fi service was terrible even by the standards of hotel WiFi. Went in and out constantly, regularly requiring you to log back on, and had sub-3G bandwidth when it was on. We eventually gave up and used 3G on our devices. The business center printer was too low on toner to print out acceptable bar-code documents for scanning (tickets, etc.) Did not use the gym, eat in the restaurant at meal times, etc.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Hotel needs to be maintained properly”", "Author": "IsadoreG", "ReviewID": "UR127094732", "Content": "This is my first review of a poor for a hotel. I had called the hotel before I booked because I was traveling with children. They advised the double bed suite because it was roomier with a kitchenette with microwave and fridge. I paid 30% more and we took that room. When we arrived at about 9pm, the room was nice enough, but NO microwave and a mini-fridge sitting on the counter. I went to the front desk. The fellow said he was alone !? but would try to get one. I explained that we were a family with kids and a baby and would not be able to eat without the microwave and suggested he simply transfer one from an empty room. The microwave never arrived. The kids and us ate cold TV dinners. A little before 11pm my wife put the kids in the bath. Problem - NO hot water. They suggested we let the water run. That did not work. In the meantime the desk persons shift was over and a new fellow came and gave us keys to other rooms to try to find hot water. The rooms for several floors above us were empty and we found one which did have hot water but no water coming out of the kitchenette sink! Now we had a microwave too in this one, so we figured we can manage here and took the room, transferring the kids and our luggage at about midnight. The next day we had no room service don't know why and Saturday evening ONLY boiling hot water came out of the faucets, nothing else. I almost burned myself. When I asked the front desk how they could rent such rooms he just shrugged and said \"to tell you the truth I don't know\". If not for the guys honesty and friendliness I would have raised a greater ruckus. The staff told me there was this ongoing problem with the number X09 and X10 room lines going all the way up. A friend of ours on the twelfth floor in one of the cheaper single bedded rooms told us he had a great stay without problems, so PLEASE check your room before you unpack. The bedding was ok, unremarkable, though the covers were lumpy. The hotel was clean in all its areas. Our coffee was never replaced during the stay. Toiletries were replaced. The location though not that close to the inner harbor has a charm of its own. As for parking we found over night street parking and parked near the harbor during the day as the hotels rates came to near $35 a day for parking. This hotel really has alot of potential, but they have to invest in maintenance and consistency.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Wonderful, reliable hotel with a fantastic location in Mt Vernon”", "Author": "Philologue", "ReviewID": "UR127084375", "Content": "This is the second time we've used the hotel for out of town guests for a wedding, and both times we were very pleased with the service, rooms, and staff. The hotel is located in Mt. Vernon, one block away from the Walters art museum and easy walking distance from several good restaurants. The harbor is only a 15 minute walk away. Rooms are clean and comfortable, and feel like an authentic city hotel, not a generic, plastic chain. The restaurant and bar, George's, is a great local spot for happy hour and brunch. Many a wedding guest has ended a night propping up its old wooden bar! Our waitress a few days ago, K., was particularly fantastic for the brunch after the wedding and was very accommodating for our large wedding party. Front desk staff and management were equally helpful in planning and organizing both parties' stays. A great hotel for anyone for a city weekend trip or for out of town guests for something like a wedding. It is also very close to the meyerhoff and the lyric opera house. Charming!", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Windsor", "Title": "“Nice place - great if you can fine on-street parking”", "Author": "Clayton H Posted by an Easytobook.com traveler", "ReviewID": "UR126847072", "Content": "The older hotel was nicely furnished. Our room was nice and had a great jacuzzi tub. My only complaint was that it was pretty easy to hear other guests, perhaps a function of the building's age. We were able to find on-street parking (much easier during the weekend) and avoided the $29 valet parking. With on-street parking, the hotel is an excellent value ($84 before taxes). If you have to use the valet parking, the value isn't as good as you can get closer to the inner harbor if you want for about the same amount of money.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Pleasantly Surprised”", "Author": "Elizabeth G", "ReviewID": "UR126333614", "Content": "Some friends and I needed a room in Baltimore for one night this weekend, and I booked through a discount travel site that doesn't give the name or location of the hotel until after payment is made. What a pleasant surprise! The Wyndham Peabody Court was much more lavish than I had expected and the room was extremely comfortable. The valet greeted us, the desk staff was friendly and the jacuzzi tub sealed the deal! My ONLY concern was our experience in the restaurant. There was ONE server, and a bartender, trying to manage 10+ tables and a full bar. Our server was initially extremely rude (and later apologized, explaining that they didn't expect it to be so busy), and our dinner took close to two hours. Having read a few other reviews, it seems that they have had this problem before, and I would recommend that they look into hiring an additional server for the weekends. Overall, a great hotel, great stay, would highly recommend.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Great stay near Peabody”", "Author": "thedreamweavers", "ReviewID": "UR126304543", "Content": "For our purposes on this trip to Baltimore, this was a perfect set up. We were there for performances at Peabody and not familiar with the Mount Vernon area of Baltimore. We flew in, took the Light Rail from the BWI airport and walked only a few short blocks to hotel. They were able to hold our luggage and called when room ready (we got in early). It was awesome. No need for car. Restaurant at hotel good - only had breakfast here, plenty of restaurants close by and free bus system to get down to Inner Harbor. Room was very spacious and comfortable. Slept great, upper floor was very quiet. We had plenty of hot water although tub did not drain well. Loved the towel warmer in our bathroom! We found the staff friendly and helpful, especially Paula and Kirsten. We plan to return and stay for upcoming wedding in the area.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Phoenixville, PA", "Title": "“No Hot water and $35.00 parking. Fading Glory”", "Author": "Jshoen", "ReviewID": "UR126084967", "Content": "We booked this hotel after ours became overbooked. We were expecting a great hotel at a \"deal\" price\". I called ahead before booking and was told that it was walking distance to the inner harbor, where we had reservations and plans throughout the weekend. It is a 1.5 mile walk (I don't call that walking distance for my wife in heels) I feel that $35.00 is overpriced for parking, especially in this neighborhood.The hotel did not have hot water for showers either day for my wife or me. 1/2 the staff were nice, and the other half were extremely rude. The hotel is a faded glory, and in the 70's or 80's it was probably really nice, but it's seen better days.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Very Satisfying Stay”", "Author": "CS D", "ReviewID": "UR125575419", "Content": "Called and made a spur of the moment reservation for me and my toddler. The staff was fantastic! They were able to fit us in and have a room ready early. Everyone was friendly, helpful, and fun to talk to. The valet service was excellent and the rooms were beautiful and spacious. We had a double bed room with a jacuzzi tub and felt pampered and special during our stay. If we had stay in Baltimore again we definitely would book at this hotel.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“First time”", "Author": "Tu S", "ReviewID": "UR125354832", "Content": "This was my first time staying at a Wyndham hotel. It was great. Good enough in fact for me to check for a Wyndham on my next trip. Very nice experience", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barre, VT", "Title": "“Accommodations Great...Staff...the Greatest!”", "Author": "Neegi", "ReviewID": "UR125130484", "Content": "This hotel has personality and charm, but the wonderful staff made our three night adventure one to remember. Everyone...Everyone was helpful, friendly, and seemed genuinely interested in making our stay comfortable and easy. The room was large, quiet, and clean. Great linens. The beds were soft...but not overly so. The bathroom had been updated and was quite nice...clean and conveniently arranged. We ate a couple meals in the dining room which we enjoyed and were once again pleased with the staff. I can't say enough good thing about our experience. This was my first time in Baltimore...I accompanied a friend who was there for a conference. I'd love to come back just for pleasure. What a wonderful city...Who knew?", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Good service. Quiet rooms.”", "Author": "houston_traveler100", "ReviewID": "UR124878081", "Content": "The hotel was actually smaller than I thought (103 rooms or so). The service was quite good. I asked for a room away from the elevators and I couldn't have gotten a room further away. The building itself was old, but the beds were comfortable. The bathrooms were upgraded, and the water pressure in the shower was excellent. The only criticism is that it's a bit isolated from the touristy part of town, and finding a CVS or grocery nearby was a bit hard. There are a couple of very nice restaurants, however. The exercise room had a bad odor and needing renovation of its ventilation system. I used it once and decided not to go there again. Overall, my experience was very positive and if you're looking for good service in the area (Peabody Court / Washington Monument), it's an excellent choice. If you're looking for more dinner/nightlife, I would consider alternative.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "southern US", "Title": "“Pretty rooms, lax housekeeping, aging infrastructure”", "Author": "Yankeeinexile", "ReviewID": "UR124630556", "Content": "Nice location within walking distance of Walters Art Museum and good restaurants. Room itself was spacious and quiet, but housekeeping was lax. Never got additional cups or tea bags despite asking for two days. Housekeeper's large full garbage bag was left open in public hall for 24 hours. Kind of gross. And plumbing was very hard to control. Water in shower and sink was scalding despite how cool we set it.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Very nice hotel”", "Author": "MarianneWC", "ReviewID": "UR124375372", "Content": "This is a very nice hotel in a historic part of Baltimore. The rooms are comfortable and the front desk staff could not be more helpful. I would definitely stay there again.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Hotel needs some updates, but location is excellent and staff very helpful.”", "Author": "LydiaClaire", "ReviewID": "UR124212222", "Content": "I spent two nights at the Wyndham Peabody while in Baltimore for a conference. The location was perfect for me as Baltimore School of Law (conference location) is a relatively short walk. I was in a \"Two Double Beds B Standard\" Room. It had a separate kitchenette (microwave, fridge and sink), a table with four chairs, couch, comfortable chair and two double beds as well as two televisions and two large closets. The rate was roughly $10 more than for a some other standard rooms and the extra space was nice. I concur with the other reviewers who note that the hotel is in need of some updates. The furniture in my room didn't match (and not in a good way). The two beds in my room were completely different (one taller and more comfortable than the other). The bath is marble, the tub has jets and there is a towel warmer. While not unclean, the bathroom in particular just looked tired and dated. Other reviewers have complained about water pressure and temperature, but I had no complaints about either. The room had an in room safe, but it operated with a key (and not an electronic lock). I could not get my key out of the lock and opted to just carry valuables with me rather than calling for assistance. Another reviewer also complained about the lack of an independent air/heater unit. While it is true that there was not an individual wall unit, I did have a thermostat in my room that worked. I do not know if this is true of all rooms (I can speak only for rooms 610). The room had free wifi. I was given a card with login information at check in. Unfortunately, the information was incorrect, but the helpdesk (contacted via an 800 number) was able to talk me through getting access. With all of this said, I would definitely stay here again. It's perfectly nice, but just not really plush. The staff was helpful. One additional item of note is that taxis are not that easy to get and we found that we needed to call about 10 minutes ahead to avoid waiting.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Melange of opposites!”", "Author": "AriaProf", "ReviewID": "UR124142488", "Content": "We always stay at the Peabody Court when we go to Baltimore, because our musical profession takes us to the Peabody Institute just around the corner. We've seen this hotel go through many changes. We stayed again in a lovely room on the 11th floor. The trouble this time was that there was no warm water. I think there's not enough pressure to get it up that high! Impossible to wash hair and shower. We loved the large room and quiet ambiance, however. The dining room is slow, and this time created a chicken dish that was overcooked and too spicy. Couldn't eat it. But the next morning I had the best egg omelet I have ever eaten in the same hotel restaurant. Just barely made the taxi, but the driver, called by the hotel, was the best driver I'd ever had to the airport.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Wanting to Come Back!!!”", "Author": "Linnie F", "ReviewID": "UR123522597", "Content": "I stayed at this hotel on business and I want to come back for fun!!!", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Readington, New Jersey, USA", "Title": "“Great food, great staff, great views and service, bed lacking”", "Author": "Andrew E", "ReviewID": "UR123264892", "Content": "Everything about this hotel is great aside from the beds. Didn't sleep well on them at all. The restaurant and bar are nice and bring in a good happy hour crowd. It's not far from anything. Lovely neighborhood. Hated to have to use valet service, but oh well...", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "upstate NY", "Title": "“Old-fashioned elegance with updates”", "Author": "TeresaupstateNY", "ReviewID": "UR122819148", "Content": "This hotel is a real museum piece, and it feels like an elegant time machine trip. The location is in the center of Baltimore, close to the Walters Gallery, Peabody Conservatory, Opera House, and a few blocks from Maryland Institute College of Art. So, it's quiet and residential at night, and sedate. The area looks like it was a high-class residential address one hundred years ago, and to some extent still is. The street it's on was closed for a construction project, and the hotel parking was valet only. Self-parking involved complicated instructions to parking lots so we opted for street parking. A friendly doorman told us that the parking police begin their day at 8 AM, and you've got until 9 AM to move your car. A great suggestion, which we tipped him for! The lobby is miniscule, and there are some stairs to navigate, but it's very pretty, with a lot of wood moldings. Staff is friendly and helpful. The room was a good size, and very cozily decorated. There was a minibar in built-in cabinetry, big closet, upholstered side-chair with hassock, desk with chair, and marble bathroom with heated towel bar. Our two windows looked out on nearby apartments, and a view of Baltimore towards the north. Everything functioned well, and our needs were comfortably met. The room and bath were clean, the bed was comfortable, wifi worked fine, and we had a quiet night. We chose to find breakfast off-site, but finding a good breakfast in that area proved to be a challenge. Perhaps we would have been wise to check out the hotel food offerings.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Md", "Title": "“Excellent Hotel & Staff!”", "Author": "Nobbska", "ReviewID": "UR122522974", "Content": "Stayed at Peabody Court over the holidays. The hotel was excellent, rooms were clean, and we had a great view of the washington monument lit at night. Can't say enough about how great the staff is at this hotel, they are first rate!", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Elegant old hotel”", "Author": "Traveling_Mama66", "ReviewID": "UR121602831", "Content": "Built in 1928, with marble floor in bathroom, well-kept original furniture. Comfortable bed, nice staff, clean. Refrigerator in room. Microwave was available if I'd asked but I didn't need it. Reasonably priced. I had a corner room that was light and airy. My bathroom faucet had been replaced with what looked like a kitchen faucet of stainless steel which didn't fit the rest of the decor. Otherwise great hotel. Close to Wyndham Peabody Library where I attended a wedding. Not that far from the harbor area.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“Nice hotel - friendly and helpful staff”", "Author": "sirijay", "ReviewID": "UR121597288", "Content": "We stayed in this hotel for two nights. The hotel is a bit dated, but is in a nice location. The staff were extremely helpful and pleasant. It is an old hotel which has gone through several different owners. I believe Wyndham took over very recently. The hotel looks a bit worn. The premises were clean but could certainly do with a refurbishing. We had problems with the hot water - not particularly hot and also somewhat unpredictable. When we reported this to the housekeeper, a service person came within 15-minutes. Unfortunately, the problem with water was sporadic. All in all, a decent place to stay.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent service”", "Author": "Kwats", "ReviewID": "UR121517453", "Content": "The staff at this hotel is excellent. They were helpful with everything that I needed (cabs, directions, etc.). This was my first trip to Baltimore and they made it much easier. Convenient to John Hopkins hospital (just a 7$ cab ride). If you are interviewing there, call ahead, they have a great deal.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great hotel and perfect for MICA visit”", "Author": "lmyq", "ReviewID": "UR121414499", "Content": "Was very impressed with this hotel. The 9th floor room we had overlooked the square which was beautifully lit for Christmas. The room was very large with two comfortable double beds. Furnishings were very nice and tasteful - beautiful wood headboards, an antique nightstand, armoire for the TV and a desk. Did not feel like a hotel room - more like you were a guest in very nice house. There were nice architectural features - tall baseboards, large crown mouldings and very deep window sills. Beautiful bathroom with marble tiles on floor and full walls, heated towel rack, wall-mounted extension mirror, and jetted tub. The \"dresser\" consisted of built-in drawers behind closet doors with a very large mirror and light above - very nice. Another \"closet\" had a mini-fridge, etc. And a third \"closet\" was an actual closet. A very pleasant room. If I were to be picky, I would say housekeeping was not meticulous. While the bathroom was very, very clean and the main surfaces in the room were clean, the tops of the headboards and baseboards could have used a dusting, and the vacuuming of the carpet missed the edges near the baseboards. But this certainly wasn't an issue for our one night stay. Also, parking could be difficult. There is very limited space to pull up and use their valet service - just an area where the sidewalk cuts in that can maybe hold 2 cars. When we arrived after 11pm on a Saturday night, that space was full and more cars were parked next to them in the street. We were able to park in the Walters Art Museum lot just a few buildings away since the museum was closed and we left early the next morning before it opened. So it turned out to be a lucky break that we couldn't get to use the (expensive) valet parking service. The restaurant was beautiful and the waitress very pleasant. Not impressed with the breakfast food. Location is great for a visit to MICA and the hotel has special rates for MICA visitors.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Nice Basic Old Hotel in Beautiful Historic Neighborhood”", "Author": "tonydowntownnyc", "ReviewID": "UR120341140", "Content": "Hotel is located in the beautiful & historic residential neighborhood of Mount Vernon - within a 5-10 minute walk to the shops, cafes and restaurants of N. Charles St. *Note there is no Concierge service offered here - so you will have to arrange tour bookings, etc. prior or on your own. -- Asked about catching a tour and was told by front desk that they had no knowledge of tours. That being said, service was polite and friendly - the front door men went out of their way to get cabs, even going across the square to hail them down at night. This is an old hotel so the rooms are on the small side, but clean and comfortable in traditional American style. Appears to be freshly painted. Marble bathrooms. Flat Screen TV. - No desk or fridge.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern New Jersey", "Title": "“Wonderful Wedding Weekend”", "Author": "Niamb", "ReviewID": "UR119863568", "Content": "We used the Wyndham Peabody Court as the recommended hotel for the guests to my son's wedding. The staff at the Peabody Court made it a wonderful weekend for our guests. The staff is extremely gracious, going out of their way to help in every way. We arrived with gift bags for out-of-town guests and the valet whisked them to the back where the staff placed them in all the rooms of guests registered through the wedding. The staff seemed to anticipate every detail and work to make the weekend a seamless affair. The staff at George's (the restaurant attached to the hotel) were also gracious and accommodating. I had breakfast and lunch there and all my meals were well prepared. When our crowd of relatives lingered to chat after our meals were eaten, they invited us to sit over in the lounge area of the bar so we could socialize without monopolizing their dining area, a lovely compromise. Our hotel room was large and had a bar sink area, a small refrigerator and a good full length mirror. As this is a refitted, older hotel room size and configuration varied a great deal. My father was delighted with his walk in shower, which we had requested, but it was a tight fit in the room for him, his walker and the wheelchair we had rented for his use. Still, it worked and he commented how very helpful the staff had been in getting him checked in and situated in his room when he arrived. Internet is free, but required a provided password which had to be re-entered periodically, a small annoyance. The public rooms were very elegant and well maintained. The business center would be fine for printing out boarding passes, but the office suite and Internet browser it used were odd. It would not allow me to cut and paste from the internet into a document....very odd. I had to print out and retype the poem I wanted in a larger font to read at the ceremony. We had the rehearsal dinner upstairs in a beautiful room with panoramic views of the city. It was lovely that night to look out over the lights of Baltimore with a gigantic harvest moon shining down. Here however is my only complaint of the stay. The service getting dinner out to our guests was slow. The crab cakes were overcooked and dry plus sides of plain rice with 3 (THREE) small asparagus spears was disappointing to say the least. Still the convenience of being able to have my brother simply wheel our father onto the elevator to get him to the rehearsal dinner along with the gorgeous setting made it a good evening overall. The hotel is also pet friendly. There is a lovely little park right across the street and it is a nice area for walking your dog. The City of Baltimore even had little receptacles spotted about with plastic bags for doggy clean-up. Overall this was a wonderful hotel with a tremendous staff. I give this hotel my highest recommendation. As long as you are not looking for a gourmet banquet meal, you will not be disappointed.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Fabulous”", "Author": "Cindy L", "ReviewID": "UR119495272", "Content": "This hotel had so much to offer. Aside from the great rooms, to the wonderful staff, this place had it all. Will definitely return.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“A good stay”", "Author": "CTSusanna", "ReviewID": "UR118865067", "Content": "The Wyndham Peabody Court is a nicely appointed hotel and we enjoyed our four night stay. Our room was spacious with a very comfortable king size bed, good climate-control, attractive linens and wall coverings, and a decent view. I love Wyndham blowdryers! The key-card elevator IS tricky, but after 4 or 5 swipes, we always got to where we wanted to go. Having a refrigerator in the room is a plus. Internet access in the business center was functional, but slow. Paula at the desk was helpful with getting us theater information and an easy check-out. Mount Vernon is a great Baltimore neighborhood! We took the light rail three stops from Penn Station, then had an easy 2 block walk to the hotel. I love NOT being in Inner Harbor, but being able to get there easily. We walked to the Walters Art Museum, Center Stage Theater, the Basilica, the Aquarium, Camden Yards (easy light rail ride back late-night), the B+O Railroad Museum (that was a long walk). There are many great restaurants within blocks of the Wyndham, and the Charm City Circulator has stops nearby. We easily navigated the city bus to Johns Hopkins (admittedly, we had a kind of sketchy ride back). We loved George's Restaurant! All-day breakfast is available and tasty, and the one dinner we had there was excellent. They have many, many bottled beers, and the bar crowd was active and provided good people-watching without being obnoxious. Kate, John, and Melody were friendly and efficient workers. The coffee is good. There were a few glitches- the front desk was a zoo with 4 weddings on the day we checked in. Our room wasn't ready so we left our bags and were told they'd call when it was ready. The call never came, so we wasted several hours waiting when we could have had the room. Room service dishes were left in the hallway for a very long time. There was a full breakfast tray on the floor across from our room for 24 hours. Housekeeping happened very late in the day. We left at around 10:30 and returned at 5-ish each day, and each day our bed had not yet been made. Despite this, our stay was good and we would stay here again.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Stop and rethink your hotel needs beforehand...”", "Author": "R_che", "ReviewID": "UR118532529", "Content": "The extremely difficult access to the location...due to road closures is only one of the major issues with this aged hotel. The extremely difficult Mount Vernon area location...is only one of the major issues with this aged hotel…Elevators-Room Lighting-Staffing-Foodservice-Exercise Area-Functioning Room Keys....are also on list of problems with this converted apartment building site. The road closures are temporary so that will be fixed...but the rest of the facility pales when compared to normative Wyndham hotel standards almost everywhere. Personnel try at the valet...to overcome the temporary road issues and the Baltimore Book Festival across the street...but the rest of the small staff are not up to the task of serving the guests needs. Front desk is staffed by a single person at all hours...food service is very slow and under staffed...a 30 + minute wait for breakfast does not compete with the meal period needs. No coffee service outside of the rooms...puts added stress on the small food/bar operation. Do not expect a quiet sleep with this facility...just too much street side exposure...even without the jackhammers and heavy equipment from the temporary street construction. Workout room (closet sized) has broken equipment. While there are some redeeming features (Roof Top)…but just not enough to compensate for the issues.", "Date": "September 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Peachtree City, Georgia", "Title": "“NIce hotel and would stay there again”", "Author": "zzrsteve", "ReviewID": "UR117996805", "Content": "Stayed here 2 nights. Our 2 double bed room was spacious. Nice tiled bathroom. Flat screen tv with lots of channels. The hotel restaurant was good too with specials every night. The burger specials were good and the macaroni and cheese with crab was really tasty. The service was super from the valet to the bellman to the front desk folks. Was lucky enough to have an awesome view of Mount Vernon circle area (ask for that!) The only hassles I had were figuring out how to insert the key card in the elevator to get it going.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "wilmington, NC", "Title": "“Best Boutique Hotel in Baltimore”", "Author": "charlesthebarles", "ReviewID": "UR117667848", "Content": "Truly a beautiful historic hotel. Our King room was much bigger than the usual hotel bedroom and had lots of extras, including huge windows with a fantastic view of nearby Washington Monument Park. My husband and I felt very much at home. There were 3 closets for clothes, dresser/vanity, wet bar/refrigerator, all with lights and power. Our large bathroom had all marble floors and walls plus a heated towel bar. It would be easy to stay for an extended time and not feel cramped although we would have preferred a higher toilet with a comfortable seat that flushed easier (you had to hold the flush button down hard for 5-10 seconds.) Unfortunately, we expected to be able to see Baltimore Orioles baseball games on our room TV, having been assured by the desk clerk when making our reservation, but found that the hotel rooms do not subscribe to MASN, the Maryland Sports Network (which also broadcasts football and other pro games). Although there's a high quality restaurant on the 2nd floor, the menu was all American crab cakes and steaks--nothing adventurous, but fortunately there are many good places within walking distance for us to dine. The restaurant also restricted guests to expensive room service, leaving us disappointed with the inability to walk into the restaurant for coffee to go--which would have been easy to implement with the coffee bar right at its entrance. (Many people instead walked to a nearby coffee shop instead of making coffee in-room in the 1-cup appliance that had no access to real cream.) The valet car service was good, but they need to come up with some inventive seating in the small but stately lobby for infirm people waiting for their vehicles--you can only sit if you go 4-5 steps down into the library. Despite some lacks, Peabody Court was still one of the best hotels my husband and I have ever stayed in: luxury, atmosphere, and convenience with very competitive rates.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Problems occurred - and more importantly, problems were corrected !”", "Author": "triptraveller", "ReviewID": "UR117569008", "Content": "The Wyndham Peadbody is an historic building - and along with the charm and originality of architectural features, some problems may occur -- as was our experience: namely, air-conditioning did not function in the room to which we were assigned, and problems occurred with the keys (as other tripadvisors report). So problems can occur, particularly in an historic building, but more importantly, the staff found \"solutions.\" Engineer, Chris, who came up the room to investigate the problem with non-functioning air-conditioning was immensely helpful, and along Shaun at the front desk, in re-locating us in a cool *and* quiet room. The keys can be a nuisance in working the elevators - but the staff showed us the more successful techniques in getting the keys to operate. Admittedly, it takes some practice. . . Because we moved to another room, we saw furnishing and bath room facilities in two rooms -- and the both bath rooms were well-equipped. Also a nice feature is a small frig in the room for bottled water. Plus beds have high quality linens. Breakfast at George's (on-site) was good, and was fairly priced. The immediate area near Wyndham Peabody has some outstanding sites, within a block or two of the hotel: The Library of the Peadbody Institute, the Garrett-Jacobs Mansion, and Walters Miuseum. These sites are (as the saying goes) \"worth a journey,\" but they just steps away from the hotel. If you prefer sleek, modern locations, another property may be a better choice. But for an historic hotel, with many original features, a charming lobby, and interesting rooms --and a terrific location in Baltimore-- Wyndham Peabody is a worthy choice.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Brilliant hotel”", "Author": "mudloft", "ReviewID": "UR116043549", "Content": "The location of hotel was excellent, the area was really pleasant to walk around, with museums, cafes and parks. The hotel itself was lovely, the room really spacious and comfortable. Also the staff were helpful and friendly - a very good hotel.", "Date": "July 31, 2011"}, {"Ratings": {"Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Second stay even better than the first!”", "Author": "OHTrip", "ReviewID": "UR115875093", "Content": "I stayed at the Wyndham Baltimore Peabody Court with some family members for my daughter's graduation from MICA. The hotel has a lot of charm, and we all loved the neighborhood, and seeing all of the dogs in Mount Vernon square. This stay was even better than our first stay in April. The service issues were ironed out. We had top notch service from the time we arrived until our departure. Starting with the valet, he directed us to a very close parking lot where we saved a lot of money over the valet parking cost. Transportation to the Inner Harbor and even to Fell's Point was easy using the free Circulator bus, which had a stop a block or two away. The front desk staff was cordial and helpful. The housekeeping was excellent, too. We were also pleased with the service at the bar. Both rooms we reserved were beautiful, and we enjoyed the views from our rooms. For the price and convenience, this hotel was an excellent choice for us!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“Old World Charm”", "Author": "roxy925", "ReviewID": "UR115495484", "Content": "Wonderfully high ceilings, dark wood, spacious marble bathroom w/ towel-warmers. Secure - elevator access with cardkey only. I loved the European-look of the lobby, with its rich carpeting and circular stair that leads to George's Restaurant and Bar Lounge - wonderfully comfortable Club chairs! Staff were professional, courteous and friendly. This property really is all about service - front desk manned by Sean, Regina and Paula - who all went above-and-beyond to fulfill my requests. Robes and a microwave oven were delivered to the room within minutes. Now that's service! I will definitely be returning soon. Ken - a pleasure to have met you. I wonder if you had feather pillows - I should have asked, but forgot!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Morristown, NJ", "Title": "“Nice place for the price”", "Author": "jwheller", "ReviewID": "UR115489039", "Content": "We booked this hotel after finding a good weekend deal. The room was nice and very clean and the staff was very friendly and helpful. The key-card for the elevator and rooms were a major pain. I had to replace mine about 4 times over the weekend. everyone at the hotel was joking about it. The valet parking is pricy as were the movies-on-demand. There's a parking lot next door that was charging a third of the price.", "Date": "July 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful old hotel but service left a lot to be desired.”", "Author": "Toochy", "ReviewID": "UR114813648", "Content": "We stayed here because a wedding we were invited to was in the neighborhood. The staff did not go out of their way to be helpful. 2 out of the 3 nights we had really loud neighbours in the room next to us. The valet was often not out in front and we ended up waiting a long time to get our car on a couple of occasions. it is a beautiful old hotel with a lot of charm. It would be great if the service could be as charming as the building.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Berwick, Maine", "Title": "“Beautiful Hotel, wonderful staff, historic surroundings”", "Author": "40514Chris", "ReviewID": "UR114738815", "Content": "If you love antiques and history you will love this hotel. The entire staff everyone from the front desk, valet, bellmen restaurant staff go above and beyond to make you feel comfortable and welcome to the point of remembering our name. The restaurant George's is fantastic. Walking distance to the light rail for a quick ride to the Inner Harbor and Camden Yards. Rooms were clean and quiet with beautiful views of the city. The Washington Monument was right outside our window with an incredible view of the city at night. Because it is an old hotel the plumbing rattles a bit, but we felt it added to the charm. Our beds were super comfy, the bathroom was full marble with a towel warmer. We also liked the fact the the hotel was \"green\". All the basic amenities are available. Even though the hotel belongs to a chain, you never felt as though you were in a chain hotel. I hope that it stays that way and the company doesn't try to refurbish, or modernize. Parking, like all city hotels is expensive at $30 per night. We circled the block and found a come and go lot for $7 per day. We left our vehicle there and walked or took the light rail everywhere.", "Date": "June 25, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Shenandoah Caverns, Virginia", "Title": "“Beautiful, Historic, Great Customer Service and nice meeting room with a view”", "Author": "DUGANAJ", "ReviewID": "UR109099755", "Content": "They serve Starbucks coffee at the Restaurant and for room service. Great Valet - had my car out before I even asked for it. Room was comfy and loved the marble bath with wirlpool!", "Date": "May 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Convenient to MICA”", "Author": "OHTrip", "ReviewID": "UR103919133", "Content": "We enjoyed a weekend stay at the Wyndham Peabody Court while attending a couple of events at the Maryland Institute College of Art. The hotel is within easy walking distance of the campus. Many restaurants can be found along Charles Street and near the hotel. The hotel is near the Walters Art Museum and in a nice historic area. Although not fancy, the rooms are clean and comfortable. We missed housekeeping service one day because we inadvertently switched on a \"do not disturb\" light located near the door. Service was mainly friendly but a bit inconsistent. Case in point, when we missed the housekeeping service, I requested new towels. The housekeeper dropped off the towels and took off before I had a chance to hand her the used towels. Shawn at the front desk remedied the situation, and was very kind and professional. Overall, we were pleased with the stay and found the hotel to be a good value.", "Date": "April 13, 2011"}], "HotelInfo": {"Name": "Wyndham Baltimore Peabody Court", "HotelURL": "/ShowUserReviews-g60811-d89365-Reviews-Wyndham_Baltimore_Peabody_Court-Baltimore_Maryland.html", "Price": "$92 - $185*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">612 Cathedral Street</span>, <span class=\"locality\"><span property=\"v:locality\">Baltimore</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21210</span></span> (Formerly the Latham Hotel)</span></span></address>", "HotelID": "89365", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/08/e6/08e66ae787f5888ddcdfd37b203e36597large.jpg"}}