{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "NY", "Title": "“Frightening”", "Author": "ZenIng", "ReviewID": "UR122942702", "Content": "I have stayed in some seedy joints, but this place was the seediest. Alone as one grown man just looking for a rest from highway driving I am generaly not too picky, but I still would not recommend this joint. I was unfortunately traveling with my family and was not comfortable at all. The first rooms door did not close because it looked like it had been kicked in. The second rooms door closed if the secondary latch was engaged. There seemed to be hookers cruising the walkways, and Im not talking about the kind Eliot Spitzer hired ! Theres a bar next door called Loafers, and it seems like a rowdy crowd with plenty of a hootin and a hollerin all night long. One grown adult male, I would think twice before you stay here, but with your family, I would strogly suggest you avoid this place like the plague.", "Date": "January 11, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“This Hotel Is Now Motel 6”", "Author": "verypikytraveler123", "ReviewID": "UR114834624", "Content": "This Is NOW Motel 6.......................................................................................................", "Date": "June 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jonestown, Pennsylvania", "Title": "“Verry good stay but in need of updating”", "Author": "SRooney92", "ReviewID": "UR87095622", "Content": "I traveled to Baltimore to meet up with my grandfather and Uncle to see the Ravens play the Bills. Staff was verry freindly and conversational, espessially the breakfast guy. The roon was nice. The shower could have used some bleaching, but it was clean. the hotel could use some updating on maint. because the elevador was bad shape as so as the hotel room doors, the vending/ ice machine rooms needed updating. and some areas needed paint job updating. Overall the stay was nice i would stay again on a last resort option.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "auburn, New York , USA", "Title": "“Excellent”", "Author": "rward1972", "ReviewID": "UR85408358", "Content": "Customer service was quick and friendly, Room was clean and quiet even for being near a highway, well priced, the continental breakfast was good as well nice variety to choose from especially liked the waffles, would stay at again if in the area, much better than the holiday inn we got stuck with the night before. wish we could have found this place first", "Date": "October 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Should have stayed somewhere else.”", "Author": "mars2025", "ReviewID": "UR82786860", "Content": "Took 55 minutes for me to get into my room because the keys they gave me the first and second times did not work and they did not answer the phone when I called the front desk to ask them to help me with gain entrance. I have 50 lbs of luggage b/c this is a combined business and mini-vacation trip and I have been away from home for five weeks, so I did not want to drag everything to the front desk again via the slow elevator from the fourth floor at the back of the house. There is a big-rig parked outside with its loud refrigeration unit running. I asked to switch rooms to the quieter side, but they wouldn't do it--one guy said the place, with its empty parking lot, was full; another said there was a party on the other side. Hmm. I called Choice Hotels to have them call the front desk--they were a little dumb, and called it but didn't keep them on the line or explain the issue. I called the desk; the guy answered; 23 minutes later he came up and unlocked the room. I'm in the room; I just called the front desk to ask about laundry--no answer. The non-smoking room smells like it used to be a smoking room. The location is not good; three miles from bookstores, malls, Starbucks, but I did just find a Dunkin Donuts with my GPS.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Clean rooms, friendly staff and close to the attractions.”", "Author": "Niecy001", "ReviewID": "UR80849680", "Content": "The hotel is in a convenient place without being charged the over price rates if you were to stay in the downtown section. If you want to drive to the Inner Harbor it was a easy 10 minute ride. Free parking!!! Plus the front desk was able to give me directions to use public transportation to and from downtown.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“This couldnt get any worse”", "Author": "jbunns24", "ReviewID": "UR72094562", "Content": "We booked this room for the weekend of 7/23 - 7/25.We came to this hotel to attend the Fire Expo, and we knew that we booked the hotel a little late..but we also knew that we were guaranteed a room here at the Quality Inn. When we pulled up we started to think that this hotel looks nothing like the pictures on the internet, so we went to the front desk and everything went very smoothly. We were given 2 rooms, 1 room 2 beds and another with a double bed. As we went on to our own rooms I received a text about 15 minutes later from my buddy stating that there were blood stains in his bathtub, on the wall, on the sheets, and if you were to look at there door it looked as someone had shot the door twice with a gun. Every door we had after that they were pryed back as if someone were trying to break in, also the security volts in our room were broke which goes along with someone else’s opinion when they stated that there laptop was stolen. So as I was on my way over to their room I spoke with one of the room attendants and I politely asked her to get them new sheets. When I returned back to my room our A/C had been on for about 45 minutes and our room was still not cold and the A/C unit was blowing out hot air. We went down to the front desk and were given a new room right next door, so we packed up our belongings and moved for the second time and turned on that A/C unit. We decided to stock our fridge with soda to keep it cold, and there was no refrigerator. I went to use the shower before myself and friends went out to dinner and I look down and find used dirty soap that the hotel provides. So after another 45 minutes we visited the front desk for a second time. The gentlemen was very annoyed with our problems, we informed him that we would be going to the inner harbor and that we would be back in about 5 hours, and if the A/C was still not properly working that we would be back down to request a new room. After a few minutes speaking with the gentlemen he ended up giving us a new room. Room 334. With all of this said and done, we walked into our new room and the A/C worked very well and we had a fridge to keep our drinks cold. We are now finally content with where we are spending our weekend, but in my opinion I would not suggest this hotel.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Nanuet, New York", "Title": "“Unsafe!”", "Author": "IamTripping", "ReviewID": "UR69980109", "Content": "This was a last minute booking so I did not have the luxury of reading reviews. I was looking for a hotel close the inner harbor with free parking. The elevator panel appeared vandalized; so did the guest room doors – even the security latch and regular lock, and the door did not close securely. That coupled with the exterior stairwells and hallways added a layer of insecurity since they give ANYone immediate mischievous access to all guest rooms via the doors and windows. I \"slept\" that night with the tv and light on, and the table and chairs jammed against the door for added personal security - and I was out at first light. My room was at the end closest to the highway exit so I heard EVERY truck and bus that idled at the stop light during the entire night. I couldn't wait to leave.", "Date": "July 7, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Great Mills, Maryland", "Title": "“The worst place ever!”", "Author": "vibris", "ReviewID": "UR64128615", "Content": "This was the worst hotel ever! Someone came and stole my husband laptop. We shut the door but my husband didn't put the latch behind it. We were use to staying in hotels where you didnt' have to do that. We woke up with the door open and our laptop gone. The manager is going to discount our room. He was trying to comp me a free night. Is he crazy!! Why would I want to stay where I'm not save. Pay the extra money and go somewhere else. We wish we did! We filed a report with the police and of course it's gone.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Good stay, friendly working staff.”", "Author": "Mnplumb13", "ReviewID": "UR62486302", "Content": "I had a long stay at this hotel due to my house being renovated. They have outstanding Customer Service. I get service every day from the housekeeping staff which isn’t usual when you stay more that 4 days. When the housekeepers are through, my room is very clean. It is great being so close to downtown, but I don’t pay downtown prices. Good breakfast. Thanks to the staff for making my stay so enjoyable.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "shelton, connecticut", "Title": "“Very old and outdated”", "Author": "donnam57", "ReviewID": "UR46879751", "Content": "My husband and I were in Baltimore for the Marathon and stayed 2 nights. This hotel was very well priced and so, guess you get what you pay for. Very old, exterior entrance to rooms. The bathroom was ancient and had THE most annoying combination ceiling fan/light. The thing rattled constantly and the bulb in that light could not have been more than 40 watt. The bed, however, was very comfortable, definitely a newer mattress. We left very early on Saturday, around 6:30 am and did not return until about 1:30.....the maids never came to clean. Not too good. So, we just got some clean towels from a cart and called it a day. I wouldn't recommend this hotel unless you're just looking for value. The rate was about $70, which is a good rate anywhere. And, of course, all hotels in the Choice line have the free breakfast, basic, but still good. And, since I earn Choice points with each stay, I'm willing to put up with fewer amenities sometimes in order to earn free nights in the future.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Youngstown, OH", "Title": "“Not Very Clean”", "Author": "CJ_Ytown", "ReviewID": "UR45241591", "Content": "This is not a very clean hotel. I have stayed in other Quality Inn's that were a lot nicer and cleaner. The first day we checked in, we noticed three huge bugs on the wall. After killing them we found no more the rest of the stay. The bathroom was dirty with hair and urine stains on floor. The room itself was a little shabby, although it looks like it was just repainted. The door to our room would not shut all the way unless you put force into it. The breakfast was disappointing. Both mornings, the coffee maker was broken. The juice machine only had cranberry juice, because OJ and Apple were broken. The selection of muffins and donuts was very minimal. The only good thing was the Belgian Waffles. Just avoid this hotel, unless you want a cheap place to stay.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Howell, New Jersey", "Title": "“Don't expect much...”", "Author": "patchrick", "ReviewID": "UR30359740", "Content": "My girlfriend and I went to Baltimore to see the Yankees play the Orioles with another couple and needed a place to stay for the night. Since we would be out all day and leave early the next morning, we didn't need or want anything fancy. Check-in was a breeze, very quick and efficient. The front desk staff was friendly. Upon arriving to our room, I noticed the door had definitely been broken into before, as other reviews have mentioned, but it still latched and locked properly. We had a non-smoking room that smelled of cigarette smoke, but wasn't so bad that we couldn't stay there. The room was small, but clean and comfortable and the A/C worked GREAT! The outside corridors are a drag, as it allows anyone (including the drunk guy that knocked repeatedly at 2:30 AM) access to your room. However, overall it's not the worst place you could stay and the bed is a comfortable place to rest your head for the night.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Brooklyn, New York", "Title": "“What is the purpose of exterior entrances?”", "Author": "ziggyziggy", "ReviewID": "UR28863000", "Content": "Really, what is the point of them besides...you know what? How can any guest feel safe with doors that are acessible from the streets without anyone having to pass thru a front desk area. Do not choose this hotel or similar one if you have loved ones with you as they offer no sense of security. I book this place by mistake and did not understand what exterior corridors meant but now i do...and will never book this kind of hotel again. The first room given to us was locked from the inside...with the latch closed but there was nobody in there!!! We had to walk all the way back to the front desk...thru the exterior corridors in the freezing weather..to get another key. Then we had to trek back to the room next to the first one. The room was clean but that was about it. We only needed a bed to sleep on so it served the purpose.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Texas", "Title": "“Beware Do Not Stay Here”", "Author": "gpookie64", "ReviewID": "UR20884380", "Content": "The first two rooms I was given had the doors kicked in and the door knobs did not work. The third reeked of cigar smoke despite being a non-smoking. And the fourth room had urine all over the toilet and behind it on the floor. It was late and I was tired so I had to accept this fourth room but used my own sleeping bag because the entire room was filthy. I've traveled 70% of my 17 year career for thousands of hotel nights. This was the absolute worst I've ever suffered through.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Good Value; Very Good Breakfast Included”", "Author": "MikeandYong", "ReviewID": "UR20697710", "Content": "Stayed here using points. On arrival, bit taken back by exterior entrances to each room but after checked in, all just fine. Room was a bit small for three adults but CLEAN. Standard TV worked just fine and got standard stations plus HBO. Microwave, refrigerator, iron/board, coffee maker all in room. Standard Quality Inn shampoo and skin cream. Bath small but sink in main room vice in bath with shower/commode, which I prefer. Good water pressure in shower. We had no noise problems. Hotel has pool and fitness area but I did not check out. Best features of hotel are restaurant right next to hotel and breakfast at hotel. Restarant (do not recall name) features primarily Italian and Greek food. Wife has Italian seafood dish; daughter and I had Greek. All excellent, portions large and cost very reasonable. Free (no added charge) breakfast at hotel very good. Included make your own waffles and standard breads / cereals (all pretty standard) but also fresh apples and bananas, Yoplait yogurt, and breakfast snack bars. Even juice and coffee better than average. Not fancy but adequate breakfast area off lobby and had TV turned to morning news. Young man keeping breakfast area replenished and clean was very friendly and did excellent job. So, bottom line, I think this hotel has improved in recent months or we just got very lucky. I would not be reluctant at all to stay here again.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New Jersey", "Title": "“Best part of this hotel is the view from the rear view mirror”", "Author": "FamilyFoodie", "ReviewID": "UR19176303", "Content": "Just like a bad movie, this hotel doesn't disappoint. Lousy service, dirty rooms, horrible breakfast and plenty of shady people. Our friend's door wouldn't open and management used a crowbar to pop the door open (could tell it is a common practice). The bed bug problem seems to have been fixed as the old mattresses are still outside piled up in the parking lot. For those dry summer nights, leave the air conditioner on, it blows cold, damp air into your room. The front desk even asked us why we chose them, said they couldn't understand why we would want to stay! The best part of this hotel is the view from your rear vew mirror. You will thank me for this free advice.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "CT", "Title": "“Bad experience in Baltimore”", "Author": "JudaCT", "ReviewID": "UR19198685", "Content": "We have just returned from the wonderful city of Baltimore. We were a party of four families there to enjoy a Red Sox game. The first family arrived a day earlier and called us to say that they could not possibly stay at the Quality Inn. The rooms were filthy! Outside the hotel several mattresses were stacked on the sidewalk! They were lucky enough (after viewing three rooms) to find another hotel. We had no choice but to spend two nights there. The rooms smelled of cigarettes and beer, although they were supposedly non smoking. The bathtub in our room was moldy and had hair all around the drain. One bed had sheets with blood stains and other stains lined the bed skirts. The rugs were stained and the lamps were broken and falling off the walls. The woodwork was very dirty. I went to use the hairdryer and it too fell off the wall. The elevator was so dirty we always used the stairs. We were on the fourth floor with children and the outside railing was loose. Although the pool was not well located, it was well maintained. Unfortunately that was the hotels one accolade.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great value for money”", "Author": "sunhappy1", "ReviewID": "UR17936456", "Content": "I was in Baltimore for the New York Yankees ballgame. I checked for hotels in the area and they were way higher in rates almost 3 times than the Quality Inn. So I booked a room there at a much lower rate to try the Quality inn, well I was surprised, it is an exterior corridor property, but I assume it was recently remodelled, the rooms are nice, new carpet, newly painted, also had a italian restaurant on the property which had excellent food. It was one exit away from the stadium and the Inner Harbor area, so was an excellent value for money.", "Date": "July 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "va", "Title": "“Do Not Stay Here!!!”", "Author": "agregory11", "ReviewID": "UR14762961", "Content": "I stayed in this hotel in Aug 2007. When we arrived it we noticed that the hotel seemed run down, all the shady people walking around, and just got a bad vibe. Our room was dirty, floor was sticky, bathroom was gross. We were kept up all night from bed bugs, loud noises from other units and parking lot, and the power went out and we had no AC. The next morning we were told that we were not going to be charged because of the power going out. We had to check out early because of a family emergency and was told that we wouldnt be charged for our 2nd night and we didnt owe any charges. This hotel charged my credit card 2 weeks ago, 7 months after we stayed there! Please do not stay in this hotel!", "Date": "April 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "wilmington nc", "Title": "“Nice For The Price”", "Author": "celestial12", "ReviewID": "UR11992379", "Content": "I have stayed in this Quality Inn 3 times in the past year . Each time has been great. the rooms were clean , the staff friendly and helpful. The continental breakfast plenty. There is a great restaraunt beside the Inn and I was nearby the 95 exit and places I needed to go were easy to reach. For a safe , clean place to sleep this is nice.", "Date": "December 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Massachusetts", "Title": "“Big Disappointment”", "Author": "DustyMassachusetts", "ReviewID": "UR11171088", "Content": "The first room that we were given was already occupied by a sleeping guest. The second room had sparks flying out of the heater. The third room was missing a microwave. All of the rooms that they tried to put us in were dirty and smelled of smoke ( even though they were supposed to be non-smoking rooms!) The linens on the beds were stained. Overall, a terrible experience. The only plus was that the staff did keep trying.", "Date": "November 30, 2007"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Scotland", "Title": "“Very very poor”", "Author": "mksmillie", "ReviewID": "UR10084134", "Content": "This is the worst sleep in a hotel/motel I've had in years, and I have at least 90 hotel nights/yr. It was like trying to sleep in Grand Central Station - noisy all night and all morning. Cockroaches. Total dump. It is a shame that they are trying to make this a competetive hotel (good internet service in rooms, new fitness room) but sadly they lack the hotel to put it in. The building itself is very old and noisy with outside doors and windows that might as well not be there for all the noise they keep out. Knock it down and start over again is my advice.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Iowa", "Title": "“Should be named \"Last Resort Motel\"”", "Author": "lindabeeler", "ReviewID": "UR10066607", "Content": "We stayed here for 2 nights and would have checked out after one if it wasn't for the fact that we were in a group and would have been a hassle to find something different. We had to move out of our first room because the TV didn't work, but the next room wasn't much better. The stool didn't flush properly and the tub didn't drain. The floor was sticky and dirty. There were no cups for coffee. The others in our group spoke of black stuff in the shower and clogged drains. The most offensive site was the tattered American flag out front. That should have been our clue to head down the road. Avoid this place unless it's the last resort", "Date": "October 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Raleigh, NC", "Title": "“Do not ever stay here”", "Author": "raleighgirl29", "ReviewID": "UR10007739", "Content": "This place was disgusting....one of our lamp shades was broken, another one didnt work, the towel rack broke, the door wouldnt shut properly and they stopped serving their free breakfast before it was supposed to be over. Both my friend and I got bed bugs or mites and had to be treated by a doctor....two weeks later I still have the bites on my arms. We know we got them there. We called down for taxis and they would never call for us. It was the worst experience and cost $200 a night!!! Dont ever stay there.", "Date": "September 26, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "maryland", "Title": "“Roach Hotel”", "Author": "yoshia", "ReviewID": "UR8471196", "Content": "When we entered the supposedly non-smoking room, it smelled like a pool hall. Not only did it smell like smoke, the carpet was so dirty, it felt like I was walking on an oil matted rug. The bathroom had mold on the walls and roaches were everywhere. We sat up for most of the night and when I woke up to a roach crawling on my arm, we said \"that's it\" and went to our car until we checked out. We shook everything to make sure we didn't take anything home with us that we didn't bring. I don't know if I was itching because it was so dirty or because they had bed bugs. The worst part of the whole deal is they didn't seem to care. CLOSE THAT PLACE DOWN!", "Date": "August 22, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "brooklyn, ny", "Title": "“horrible”", "Author": "A TripAdvisor Member", "ReviewID": "UR5324158", "Content": "The rugs were disguisting after 5 minutes on my son walking on the rug his feet were black, the roooms smelled like cigarettes this was a non smoking room, the bathroms were disguisting. The cleaning people were smoking while cleaning the room. This was a horrible hotel i will not stay at another quality inn on security blvd in baltimore, The linens were not changed the towels were hard and horrible.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Florida", "Title": "“Disgusting, Filthy”", "Author": "A TripAdvisor Member", "ReviewID": "UR4565496", "Content": "This was the worst motel experience of my life. My 3 year old son's feet were black with dirt withing five minutes of our arrival. Bugs were in the room. The odor was horrible. Mold in the shower. Sheets not clean. Bed terribly uncomfortable. A/C loud. Door did not shut well. Bad area of town. Management did not care. Upon contacting later through Choice Hotels they oferred a free night. What a joke. These rooms are not clean and never will be. If you look closely at the picture on their web page, you'll see the grime around the door chain. I have no idea how they ever got the rest of the picture to look as good as it does but do note the very small size of the room. It is even smaller in person. I was afraid to touch anything in the room and slept in my clothes. We could not wait to leave the next morning.", "Date": "February 28, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Connecticut", "Title": "“Avoid at all costs!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3679410", "Content": "This was one of the worst hotel stays I have ever had. Our non-smoking room reeked of smoke, and we did not have a queen size bed as we reserved. Also, the plastic on the cups had been ripped open, and the beverage tray looked like it had not been restocked for some time. The air-conditioning in the fitness center was broken, and since it was 90° and muggy, this meant the fitness center was unusable. The elevator was also broken, so we had to lug our bags up the stairs. The two worst problems were that our data port did not work and the room was not serviced. First, I complained at the front desk that phone didn’t work. The clerk tried calling the room and said that it should. I asked to try another phone jack to see if perhaps my computer was problem. The clerk said no and suggested that I try an Internet café downtown. Second, after the first day, we found a note in the room saying the bed could not be made because something had been left on it. However, the room had not been serviced at all: no towels, cleaning, or trash removal. I complained at the desk, but they said because the cleaning staff had left for the day, all they could offer me were towels. I was told that it was the hotel's policy not to make the bed if any personal items at all had been left on it. It would've been nice to have known this beforehand. This also made me wonder if, since the housekeeping staff was so easily persuaded not to clean, anything in the room had been cleaned before we arrived. Because the hotel has a 100% satisfaction guarantee, I told the manager we should not have to pay for our room. She, however, felt that the staff had addressed our problems by giving us towels and sending us downtown to use the Internet and therefore refused to honor the guarantee. Save the $116/night this hotel charges and stay anywhere else!", "Date": "July 18, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Pittsburgh", "Title": "“Not Great for a Holiday INN”", "Author": "A TripAdvisor Member", "ReviewID": "UR3184598", "Content": "My husband had to go down to Baltimore for work so we decided to go with him. The hotel was easy to find and check in was easy, but the room was not great. The carpet was terrible, I wouldn't even let my kids take their shoes off. The bathroom was in bad shape. Everytime I took a shower dirt would wash out off the corners of the shower. Just a warning for anyone parking downtown. I took the kids to the Port Discovery and parked in the Frederick St. garage. Someone broke the window and stole all of my daughters DVD's and her DVD player. She is only 4 and was very upset that someone would steal from a 4 year old. DO NOT PARK IN THIS GARAGE!!!! Obviously they do not have security.", "Date": "February 14, 2005"}], "HotelInfo": {"Name": "Motel 6 Baltimore", "HotelURL": "/ShowUserReviews-g60811-d89362-Reviews-Motel_6_Baltimore-Baltimore_Maryland.html", "Price": "$49 - $82*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1401 Bloomfield Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">Baltimore</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21227</span></span> (Formerly Quality Inn Harbor South)</span></span></address>", "HotelID": "89362", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bb/80/bb8034471a07d4fc42efefdc6d51e3e19large.jpg"}}