{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Hanover", "Title": "“Disappointed”", "Author": "Supnurse", "ReviewID": "UR140298550", "Content": "Arrived for Bike Week...cost expensive $200 night jacked up for sure! Room smelled musty, opening slider helped. Indoor pool closed early by 10 pm it's not like they have guard?? Also, Atrium bar closed early according to desk staff it's because people complained about noise! Really at $200 a night for low budget room we should get something. Room keys kept deactivating-annoying the guy who came up to room rude & abrupt! Really? We will definitely look elsewhere next year", "Date": "September 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sebring, Ohio", "Title": "“This is probably a great hotel at the beginning of the season, but by September, it's just worn out.”", "Author": "Christani", "ReviewID": "UR139440842", "Content": "Our intro was our door which would not open. A grumpy fix it guy came and showed us how we first had to run our key card, then give it a slam, then run key again and full body slam it open. He didn't seem to think this unusual. We figured no one could break in, but come on! As a smaller hotel, the beach wasn't crowded, and was very clean. Just worn out.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great views of the beach; noisy birds wake you up!”", "Author": "SwannTraveller", "ReviewID": "UR138895839", "Content": "We spent Easter weekend at the Quality Inn Oceanfront. We got a relatively cheap room and were travelling with two friends. We were pleasantly surprised to find our two-queen room had a mini kitchen with cutlery, plates, microwave, etc. as well as a lounge area. We spent our first night out on the balcony, overlooking the ocean and relaxing. The beds were older and sunken in the middle, so not the most comfortable sleeping arrangement. The hotel has a great atrium with a pool and two hot tubs (which were filled with shreiking kids), as well as a number of parrots. Early in the morning, we woke to what sounded like a teradactyl! It waws actually an Amazon Parrot but the screeches got us up very early. My advice: bring earplugs to sleep in! A great hotel with a great location, and would stay here again if we could get an oceanfront room on an upper level.", "Date": "August 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "River Edge, New Jersey", "Title": "“No Quality Inn”", "Author": "marc d", "ReviewID": "UR138165005", "Content": "Quality is in the name only. Old everything, AC could not be controlled, bugs, hallways dirty, had to ask for bath towels everyday. Did not get dish washing cleaner that was ask for. Would never go back . This hotel needs major help>>>>Location is good and that is it", "Date": "August 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Nice place to stay on the beach”", "Author": "welltraveled_9", "ReviewID": "UR137889945", "Content": "Recently went for a long weekend here and found it to be a good place to stay. Rooms were clean and the front desk staff on check in helpful. Ample parking and a 10% food discount offered for food at the Inn. It had exoctic birds in the lobby with fish and a pond. Indoor swimming pool and sauna. Good location for kids to stay as it also has an indoor pool for those rainy days. Has excellant access to the beach and is a well maintained property. I would stay there again if i would return to this area.", "Date": "August 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Found bugs and mouse droppings in cabinets...”", "Author": "Shadell", "ReviewID": "UR137268352", "Content": "Stayed at the Quality Inn, August 2012, for the amount of money they required it was the absolute WORSE HOTEL U HAVE EVER STAYED IN... I had to be moved iff site at another place. I was moved several times and all the rooms were old and had dead bugs and mouse droppings in the cabinets. Would never stay there again...", "Date": "August 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bensalem Pennsylvania", "Title": "“Not bad, typical shore hotel”", "Author": "SLaurenH", "ReviewID": "UR137123477", "Content": "Stayed here for a few nights in August. Hotel was completely booked. Arrived late at night and was able to find a parking space, so I'll rate the parking as good. We booked an Oceanfront room and I loved the view and waking up to the sound and sights of the ocean. Room to me is your typical \"shore\" room. Double beds with small kitchen and pull out couch, not dirty, but not overly clean. Bathroom was basic, water pressure was awful, could hardly wash the soap out of my hair. Like others said, there was mold in the bathroom and on the ceiling in the room. I feel this was due to the fact that while the air conditioning blew cold air, it did not effectively remove the humidity from the air, and everything in our room was \"wet\". Forget about blow drying your hair! The rooms seemed to be well insulated, I did not hear much noise from anyone, except them sliding the door open and closed at 3 am at least 20 times. Balcony also very private, with cement from floor to ceiling on both sides so your neighbors could not see you. I actually really liked that. Gave plenty of toiletries and towels. Rooms on ground floor have stairs leading to beach, which I thought was nice, but the sand dunes blocked the ocean view. Might be good if you had kids and something to keep in mind.. Place had two pools, one inside, one outside, and two hot tubs inside. I didnt use either of them because Im not a big fan of public pools, and they were overrun with kids. I was impressed however, it seemed that they drained the hot tubs and refilled them at least every other day. Thought that was good for germ control. As big as the hotel was, we actually couldnt find the check in desk at first! Its buried in the middle of everything and really small, but they do have great fresh fruit at the front desk every morning! Atrium is nice with tropical birds, computer area, pool, hot tubs, koi pond and snack bar that had great frozen drinks! Only thing I didnt like, but that you cant really avoid, is the strong chlorine odor in the entire atrium, hits you like a ton of bricks when stepping out of your room. And yes, on some days, the birds were pretty loud and fiesty, and did wake me up, but honestly, they were more of a pleasure to hear than peoples screaming kids in the morning that drowned out the birds. Thought location was good, we stayed here so we could walk to Seacrets. Also, not too far from the boardwalk, but not walkable. Hotel is in busier part of town. Basically, you pay a rediculous amount of money for a basic room, but to me, that is the shore in the summer. They tried to keep the place clean, but you will have a constant flow of wet, sandy people in and out all day, so I think they did a decent job. This was a quick getaway, so I knew I would pay through the nose, and we did have fun. But for the same price I can go to the Carribbean, all inclusive 5 star resort with airfare, which is what I normally do. We had a good time and needed a quick getaway and thats what we got. We may try this hotlel for the car show weekend next May. Good Luck.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Folsom, Pennsylvania", "Title": "“Our 10th time here, it may be time to start looking elsewhere.”", "Author": "squrt43", "ReviewID": "UR137103115", "Content": "Location is everything. That's what brought us to the place back in 2007. It's located beach front, close to local clubs, and mid island so it's a close bus trip to anywhere. Upon checking into our room, we could smell mold in the bathroom between the sink and bathtub. We looked but it appeared clean, just stunk pretty bad if you stood in that area. The heat lamp bulb was burnt out in the bathroom and the housing for the lamp was hanging from the ceiling. The refrigerator also had loud knocking sound inside the freezer. It would keep you awake so I opened the freezer and smacked the back wall of it and it eventually stopped. I would have requested a new room had we been spending longer than te weekend but they were advertising 100% occupancy so I don't know if relocating us would have even been possible. Other than that the room was unremarkable. It appears the entire outside of the hotel was painted in 2012. While the outside appears nice, the interior of the rooms are beginning to show their age from their upgrades from a couple years back. Staff if always very friendly. The highlight of this place is the Atrium. Food and drink in the Atrium is great, staff is great. This place is expensive, $950 for Fri/Sat/Sun. Yes I know you pay for location but I may look elsewhere and find something a little more for my money, and just come back and visit the Atrium.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Richmond Hill, Georgia, United States", "Title": "“Not bad, but not excellent.”", "Author": "Ksena M", "ReviewID": "UR136379377", "Content": "My husband had to work in this area so I reaped the benefits and we spent a week here. The hotel is definitely right on the beach and close to restaraunts, etc. The hotel was not the cleanest, but I'm not horribly picky, so I was ok. I've read complaints about the birds being too loud and waking people up, we had an atrium room and did not experience any problems. We were fortunate enough to be upgraded to a room with a kitchenette. This was great!! A full sz fridge, microwave, stove, and dishwasher were awesome! We traveled to the food lion and got much cheaper groceries than the CVS, which is close. A good thing to know, you can spend $3, or something like that, and get a bus pass which allows you to travel up and down the \"strip\" unlimited times...I think there are multi day passes as well. Now, my NEGATIVE....the fitness center! They should be considered false advertisement to say this Quality Inn even has one! There is a treadmill, bike, and stairclimber, but there are weightlifting machines that are broken just sitting there. Pathetic! Overall, the good outweighed the bad, but one of the reasons we booked was for a fitness center and to say the least, it was a huge letdown!", "Date": "August 6, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Marlboro, New Jersey", "Title": "“nice mid week stay”", "Author": "mothergoosed", "ReviewID": "UR136098563", "Content": "I was had reservations about my reservation. Wasn't sure if the Quality Inn, was Quality. My daughters and I were pleasantly surprised. We had an Ocean front room with two double beds as requested. The room was a decent size, with decent furniture and was clean. The front desk people were very pleasant and very accommodating. I felt they were truly interested in their guests enjoying their stay. A top notch hotel, this is not. But if you want a decent, clean room on the ocean...this is the place for you. One side note, would not recommend booking with Expedia, better off calling the hotel yourself (you'll most likely get a better price).", "Date": "August 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Randallstown, Maryland", "Title": "“Another great stay!”", "Author": "Jackie824", "ReviewID": "UR135931397", "Content": "This was our second stay at the Quality Inn Oceanfront and it was very enjoyable. First in 2010 and the second this past weekend. For both stays, we had an oceanfront king room. In 2010, there had been a recent storm which brought with it a swarm of little flies (maybe sand fleas?) which invaded our balcony. A call to the front desk brought the housekeeper to the room with a can of bug spray. She sprayed the heck out of the balcony and left the can for us if we needed it later. It helped a bit but then our balcony was covered in dead bugs. Needless to say, we didn't get much use out of the balcony for that trip. Luckily, we didn't have that problem this year. We had a AAA rate, but it was still a bit pricey for a Quality Inn. When we checked in this time around, we were given a 10% off coupon for the restaurant since we had stayed there before. Unfortunately, we didn't get a chance to use it. For both stays, our rooms were clean and comfortable but they could use a little updating. TV is not a flat screen but hopefully they'll update those soon. The bathroom was clean but was showing a bit of wear. The shower had a lot of small shelves for our toiletries which was good, but the water pressure wasn't very strong. Towels were soft and clean. We thought the AC was broken but it turned out the balcony doors (screen and glass) had sensors on them that would turn off the AC if the doors were open...great energy saving feature. We had a great oceanfront king for both stays and the view was fantastic! The bed was comfortable but it would have been nice to have a pillow top or memory foam layer. A big plus was the low noise level. A lot of hotels seem to have thin walls where you can hear your neighbor's conversation but we were pleased that we couldn't hear anything from our neighbors. The only noise complaint would be the birds in the atrium that would \"wake up\" way to early for us in the morning. It didn't last long though so we were able to fall back to sleep. The indoor pool was clean and heated...the hot tub was REALLY hot, couldn't stay in there too long. All in all, it was a great stay, both times. We'd definitely stay again and recommend to friends!", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Always wonderful!”", "Author": "travelwithbaby27", "ReviewID": "UR135479717", "Content": "Stayed for a long weekend just after July 4th. We stay here every year, and every year it is fabulous. The staff, especially Dan the manager, Dan the bartender, Simon, Drew, and Jim make you feel at home. The rooms are clean and beach access is so convenient. The pool is just perfect. We wouldn't think about staying anywhere else in Ocean City.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sicklerville, NJ", "Title": "“Not what we expected”", "Author": "ngbb1003", "ReviewID": "UR135064732", "Content": "Looking at the photo's on their website, then opening the door of our romm...it was not what we expected. The walls, furniture, bathroom all needed updating badly. The bathroom vent did not work leaving the bathroom humid for a long time. The door mirror was chipped and needed to be replaced. Mirrors in both bathroom and bedroom were dirty and greasy, the closet door was off its track and almost fell, even the balcony door was somewhat of its track making it hard to open and close. TV was old. The ceiling in the bathroom had dirt or somethig black between the tiles. The pool had tiles missing. Overall the room itself was too bad for me to come back again. Maybe we were given the worst room in the hotel, after most of the reviews I read seemed to be very good and excellent. The week we booked was the most expensive, so I thought we would have a somewhat room that looked like the photos on the web. On the plus side, the food from the restaurant was very good. Service at the restaurant and front desk was excellent. We needed more towels and it only took minutes for them to bring them to our room. The TV went out, again someone was there to bring a replacement. Downstairs, the indoor pool and hot tubs were nice. The Atrim was nice. The bedding was clean and comfortable. Still I will not recommend this hotel to someone I know.", "Date": "July 22, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Great management makes the difference!”", "Author": "Thsamih", "ReviewID": "UR135021818", "Content": "Small touches from management goes a long way! Very customer friendly and great for families with kids. The free coffee & tea 24x7, the birds and daily clown show for kids are nice. The hotel needs serious cleaning to fight some Mildew in some areas. I will go back again", "Date": "July 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Fine vacation spot”", "Author": "SarahWZ", "ReviewID": "UR134837845", "Content": "My husband, my 12-year-old son, and I stayed there during July, 2012. It is a fine vacation spot. The building is not young but has been well maintained. The furniture is is working order, although very uninteresting. The kitchenette is old enough to have a stove instead of just a microwave. The sheets on the bed were new and of good quality, but the springs on the mattress were completely shot. The towels were serviceable but of low quality. The atrium has parrots, the largest and most beautiful carp I have ever seen, and turtles. Kids (and young-at-heart adults) loved it. Unfortunately, the indoor pool is also in the atrium so that everything has that indoor pool smell. There are kids everywhere and the atrium is very noisy. There is a nice size outdoor pool with a deep end deep enough for swimming but not for diving. The hotel is on the beach but far from the boardwalk. It is near, however, a large Dumster's restaurant and a delicious Thai restaurant (Satellite cafe). They provide lots of free fresh fruit in the entrance area and very high quality coffee 24/7 free near the elevator. The staff were friendly and helpful.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "maryland", "Title": "“Better than expected”", "Author": "ticky v", "ReviewID": "UR134430426", "Content": "I took my husband and 2 teenage boys for a long weekend. After reading the reviews, I didn't know what to expect. I do agree that the hotel is a little beaten up, but it was clean. New wallpaper and fresh paint should help that. Awesome location, with guarded beach. Nice pools and the atrium was neat with the birds and fish. Staff was very friendly, helpful and willing to make the stay the best. It had lots of parking and .was close to shops, restaurants and short drive to boardwalk. Would stay there again with the kids.", "Date": "July 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Cassville", "Title": "“Not worth the price paid”", "Author": "travelmomgaff", "ReviewID": "UR134211559", "Content": "I brought my children here for probably the last family trip we'll take since the kids are getting older. We went here about 3 years ago and we loved it. Apparently, 3 years makes a huge impact on things. It def was not as clean as it was 3 years ago. I found multiple things under our beds. Really? You can't clean under the beds? There was a huge hole in our bathroom wall where the tissue box was supposed to be. They just kind of set the tissue box in the hole. This place was pretty disgusting. I had to wash every dish we tried to use prior to using it when we arrived. The toaster was gross and had to be cleaned out too. To top it off, the housekeeper took my youngest's pillow from home. I went down to the front desk to ask about it and was told sorry they will look for it and that was about it. Didn't even offer to replace it and never heard about it again. For the price I paid I expected a little more cleanliness. The plus side of the Quality Inn was that the Atrium Cafe was great about giving us things we may have forgotten for when we made dinner in the room. I don't think I would stay here again after this experience. If I'm going to pay that much it's going to be a little nicer that this.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Easton, MD", "Title": "“Very good hotel, great value”", "Author": "David T", "ReviewID": "UR134207077", "Content": "The three things I look for when I stay at a hotel are: Is the hotel clean? Definitely Are the beds comfortable? Definitely Is the location good? Definitely All of the above were met and there were several other positives. We arrived some 5 hours before check-in(we're on our 14 month olds schedule) and asked if we could check-in. The very friendly receptionist said the rooms weren't ready but took my cell phone number and told me he'd call as soon as my room was available. It was less than a half hour when he called back saying my room was ready...great customer service. The atrium was a neat feature, as was the pool bar. Our oceanfront room was spacious and had a nice kitchenette. We will definitely stay here on our next visit to OC!", "Date": "July 12, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Had good pluses, but dirty bathroom”", "Author": "Jennifer P", "ReviewID": "UR134056363", "Content": "Stayed here for one night after 4th of July. Pros about this hotel are that its directly ocean front, walk out the front of the hotel and a few steps later youre at the beach. The hotel also had a ton of free parking, 2 pools, and 2 hot tubs. Our room faced into the atrium which wasnt bad, no ocean front view but kind of nice. It wasnt noisy until the parrots in the atrium started squwaking in the morning, which woke me up. I had 2 major cons. My first major con was the bathroom. It was dirty and run down. And the things that needed to be cleaned or fixed were relatively minor, but the combination of them was gross. With about an hours worth of work they could all have been taken care of, so in my mind they shouldve been. My 2nd major con was that we had a double bed, not a queen. Seriously? What hotel does this? I mean there was plenty of room in our room for a queen. And how much more is a queen than a double? Nominal. Spend the extra $. We had a night time in OC for our short trip, and the hotel wasnt terrible.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pittston, Pennsylvania", "Title": "“Great service, wonderful Amenities!”", "Author": "SpANG1", "ReviewID": "UR133903678", "Content": "Having read the reviews of this hotel before we booked, I really only thought it would be average. Looking back on the reviews, I see that most of the negative ones are from 2010 and older. This leads me to believe this particular hotel made some serious improvements over the past few years, because I was pleasantly surprised! Our experience was very enjoyable! First of all, Quality Inn Oceanfront has a GREAT location. Not too far from the board walk (this should not be confused with the Quality Inn ON the boardwalk), but not so close that you see light up signs, hear people at all hours, and smell fast food everywhere. It's kind of right on the outskirts of things, much like the higher-end hotels. We had a 5th floor ocean view room and the view was fantastic! I woke up just about every morning to see the sunrise from the balcony. The beach is right behind the hotel and was very convenient to walk to. The hotel amenities were well-above average. An indoor pool with 2 hot tub areas and a sauna. An outdoor pool. Towels provided, too. They have a fun playground with a pirate ship AND a castle! Even a BBQ area. When we weren't at the beach, we were at a pool! The inside of the hotel (near the pool) features an 'Atrium' with actual tropical birds, a koi pond, and turtles. It's a very nicely laid-out area! The front desk ALWAYS has a supply of fresh fruit on hand. The room itself also had a lot of great comforts. There were 5 of us (2 adults, 3 kids) and there was PLENTY of space for us. 2 Full beds and a pull out couch (with mattress protectors) worked fine for all of us. It even had a privacy curtain which separated the room. Other nice stuff included a small kitchenette with FULL SIZE fridge, stove, microwave, deep-well sink, cupboard space, and even cooking utensils! A safe and a a 'charlie bar' to lock the sliding door for added security. It had free wi-fi, which was a little slow but they also had a computer room/area in case you needed it, which was nice! Laundry service is also INCLUDED (you just need to get tokens from the front desk). We also received excellent and accommodating turn-down service every day we were there (thanks Rosina)! VERY kid friendly! A clown named \"Lollipop\" showed up every day after 3 PM to entertain the kids. Balloon animals one day, magic the next, dress up the next, and so on! Very fun for the kids. Kid-friendly frozen drinks are available at the outside pool as well! IMPROVEMENTS I'D LIKE TO SEE, IN CASE THEY ARE READING THIS: There is only one elevator for the WHOLE hotel. This was a pain. They could use more to accommodate everyone. I hope they work on that in the future. Faster WiFi would be nice. More computers in the Computer room. New couches/convertible beds - though the bed was comfortable enough for kids, the couch was very uncomfortable. An ice machine on every floor would be great too. :) SUGGESTIONS FOR YOUR STAY: - Book on OCEANFRONT room. The extra $20/night was worth it for the view alone! - Try to get a room ABOVE the first floor. The foliage blocks your view of the ocean, and all the foot traffic seems to make the sandy area you walk out to a bit unclean and noisy. - Take advantage of the free fruit! It's delicious! - Don't bother brewing your own coffee in your room. It's just not as good as the coffee at a complimentary area near the elevator. They keep it well-stocked. Use your 4 cup carafe in your room to carry it back! :D - Take advantage of your small kitchen! Stock up on breakfast and lunch items; save your big $$$ for dinner! - Make sure the name of your significant other is listed on the hotel room. Do this when you check in and you won't have any problems if the other person needs a new key, or linens, etc. - Get (or rent) a beach cart if you have a large family! It will really help lug things around for you!", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Ohio", "Title": "“Great Oceanfront experience!”", "Author": "llamasocks", "ReviewID": "UR133380934", "Content": "We brought a friend to OC to celebrate her 50th birthday and the Quality Inn Oceanfront was exactly what we had hoped it would be! I had read some other reviews that gave concerns about cleanliness, but I am glad that we made the decision to stay here. I really like reading about all the \"details\" in other's reviews, so will include the same in my review. We arrived for a 3 night stay in an oceanfront, ground floor room around 6pm on a Friday night; parking was available steps away from the lobby and check in was quick and easy. In the lobby there are baskets of complimentary fruit always available, as well as free local daily newspaper. Outside, across from the lobby, is the outdoor pool; just the right size and a great place to relax that is not \"sandy\". Outside the pool area is two children's play areas, as well as picnic tables and an outdoor (charcoal) grill. Past the lobby you enter the Atrium, which is an indoor area that houses the indoor pool, two hot tubs, tropical birds and fish pond/bridge, and the bar/grill. The indoor pool was fine, however, the hot tubs (unfortunately) were mostly inhabited by kids. 90% of our parties water time was spent in the ocean and the outdoor pool (which was great) so this didn't really bother me. We didn't eat at the bar/grill, so cannot comment on that either. The birds and fish were a really unusual and interesting touch to the indoor Atrium experience. On to our room, which was on the ground floor. The room was great for what we needed (oceanfront, enough space for 4 adults, with a kitchen). The sliding glass doors opened onto a patio with a small table and chair...three steps down from our patio and you were on the beach! You couldn't get a better location for ease of coming and going to the beach! The beds were comfortable, including the pull out couch. My only \"complaint\" with the bed were the scratchy pillowcases (I usually bring my own pillow but forgot). The kitchen had a full size fridge, a small 4 burner electric stove, and a microwave/coffee pot/can opener/toaster, and necessary plates and utensils. All in all we loved this hotel and would definately return again! Extra tips: Using the kitchen to prepare breakfast, lunch on the beach, and one nights' dinner really saved us money. There are ice machines on the 2nd floor (north end) and on the 4th floor (south end). Laundry on 2nd floor by the ice machine. The soda machines sell cans for only 40 cents. Be sure to grab some fruit in the lobby daily; it was fresh and not too \"green\" or \"overripe\". Free coffee with creamer cups (I hate the powdered stuff) and tea (Bigelow foil wrapped type) always available. If you are staying oceanfront and on the groundfloor, request a room closer to the north end; there is an outdoor back entrance with a ramp that makes unloading and loading the car much easier. There is a hose nearby this entrance to wash your feet or chairs when you return from the beach.", "Date": "July 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“Average hotel on the beach”", "Author": "Bret E", "ReviewID": "UR133304165", "Content": "Just returned from a two night stay at this hotel. Pros: right on the beach with direct beach access, two pools (indoor and outdoor), outdoor pool was perfect and enjoyable minus several men that couldn't use a sentence without dropping the f bomb, decent bathroom with heat lamp and tiled, atrium was nice with parrots and fish, check-out was quick and easy, staff was friendly and attentive to our requests of additional towels and covers. Cons: we heard constant noise from the people above us all night long, they were constantly opening and closing the sliding door to the balcony, the air conditioning seemed as if you always had to re-adjust it (I guess it would turn itself off), outdoor pool closes at dark, indoor pool had such a strong chlorine smell we chose not to use it, bathroom had previously used soap in the shower upon arrival, pull out sofa had so many hairs on it we chose not to use it, the toaster in the room was covered in grease and didn't work well, trash under the sink, there was a condom box under the pull out sofa. I know all hotels can have issues, but some of the above should have been addressed. It's evident that the cleaning staff do not pay attention to detail and do not thoroughly clean rooms between guests. Another positive, we didn't see any bugs or critters in the room in our three days there. Overall a decent stay, especially for the location. For the $634 we paid for two nights I did expect a much cleaner room and more attention to overall cleanliness. I am not sure that I would return for another stay.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great beach access”", "Author": "Tnikki88", "ReviewID": "UR132695912", "Content": "I was here a few days ago with my family. I picked this hotel because of the reviews and the beach access. Not a bad place to stay, but it definitely needs upgrading. The indoor pool area had trash on the ground and the light color tiles were dirty, there was also poor drainage.( standing water in pool area) I put water shoes on my kids. The elevators were also dirty, sometimes sweep but not washed. The cafe had too many flies;however the food was good. Our room needed some serious dusting, we found a dirty sock on the side of the couch, little dead bugs on the wall near the bed and some bad patch work by the air vent. I would rather stay in a hotel that appears to be clean then one that looks dirty, it was definitely a turn off! The up side was, the beds were comfortable and the staff was nice. I would stay here agian only if they upgraded the entire place and keep it cleaner..", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“Nice place to stay”", "Author": "PaulAK41", "ReviewID": "UR132618874", "Content": "Nice quiet location with friendly and helpful staff. Our home away from home was roomy enough and clean. Easy bus or car ride to boarwalk to enjoy that experience. 2 pools & hot tubs. Would like adult only time for these amenities.", "Date": "June 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bel Air, Maryland", "Title": "“Our favorite OC spot”", "Author": "ellieirish", "ReviewID": "UR132091834", "Content": "We love the ocean front views and the friendly staff here. You can't beat the right-on-the-beach location and the atrium is a nice diversion if you have little kids. As other reviewers have mentioned, there are some aspects of this hotel which are dated and perhaps a bit worn, but for us, it's part of the charm and does not detract from the fact that it's a great view from the balcony, there's a full kitchen where you can save money by doing your own breakfast and lunch, and there's a decent pool for when the beach becomes too much. Lots of kids in the indoor pool and hot tub area, so we wouldn't go near that, but if you have kids, that's the place to be. Overall, we love this place and come back every year.", "Date": "June 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Middletown, New Jersey", "Title": "“Lovely Location and View!”", "Author": "Laurel_Lye13", "ReviewID": "UR131906029", "Content": "I traveled with my father and Grandmother. We had a little trouble finding the actual office but I think that was my Dad being a wacko and nothing against the hotel. We had an easy check in and walked through a very nice atrium with a koi pond, parrots, an indoor pool and a little cafe to the elevator (only oceanfront rooms have an elevator). We were on the third floor - the first has a balcony that steps out to the beach but I think the view might be a little blocked, second floor view may be blocked by palm trees but depends where you are on that floor) As it was our room had a very nice view of the ocean. And the balcony was nice to spend some time on watching the waves, I even saw what I think was a fox one night! The room had three beds - one of which was a pull out couch which was comfortable but I folded it up during the day for extra seating since the television is sort of in this room. Our A/C was set on 50 but it never actually got that cold, it was comfortable in the room though and at night the atrium lights are lowered to give a feeling of darkness in the hallway as well. I noticed in other reviews some people complained about the parrots sqwauking but I didn't have a problem with it. The birds are covered at the night and uncovered around 7-7:30 in the morning. When they are awake you can hear one every once in a while but it never woke any of us up. The kitchen was nice. A bit like cooking in a camper but with a bigger refrigerator. There were several pots and a frying pan provided, as well as a strainer. There were glasses, plates, bowls, mugs for six people. There was a two slice toaster and an electic can opener as well as a manual one. Also a bottle opener with corkscrew, a big spoon, pasta server, and holey spoon and silverware for six. I enede up buying a potato peeler and masher at the local Superfresh so bring those if you plan on doing mashed potatoes! There was a teeny dishwasher which was nice but the pots and strainer didn't fit so they had to be done by had. The stove was electric which I have at home so no problems there. For an idea of what you can cook, I made pork chops, peas, and mashed potatos and turkey cutlet, spinach and mashed potatos the next. The front desk has seasonings upon request but I brought my own. They provide towels and dishrags for the sink as well as dish soap and dishwashing powder. The bathroom was nice, not the typical hotel bathroom. It had a sink inside the bathroom, which I actually like batter. A nice big mirror along one wall and the shower worked well. The only weird thing about it was right across from the toilet was a full length mirror, a bit of a strange location for one if you ask me but whatever. We could take the elevator to the main floor and then walk out past a complimentary coffee and tea service to the beach (brochures and maps are through these doors if you are looking for them. One the way back in there was a curtesy hose to wash the sand off your feet before entering. I prefer the beach so I never used the pools but they looked very nice and there were always people in them but they never seemed over crowded. Overall, I thought this hotel was a bit expensive compared to what we usually pay but it was about average for the area, especially since it was right on the beach. It was a bit old (the mirror had some tarnish, the stove had a dent) but it was clean which is all I really care about.The staff was very helpful, the cleaning ladies were always very nice, we saw more of them than front desk staff- they always seemed to be cleaning something. It was a nice hotel, I would stay here again.", "Date": "June 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best hotel in Ocean City, will keep coming back!!”", "Author": "kdraz99", "ReviewID": "UR131410411", "Content": "This hotel is so clean, staff are extremely friendly. Great food at the Atrium restaurant. Have been going to this hotel for 5 years in a row and will not go anywhere else. Small drive to the boardwalk, private beach and very quiet at night. Perfect for families!! Highly recommend!!", "Date": "June 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Plymouth, PA", "Title": "“Great Oceanfront Getaway for the Price”", "Author": "lilmx5guy", "ReviewID": "UR131199901", "Content": "Just got back from 4 days and 3 nights in Ocean City, MD at the Quality Inn Oceanfront. Our stay was from 5/29 to 6/1. Check-in was fast and easy. They have a complimentary basket of fresh fruit and daily newspapers to the right of the check in counter. Rooms are a little dated but all of them feature full kitchens with four burner electric stove, apartment size refrigerator, microwave, compact dishwasher, coffee maker, electric can opener and a toaster. In the cabinets are silverware, glasses, coffee cups, pots, pans, and utensils. There is also free coffee 24 hours a day on the first level as you are heading towards the ocean by the elevators. We had a beachfront king room, and other people in our party had an oceanfront double. The beachfront room had sliding doors that opened to a small \"porch\" with two chairs and a table, walk down a few steps and your on the beach. the path through the dunes was right there outside our room. The other room was on the 5th floor with a balcony that had an awesome view of the beach and the ocean. It rained one of the days we were there, so the indoor pool and atrium were a blessing, since we were there with 3 grandchildren in our party. The indoor pool is nicely heated and has a 2 foot deep kiddie pool attached to it. There are 2 hot tubs located next to the indoor pool that really help ease the aches and pains from playing with the little ones all day. The outdoor pool is larger and deeper, with a 1 foot deep kiddie pool on the side. Next to the outdoor pool there is a pirate ship and a castle play area for the kids and picnic tables with charcoal grills for a cook out. The atrium area contains a small bridge over a \"stream\" that is surrounded by plants and contains many large fish and a turtle. There are also several birds in the atrium area, 2 large red macaws and 3 parrots were there during our stay. They open the cages up during the day while they take care of them, some of them climb on the to while others wander around the atrium. Rooms that were located on the street side of the building had balconies that overlooked the atrium. The atrium also contains a small restaurant and bar. The menu is limited to basic breakfast, lunch, and dinner fare, along with your typical bar food. The food we had was OK and it sure beat going out for something to eat when you don't feel up to it. The bar runs a happy hour from 4 to 7 which features $1.75 draft beer and $5.00 frozen drinks.The beds were comfortable and the rooms were clean. The front desk staff were very helpful and courteous, as was all of the cleaning and grounds staff and the bartender. With a full kitchen you have the option to go to the supermarket (there is a Super Fresh and a Food Lion down the road) and make a quick meal in the room. We had a great time and enjoyed the place for what it is. It's not a high service, high end romantic getaway for couples, but for families with kids or friends on a trip, it was just about perfect.", "Date": "June 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“A \"Quality\" Stay”", "Author": "HonestGuyDelaware", "ReviewID": "UR130898134", "Content": "Our favorite spot for multiple visits. New exterior paint/plants really spruces things up! Wonderful staff,comfortable rooms,pools,etc. The only complaint is the sofa needs upgrading.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newville, Pennsylvania", "Title": "“Relaxing”", "Author": "PennsylvaniaTurtle", "ReviewID": "UR130557845", "Content": "My husband and I stayed here in March. The staff was always friendly. The atrium was beautiful. We had a oceanfront room, so we did alot of sitting on the balcony watching the ocean and the sunrise every morning. The one night it became very foggy so it was nice to have the cafe to order food so we didn't have to drive anywhere. It was also nice having a kitchenette, especially the full sized fridge. The only reason I didn't give this an excellent is because the bed was so uncomfortable that my husband and I woke up with backaches every morning. Otherwise this is a great place.", "Date": "May 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "millville", "Title": "“Great Getaway”", "Author": "cruiserplanner", "ReviewID": "UR130382083", "Content": "This is so what late but I had read some of the reviews prior to our going and I wanted to put my two cents in. Frist I must say that this was not the hotel I thought I was booking. My husband and I had stayed in Ocean city Md a few years back and we stayed at a choice hotel that was very nice but later ( afew days before we left for this get-a-way) I realized this was not the same hotel in fact the other was Comfort inn not Quality Inn Oceanfront. When I realized I got online and started checking reviews and they were not very favorable. Well we were very pleasantly surprised to found a very lovely room beautiful pool and great and friendly staff. We really enjoyed our time there and we plan to return again. w", "Date": "May 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cape May, NJ", "Title": "“Great Staff - good bargain!”", "Author": "4283099", "ReviewID": "UR128982009", "Content": "Just got back from my first Ocean City, Md., group golf outing. Stayed at the Quality Inn Oceanfront. Check-in was fast, and they had our rooms ready before check-in time so we had some time to change and unpack before tee time. Our check-in people (Tanya and ?)were quite nice and efficient. There is a bowl of fresh fruit as well as daily papers to the right of the check in counter. These are complimentary to guests. Rooms are a little dated but feature full kitchens with electric stove, apartment size refrigerator, complimentary coffee packs and coffee maker. there is also free coffee on the first level going toward the ocean side by the elevators. After golf I enjoyed the indoor pool and Atrium setting. the pool is nicely heated. it really took out the aches and pains of senior life! the atrium setting was a lot of fun. there were several birds for company- including \"kenwick\" who says \"hello\" and \"hola.\" a larger bird near the elevator station was quite demonstrative when he wants his food!!!! also a little fish pond, with some really big fish. loved the entire setting. plants are not natural- it was explained to me that they had real plants before but attracted too many insects. rooms were refreshed during the day; beds were comfortable and our rooms which were on the street side had back balconies that overlooked the atrium. very scenic for what it is. the small restaurant/bar did the job. the menu is small but servicable. breakfast runs about $4-$8. beats driving. bar is opened from about 8am till 11ish pm. kevin was our bartender-looks of fun with a great sense of humor. he gives it and he can dish it out! overall, we hade a great time for what it is. not the place for high end couples looking for a romantic get-away, but for families with kids and friends on a golf trip, it was A-OK!", "Date": "April 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Claymont, Delaware", "Title": "“much improved”", "Author": "donnae535", "ReviewID": "UR127760182", "Content": "We stay usually once each winter, because kids have loved the atrium with pool and exotic birds.After many years place began to decline but we still kept going. This year all new bedding updated kitchens and baths. So fresh and new even the atrium is updated. Stayed last weekend and had a great time.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "High Falls, NY", "Title": "“Great Hotel!!”", "Author": "MsJeep126", "ReviewID": "UR127629064", "Content": "We just stayed for two nights at the Quality Inn, Oceanfront, Ocean City MD. Room 417 came equipped with a full refrigerator, stove/oven, dishwasher, electric can opener and microwave, plus toaster, kitchen utensils. The bed was a king pus a sleeper sofa with a privacy curtain. A great view of the ocean; small table with 2 chairs on balcony. Kitchen had two chairs, with a small table; ample closet and drawer space. Overall the room was very nice. The hotel was clean and also has a bar/restaurant - nothing fancy but service is good; indoor pool and separate hot tub. The ocean access is very easy; however you are 30 blocks from the boardwalk. We walked to two nice places for drinks/eats - Fagers on the Bay Front and Seacrets on the Bay Front, both within simply 6 block walking distance. I would highly recommend this hotel to my friends and family. We had to leave a day early due to an emergency at home and they did not charge us anthing extra for missing the third night. The staff was very nice and helpful. At the front desk there is a variety of fresh fruit available for guests which include apples, oranges and bananas-- free of charge along with coffee next to the beach access also free of charge all day. In front of the building is an outdoor pool and another hot tub. It is easy to reach this hotel from the Coastal Highway. Laytons was farther downtown but that was also a great place for breakfast -- if you order the Breakfast Burrito be very hungary or share it with a friend!! It is huge!! But very good food!!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Farmville, North Carolina", "Title": "“Very nice oceanfront hotel”", "Author": "Barbara220", "ReviewID": "UR126161146", "Content": "We were very pleased with our room here at the Quality Inn. Almost like a trip back in time. We checked in at sunset and found the room to be complete and comfortable. The rooms are equipped so that you can fix yourself meals in your room and sit at the little dining table. The amenities in the bathroom are nice, there is coffee in the room. There is coffee and tea available down in the lobby near the exit to the ocean, right off the library. The Atrium Cafe off the lobby is small but the food is good and the staff is friendly. There are five beautiful birds in large cages in the lobby. There is also a very nice indoor koi pond that I didn't even notice until I was looking out over the lobby while waiting for the elevator. Some of the fish are quite large. There is a newspaper available daily and a bowl of fruit for customers. The bed and chairs were comfortable and relaxing. My only complaint was the noise. The rooms that face the ocean, line the interior of the building/lobby so that all activity in the lobby creates noise that echoes through the hotel. You can watch the kids play in the pool and from the time the pool opens around 9 AM til it closes at 10 PM, the shouting and screaming becomes quite annoying. There were a lot of children running along the hallway and the noise carries into the room. I wanted to go to sleep before 10 PM but couldn't because of the loud, loud noise. It is because of the noise that I rate this a 4 instead of a 5 but I would like to go back and stay there, when kids are in school! Another good point, the hotel is very close to the Route 50 bridge and in a good location in Ocean City.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rehoboth Beach, Delaware", "Title": "“Best place we've stayed at”", "Author": "boollllkstory2", "ReviewID": "UR125852854", "Content": "Everything was great. We had a king bed efficiency with full fridge, stove, sink, dishes, pans, utensils, microwave, etc. -- for $64 a night! Plus, Nick, the night clerk went out of his way to clean up a jar of mushrooms we had dropped and broken while moving in. The whole staff was nice and friendly. We had a ground-floor room within steps of the inside pool, hot tubs, and Atrium Bar & Cafe. Everything was clean and well cared for, including the five beautiful tropical birds in cages. It reminded us of a high-class Las Vegas hotel, and we will recommend it to others every chance we get.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Joppa, MD", "Title": "“Very nice stay”", "Author": "poca1313", "ReviewID": "UR125478259", "Content": "We stayed there too for my daughters cheer competition. Our stay was great. The rooms were very clean except for a few pieces of trash we found from previous occupants. The indoor pool was great and we visited the atrium bar a few times. Beds were comfortable and the view was fantastic, we were on the bottom floor and was able to walk right on the beach from our balcony. They even provided things like lotion make up remover shampoo conditioner....provided us with fresh towels. the kids had a blast at the pool party with the dj but if your going there to relax I suggest checking making sure nothing like this its going on because it got extremely loud. We would love to stay again but its a little too pricey for a normal ocean city visit, hopefully they willl choose this one again next season for her cheer competition.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Columbia, Maryland", "Title": "“Terrible night, checked out early”", "Author": "Vectorsmom", "ReviewID": "UR125374587", "Content": "I booked a room for 3 nights starting on Saturday, Feb. 25th. When I arrived, I had a 3rd floor room with no elevator access (atrium view), so I had to carry all of my belongings up 3 flight of stairs. While the room was adequate, the room door was not sealed well, and the wind whistled loudly through it all night. There was a cheerleading competition in town, and the hotel had a DJ until 10pm in the atrium area - my room opened up to a balcony overlooking the atrium. When the DJ stopped, the noise continued until 3am, with both kids and their parents/chaperones talking and yelling constantly in the atrium area. At 1am, my room phone began to ring with kids looking for their friends. - obviously not supervised. About the 4th time it rang, I called the front desk, and they said they had no way of tracking who was calling, so I unplugged the phone. The next day things became quiet as the cheerleaders left, so I went out for the day. Before I left, I pulled the trash bags, and found old trash underneath them from someone's previous stay. Upon my return at 5pm, I found that my room had not been attended to by housekeeping, and when I called the front desk, I was informed that housekeeping was gone for the day. Being disappointed and tired from the night before, I decided to check out and move to another hotel. I did use the fitness room in the hotel in the morning, and it was very hot in there. I found a pair of earrings, most likely left by one of the cheerleaders. When I took these to the front desk, the woman working there tried to avoid looking at me and acted as if I was bothering her. In fact, the only person I encountered who was pleasant was the gentleman at the desk who checked me in and also checked me out when I left. I had originally booked the room because I read on line about the tropical birds in the atrium, but when I finally saw them on my second day, I was concerned about all of the kids whistling and trying to talk to them constantly. I can only imagine how traumatized they must have been with all of the noise from the night before. Not a relaxing environment at all as advertised.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“Weekend getaway”", "Author": "HonestGuyDelaware", "ReviewID": "UR125252596", "Content": "Cheerleader weekend. Yikes!! The management informed us this was a cheerleader contest weekend. Lots of kids,noise,but the facility did a nice job of handling it. We will definitely return on a QUIETER WEEKEND!!! Would definitely skip any OC Hotel during THIS WEEKEND,unless you're the participant(;", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellmawr, New Jersey, USA", "Title": "“weekend at Quality Inn in Ocean City MD”", "Author": "mommomb", "ReviewID": "UR125243223", "Content": "We stayed during a cheerleading competition where many of the teams stayed at the Quality Inn. When we booked we were given a \"heads up\" by the person taking our reservations. The hotel is undergoing a facelift on the outside but inside is beautiful. The rooms were so clean, and they staff thinks of everything, including disposable makeup remover in the bathroom!! The rooms all have small kitchenettes with pots, pans, dishes, and some units even have small dishwashers. The view from ALL the balconies is great! Each room over looks the tropical settings of the pool, 2 hot tubs, and a little bar/cafe where the food is delicious and very inexpensive. There are glass elevators that can take you to your inside rooms, but we were on the outside and it was only 1 small flight upstairs. Not a big deal at all. There are plants, exotic birds and a very friendly staff to help navigate you to anywhere or to supply whatever your needs are. The rooms have double beds, but also pull out couches. Within the rooms there is a curtain you can pull across between the beds and the couch. Very family friendly. The staff was always vacuuming, cleaning, replenishing the coffee and tea machine set up on the ground level by the pool. I would definitely recommend this to anyone. The only problem we had, and it wasn't the fault of the hotel, was there was a power outage in part of the hotel and outside on the same street. When that happened there were people in the elevator. The fire dept. quickly came and opened the doors, but some of the people that stayed with the cheer competiton were extremely rude to the staff and due to circumstances that were not the fault of the hotel, they still demanded to have their rooms comped and also wanted their food comped!! The management did everything they could to be accomodating, but they still had plenty of beligerent people to contend with. My hats off to the friendly staff for just smiling and being as helpful as they could. I would go back there anytime. It is right on the beach and has a beautiful view from the rooms facing the ocean. They are very close to everything....food stores, restaurants, drug stores, etc. I also know that they accomodate golfers during their stay. 5 stars!!!!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Peach Bottom, Pennsylvania, United States", "Title": "“Very Nice”", "Author": "Susan M", "ReviewID": "UR124550914", "Content": "We booked for just a getaway weekend in February. The Atrium was just beautiul and the staff was helpful and friendly. I loved the tropical birds and the Koi pond in the Atrium. We had a quick dinner the first night in the Atrium Cafe, it was tasty, prepared quickly and served with a smile. We had the pleasure if meeting the lady who cares for the birds everyday and she was gracious enough to spend time educating and giving us a greater appreciation for the unique personalities of each one of them. Overall it was a very pleasent stay. The outside of the building could use a facelift (there was a crew working on the facade as we were checking out)but our room was clean, spacious and pleasent.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“The Quiet Roar of Ocean City~”", "Author": "DERRICK M", "ReviewID": "UR124544375", "Content": "I shamefully admit that i, like so many others have grossly underscored the Quality Inn brand, expecting the standard \"Inn\" experience - which is, bed, bath (but not much beyond.lol) But was immediately awestruck at a spacious oceanview room-fully equipped kitchen (including flatware!) A Hot Tub and pool were nice accents to a lavish atrium with exotic birds and a running pond coursing with live colorful fish! but the closer that caught completely off guard - was when i drew the drapes at 715am my first morning - to behold the most breathtaking Sunrise I've ever beholded! (and I've been to Honolulu ~ and it beat even that one! You cant believe this value!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great Super Bowl Weekend!”", "Author": "Barb M", "ReviewID": "UR124213575", "Content": "We just returned from a 3 night, Super Bowl Weekend with 6 of our friends. What a blast! The hotel has been completely renovated and updated and is just beautiful. We love the tropical atmosphere in the atrium area with the palm trees and exotic birds, koi pond and beautiful lighting. The pool area is as pretty as the picture and the hot tubs very relaxing. The entire hotel staff that we encountered were so nice and accommodating and at times joined in on our fun - Thank you Mr. Sticky!!! We started in a 2nd floor atrium view room but asked the next morning if there were any 1st floor rooms available. There was and the front desk clerk was happy to make the change for us. In our haste to move our belongings to our new room, I left a phone charger plugged in an outlet and my robe hanging behind the bathroom door of our old room. Upon inquiring at the desk about these items, they were quick to issue a door key to me to check it out as the room was still available. The maid had already finished the room and my things weren't in there but she turned everything in to the front office where I was able to pick them up later in the day. THEN, to bug the front desk staff some more, I realized later that night that I had left a special beer glass in the kitchen cabinet of our old room and asked if anyone had moved into the room yet. They said someone was in there but, shortly after, Mr. Sticky was at my door with my beer glass!!! He was just wonderful and could have really gotten annoyed with me but instead, had a great sense of humor and did everything he could to make our stay enjoyable. He even issued 2 free drink coupons to my husband for having to put up with me!!! When we returned home I checked their rates for spring break week (I work in a school) and went ahead and made reservations for a few nights that week - That's right Mr. Sticky - I'm coming back!!! Thanks so much for making our getaway weekend so wonderful!!! I can't wait to come back!!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Avalon, New Jersey", "Title": "“After all these years still what I expected-terrific!!!!”", "Author": "avalonlion", "ReviewID": "UR124128918", "Content": "My girls & I stayed here many many years ago. We enjoyed it so much that I recently booked a long weekened for me & my boyfriend. It was just as great now as back than if not more-we had an outside room which I knew ment that we had to walk around to get to the indoor pool & bar but it was so worth it-price was cheaper & the room was more private, Could not have asked for more & will be returning. Oh & I forgot to mention that we were well situated between 2 sports bars during the football palyoffs!", "Date": "February 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Gettysburg, Pa", "Title": "“Some good some not so good”", "Author": "PattiJ52", "ReviewID": "UR122465894", "Content": "Stayed at Quality Inn Oceanfront Dec 27th for 3 nights. The room was very large and spacious , it had a dishwasher, large refrigerator, stove, microwave, toaster, dishes etc.For the most part it was clean, except the tub and the coffee pot. The closet door was off the track, the remote for the TV didn't work even with new batteries, and a lamp was broke in 1/2. The bed was cheap and very uncomfortable. The balcony looked over the atrium, where there was a cafe, swimming pool and birds. Late night noise coming from the swimming pool was noticable even though we were on the 3rd floor. The room had an exterior extrance and the light outside was very bright which made the room too bright at night. Had to cover the window with a towel. Our room was on the 3rd floor and there was no elevator, had to climb 3 flights of exterior stairs to get to our floor, being handicapped this was a difficult task. There was no breakfast at this hotel, but apples and over ripe bananas were available in the lobby. There was coffee and tea in the atrium. Never being to the area before, I assumed an Oceanfront hotel with a balcony meant that the balcony looked out over the ocean, when it actually looked into the atrium. All in all when it comes to hotels, my main concern is that it is clean. The room itself was very clean except for the tub which had hairs in it, the coffee pot had not been cleaned and had dried coffee in it. I striped back the bedding to check the mattress and it was clean, although about the cheapest mattress I've ever seen. I wouldn't stay there again due to the lack of an elevator and the bed being uncomfortable. I think it would be a nice place for a family to stay if their main interest was being on the beach most of the day. The large room and kitchen were a plus and would be nice if you wanted to eat in. There is a nice area to sit outside your room in the good weather.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Never going back”", "Author": "BRK28970", "ReviewID": "UR121102679", "Content": "The pool was toxic, smelled horrible, one young boy passed out and drowned, only to be resuscitated -- the whole place left a disgusting smell on our clothes and hair. The hot tubs especially stunk. Like no chlorine in the pools. Roaches in the rooms, doors had to be forced, We had to come home and throw everything into the washer because of the horrible smell. My guess is that the hurricane messed this place up big time. This used to be our favorite hotel but we are never going back.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Dirty, Unkept, Old Hotel”", "Author": "duckiebell", "ReviewID": "UR120781177", "Content": "I thought this would be the best of the Quality Inn Hotels in the ocean city area since their room prices were a bit higher than the other two but this hotel was actually the worst. I first took notice upon checking in at the front desk how old he hotel looked. When we entered our room it did not give me a warm welcoming feeling at all. There were large pieces of molding trim missing from the dresser, the chair had large stains all over the upholstery, there was a black hair in the bathtub, a 3 inch rip in the bedskirt and the furnishings were all outdated. The tv was the large boxy type with very poor reception. The picture was snowy the whole time. We paid for an oceanfront room and the website played up this atrium lobby they have which I thought would be appealing but even on the top floor we could hear the parrots squalking loudly. Thank goodness they cover them up at night to quiet them down. Don't try napping during the day though. I left the bathroom light on with the door partially closed to use as a nightlight. When I got up in the middle of the night there was a roach scattering across the bathroom floor. Mind you I had not just turned the light on...it had been left of so if this critter was bold enough to be out in the light I am sure there are more of them. The king size bed was so uncomfortable because it sank down in the middle. Even with 2 people sleeping on either side your body kept rolling toward the middle. I slept poorly because of the bed and the roach spotting. I would never recommend a stay at this hotel even if it is on the ocean.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pasadena, Maryland", "Title": "“very pleased with accomodations and staff”", "Author": "mary k", "ReviewID": "UR119957282", "Content": "the room was very clean and staff very friendly. this was our third visit and we have always been pleased. the atrium and pool area very inviting on Saturday we had lots of wind and rain, it was the weekend with the Nor'easter. We had ocean front and a beautiful view of Mother nature's fury with the wind blown seas. Also use of computers and wifi. FRESH HOT COFFEE EACH MORNING AND FRUIT GREAT FRIENDS WEEKEND. READY FOR ANOTHER ONE!!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seaford, Delaware", "Title": "“Wonderful vacation”", "Author": "Liam M", "ReviewID": "UR118777179", "Content": "Love the atrium, Tina, the lady that takes care of the birds was very friendly and knowledgeable. The front desk staff were friendly and helpful (recommended several local restaurants and we enjoyed them all). We love the fact that the rooms have kitchens in them and the dividers between the beds and sofa bed are a nice feature for travelers with children.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brandywine, Maryland", "Title": "“Awesome atrium....GRUMPY STAFF!”", "Author": "kcard82", "ReviewID": "UR118762038", "Content": "The atrium of this hotel is its saving grace. It kept my kids entertained for hours when it was raining the morning after we got here. Also, the location is also great, I love being right on the ocean and listening to the waves at night. I liked having a kitchenette but the second night I was here ANTS were crawling on the countertop. One thing that I noticed most of all is that the staff is SO INCREDIBLY GRUMPY! The only nice people are the ones who staff the Atrium Cafe. That's it. Everyone else has a stick up their you know whats. I went to the front desk to ask a question and one of the staff members was on the phone with a customer and he was rolling his eyes, banging his fists and throwing his hands up in the air. It was really uncomfortable. The girl who came to feed the birds (who looks EXACTLY like the hiccup girl) barely made eye contact with anyone. She was just generally pissed off. Then, when I came to the front desk to return the movies, I saw a woman sitting at a desk, I said \"hello!\" 3x and she completed ignored me. Then, some other grumpy dude came out and took my movies back. It seems like the people who work here get a rise out of being jerks.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Taylor Mill, Kentucky", "Title": "“Rooms are Complete Dumps!!”", "Author": "Travelogists2", "ReviewID": "UR118430748", "Content": "We choose to stay in this hotel due to the great price, location, and photos online. The outside area and atrium area are very clean, orderly and pleasant. Our room however was disgusting, the doors wouldn't open without using force. The room was disgusting with other people's bodily hair in large piles in the corner of the bathroom, large gaps under the electrical plates, and stains on the chair. We called down to the front desk when we realized our door wouldn't lock properly waited over 20 minutes until my husband went down to get someone when the lady working at the desk told him she hadn't even called it in yet and told us that the door not locking wasn't a big deal. Eventually they switched our room but had the nerve to ask my husband if they needed to clean the room since we had only been there 4 hours. I would advise anyone looking at this hotel not to stay there under any circumstances unless you want to reside in flith.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Shippensburg, PA", "Title": "“Disappointing”", "Author": "OceanCruiser60", "ReviewID": "UR118317843", "Content": "Did like the Atrium, birds and fruit baset available. The rooms (at least the one we stayed in) really need attention. Blow dryer would work for a few minutes and quit and then start again. Tried to call the front desk to discover the phone wouldn't work. Had to send husband down to front desk. In their defense they did send someone up with a new blowdryer and phone within 10 minutes. Of course this was September and off season so they weren't that busy. The room smelled awful (moldy, musty) I could hardly stand the smell. The air-conditioner termastat did not work. You could turn it up to 90 and the air conditioning wouldn't turn off. It just ran and ran and the room got colder and colder. Had to turn it off and on to be comfortable. The screen door to balcony was off track as was the glass sliding closet door. As for cleaning, someone came in every day and made the bed and replenished towels but did nothing else. Kitchen table remained dirty, nothing was dusted or cleaned the entire week. We just tried not to look around too much. Very difficult even for two people to use the tiny table to eat on. Took food for breakfast and lunches but it was difficult to get out food and use the table. I would give it a 1 star rating but gave it 2 stars because of them taking care of our phone and dryer so quickly and the atrium. It does not deserve the high rating it has and will not stay here again.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Slatington, PA", "Title": "“OK”", "Author": "dawn1226", "ReviewID": "UR117654209", "Content": "Room was nice and was clean. Front desk staff was terrific. Nice big basket of fruit available to us all day every day. Pool and outdoor bar was also great. I wouldn't go in their indoor spa if you paid me....looked rather dirty. Right on the beach...really nice, price wasn't bad. Great location around 58th St. as I recall. Downside....my car was dinged immediately upon arrival...as we were checking in. Parking spaces could be a little bigger--they're rather tight. Watch out for the guy lingering in the stairwells....swear he was there every single time we came and went...sitting on the steps with his cell phone...not working--hope they fired him...he was creepy.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“What a Disappointment...”", "Author": "GreatAunt_11", "ReviewID": "UR117631561", "Content": "The check-in area is less than inviting, the person that checked us in was professional and friendly. The outdoor pool is in front of the hotel between 2 parking lots so there is no covered area to drive up to the front door. Luckily we had an Oceanfront room and could use an elevator once we were checked in, because there is not an elevator for the Atrium rooms only stairs from the front of the hotel. I guess that's why there are only pictures of the back of the hotel on the website. Not suitable for anyone with the least amount of stair climbing problems. Our \"suite\" was small and not the best. Although I believe that after reading some of the reviews (which I wish I had read before we booked our suite) that our room had been renovated. Obviously not a 1st class job. The a/c was on 66 when we arrived and the room smelled like cinnamon clearly in an attempt to cover up other odors. The spigot in the tub had enough black crud / mold you could see through the plastic that it was sickening. When we returned to the room after dinner the first night and switched on the light there was a huge roach in the sink. The birds in the lobby were so noisy that it was impossible to sleep. The only elevator the guests could use was impossible, so slow we had to wait and everyone complained about it. The heated pool in the Atrium was not heated, too cold for anyone to use even the children didn't stay in it. The hot tubs were filthy. The tile floor going to the elevator was always wet and slippery. The doors to the beach stayed filthy. The free beverages were not always ready or available when they should have been. There was an old blood stain on the comforter which was addressed quickly. The outdoor pool was okay but the kiddie pool was awful. One of the guests said that her children were calling it the kiddie swamp. I have to agree with them. For the most part the staff was less than welcoming. The person that checked us out was neither professional or friendly and could have cared less about our stay or if we were coming back, which I can assure you we are not! We had a wonderful view of the ocean but the price was too high for these less than \"quality \" accomodations. I notice that the slogan for Quality Inn is\" Get a lot for a little\" well we \"got a little for a lot.\"", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Atrium Room Means No Elevator and No Help”", "Author": "travelingdoc42", "ReviewID": "UR117604930", "Content": "Beware that most “Atrium” rooms are up one or two flights of stairs. There is no access to any elevator for these rooms. Also this hotel will not help anyone carry bags (no bell staff & not something front desk staff offers to do). More expensive “Ocean View” rooms are all accessible by elevator. Ocean View rooms cover 5 floors and served by a single very slow (& usually dirty- but that is probably more a reflection of cliental & sandy beach than hotel) elevator. Hotel rooms are very old fashioned but do include range, microwave, refrigerator and automatic dishwater. TV was an ancient CRT type with poor reception of most channels and no reception of channels like FOX news. Front desk just blamed Cable Company and was of no help. Mold on ceiling activated my wife’s allergies. Water pressure was very good & there always was plenty of hot water. Room was very quiet, even though hotel was full of a lot of families. Free coffee was available around the clock. The Wi-Fi was free & fine. There was no desk, but there was a tiny kitchen table that made do. The Ocean view was fine. The hotel is 100% non-smoking and does not allow pets…. 2 positives for me but negatives for some. Parking was abundant, convenient and free.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York", "Title": "“Awesome location!”", "Author": "keywest06", "ReviewID": "UR117445739", "Content": "We reserved an oceanfront room at the hotel and it was right in front of the sand dunes with a private balcony that had stairs to go onto the beach. The room was large and clean and we had plenty of towels. We also loved spending time at the pool outside, which was large and had plenty of chairs. The Atrium was a treat too-I had a fun time going to see the parrots. The only problem was-we had to be evacuated because of Hurrican Irene and had to cut our trip 2 days short. We will definitely come back. :)", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“new summer vacation spot”", "Author": "raydo88", "ReviewID": "UR116983226", "Content": "The price is high for peak season. we stayed for 4 nights at 279 a night. But my 5 yr old had a blast, from getting to sleep in his own sofa that turned into a bed (he truly loved it), to the parrots and talking to them everyday, to swimming or going right to the beach. Had a first floor atruim side room w king bed. This was not a problem but if you get 2 or 3 floor atruim side you have to walk up steps on the outside to get to your room. the room was clean but there was one problem the sleeping area to the kittchen, the floor was raised up and was a trip hazzard (it was raised by at least 1-2 inches). Check in was not a problem (got there at 12:45 pm and room was ready for a 3:00 ckeck in time) and check out was less than 1 minute. I'm sure their are plenty of places to stay at a cheaper cost. But I know where the family will be booking for next year. Need to be a tad cheaper", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Newark, Delaware", "Title": "“Pleasntly Surprised”", "Author": "mal", "ReviewID": "UR116809663", "Content": "OK, so I regularly stay at a Quality Inn in College Park for business and it's fine for business, but not a place I'd take my wife, so I was a bit hesitant to book at a Quality Inn at the beach. However, this place was really decent...the room was clean, the bed was super comfortable, and the location was pretty decent (within walking distance to Seacrets and Old Pro golf). I split this reservation between points for one night and pay for the other, so I booked over the phone at 1-800-choicehotels (or whatever their number is!). it was a real struggle to try and get the same room for both nights (and a 1st floor beach front room)over the phone, but when i called the front desk at QI they were able to do this very quickly (and were very friendly about it!) having the beach front room was cool--you walk right out onto the beach! however, you still need to have somebody go through the hotel (unless you want to leave your patio unlocked) :) the other thing about having the beach front room was that it was an \"accessible room\" so it had a handicapped shower with a pretty sucky (low-flow) shower head, but it was no big deal. also, one other nice thing is that there are $1 coke machines througout the property... overall, i would highly reccommend this hotel", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "PA", "Title": "“great location and atmosphere”", "Author": "queenhs1", "ReviewID": "UR116593154", "Content": "The night manager was wonderful from check-in til check-out! The beach at this location is not as crowded as the boardwalk area which is why we enjoy being here. The rooms are clean and spacious, but could use some updating. There is plenty for the kids to do and just a great atmosphere.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Rising Sun, Maryland", "Title": "“Kids loved it. We will return.”", "Author": "Jennifer B", "ReviewID": "UR116560904", "Content": "When I first pulled into the parking lot I was worried. The outside is a little run down. But once I was in the door I was very pleased. The room was large, clean, and as described in the listing. They have 2 pools (one indoor and one outdoor). The outdoor pool has a nice little bar. The beach was great. Easy access, clean. My kids just loved Dylan, a bird that lives in the Atrium. When we checked out, they offered to let us continue using the beach and parking lot for the day and the use of their showers at the end of the day. I will definatly go back.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Aging gracefully!”", "Author": "Decembergem7", "ReviewID": "UR116289261", "Content": "My kids love the many things to do here...indoor/outdoor pool...game room...several public jacuzzi's...play area for toddlers...good pizza & just a few steps and your on the beach!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Rosedale, Maryland", "Title": "“ok, but not my 1st choice again”", "Author": "Michelle20113006", "ReviewID": "UR116273448", "Content": "We just visited here for a quick vacation. I wanted oceanfront and was able to get a room here. We were on the 2nd floor. It was fairly quiet and I could not hear any noise from the neighbors. We did hear the birds in the morning when the lady who cares for them lets them out, but that is part of the tropical atmopsphere and we liked it. The birds are in the cage all the rest of the time. They talk more when out. They do not typically fly around but visit one another(when out of the cages). I must say my husband and I stayed here some 20 yrs ago and it was a great place then. Since, many newer hotels have been built. This hotel has been updated,but it still shows the wear and tear the ocean and many visitors can bring. I feel the beds could really be upgraded and the room furniture as well. For the money you pay you expect a better QUALTITY. The rooms are tight,especially in the kitchenette area as they have a table and 2 chairs here,nice but very tight. We did not use the stove or microwave and not sure I would want to. The stove was little rusty and grimey. We never had touble parking, they have a large lot,however checking in you have to pull up as close as you can,bring out the luggage rack and then go park you car. There really is not designated place to do this and you block others in. There is a nice indoor and outdoor pool. The Atrium cafe is right there for a quick snack. Overall- pro's- oceanfront-can't get any better then that. clean tropical atmosphere quiet a/c Con's- outdated sand everywhere-yes I know your at the beach-but I have stayed elsewhere and they manage to keep up with it hard to get in to register-a few parking spots for checkin would help if you stay in Atrium room be aware there is no elevator in side, you must take outside stairs to your room. my kids loved walking through the atrium area seeing the birds,fish and turtles I loved being right on the beach.", "Date": "August 4, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“HORRIBLE AND DIRTY”", "Author": "monisec", "ReviewID": "UR116186886", "Content": "When I booked my room I was told that the oceanfront rooms had been renoviated! When I got there I knew as soon as I walked in that i had made a big mistake!! This hotel is dirty, old and smells damp. The carpert is dirty, the tub had rust, the toilet made a loud noise whenever you flushed it. The elevators are soooo old, and small I was scared to ride in them but I had to. The game room SMELLED LIKE URINE!! DONT FALL FOR THE PICTURES THAT YOU SEE!! What a waste of money!! The lobby looks dirty and run down!! If you like a nice clean, upgraded and nice smelling hotel this is not the place for you!!!!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Gettysburg", "Title": "“Nice hotel”", "Author": "kae23", "ReviewID": "UR116174442", "Content": "We stayed one night after staying 2 nights in Rehoboth Beach, DE. We asked for a early check-in and was given permission to enter the room when we arrived at 1pm. Our room was right by the beach access door/elevator; if we were there any longer I would have asked for a different room. The lobby was beautiful with decor' and the birds in the middle were a cool effect. I am not a fan of birds and was glad to see them caged. The kids were impressed with them. The indoor pool area was loud at night which I thought I might have had to contact Front Desk but come 10pm it was very quiet. The room was clean. The carpet in our room was in very good condition, esp. for being on the first floor with access to the beach. I would recommend this hotel to others. It was a good location and had bus access coming and going down to the pier.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Exceeded our expectations! Great Beach hotel...”", "Author": "dianew1", "ReviewID": "UR115936238", "Content": "My husband & I arrived on Sat Jul 23...a bit early, & we were told our room wasn't quite ready which we expected. The front desk was extremely friendly & offered to call us when our room was ready, which they thought would be 1:00pm. We went to the beach in front of the hotel & rented chairs & an umbrella. Hotel called us at about 11:30 & our room was ready for check in! The lobby is fun! Tropical birds, fish, an indoor pool & bar...great for familes :) Our room was lovely..& a nice balcony with perfect view of the ocean. The next morning, from our balcony we saw many, many dolphins in the water in front of us! A great show! We drove down to 1st St in Ocean City to walk around the boardwalk and hang out...very fun! Do not hesitate to stay at this Quality Inn!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Albany, New York", "Title": "“Excellent Customer service”", "Author": "Guayopari", "ReviewID": "UR115933109", "Content": "We stayed here July 14 through July19 and we couldn't be happier with the location, accommodation and customer service. The night manager Melody upgraded our room to an ocean view which made our stay that much better. The resort is right on the beach. Access to the beach was a sinch. The room was fine, perhaps a bit dated but it was clean. I love that it is away from the boardwalk and from all the commotion but close enough if you do want to go (short drive). I would definitely stay here again.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“What a View”", "Author": "Pghjanedoe", "ReviewID": "UR115690913", "Content": "Decent place for the money. We had an oceanfront room and LOVED the view from the nice sized balcony. The staff for the most part was very nice. Regina cleaned our room daily and was efficient. We had a malfunction with the screendoor leading to the balcony. The maintinence man tried to fix it but couldn't so he replaced it with a new one. Thank goodness! We loved the smell and sounds from the ocean since we were so close. There are large tropical birds (in cages) in the atrium. Kids seemed to love them. Someone mentioned they made a lot of noise in a previous review of this hotel. They did make noise BUT only during the day and I didn't find it annoying at all. It kinda added to the whole tropical effect. One of the few places I have seen with an indoor and outdoor pool. We would stay here again for sure.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Would stay again”", "Author": "clevelandgirl99", "ReviewID": "UR115555188", "Content": "Stayed for a week with an 11 & 13 yr old. Location was great for us. We took bus to boardwalk a couple times and drove to Delaware for dinner once. The outdoor pool was clean and it was nice to have the option of getting a drink or snack poolside. The indoor pool was dark and seemed a bit dirty. (People need to rinse sand off themselves before going in a pool!) Was nice having a kitchen. Was small but worked well for breakfast and lunch. We were on 5th floor and the view was great! Housekeeping was wonderful. Front desk staff was very friendly. We liked having fruit available to us all of the time too. Small thing, but a nice touch. My negative comment would be that the mattresses were not comfortable. I agree that the hotel could use some sprucing up, but I also realize that it is very difficult to keep a hotel right on the beach clean and fresh all of the time. Overall we were all very happy with both the hotel and it's location", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "West Haven, Connecticut", "Title": "“Holy Great Vacation Batman!”", "Author": "TheTrupps", "ReviewID": "UR115228513", "Content": "We usually travel from CT to Wildwood NJ, (the past 10 years) we decided to try something \"different\". We came across this hotel by accident (Good thing we did) using the Choice Hotels main corporate site because of my employer's discount. Let me start off by saying, I have traveled all over the country and stayed in all classes of hotels, the staff at this hotel was without a doubt one of the BEST I have ever encountered. Traveling with two daughters (ages 6 and 12) can get on the nerves of even the most patient of parents. The Atrium with it's birds, fish and turtles is amazing! It gave the girls something to do in the interim while mom and dad gather up the stuff for the days activities or (try to steal 10 minutes alone) LOL! The pools were VERY CLEAN!, Nice temperature and never crowded. The Atrium Cafe' was a nice stop for a quick bite or cocktail and had a very friendly staff. We chose a King room on the first floor opening into the atrium. I would say it was a great choice. The bar was only steps away along with ice cream and \"Virgin\" drinks available for the kids. The first floor rooms on the Atrium side also offer a greater sense of \"security\" than most \"ocean front\" hotels. Access to the rooms means you have to pass the lobby or cafe' before getting to the room definately a plus for families. The staff was more than willing to offer suggestions on dining, entertainment etc. and when they had no personal experience they actually told you that rather than just throw you some \"tourist trap\" suggestion. One other thing that impressed me as an experienced traveller, the front desk staff actually asked me how we enjoyed a few places that they had not experienced yet, this not only showed that they cared about OUR stay but wanted feedback for future guests. Another personal touch, my 6 year old accidentally left her custom embroidered beach towel (hope her Grandma doesn't read this) at the pool. We asked the next morning about it and instead of them having just thrown it away or placed it in some box under the counter, it was returned to our room WASHED, DRIED, FOLDED and wrapped in plastic!!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Altoona, Pennsylvania", "Title": "“Loved it!”", "Author": "Kathy215", "ReviewID": "UR115222618", "Content": "This hotel was wonderful. We could see the ocean and the beach from our balcony. 5 feet from walkway to beach. It was very clean and the staff were amazing, even though they were very busy over the 4th of July. The Atrium was a great added bonus. Kids seemed to love it especially when they let the birds out of their cages and they fed them out of their hands. I will definitely go back again.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Perfect spot for family with kids!”", "Author": "evandust10", "ReviewID": "UR115028766", "Content": "My family recently stayed from june 26th to july 2nd. The hotel is right on the beach and only a short walk from the hotel. Oceanfront is definately the way to go. The view of the beach is great and if your with your family you can see them on the beach from your balcony .If you lug alot of stuff to the beach like our family, this is the perfect spot for you.The hotel caters to families and my 4 children, (ages 18 mths to 8 yrs old) loved the stay. The rooms aren't the best of the best, but are clean and room service comes everyday and cleans up your mess. The outside pool was great cause there was a bar right next to it and me and my wife had some nice cocktails as the kids played in the pool. For the location, amenities,and price we thought that the hotel was a great stay. I looked into the holiday inn on the boardwalk but an oceanfront room there was over 100$ a night more. We will definately stay here again.1500 for an oceanfront suite for 6 night.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Northern Virginia", "Title": "“Underwhelmed... it was below average”", "Author": "midatlantictraveler1", "ReviewID": "UR115026289", "Content": "I came here with high hopes as I am a fan of many of the nicer Choice Hotels properties. This one, unfortunately, disappointed. Pros: Beach location, Coffee, tea, hot chocolate 24 hrs, nice outdoor pool, view is great, rooms are reasonably soundproof Cons -- listed below, mainly housekeeping and maintenance issues While the location is good, no place in this hotel (rooms included) had the \"new and fresh\" look and smell that draws guests back. The atrium area, while creative, is tired and dated. I kept wondering when the hallways and common areas would be cleaned when we were there. The atrium floor stayed dirty, the hallway on the third floor (oceanfront building) stayed dirty the entire weekend. Restroom by indoor pool was DISGUSTING! I don't quite know how to describe the smell in the lobby area -- but it was not pleasant either. I saw virtually no one using the indoor pool when I was there, and when I felt it was cold, I knew why. Kitchenette area (to include ceiling, walls, floor) was covered in greasy film, and stove was falling apart (literally). Air conditioning and bathroom fans are so loud as to be virtually unusable. That was room 306. I didn't check the brand on the bed mattresses, but they are absolutely the cheapest, poorest quality I have slept on -- even Motel 6 has better. You can feel every spring, and I don't even think they were old. This place sells itself as upscale, which it definitely is not. They even have their own marketing brochures and website to portray this. It's misleading.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Maryland", "Title": "“Outstanding”", "Author": "gillivray", "ReviewID": "UR114966193", "Content": "This hotel stay exceeded my expectations. The hotel staff were professional, helpful, and friendly. The location is perfect, the room and common areas were very clean, and the amenities were just right. We arrived early (10 am) to take advantage of a beautiful day on the beach. I requested an upper level room away from the birds, thinking their noise might bother us in the morning. The receptionist took my cell phone number and called when our room was ready at about 11 am. Nice! They gave us the room on the south end where we had the added bonus of a window in the living area (sofa and TV) thus making it ocean view! Our room was VERY reasonably priced- $116 with the AAA discount. This was the building that they call the atrium, meaning the rooms overlook the indoor portion of the hotel where the indoor pool, koi pond, tropical birds (5 or 6 in separate cages), and indoor bar/restaurant are located. This is the \"original\" building that has obviously been updated as the room was lovely. At some point they added on the oceanfront building, thus enclosing the atrium portion between the two buildings. There is not an elevator for this original building, however there is an elevator for the oceanfront half. The outdoor pool is lovely and also has an outdoor bar with seating and music. The pool is in front of the hotel, on the opposite side is the beach. Our room was large, with a full kitchen, king bed, and living area with sofa and TV. The bathroom was quite adequate, no temperature problems with the shower, no smell or dirt of any kind. Parking was not a problem and when we checked out the following day they said no problem, park and stay to enjoy the beach as long as you'd like. We brought breakfast foods and snacks and drinks and went out for dinner at Fager's Island which was fantastic. We were lucky to be there on a beautiful evening with a perfect sunset. One of my favorite things about the hotel was laying on the beach and being able to go inside for a frozen drink to take back to the beach. They also have a huge basket of fresh fruit at the front desk, plus coffee near the exit to the beach all day long. We didn't use the exercise room but I would if we had stayed longer. Again, the staff were all so courteous and plentiful, helping at the front desk, sweeping and cleaning the common areas, making everything lovely for the guests. The guests were also very polite and friendly, no problems with any inappropriate behavior or comments or anything. We had a second floor room, so we did hear some noise above as we were settling in to get to sleep, which seemed typical from other places we have stayed where we had folks above us. I would highly recommend this hotel and can't wait to go back!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edgewood, Maryland", "Title": "“Grandchildren's fun days”", "Author": "effyfay", "ReviewID": "UR114919265", "Content": "We have been coming here for the past seven or eight years. It's always clean and has everything we need. This year the Kids forgot their toothbrushes and we were supplied with them!! They have remolded and it's very nice. I like having coffee when ever i want it, it's on all day. We really enjoy the Birds too.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Reading, Pennsylvania", "Title": "“Will definitely stay here again!”", "Author": "harlygrl", "ReviewID": "UR114870125", "Content": "My husband & I stayed here for a weekend trip. I am usually not a fan of Quality Inns from past experience but I was very impressed with our stay. The rooms were very clean & had everything we needed. The staff was friendly & very helpful with any & all requests. I truly recommend you stay in an oceanfront room. The sunrises are beautiful & if you are lucky enough to be there during a full moon that is gorgeous as well. The morning breakfast in the atrium restaurant was just enough before heading out to the beach. I will definitely stay here again!!!", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Service": "4"}, "AuthorLocation": "Downingtown PA", "Title": "“Very nice hotel on the beach!”", "Author": "DeeDeeDowningtownPA", "ReviewID": "UR114811375", "Content": "Just got back from a four day stay with my hubby from June 23-26 at the Quality Inn Oceanfront and it was a very nice hotel. Check in was very fast and the staff were very nice. Hotel was very clean and nicely kept. We had a oceanfront efficiency executive room with a king bed and it was very nice and pretty big. We were on the third floor with a very nice view of the beach and ocean(really pretty). Had a nice balcony with a table and chairs. You could just go out from the back of the hotel and you were right on the beach. Had a very nice outdoor pool with a pool bar and deck with tables and high top chairs.They supply you with towels for the pool areas. There is also an indoor pool and 2 hot tubs in an atrium area with a bar and grill, pretty birds in cages, ponds with fish, and rooms overlooking these areas. There is a game room, fitness room and some nice lounges for reading and just relaxing. Had a area where you could get coffee throughout the day and fresh fruit out in the lobby. We had a very nice time at this hotel and would definelty stay here again.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Johnstown, Pennsylvania", "Title": "“Reviews and Pictures very deceiving!”", "Author": "momofboys2005", "ReviewID": "UR114714377", "Content": "This hotel is not as wonderful as some of the reviews will have you believe. Unfortunatelly, we went by the reviews and I wish we had stayed somewhere else. The room that we had was room 301.......beautiful view of the ocean which was the best part of this room! The room was small - not at all like the spacious pictures on line. The room we were in needed updated really bad! The room was clean, but not as clean as a Mom of little kids would like it to be and after the first day, it seems like housekeeping gave up and just made our beds. The bathroom was really bad (and it smelled like mold or musty or a damp basement!) The water in the shower kept changing from freezing cold to scalding hot - I was very worried about our kids being in there! Also on the second day, the toliet paper holder broke and they never fixed it. The screen to the balcony also broke and my husband fixed it himself thinking it would take too long to wait for someone else to do it. The refrigerator worked, but everything kept getting wet because water kept dripping from the freezer and we didn't even have anything in the freezer! The beds were not very comfortable although the kids didn't seem to mind them. The Atrium is nice and the kids got a kick out of the birds. The indoor pool was very cold and we didn't go in the outdoor pool. The hot tub was VERY hot and the sides of it were stained so it looked dirty. My husband said it probably wasn't because when he sat on the side of it with our boys he said that he could smell the chlorine. All in all, I would have to say we took it up the ol pooper because the room was definatelly not worth the money we spent to stay there (219.00/night) and now that I know better, I will never stay there again.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Frederick, Maryland", "Title": "“Wouldn't stay there again - very disappointed”", "Author": "merz1995", "ReviewID": "UR114642759", "Content": "My boyfriend and I spent a long weekend June 18-20, 2011. The room was clean, but the kitchen area and bathroom are badly in need of updating (rust, leaking spigots, drop ceilings). I had the worst shower in my life, the water fluctuated every couple of seconds between scalding and freezing. The whole hotel looks older and a little worn out, but the worst part of staying there for me was the parrots in the atrium. They squawk and shriek really loudly from 8:00 a.m. to about 8:00 p.m. - its deafening in the atrium/bar area, and you can still hear them in your room. With all of the large hotels in Ocean City, I wouldn't stay here again -", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "alexandria, virginia", "Title": "“Bottom floor, oceanfront, convenient beach access”", "Author": "esdugo", "ReviewID": "UR114622802", "Content": "My wife and I stayed at the Quality Inn Oceanfront @ 54th St in OC from June 12 - 15, 2011. The hotel provided everything we expected for a couple days at the beach. For me, its all about location and convenience from room to beach and this hotel is as close to the beach as you can get. Its also small enough that you dont have to navigate through a maze of corridors, hallways and elevators to get from your room to the beach like you do in many of the mega hotel/resorts. That is why I prefered to stay on the bottom floor, room 116, second room from the end and adjacent to the side entrance door. Parking spots are just a few feet from the side door, which made loading in and out a breeze. The bottom floor rooms are actually elevated up 7-8 steps from the sandy area right below the balcony which does have a slight ocean view despite the sand dunes situated between the hotel and the beach. This is very convenient since we just left the sliding glass doors to the balcony unlocked and were able to come in and out of our rooms throughout the day without ever having to go inside the hotel or ride an elevator. We just locked all our valuables in the safe and closed the drapes and really did not worry about anyone coming in the room and staeling our tub of popcorn. Nice to have a full sized fridge and kitchenette with all the basics. A/C worked well, bathroom functioned properly, although not roomy enough for two people at once. 2 double beds were adequate, I had to ask front desk to send maids to flip mattress after first night and that helped my back a little. The springs in my mattress were shot and very squeaky, it needs to be replaced. Its a shame that many hotels dont buy higher quality mattresses and have them replaced when they are worn out. It was evident that this was a very low quality mattress. My wife did not have any complaints about her mattress so it could have just been that one. The TV and remote functioned properly although it needs to be upgraded from the big box tv's of the 1980's to a flatscreen HDTV commonly found in hotels today. It would also be helpful to have a channel line-up guide printed out on one sheet and laminated for all guest rooms. The on-screen scroll guide did not always work and frankly is just way too slow in our fast-paced instantaneous electronic world. I made this suggestion to a front desk clerk and she thought it was a great idea and would pass it up the chain of command. Very small details, I agree, but its the little things that separate a good hotel from a great hotel. The pool area was very refreshing, perfect water temperature. pool towels provided, lots of lounge chairs, and tables with umbrellas for snacking. Nice landscapping with flowers, bushes, and some trees to block the late afternoon sun. One day, the outside pool bar was open with some musice playing and beverage service. It would be a bonus if the hotel provided a few floats to relax in while in the pool. The one thing that caught my attention and really needs to be addressed by the maintenance staff is the issue of cigarette butts and trash. I believe the entire hotel is non-smoking, so most guest smokers go out on thier balconies to smoke. When finished, they just use the sandy area below as their ashtray. Between the back of the hotel where the lower floor balconies are and the sand dunes, there is a a 20-foot wide area of sand with 10 palm trees planted, which adds a nice island feel to the surroundings. All throughout this sandy area between the palm trees are thousands of cigartees butts which I had the displeasure of walking through many times a day during our stay. In some areas, it looked as if entire ashtrays with dozens of butts were dumped in one pile here and there. I saw several employees watering the plants nearby, but never did I see any of them pick up any trash or rake up any cigarette butts. May I suggest to the hotel manager to furnish each balcony with a \"cigarette tower\" for extinguishing the smokes and to include raking up all cigartees butts in the sandy area as part of the daily maintenance routine. When I visit next time , I will report back on the progress that has been made in this area. This will really enhance the aesthetics of the hotel and convey an image that an effort is being made to counter the pollution made by thousands of sloppy and inconsiderate guests. My overall impression of this hotel is positive and I would not hesitate staying here again. With a little fine-tuning and addressing some of the details this could become my favorite hotel in OC. It has the perfect location, a touch of charm, it just needs to be brought into the 21st century with some modern updates and a litlle TLC here and there to realize its potential. Please go and follow up with your experience for all to read. Happy Beachin' 2011 ! Eric D. Alexandria, VA", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hopewell Junction, New York", "Title": "“conveniently located and clean”", "Author": "Will&Michelle", "ReviewID": "UR112491417", "Content": "Stayed here with some friends for a golf outing. The grounds and the beach were very clean, convenient for walking to drinking spots we frequented. Theres a bar/cafe on site which was great for breakfast before tee times, basic menu but convenient. The hotel has a bunch of parrots and other exotic birds that get pretty loud after 8am it seemed and yes they will wake you up if you want to sleep in after a long night of partying, The indoor pool and hot tub were very nice, The hole Atrium concept was pretty cool and the birds are beatiful but loud. The price was very reasonable for a hotel on the beach in oceancity, had no issues with staff and the front desk was courteous. Will return next year with my golf outing", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Rochester, NY", "Title": "“In a pricey town - this place is a bargain! Bring the kids!”", "Author": "AdRock011", "ReviewID": "UR110916071", "Content": "Well my comments here will serve to back up what most reviewers have said about this place. Its really a good deal in a town where you can expect to shell out $$$, in season. We stayed here the week before the Memorial Day rush, and it proved to be an ideal time. Crowds were light, beach was mostly empty... but most important of all - rates were CHEAP. The hotel experience will satisfy all but the most jaded or snobby of travelers. Yes its an older property with a boxy motel design, but care has been taken to dress up the grounds and interior atrium, which is really quite charming. Our oceanfront room was clean, the appliances newer and in good working order. If anything, some fresh paint and new carpets would do a lot for the appeal of the rooms. Same with balcony furnishings - a bit old and dirty. But bed was very cozy, A/C kept room comfortable, and it was a large and bright room. As for activities - if you have kids, they'll have a great time at the two pools, and will get a kick out of the atrium area with the live tropical birds, fish, and turtles. I couldn't keep my 4 year old out of there!!! :-)", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“love love love Ocean City, Maryland!!”", "Author": "Beki007", "ReviewID": "UR107143417", "Content": "The Quality Inn Oceanfront is a dream destination! Everyone is so happy and professional! Our room looked right out over the ocean. Listening to the waves and watching all the fun below was fantastic! The Atrium with all the exotic birds is gorgeous. The location of the hotel is perfectly situated to access all locations easily. This was my 5th time staying at the Quality Inn and I will always make it my home away from home!", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent package for the price!”", "Author": "Dj521", "ReviewID": "UR106030208", "Content": "You get everything you need and want at the hotel. The staff was very responsive to any need and absolutely wonderful! The location is great, pools are nice, hot tubs are cool, and the atrium is awesome!!! I would definitely recommend this hotel if you have kids! There is fresh fruit in the lobby every day and they have more to offer than most hotels! You get so much for a great price! People who complain must be unhappy with themselves because there is nothing here to be unhappy about! Love it!!! Life is what you make it and this hotel makes life enjoyable!!! Thanks so much to all the staff for a wonderful time! Don't wait, call for your stay now- you will be glad you did!!!", "Date": "April 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harrisburg, PA", "Title": "“Our kids love this place!”", "Author": "Karyn1990", "ReviewID": "UR105408025", "Content": "The key to this hotel's appeal is their atrium with tropical birds, two hot tubs, a small pool and a koi pond complete with a cute little bridge. If you can't get an oceanfront room, try to get a ground floor atrium view or else your room will open to the outside on the street side of the building and you have to trek outside to get into the atrium. The ground floor rooms open right into the atrium - a huge plus if it is cold/rainy. There is always a basket of fresh fruit at the front desk and fresh coffee by the doors going out to the beach. Breakfast at the atrium cafe is adequate and the bar has daily drink specials. The rooms themselves are very clean. Ours had a nice little kitchenette with a fridge, stove, toaster, sink, dishwasher and pots, pans, silverware and plates. Most toiletries are supplied (shampoo, conditioner, lotion, make up remover pads, soap), poolside towels were plentiful and surpirsingly nice. The pool itself looked really cloudy, though it was well chlorinated and they do maintenance on it every morning before it opens. A few more chairs in the pool area would be nice too. The kids really enjoy interacting with the birds - a couple of them talk a bit and one dances with you. My only concern is that the place is really starting to show its age and it could use better touch up cleaning throughout the day. Some slobby guests left plastic cups laying all around the pool deck and it was hours before anyone came to clean them up and the atrium bathroom was gross. It may be in the hotel's best interest to have someone keep an eye on the pool area when it's really busy and take care of that kind of stuff. The atrium is usually pretty noisy with kids in the pool during the day and then their partying parents in the evening, but if you are looking for complete peace and quiet in Ocean City, you are in the wrong resort - go to Delaware. Overall, we had a really nice weekend here and we will check this place first for our next trip to OCMD.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Severna Park, Maryland", "Title": "“Why is this # 7 ?”", "Author": "tink50", "ReviewID": "UR103801546", "Content": "First time to Ocean City Md and went by reviews to guide us. Rooms were clean enough but nothing wonderful. Beds were very uncomfortable The Atrium and pool area needed much updating and cleaning. The staff was a mix from friendly to an \"I dont care\" attitiude. The view from the oceanfront room was beautiful but, the balcony had was also in need of attention.. We had dinner down the street at the Holiday Inn and when we first walked in, we wondered two things 1) why didnt we stay here? 2) Why is this rated so far below the Quality Inn Oceanfront. Would not stay here again. If you like the feel of a boardwalk \"motel\" with a view- go here. I cant even imagine what this would be like if it was in season.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bel Air, Maryland", "Title": "“We had a wonderful trip”", "Author": "kndborries", "ReviewID": "UR99546747", "Content": "The atrium was wonderful. My kids loved the parrots and the tropical scenery. The pool party on Saturday night was great. So much to do for everyone and right on the beach. The frozen drinks at the bar were great.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edgewood, Maryland", "Title": "“AWESOME!”", "Author": "Dj_Rick_G", "ReviewID": "UR99517996", "Content": "The management and hotel staff should answered all of my requests (and I had many with 28 rooms in our party) with expedience and professionalism. Something you don’t see in any business anymore. I highly recommend this hotel if you are in the Ocean City, Maryland area. The rooms were accually neat and clean something else you don’t see much in a resort area. Thank you Quality Inn Oceanfront!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“The best mini vacation!”", "Author": "rmdc29", "ReviewID": "UR99073867", "Content": "I am so glad i discovered this hotel. This was our forst time to stay here and will definitely come back.! the hotel staff were VERY NICE and professional. Our room was directly in front of the atrium which was nice because we did not have to get in the elevator to go in the pool and the bar or watch the birds/fis/turtles. I gave the room only 4 stars because we had trouble with the toilet. they did not have 24 hour maintenance so nobody can fix the toilet at night. The staff was very nice to give us the nest room so we'll have a bathroom to use until the next day. Overall, it was a very nice stay!!!!! Definitely going back!", "Date": "March 6, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "maryland", "Title": "“Always Great”", "Author": "alli3", "ReviewID": "UR94277082", "Content": "We have been staying at Quality since 1993 we recently stayed from Dec 27, 2010 to Jan 2 2011 and we had the BEST time ever. The staff the cleanliness and service was great we bring our kids every year this year we had booked 3 rooms and we will continue to stay at the Quality for many years to come we take away so many great memories. They go above and beyond to make your stay enjoyable.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Betterton", "Title": "“Wow a blast once again.”", "Author": "poohzep", "ReviewID": "UR94275374", "Content": "we stayed at the Quality Oceanfront Christmass 2010 week just as we have done since 1993 great family place .clean pool and spa. priced right.staff are very pleasing.plan on returning again. great winter vacation.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Decent”", "Author": "luzsbrain", "ReviewID": "UR87090584", "Content": "Needed a single night stay for a business convention - found this room at a great price. In November the prices are really low. Upon arrival they upgraded us to an ocean front room. The room itself had a balcony and we could see the ocean - it was beautiful! The room also had a kitchenette, which is nice if we were staying longer. There is an indoor pool I didnt know about and the wireless only worked in the atrium and in the rooms on the other side of the hotel, but they gave us an ethernet cable! So that was great! Some channels didnt really come thru clearly, the paint seemed to be peeling in some places and the fan in the room was really loud, but other then that it was a decent stay for just one night The problem with November was that almost all the restaurants in the area were closed for the season.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Comfortable, pleasant, great service”", "Author": "SarahLou48", "ReviewID": "UR86886458", "Content": "My friend and I spent November 5 & 6 weekend at the Quality Inn Atrium and was so pleased with the room, service and ambiance. The Inn created such a happy atmosphere that we simply couldn't stop smiling. The front desk staff responded quickly when we asked for special items like cake pans and we loved the unending pot of coffee and fruit in the lobby. It was a lovely visit.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new jersey", "Title": "“perfect for inexpensive weekend get-away”", "Author": "johnar99", "ReviewID": "UR84770009", "Content": "nothing overly fancy, but service and hotel desk employees very nice and personable; went for weekend getaway with spouse; 2nd time we stayed here; good location and great if you bring your kids since it has a nice indoor pool", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ponce1513", "Title": "“Nice Spot with some cool features”", "Author": "Ponce1513", "ReviewID": "UR84319227", "Content": "We stayed here for a night for a wedding in town. Nice spot ... great location ... awesome ocean views ... stayed in room 419 ... only real complaint was that there were flys in the bathroom ... not sure why because the room was clean ... wasnt that big of a deal ... but i do recommend this hotel ... really cool lobby with birds and fish and a pool both inside and out.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Finksburg, Maryland", "Title": "“Great value, very friendly staff and beautiful view”", "Author": "MonMon31", "ReviewID": "UR83330944", "Content": "We came in late Sept so VERY affordable. When there were no bananas in daily available fruit basket, they were supplied immediately. Housekeeping staff was great (plenty of clean towels) and very accommodating when asked to return when we weren't ready to leave the room yet. Plus they mailed me back my raincoat that I left behind! The bartender was fun! (Get the mini egg rolls as a snack) Frozen drinks were delish! Front desk staff very helpful. And of course the Ocean view! The room was good too and beds were comfy...linens were nice, plenty of pillows. In room safe was useful. Overall our expectations were exceeded. Any hotel in OC has a ton of traffic, gets a lot of wear and tear and generally looks a little rundown, but I didn't get that vibe here. I'm not saying this was like a Ritz, but it will be my go to hotel in Ocean City!", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gettysburg, Pennsylvania", "Title": "“my family loves quality inn oceanfront”", "Author": "rhonda28", "ReviewID": "UR83204541", "Content": "We love the indoor pool and whirlpool, the birds in the atrium, our room, which is ocean front is just enought room for us, a family of three. The Quality inn has a computer room for adults and in the same room has play toys for the children. We came back here every year. We feel like it is our second home. We know the birds by name. My son was able to help feed them. The staff we do anything to accomodate their guests. Besides free fruit and coffee and tea we also recieve a free newspaper. In addition the Inn has an exercise room, free tanning and a game room. We love that we can do our laundry for free. Make sure to try the strawberry and pina coloda smoothies.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Adirondack Foothills of NY State", "Title": "“Delightful”", "Author": "ADKphotobug", "ReviewID": "UR82609981", "Content": "Don't let the parking lot entrance fool you. Slightly dated, but in pretty good shape. Room was clean and bed/pillows were very comfortable. Third floor was great for viewing the ocean/beach. Beach access door was closed due to painting of deck but side door led to another dune crossing. Surprised at how clean this place was considering the amount of sand that can be tracked in. Atrium was interesting ... parrots and a few other exotic birds in cages were sometimes talkative; other times supplemented by \"bird sounds\" from speakers located in the shrubbery. Atrium served a good breakfast at a resonable price. Indoor pool and hot tubs were nice. Outside pool was even better; deep and wide enough to tread water and get some laps in! Very clean and refreshing on this early fall day in Sept. Only complaint: our refrigerator did not work and our delicious leftovers were spoiled. Front desk gave us a $10 credit to our bill without our asking! Let's hope they fix the fridge, though ...", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Syracuse, New York", "Title": "“Check In a breeze, great location, Parrots were special touch”", "Author": "goodeye2", "ReviewID": "UR81503550", "Content": "We enjoyed recent stay \"Sunfest Weekend\". Had 2 reservations when we only wanted one and Ty at front desk straightened it out right away, no question. Room on 3rd floor was very clean, nice balcony over atrium as well as outside (although large tree in front of pool). Parrots were amusing and added a nice touch. All staff was courteous. Exercise room, small but adequate. Walk right from hotel onto path to the ocean. Hot tubs were drained & cleaned every evening. Outdoor pool cleaned every morning. Fresh fruit at front desk all day long as well as coffee & tea. Definately would stay here again...for a late night snack, good pizza,TVs with sports events, try Johnny's Pizza.....1 block down Atlantic.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "cape cod massachuttes", "Title": "“Not so \"quality\" inn”", "Author": "Iammom", "ReviewID": "UR81240612", "Content": "Buyers beware, although when booking our hotel for vacation we had a very pleasant experience with this the rest of our trip was a nightmare. When we checked in there was pubic hair in our bed and all over our bathroom floors. When housekeeping came up they were very upset and confrontational with us regarding our concerns. Although our room was cleaned we were afraid to make our other concerns known due to fear of retribution by the staff. Our room was filled with mold and peeling paint. Our front door looked as though someone had tried to kick it in and the door frame was broken all the way around. Our water temperatures were all over the place as well. We had a beautiful view of the ocean and a large balcony and the atrium of the hotel was very nice with the birds. We were supposed to get credited for part of our stay which never happened and still to this day after several attempts to get someone from customer service to help us we are still being ignored so I feel it very important to post this and my pictures so everyone is well informed before they choose this hotel, as I will never book through this hotel chain again!!!!!!!!", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Blairsville, Pennsylvania", "Title": "“This was definitely a home away from home.”", "Author": "kmack1023", "ReviewID": "UR81050522", "Content": "With many visits to Myrtle Beach and the Outerbanks, I have stayed in several hotels. This was my first visit to Ocean City. The hotel was great. Great location. Room was very clean with fantastic view. Service was very efficient and staff was very friendly. Great room rate. Will definitely stay here again.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dale City, Va", "Title": "“Perfect room for the money . Four Stars”", "Author": "twoofus08", "ReviewID": "UR78966991", "Content": "Very clean room with 2 double beds, sofa & TV separated by curtain (if wanted). The kitchen was tiny, but had frig, microwave, dishwasher, sink, toaster & electric can opener and table w/ 2 chairs. Balcony right over ocean!!!! Only drawback was the bathroom had a small sink with not much room for stuff. They tried to make up for that by adding a shelf above the sink. There were no hooks on the bathrrom door for your clothes, but plenty of towels on the 2 towel racks. Water pressure was very low for my long thick hair . Both indoor & outdoor pools & small hot tub. Free coffee all day long!!!! However, we give it 4 stars & plan to go back next LAbor Day week. When the kids are back in school, it is less crowded for walking & sitting on the beach.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Love Quality Inn Oceanfront Very Nice Inn”", "Author": "Sox4Ever", "ReviewID": "UR78910402", "Content": "My wife and 16 year old son and i travel to Ocean City this past August and having a big problem with Econo Lodge Oceanblock and canceling there we booked here. We were so glad we did cancel at Econo Lodge because Quality Inn Oceanfront was beautiful we love the location the pool and the pool bar was very nice, love the fruit basket they have for there guess so you can take any fresh fruit you like everyday. Love having walk on to the beach out of the back of the Inn. The inside bar area was very nice love ordering drinks and taking them to the beach (pina colada),didn't play tennis but they have two courts if you like playing and if you forget your racket they have some for you to used. The rooms were very clean and very nice, since we book the day before we got there (no thank 's to Econo Lodge Oceanblock ) we couldn't get ocean view rooms so our balcony face the courtyard area which was nice view any way. If we end up coming back to Ocean City next year for our vacation we are booking here again we love our stay at \"THE QUALITY INN OCEANFRONT\" book your stay here you will love your stay.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Reminded us of an old motel”", "Author": "Sewpretty", "ReviewID": "UR77643733", "Content": "We didn't even stay. One look at the room that smelled like stale cigarettes, we got our money back and searched elsewhere!!!!", "Date": "August 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Uhrichsville, Ohio", "Title": "“Pleasant stay”", "Author": "animald", "ReviewID": "UR77233535", "Content": "Our family of 5 stayed for 5 nights in an Atrium view room on the bottom floor. Check in was fast and the clerks were friendly and answered any questions that we had about the area since this was our first time at Ocean City. Our room was clean and comfortable, even though we are used to sleeping on a queen size bed at home. The free coffee bar in the Atrium and free fruit at the front desk were nice gestures. We enjoyed the birds in the Atrium and one got so used to us coming up to him and talking to him that he allowed us to pet him. The cages were cleaned every morning. We enjoyed the pools, even though the outside one was not ocean front. The treck to the lounging area of the beach was a little long. It would be nice if a boardwalk could be installed to make the walk a little easier, especially when carrying a lot of things to the beach. The beach itself was clean and debris free.", "Date": "August 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burbank, California", "Title": "“Beautiful Family Friendly Oceanfront Resort”", "Author": "jackie32123", "ReviewID": "UR76378846", "Content": "This hotel really caters to families with children. The atrium was full of tropical birds, and beautiful plants. There was a little pond with a bridge for kids to watch the fish and turtles swim. The view from our room was outstanding. We were able to save money by cooking in our room each night. The beach was fantastic. The outdoor pool and play yard was great for the kids. Each night the kids played in the indoor pool and game room. The room dividers were great. Each morning I could relax on the balcony sipping coffee and reading, while the kids were still asleep. It was such a nice time for all of us. Can't wait to go back next year.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Excellent Customer Service”", "Author": "PMSheidi", "ReviewID": "UR76364451", "Content": "My family and I have stayed at another hotels for ages but the poor customer service and poor maintenance caused us to look elsewhere. And was a gift! The staff, from check in through check out, cleaning staff and breakfast wait staff were friendly, accurate and customer service oriented. Had an ocean front view- so excellent to watch the sunrise, the surfers and beachcombers. I can't wait to return.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A little pricey but was worth it parking...”", "Author": "Mldibert", "ReviewID": "UR75036036", "Content": "A little pricey but was worth it parking was very convenient. Loved the atrium with live parrots. Loved the pool. Super close walk to the beach with coffee waiting inside the door. Fruit basket available a day long. Top notch front desk staff. Only thing I would add is a waitress in the pool area.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Westminster, MD", "Title": "“Great Place to stay with Children”", "Author": "irishuponastar", "ReviewID": "UR74895388", "Content": "I live this place. The outdoor pool and playground were great. We did not have an oceanfront toom, but didn't miss it either. I could see the indoor pool/hot tubs from my balcony, and I could see the outdoor pool and playground from the porch, perfect with 3 ten yr olds. Desk staff very pleasant (with the exception of one man who never smiled) and the housekeeping staff was very acommadating. Room clean and updated, as was the bathroom. Kitchen very nicely equiped. Towels very thick and soft, and the bedding was obviously new. One of the two mattresses was not so great, but at least one seemed nice and firm. Pool water had some issues, but that was city wide, not the hotels fault. Food was decent for the price, which was reasonable for family budgets. I would stay here again, and plan to next summer. Location perfect for walking everywhere.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Clinton, New Jersey", "Title": "“Nice Hotel”", "Author": "1GolfNut2", "ReviewID": "UR73813094", "Content": "Took an ocean front room. Very clean and cozy. Veiw of the ocean was terriffic. Pull out coach was not that confortable but it's a coach. Everything worked in the room. Had a little problem with the key but the front desk took care of it immediately. One problem, the bar was located in the indoor pool area, my wife and I are not big on chlorine smell. Other than the bar, I would recomend this hotel to my best of friends.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dilltown, Pennsylvania", "Title": "“Many thanks to Mr. Hamrock and the rest of the staff!”", "Author": "OceanLovingLandscape", "ReviewID": "UR73786632", "Content": "Great location, great view, loved the atrium and the birds and the stone work, loved the polite staff, loved the peach trees on the walk to the beach, loved loved loved the ham and cheese omelets at the Atrium Bar...great price and excellent portions, adequate amount of parking. Definitely will be a return customer!", "Date": "August 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bradley, Illinois", "Title": "“Terrible Hotel/Motel -Not worth the money”", "Author": "jcnmac6", "ReviewID": "UR73674219", "Content": "We were expecting a spectacular stay at this hotel after reviewing the comments. It was awful!! The hotel was a motel and we were on the 3rd floor no elevator. The outside balcony made of wood was in very poor shape, ready to fall and DIRTY!! It smelled of garbage on the landing. The room itself was just ok. For 249.00 per night it should have been 100x's better. The indoor balcony over the atrium had outdoor carpeting that was so filthy I would not have put my dog on it. The furniture was also dirty and there was a leftover beer top on the table that stayed there our entire stay. I am sure the balconies are never cleaned. The atrium had 2 hot tubs and a pool that had dirt rings so dark there would be no way we were going to enter them. We also spotted cockroaches around the edge of one of the hot tubs. I had seen the CHOICE commercial on tv that advertised a comfy bed and great breakfast. Very misleading!! Our offered breakfast was at the front desk in a basket- apples and some very ripe brown spotted bananas. This hotel was not worth 249.00 a night. I wouldn't pay 75.00 per night! Due to this experience my spouse and I have vowed never to stay at a Quality Inn or any CHOICE Hotels again. We had stayed at other chains en route to Ocean City , not CHOICE that were 100.00 and under and were beautiful. POOR CUSTOMER EXPERIENCE : (", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Pasadena, MD", "Title": "“Terrific value”", "Author": "granmda", "ReviewID": "UR73663060", "Content": "Made res in high season about 1 mo out. The experience exceeded my conceived notions based on the web site and the pleasant, honest res folks on the phone. The room was clean and was not oversold so my expectations were exceeded. It was spacious and had the view they described including to the ocean. (I recommended 221 on the end.) The kitchen was clean, full size frig (had grandson), stove and well stocked with kitchen \"stuff\" that was clean. We had breaky and lunch in the room. There was a heavy draw drape to separate the bedroom from the pull out sofa, on which the 8 y.o. soundly slept way past his usual rise time, in the living room area. Modern flat screen TV. The bath set up was very complete and the tub caulk was fresh and clean, wow. We had to call the desk on two occasions (nothing untoward) and they were at the door w/ the item practically before I hung up and were very very pleasant about it. Al the staff is well trained in customer satisfaction. There was no problem parking, and they have a terrific pool set up. Of course they are right on the beach and right on the bus line ($2 all day each) so u don't have to hunt up parking all over the island. So what is my reference point? I traveled over 1.5 M miles to many countries and have stayed all sorts of accomodations. This was not the most glitzy, ritzy exotic expensive place I stayed, but overall I'm stilling smiling (ok a little bit may be due to the grandson). To Q.I. staff ok uze guys keep living up to the standard And if I may in this tribute to the Q.I. right across the street is another terrific experience for adults and kids (go early if you have them), Mackay's Restaurant on the bay side.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Great Weekend, Great Location, Great Price”", "Author": "mhayduk", "ReviewID": "UR72900766", "Content": "Quality Inn Oceanfront on 54th was a perfect location for my Husband, Sister and her boyfriend. We are all in the 25-39 age range and we wanted to be close to Seacrets but not in a dumpy hotel and we also wanted to be near the ocean. The hotel has a Indoor Pool with a Bar (in case of rain), an Outdoor Pool with a bar, and you can walk onto the beach. Great Location. Great Price. It was very clean. Room was nice. Room had a fridge so you can bring water/soda etc. Would def stay again and would recommend to a friend. Much nicer than Quality Inn on 17th, that we stayed at in 2009.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Baltimore County,Md.", "Title": "“this hotel's rooms are extremely outdated”", "Author": "Char8433", "ReviewID": "UR72246262", "Content": "lobby very nice...rooms very outdated.......housekeeping was poor....never really cleaned our rooms....did not leave towels....outside pool not cleaned up, trash throughout..would not recommend this hotel", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "north olmsted, ohio", "Title": "“Great location on the beach”", "Author": "mammoth56", "ReviewID": "UR71278452", "Content": "Oceanfront Room was clean and large enough for the four of us. The bathroom looked recently updated and the bedding was new.The view from the balcony was wonderful! We had problems with our first room and we were immediately moved to another room, and even moved once again without complaint by the manager. If you would like a quiet area, I would ask for a room away from the indoor pool , whirlpools and birds. The food at the on site grill was fresh and reasonably priced and fresh fruit was available at the front desk everyday. My biggest complaint would be the air conditioning....it didn't seem strong enough to draw all the moisture out of the room, so consequently towels, bathing suits, etc never dried.", "Date": "July 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Collingwood, Canada", "Title": "“Great view!”", "Author": "swimsters", "ReviewID": "UR71217860", "Content": "Great balcony view right on the Ocean. Our room had a small stove,fridge and dishwasher and we enjoyed making breakfast and lunches(too many amazing seafood buffet restaurant's to have dinner in).The beach was clean and right outside the door and we could rent boogie boards and beach umbrella's. 2 Surf shops and great restaurants all within walking distance.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Very Family Friendly”", "Author": "sarelli15", "ReviewID": "UR71062783", "Content": "Awsome atrium, my two year old was happy just to watch the parrots and gaze into giant pond stocked with koi and turtles! Not to mention indoor/outdoor pools. Oceanfront is so much easier with a toddler. Could stand a remodel, but still clean and comfortable. Kitchen is very handy for storing snacks and milk. We had a wonderfuld vacation!", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great time!”", "Author": "travelwithbaby27", "ReviewID": "UR71033450", "Content": "We had a wonderful vacation- much in part due to this hotel. Everything we could have wanted was all under one roof. The proximity to the beach was fabulous- we had a great view. The outdoor pool was clean and we were always able to find a chair. We also enjoyed the outdoor bar. The highlight was the indoor cafe. The staff was the best I have ever encountered. We ate there atleast twice a day. The service was fast, and the prices reasonable. The location of the hotel was perfect- within walking distance of anything you could want. I plan on staying at this hotel everytime I come to Ocean City.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Fun Times and great service :)”", "Author": "Hookie05", "ReviewID": "UR70915782", "Content": "Enjoyed a wonderful weekend with my cousins at the hotel....great food, drinks and service at the Atrium Bar...Thank you Drew...very clean and comfy room as well! We will be coming back :)", "Date": "July 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Yuck”", "Author": "Sunkist101", "ReviewID": "UR70706137", "Content": "Based on the positive reviews I read here, we booked this hotel for an impromptu one night stay last week at the tail end of our 2 week Deep South/ East Coast Road trip. I can safely say this hotel was by far the worst we stayed at on our trip. The hotel is run down, skanky, dirty, and in desperate need of a renovation. We took quite a few photos of our room and the facilities that show everything from stained sheets, to a dirty bathroom floor, worn furniture, and other unfortunate things we encountered in this hotel. I realize that hotel reservations are hard to come by in the OC during the summer months, but this place is most definitely NOT worth $200+ a night.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sallisaw, Oklahoma", "Title": "“Perfect”", "Author": "mbatchelder", "ReviewID": "UR70667239", "Content": "We stayed in 1st floor oceanfront room. VERY Clean! The hotel staff was extremely accommodating! The tropical atrium was beautiful and the birds were a very nice touch. Staff took care of all our needs quickly. The atrium bar and grill was great and convenient. We liked the hotel so much, we stayed an extra night. Would definitely stay there again and recommend to anyone.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Clifton Park, New York", "Title": "“Great value, will stay here next year”", "Author": "waitingforthelotto", "ReviewID": "UR70412442", "Content": "My husband and I just got back from our trip to OC, length of stay: 07/04/10-07/09/10. This hotel was such a great value. We did have to pay extra for the night of the 4th but that is to be expected. The rooms we so clean! Because there is no smoking in the hotel the rooms have a \"fresh\" smell to them. All the appliances that were in the room (small refrigerator, microwave, can opener, toaster and coffee pot) were all wiped down and spotless. There were only 2 negatives that I can say about this stay: 1. The second day by 3pm our room still hadn't been cleaned by housekeeping. Since we had only checked in the night before I was able to catch the housekeeper outside of our room and switched out dirty towels for fresh clean ones. 2. The birds in the atrium. Squawky and loud. At night they do place covers over the cages and you *do not* hear them, however, if you want to take a nap after a day at the beach it can be a bit difficult. Overall this stay was great. You can not beat the view, location and the cleanliness of the hotel. The front desk people were very helpful and friendly. Brook (?) was very helpful with suggestions for dining out. Thank you for a great stay!", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "pa", "Title": "“Great place for families”", "Author": "eds3", "ReviewID": "UR69893240", "Content": "We stayed here for the 4th of July weekend. We had a 3rd floor room w/an awesome view of the ocean. The hotel is right on the beach so don't have to travel at all to get there. A great, clean pool both inside and out for the kids to enjoy. The birds in the atrium were a nice touch as well. Excellent customer service and reasonable prices. Plus, a prime location for families.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brush Valley, Pennsylvania", "Title": "“Awesome PLace to stay!”", "Author": "jlm33177", "ReviewID": "UR69872938", "Content": "Loved this hotel. Stayed with my husband and two children- ages 10 and 5. Nice big rooms, awesome view of the ocean. Very convienent. Restaurant/bar inside hotel was also very resonable. Will def stay here again.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indiana, Pennsylvania", "Title": "“Awesome Oceanfront Hotel”", "Author": "tjames_mt", "ReviewID": "UR68366222", "Content": "My kids & I enjoyed an oceanfront suite with kitchenette which was nice considering I had 3 teens, 8 & 10 year old with me. The room was very spacious & we had a beautiful view of the ocean that we enjoyed every morning. The hotel has a beautiful atrium with a pool & 2 hot tubs which were very clean & neat at all times. There is also an outdoor pool & play area that we all enjoyed.Both pool areas were supplied with fresh towels at all times. I must say that I was impressed with the overall cleanliness of the entire hotel. I have stayed at several different hotels on the boardwalk before but I must say that this by far is my favorite! When we return, it will be to the Quality Inn Oceanfront! The staff & management are very courteous & go above & beyond to make sure your stay is a pleasant & enjoyable experience.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“amazing family vacation”", "Author": "5forthebeach", "ReviewID": "UR68337827", "Content": "we saved money by not going to Hawaii this year...instead we stayed at the Quality Inn Oceanfront....and had a very similar experience to that OF Hawaii... The room was great for a family, with a full kitchen, we save a ton by cooking in the room...and listening to the ocean out our slider was amazing. The pool was great, and the kids LOVED all the birds and coi pond. Everything was SO clean and well kept. We are already planning our next vacation there.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "DE", "Title": "“New Look, and Clean Hotel\"”", "Author": "Getripe", "ReviewID": "UR67579174", "Content": "Just have to start by saying what a great upgrade. I have been coming here for years but am very impressed with the new upgrades to this hotel. I would reccomend this hotel to all my friends if you want a great place to stay. The staff is excellent and the hotel is clean. The rooms have been upgraded and the interior...well just WOW!\" You should definately check out the indoor pool and hot tubs. They are great especially on rainy days. This is a great place to stay. I recommend it to all my family and friends.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zanesville,OH", "Title": "“Very pleasant stay on the Ocean City beach”", "Author": "lledford", "ReviewID": "UR66640654", "Content": "My wife and I had a 5th floor ocean front room which was just perfect for what we wanted. We were there during theweek after Memorial Day, so the traffic was minimal and we apparently arrived before most of the high school seniors. This property is far enough north to avoid all the boardwalk hoopla. The staff were all very friendly and helpful. The atrium is nice and the food at the cafe was good. The view of the ocean was ideal and the room amenities with the kitchenette was perfect for staying in if you like. There is internet in the ocean front rooms ,but not wifi. That would be a nice addition toget wifi. There was also a drip from the air conditioner, but that was a minor annoyance. If you plan carefully , you can get some really good deals at this hotel. We plan to return again in November", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Damascus, Maryland, USA", "Title": "“Awesome Hotel! Great place to be to do just about anything in OC!”", "Author": "ws81713", "ReviewID": "UR65499622", "Content": "I stayed at the Quality Inn two weekends in a row, it's so great! The staff is wonderful and very helpful. They have parrots all over the place which is a very cool, different addition. My friends and I had the easiest access to Seacrets, Macky's, the beach and sub shops! We could walk everywhere- and it's a very reasonable price for everything you get! :) It's my home for the summer! I even left some belongings and they mailed them to me the next day!", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“Awesome hotel, great staff, very clean!”", "Author": "jmm41188", "ReviewID": "UR65420284", "Content": "The staff were very helpful in providing restaurants, and other activities to do during the day as the weather during our stay was not the best. They did what ever they could to make our stay as comfortable as possible! It was a fun trip and a great hotel. I would definitely go back and stay at this hotel again!", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Relaxing Romantic Oceanfront Hotel”", "Author": "hollik79", "ReviewID": "UR65118367", "Content": "My husband and I stayed here in May. The hotel staff was very helpful as we did not know the area. Our room was ground floor oceanview, we found it to be relaxing as well as romantic for our stay. The Atrium Room was neat, enjoyed watching the birds. They also have a great restaurant! They even offer free washers and dryers when you stay there that was an added plus. Will definately stay there again.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Baltimore MD", "Title": "“Quality Inn Ocean Front, Ocean City-Run don't walk away”", "Author": "survivorlookinforfun", "ReviewID": "UR64242790", "Content": "I just returned from a mini vacation with friends. We stayed at the Quality Inn Ocean Front. When we entered the hotel's \"tropical\" area. We saw parrots located in multiple areas. the last think anyone wants to see is bird droppings in the cages and a mess they have made on the floor near the cage. At night they cover the parrots with a vinyl cover...except one. One parrot has a white sheet with several holes (tacky rips) thrown over the cage. Upon arriving in our rooms, the air conditioner was broken...it was stuck. It was freezing in our room! The toilet didn't flush. I immediately went down stairs to report the problems which were address very quickly. Next, I found hair on the sheets. We called only to find out we had to go down stairs to get replacement sheets. The next morning we discovered, there was no fruit until later that afternoon. The fitness center didn't open until 9am. The room was freezing. One of the workers told one member of our party, he had to open the door to let some of the cool air out. The decor....all the interior plants were fake....plastic EVERYWHERE!. The canopy had a pile of dust. No one cleaned them! The doors of the fitness center had a pad lock. None of the fitness equipment worked. We were advised to use the facility at the 17th street Quality Inn the first night. The second day, we were advised to use the fitness facility at the Holiday Inn. We were told the rooms we had were handicapped capable. There was a small step upon entering the room (not accessible for someone in a wheelchair). Summary: Day 1: Broken air conditioner-fixed immediately Toilet didn't flush-fixed immediately Hairs on sheets Birds scattered in multiple areas. Debris from the birds were all over the floor. Workers placed birds chew and poopie toys on counter next to coffee and tea station. Day 2: Broken exercise Equipment Fruit arrived in the afternoon (other Quality Inn had fruit around the clock.)", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“Fabulous Experience”", "Author": "HonestGuyDelaware", "ReviewID": "UR63165022", "Content": "I have been enjoying this facility for years,but the quality and expense put into the recent renovations has really made this property top notch. A courteous staff and great amenities. Kudos to the management.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perry Hall, Maryland", "Title": "“GREAT HOTEL”", "Author": "vipers12", "ReviewID": "UR62686143", "Content": "Very nice hotel to stay in. the indoor pool was a great aspect of the hotel, especially because it rained one of the day's we were down there. the rooms were very spacious and comfortable as well as clean, which is something that is very important to me. we are going there in may to stay there again.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Loved it!”", "Author": "tropical_lover_86", "ReviewID": "UR62492070", "Content": "My boyfriend and I decided last minute (Friday morning) to go to the beach for the weekend. The hotel we normally stay at was booked so we decided to stay at a new hotel. I loved the Quality Inn because of the Atrium. It is an indoor pool/ hot tub and bar. I loved that we could go swimming and the pool was very clean and the water was warm. The staff was very helpful and nice. Our room was very clean and spacious. We were on the 2nd floor ocean front and my only complaint was that we could hear the kids playing in the pool early in the morning and my boyfriend and I sleep in late. They also had parrots and tropical birds which was very neat. We did get dinner and drinks at the bar one night and the food was just average, but we did not feel like going out so we just got food there. I am looking forward to going back in a few weeks.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "MD", "Title": "“July 4th Getaway”", "Author": "jack21903", "ReviewID": "UR62247971", "Content": "Our family and our sister's family enjoyed a quick getaway over Fourth of July and stayed at the Quality Inn Oceanfront. The rooms were clean, provided ample space, and a small kitchenette (which came in handy with 3 kids). The indoor pool area has an island theme and the on-site cafe' is great. My daughter and I enjoyed breakfast (she was 5 and an early riser). Then we went to visit the kids play area which was GREAT. So much easier than packing play toys for down times. Wonderful staff, the rooms were always freshened and stocked, the outdoor pool and bar area was wonderful for kids of all ages. It's right on the beach, so we had a blast playing in the sand, then just walking in to our room!", "Date": "April 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Enjoyed Our Stay”", "Author": "MissEbony1908", "ReviewID": "UR60215770", "Content": "My daughter and I returned from Ocean City today from our mini vacation. We stay at the Quality Inn Oceanfront beacause of the price and the location which is right on the beach, and because of he positve feedback we saw on tripadvisor. I was pleased with pretty much everything. Check in was very smooth. When we got to our room I was so happy that I had a patio to walk out onto the ocean. And I loved the ocean view which is actually the first Thing I notice upon opening the door. I was also glad that the room had a full kitchen which was definitely a plus since it was just my baby and I, I really didn't want to dine out. So I cooked each night we were there. Also another plus was the dishwasher. The rook was very clean, but I did think the decor could use a little updating. Ms. Turner our housekeeper was friendly and did an excellent job cleaning our room and keeping things well stock and I would like to say thank you again to her. The indoor swimming pool was a definite plus since the weather wasn't quite warm enough for outdoor swimming. It was a little small though and seemed pretty crowded all day everyday, but that didn't keep the baby and I from jumping in. Overall it was a great stay and look forward to returning inthe near future. Oh I forgot to mention that this hotel is not on the boardwalk. You have to drive about two miles south, but that was a big deal. I would rather not be on the boardwalk to avoid the crowed beaches anyway. Hope this helps.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seaford", "Title": "“The best hotel i've ever experianced in my life!”", "Author": "Cobez28", "ReviewID": "UR60139936", "Content": "During my stay at the Oceanside hotel I experienced more than a handful of emotions. As soon as I stepped foot through their doors I felt right at home. Their employees greeted my family and myself with love only a mother could express. The room service was phenomenal, along with the cleanliness of the room. Cleanliness is a big thing in my eyes and i was certainly impressed with this aspect of my stay. My family and myself surly did leave knowing that the Oceanside hotel was the best hotel we've ever stayed at. We do plan on coming back.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "5.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "South Jersey", "Title": "“A Must Stay in Ocean City!!”", "Author": "bosgirl05", "ReviewID": "UR59834929", "Content": "This was our first experience visiting Ocean City, MD. My husband & I went for a weekend with another couple. From the first moment at check-in we felt welcomed & on vacation. As you walk into the Atrium it was like no other we have seen. It truly put us in a relaxed & stress free mood. Kevin & Kate at the Atrium Bar are fantastic. You have to meet them. The hotel staff were very helpful in answering our questions and very knowledgable about the area. We are making this a Must Stay on our list for when we want to get away!!!", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Great Hotel and Awesome Staff”", "Author": "wendyschix", "ReviewID": "UR58980501", "Content": "We had a wonderful inspite of the Noreastern storm the weekend of 3/12/10. The hotel is under renovations and you would NOT know it. You can see the improvements, but the work was quiet and very clean!! We have stayed at this hotel several times and it just keeps improving. The staff is very hospitable, friendly, professional and helpful. I would definitely recommend this hotel to a friend. The hotel is an older hotel for Ocean City Maryland, but it is definitely kept up with the modern times.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tuckerton, NJ", "Title": "“Great fun and value”", "Author": "ladyjane1", "ReviewID": "UR57237259", "Content": "We have stayed at this hotel for many years. The kids really enjoy the atrium with the tropical feel and the birds. Not to mention the koi pond. The food is good but a bit pricey. Pool and hot tubs are well kept. There is an excercise room for those who can't take a break from working out. Hotel is undergoing a facelift and it will be even better when complete. Location is close enough to boardwalk but far enough to avoid congestion. Buses run and for a daily rate, you ride as often as you need.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "OC,MD", "Title": "“Beautiful hotel-friendly staff-PERFECT location”", "Author": "zacmanh2o", "ReviewID": "UR57190946", "Content": "We stay here every year, and this was the best year so far. Even though we were snowed in, the friendly staff and great amenities made it super fun for the kids! The atrium was under construction, but looks beautiful so far. Can't wait to come back and see the finished product!!!", "Date": "February 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "la plata, maryland", "Title": "“Family friendly.....”", "Author": "wizor", "ReviewID": "UR55323800", "Content": "I feel comfortable letting my 10 year old go and have fun with other kids in the hotel. The game room and birds keep him occupied and out of trouble. He absolutely loves the birds especially Wizor. Wonderful staff at the front desk and at the bar/Atrium cafe.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pennsauken, NJ", "Title": "“AMAZING SERVICE AND GREAT AMENTITIES!!!”", "Author": "Kramberry", "ReviewID": "UR54194494", "Content": "My husband and I were sooo happy with this Quality Inn. Our only regret was that we could not stay longer and enjoy more of the ammentities. Our room was just perfect, with a full kitchen stocked with everything you would need to cook a meal for your family, even though we didn't feel like doing that at that at the time! The coolest thing about the hotel was the atrium. The atrium area is tropical themed, and all of the hotel rooms face it. There is a beautiful pool and a hot tub, and a pool bar/restaurant!! This was exactly what we needed to chase away the winter blues, it felt like summer all the time in the atrium. My husband, who normally complains about everything, loved this hotel also and had a great time talking to the parrots in the atrium area. The room was affordable. The front desk staff was so kind and accomodating. They recommended a great resaurant called \"The Bonfire\". This was our first time in O.C. Maryland, and we can't wait to come again and bring our kids. We will definitely be staying here again.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Skaneateles NY", "Title": "“Another enjoyable stay here”", "Author": "artguy5", "ReviewID": "UR51895701", "Content": "Although some places are closed in April, this is a fun visit. The tropical birds are interesting. The indooor pool and hot tubs are fine. The staff is always helpful and the rooms have been fine. We'll return.", "Date": "December 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Baltimore", "Title": "“This hotel is a delightful place to stay.”", "Author": "Pat026", "ReviewID": "UR51754926", "Content": "The rooms are well appointed and the ocean front rooms have a lovely view. I especially like the atrium where I can stroll and watch the koi and talk to the parrots and macaws. (A few even speak back. ) The indoor pool is a good size, clean and warm, and the two hot tubs are well maintained. Coffee and tea are available in the atrium; fresh fruit is kept on the front office desk, as is a free daily newspaper. There is also a small restaurant/bar located in the atrium. The hotel's location is convenient to the Route 90 bypass. The staff was very friendly and helpful.", "Date": "December 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Southern New Jersey", "Title": "“Great place to stay to \"get away\"”", "Author": "DwDaffy", "ReviewID": "UR51187639", "Content": "We have been taking weekend getaways to this hotel for years. The atmosphere of the atrium is great! It so nice to relax in the heated pool and hottubs surrounded by tropical birds and palm trees. The food from the atrium bar and cafe is very reasonably priced and decent. There is a gym and an arcade with a pool table in the basement. You really can't beat the location.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "poconos", "Title": "“great place to stay”", "Author": "kurtie63", "ReviewID": "UR51117461", "Content": "the view is Great-the atrium is Great-the bartenders,Kate and Kevin are Great-the entire staff is Great-the price is Great- what else could you want???", "Date": "December 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“I had a great stay!”", "Author": "dcrosby", "ReviewID": "UR47565720", "Content": "I stayed in an oceanfront groundlevel room with kitchenette. It was perfect for my young daughter and I. The room was large for our purposes and the divided allowed me to put her to sleep and stil be up myself. It was clean and had all the little things that made our lives easier. The staff was lovely. We could walk out our door and over a slight dune to the sea -- which is ideal with little ones as you do not have to cart everything too far. All in all we had a great time.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maryland", "Title": "“Great value and location”", "Author": "KFP54", "ReviewID": "UR46458197", "Content": "This hotel continues to be a great value. We have stayed here many times over the past 22 years and still enjoy it. Even though the hotel is an older property, it is always clean and the rooms are large and comfortable. We especially enjoy the atrium with the macaws and other birds. Our daughters grew up being entertained by them and the indoor pool is great when the weather does not cooperate.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Lehigh Valley, Pa.", "Title": "“Bed Bugs...Stay away!!!!!!!!!!!”", "Author": "BeachBumsz", "ReviewID": "UR41154683", "Content": "Dated, worn look and musty smell dominated the beautiful ocean view. Creepy crawling feeling after leaving the hotel. Plus the little red bug bites to go with it. Do not go here unless their are major renovations and new management.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "East Windsor, NJ", "Title": "“Overall a comfortable stay, but pricy...”", "Author": "jlbigguy", "ReviewID": "UR38589355", "Content": "I am always surprised at the negative reviews, and take them with a grain of salt. No place is perfect, and some people nitpick just for the sake of it. This was the first time we stayed at this QI, and the stay was pleasant (in spite of all the negative reviews). Upon check in, the front desk politely told us that the previous occupants complained that the room had a smokers odor. They gave us a key to see if the room was acceptable. It was not, as it definitely smelled from smoke. They placed us in another oceanfront room on the first floor, and allowed us to check out the room before checking in. This room had no odor, and was in the process of being cleaned. The front desk was very polite, and we appreciated them warning us of the odor in the first room. The room was large and clean, with a full size refrigerator. Having two bathrooms in the room was great! Bathrooms were clean, beds were comfortable. A sliding divider was between the living area and the beds, and was convienient as I am an early riser. The carpet was buckled in a couple of areas, but that is to be expected in a beachfront hotel as the carpet must be vacuumed daily to remove sand. Was the wallpaper dated? I didn't notice. The furniture was clean, and all lights and appliances worked. Our room was cleaned promptly everyday at 10am. Indoor and outdoor pools were clean and pleasant. The hotel location was perfect, walking distance from the boardwalk, but far away enough to be quiet at night. While the hotel is non smoking, you will find many guests smoking on the balconies, and the odor can be annoying when you are on your balcony. The restaurant is open for breakfast only, and is reasonably priced. We would have liked to see it open for lunch as well. The beach cafe was only open once during our 4 day stay. Would have been nice to be able to get ice cream and snacks without leaving the hotel. Overall we enjoyed our stay at the QI. An OK stay, not exceptional, but certainly not terrible as some of the reviews have stated.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New Jersey", "Title": "“Place is really showing its age!!!!”", "Author": "jjrpaul", "ReviewID": "UR37992039", "Content": "My wife and I typically visit OC every year for 4 nights, and we have stayed at this place each time, and have great memories of earlier times here when our children were young. But I must say that this may have been our last, as the place is really in need of renovation, and there are other places to stay at OC that charge equivalent rates. We always get an oceanfront efficiency room. apt, and we both noticed immediately that the screen in the screen door was torn big-time at the bottom, so we could not enjoy fresh air in the evening w/o letting in some bugs. How the chambermaid did not notice that is beyond me--it's as if they or the management don't care. The AC thermostat system in our room could not be regulated--you either had it on or off, no in between. Luckily, we don't mind sleeping in a cold room with blankets. The woodwork molding around the entrance door was separating from the frame, such that the security latch could not stop a two year old. The two chairs and the glass table on the balcony had blotches of dried paint all over them, again, a sign that whoever maintains this place does so with little care. (I guess one should be happy that they painted the outside?) On the day we arrived and on the 2nd day, the sevice elevator was out of order, forcing all the guests and the service people to share one elevator covering five floors. It was deja vu, as we found the same situation a year ago when we stayed there. With our children grown and long gone, we no longer use the indoor or outdoor pools, but they did not appear to be in the cleanest condition, especially the indoor one. To its credit, the place seems to have improved the appliances, cabinets and the beds. So we have no complaints there. My wife and I are not fussy travelers; we have stayed a very nice places and very modest places here and abroad. And we also realize that it is harder to keep a beach resort clean and in shape given the constant trudging in and out of sandy feet and humid salty air. But it seems like this place charges a lot and gives you little in return. They don't seem to care about investing in the place, I guess because the location is good and people like me keep coming back. I think that is about to end.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Newburg, Md.", "Title": "“Families with toddlers BEWARE!!!!!!”", "Author": "allboutmykids", "ReviewID": "UR37585032", "Content": "We have stayed at this hotel numerous times and always have found it to our liking. This time was no different except for one large difference. I have a two year old daughter and she will pretty much try anything and get into everything. Well we stayed on the fifth floor and we were ocean front. We love to here the noises coming of the beach so we used to like to keep the door to the balcony cracked so we could hear the waves crashing. However on the balcony the bars are so far placed apart my daughter had her whole head and half of her body through the bars before my husband grabbed her arm. So she was not aloud on the balcony while we were there. I mentioned this to the front desk and was told that they have netting but they do not put it up because some people say it effects the view for them. I told her I believe this needs to be fixed, I mean even if I had the netting how strong is that. I was also given a room with out a bath tub, it only had a handicap shower with a two & seven year old this was not convienent. So if you stay here and need a actual bath tub you need to inform them of that when you make the reservation. It is a nice hotel besides that though, but I don't think I will stay here again until they fix the problem with the balconies.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dover, delaware", "Title": "“Great hotel”", "Author": "lindeery", "ReviewID": "UR36910951", "Content": "Hotel was very nice, staff was extra nice and mad you feel as if you were at home ! Our room had all new appliances and carpet! i will be coming back to this hotel next year for my summer vacation!", "Date": "August 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "New York City", "Title": "“Nice Oceanfront Location”", "Author": "milano14", "ReviewID": "UR36597161", "Content": "This was our first visit to Ocean City, so we weren't exactly sure what to expect. Stayed 3 nights at the Quality Inn Oceanfront. I felt that the price of the hotel room was on the expensive side, but during my initial research found that it was a common rate for Ocean City. We originally booked a poolside room. I figured that the poolside room would still have a balcony and view to the outside, just not the ocean. So after checking-in we went to check out our 2nd floor poolside room. The room itself was fine, but it had no natural light. There were 2 small windows on either side of the door into the hotel room, but no natural light made it through them because the overhang from the walkway/porch above was so deep. And at the other side of the room, the sliding doors went out onto an interior balcony that opened up in the atrium, 'tropical oasis', area. If you don't want to see the sun or outside while staying at this hotel than this room would be fine, but I need some natural light. So we went back to the front desk and upgraded to an oceanfront room (which surpisingly was only $50 more total for our 3 night stay). This was the best desicion. Our hotel room was clean, not fantastic, but clean and the view was great. I agree with the previous reviewers comments about the tropical oasis/atrium. It didn't appear clean at all (we did not use the indoor pool or hot tubs at all). The birds in their cages were covered up at night, so they weren't loud all night long. But the covers were removed at 730/8am so if we were late sleepers they would have woken us up every morning. For this hotel I would recommend an oceanfront room on the 4th or 5th floor. Nothing lower; otherwise when you walk out of your room you are in the 'tropical oasis'. The beach at the hotel was perfect location, not too busy, and very easy to access from the hotel. We also did not use the outdoor pool, but it was always very busy. And in the middle of the parking lot. Also, the gym is very small and the free wireless internet was spotty. We could not always get it to work.", "Date": "August 3, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pennsylvania", "Title": "“Wonderful Staff at the Hotel”", "Author": "Beachy159", "ReviewID": "UR35624739", "Content": "We recently took our summer vacation, and stayed at the Quality Inn, on 5400 Coastal Highway in Ocean City, Md. The Hotel was very clean, and the Staff were terrific. Whomever is managing that Hotel, is doing an Excellent Job!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "cpf172", "Title": "“Rare Compassion and Understanding. We'll Be Back!!”", "Author": "cpf172", "ReviewID": "UR35558637", "Content": "At a time when so many companies are watching every penny and lacking in the customer service department, I was so pleased with our interaction with the reservations desk at Quality Inn Oceanfront. We were scheduled to visit last weekend, but my son was hospitalized Friday night. Expecting to lose all of our money, we'd thought we'd try to apply it to another visit down the road at least. The reservations desk, with no questions asked, refunded the full amount despite the cancellation policy. My son is out of hospital and healthy and we'll certainly be back at this hotel in the next few weeks to enjoy our time at the beach!!", "Date": "July 23, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Delaware", "Title": "“Great place to stay with children”", "Author": "nsammons111", "ReviewID": "UR35039281", "Content": "I stayed at Quality Inn with my 8 year old grandson and some friends. We had a great stay. The Hotel has everything you need without going anywhere. The beach is close. The outside pool is very nice and has a bar. I felt very comfortable letting my grandson wander around. He loved the birds. I will definatley stay again.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dover,de.", "Title": "“The friendliest, most interesting, and most fun in OC for all ages !!”", "Author": "mustangallie", "ReviewID": "UR34855289", "Content": "I have been staying at this hotel for many years, and used to bring my children, we would stay both in the winter and summer. my children are now bringing their children and their friends and their children. This is a hotel you can enjoy staying right there in the evenings and you do not have to go out and eat (it has a fully equipped kitchen) or go to the boarkwalk every night.It is family friendly, has an indoor pool, game room,toddler play room, dvd player and movies, and of course the parrots !!!!! I love it and I am 62 years old, I will never stay anywhere else. The rooms are great, the staff is excellant, the beach is beautiful, what more could you ask for ?? I used to give my grown children gift certificates to there for Christmas so we could all go together. My grandchildren said it was the best gift they ever got !!", "Date": "July 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Great beach, smelly, noisy hotel”", "Author": "OmniRiot", "ReviewID": "UR34349436", "Content": "We stayed in an \"Ocean View\" room, which had a wonderful view of the ocean. This alone made the stay worth it. However, the hotel had several unpleasant \"features\". There are a number of parrots in the hotel atrium - unfortunately they are LOUD. They woke us up every morning. Next, the atrium / pool area....is just a mess. Extension cords all over the pool area, abandoned hot-tubs, cheaply done decorating, etc. It was clear the hotel was going for a jungle / oasis / atrium motif, but instead it comes across as a messy petting zoo. Not to mention the STRONG and NASTY smell of over-kill rug spray. The hotel smelled BAD. I would not go back...", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maryland", "Title": "“Wonderful accommodations and great service!”", "Author": "mlgiles3", "ReviewID": "UR34250489", "Content": "This is not the first time I have stayed at the Quality Inn Oceanfront, but I can say the service gets better each time. The value for your money is excellent. Right on the beach, near the boardwalk, shopping, restaurants, etc. Had a ocean view that could not be beat! Desk Clerks, Daisy and Lara, and Management, Dan and Donna, are most gracious. Always willing to provide answers and directions. Very friendly and professional. Housekeeping staff was always nearby if you needed something and they have towels available for you to use for the pools! Loved \"The Atrium\" Cafe and the birds!", "Date": "July 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NW New Jersey", "Title": "“Wonderful Ocean View, Comfortable Room”", "Author": "Jackzig", "ReviewID": "UR30487267", "Content": "OK, the rooms are a little dated, but they are very comfortable, and very clean. We had an ocean front room with a king size bed on the second floor. The bed was great, the linens were fresh and clean. The view was to die for. We had breakfast on the balcony every morning while watching the waves, and enjoyed a glass of wine in the evening while the full moon played on the ocean. My wife and I have stayed here for several years, and plan to come back again. We had no problems with the air conditioning and saw no signs of mold or bugs. The staff was friendly and helped us plan a day trip to Crisfield. This is not a luxury hotel if that;s what your looking for try another hotel. If however you're looking for a clean, comfortable room with a beautiful view of the ocean, at a reasonable price, this is it.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Maryland", "Title": "“We can't wait to go back.”", "Author": "dricha0809", "ReviewID": "UR28979910", "Content": "My family and I had a great time on are weekend get away. Staff is very nice from the time we got there until the time we departed. Room was very clean and the beds were great I have a bad back and I got up with no pain every morning. We loved the birds they all have names and we injoyed talking to all of them. The indoor pool was just like getting in a nice warm bath tub so the kids didn't cry that they didn't want to go to the pool. My family enjoy the game room and I really enjoyed the tanning bed. We will be planning a return visit this summer.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "delaware", "Title": "“Very Disappointed”", "Author": "tmrush", "ReviewID": "UR21040360", "Content": "We were unable to afford a week at the beach this year but wanted to take our kids for at least a couple of days. This hotel looked nice on the web and realy did have all the amenities to make kids happy but I found it to be really dirty and run down. The website claims the rooms are all remodeled but I'm not realy sure what their actual definition of remodeled is. The only thing in the room that appeared to be new was the bedding and some of the bathroom. The carpet was sticky so we had to wear shoes or socks the entire time, the room smelled really bad, the couch was stained and the door jamb fell off of the door. The lobby smelled like vomit .We were going to stay an extra night and suck it up because our children loved it there and don't really notice the same details adults do but our last night there my son was woken up by young drunk guys in the room across the pool area who were screaming that they were going to kill everyone and throwing furniture around. My son got really upset and needless to say my husband and I got no sleep. The staff did address the issue promptly. Even though my children were really disappointed I was not willing to pay another $245 for another night. The staff was extremely nice and if they actually did remodel the rooms and lobby this place would be great. The outside pool are was really nice and the inside and outside bars were brand new. The inside jacuzzis and pool looked kind of dirty but I didnn't actually use them. This was probably the nicest part.", "Date": "October 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hertford, NC", "Title": "“Great Experience and Wonderful Stay!”", "Author": "Nothome-OnaVacation", "ReviewID": "UR20978047", "Content": "We found this hotel via Google and checked out their web site. They were running a fall special, Sunday through Thursday - stay three nights for the price of two. Our room was oceanfront with two double beds and full kitchen, clean with comfortable beds, extra pillows and great blankets. The indoor pool was clean and the hot tubs were sanitized daily. The two Sauna's were dated and could use a good cleaning, but worked and felt great. Free laundry (ask for tokens at the front desk) was a blessing. The food and drinks served by the hotel restaurant were a bargain and very good. Their atrium is full of plants, birds and fish. A nice diversion. The staff was attentive and friendly. It is just a few steps from the elevator to the beach. We had such a great time we extended our stay another night (had the weather held we would probably still be there!) A great experience and wonderful stay!", "Date": "October 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Washington D.C.", "Title": "“If you don't mind fungus and toxic mold this is the place for you”", "Author": "frequentraveler001", "ReviewID": "UR20649780", "Content": "The gravest concern we had was the mushroom like structures growing out of the carpet and walls (see attached photo). Admittedly, I'm not a scientist nor did I take a sample and send it off to a lab but I think that any reasonable person would conclude that there is a massive fungal problem. Not to mention the black spots growing out of the bathroom walls which appeared to be mold. Other than that that the A/C didn't work, the drains were broken and clogged and the half of the lamps didn't turn on. The pools were filthy and the room smelled (as did all of our belongings, clothes etc.) after we left. I bet the health department would be interested in this. As far as minor stuff.... well, there was no thermostat in the room and we had to call maintenance to adjust the temperature. The TV is small and no where near the beds (the tv was near the couch). If you like to watch TV in bed, forget it! Speaking of beds ... very uncomfortable! If you didn't have a back ache before you arrived, you might after you leave, we did. The bugs in the room didn't add to the charm either. Oh yeah, and if you have a nice car, I hope you don't mind leaving it out on the street because there are very few parking spots in the actual motel lot. The motel is not walking distance from the boardwalk either.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bowie, Maryland", "Title": "“Wonderful Hotel”", "Author": "mermaidlah", "ReviewID": "UR20118351", "Content": "I stay in this hotel every September for a week (for the past seven years), and I never want to leave! Hotel feels tropical with the indoor pool, birds and foliage. No complaints at all - Rooms are very nice and clean; hotel staff friendly and accommodating. Good food at the Atrium Cafe. Free use of washer and dryer. Great location for walking to dinner/nightlife.", "Date": "September 16, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "2", "Overall": "4.0", "Rooms": "3", "Service": "4"}, "AuthorLocation": "Rochester, NY", "Title": "“Pleasantly Suprized”", "Author": "theboom", "ReviewID": "UR19576104", "Content": "To begin with, I booked my vacation through AAA before reading the reviews of this place on this website. After reading some of them, I was a little worried about spending my anniversary there. But because my wife and I aren't very picky, I decided to try it. Lets start from the beginning: The hotel was easy to find, and was right on the main road with a large sign. The parking situation which can be a pain in OC was easy and there was plenty available. There is a pool outside by the parking lot before you enter the hotel, usually filled with kids, but the area was clean, and so was the pool. Kids were usually kept under control by their parents. The entrances to the older part of the hotel are outside, on the road side, and have balconies overlooking the pool/parking lot area. The lobby was small, but the staff was helpful and friendly, and there was always a stocked fruit basket with bananas, peaches, etc. Through the lobby was the atrium. I was expecting more plats, and less open space, but it was nice and there were birds in cages for people to look at, and \"talk\" to! Also in the atrium is a bar/restaurant which is reasonably priced. To the south end is a pool and two hot tubs. The pool was a little dirty, mostly with sand from the beach, and one of the hot tubs was empty most of the time. The rooms were OK. Nothing special. When we walked in, it looked nice but felt a little dirty and moist. The kitchen area was nice, the broiler under the stove was NASTY, and I was scared to open it. We did use the kitchen though, and their dishes. The bathroom was kinda dingy, wallpaper was peeling near the top of the wall where there were a couple of holes. The shower did have mold around the caulk if a few spots. The reviews that mention water pressure problems were not exaggerating! NO PRESSURE! And the water temp is always changing. Not to extreme amounts, but enough to make me want to rush it. The bed/tv area was very nice, but the carpet was kinda nasty. The A/C worked fine. The balcony overlooking the atrium was just about useless unless you want to look at pasty old people and kids that are scared to go in the ocean. The birds don't make hardly any noise, and are covered during sleeping hours. The people in the room next to us were very loud and obnoxious. but they were friendly, and at about eleven every night they went in to bed. The ocean area in front of the hotel was nice and clean and supervised by a lifeguard. In retrospect, I'd stay there again. I wasn't crazy about the place, but where else in OC are you going to find an oceanfront hotel with efficiency units, two pools, free parking, etc. for $150 per night?", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Can't Wait To Return”", "Author": "MorgansGranny", "ReviewID": "UR19541647", "Content": "We had a great time at the Quality Inn Oceanfront! Right on the beach ... pool was on street side, but secluded. Keep up nicely, too! Inside staff was very helpful. If you needed something, you got it immediately! Inside pool and atrium was something I haven't seen at any hotel. The birds are let out of their cages (only when staff is there) and they talk and are friendly with the customers. Food at the inside Tiki Bar was very reasonably priced and good! We had a great time and can't wait to return! P.S. Mary of housekeeping took very good care of us!", "Date": "August 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Maryland", "Title": "“Great Experience oceanfront”", "Author": "mom2morgan", "ReviewID": "UR19466245", "Content": "We had an ocean front room on the 4th floor and felt so good about the hotel. The staff was helpful and the birds were a nice difference. We look forward to returning to the hotel this September.", "Date": "August 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Drexel Hill, PA", "Title": "“Worry Free Hotel - Fabulous Vacation”", "Author": "Tazdoc1", "ReviewID": "UR19251991", "Content": "I'm writing this review because reading the reviews on this website is what helped me make my final decision to book this hotel. So I'm hoping that my input will help someone else as well. First the PROS: LOCATION: Perfect!! It's located on 54th & Coastal Hgwy. in Ocean City, MD which is far enough away from the noise and crowds of downtown and the boardwalk but not so far it's a pain in the butt to get there when you want. It's close to the Convention Center (if you care), close to restaraunts, clubs, amusements, gas stations, and supermarkets. The beach is guarded/private, uncongested and CLEAN! HOTEL: Room Service - very accomodating, attentive, and on point. Decor - very tropical, \"beachy\", and clean. The beds were the most comfortable I've ever slept on in ANY hotel. Even my 16yr. old, fussy daughter raved of how she wished she could take the mattress home!! Our room was an non-smoking oceanfront efficiency with a spectacular view of the beach and ocean from the 4th floor. The balcony, complete with table and chairs was private with walls on both sides so you weren't staring down your neighbors throat. The back of the hotel also featured shaded hammocks that were incredibly relaxing enough to lull you to sleep with the cool ocean breeze caressing you, the waves crashing in the background - my gosh! What a treat!! Anyway, the room was big enough to sleep 6 people which included my husband and I, our three children plus my neice (ages 11, 15,16, and 18yrs old). The dresser and closet was even ample enough for us all to unpack and stow our luggage away without tripping over each other! The kitchen was fully stocked and came with a dishwasher and soap, stove with an oven, refrigerator and freezer. It took the headache & expense out of eating out all the time! The bathroom was decent enough with a tub/shower combo with a massaging shower head but my main reason for mentioning it in this review is that I was relieved that six people were able to shower back to back without the water pressure changing or the hot water running out!!! Loved the outdoor pool and pool bar. Loved the indoor heated pool, jacuzzi, and Atrium bar. LOVED THE TROPICAL ATRIUM, PERIOD!! I was very thankful that the hotel staff always left fresh laundered towels stacked in the Lobby so you never had to worry about dragging your own towels around! Loved the all day, all night free coffee and the fresh fruit in the morning! I was VERY thankful for the guest laundry room which was FREE!! The game room was perfect for the kids to keep busy whenever they got a little bored and for me and my husband to take on a game of pool when we got bored! I'm also thankful for the shower/changing room in the Atrium that allowed us to check out at 11am but still enjoy the pool and be able to shower and change before leaving for good. Oh and lest I forget, there's also an exercise room and tanning bed although I personally didn't utilize them as walking in the sand did my thighs great and I'm already black so tanning is kind of a mute point. (HA!HA!) Oh and there's also wireless internet on the Atrium side and wired Ethernet (high speed) on the oceanfront side where we stayed. The front desk was very accomodating in lending me an ethernet cable for my laptop. And one other thing! There's a safe in the closet in the room which allows you to set your own 4-digit code. I was able to lock up my laptop and all my other valuables while out of the room. This was one heck of a worry free vacation! I will DEFINITELY stay here again! It was worth every penny!!! And now the CONS: Well there aren't many. I wish they cleaned the jacuzzi more than once a day (too many sandy feet), it was quite frankly gross. And the parrots, although beautiful and fun became an noisy annoyance when they woke in the morning but I digress - they were only noisy if you opened your room door. :>) Our first night there we spotted a few micro-sized ant-looking bugs on the kitchen counter. When I informed management they said they would take care of it. When we returned to the room -poof- no bugs for the rest of our week long stay!", "Date": "August 22, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Maryland", "Title": "“Great plac eto stay for reasonable rates”", "Author": "Josie16", "ReviewID": "UR18985438", "Content": "My husband and I went down to O.C. for a long weekend and heard that it was a nice place to stay and was reasonable. We were not dissapointed. Dan the manager and another worker Donna were very nice and helpful in recommending nice places to eat. The resturant there was very nice as we ate several meals there. My husband and I would definately stay there agian.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "new york", "Title": "“NASTY!!!!”", "Author": "jeepgal31", "ReviewID": "UR18855303", "Content": "I had booked my vacation late so i was limited on hotels and wanted to be right on the beach, so this place was all that was left...unfortunatley.I had a oceanfront front room on the third floor with a private balcony. We opened the door and the smell of mold was overwhelming. I guess the email I sent before I came specifically stating I needed a room with NO mold because my 4 year old daughter is a severe asthmatic didn't get read. There was black mold on the ceiling,along the molding on the top wall,down along the privacy curtain on the wall and the carpet was full of it. Everytime you walked into the bathroom and stepped onto the white bathmat it turned black..GROSS. The \"new\" renovations consist of haphazard new tiling in the bathroom and holes cut too large for the fixtures so there gaping holes around the ceiling fixtures. Old shower heads,Massive amounts of messy glue around the bottom of the toilet, Old sheets on the beds, Really gross moldy stained carpets,Rusted refrigerator,dishwashers that dont clean, rusty ceiling fan,The most foul smelling hot tubs ever that the color of the water looks like urine, and sand filled indoor pool. Cockroaches around the parrot cages, stained hallway carpets.This place is like an indoor rundown trailer park. It is definetly not worth $1700 for 5 nights. My daughter had to sleep on the balcony because her asthma got so bad, I feel bad for the maid service, they did well trying to make the room look halfway decent each day. The atrium cafe does not do room service for any meal that they deliver to your room. You have to go an pick it UP!!! Stay away from this place and spend a few extra bucks to stay at a place where you will stay healthy.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "maryland/d.c", "Title": "“Yuck...”", "Author": "jimini1012", "ReviewID": "UR18696345", "Content": "I read some positive & negative reviews of this property and I knew I was taking a chance. My boyfriend and I always stay at Comfort Inn on Boardwalk but since we only had about 2 days to book a hotel, we had to settle for this one. Ugh... We stayed on the first floor by the atrium. The carpets had stains ALL over them, there was a crack on the window in the bathroom AND the nets to keep bugs from coming into the room from outside was partially broken, the sheets on the bed had a pretty big nasty yellowish brown stain on it, the bathroom stank like feet, and the microwave still had some stains and crap inside. We complained, and someone came in and \"cleaned\" but I still wasn't satisfied. I mean we paid around 300 for this? This hotel had so much potential... I think they could do so much with it but with the price and the quality of the hotel, I would NEVER returned and will advise people to NEVER go there. The only OKAY thing about the hotel was the atrium cafe/bar. The food was better than I expected, the workers there were pretty nice. Happy hour was okay, the mixed frozen drinks weren't great but better than expected.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Seattle", "Title": "“I would have rather slept in my car”", "Author": "left_at_eaglecap", "ReviewID": "UR17674993", "Content": "Sleep in your car if you have to, whatever it takes avoid this dump. We stayed two nights and paid about $300 per night for an oceanview room. The \"atrium\" is nothing more than a imitation housing project sort of set-up with the \"guests\" hanging their dirty laundry out to dry for you and I to walk by on the way to yet another trailer park dinner. In fact, just go to another city altogether and avoid the \"land that time and the dental hygenist forgot\" aka Ocean City. The outdoor pool scene was exceptional, if you like looking at very large women who think it is socially accpetable to lounge around the pool in an under-sized wife beater tank top, sans undergarments. Our $300 room reeked of mold, the carpets were damp to the touch. There was rust everywhere that rust could possible take root. Seriously, this was by far the worst hotel (and city) that I have visited in all my travels.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsalvania", "Title": "“LOVED THE ATRIUM!”", "Author": "squrrel", "ReviewID": "UR17153126", "Content": "My husband and I stayed at THE QUALITY INN because he remembered having a great time there as a kid. I had never been there but was excited. When we arrived the staff was super attentive and friendly! Our room was very clean and loaded with everything we may neeed to make our stay comfortable! Then the best part was the ATRIUM with the beutiful exotic birds, inside and outside pools {THAT WERE NEVER OVERCROWDED}, inside hot tubs, resturant and beutiful tiki bar! The staff {ESPECIALY THE BAR TENDER} was very friendly and attentive! We had a great time and will definatly be back with our ten year old son, this is a great place to bring kids! WISH IT WASN'T OVER, SPECIAL THANKS TO THE WONDERFUL FRIENDLY STAFF {DONNA RICHARDS} FOR MAKING OUR STAY SO GREAT!", "Date": "June 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Maryland", "Title": "“Surprisingly Nice”", "Author": "Taleria", "ReviewID": "UR16957835", "Content": "My husband and I stayed there for Father's Day weekend. It was a little confusing on how to entire the property, but once we checked in we were very surprised to see what this hotel offered. The scenery was beautiful! The parrots, fish, palm trees were a sight to see. Staff was very nice and helpful. It was nice to see an indoor as well as outdoor pool, sauna and kids play area. Our room was located on the 2nd floor. The room was pretty well kept. A little dated but our balcony overlooked the sands and the beach (which was really nice)! Only disappointment was the tv and furniture could have used a little upgrading especially for what they charged per night. Overall it was a really nice place to stay and I would come back again.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wilmington, DE", "Title": "“Great stay!!!!”", "Author": "HonestLadyTraveler", "ReviewID": "UR16948824", "Content": "I arrived at the Quality Inn on friday afternoon for a weekend stay with my friends. From the outside the rooms and the hotel look a little bit run down, but the rooms on the inside (we were on the 2nd floor facing the atrium) were really really nice!!! There were double beds, a pull out, and a mini kitchen set up :) We reserved three rooms and all of them were very clean and comfortable. There is a VERY VERY funky smell in room 234 but the other two that we stayed in had no smell AT ALL!!! For the price this is a great place, great location and safe!!! We were only MINUTES from Seacrets and the beach. Would def. stay again, had a fantastic time. The front desk staff was very nice and helpful. I contacted the hotel directly and with AAA discount it was cheaper than expedia or tavelocity!!", "Date": "June 15, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "PHILADELPHIA, PA", "Title": "“I'll give it one more chance this summer of 08”", "Author": "RAYTAMTAY", "ReviewID": "UR15751841", "Content": "Well my wife and I and two children stayed there last summer in 2007. The room liked nice and the view was great, The only problem we had was when we first walked in the smell hit you like a ton of bricks! I cant explain what kind of smell it was, But I did see a review on here below that someone complained of the same exact thing. So I overlooked it and went out and bought a can of lysol and some candles. It did nothing. I will stay there this year because even though I still think its expensive, compared to the rest of the hotels in the area this is cheap. All the other one's want way over $300 per night which is a joke. So We will give it one more shot this year hopefully there will be no smell. If there is I definetly will complain. I cant explain what it was, it was more of a mildewy smell, maybe it was the beach I dont know. but whatever it was, they need to deodorize their rooms big time.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“The BEST choice!!!”", "Author": "a_dallen", "ReviewID": "UR14980948", "Content": "Me, my fiance and our 1 year old daughter had a great time during our stay at this hotel. We were there for 4 days and 3 nights. We are VERY glad that we chose this hotel to stay at. It was wonderful and well worth the money...and at that, it was inexpensive. They supply all of your needs. They have dishes (pots,pans,silverware,utensils,etc) in each room. The rooms and service were outstanding. Room service didnt bother us upon our request...it was very peaceful and relaxing. The Atrium (an area where they have birds, a bar, pool, hot tubs, and fish) was really nice....Our daughter loved the birds! The bathroom and furnishings in the rooms were well kept and maintained...We are definitely going to stay here again this Summer!", "Date": "April 12, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Jarrettsville, Maryland", "Title": "“Stay in the Condos !!”", "Author": "tsalladtsallad", "ReviewID": "UR14603350", "Content": "Every Easter we stay at the nearby Sandpiper Dunes condos owned by the Quality Inn- we get maid service, linens, toiletries, newspapers, fruit, videos etc. just like the hotel guests for a two or three bedroom unit in the tall oceanfront condominium building. By no means a \"luxury\" property, but comfortable and maintained, with reliable staff to attend to any problems- this year we had a missing shower curtain sent over in ten minutes. Condo renters also have the use of the game room, fitness room, tropical atrium, indoor pool, hot tubs and sauna- again not high-end but adequate. Two and three bedroom condo units tow blocks away can be booked directly from the hotel.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Centre Hall, Pennsylvania", "Title": "“A \"Quality\" Inn!! Absolutely Beautiful and Clean Clean Clean!!!”", "Author": "dantheman38", "ReviewID": "UR14466680", "Content": "We were walk ins off the street (late-night). Here's an 'copied' email the I wrote to the Hotel. It says it all. ATTN MGMNT!!!: Matt - front desk hooked us up!! \"Hello.. I just wanted to say that \"Matt\", whoever this NICE fellow is, \"hooked us up\" on 3/13 with THE most beautiful room (#509) and we (my girlfriend and I) would like to say thank you. Matt deserves a big \"hell yeah!\". We needed shelter in the EARLY morning hours of 3/13, he obliged with outstanding room/accommodations, and COMPASSION for road-weary folks that we were with a late check-out as well. I expected the cost to be more, but I KNOW that since it was OFF-season, that is why the room was so reasonable at $43.10 total for our outstanding room. I think Matt gave us the \"Penthouse\" Suite actually. Funny thing is that I asked for MILD accommodations and he \"Hooked Us Up\". I was \"wowed!!!\" by the room upon entering. I was just soo very pleased with our room. He also gave us a late check out as well, which was waaayyy kewl as well. Attached is the \"In-room Questionnaire\"... filled out for you and my receipt for your viewing so you can see that \"MW\" was our check-in person. Once again, thank you for your most awesome accommodations, Id love to stay there again, but I saw your IN-season rates and can not afford those rates for that room (#509) during In-season. but... Its was awesome to sleep in a \"Penthouse\" for JUST one night. Please DO POST this email around your hotel for viewing by walk-in customers that wander in during the late night/early morning hours. please?.. thank you. thanks again... many regards, Daniel Johnson and Karen Branam\" that pretty much says it all from my standpoint and Id HIGHLY recommend this place for families. see photos.", "Date": "March 23, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "pasadena", "Title": "“the worst experience ever”", "Author": "travis1Pasadena", "ReviewID": "UR13864565", "Content": "This hotel is very dirty, mold all around the tub floor. Allowing people to SMOKE in their rooms. Will never stay or recommend this place.", "Date": "February 26, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "maryland", "Title": "“This was the worst hotel ever!!”", "Author": "qutypie15", "ReviewID": "UR12279288", "Content": "This was the worst hotel I have ever stayed in. The doors would not open at first, you would have to slide your key card a million times before the doors would open. The rooms on the third floor were extremely dirty. There were stains all over the carpets, and the rooms needed to be vacuumed. The atrium, where they house all the birds, is dirty and worn down. The birds are out during the night, and they screech constantly! They never stop. And you can hear them in your rooms. The balcony doors don't open unless you put all of your body weight against them.......good luck girls!! There was mold on the ceilings in all the rooms I saw. The cooking areas in the third floor rooms was disgusting!! It was dirty and uncleaned. I wouldn't have cooked on that stove or ate anything from that area, it was revolting. The bathroom was dirty as well. There was a black line that went completely around the bathtub. I wouldn't have touched the shower curtain for anything in the world. This was the worst hotel ever. It doesn't even compare to the hostels that I have stayed in. DON'T STAY HERE!!!", "Date": "January 2, 2008"}, {"Ratings": {"Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Service": "3", "Location": "3"}, "AuthorLocation": "Baltimore", "Title": "“Stay away!”", "Author": "mmcgla1", "ReviewID": "UR12278264", "Content": "My wife and I stayed at the Quality Inn on 54th street for 2 nights for New Years. I have to say that it is the most disgusting place I have ever stayed. Our room was on the 3rd floor that over looked the Atrium. When we first checked in, it was so hot, we had to leave the balcony door and front door open to cool it off because the AC was turned off for the winter. The carpet was mildewed and stained; I wore socks because I refused to let my foot touch the floor. Also, the bathroom was covered with mold and black stuff in the shower. All the caulking was cracking and coming off. The ceiling was also cracking and stained. Our friends stayed a few doors down and their room was just as run down. They had a full size refrigerator that was covered with rust on the side of it. The second day, more friends came down, and they had a newly renovated room on the second floor, which I have to say, was in excellent condition. It was clean, and completely remodeled. We had paid the same price as our friends in the newly renovated room, and our room was a complete dump. So I complained to the front desk, and of course was told that there was nothing that could be done. They were not rude about it; they just said that they were booked because of the holiday weekend. But after seeing a 100 % Satisfaction Guarantee sign in our friend’s room, I went back to the front desk, with the sign, and miraculously, a newly renovated room became available on the 2nd. So I have to say the newly renovated room was very nice, but the Quality Inn should be ashamed to even rent out the old rooms. To expect someone to pay a lot of money to stay in a room with rust, mold, stains, and mildew, is completely unprofessional. Had I known they had newly renovated rooms, I would have complained the first night. Also, I understand that people may go to that Quality Inn to see the birds in the Atrium (I am not one of them), but just to warn you, they do start squawking around 9:00 a.m. Which can become quite annoying.", "Date": "January 2, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Annapolis", "Title": "“A dump that you can not relax in”", "Author": "jpdeadhead", "ReviewID": "UR12179828", "Content": "I recently stayed at the Quality Inn in Ocean City, Maryland on 54th street. Apparently this hotel is more accomodating for some tropical birds than the people staying there. My first room was dirty and smelled so bad from garlic that I could not stay there. In our second room, everything was covered in rust, the couch was broken, and we were given a cable because the advertised wireless internet access was a lie and didn't reach beyond the attrium. We were told to use our laptops in the atrium. The atrium is about 80 degrees with 100 humidity. I didn't want to sit in the atrim let alone have my laptop there. The humidity is so bad in the hotel I could not style my hair properly. The worst part of our stay was the screaming, screeching birds at 9:00am in the morning. At checkout, I was not asked about my stay and when I complained I was told that 1) the hotel has to be humid for the birds 2) people love those birds and come to the hotel just for them. This hotel is a dump for over $100 a night off season in December", "Date": "January 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bel AIr, MD", "Title": "“Another Pleasant Stay”", "Author": "Stat-Boy-8", "ReviewID": "UR10641369", "Content": "Our family has been staying at this hotel in the Fall for probably 8 out of the last 10 years. We have never had a problem. As always, the room was clean, the front desk people were very helpful and accommodating, and the remaining hotel staff were all friendly. We actually met other guests who come here this time every year. There has been discussion on other reviews regarding the birds. Yes, the 14 asst'd Conures, Macaws and Cockatoos can get quite noisy at times. Their cages get uncovered around 9:00 am. If that's not to your liking, you should probably go elsewhere. Personally, I'd rather hear the birds than kids squealing and screaming in the pool. The birds are fed and cared for each morning. I learned that most were adoptions/rescues. They are fun to be around. Overall, the Hotel common areas were clean. You need to note that if you book a room that is Atrium View, (not Oceanfront) and not on the 1st floor (of 3), you will have to go outside, then back inside, to get to the indoor pool/hot tub. Not the best thing when temperatures are in the 40's. While we enjoy our off-season stay, I doubt that we'd stay here, or any hotel/motel in Ocean City, in Prime Season. Simply too crowded for me. Overall, this place is an excellent off-season value.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Scenery Hill, PA", "Title": "“Not worth the money”", "Author": "bummer0531", "ReviewID": "UR8664362", "Content": "This hotel is very outdated. The beach outside the hotel balcony covered in litter. The door area where the lock was, was busted and instead of fixing the piece of wood and putting on another lock, they just moved the lock and left the busted door jam. Atrium is not as it appears online. Very dirty and worn. The pool was dirty and full of sand. They have a sign in the bathroom saying that you may experience a difference in temp in the shower and that it is due to OC's fluctuation in water pressure. The shower went from cold to scalding hot the entire time anyone was in the shower. We stayed one night then left and found another hotel. The new hotel said they never heard of the water problem and we had no trouble taking a shower there. This hotel is not worth the money. Don't book it and be sorry like we did.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Syracuse, New York", "Title": "“Overpriced, poor management, DO NOT STAY”", "Author": "Desi_traveler_77", "ReviewID": "UR8126009", "Content": "We decided to take a weekend get away to Ocean City and in looking for hotels we came across the Quality Inn Ocean front. Everyone had told us to stay in northern OC beacause it was a better area with nice hotels. In speaking with the Quality Inn staff the room rate for the weekend started at $300 a night and after much negotiation i got the price to $199 for each night Fri/Sat. On arrival at the hotel, the first thing we notice is at least 20 Parrots in the \"Artium\". Squaking and screaming like it was a bird sanctuary. Our room was on the 4th floor over looking the ocean. Once we got to our room, it was not even clean. We were told they were remodeled rooms. There were urine stains on the toilet, dried up food on the coutertop, and stains on the tables. That night, it was about 90 degrees outside, and awe turned the A/C on to 65 degrees. My 12mo daughter was up the whole night because the room never cooled down. The A/C was blowing warm air all night. By the time we woke up in the morning our sheets were drenched. When i spoke to the management they told me the A/C controls are reversed and i was supposed to set the temp to 85 degress to cool it down. The following day the A/C broke again. This time the sensor for the door stopped working so the A/C would not turn on because the sensor indicated the balcony door was open and it does not work if the door is open. We called the desk and they sent a maintenece guy up at 10pm. He did not not know what to do, so for an hour he went in and out of the room accomplishing nothing. Finially i fixed it by playing with the sensor. In addition to the A/C, the cleaning staff was extremely rude. After telling the management about the A/C problems we had and the poor condition with which the room was cleaned when we arrived, the desk assured us we would get VIP cleaning that morning. After the room was cleaned we returned to our room only to find trash not taken out, NO towels, more food stains not cleaned, and some trash just pushed under the furniture. The only good thing about this hotel is the view.......the hotel itself is disgusting. After spending nearly $400 over a weekend i feel like i was truly ripped off.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "south jersey shore", "Title": "“Definitely NOT a Family Resort”", "Author": "southjerseymom", "ReviewID": "UR7988031", "Content": "Took a quick 2 night trip last week to OC for some crabs on Father's Day. (Try PGN at 29th for the best crabs ever!!!). Read some so so reviews about the hotel and asked the family to stay in the car why I checked it out. First impression bad...trash all over sidewalk. Pool in back of hotel in parking lot. Windows leading to lobby were so dirty you couldn't see through them. We had booked atrium view because we live on the beach and don't really care about view. We were told room had view of atrium area with tropical wonderland of indoor pool and garden. Yech! Filthy indoor pool, bird cages full of poop. No way was I letting my kids in that pool. I knew I was in trouble. Asked to look at room. Steps up back of building rotted out. Room ok but looked out over discusting indoor pool and smelly birds. Asked to see oceanview. Room worse. Even hubby who hates that I am pickey about rooms said the place was a dump. At $179/night plus 11% tax we wanted out. Front Desk returned money when I politely complained that I just could not stay there. Definitely a senior week crash pad instead of the family \"resort\" advertised.", "Date": "June 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "South Mountain, Pennsylvania", "Title": "“Better than expected”", "Author": "cjajsmom", "ReviewID": "UR7438773", "Content": "We stayed from April 22 through April 25. Our oceanfront room was beyond our expectations after reading other reviews. The bed was extremely comfortable. The room was clean and well-kept. The view was excellent. The parrots were fine in spite of the complaints of another reviewer. Their cages were cleaned daily (I only clean my parrots' cages weekly), they had new toys, they were covered nightly. Some were allowed to be out of their cages. Their wings were trimmed. As parrots go, I think these guys were happy and definitely seemed to enjoy the human interaction. The pool was clean. I was told by someone else that the hot tub was too hot, but I didn't try it. Fruit in the lobby was very fresh and abundant. The coffee area was clean and well-stocked. Coffee was always available. Most of the staff were very nice. There appear to be a number of play areas inside and outside. This is nice for families with younger children. The ground floor ocean front rooms walk out to a protected sandy area. A nice plus for families. We were given a great room rate after I asked for the rock bottom price. If you are used to a luxury hotel, then you won't be happy here. But if you are looking for sufficient accomodations, this hotel will be satisfactory. But -- there always has to be a \"but\" right? Our refrigerator clunked like a soda machine delivering your can every time the compressor went off. Try sleeping through that! We reported it Monday morning. Nothing was done. After two more nights of clunk-clunk-clunk, we checked out a day early. We were not charged for one night, so only paid for two of our three nights. The light on the nightstand sizzled and popped when my husband switched it on. We reported this also on Monday, considering it to be a fire hazard. Nothing was done about this either. No hot water was available our third (and final) morning. Front desk was inundated with calls about this while we were checking out. You could tell they were getting frazzled. Ice machines are only available on the second and fourth floors. I think they should have been available on every floor. We did not receive room service our second day. I guess the two hours we were in the room between 8:00 and 5:30 did not leave enough free hours for them to clean the room? We found a bag of clean towels hanging on our door handle. Would we go back? Yes, but with family in the area, I doubt we'll need a hotel room too often. But if we do, we would probably choose to stay here again.", "Date": "April 26, 2007"}], "HotelInfo": {"Name": "Quality Inn Oceanfront", "HotelURL": "/ShowUserReviews-g41298-d89493-Reviews-Quality_Inn_Oceanfront-Ocean_City_Maryland.html", "Price": "$64 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">54th Street Oceanside</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "89493", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/ce/03/ec/quality-inn-oceanfront.jpg"}}