{"Reviews": [{"Content": "LOVED THE MIRAMAR My husband booked the Miramar for my 40th birthday. We took our 2 kids with us and had a wonderful time, one of the best holidays that we have ever had.Hotel location is excellent, close to beach, restaurants and shopping. Denny's restaurant is at the bottom of this hotel and we ate there inleast once a day for one of our meals (they give alot of food and not expensive)Hotel is very clean and we had no problems with our room and no problems with anything in this hotel and I would recommend this hotel very much and would stay there again. There is so much to do in hawaii and this is why we stayed for 2 weeks. We were there over the Christmas holidays and there were tones of tourists. The island was decorated for the Christmas time and at night all of the palm trees had lights around them and it made the whole street light up. New Years Eve they gave a spectacular fire works show on the beach. We did alot of the tours, but you need to shop around to find the cheapest price, dont book any tours from the hotel its more expensive its cheaper to go around the corner to Afordable Tours. we also booked Afordable Tours shuttle van to drive us back to the airport for $30 because when we arrived to Hawaii we took a cab and it cost us more it was $40 to the hotel.The ABC stores were great! We bought so many things there. If you spend more than $100 just save your receipts and show the cashier and she will give you a free coffee mug. Our holiday was wonderful and very special to us and I thank my wonderful husband for bringing us there for my birthday. I couldnt have asked for anything more.", "Date": "Jan 7, 2009", "ReviewID": "UR639158680", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "ALOHAToronto"}, {"Content": "To The Miramar, with Aloha! We have stayed at this hotel in the past and have always had a very pleasant visit. The location to beautiful Waikiki beach was excellent, a short fun trip through the International Market Place ( good food  many great booths to shop!) a big plus. The management and staff were extremely professional and brought the spirit of ALOHA, as well. Our room had an ocean view by day and at night all the surrounding hotel lights provided a romantic atmosphere.... The rooms are very clean and the beds SO COMFORTABLE for a hotel, we have stayed at 5 star hotels with hard uncomfortable beds. The pool was clean and the food is something to look forward to! Amazing breakfast. Room service is also available, no long waits. We highly recommend staying at this hotel. The Miramar really left nothing to be desired, except another weeks stay!", "Date": "Dec 12, 2008", "ReviewID": "UR965360022", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Diana035"}, {"Content": "Central Location, Average Hotel The rooms were clean and not bad, we had a partial ocean view. The lobby needs a facelift, and seems like its not entirely well taken care of. The smell of fried chinese food from a restaraunt attached to the hotel was the worst part! It seeped through the lobby and ALL through the parking garage - disgusting!The staff was friendly and nice. It was, as you should expect for a three star hotel....One other thing: its on a busy street, and at night there are prostitutes hanging outside the hotel, who are actually quite aggressive from what we could see. Also there were drug dealers on that block and a couple blocks either way that offered us drugs on several locations (not the hotel's fault per se, but speaks to the location).You're about two blocks to the beach, so its a nice central location. Parking costs 10 dollars a day, which is a bit of a pain.All in all, if you're there just to sleep, which we were, the hotel is pretty good for that, as your room will be clean and well kept.", "Date": "Dec 11, 2008", "ReviewID": "UR931930266", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "vanessaxox"}, {"Content": "Good value for Waikiki We stayed at this hotel in 2006. We were staying at a different hotel this time Dec/08 called the Outrigger Waikiki pre-cruise and stopped in after the cruise at the Miramir in case we extended our trip. The hotel is reasonably priced/clean and has a very convenient location within walking distance to the beach. The staff member Ryan that helped us this time was excellent and we would definitely book there again!", "Date": "Dec 8, 2008", "ReviewID": "UR642602769", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Calgarygirl73"}, {"Content": "Miramar My family and I stayed at this hotel from Sept 15-26th and we had the best experience, excellent room, very clean. We had a wonderful view of the ocean and of the city. The staff at the hotel was very friendly, very accomodating and helpful. Our Chambermaid was wonderful. The whole hotel and area around the hotel was very clean, we couldnt' get over how much and how often they cleaned and even moped the sidewalks. I would definately recommend this hotel, the breakfast buffet is very worth your while.", "Date": "Nov 3, 2008", "ReviewID": "UR413208836", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "shanl"}, {"Content": "Awesome Stay at the Miramar       My first rainbow in Waikiki", "Date": "Oct 20, 2008", "ReviewID": "UR903573427", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "donnster1"}, {"Content": "Good expirience       Wow!", "Date": "Sep 27, 2008", "ReviewID": "UR369135960", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "OlgaW"}, {"Content": "Loved it!       Our Lanai", "Date": "Sep 17, 2008", "ReviewID": "UR318839170", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "sportsmom03"}, {"Content": "Good hotel I'm a resident of Hawai'i who stayed at the Miramar over the weekend. The rooms were a bit low-end; the beds and TV were a little too small. I enjoyed the view from my balcony, though, and I really liked the fact that the International Marketplace and Waik墨k墨 Beach are just minutes away (walking) from the hotel. There驶s a Denny驶s right downstairs that I had breakfast from and other restaurants a good walking distance away.All in all, a good hotel, especially for those on a budget.", "Date": "Sep 16, 2008", "ReviewID": "UR806073409", "Ratings": {"Service": "-1", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "Kalathalan"}, {"Content": "Great Location, Great Value We loved staying at the Miramar! This is our 2nd time we've stayed here, the last time being 2 years ago. For the price and location, it was great! It was right next door to the International Market place and only 1 block from the beach. And lots of good restaurants within walking distance. The hotel itself was clean. The kids loved the pool and we'll be returning here again. If you want a hotel with a prime location (not on the beach) and your on a budget, i'd definitely recommend this hotel. Oh and one more thing... parking at $10/day is a deal! All other hotels charge atleast $15/day.", "Date": "Aug 12, 2008", "ReviewID": "UR409421091", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "shay2911"}, {"Content": "Great Location  I stayed at the Miramar during July 2008. The hotel is in a fantastic location, close to restaurants, the International Market Place, public transport  nightlife, also just a short 200m walk to the shores of Waikiki Beach. The staff were very friendly  helpful, nothing was ever too much trouble for them. Rooms were average but reasonable for the price of the hotel. Good value for money, clean and comfortable.", "Date": "Aug 8, 2008", "ReviewID": "UR791293941", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "LiveToTravel83"}, {"Content": "Reasonable and repeatable Went to Hawaii for our son's destination wedding. Was busy constantly and really enjoyed returning to the hotel for a good night's sleep. Everything was clean and well cared for. The staff was pleasant and helpful. Had read all kinds of reviews on this hotel so was wondering what it would be like. We were pleasantly surprised. If you are looking for a high end spa atmosphere then this is not the place, but should you require a nice hotel in the middle of everything then you do want to stay here. We were in the thick of the action and able to commute anywhere from the front entrance where the buses stopped. It was a very short walk to the beach and there is so much to see along the way. The International Marketplace is mere steps from the side entrance of the Miramar. We did not receive breakfast with the room, but found it not to be a problem since Denny's was right there in the hotel. If you are on a budget or perhaps a fixed income then this is the place for you. We would stay again.", "Date": "Aug 7, 2008", "ReviewID": "UR780608351", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "travelnowandthen"}, {"Content": "Great location        View", "Date": "Aug 6, 2008", "ReviewID": "UR510670497", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "COLT15"}, {"Content": "A Defininative \"YEA\":       Night View", "Date": "Aug 2, 2008", "ReviewID": "UR649947435", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "retdeltee"}, {"Content": "A Wonderful Stay! We just got back from 9 days at the Miramar. To say the least, we were overwhelmingly surprised. We've been to Oahu almost every year since 1994, and have stayed at numerous hotels and condos in the Waikiki area. Although we never stayed at the Miramar before, we were extremely pleased with our stay. From the beginning of our search for a smoker-friendly hotel, I was in contact with Angie via on-line reservations. She was extremely friendly and helpful throughout. Before our trip, we knew that we didn't book the Hilton, however, we were concerned about our upcoming trip. While the hotel could use a little TLC in certain areas, we were very pleased with the large rooms (we booked two connecting rooms for the four of us), and the pool area was larger than we had at other, more expensive hotels we previously stayed at. Parking was a breeze in the hotel lot ($10 per day), and being across the street from the Food Pantry, two blocks from the beach, and steps away from the International Marketplace made our trip so much more enjoyable. We will definitely make future plans to stay at the Miramar again. We thoroughly enjoyed our time and accomodations at the hotel!", "Date": "Jul 25, 2008", "ReviewID": "UR616847193", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "alohabigmoe"}, {"Content": "Awesome!!! I loved my stay at the Miramar. The staff was pleasant, friendly and very helpful iwhen I needed directions. This is the first time Itravelled by myself and i felt very safe and secure with the hotel security. It is close to the beach and all the stores. There is a grocery store right across from the hotel and a delicious chinese food restaraunt (Fattyies) I would definitly stay there again", "Date": "Jul 15, 2008", "ReviewID": "UR631808381", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "supergirl2008_8"}, {"Content": "stay away We just got back from our stay in Oahu. It was great except for our first night at this hotel. When we arrived it was late at night so we decided to go ahead and tuff it out for one night. The smell of a moldy must was just terrible from the second we stepped of the elevator onto the 11th floor and was worse when entering the room. My whole family was stuffed up and coughing by morning. When I inquired about it, the Manager said it was probably the chemical they used when cleaning the carpets and it probably just needed aired out. However, when leaving the room, the housekeeping informed us that they had sprayed for something the day before and that was probably what we were smelling. I couldn't understand what she said that they were spraying for and am not sure I would have wanted to know. The bathroom was dirty. The sink fictures had scum around them as well as the tub. I showered with my flip flops on because I couldn't stand the thought of touching that surface. We switched to a hotel that was 100 percent better. We enjoyed the rest of our vacation and hated to leave.", "Date": "Jul 15, 2008", "ReviewID": "UR608053824", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "2"}, "Author": "tjr082"}, {"Content": "Miramar Hotel. Having travelled to Honolulu at least once a year for the past 10 years, we have been able to 'tailor' the two weeks to suit our needs each time. This is the first year we have stayed at Miramar and found the accommodation more than adequate for our needs.The very comfortable Deluxe room was of ample size ( larger than rooms at more expensive hotels we have stayed at) with a spotlessly clean bathroom, perfect size balcony overlooking the pool with plenty of afternoon sunshine. The best feature was the quietness - no traffic noise and no tourist buses arriving at 6am- yet it is in the heart of Waikiki with the Food Pantry and The Bus stop across the road, International Market next door and within walking distance of many features. PERFECT.If one avoided getting out of the lift on the fifth floor, the hotel was fine. The fifth floor foyer is GRIM and needs a good clean out. There are tatty signs and sad plants, tired floor tiling, a mismatch of seating and several incongruous drink machines to assail the senses, as this area provides access to the dining room and the pool area.A disappointing aspect was that after arriving from Sydney at 10.30am we were not able to access our room until after 3pm - a real nuisance as we had left home at 10am the previous day to travel to Melbourne, fly to Sydney, wait the 2+ hours then fly on to Honolulu (plus the four hours time difference). All we wanted was a shower, change out of our winter clothes and get settled. Being so tired and in need of somewhere to relax, it felt as if we were wasting the first day of our all too brief two weeks. Along with others who were waiting for access to their rooms, we ended up 'snoozing' on the lounges in the foyer until 3pm.On departure day, we had checked out and left the hotel before 5.45am, as had a number of other tourists. Thus in such a considerable time frame, it must be surely possible for newly arrived guests to access their rooms prior to 3pm", "Date": "Jul 9, 2008", "ReviewID": "UR562662685", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "katiepat"}, {"Content": "Very goog hotel for the money This is a very nice hotel that is centrally located in Wakiki, next to the INternational Centre at a reasonable price. The breakfast is very good and the hotel staff are extremely friendly. I would recommend this hotel to anyone who would like to save money and feel good in Hawaii. Aloha.", "Date": "Jul 5, 2008", "ReviewID": "UR403870652", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "xmlemc6v"}, {"Content": "A great place for Waikiki We just got home from a ten day stay at the Miramar. (June 23 - July 2)This is a great hotel for people wanting to be close to Waikiki, but not have to pay the higher prices on the main strip (just one block away). This is a nice hotel that is a solid 3+ star hotel. It is not a one of the glitzy and polished hotels - but it is clean, with adequate room space, great front desk, helpful and polite staff, and attentive housecleaning services.The pool is simple, as is the restaurant, and pool bar - and all three are on the same floor.For my family, what was fun about staying at the Miramar is that it is so centrally located to most of the excitement at Waikiki. We enjoyed wallking around the International Marketplace and adjoining shopping plazas. The shops all look the same, and the prices are all about the same too.... so just browsing in the stores was fun to see all the nick-naks and shirts and Hawaii memorablilia. There was enjoyable (free) shows at the food court.And just outside the IM is the action of Waikiki with the beaches, shows and hotels and restaurants.In summary, if you want a more affordable hotel with a pleasant staff, adequate accomodations, and a GREAT location, the Miramar is the place to go. Aloha!", "Date": "Jul 3, 2008", "ReviewID": "UR811264660", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Ccc4angels"}, {"Content": "Another great stay at Miramar       Partial Ocean View King 18th floor Miramar", "Date": "Jun 30, 2008", "ReviewID": "UR575812245", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "eyelive2travel"}, {"Content": "very friendly not noing what to expect when ariving to the miramar was a little concerning since my husband and i had never traveled to honolulu before and we pulled a hotel basicaily out of a hat. we are somewhat of budget travelers but like a nice clean hotel with nice amenities. wow this was everything and more. we stayed 8 wonderful nights the staff was so very friendly all of them. the rooms were very clean and the beds very comfortable. they have a nice pool,a great longe with music and great drinks. the hotel has a gift shop and a cloths store a dennys and few other places to eat. location was awsome just around the corner to the beach.the bus stop is right there(they have a great bus system in honolulu)and lots of abc stores. they have a tour office to help you book your adventures. i made a point to walk into the lobbys of a bunch of other hotels and snooped at the pool areas and i was so glad i was staying were i was staying. so if the hiltons not in your budget don't miss out on this gem.", "Date": "Jun 12, 2008", "ReviewID": "UR603417847", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "cindywashington"}, {"Content": "great spot to stay this place is very central to everything. beach is a very short walk. international market is right outside hotel. breakfast was included with our stay. not a bad breakfast for free. my 80 year old mom and 2 sisters plus my niece and daughter 25 years old all had a great time. street was pretty noisy fri and sat but all was great. would stay there again.", "Date": "May 31, 2008", "ReviewID": "UR558794464", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "BUDDYMORROW"}, {"Content": "Great Room For The Price We stayed at the Miramar for 5 nights. This hotel has several things going for it: Location, Price and Hospitality. Our room was a Deluxe with breakfast and we were not dissapointed. We actually were impressed that it was much better than we were expecting. It was clean, had everything we needed-Good shower, comfy beds, cable TV, small fridge and coffee pot. The employees are all very friendly and helpful. Our buffett breakfast was good (not excellent) and hot. The location is great for shopping (International Market Place is next door), dining and nightlife. We did have to walk to the beach but just thru the market place and across the street. The pool is small but clean and there is a bar at the pool. We really enjoyed our stay and if we do go back to Honolulu I would stay there again without reservations. The bus stop is right across the street as is a market. I read several reviews about this hotel before booking it and it lived up to the reviews. I will say that it is NOT a five star hotel and if you do want all the amenities this is not the place for you. If cleanliness is important this place has it. Again the location could not be better.", "Date": "May 30, 2008", "ReviewID": "UR384765787", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "urbud"}, {"Content": "Great Value for money, as always       View from balcony", "Date": "May 29, 2008", "ReviewID": "UR198885155", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "travelround"}, {"Content": "Good, but not spectacular. We stayed here. It was a good stay. The room had a refrigerator and great housekeeping. Remember you are going to Hawaii for something other than the room. The hotel was located next door to the International Market, that was nice. They have a nice pool and laundry room. There is a Chili's restaurant right across the street.", "Date": "May 14, 2008", "ReviewID": "UR689142037", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "BlaineAndRobin"}, {"Content": "Third times not the charm! This was our third time staying at the Miramar. The last 2 were good, the hotel was nothing fancy but nice rooms and very clean with a great location. So when we booked this time we didn't hesitate to stay there again. It sure has changed!! The rooms are in dire need of renovation, especially the bathrooms. And it wasn't very clean! There were small ant like bugs all over the room, not to mention the mid sized beetles we found!! We asked housekeeping to spray, and they did but by that night they were back! The safe in our room didn't work, and after an hour of sitting in our room while they tried? to fix it, were told there was nothing they could do...now where do you keep your travel documents when in a foreign place? Now for the breakfast that was included in our package...YUCK!! I don't recommend eatting at Sammys on the 5th floor!! I think I can honestly say that it was some of the worst food i've ever eatten! It took quite awile just to find a clean plate to put your food on and then when you did and got back to your table it was just gross! We ate there 2 mornings and thought its just not worth getting sick over, so we ate elsewhere. There is a really good little bakery just around the corner...try it or Dennys instead.Anyways I hope this helps someone make a decision about where to stay. I know we won't be staying there again!", "Date": "Apr 30, 2008", "ReviewID": "UR207491757", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "peanutwill"}, {"Content": "Outstanding Service and Best Value The Miramar is the best value for your dollar. The location is great. Right outside is the international market place, a five minute walk to the beach, less than a block from the bus, and across the street is a grocery store. The staff is top class, from the nice lady in charge of cleaning our floor, to the bell hops, who not only helped us with our luggage, but also directions and information on the bus system, the front desk gave us discount coupons for area restaurants. The general manager is one in a million, he made our stay very nice. The hotel was going through some renovations, so he personally gave us a tour and then let us pick out a room, that would work best for our family. If your on a budget, but don't want to skimp on quality, this is a great place to stay. I would recommend getting a deluxe ocean view room. (On a floor higher up in the building.) You'll be able to wake up and watch the surfers playing on waikiki every morning. Doug  Mary- Washington State", "Date": "Apr 21, 2008", "ReviewID": "UR956851860", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "millihands"}, {"Content": "Good value! We plan to go back to Honolulu, and we'll definitely stay here again. This isn't a five star hotel, but we didn't want one anyway. All we needed was a place to fall down and sleep. The rooms were clean and quiet, the staff were friendly and helpful, and Sammy's restaurant was a great place to catch a quiet bite to eat away from the rush of Waikiki. The location was perfect for us: the lobby opens right onto the International Market Place, it was close to all of the shuttles we needed to get anywhere else, and it was a short walk from the beach. Good value if you're not looking for the red carpet and white kid gloves kind of stay.", "Date": "Apr 21, 2008", "ReviewID": "UR248305530", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "darkwing75"}, {"Content": "Great Value for the Price We stayed at the Miramar from 3/12-18th. Which went into Spring Break. We stayed with our two boys and thought it was great stay. The rooms were clean and the location was great. We had a wonderful time in Hawaii. We loved that the front desk would always help us when we were looking for anything. They suggested many restaurants and even helped us look for coupons. We loved shopping at the International Market and loved that the beach was walking distance. We rented a car for an entire week but we didn't use if for 2 days. So, if you rent a car you don't need it the whole time. HOwever, we did get a weekly rental discount so it was better for us. The staff was friendly and the room was good. The beds were very comfy as well. I would recommend it.", "Date": "Apr 3, 2008", "ReviewID": "UR703178524", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "JAM11"}, {"Content": "Great location I thought that the Miramar was in a great location with the International Market Place attached to it. It seemed fairly quiet around there, and not to out of controle. Our rooms were nice, and the airconditioning seemed to work just dandy. The TV was a little shady, but I didn't come to Hawaii for the television. I found that the staff was very helpful especially the VIP tours lady. She would tell ya where to go and how to get there, give you maps etc. Helped us with car rental and everything. I felt very comfortable and safe there aswell. Everyone was very friendly. If you get a good hotel room, you'll be able to see Waikiki beach, which is a beautiful, if not you get the view of Honolulu which is beautiful aswell. Great place, good price!", "Date": "Mar 28, 2008", "ReviewID": "UR447486590", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "canadian_birss"}, {"Content": "OK for a budget stay in Honolulu My wife and I went to Hawaii for the month of February. We spent 2 weeks in Kauai and the rest at the Miramar. We were on the top floor, not exactly a penthouse though. The view was of more high rise hotels, with a glimpse of the ocean if you twist your head around enough. The problems were with the room itself. If you have a choice, don't get onto the top floor. The air conditioning couldn't bring the temp of the room below 79, and that was in the middle of the night with AC on full. During the day, the temp was in the low 80's in the room. Even after letting the front desk know about the problem, they told us they would send maintenance up but the problem was never fixed. There is a window across one full wall, but it didn't open and there was no balcony. We would look out the window and see hundreds of other windows with balconies, but none in our room.The positives about the place is its location. The hotel lobby opens into the International Marketplace. It was a lot of fun to just leave the hotel and walk around the touristy shops. It's a few blocks off of the beach, an easy walk. The pool was on the 5th floor on the roof, and it was nice and clean. There was a tiki theme bar next to the pool.One recommendation for tourists, go to the North Shore of the island, about a 30 minute drive depending on traffic, and go to one of the shrimp trucks. We tried Mackeys. It had a sign with pictures of Rachel Ray and her $20 a day food show. A shrimp plate was like $11, but well worth it.The parking garage ($10 a day to park) was cramped and difficult to navigate. Lots of paint marks on the cement walls and posts from rental cars.Overall the stay was a good one, after all, it was in Hawaii. However, when we make the trip again, it will be in a different hotel.", "Date": "Mar 28, 2008", "ReviewID": "UR339401495", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "massls"}, {"Content": "Good value for money We recently spent a 3 night stopover at the Miramar on our way to Canada. The rooms were comfortable and clean and good value for money. We were a little worried we were going to be too far away from the beach and main town when our transfer bus made us the last stop on the drop off but needn't have been worried. While we didn't have beachfront views we could still see the ocean from our balcony and it was really a short walk to both the beach and the shopping. In fact the location was great. We like to just pick up a few extras such as snacks and there is a convenience store just a street or two away which served the purpose. Also was handy to some of the Trolley Tour pickups.A pleasant experience for the start of our 5 week tour.", "Date": "Feb 6, 2008", "ReviewID": "UR901268258", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "familyideals"}, {"Content": "Great staff, handy location The staff: Everyone we encountered were pleasant and helpful. The maid staff was excellent.Rooms: We are smokers so we were on a smoking floor (18). We were there when it was quite windy and some of the other people on our floor didn't quite grasp the fact that if you left the lanai door open during the wind the ceiling tiles would bang and the front door would slam shut. So there was some late night banging on a few nights. Someone at the front desk must have figured out the culprit because a phone rang and the banging stopped. The rooms themselves were fine. It is nice to have a mini fridge. Elevators: Just a note, if you are on a high floor there is quite a wait for the elevator in the morning so plan your morning accordingly. The pool: Plenty of chairs and lounges. The pool is heated by the sun, so since it can get shady in the late afternoon it is a little chilly. The pool bar has a daily special and the bartenders are all quite nice. The bar closes at the vague time of sunset, but they all asked if we wanted anything before they left for the day. (tip) bring your ice bucket down with you and fill it before you head back up to the room. The ice machine is on the 5th floor with the pool and restaurant. Location: Aside from the staff this is the hotel's best feature. Easy walk to the beach. You can get to Duke's thru the International Marketplace very easily (if you aren't distracted by shopping that is). Lobby: We did a few mornings of waiting in the lobby for family and it is spacious with plenty of seating. Parking: We didn't have a car, but when my cousin came in from the North side he was able to park in the lot for a reasonable amount. The lot is tight, but apparently that is the norm in Honolulu. All in all a very pleasant stay!", "Date": "Feb 4, 2008", "ReviewID": "UR696751035", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "PacificNWAuntiem"}, {"Content": "FAMILY FUN ON OAHU Our family went on holidays to Oahu from January 1 - 9, 2008. There were 14 of us, aged 5 to 66 years-old.It is easy to fly to Oahu with a great selection of airlines/price as well as non-stop flights. The airport is well-organized and it took us about 15 minutes to get our luggage and leave. Some of our group purchased an airport transfer which included a 'lei greeting'. Unfortunately, they ran out of leis so many people didn't get them. We stayed at the Miramar at Waikiki Hotel. It is 15 minutes from the airport. Some of us took a taxi which cost $35 ($30 transportation and $5 luggage fee). There are many shuttles that you can book to and from the airport (cost $8-9 per person). We have heard that Robertson's is the most reliable. DON'T use Ohana Express Shuttle (we booked them for when we left and they didn't come to get us. We phoned them twice to remind them on the evening of our departure. In the end, we ended up taking a taxi to the airport 45 minutes after our scheduled pick-up time with Ohana!).The check-in at the Miramar was done in less than 5 minutes. We stayed on the 15th floor with partial ocean views. The hotel wallpaper and carpets are old but it was otherwise fine. The rooms had 2 double or 1 king-size bed, 2 night stands, 1 table with 2 chairs, 2 dressers, a small fridge, coffee maker, TV, safe, iron/ironing board, hairdryer and a balconey with 2 chairs and small table. There is some traffic noise that you can hear but it didn't bother us.The hotel has 3 restaurants but we didn't try them as there are so many other places to eat. There is a grocery store right across the street which also serves deli sandwiches, sushi and fresh creampuffs. The Denny's at the hotel is extremely busy. Despite that, we never had to wait longer than 15 minutes to get seating for 14 people. We also ate at Perry's (buffet, 1 block away), IHOP (family fare/pancakes, 3 blocks away) and Chili's (TexMex, across the street). For fine dining, we went to Keoni's (Thai/Seafood, very good, 1 block away), Cheesecake Factory (variety, excellent, 2 blocks away - very busy so eat early as wait-times are over 1 hour by 7 p.m.) and the Hula Grill (variety, above Duke's on the beach, excellent food, beautiful view, 2 blocks away). For lunch, we tried Duke's (beach bar so you can go in your swimsuit/bare feet if you want) and Cheeseburger in Paradise (excellent burgers and good portions but very overpriced/no view). The Hyatt Snack Bar on the beach is excellent. Reasonable prices, good variety and large portion sizes.The hotel pool is a good size and well-maintained. About a quarter of the pool area gets direct sun and the rest is in shade. Waikiki Beach is only 1 and a half blocks away. There are many activities to try there or you can swim/soak up the sun. There are 2 enormous turtles that live in the reef at Waikiki and you can see them swimming throughout the day.The International Market Place is at the base of the hotel. We found that the vendors overprice their merchandise and then sell it to you for about 40% of what they asked. Duke's Lane is 2 blocks over and has many vendors with cheaper prices. ABC stores are every block in Waikiki and sell almost anything you want at reasonable prices.At night, there are street performers 1 block from the hotel. It was fun for the family to walk the street and see them. There is also a live band on the beach at 6:30 p.m. each night about 4 blocks from the hotel. The hotel has a lounge but we didn't go in. We did go to Coconut Willy's Bar and Grill above the marketplace. It has a live band every night. We also went over to The Yard House (a sports bar and restaurant). They have 110 beer/ale, a good menu and multiple flat-screen TVs with different programming on. There are prostitutes out in the late evening about 1 block from the hotel (near Ohana East Hotel).There is lots to do in Waikiki, Honolulu area and on Oahu. These have been well-reviewed in the travel guides and trip reviews here so I won't go over it again. I would strongly encourage people to rent a car as it only takes 40 minutes to go to other side of the island to less-crowded, fun, beautiful beachs.We had a lot of fun on Oahu and would definitely go back. Miramar Hotel has a perfect location for families and I would highly recommend it.", "Date": "Jan 27, 2008", "ReviewID": "UR241273547", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "TBayTravellers"}, {"Content": "Great Value if you are on a budget The Miramar has a great location. It opens up into the International Marketplace and has lots of great shopping nearby. It is about a 10 minute walk to the beach, so if you plan on lounging on the beach, look elsewhere. The staff was very friendly. The rooms looked like they were in need of some renovations. Our ocean view really wasn't. It was more like a Partial ocean view because there were buildings blocking the view. The balconies have a thin separator and you can hear the people outside next to you. The breakfast buffet is ok. I think it could use a few more items. I think a big selling point for this place is the location.Overall this property is a great value. If you are on a budget or are just looking for a place to rest your head at night, this is the place for you. If you would rather be closer to the beach and have alittle more money to spend, look elsewhere.", "Date": "Jan 26, 2008", "ReviewID": "UR883275526", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "travelgalpdx"}, {"Content": "Average at best       Room 1724", "Date": "Jan 12, 2008", "ReviewID": "UR683713040", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "Suilenroc"}, {"Content": "Good Place to Stay We spent a week a the Miramar in Waikiki. Our room on the 20th floor overlooking the pool. Good view, we could see part of the ocean and on the other side, part of the mountains plus the downtown area. Looked out over the International Market Place (go out back door of Miramar to the shops) Lots of elevators (one on outside with glass view)Room was very clean, everything worked well, bed was very comfortable. Bathroom could use a fan but there was no signs of mold.Breakfast was buffet and there was a great selection and was tasty. Air conditioning was quite cool in the dining room. Service was fast and staff friendly.Other Staff were excellent, very accommodating. We went on a cruise the next week and since the ship docked around 7:30 am and we didn't fly out until 11 pm, the staff at the Hotel allowed us to store our luggage there for the day. We could also sign out their pool towels to go to the beach for the day. Great P.R.We understand that they are renovating in 2008.We would recommend this hotel to anyone and would stay there again.G. Foster", "Date": "Dec 19, 2007", "ReviewID": "UR447573619", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Apple_Blossom01"}, {"Content": "Great Value       front of Hotel taken from Kuhio St.", "Date": "Dec 10, 2007", "ReviewID": "UR971413954", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "MissouriPapaBear"}, {"Content": "Great value for money - everything you need The Miramar Waikiki is a short walk away from beautiful (but crowded) Waikiki beach and designer clothing stores. The pool area was very nice - located just in front of the restaurant and there is also a bar right next to the pool outside. The pool area is not the most lucsious or exotic pool areas I have had the pleasure of relaxing at but it is adequate and you still get drinks served right next to the pool.Friendly staff. Check in and check out no problems. Room was nice, neat and large with a small balcony with some pool views and a view across the road to another hotel. I recommend you ask for a room about half way up in the buklding (which is where our room was) so that you can escape noise from kids playing in the pool. Bathroom big and clean. The locaton is great with the international marketplace basically adjoining the hotel lobby. Lots of great souvenier shops to buy last minute gifts such as sarongs, wood carvings and jewelery.TIP FOR LUNCH: Italian restuarant to the left of the Miramar and across the road. Or the restaurant downstairs.TIP FOR BREAKFAST: The restaurant downstairs in the hotel does an all you can eat buffet breakfast.TIP FOR CHEAP DRINKS: Opposite the Italian restaurant across the road from the Miramar there is a tiny little bar where they have super cheap drinks and super cheap Mai Tais.TIP FOR LUAU: Paradise Cove luau.", "Date": "Dec 4, 2007", "ReviewID": "UR168824602", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Sarah2007Sydney"}, {"Content": "Ok hotel We checked in with another couple and were on the 12th and 19th floor. The front dest people were very nice and said we could call the next morning to get closer rooms. This property is close to many things and the only drawback is that noise echoes up the buildings. This was only a problem at 2, 3, and 4 am when people were leaving the bars. We also had a view of the Ohana East and there was an unusual couple who liked to parade around naked and take pictures of themselves. On our last day they were replacing carpet in all the 19th floor rooms but we were not rushed and there was no noise. Next visit we will stay further from this area although it is close to the action for those who like that.", "Date": "Oct 18, 2007", "ReviewID": "UR806855478", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "2"}, "Author": "Matthew72"}, {"Content": "Nice and clean hotel We (with two kids) have been here one week for a beach holiday after a three weeks tour through the US. The staff is very helpfull.Rooms are clean but standard. Two queen size beds, TV, bathroom. A save is in the hotel room available for $2.25 a day. (can be locked and opened with code)In the hotel there is a small travel agency to book tours. We did a one day tour on the Island. It starts at 6.00 am but the hotel made some breakfast boxes and we made some coffee one our hotel room. Rooms have coffee machine with free available coffee pads. And a fridge for cool drinks which you can buy at the supermarket next to the hotel.It closes at 1.00 am and opens again at 4.00 am. So after our 5 hours delay in LA we were able to buy some snacks and drinks.The breakfast is a buffet (scrammbled eggs, toast, fruits etc. the standard American food). There are a lot of Asian guest so rice and soup is also available during breakfast.We had a late flight back to LA but they gave us a late checkout (6.00 pm) so we were able to spend out last day at the beach and pool and take a showers before we went home.Nice hotel in the center of Waikiki. Pool is on third floor (Enough Towels and sun beds available). Hotel is on a short distance to the Waikiki beach (5 min walk).", "Date": "Aug 3, 2007", "ReviewID": "UR943903293", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "vgerwen"}, {"Content": "Okay hotel with a great location... The Miramar was okay. Nothing fancy or luxurious, just average. The location is awesome. Waikiki beach is just a short walk away and on the way there, you can go shopping at the International Marketplace or at any of the numerous little shops nearby.PROS: Short walk to beach, awesome beach, next door to the International Marketplace, ABC stores (kind of a Hawaiian 7Eleven) literally on every block, good breakfast buffet, nice views from your balcony, supermarket across the streetCONS: boring and outdated hotelI don't have anything really negative about this place, just that the rooms are dull. But a person can do better with a more luxurious and comfortable hotel. This place is NOT for a romantic getaway or honeymoon. TIPS: For quick souveniers, yet with strong Hawaiian flavour, go to the International market place downstairs. You can get cheap fast food meals there. Take a surfing lesson at the beach for $35! Don't go to Hawaii and miss out on surfing.When I was there, my dad lost our credit cards during snorkeling and we didn't bring checks either so we had to survive on cash only. We ate at the food court in the International Marketplace almost everyday and were still able to have a good dinner at Chili's on the last night. The lobby was very helpful in helping us locate the local police station to report the losses.", "Date": "Jul 8, 2007", "ReviewID": "UR690172580", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "hawaiiluvr"}, {"Content": "Good location A fine older hotel just a few blocks from the beach. About 20 stories, you get a good view from high up. Kidney shaped pool is on the 5th floor, as is a restaurant. Open lobby and several elevators make it accessible to disabled or older folks.Staff was friendly. Bell staff very helpful.Room was good sized with a balcony, two chairs and a small table. Coffee in room and a small fridge. Queen sized beds.I'd give it 4 stars.", "Date": "May 11, 2007", "ReviewID": "UR849886491", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "NorwestIlliniWineGuy"}, {"Content": "If you have allergies do not stay at the Miramar       Hotel management says its not...", "Date": "Apr 30, 2007", "ReviewID": "UR514346266", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "Beachbab31"}, {"Content": "Wonderful 16 night stay but with a few hiccups! We just got back (last night) from a 16 night stay at the Miramar Hotel in Waikiki. We are from Sydney Australia and I have personally been to Honolulu 7 times.We travelled with a variety of ages.Firstly, there was myself and my husband and our 5 kids aged 13,11,5, 3 and 21 months. We also were travelling with my 73 year old mother and our best friends and their 13 month old son.We chose the Miramar as we have stayed there before and also because of the FANTASTIC LOCATION!Check in was smooth and the front desk staff were friendly. We arrived at 11am and check in is not until 3pm. We were told to come back around 2pm but we walked around and had lunch and returned after 3pm and the 3 rooms were all ready to go.We had requested rooms overlooking the pool and we got that on the 14th floor and were happy with our rooms. Sure...they are a little bit dated but I personally found the decore to be tasteful...not TOO Hawaiian or tacky and personally I found the room size comfortable. We even had a crib in our room for our 21 month old. Having a bath in the bathroom is a bonus, especially when travelling with young children. Not many hotels in Waikiki have a bath. The view from the Lanai is lovely.The location of the hotel is great. For a family, personally, it doesnt get much better (unless you have BIG BUCKS). The walk to the beach is about 7-10 minutes away depending on which end you are going to. Personally we liked the beach in front of the Hilton hawaiin village which is a longer walk but it was more child friendly and you can rent many things form aqua bikes to canoes and so on. Also, much less busy than in front of th Sheratons.As for places to eat, this location has it all. Denny's which is a favourite for us with so many children, is in the hotel, on the bottom level. Also, many fast food places, Jack in the Box, KFC, Burger King, Subway all within a very short walk. Chili's is across the street, as is Perrys Smorgasboard. There are some more upscale places to eat as well but seeing as though we do have 5 kids, we didnt go to many of them. We did go to the Cheesecake Factory which is a MUST for everyone. Worth every cent. Amazing place, great atmosphere and the food is the BEST! We also at at TGI Fridays which was a 10 minute walk along Kuhio Ave. IHOP is about a 7 minute walk and also child friendly.Miramar is right next to the International Market place which is a great place for all your souveniers and just nice to walk through day or night. There are some bars in there too and a good food court. We didnt eat there but it was usually busy which is usually a sign of good food and cheap too.We liked the pool area and the kids were happy with the pool. Yes it was a little on the cool side but the weather was warm so the kids were happy to be in cooler water and once you were in, it was lovely. Others have complained about the bar. We went to the pool many times and the bar was open and the staff friendly and the cocktails were great! So no complaints from us about the pool area or the bar. The elevators were ALWAYS fast and never too full and there is a glass elevator on the side which has a beautiful view and was a favourite for us.There are 2 small stores in the lobby. One is clothing store and we didnt go in there but the other had souveniers and supplies like sodas, liquor, some groceries and so on and the prices were actually rather good!!We always found the front desk staff pleasant and helpful and we cashed travellers checks everyday and that was never a problem. The laundry on the 5th floor (same floor as the pool) was handy and it's $1 for the washing machine and also the dryer. We bought some cheap laundry powder at a supermarket which worked out better for us as we had to do laundry a few times during our 16 night stay.Now...we did have a few drama's with our stay which did put a downer on the experience which is why I am not giving this hotel 5 out of 5.On day 9 we were sitting in the interconnecting room and one of my kids informed me that water was coming from the ceiling of the bathroom in the other room. It turns out that there was some pipe problem in the room above and we ended up with massive amounts of water (which came from the sewerage pipes) in our bathroom so we had to up and leave that room at 9pm at night!!!!!! The response to the problem was extremely fast but it was a MAJOR inconvience. As you can imagine, travelling with so many children, we had completely unpacked. We were told we could come back in the morning and pack our things and be moved to another room.. My Mother and 2 older kids stayed in their connecting room until morning and then we were all moved to the 22nd floor. The view from this floor was amazing but its the only floor without a balcony so this was a definite inconvenience as my husband and I loved sitting out there and having a quiet drink once the kids were settled each evening. Also, the rooms seemed warmer up there and we did have a problem with our AC. Again, the response to the problem was fast but after the problems we already had, we found this another inconvience.I would never choose to stay on floor 22 for the reason of no balconies, 21 would have been nice :)Drama's aside, our stay at the Miramar was great and we would stay there again despite the problems. The children loved it and we felt we could walk in ANY direction from the hotel and it was never too far away from anything. Also, the bus line is on Kuhio Ave and as others have already said, its a cheap way to get anywhere on the island. $2 for adults, $1 for seniors and juniors and children under 6 are free which was great for us having 3 under 6.We rented cars (mini van and also a jeep cherokee I think it was) and this was comfortable for our party of 11. We had the cars for 7 days and we explored almost the entire island. We have done this before and also find we see SO much more of Oahu this way. The spots we loved were Kailua Bay, Waimalo Beach, Turtle Bay and the North Shore. The Windward side of the island though is my favourite and the drive from Waikiki around to Hanuama Bay and to Kanehoe is just STUNNING.We did a lot of our shopping outside of Waikiki too as its much cheaper. Windward Mall is great, as is Pearlridge Mall. Ala Moana is great to visit but MANY upscale stores. But we still got some bargains at places like Sears, The Disney Store and Old Navy.If you are travelling with a family, I do highly recommend this hotel for its location. It doesnt have a kitchenette but does have a fridge. We knew this before we got there and we planned to eat all our meals out as we LOVE the food choices in the USA/Hawaii. We did have breakfast in the hotel and bought some supplies across the road at the FOOD PANTRY which is convenient and open early in the morning and till late at night. A little more pricey than the supermarkets but still ok. Also, many ABC stores (souveiners, groceries..coffee..etc) are within a few minutes walk of the hotel.If you require any other info about the hotel or Oahu, feel free to contact me anytime. I am always more than happy to talk about Hawaii!!!! :)I miss the Miramar and Waikiki and Oahu already. We were there 3 years ago too and I know it will be a longer time till we visit again this time around but who knows, we might win the lottery one day! :)", "Date": "Apr 29, 2007", "ReviewID": "UR646099962", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "CarlaAndFamily"}, {"Content": "Great Location But A Big But I've been to Hawaii 7 times (from Australia), sometimes I visit twice a year and stayed at this hotel as it was very centrally located. Firstly the PROS: Great pool, very big nice and cold and really deep, nice size pool area. Room was okay bathroom spacious, but it all looks a bit tired in need of a reno job. Good location, supermarket across the street for all your sundries. Travel desk on the ground floor. Denny's next door. Next door to International market place.CONS: Well the first Con is more of a pro, that is, every night, I was there 10 of them, street workers (prostitutes) appear around 8.30pm and and are swarming around the hotel and street and lobby area soliciting, I got asked on more than one occasion. That's pretty hilarious I think but bad that its so early and with kids and families walking around its a joke and u just wonder why its allowed to go on. Bit of excitement for the adults I guess. So its in a bad area of town. Next, front desk very avg customer service and one japanese lady on the desk was rude and arrogant but I give as good as I get so I put her in her place.Quite expensive for a very ordinary hotel experience. Enjoy Hawaii but unless you're spring breakers or back packers stay somewhere else for pete's sake.", "Date": "Apr 18, 2007", "ReviewID": "UR587405557", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "5"}, "Author": "LUVMYHOLS77"}, {"Content": "Miramar Waikiki Great price for location! First time staying at this hotel, second time visiting Oahu. Stayed 4/1/07-4/8/07 Great location, room was ok for the money. Clean and cleaned everyday by cleaning staff. Had a fun bar in the hotel called the Bannana Patch, great people run the Karokee part met someone wonderful people!! Staff was courteous, Pool was ok, had plenty of chairs and towels and poolside bar. Location great being behind the International Market Place, quick to cut through and be at the main strip and across the street from the beach and Dukes for drinks and dinner. Great for the price and location, would stay again!", "Date": "Apr 16, 2007", "ReviewID": "UR512574439", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "happyluna"}, {"Content": "Great place       street entertainer close to Miramar", "Date": "Apr 14, 2007", "ReviewID": "UR451734077", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "honolulubound"}, {"Content": "Pleasant enough for what it is Overall, we enjoyed our stay at the Miramar. It has a great location, while not on the beach is in easy walking distance of it. It's located right next to the International Market, so was very convenient to go over to get a cheap meal or the last minute souvenir. It is right on the bus/tram line, so there's easy access to mass transportation. There are also the ubiquitous ABC stores on every corner, and they were convenient to pick up basic necessities and snacks at reasonable (for Waikiki) prices.It's certainly not a luxury hotel, but you're not paying luxury prices either. It's a comfortable place to stay, and would be good for families. Staff was friendly and helpful, and the maid service was very good. Parking was always available for $10 a night.The pool is very small and not heated. The bar area was often not staffed, but as the pool wasn't very inviting, we didn't go to the pool. Elevators can be very slow, especially in the morning. Once we had to wait for 20 minutes for an elevator to come. We would have taken the stairs, but the only working stairway they have leads directly into the parking garage. Not sure, but this seems like it would be a fire hazard. I would stay here again if I got a good deal on the price. It's comfortable enough and a nice bargain place for Waikiki.", "Date": "Apr 12, 2007", "ReviewID": "UR490247532", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Kramey"}, {"Content": "21 Days At The Miramar March 1-21, 2007.This Has Been Our Second Stay In This Past Two Years. Our Travels Here Have Been Enjoyable. I Felt Very Comfortable And Secure At This Hotel. Front Desk Reservations Are Friendly, Security Gaurds Always Greeted My Family When Passing, And In Fact, Offered To Take My Family On A Personal Tour Of The Island On His Day Off, Pretty Nice! Futher More, Room Service(Cleaning) Staff Reconized Us From Our Previous Stay And When Leaving After 21 Nights Took The Time To Give A Very Warm Felt Goodbye Til Next Time. It Is In My Opinion, That This Is Good Value For The Dollar, Great Location And Friendly Place To Stay With Family + Friends. 2.5 Star Hotel With 5 Star Service.Poolside Room Was Requested, Couldn't Have Been Better, Kids Loved The Pool!Thanks So Much MiramarThe Fitzpatrick'sSee You In 2008.", "Date": "Apr 9, 2007", "ReviewID": "UR410960253", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "CptnRyan"}, {"Content": "Perfect Stay at the Miramar Just got back from a 10 day stay in Waikiki (March 24-April 2). We had a wonderful time. When we checked in our room wasn't ready. Granted, we got there at 11AM so we weren't surprised. They did let us check in and told us to come back at 3 and they would give us our keys, no need to wait in line if there was one. When we got back at 3 (after leaving our bags with the bell desk) the front desk said they were fixing a drip in the bathroom sink of our room but we could still check in if we didn't mind. We said that was fine so we went ahead to the room. We had booked room 2106 ahead of time after hearing that one had the best view for the price range. It faced Waikiki Beach and had an oversized lanai. So we get to the room and the guy fixing the sink was so nice! He gave us many tips on where to have dinner and also which buses to take to various spots. We enjoyed talking with him. Plus, he must have fixed the sink because we had no problems with it during our stay. The room was nice--two double beds, a pretty big bathroom with tub and shower, big vanity area and enough closet space in the hallway for two women to put all their clothes for 10 days! As for the rest of the hotel, as some other posts have mentioned--the pool needs some help as far as the bar goes. It was only open one time (the day we arrived--a Saturday) the whole time we were there. There are signs all over that no outside food or beverages are allowed in the pool area. Meaning if you want to eat or drink you have to buy it from the bar. Well that's hard to do when it's never open! I'm not sitting out in the heat without a beverage. So of course I was not the only one who brought water/soft drinks, etc out there anyway. Sorry but I'm not getting dehydrated. I did like all the umbrellas by the pool, some shade was nice. Beware--the pool doesn't get early morning sun due to the other buildings blocking the sun. Not sure what time it acutally gets sunny, as I was at the beach every morning as soon as I found that out. There were mainly kids in the pool every time I went to lay out in the sun so I didn't actually ever go in the pool. The rest of the hotel is nice--there's a bar that had live bands/singers, a gift shop with some food items, two clothing stores, a tour operator desk and on the 5th floor there was Sammy's, their restaurant. Can't comment on the food because we didn't go there at all. Attached to the back of the hotel is a Vietnamese restaurant (didnt eat there either) and outside the back door is Fatty's Chinese (nope, not there either). Also out the back door is a walkway that leads right to the International Market so that's really close. There is a parking ramp attached too. The room rate we got included free parking but I think it's normally $10 a day, which seems very reasonable compared to $25 at other hotels. I really have no complaints (except for the bar never being open) about this hotel and for sure would go back again. Try getting a high floor for a better view and less traffic noise (Kuhio Street is the front of the hotel facing away from the beach and is busy) The other side of the hotel faces Waikiki Beach-the higher up you are the better view you have (over the other hotels). 2106 was perfect.", "Date": "Apr 6, 2007", "ReviewID": "UR232051219", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "kgfan1"}, {"Content": "BeWare We arrived at the Miramar on March 12th the previous 3 times we had stayed at the waikiki west, across the street, so we knew where it was and what it looked like. I had originally booked at waikiki west but they went totally smoke free (ya I know people, but I am not a critic of yours so dont be of me) so I called my travel agent and they found a room at the miramar for $110 more for the 10 days. I told them that i wasnt going to pay that and then get there and not have a smokin room. They put me on hold and when they came back they said I just talked to the hotel and you are guaranteed a smoking room, so we took it. On day of arrival was told that there were none left (this was monday) but come back wednesday and they would have one. Tuedsay mornign while walking by the desk saw the manager there so told him, he said go pack your bags and we will ahve a room for you. We were headed out so told him woul dbe back around 10. came back and was told the room wasnt ready, went back at 12 and was told the maid was cleaning now. So we went to the room to see what side of the building it was on, there was no one there. Went back at 1245 and the maid was making the bed, went to the front desk was told no ready yet, have a seat in the lobby. went to desk at 130 was told not ready yet, went to the desk at 200 was told not ready yet, went to the desk at 230 was told not ready yet at 300 wife went to the desk and was told it was ready a long time ago and that her husband had gotten the keys, I was sitting in the lobby when she told them that they said they thought that I had the keys a long time ago. needless to say half a day wasted. To top off all of this when we get to the room, (we were there for our 39th anniversary) there were two beds in the room not the king that we asked for and neither big enough for both of us so we spent our anniversary 10 days in separate beds. Other then that the maid service was wonderful and the hotel is clean, a little outdated but very clean and even had a bathtub, something we didnt have at waikiki west. The pool area is a joke, small pool and we went down there the first day and sat at the bar, had to pry the girl away from the tv set (watching her soaps) to get waited on and then when she went to make the pina colada she couldnt get either blender to work so she went into a shed and got a 3rd one and brought it out. didnt even bother to rinse it out just made the drink in it. We finished that drink and thought about another one but couldnt get her to wait on us, must have been a interesting part in the soap plus the bar closes at 5 pm Now to me that is a dumb time, most people go on tours and most tours get back to the hotel at 5 or 6 at night, but then the bar is closed. We will probably stay there next yr when we go for our 5th time to hawaii but I will personally call the hotel and make sure that we have a king smoking before committing.", "Date": "Mar 29, 2007", "ReviewID": "UR369313100", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "4", "Location": "4"}, "Author": "mtosel1"}, {"Content": "very pleasant stay       rainbow over diamond head from lanai", "Date": "Mar 17, 2007", "ReviewID": "UR305409628", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "phlute23"}, {"Content": "In Serious Need of an Update I have never written a bad review of a hotel yet and really hate to be a complainer but we definitely had some issues with the Miramar.Everything you read about the great location is correct. It is a great location. Close to the beach, close to restauants, etc. We felt very safe walking around at night. No complaints there. A big selling point for many hotels in the area seems to be the International Marketplace. If you've ever been to Mexico or the and wandered throught their marketplaces full of cheap jewelry  junk then save yourself the some time and don't bother walking through here. Same junk - Different pile.Service was also great. Front desk staff were very friendly, the bellmen were terrific, they gave us directions booked us shuttles, etc. and the maintenance people reacted quickly to our needs.The trouble we had was the hotel itself. Our room was seriously out of date. Which I normally wouldn't mind because I didn't book 5 star so I didn't expect 5 star. But I did expect a comfortable stay which we did not get. I highly doubt that the washroom has ever been updated. Ours was in bad repair. Sink, tub, toilet, walls all very worn out and dirty looking (even though I think they technically were clean). Our toilet was broken when we arrived. After a 12 hour trip getting to Hawaii, the last thing I wanted to deal with was a broken toilet and a maintenance person in my room. And our nice clean white towels, well they were white but had someone else's hairs on them.Our bed was so old and worn out that we ended up with serious back issues over our 3 night stay. This from 2 people who have never had back problems. I thought long and hard about sleeping on the floor because it couldn't be any worse than the bed. The lobby, while clean, again very out of date. I was shocked at the scratched up and peeling paint on the lobby washroom doors. Everyone sees the lobby why would you not keep the lobby looking good? And the front entrance - well besides the prostitutes patrolling in front of the hotel it was okay. Why would the hotel not ask them to leave? They weren't in front of any of the other hotels in the area.I am not saying all the rooms are as outdated as ours as I understand the Miramar is upgrading their hotel rooms unfortunately we just got one of the old rooms. I'm sure many people have gotten the updated rooms and had a fabulous stay.We had also considered staying at the Ohana East or Ohana West. The price  amenaties were identical. And they were all within 1 or 2 block of each other - so they had the same great location. After checking our the front entrances  lobbies of those hotels based just on first impressions I would choose one of them next time.Overall, I think the Miramar is likely a good hotel for the money but if you book here ensure you get an updated room and spare yourself the discomfort.", "Date": "Mar 3, 2007", "ReviewID": "UR916462606", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "5"}, "Author": "519Saskatoon"}, {"Content": "good value at the Miramar Stayed at the Miramar at the end of Jan 07.Average clean hotel,central to all activities,Good buffet breakfast at Sammy's also Denny's was nearby for a reasonable priced meal.Had to pay for a safe in the room.Check in and out easy and pleasant.Friendly staff.", "Date": "Feb 16, 2007", "ReviewID": "UR249496042", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "LindylouKamloopsB.C."}, {"Content": "good stay at Miramar Just returned from 10 nites at Miramar Hotel. It was a very good value for the price. Room was 1126 on the corner. Nice view of canal and golf course. Check in and check out fast and very friendly. Maids always gave extra towels when requested. Did leave a couple $$ every day. All in all location is great . Rooms a little dated but clean and king bed was comfortable. Don't be afraid to stay. Location is worth it.", "Date": "Jan 31, 2007", "ReviewID": "UR475402142", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "flythrush"}, {"Content": "Good Budget Hotel We stayed at the Miramar for 4 nights. It is located about a block or so from Waikiki beach, near to all of the shopping, and there are plenty of dining options all around. We had a standard city view which wasn't all that great, but we got what we paid for. The rooms and bathrooms could use a little updating but overall for $140 night you can't beat it. The pool area was okay because it did not have a hot tub which was disappointing. Also the chicken quesadilla that we ordered from the pool bar was awful. We booked through expedia and had no problems. We would stay here again, however we would probably try to stay at other properties right near the Miramar that are in the same price range like the Ohana East or West.....just out of curiousity.My recommendation for Oahu is to rent a car and get out of Waikiki during the day....take in all of the other parts of the island....otherwise you are missing out. Our favorite part was the eastern part of the island....starting at Hananama (sp.?) bay. There are some great beaches and scenery on that side.", "Date": "Jan 7, 2007", "ReviewID": "UR124039950", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "lovemebab"}, {"Content": "Marvellous Miramar       pink palace from 21st floor", "Date": "Jan 6, 2007", "ReviewID": "UR152927245", "Ratings": {"Service": "5", "Business service": "1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "willowfifty"}, {"Content": "What a bargin! I would like to start by saying there are many hotels in Hawaii that are beautiful and have 100 more amenties, but Miramar was home for us!!! The staff is outstanding. They were there to help us with whatever we needed. The bell staff went above and beyond for us - love them!!! There were 7 of us traveling and the hotel was able to get us a limo pick up and drop off of $45 each way - this was a deal!!! We had a great location - whatever you wanted was minutes away. We offen went to the international market place to just waste time while waiting for other in our group. You will not be disappoint with the location. The breakfast helped alot with the cost of food. The buffet has a little different food - very asian influence, but was able to find something each morning to fill my belly. Rooms were a nice size and clean. We finish most of the night at the Banana Lounge all the employee there were super nice and we have some laughs at karoke. My only negative was the pool area. One big selling point for us was a bar at the pool and it was never open!!!! We spent 3 hours at the pool and barely got sun since other hotels blocked it. Pool is not heated so did not even attempt to go in. If you are on a budget - this is the place for you!!!! Enjoy:)ALOHA", "Date": "Dec 22, 2006", "ReviewID": "UR899198918", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "ablueyedigi"}, {"Content": "Great Location We stayed at this hotel for our honeymoon as the Kiwi dollar doesn't go far in the States.We arrived later than expected and maybe they had given the original room intended for us to someone else so we had a room with two double beds in it and ended up spending the first night of our honeymoon in separate beds!!The guy on reception was very pleasant when we rang but pointed out there was little he could do until the morning so we coped.The next morning the staff on the desk were great and advised they could upgrade us to the next room type with a kingsize bed in it for a small daily fee. We were happy enough with this and went out for the day.When we got back we were given a room key and went up to our new room to be given a great surprise, an upgrade to a partial ocean-view room for the price of a deluxe room which was wonderful.Having seen two rooms they are all pretty much the same. Good sized bathrooms with hairdryer and the usual toiletries.The rooms all have a balcony which has a table and a couple of chairs on it to enjoy the balmy evenings.It was clean and tidy and serviced every day.The hotel was looking a little bit old and knocked about but when we were leaving the hotel staff were going around painting so it obviously gets a tidy up every year.The pool was nice enough but the hotel needs to develop its bar as it could be great. The deck around the pool gets the sun until late in the afternoon.We tried the breakfast at the hotel but didn't rate it. We found a couple of diners down on the corner of Kuhio and Seaside that did a better job for a third of the price.The great thing about the Miramar is its location. It is on Kuhio about a block back from the beach, on the bus route and with the only supermarket in Waikiki across the road. For this reason alone we would stay here again. If you go across to the Ohana Waikiki West, the front desk staff will give you a map that has a list of all the tourist hot spots on Oahu and how to get to them using The Bus.If you are looking for somewhere central in Waikiki then this is a great place to stay.", "Date": "Dec 3, 2006", "ReviewID": "UR447605831", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "Lottie1"}, {"Content": "would recommend to anyone We stayed at the Miramar for 9 nights in September 06. We enjoyed our stay. Have stayed in another hotel in Honolulu on our previous trip and this was much better. The room for a Honolulu hotel was quiet large, bathroom was large as well. Extremely clean. Furniture is a few years old but still o.k. Staff at the hotel were extremely helpful and always pleasant. We ate at Chilli's across the road and it was great, meals are very large. We got a voucher out of one of the guides that gave us an unlimited supply of corn chips and salsa. The all you can eat place that is about a block away on Kuhio (i think it is smorgy's) was average, but o.k for a cheap feed. Have read recent reviews about noise and did not have any problems, also about the review that the hotel is hard to find, well it's not, open your eyes and it is very easy to see. The only disappointing point to our stay was the bar at the pool, it was very rarely open and it was not inviting, a few chairs infront of a rundown bar with a bar lady that did not look like she enjoyed her job. We did not buy a single drink from the bar and I was looking forward to cocktails by the pool. Our last hotel had a great pool bar and we had many a cocktail around it. If you are looking for a hotel to lay around the pool drinking cocktails then this may not be the place, there is nothing wrong with the actual pool though.If you want a clean, large hotel that is close to Waikiki beach, international market place, restaurants and nightlife then this is the place for you.Miramar we will be returning....", "Date": "Nov 1, 2006", "ReviewID": "UR575497191", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "sandterrs"}, {"Content": "Good location We stayed at the Miramar for a week while vacationing in Honolulu. The location is perfect: a block from Waikiki beach, close to restaurants and shopping and right next to the International Market. The room was clean and the balcony was great for relaxing and taking in the view. There's a free aquarium at the DFS Galleria shopping center located a couple of blocks away that's a must-see: lots of tropical fish, stingrays and even a shark. Affordable Tours on Seaside and Kuhio has great deals on tour packages (less expensive than booking at the hotel).The only disappointing fact about our stay was that we had forgotten a shopping bag full of new clothes from Banana Republic in our room when we checked out and only realized it after we got back home. We called the hotel and after getting the runaround for about 4 days, we were finally told that there was nothing turned into the lost and found. The only explanation is that the maid must have taken the bag home thinking that the loss would not be reported. We thought the Miramar was a great hotel while we were there but unfortunately due to this incident with a dishonest employee, we would hesitate to stay there again. Word of advice: make sure you double check that you've packed all your belongings before you leave.", "Date": "Oct 28, 2006", "ReviewID": "UR256640814", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "escapes12"}, {"Content": "Slightly above average hotel in great location The Waikiki Miramar isn't an outstanding hotel but it was more than decent for the limited time we spent on Oahu. The location is the best thing it has going for it- it is one block from the famous Waikiki beach and you are never more than a few steps away from shopping and restaurants. This is a good thing because driving in the Waikiki/Honolulu area can be a royal pain at certain times.The two rooms we stayed in on two separate nights (beginning and end of the honeymoon) weren't anything special. They are fairly small, although the bathrooms are extremely big by hotel standards. The furniture is a little worn and everything looks a bit dated but the rooms were otherwise well-maintained and everything was clean.The bell staff was extremely friendly although the front desk staff was extremely average. They were all very accomodating but no one seemed to be willing to go beyond the call of duty like the staffs at other hotels we stayed at.Being in the middle of a city, the Miramar suffered from the same things that most city hotels suffer from. Since street and surface parking is non-existant, hotel guests are forced to use a dark, run-down parking garage beneath the building that charges $10/day to guests. The hotel itself is pretty hard to find despite being on a main road- blink once and you'll miss the entrance and have to take a long trip around the block. And don't be surprised when you wake up at 6 AM to the sound of dumpsters being emptied on the streets below!If you're looking for a nice place to stay for a night or two while in the area, the Miramar is a fine choice. But if you're seeking something more long-term, you may want to spend the money on one of the many other area hotels that seemed a little better.", "Date": "Oct 26, 2006", "ReviewID": "UR538434376", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "TimberTales"}, {"Content": "Good value , good location , good hotel Hi, after working through the hotels being offered by my travel agent and reviewing them on Travel Advisor ( with many not getting a good review ), we decided to stay at the Miramar in late Sept 06. We're a family of 4 ( 2 adults  2 kids 11  14 ) wanting to find a place to stay in Honolulu that would be our base while we toured the island.It has access to a car park within the hotel precint - it's US$10 / day  has unlimited entry / exit as part of the deal. Very handy when you've got a hire car. Note the car park entry  the hotel check in area are off the small side lane (left hand side when facing the hotel ) next to the hotel.We prefer to self -cater ( cost  food preference ) - this was easy to do with a good range of restaurants within 5 - 10 mins walking distance + a supermarket just over the road. There is a chilli's just over the road from the hotel; with your back to the hotel , there is an all you can eat buffet style restaurant on the opposite side of the road and 1 block to the right. There is a very good vietnamese restaurant approx 1 - 2 blocks to the left of the hotel on the oppsite side of the road. All in all the Miramar suited us for what we wanted in terms of accomodation  location. From our perspective it was : clean , the air con worked , there was a pool available [not many people seemed to use it ] , the room was clean and tidy and it had a good location + parking easily available. It's approx 2 blocks back from waikki beach - but this is an easy 5 mins walk  being on waikki beach wasn't one of our prime considerations. John", "Date": "Oct 25, 2006", "ReviewID": "UR486812118", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "johnkx99"}, {"Content": "Good experience We enjoyed our stay. The room was big and so was the balcony. Clean. The room overlooked the pool and the treetops of the International Market. It was surprisingly quiet. It seems the parking lot on the first 4 floors that fronted Kuhio cut off a lot of the noise from the street. It was nice to have the two beds. The bathroom was a good size. The pay TV never worked however the channels provided included a number of movie stations including HBO. The elevators did not have security cards. Anyone could go up in the elevators. The pool was nice but more fun at the beach. The furniture in the lobby was rather dilapidated. Really a decent hotel for a regular hotel in Waikiki. Will stay there again.", "Date": "Oct 11, 2006", "ReviewID": "UR446196298", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "CityGirl4now"}, {"Content": "Mahalo Miramar We stayed at the Miramar for two nights in room 2100. Great corner room with a nice view. The room was a great value. Nothing fancy but very clean. It was perfect for our quick visit to Waikiki. The staff was friendly and accommodating. We had requested a roll away bed which was set-up when we arrived. They charge for parking but it was very reasonable and convenient. They provided towels to take to the beach which was very close. We found the breakfast less than adequate. It sounded very convenient and if the food would have been better it would have been a great deal. We had to pay for our two kids who were not included in the cost of the room, It was $ll.00 each. It was truly not very good. The ethnic food that was served was not enticing to us as breakfast food. Our kids would have been happier eating at Denny's which was next door. Our stay was great, but if I was staying longer I would definitely opt for a condo set-up with a washer and dryer. I would recommend it to our friends for a short stay. As far as getting around there seemed to be a free trolley but at night they were reserved for certain groups. I would definitely rent a car. Especially if you want to go to the North Shore which is really beautiful. Aloha!", "Date": "Sep 3, 2006", "ReviewID": "UR725283875", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Leiya"}, {"Content": "Great Hotel! This is a great hotel! We got a room with the buffet breakfast included. The breakfast was amazing (lots of selection, hot and cold dishes and all delicious), the rooms were clean, and could even see the ocean from our balcony. The hotel in general was clean and seemed new, and most of the staff was really friendly. The location is fantastic, next door to the International Market Place, and a couple blocks to Waikiki beach and other places like rental car places and ABC stores. The beds were comfortable, and there was plenty of room for both of us. We were really impressed!", "Date": "Aug 15, 2006", "ReviewID": "UR448987020", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "MelissaForrest"}, {"Content": "Great value!       View from our room on the 15th floor", "Date": "Aug 10, 2006", "ReviewID": "UR672762114", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Keyla"}, {"Content": "Mirami - the Best near Waikiki Beach On our way to Australia the first time, we over-nighted at the Miramar, 4 nights in April 2004. I know this is a while ago, but I just discovered this site and would like to highly recommend this hotel. It is about a 2 block walk to Waikiki Beach. At that time they had an excellent hot breakfast included with the room each morning. The cost of the breakfast listed in the elevator was $12.95/person. The room was just over $100 U.S., so with the 2 of us staying there and breakfast being the price it was, an excellent stay for a great price. You could book any tours you wanted right in the hotel lobby and the tour buses picked up and dropped off right at the door. All you had to do was to be there on time for your pick up. In 4 days we saw Pearl Harbor (well worth going to), whale watching in a catamaran (we actually saw whales!), and to a luau. There was a better luau I think at the Cultural Centre and I think I would try that next time. The one we went to was quite a bus ride out of town and although the food was okay, the reports I heard from other travellers about the Cultural Centre were great. Overall a wonderful stay and a great way to break up that long trip.", "Date": "Aug 9, 2006", "ReviewID": "UR508214845", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Mamabean"}, {"Content": "NICE PLACE TO STAY Our family has been coming to Hawaii since 1980. We have stayed in many different condos and hotels. We found the Miramar to be among those at the top of the list because it is a good value, centrally located, and the room more than adequate.We were greeting warmly by the front desk even though it was quite busy. We booked two rooms, one was a corner room which was very spacious with a large lanai. The other room had one king bed with a smaller lanai. Both rooms had ocean views, which were lovely. The hotel is located adjacent to the International Market Place which is great for shopping and a quick bite. Restaurants, too numerous to count, are within a five minute walk. The Food Panty Grocery Store is located across the street and the Fun Factory Video Arcade, for the kids, is next door.The hotel provdes towels for use at the beach and pool. The beach is less than a block away. The pool was adequate for cooling off and has food and cocktail service. We did not eat at the breakfast buffet.I have no negatives, the rooms were clean and the staff excellent. Reading other reviews, we never experienced anything but a helpful, courteous, and professional staff.We will definitely be returning to the Miramar. It is a great value.", "Date": "Aug 2, 2006", "ReviewID": "UR765041646", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "bbjones94102"}, {"Content": "Great place for an awesome price. My wife and I stayed at the miramar for 1 week and found it to be an excellent place to hang out, drop your stuff and go exploring. Or drop in and take a snooze. As this was my first time in Hawaii I wanted to see everything. The Aloha Tours operator located in the lobby was very helpful and planned our entire stay there. The hotel staff are very friendly and attentive. Rooms are always clean.The breakfast buffet is a great way to start the morning. The staff are courteous, food trays are always full and the restaurant is always kept clean. Good selection of food although I would recommend alternating what you eat or you could get tired of the food by the seventh day. After breakfast you can always grab a bite in the many restaurants located close by for lunch or dinner. There is also a denny's and fatty's chineese food located just off the lobby.The location is 'central' so you can really explore alot of different things while you walk along the different streets. The beach is very close by. Some other hotels charge huge just to be located 'on the beach' but the miramar is just half a block away! You can't beat that.We rented a car for a couple days and were allowed free parking as we were guests in the hotel. The lot attendents are very nice and patient. (we needed directions and they were very forthcoming on details)As we had a late flight coming back to Edmonton [11pm] we were given the option of a late checkout 6pm instead of having to checkout at the usual 11am for just $45 bucks. Gave us time to just sit around and relax before catching our flight back. From 6pm we were allowed to check our luggage with the front desk for free.The only down side I can see is that the rooms are smaller. You have room to move around but it isn't huge. We had a double bed, room for a dresser, tv, desk, table and some space for our luggage. I think that is plenty of room but others might disagree.", "Date": "Jul 21, 2006", "ReviewID": "UR532271512", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Anand_Narayan"}, {"Content": "Great Value, great location for Waikiki We stayed there 5 nights for a vacation. We had a deluxe room, 2 double beds, would have preferred 1 queen bed, but the room was quite large. Our balcony had a partial ocean view, and was fairly big . As with other reviews, we found the beach an easy 1 block walk away. The staff were always friendly and quite helpful. Our flight left late so we requested an 6PM late check out and were only charged a marginal amount.The International Market is pretty much just outside the hotel if you like looking for souveniers and things like that.As for eating options, there is a Denny's downstairs, a breakfast buffet on the 5th level. But within a very short walk there are a ton of restaurant options from a Chili's across the street, to a nice American/Thai restaurant, Keoni by Keo's which is next door to the hotel. There are two Starbucks within 3 blocks of the hotel.Right across the street there is a good size grocery store where you can get drinks and food to stock up your refrigerator that is in the room which I did the first morning I was there.The hotel is a little outdated, but not dirty by any stretch of the imagination, we found everything functioning and clean.There is a parking garage that is in the hotel and they charge $10 a day for guests of the hotel with in and out privileges.Towels for the beach are available near the front desk for borrowing at no charge.Overall, we were quite happy with the hotel. It was a good value, clean, close to the beach hotel.On a side note, we had dinner at the Side Street Inn, 1225 Hopaka Street, it's a local bar/restaurant where a lot of the locals go. When we got there and went it you sort of hesitated, but the prices were extremely reasonable, portion sizes were way more than we had expected, and the food was amazing. Would highly recommend you try the local cuisine at Side Street.", "Date": "Jun 17, 2006", "ReviewID": "UR459334572", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "Calgary_Traveller_8"}, {"Content": "A bargain!!! Stayed at the Miramar for a week while in Waikiki for a wedding. The hotel was part of a package that included airfare and we thought it was an incredible bargain compared to what other wedding guests were paying in Honolulu. Great breakfast buffet, a pool that was usually empty of people and right next door to the International Market Place. I wasn't happy with the cost to park a rental car in their garage until I found out that it was cheaper than others and nearly impossible to find parking on the street. Planning to return to Oahu and will check with the Miramar first!!", "Date": "Jun 15, 2006", "ReviewID": "UR812685365", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "zjr"}, {"Content": "misinformed  This was our second holiday to Honolulu. Last year we had such a wonderful time we returned this year bringing our two grandaughters aged 19 and 20. We booked one deluxe room for 15 days and a superior room for 8 days after taking the word of the FunSun tour information regarding the quality of the Miramar being a superior rated hotel. Our deluxe rated room was very large with two double (not queen) as we'd been promised, a bathroom where the chain on the flush of the toilet kept disconecting, the sink faucet fell off in my hand and the shower only had hot water and the carpet was grubby. We changed to another room where we requested the dirty bedspreads be changed and were delighted to find the bathroom functioned properly. However in the deluxe rooms there are no tables and chairs and one's back gets very sore after days of nothing to sit on except the bed. Our Grandaughter's room was better at half the price. The staff was wonderful, friendly and very helpful. I can not say enough good about them. The hotel may not be 1st class but the staff certainly is. The tourist information centre was also excellent and very, very helpful.I did feel we were misled,when told by the travel agent, the Miramar was equal to the Radison Prince Kuhio. The differences (which did not include cost) were huge including no hot tub anywhere, a boring buffet breakfast serving canned peaches and no in house restaurant forcing guests to seek out a simple sandwich. We chose the Miramar thinking our Grandaughters would enjoy the Market which they certainly did, not realizing our own comfort would be lacking. I should add (for those of you who do not daily work out a a gym) the walk to the main part of the beach is hardly as easy on a crowded street as many seem to happily claim. I woud recomend this hotel to the younger folks who only need to flop somewhere at night and find hiking for every meal an adventure.", "Date": "Jun 9, 2006", "ReviewID": "UR554051344", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great breakfast close to beach and shopping Loved the breakfast each morning great perk for the hotel price, beach was close market was close denny's next door for late night dinner arrival, downgrade 2 full beds we had the deluxe package but the room was not we never complained so i guess it's are fault alos bring your own coffee only first day free after that 1.50 per 4 cup also room was outdated especially the bath tub did not drain but you know who really stays in the motel room in hawii we didn't so for the price and the breakfast it was above avarage i would recomend it", "Date": "May 27, 2006", "ReviewID": "UR692342190", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very Convenient This Hotel is in a great location! You are right by the International Market Place and can do lots of shopping. The beach is only two blocks away (not far at all). The breafast buffet is also very nice. Rooms are okay but hey you are never in your room and the prices are very reasonable.", "Date": "May 22, 2006", "ReviewID": "UR576378087", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Was nice       bedroom", "Date": "Apr 30, 2006", "ReviewID": "UR236031621", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved the Miramar The room was clean and very nice. It featured a balcony as well as a spacious bathroom. Staff were friendly and helpful. The location of the hotel was ideal as it backed onto the International Marketplace and was really close to the beach as well as all the shopping areas in Waikiki. THe buffet breakfast was included in the price and it was very convenient as well as a good way to start your day. Our flight was leaving at midnight so they offered to store our luggage in a room for the day, although they could not offer us late checkout. It isn't a four-star hotel but it was very clean and quiet and was a great value! I would fully recommend that people stay at the Miramar Waikiki.", "Date": "Apr 25, 2006", "ReviewID": "UR361414519", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "jrk_23"}, {"Content": "The Miramar - wonderful  Having never been to Hawaii before, I was somewhat concerned with booking a hotel - even though the list of hotels my travel agent recommended came from a travel brochure. After careful reviews of several hotels, I choose the Miramar for myself, my parents and my sister and her family (3 rooms in total).I arrived 2 days after everyone else. I also arrived very late at night. The front desk attendant was expecting me and quickly handed over my room key and bid me a good night's sleep. He was very friendly.While I had requested a room with a king bed, my room had 2 doubles. Having been up for over 24 hours by now, I didn't care. I simply needed to sleep.The next morning I awoke to the most amazing view of Waikiki - to the left was Diamond Head - straight ahead was the ocean - and to my right was the International Market  dozens of other hotels including the Royal Hawaiian.My room was clean (the bathroom did have some tiles though that were dated). The lanai was huge. The buffet breakfast was excellent  a terrific value when included in your room rate. We never had an issue with parking - getting in and out of the hotel onto the busy streets of Waikiki was also very easy.The hotel was only a couple of short blocks away to the beach - where you can rent surf boards and deck chairs at very reasonable rates. Restaurants in the area range from Hy's Steakhouse to Denny's. There is also a supermarket across the street.The Miramar is terrific  I certainly will stay there again in a few months when I return to Honolulu for another week's vacation. Yes - I loved Hawaii and can't wait to visit again and explore not only Oahu - but the other islands as well!!", "Date": "Mar 5, 2006", "ReviewID": "UR411470610", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "More than Satisfactory My husband and I stayed from January 31 to Feb. 14/06.We requested a room high up - got the 21st floor with an excellent view of Mtns., Waikiki and partial ocean.The cleaning staff were most obliging (our only complaint is they didn't do the rooms the same time each day - it would be easier to plan your day if you knew when they would be cleaning the room) The location is perfect if you don't want to have a car all the time. The beach, shopping and other amenities are well within walking distance for all ages. The shops in the lobby are very handy and the staff were all great.", "Date": "Feb 20, 2006", "ReviewID": "UR903603749", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good value hotel As with all 3 hotels we stayed in throughout our January Hawaii holiday, I had read some pretty bad reviews and arrived with some trepidation. I needen't have worried. We arrived from Sydney at 11am and the staff bent over backwards to take our luggage and direct us to the sights until our room was ready (only 3 hrs later). The room was clean, quiet and all we needed for the 5 nights. We didn't really have a view but who needs one? We were in Hawaii! The pool was okay, but again, we only stayed poolside at the bar whilst the laundry dried. Our room only had a double bed, but it was comfy and had a new mattress. A good value hotel, handy to all tour buses and shuttles and a 5 min walk to the beach. Restaurant down the street to the right and around the corner..starts with K, is GREAT. Definately the place to stay and what you save not staying at a Hyatt or Sheraton let's you spend more on duty free and tours!", "Date": "Feb 10, 2006", "ReviewID": "UR455512235", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "JelliB"}, {"Content": "On a Budget? Aloha - For those who want to see Hawaii but are on a budjet, than this is the place to stay. For years I have wanted to see this beautiful island but with all the high rates hotels would offer often left me to wonder if I would ever see it. It's not the Sheraton Moana Surfrider but it will do if your looking for a clean place to sleep and shower. I stayed in a standard city view room right next to the pool area where I basically had the pool to my self. The staff was friendly and the hotel was clean. There's a Chile's restaurant across the street and a Denny's adjacent to the hotel. The beach towels are not good but what do you expect when the beach is a block and a 1/2 away and guest's forget to bring them back. I know I wouldn't want my quality towels left behind. All in all staying at this property made it affordable for me to come to Hawaii. Mahalo", "Date": "Jan 14, 2006", "ReviewID": "UR324009139", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Rude staff made me decide to look elsewhere I've been looking for a relatively inexpensive hotel to stay at for several days beyond our month-long stay at a condo. I read the reviews here of the Miramar and thought it worth checking out. Last night on the internet, Miramar advertised a normal rate of $138 and a senior rate of $109 for those days. Today I went to the Hotel to check it out, went to several upper floors and concluded it was probably too outdated for me. Nevertheless, on the way out I stopped by the front desk to ask at what age did the senior rate begin. We were the only ones waiting in line. The two female receptionists were busy. When what appeared to be an Asian male supervisor came to the desk, I told him I had a question. He curtly informed me the line started a few feet away from where we were standing and then walked away.A minute later he came back and said you had a question? I asked him what the rate for seniors was. He said $2.50 a minute. Didn't know what he was referring to. I explained I was talking about a room rate. He replied they had no senior room rates. I then explained I had seen a senior rate last night on the internet and was wondering what was the age for a person to be a senior. He said 65 - it sounded like a number he pulled off the top of his head. I asked him if he knew that for sure. He said no, and opened a 3-ring binder and then told me the age was 55. At that point, it was clear the guy was a rude smart aleck and I saw no further need to deal with him or his hotel. It wasn't a great-looking hotel to begin with, but he made my decision easy.", "Date": "Jan 1, 2006", "ReviewID": "UR767492297", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Happy with the Miramar Just got back from staying four days at the Miramar very happy with our stay. Rooms are clean some stains on the carpet, would stay there again.", "Date": "Dec 31, 2005", "ReviewID": "UR788997371", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "max99"}, {"Content": "Comfortable  Myself, my wife and son stayed at the Miramar for 7 nights in late October. The hotel was really nice. The room was very clean with two double beds and a single. All the beds were extremly comfortable. Air-conditioning (which you must have)worked execptionally well. The maid service was very good. The hotel swimming pool was also very clean, although it wasn't heated. Front of house staff were also very friendly. They were happy to help, providing maps, booking taxi's etc. The hotel is in a great location. 'The Bus'stops almost right outside, and it's only a couple of minutes walk to Waikiki Beach (which must be one of the most over-rated beaches anywhere in the world). If I returned to Waikiki then I'd be happy to stay again at the Miramar.", "Date": "Dec 11, 2005", "ReviewID": "UR248908709", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "fens_england"}, {"Content": "Perfect location! My husband and I went to Hawaii for our honeymoon. The Miramar was exceptional! The location was perfect, just a few blocks from the beach. The breakfast buffet was great. I can't wait to go back!", "Date": "Dec 2, 2005", "ReviewID": "UR482186401", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Hotel at a great price. We returned yesterday to Australia having spent 7 nights @ the Miramar. We simply found that it met all of our expectations and was great. To give a brief profile, we are a married couple in our early 30s and have stayed at some of the best and some of the WORST places in the world. We expected this to be in the 3 star range given what we paid for our package deal.We arrived on a 9am flight (10hrs in the air) and by the time we arrived at the Miramar it was around 11.30am and we felt pretty wrecked. We knew checkin was not until 3pm but we asked at the desk for something earlier and they obliged at 1.30pm which was hugely appreciated. We were given a room on the 11th floor which was a Deluxe room. 2 double beds and a balcony. We were facing back towards the airport direction and could see the ocean from our balcony if you looked left - not much of a view, but heck it was fine. We also overlooked the large pool area. The hotel is ideally located on Kuhio Ave - a main road but not that bad, just one block back from the beach and pretty much in the middle of everything. The room was clean and quiet. The bathroom was dated, but clean. There was an inroom safe (great feature) but not free - wonder why not - seems scroogy to charge $2 a day for it - better just to include it in the rate. There was a bar fridge and a 48cm TV with 30 odd channels. The reception/lobby was large and the staff were ok - not great, but this is not a 5 star, overpriced hotel. The rear of the lobby lead directly into the Intl Mkt Place which was just great. Security staff seemed to always be around so there were no undesirables anywhere. Over the road there is a Food Pantry which we found well priced - plenty of food  liquor to take back to the room. Sure you can get stuff cheaper out of Waikiki, but I can't imagine it would be much less. Take aways are everywhere, as are the dreaded ABC stores. The chinese in the lane downstairs was nice, just very basic! The Bus passes on Kuhio very often and can take you anywhere. The Aloha VIP Tour desk is just great - Brianne cannot help enough with v honest advice. The maids did a good job - the time they came to the room varied greatly which was sometimes incovenient when you wanted a quiet late afternoon in the room when they had not been past, whereas somedays they would come at say 10am. We didn't make use of the pool but it looked fine - a large deck area plus a bar. The rooms are airconditioned which is a must! In summary, we would stay there again without doubt. Sure you can stay in nicer places such as the Hyatts, Sheratons etc, but they are SO much more expensive, why would you? If you need more info, please email me on pht@actewagl.net.auCheers!", "Date": "Nov 26, 2005", "ReviewID": "UR702472018", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "Thorpie"}, {"Content": "Loved the Miramar My sister and I just spent two weeks in Honolulu and we stayed at the Miramar Waikiki Hotel. We thoroughly enjoyed our stay there and would recommend it to anyone traveling to Waikiki in the future. We were treated to a complimentary buffet breakfast every morning which included just about everything you could think of. If you came away hungry it was no ones fault but your own. The International Market Place is only steps away and boy oh boy can you shop here. They love to bargain with you so you can find some great buys. We shopped there late in the evening some days and we never felt afraid to be there. You could definitely shop there at night with small children. The beach is only a block away and there is a great municipal golf course just on the other side of the canal from the hotel. Definitely within walking distance. All of the tour buses we had to meet were within a 5 minute walk from the hotel and right outside the hotel lobby you could catch the city bus to just about anywhere on the Island. The people working at the hotel desk were very helpful in giving us directions whenever we asked them. The room was very clean and the maid service each day was great. There were some days when the hot water was a little scarce and the elevators were slow at times but these are only minor little things. We used the in-room safe ($2.25 a day) to store our valuables in while we were out everyday and felt very secure doing this. I would give this hotel a 9 out of 10 and would definitely stay there again and would recommend it to any of my family and friends for future visits.", "Date": "Oct 4, 2005", "ReviewID": "UR253367351", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A very nice hotel at a reasonable price       View from our lanai (city side)", "Date": "Sep 12, 2005", "ReviewID": "UR509594857", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "Marymary9999"}, {"Content": "Couldn't wait to get out of there - Thank God for Turtle Bay Resort I hadn't been to Waikiki for about 10 years. Had just been in Maui in November so I was a bit spoiled but thought my kids (16  18) loved Maui, maybe I should show them Oahu. We started out at the Miramar. What a dump. It was next to the International Market Place which back in the day, probably was nice but there were just a bunch of vendors with all of the same items. There was a bar across the street that at 4:00 a.m. every morning the crowd would wake me up from the noise. Partial ocean is just that - you can see some blue through the cement buildings surrounding it. I don't mind Waikiki and the hustle and bustle at night was nice. The town was very clean compared to Vegas or San Fran - reminded me of a crowded Seattle. I loved Waikiki Beach - you see it all there and it was fun to people watch. Just hated the room and hotel. If you're going to stay in Waikiki, do it right and pay extra for a nice place. We stayed Friday through Monday and were ready to leave. We had seen it all and Turtle Bay Resort was what I was looking for in Oahu. I would never recommend the Mirimar but I would recommend Waikiki, just take the rest of the week on the other side of the island be it the Mandarin, Marriott, or Turtle Bay.", "Date": "Aug 23, 2005", "ReviewID": "UR712704022", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "akavienna"}, {"Content": "One of the best value in waikiki Great location, not crowded at all, love the pool (no access from the street like hotels on the beach so only hotel guests can use it) from morning to noon you can most of the time swim alone and after noon there are no more than 5-10 swimmers. Breakfast was great I can't imagine anybody not to be pleased with it. For the price it can't be beaten you can trust me on that cause I stayed 7 days at Miramar and last 4 days at Hilton Hawaiian Village at Ali'i tower. Maybe Hilton was a little better class but for the price about 4X of the Miramar (and no breakfast) it wasn't a good move.", "Date": "Aug 20, 2005", "ReviewID": "UR366048728", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "arekVancouverBC"}, {"Content": "Excellent for families Our family (2 adults and 2 children under 8) has just returned home to Australia after spending a fabulous week at Waikiki staying at the Miramar. While the hotel is a little dated in its decor the rooms were very clean and comfortable and the bathrooms were spacious compared to some hotels. We felt that it was excellent value for money and right in the heart of the vibrant Waikiki area. We had quite a reasonable view from our lanai - a little of the beach but mostly of the city. It is worth eating at the international marketplace eatery (very near to the hotel) if you are looking for value meals and we loved the fact that we felt very safe walking around at night when many of the people come out to shop/dine or just wander like us. The public transport system was excellent and right at our door - TheBus - and it took us everywhere we wanted to go for under $5 a time! Our children loved the pool and we spent every afternoon out there. We also didn't feel crowded like you do at some of the larger hotels. For the kids I would give Waikiki beach a miss - it is narrow and drops away quickly which is not good for little kids. Instead head to Gray's Beach, Kuhio Beach or Ala Moana Beach - these all have lovely wide strips of sand beach with safer swimming for kids. All of these beaches are easily accessible to the hotel via walking or TheBus. Overall the service at the hotel was excellent. We found breakfast (full buffet breakfast - hot and cold) was a great way to start the day. If you needed extra bits and pieces during your stay the hotel lobby has a shop which has a range of things or there are plenty of cornerstores which may have what you need. We would certainly consider staying there again because of the value for money aspect with a family.", "Date": "Aug 18, 2005", "ReviewID": "UR850012181", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Students everywhere Miramar is crowded with students. The pool is not up to standards. It is not on the beach. It is in walking distance. If you are in Waikiki stay at the beach!", "Date": "Aug 11, 2005", "ReviewID": "UR644474230", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good No frills hotel               More photos", "Date": "Aug 6, 2005", "ReviewID": "UR646655014", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "VegasVacationer"}, {"Content": "The Miramar was great! My husband and I stayed at the Miramar for 1 week. The location is awesome. You are basically 1 block from the beach and the main strip. For the price its a deal. I would return to the mirmar again if I was visiting Hawaii.", "Date": "Jul 25, 2005", "ReviewID": "UR825513701", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "MattyVancouver_B_C_"}, {"Content": "A pleasant stay at the Miramar       View from our lanai on the 17th floor", "Date": "Jun 21, 2005", "ReviewID": "UR766557837", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "Normsie"}, {"Content": "Miramar was perfect This was our second visit to the Miramar, we found nothing to complain about this time either. It was very clean. They clean the rooms very late in the day, so if you put your sign out that says Maid clean room Wiki Wiki its cleaned earlier than the others.The breakfast buffet is not managed by Miramar. However, we had no complaints there either.Our daughter loved swimming in the pool at the end of a beach day.The lobby has a shop where they will braid hair for $30 plus. So we did that at the end of the trip. Real cute.Having a fridg in the room really helps on the expense of money. So we ate in the buffet for breakfast, and packed lunches for the beach, and then ate out for dinner around town. Joes Burgers in the International Market makes very good, fresh, burgers, the Terriayaki with pineapple is really good. The Cheese Cake Factory was our favorite dinner out. Everything is $10 and up for dinners in Waikiki, however if you are on a strict budget, theres Jack In The Box down the street and they have 2 tacos for .99 cents.Also we rented a car for the entire week, I think we would just use the trolley cars to go where we wanted to next time and rent a car for one day to do the North Shore or go to Hanuama Bay which is out of the this world for snorkeling and seeing all the fish of Hawaii. You don't even have to snorkel just walk out on the sand and stand near the reefs and what you will see is unbelievable. We also went horse back riding on the beach at the Turtle Bay Resort at North Shore. It was alot of fun, and then went to find the shrimp vans for lunch. Expensive but very good eats.We packed our own beach towels and also bought the hawaii towels, which are good prices also. So we never checked out the towels they give you for the beach.Shopping for extras and or snacks: ABC Stores (on every corner), the EZ drug store across the street, and also the little store in the lobby wasn't too bad of prices either, especially for a little ice cream snack at 9 pm for our daughter, .99 cent cup of frozen ice cream compared to $5. in the ice cream places down the street. Also if you are a big Starbucks fan, not to worry they are all over the place also.Parking is $8. a day but oh well, compared to everything else that was good.We never used the safe and never had a problem with anything missing either.Our flight left Hawaii at 10:45 pm, so Miramar stored our luggage for us and we came back at 5 pm and picked it up and went to the airport early.I'm glad we did because most flights out are evening and the airport gets very packed. Long lines for inspection for plants, produce items ect and then you have to go thru the security. So we were way ahead of that crowd.Miramar was definitely worth the money even though its a 2 star we found it to be just perfect. Aloha!!!", "Date": "May 19, 2005", "ReviewID": "UR186624506", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "yayago"}, {"Content": "Great rooms, great price A fantastic room, got free upgrade, staff friendly and the buffect b'fast a feast!!", "Date": "May 18, 2005", "ReviewID": "UR469878356", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Clean, convenient, good deal... Stayed 4 nights at the Mirimar. Wanted the $99 room only internet special (see their web-site) but it was sold out, so opted for the $122 room including breakfast. We got a corner room, on the 14th floor with a partial ocean view. Nothing exciting - you could see the water, but the beach view was blocked by buildings and instead we had a great view of the parking lot.Breakfast as surprisingly good and convenient. The hotel caters to Asian clientele, and so breakfast includes white rice, rice soup and miso soup. Also salad with dressings, Hawaiian eggs, scrambled eggs, pancakes, potatoes, breakfast meats (varies by day - bacon, sausage links, sliced sausage). On the cold side (there are two spreads) were fruits (pineapple, pear, peaches, others I cant remember), baked goods (pastries, breads, croissants, muffins, etc) and there was a selection of drinks (milk, water, juices - orange, pineapple, passion fruit/orange/guava mix). I'm not a breakfast person, but I actually enjoyed going to breakfast each morning. And it saved money because we could eat a lighter lunch.They provide towels in the lobby that you can sign out and bring to the beach. A little raggedy, but acceptable. Waikiki Beach is more like 2 blocks away... If you exit from the front, you go around the corner and turn south. When you get to Kakakula (sp?) Street, you are only a few feet from the ocean, but you cant see it. You have to go around some buildings or through one of the hotels to get there. The International Marketplace is right next door. We ended up eating in the food court twice. Nothing great, but it was convenient. We bought a few trinkets there also, but basically its a tourist trap.There is a Chili's across from the hotel. A Denny's is attached (separate entrance) Also saw a Jack in the Box. One block away is Perry Smorgy's, a buffet place. There was a good writeup on it in one of the Info books, but the food only turned out to be so-so. Like so many places in Hawaii, the restaurant is open air... birds were flying around inside the restaurant. Kind of a turnoff for cityfolk like us. Also across from the hotel is a Food Panty, which is a supermarket, where we bought snacks, drinks, etc.Note that things in Hawaii are rather expensive - milk is $8 a gallon, ground beef is $5 lb, etc... it made many of the prices for prepared foods seem cheap by comparison. (And made the buffet seem like a good value - all you can drink milk! haha.)Overall, we had a good time in Oahu (will write a review on Polynesian Cultural Center later) and would recommend the Miramar as a good moderately priced place to stay. (If you dont want/need to be as close to the beach, there are other hotels you can find for less than $100 per night.) The service was good (asked for extra towels the first day, got them the rest of our stay, front desk was helpful with several questions, the Info desk gave good directions).", "Date": "May 5, 2005", "ReviewID": "UR449237610", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "roykirk1"}, {"Content": "what more do you need My best friend and I (2 girls in mid-thirties) went to Waikiki and stayed at the Miramar for the last week of April. Friendly staff, hot breakfast, beach towels, and located close to everything. The rooms were clean and had unexpectedly been upgraded to a partial ocean view. We booked through Companion Holidays and felt like it was the most hassle-free vacation as they took care of our hotel transfers too. Of course, we checked out Waikiki Beach which is only 2-3 minutes away - gotta find the beach access! But I highly suggest that you rent a car. We rented a jeep for 4 days so we could take our time to see the hotspots listed in Oahu Revealed - no we didn't leave anything in the car. Plus, it was fun just driving around aimlessly to see what it would be like to live there. Sigh... We absolutely loved the North Shore - make sure you jump off the rock at Waimea Beach or you'll regret it! We also had a blast at Duke's on Sunday night - fun times/fun people. Being located right next to the International Marketplace made it easy to shop for our friends. For some nitelife, there's Moose's, DawgHouse, and Bobby G's - if you like to dance. One thing to note... we had planned an itinerary of things to do - but we threw that out the window so we could just explore and relax. We knew we'd be back anyway so why rush things. It was the best vacation ever!!! Oh... if you want to learn how to surf... check out Cherry at ------ - tell her Marissa sent you :D", "Date": "May 4, 2005", "ReviewID": "UR166853746", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "oceansalive"}, {"Content": "Miramar Hotel - Wakiki We had 8 nights in Hawaii (package) and thoroughly enjoyed our stay at the Miramar. Check in time is not until 3.00pm and the flights from Australia arrive at 7.30am, so check the times of your travel as it may pay to have the additional night. The Miramar is very clean, the staff were very friendly and the lady at the travel desk very knowledgeable on the best tours to undertake. Would recommend taking the trip to the Big Island (Hawaii) to see the Volcano - lava was flowing). Would however not recommend that you use Island-Air. On the day we travelled after leaving at 5.30am there was a 6 hour delay and 2 airoplanes, scheduled for our return flight were cancelled while we were waiting on the return trip as they had mechanical problems. Out of 8 planes, 4 were out of action due to mechanical problems. Numerous people missed international flights because of this. Did not arrive back at the Miramar until 1.00am. A very long day, however the actual tour itself was great. According to staff at the airport, this is a regular occurance with this airline. Would recommend the Volcano trip but say you want to use Aloha or Hawaiin Airlines only! Alternative days use different airlines.Breakfast at the Miramar was included in package and there is a large choice within the buffet for all. Lovely pool, laundry facilities and helpful porters at the Miramar. Centrally located, next to International Markets with easy walk (one block) to beach and all facilities. We were expecting a mountain view room, but were pleasantly surprised to have a room with ocean views. Great King size bed, spacious room, only downside is that you have to pay $2.25 per day for the safe. Had read in previous reviews that rooms were very noisy. We were on the 14th floor, and yes you can hear the noise of Wakiki, but it sounds more like air conditioners than traffic. Actually lying in bed sound like the ocean in the distance, so not a bad sound.Plenty of restaurants and take away outlets to eat dinner. Had a lovely meal at the Top of Wakiki revolving restaurant and not too expensive. Views were great.We emailed the motel prior to our arrival, and managed to get an earlier checkin of 2.00pm. Check out is Mid-day so if flying out that night, once again check your travel times as it may pay to have the additional night.This trip to Hawaii was part of a package that included 5 nights in Fiji and 8 nights in Hawaii advertised regularly in Sunday Papers. We took this advert to our local travel agency, who bettered the price and we found the package great value.", "Date": "Mar 27, 2005", "ReviewID": "UR116038710", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Location I just returned from 8 nights at the Miramar.This hotel has a great location, 2 minute walk to Wakkiki Beach, the International market is just metres from the hotel entrance, lots of restaurants surrounding the hotel and a supermarket across the street.We were on the 21st floor with fantastic views of the beach and the mountains. The hotel staff were very friendly, especially the gentleman who shows you to your table in the restaurant for breakfast everyday. The Buffet is good value however you do get tired of the same things everday and you do often have to line up for a table, though the longest we waited was only 15mins.The room was clean and well kept by the maid.The staff who operate the tour desk are extremely helpful.All in all a good hotel! Good value for money.", "Date": "Mar 16, 2005", "ReviewID": "UR695657349", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great stay wonderful breakfast Just got back from a week at the Miramar in Waikiki. The hotel was great. It was clean and comfortable. The staff was very friendly and really cared about their guests. The breakfast daily was quite a money saver. There was something for everyone. Eggs, hashbrowns, pancakes, cereal, toast, freshly brewed kona coffee. We figured it saved us over $210.00 for the week. Location was great you could walk to the Zoo, Aquarium and Diamond Head. International Market was lots of fun and surprisingly inexpensive. We would stay there again and recommmend it to all of our friends.", "Date": "Feb 6, 2005", "ReviewID": "UR603849529", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very nice hotel We stayed one week at the Mirmar in January and found the experience lovely. They have completely renovated and upgraded the hotel within the past two years. Our room was very nice with a view of the ocean from our lanai. The buffet at breakfast was great with lots of choices and the staff was always helpful and polite. Access to the beach and shopping was within easy walking distance. I highly recommend this hotel.", "Date": "Feb 1, 2005", "ReviewID": "UR315485322", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "ornurse8"}, {"Content": "Good value for the money The Miramar isn't fancy, but we felt it offered good value for what we paid. Maybe we were influenced by the upgrade to a partial ocean view room on the twenty second floor. The room was small but quite adequate for our needs. The only complaint was that the shower pressure was rather poor. The breakfast buffet was excellent. We appreciated being able to have a good breakfast that was convenient and efficient, especially on days when we needed to be on time for a tour bus. The Miramar is in an excellent location just a block away from the ocean. The front desk staff were friendly and helpful. We would certainly return to the Miramar.", "Date": "Feb 1, 2005", "ReviewID": "UR995425810", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great two week stay Just back from two weeks at the Miramar Hotel.The rooms and staff were excellant. The room we had was one of the quietest hotel rooms we have ever stayed in.The buffet breakfasts were great as the amount of people using it reflected its popularity.The only thing I could suggest to the hotel is to have all four elevatorsconnected to one up or down control.We saw people hit both controls on the same floor as one elevator is not connected to the other three. this would result in elevators stoping at floors in which the people had already left on which ever elevator came first. Would go back to the Miramar anytime if a chance should arise.", "Date": "Jan 31, 2005", "ReviewID": "UR443031517", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "MiramarHotel a great place to stay..... I went to Honolulu for two weeks this past summer and stayed at the Miramar Hotel. It was a wonderful place to stay. Our room was very neat and clean. The pool was super and our breakfast which was included in the price of our room was also super. The back door of the Miramar opened into the Market Place. It was great. We also had a walkway between the market place and our hotel to go the beach or the main strip. We had three children with us so that made walking to places much easier. The market Place doesn't close until 11 pm, so we would take the children for strolls though it at night. I also took a trip to Honolulu the summer of 2003 and I was not as happy with that Hotel, which was across the street from the Miramar.I would recommend the Miramar for anyone who is planning a trip toHonolulu. I am going back in the summer of 2006 and that is where I will be staying.", "Date": "Jan 28, 2005", "ReviewID": "UR415204771", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Thumbs Up for the Miramar I stayed at the Miramar on January 20 and was very happy with the excellent service. Mei and George at the front desk were professional and cordial. Breakfast was a treat. Staff in the breakfast room knows how to wow their customers. Well done! I will return.", "Date": "Jan 28, 2005", "ReviewID": "UR709786004", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "good moderate place to stay We just returned from a 10 day stay in Hawaii, 2 nights of which were at the Miramar. We were celebrating our 15 yr anniv. We were upgraded to an ocean view room and had a bottle of champagne chilling in the mini fridge from the management. The view was certainly of the ocean, we just couldn't see the beach. It was very nice. The room was adequate and not musty. Our deal had breakfast included. All in all it was at a good price and good location for us.", "Date": "Jan 25, 2005", "ReviewID": "UR823676336", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "chevytravel"}, {"Content": "Great Stay I just returned from a trip to Oahu and after reading the previous reviews, I choose the Miramar and I'm glad I did. I booked the hotel on expedia and got a great deal that included a buffet breakfast which I ate everyday. The pancakes were awesome and I did not have to spend extra money daily for breakfast. The Miramar is in a great location in Waikiki. It is one block from the beach and next to the International Marketplace. I booked a lot of tours and they pick you up at this hotel or right across the street. The front desk agents were very friendly and helpful, I had a message awaiting me when I checked in and they made sure that I used the phone immediately to return the call. I had read in the previous reviews that the water went from hot to cold, but I took 2 showers a day and had no problems at all. Also there was no noise at night, which actually surprised me because I am a light sleeper. I stayed on the ninth floor, there was a nice view of the mountains from the lanai but I spend most of my time sightseeing. If you are looking for a clean hotel, good location at a reasonable price. Try the Miramar!", "Date": "Dec 18, 2004", "ReviewID": "UR438594111", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great location We have just returned from a week @ The Mirimar on Waikiki. It is a great location if you want to walk everywhere and the staff are very helpful! Only suggestion we have is, if you are a couple, ask for a king bed instead of twin. The twin room beds are very short and small. Also, overlooking the pool area was great while having a drink on your lanai. We also got a free buffet breakfast every morning which was basically the same every morning and we were sick of it after 2 mornings, so if this is extra cost when booking, i wouldnt recommend it worth while, however if free, worth a try. There are plenty of other restaurants around that do brkfst for as little as $1.99. Our dinner @ Bubba Gumps, Hard Rock Cafe and Hooters were excellent and huge servings (- no starters required!!!) Along with the great service made our night better than expected!Oahu was very busy but still a fantastic destination and very festive with all the Xmas decorations up early (maybe for Thanksgiving?)! We watched 2 parades down the main street and were blown away with the effort put into them.... Great Stuff Hawaii!!!", "Date": "Dec 2, 2004", "ReviewID": "UR224252927", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kiwi31"}, {"Content": "Great trip We were pleasantly surprised at the excellent spot in Waikiki. We were 1 block from the beach, next to International Marketplace and shuttles, bus routes. If you have the chance, go to the International Marketplace and upstairs to Coconut Willy's, it is a great place, Happy hour from11-7, wow. Food and atmosphere awesome. The breakfast at the Mirimar was always busy, but no lineups at all, Good food and lots of varirty. Check in and out, no issues, They were working on Kulio Street, in front ouf us, it was noisy during the day, butwe were never there anyway so no problem. our rooms were very clean, as we were in the newly renovated floors. Bathroom, Bedrooms cleaned everyday, great staff. Highly recommend.If you have any questions, feel free to email me.", "Date": "Nov 20, 2004", "ReviewID": "UR348650061", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "P.Puck"}, {"Content": "fantastic service,will be back again I would like to start by saying my wife and me have vacationed in hawaii four times and three have been at the miramar hotel. What brings us back has always been the excellent service that they provide. When Russell the general manager (and the staff ) heard we were celebrating our 25th anniversary he added touches that made our stay extra special, they always make us feel like we are home when we visit. Our room was always kept clean and made up well, the breakfast offered was great and those serving did a wonderfull job. The location of the hotel puts us right in the middle of waikiki , so walking is so convenient. We had a late flight so when it was time to leave they stored our luggage, and when it was time to go they called for transportation, all in a timely fashion. Thanks again Russell and staff, job well done Dale and Carol shaw", "Date": "Nov 17, 2004", "ReviewID": "UR138284786", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "What an awful hotel My sister and I stayed here from 23 October until 31 October 2004. We were in a deluxe room with partial ocean views on the 17th floor. I would hate to have seen the standard room if we were in one of the better. Our travel consultant had told us these rooms had been newly refurbished!!! The bathroom was very old, out dated and in need of repair, the shower system was very interesting boiling hot one minute and very cold the next. The carpets were filthy and very worn. The linen on the bed was old, worn, stained and did not fit properly. The hotel came with free buffet breakfast which we thought was an added bonus. It wan't. We had cold, half cooked pancakes on our first day, nothing else looked edible. We did not go back after that.This was our second trip to Hawaii and we stayed at a cheaper hotel the last time. It was ten times better than this one. If you are thinking of staying here THINK AGAIN.", "Date": "Nov 17, 2004", "ReviewID": "UR199773172", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Better than expected Hello or rather, AlohaI just returned from Hawaii. There were three of us in a room and it worked out fine. Because we were not independently wealthy we decided on a midrange hotel. Our agent said that the Miramar was right for the following reasons. First off it was close to the action. Close to eveything. Beach just down the street and right beside the International Market place. We found this very convenientSecondly it came with a complete buffet breakfast which was nothing short of incredible . This was a great way to start off the day. Fresh fruits of many varities eggs bacon sausage etc. So this is a real bonus.Pool ok if you want to catch a few rays and have a swim but otherwise you could go to the beach.Hotel staff very friendly.Now this is not a lavish hotel. If you are looking for luxury then do not book.When I book an economy hotel back here in Canada I can expect teams to be there as well or groups. I call them hockey hotels, why because the rate is attractive. you may find that here as well. we found many youth groups from Japan. But here you are watching people come and go. it was fine.I would reccomend this hotel for people who want a decent place to stay and would like to save a bit of money on lodging.SummaryGreat breakfast Clean AffordableClose to the Action .....Tour pick up points", "Date": "Nov 9, 2004", "ReviewID": "UR988532673", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "What a Dump This is the worst hotel i have ever stayed in in my life.. i tried to be fair .. knowing that i had come from more opulant hotels during my trip.. even so, i had also stayed in moderate hotels so after 4 weeks of travelling to end it in this dive was a bit of a disappointment.. firstly there was a mix up with my room ..they had double booked and i ended up opening the door to see another couple in there (how embarrassing).. after struggling with 2 full bags up to the 10th floor .. (bellman was on a break) i then had to travel all the way down.. the couple in the room were gracious enough to allow me to use their phone and leave my luggage.. i was told that i should have brought my luggage down again by a very rude desk clerk and that it would be a while before they sorted out another room... 30 minutes later.. given another room... which was on a smoking floor (disgusting) i had requested non smoking as iam aasthmatic(too bad,lol).. no other rooms available... but it doesnt end there... the floor was filled with teenage boys and i mean the majority of the floor.. so i was kept awake all night by their partying... the desk didnt seem to take any interest in my comfort or rights... on checking out... not even a goodbye.. or pleasant smile... what a dump ..oh and coffee after the first day... a charge of $1.50 per day.. what is that about? i have never heard of it before.", "Date": "Nov 1, 2004", "ReviewID": "UR808381201", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "3", "Rooms": "1", "Location": "-1"}, "Author": "gavve"}, {"Content": "Loved the Miramar and Oahu Went to Oahu 10/21 to 10/27. Stayed at the Miramar in Waikiki. Excellent hotel - got a double upgrade for $10 extra/night. 17th floor with ocean view. Our stay included the breakfast buffet each morning. Great value! Would also highly recommend Kos Hummer Tours. Beautiful scenery and very informative tour.", "Date": "Oct 30, 2004", "ReviewID": "UR547019830", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very disappointed We were very disappointed with this hotel. Our travel agent had requested a superior room with an ocean view for which we understood we had paid; however on arrival we discovered our room overlooked ugly rooftops on an alleyway. When we showed the two women at the front desk the letter from our travel agent confirming our request we were treated with disinterest and dismissiveness and told that our travel agent 'could request anything but we got the category we paid for'.As for a superior room, I would hate to see the standard room. The carpet and bathroom flooring needed to be replaced despite our being told that we had a 'renovated room', the walls were grubby and had been patched but not painted, the tiling in the tub was a mixture of tiles which had been used for patching, the tub plug was broken, a tile at floor level was falling off, and the air conditioner wasn't working properly (couldn't get the temperature below 71 degrees). The blanket on the bed should have been discarded a long time ago.The pool area was very grubby looking and uninviting.The location was very convenient so it is a shame the hotel is not kept up.The restaurant for breakfast is not owned or managed by the hotel and it is excellent. A wonderful variety of food and the staff are extremely courteous and friendly.", "Date": "Oct 5, 2004", "ReviewID": "UR359677174", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "EXCELLENT. Miramar Was Da Bomb!! EXCELLENT VALUE. Just returned. George, at registration desk, thank you for wonderful corner-room w/ full ocean view  champagne--relaxing start to h-moon. Housekeeping  all front desk staff polite  very helpful w/ directions  suggestions. Breakfast buffet bonanza--such variety, no need to repeat choices for at least a week. Food was fresh  hot. NO shower problem--the handle you grab to turn it on is NOT the pointer, turn in full clockwise motion  THEN adjust temp. Would definitely stay again--1 block to beach, nightlife,  across from Int'l Marketplace. Already saving to return. You cannot beat price  location. Maholo!!", "Date": "Sep 13, 2004", "ReviewID": "UR379352511", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Mirmar Hotel a Good Value Our family stayed at the Miramar the last week of August. We based our choice on the reviews on this website, and I must say that the reviews were very accurate. The rooms were clean, but not luxurious. The bathroom was a little shabby looking, with 50's era ceramic tile in the shower stalls, but it was clean. The most frustrating thing was the varying shower temperature, which was mentioned in several reviews. The shower could go from comfortable to freezing cold to searingly hot in a matter of seconds. The breakfast buffet was an excellent value, and the selections varied from day to day. One bad thing, though, was when my son found a cockroach in his oatmeal. When we brought it to the attention of the staff, they were very apologetic and appalled. Overall, the hotel was nice and quiet. On two nights, the people next door to our room were noisy after midnight, but as soon as we called the front desk, the noise stopped. One tip for the parking garage-it is very tight. We had a minivan and had a very difficult time manuvering around the garage. Also, the parking garage is cash only-you can't add it to your hotel bill-be prepared for that. We would stay at the Miramar again-although I think we would request a higher floor-we didn't have much of a view.", "Date": "Sep 4, 2004", "ReviewID": "UR752878879", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great location combined with great value We stayed at the Miramar at the end of July this year for our wedding (not held on site) and the Miramar lived up to our memories of a short stay about 3 years ago. It's location for the money cannot be beat (next door to the International Marketplace and 1 1/2 from the beach). The beds are quite comfortable and definitely request a room on a higher floor for a nice view. Any small problems that occur are fixed almost immediately (a family member in another room had their safe fixed within an hour of arrival). I have to agree with a previous reviewer the the shower temperature can flucuate from time to time but it's a minor annoyance for the price you pay. The value of the buffet breakfast alone places it above and beyond others in it's price bracket.", "Date": "Aug 28, 2004", "ReviewID": "UR196949087", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The hotel was definitely two thumbs up!!! I went with my boyfriend and some friends and we were all pleasantly surprised. Our trip was from the 5th to the 12th of August, which was definitely not enough time. The hotel was very nice and the staff were excellent. Our room was really nice and comfortable and the bathroom was pretty large considering the reviews that I have read, and there was also a lanai which we found real nice just to be able to wake up and walk outside to beautiful weather made our trip real pleasant or even at night we would sit out there and talk and admire the view that we had. There was also a tour desk right down stairs and we were able to book all of our outings there. Our only complaints were the water kept on getting hot and cold which was pretty annoying. We complained twice to the front desk and they said they would send maintanence right up, but it didn't help. So the fourth night on our way out we went to front desk to find out if there was anything that they could do for us, and the man was very nice and offered us a double upgrade to a higher floor (we were already on the 12th floor), so we were assigned to the 18th floor. We were pretty excited b ut when we got up there the room was exactly the same and almost the same view of the city/ water. So we decided it would be more convenient to just stay where we were. The breakfast was surprisingly good, the only thing is after a few days it starts to get repetitive. The location was great, we were across the street from a Chilis restaurant and a 24 hour grocery store which was nice. And outside our back door was the International Market which was cool except for the fact that if anyone has travelled to Waikiki they would agree that the IMP is not the cleanest of all places. I saw cockroaches which I am extremely afraid of, I am a California girl and we don't really have those.Another convenience was the bus and shuttle pickups were out front our hotel or directly across the street. If you are planning a trip to Waikiki this hotel is great for the cost. I was very pleased along with our friends. I really loved the hotel but I think that next time we go we will try a hotel maybe across the street on Kalakua instead of Kuhio Ave. But our hotel was worth the money we paid and the staff is great which makes the trip all the more fun.. Aloha", "Date": "Aug 18, 2004", "ReviewID": "UR785813177", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good overall value Our family of 4 spent the last week of July 2004 at the Miramar. I found it to be a good overall value, especially its location. It was convenient to walk to Robert Hawaii Tour bus pickups, and we even tried the Bus right in fromt of the hotel. The staff was courteous, especially the breakfast service staff. We requested an upper floor room and got in on the 16th. The room was OK, bathroom shower was always going hot and cold. One complaint we had was that the 5th floor pool closed early, I remember ~6pm, which made no sense. There was a towel service at the bell captain, this was very convenient. You can pick up a towel as you head to the beach and drop it off upon return. Towels however were in poor condition. The access to the International Market from the hotel rear was convenient. Although we were quite satisifed with the hotel, I would probably try another hotel in the same general area on my next trip to Oahu.", "Date": "Aug 13, 2004", "ReviewID": "UR401452569", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "do your homework before leaving Just got back yesterday from staying at the Miramar for 11 days. It was better than I thought it would be. I read the reviews prior to selecting Miramar and noted specific suggestions. I specifically asked for two renovated rooms for our party of five and asked for a higher floor to distance us from street noise. Upon arrival I noted they had granted my request. The rooms were clean, with new carpet, and recent furnishings. All five of us agreed that the greatest benefit on our vaction was the location of the hotel. Please note that the room safe in one room would not work but rather than complain we simply stored things in the other room's safe. Charge for this is $2.50 per day when used. The showers are very lame and sometimes go cooler for a few seconds or so; DO NOT ADJUST FOR THIS OR YOULL BURN WHEN THE TEMPERATURE RETURNS TO NORMAL. Room cleaning can be late some afternoons.The first morning there I was up early due to the time change and walked across the street to the 24 hour grocery store but it was closed.This was around 3:30; upon returning ;I was asked out by a hooker ,whom I flatly refused.Yes in the wee hours they are out there. I read a book in the lobby where they are not allowed to be and would say that by around 5:45 they pack it in. They are in front of other hotels too, but stay away from the main street as the police station is there. The hotel lacks any room service or quality restaurants,but the buffet breakfast they provide is well organized despite becoming tiresome after a while; basically the same fare each morning. Overall, we were satisfied with the Miramar, saw no cockroaches and feel that we would stay there again.", "Date": "Aug 2, 2004", "ReviewID": "UR523507676", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Medium-Roller"}, {"Content": "Overbooks Rooms We stayed at the Mirimar at Waikiki for 5 nights.Upon arrival on June 27th, we were informed by the front desk that they did not have a room for us. ( We paid for this MONTHS in advance through our travel agency.) They offered to put us up in another hotel, but we were traveling with another couple who arrived earlier and did not want to be put in another hotel. This would have been inconvenient since we were traveling - vacationing with them. We did not accept their offer and demanded they get us a room. The rooms air conditioner was broken, but they did however fix it immediately. Breakfast was excellent as well as the waitstaff.Front desk should observed waitstaff on courtesy.", "Date": "Jul 14, 2004", "ReviewID": "UR726817046", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Place My friend and I were in Hawaii in the Spring, and stayed at the Miramar for 4 days. We were very, very pleased and would recommend this hotel to everyone. The hotel is spotless - I was very impressed that the hallways did not have that musty, damp smell that some hotels have. The rooms were clean and fresh, the staff was friendly and helpful, the free breakfast buffet was an amazing value, and the location can't be beat. The Miramar is the perfect way to add a few days in Waikiki to your vacation, without paying 'beachfront' prices.", "Date": "Jul 13, 2004", "ReviewID": "UR829725065", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Miramar- Just \"Ok\" After alot of research, my husband and I chose the Miramar hotel thinking that it was a safe bet after reading many of the reviews of other hotels in Waikiki but we were dissapointed once we arrived. It was an ok place to stay but I wouldn't go back. There is alot of constuction right now on Kuhio and the lobby of the Miramar is an open concept so you feel as if you are on the street when in the hotel. It's quite noisy so if you are looking for relaxation pick a hotel farther away. We were on the 17th floor and still heard some traffic, although the room was nice there were quite a few high school partiers on our floor. The hotel staff in the restaurant are nice but not the front desk ladies. They weren't friendly at all and didn't seem to want to help. We had requested a king size bed but received two doubles and when we called down to tell them this mistake, they said we would have to pay an upgrade and didn't try to make us satisfied at all. The sheets on the bed are strange as well, they don't use a fitted sheet on the bottom, they use a flat sheet. So every morning the sheets were completely off the bed and we were on the mattress. For the price of this hotel you should at least have a proper sleep in your room. We were also surprised to see that there wasn't anyone to assist in travel information, a big hotel like this should. They do have a huge section devoted to helping the Japanese tourists but aren't concerned with North Americans. The good thing about the Miramar is that it is close to everything but if you don't mind walking, stay somewhere else. A warning to any families thinking of staying here, Ka'iulani which is a block away is full of prostitutes at night, from Kuhio to Kalakaua avenue. It's where they all hang out so just take another route if you are walking around at night. The trolleys are fun and fast to take, two dollars per person which is the same for the bus. A tip: go early to Pearl Harbor, most of Oahu is there so you might not get to see the memorial if you go late. We had friends and family staying there as well therefore we had the chance to compare prices and rooms. The Royal Garden and the Parkshore are much better in terms of service and price, they are farther but it's worth it if you want a nice place to stay. The reviews really helped us in planning our trip so I hope this helps someone else, enjoy Oahu it's a fun place and go to Duke's Canie Club in the Outrigger hotel. Order the Tropical Itch!!! It rocks!!!! It's a fun and friendly place with the Aloha spirit, Mahalo to them!!!!", "Date": "Jun 13, 2004", "ReviewID": "UR683693095", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Fortier2024"}, {"Content": "Pleasant Surprise! When we made plans to spend a week in Waikiki I was especially wary about lodging. Our other trips (about 20 of them) had been sponsored by clients and included top-notch on-the-beach lodging arrangements. The Miramar's moderate lodging rates, location, Trip Advisor reviews and the promise of a complimentary buffet breakfast influenced our decision to stay at the hotel. Upon our arrival we were greeted friendly and helpful staff, a nice bright and airy room that was spotless, nice furnishings, large furnished lanai, and an unbelievably generous breakfast buffet (I gained two pounds). Two people might well consider their room to cost twenty dollars less because of the savings on the morning meal alone! We now have a new favorite place in Waikiki: The Mirimar!", "Date": "Jun 3, 2004", "ReviewID": "UR125976037", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The Mirimar was just right... My wife recently won a trip to Honolulu from a local radio station. The trip included airfare to and from Honolulu and accommodations at the Mirimar. I've been to Honolulu many times and have stayed at various hotels - mostly higher dollar as all trips are for business - and found that the Mirimar was just right for a leisurely trip. After all, why would you stay in your room all day anyway???Our arrival at the Mirimar was uneventful. As I was familiar with Honolulu, the trek from the airport in a rental car was easy as pie. The hotel is located on Kuhio Avenue and the parking garage, if needed, may be accessed from Kuhio as well by way of a small alley that is between the Oahu East and Mirimar hotels. If driving from the airport, it is best to make a left turn on to Seaside off of Kalakauna Avenue and then a right on to Kuhio. The alley way is on the right, just past the Mirimar and directly across Kuhio from Chili's restaurant. Parking is $8.00 a day with unlimited in-and-out privileges payable to the parking lot attendant either as a lump sum payment or on a daily basis.The hotel room was really not too bad and was comfortable and clean. Amenities included a mini-refrigerator, in-room safe, ironing board/iron, coffee maker and the almighty television. There was no charge for the use of these items with the exception of the in-room safe and television pay movies. I really disliked the fact that there was a charge for the safe (about 2.50 a day of use) as it should be a standard amenity for the guests protection. If you don't use it on a particular day, you don't get charged for that day though. That was they way it was explained to me.... And I never had the need to use it as all my valuable always stay with me at all times.Our room was on the 19th floor with a partial view of the ocean. It was not the greatest view as you had to lean out over the lanai (or balcony as we Texan's call it) just to get a good view of the water which, by the way, was also partially blocked by the Hyatt Regency Towers as well. But, I am not one to complain as the most time we spent in the room was at night and was at a time when we couldn't see the water anyway. My suggestion is not to spend the money on a partial ocean view room. It is not worth the extra money in my opinion as this category only gave us small partial ocean views and full views of the rooms in the adjacent hotels. But then again, if you are a little voyeuristic and have binoculars (I did) you can get a real eyeful sometimes.Friends of ours were a little discouraged upon arriving the hotel as there were several prostitutes on the sidewalks that surrounded the Oahu East, Sheraton and Mirimar hotels. This may give some travelers an idea that they are in a bad or unsafe location. This is not true. Kuhio Avenue, as does the rest of the surrounding area, gets a lot of foot traffic and there are always plenty of police officers around to keep you safe. Plus, the prostitutes were all friendly and did not make nuisances of themselves in anyway. I encourage you not to let their presence deter you from selecting this hotel. Shopping is ample in the area surrounding the hotel. The International Market is right next door and there are many different shops and stores along the Kalakauna Avenue. Plus, you will never be more than a few hundred feet from an ABC store as they are everywhere. These ABC stores carry just about every little convenience that you could ever want or need. Items range from over the counter medicine, beach items and clothing, souvenirs, beverages, food and the like. Trust me if you need it, they probably have it.Across from the Oahu East, which is right next door to the Mirimar, is a collection of shops called Kings Alley. It has several different unique shops including a local street artist's gallery on the top floor. Check out his show four nights a week in front of the shops right along the street. He does three shows a night which are at 7:30, 8:30 and 9:30. Basically, he is a spray paint artist that creates space-like scenes using layer upon layer of paint. The whole show culminates with his unmasking the painting and displaying a fantastic piece of work from what looked like only random paint strokes only minute before. Best of all... It's the show is free!!!Fast food and normal sit-down style restaurants are all over the surrounding area. Most of them are within a casual walking distance. Examples are Burger King, Subway, KFC (all in Kings Alley area), McDonald's, Baskin-Robins, Cold Stone, Cheesecake Factory, Wolfgang Puck's Express and Tiki's. These are only a few examples of the surrounding type of food finds and I apologize to any of the businesses I missed. Believe me, if there is a certain type of food that you want, the surrounding area has it. This includes a lot of Japanese/Sushi places as there are a lot of Japanese Tourists that flock to Honolulu too!Speaking of food. The hotel did offer a breakfast buffet. In comprised of salad, two types of scrambled eggs(plain and with ham), two types of hash browns, sausage or bacon, pancakes, rice or noodles, baked beans (at times ???), miso soup and various breakfast breads, fruits and juice. Believe me, if you want coffee here, you will get it in a flash!!! Do you want the beach? Well, this is not a beach side property and is a block off the beach. This is not a problem and should not discourage you! It is a casual 5 minute walk from hotel to beach and everyone in the surrounding area does it.The bottom line. I would not discourage anyone from stay at this hotel. As I said before, this was a prize from a local Dallas radio station. I therefore can not make any comparison price-wise to any other hotel. I do, however, rank the basics such as location and room cleanliness as average or above average. There is nothing that would discourage me from booking any future vacation stay in the Mirimar.", "Date": "May 21, 2004", "ReviewID": "UR136809299", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "'Bed' - lam! My third stay (May 11th to 13th/04) at the Miramar although past stays well over 7 yrs ago. Booked over 2 rooms over Internet  got what I asked for except my lower floor preference. There's no point spending time on the tiny lanai up that high in my opinion.Our room smaller than I remembered (king bed) the other room much better with 2 double beds. Go for that configuration if a choice. Bathroom small with both sink  bath stoppers non functional.Here's my main beef though - the bedding was a disgrace.The sheets were old  worn which wouldn't have been so bad except the flat sheet on the mattress was too small  wouldn't stay tucked in. Under that was a mattress protector that had no attachments  was probably the size of a double bed. The material was slippery  so was the mattress so one slid all over the place  sheets were all over the place.If nothing else a hotel should be able to provide decent comfortable clean bedding. Get some fitted sheets for goodness sake  make sure they fit the bed!(Otherwise the hotel is OK - very convenient if you want to be in the thick of it)", "Date": "May 16, 2004", "ReviewID": "UR956171758", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice and Clean, great place to stay We first stayed at the Miramar Waikiki in October 2001. We found it very clean and neat. The lobby area was very comfortable and breezy and we loved all the orchids. We enjoyed our stay so much that in October 2002 we returned, got married and honeymooned at the Miramar. We are ready for our next visit.", "Date": "May 7, 2004", "ReviewID": "UR774577763", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Just back from the Miramar We just got back and we had a good time...the hotel is about a $30 cab ride from the airport..tip included. Check-in was quick. The room was an Ocean-View on the 17th Floor and it was a nice room...beds were neat and the view was great. We left a few dollars everyday for the housekeeping person and you could tell the housekepper appreciated it by the cleaniness our of room when we returned. The buffett was included and it was an good breakfast...especially built into the price. The morning breakfast is busy, the restaurant is well air-conditioned so ladies cover up, my wife found it cold in there some mornings during breakfast. The beach is about a 4-5 minute walk away and yes the beach is very nice. Just outside the hotel are many stores...7-11 and ABC stores are everywhere....yes everywhere. There is a small mini-refrigerator in the room so bring some water and pop back to the room....saves money. Chili's restaurant is just across the street...go eat there, their prices are bascially the same as Denny's but the Food is so much better. Chili's burgers are excellent and huge. Also eat at the Cheesecake Factory restaurant, usually a 30-50 minute wait...put your name in and then browse around...food is good, pasta excellent..free pop refills...but yes a lillte pricey. Also just one block away from the hotel is a little court that has a Subway, Burger King , and KFC. KFC gives free pop refills, you have to ask though. A good place to eat close to the hotel...when you checked in, the alley that the cab driver stopped, just follow that alley-way and it'll take you right to the KFC. The zoo is very nice...well worth the cost..kids 12 and under are free. This is geeting long so any questions email me ontherock3@hotmail.com", "Date": "Apr 18, 2004", "ReviewID": "UR100579316", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ontherock3"}, {"Content": "10 days at Miramar       View from our lanai - 21st floor.", "Date": "Apr 10, 2004", "ReviewID": "UR958154723", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "Racingvic"}, {"Content": "Decent hotel Location is excellent, there is a supermarket, ABC stores, bus station, everything you need just across the street, and downstairs. The rooms are clean, but a bit small; I find the room cleaning is doing an average job, which our bathroom is not cleaned very well as wished, maybe it is because of age too. Overall, we are very satisfy of the hotel for the price we pay, and we do no get an upgrade as everybody did. It is a good 3*.", "Date": "Mar 30, 2004", "ReviewID": "UR648488025", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Advisortip"}, {"Content": "Good Hotel - Good Location This was my wife's and my first trip to Hawaii. We lucked out on a great deal through internet browsing. We booked a king size bed room at the lowest price offered. We were exceptionally surprised to find we were located in a 16 th floor room with a good, partial, ocean view room at the standard rate. Shopping, booking tours and resturants were easily accessable walking or by bus. The staff was very prompt and courteous, the free buffet breakfast also offered exceptional value to our stay. Not only would I stay here again, but would recommend all travellers looking for value to try this hotel. Stay away from Perry's Buffet across the street...very poor food!", "Date": "Mar 16, 2004", "ReviewID": "UR327117347", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel Nice - Hotel Lounge Sleazy The hotel is nice .... The Banana Patch Lounge is very sleezy, the host is usually high and will hit on most women even your wife.The hotel is otherwise nice and the hotel desk personel are very nice. The buffet is good.The rooms are nice and are equipped with Internet.Would be perfect if they could do away with that shady lounge on the main floor which is usally loud.....at 1 am onward.... Terry .", "Date": "Mar 1, 2004", "ReviewID": "UR847740284", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Stay at the Miramar   showReview(1638245, 'full');", "Date": "Feb 8, 2004", "ReviewID": "UR868249528", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Reasonable and great location   showReview(1530412, 'full');", "Date": "Dec 24, 2003", "ReviewID": "UR700294363", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved the Hotel   showReview(1528498, 'full');", "Date": "Dec 23, 2003", "ReviewID": "UR373767908", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Our Home in the Islands   showReview(1512618, 'full');", "Date": "Dec 11, 2003", "ReviewID": "UR879718066", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Hotel !   showReview(1282584, 'full');", "Date": "Sep 12, 2003", "ReviewID": "UR452383410", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved the Miramar Hotel - Oahu   showReview(1236415, 'full');", "Date": "Aug 19, 2003", "ReviewID": "UR296860589", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Mirramar   showReview(1226734, 'full');", "Date": "Aug 14, 2003", "ReviewID": "UR738545290", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "It was Okay   showReview(1221299, 'full');", "Date": "Aug 10, 2003", "ReviewID": "UR171379247", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very Good Deal   showReview(1212714, 'full');", "Date": "Aug 5, 2003", "ReviewID": "UR229814309", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "good deal for the money   showReview(813458, 'full');", "Date": "Nov 30, 2002", "ReviewID": "UR778984658", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "绔嬪湴鎶滅兢   showReview(23008760, 'full');", "Date": "Dec 26, 2008", "ReviewID": "UR678156016", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "4"}, "Author": "銇傘仌銇勩仭"}, {"Content": "鍎銇с仚   showReview(21426223, 'full');", "Date": "Oct 31, 2008", "ReviewID": "UR218842639", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "銇裤倛銇裤倛"}, {"Content": "銇亱銇亱銇с仚銆?#x201d;   showReview(21291789, 'full');", "Date": "Oct 27, 2008", "ReviewID": "UR631539014", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "銈儯銉冦偡銉?> 銈儯銉冦偡銉?</a> </div>"}, {"Content": "銈炽偣銉堛儜銉曘偐銉笺優銉炽偣閲嶈銇с仚銆?#x201d;       閮ㄥ眿銇儵銉娿偆銇嬨倝銇満銈併仹銇?/a>", "Date": "Oct 8, 2008", "ReviewID": "UR798896085", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "nonyou"}, {"Content": "姣庡勾娉娿伨銇ｃ仸銇勩伨銇?#x201d;       銉椼兗銉?/a>", "Date": "Sep 27, 2008", "ReviewID": "UR587848876", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "megujino"}, {"Content": "绔嬪湴鎶滅兢   showReview(20753290, 'full');", "Date": "Sep 20, 2008", "ReviewID": "UR412257682", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鏈濋銇儛銈ゃ偔銉炽偘銇岃壇銇嬨仯銇?#x201d;   showReview(19915371, 'full');", "Date": "Aug 27, 2008", "ReviewID": "UR925316871", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈裤儛銈炽亴鍚搞亪銈嬨儧銉嗐儷銆?#x201d;       銉熴儵銉炪兗锛戯紭锛掞紥鍙峰銉┿儕銈ゃ亱銈夈伄鐪恒倎", "Date": "Aug 20, 2008", "ReviewID": "UR809801153", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "2", "Location": "4"}, "Author": "Fuiko"}, {"Content": "銉熴儵銉炪兗锝ャ偄銉冦儓锝ャ儻銈ゃ偔銈伅銇亱銇亱鑹亜銉涖儐銉仩銇ㄦ€濄亜銇俱仚   showReview(19914658, 'full');", "Date": "Aug 7, 2008", "ReviewID": "UR153488797", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "澶栬Τ銇ㄩ仌銇ｃ仸銇嶃倢銇勩仹銇椼仧鈾?#x201d;   showReview(19172928, 'full');", "Date": "Jul 29, 2008", "ReviewID": "UR376157359", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈枫儳銉冦償銉炽偘銇埄渚挎€ц壇銇?#x201d;   showReview(19172638, 'full');", "Date": "Jul 14, 2008", "ReviewID": "UR222725583", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "绔嬪湴鏉′欢銇渶楂樸仹銇椼仧   showReview(19172636, 'full');", "Date": "Jul 14, 2008", "ReviewID": "UR975944534", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇犮亼銇┿€屾棩鏈€嶃仹銇?#x201d;   showReview(19172227, 'full');", "Date": "Jun 29, 2008", "ReviewID": "UR657138921", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銉忋儻銈ゆ渶楂?#x201d;   showReview(19171980, 'full');", "Date": "Jun 21, 2008", "ReviewID": "UR387040517", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉偙銉笺偡銉с兂锛涙渶楂橈紒   showReview(19171439, 'full');", "Date": "May 28, 2008", "ReviewID": "UR751501115", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇ㄣ伀銇嬨亸鍫存墍銇屻亜銇勶紒锛?#x201d;   showReview(19169609, 'full');", "Date": "Mar 18, 2008", "ReviewID": "UR197035380", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "绲屾笀鐨勩€?#x201d;   showReview(19169398, 'full');", "Date": "Mar 11, 2008", "ReviewID": "UR854474673", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "S茅jour tr猫s agr茅able 脿 l'hotel Miramar de Waikiki   showReview(11720820, 'full');", "Date": "Dec 20, 2007", "ReviewID": "UR925282780", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "voyageurs_avertis"}, {"Content": "銇俱亗銇俱亗銇с仐銇?#x201d;   showReview(19166925, 'full');", "Date": "Dec 8, 2007", "ReviewID": "UR520893776", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "琛椼伄涓績銇с仺銇︺倐渚垮埄   showReview(19166186, 'full');", "Date": "Nov 5, 2007", "ReviewID": "UR432470442", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "绲屾笀鐨勩仾鏃呰銇倝銆傘€?#x201d;   showReview(19164881, 'full');", "Date": "Oct 1, 2007", "ReviewID": "UR626588459", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鍒濄倎銇︺伄銉忋儻銈わ紒   showReview(19164428, 'full');", "Date": "Sep 22, 2007", "ReviewID": "UR643350795", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銉曘偂銉熴儶銉笺伀銇娿仚銇欍倎鈾?#x201d;   showReview(19163515, 'full');", "Date": "Aug 26, 2007", "ReviewID": "UR430126911", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "瀹夈亸銇﹀揩閬?#x201d;   showReview(19163200, 'full');", "Date": "Aug 16, 2007", "ReviewID": "UR842444578", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇с仐銇燂紒   showReview(19162687, 'full');", "Date": "Aug 1, 2007", "ReviewID": "UR138590977", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "绔嬪湴銇岃壇銇勩仹銇?#x201d;   showReview(19162130, 'full');", "Date": "Jul 15, 2007", "ReviewID": "UR998868847", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "鏈濋銇儨銉儱銉笺儬銇屻亜銇?#x201d;   showReview(19162093, 'full');", "Date": "Jul 15, 2007", "ReviewID": "UR176375975", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇仺銇撱倣   showReview(19159136, 'full');", "Date": "Oct 14, 2006", "ReviewID": "UR773625127", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "渚℃牸銆佺珛鍦般仺銈傘伀鈼?#x201d;   showReview(19157820, 'full');", "Date": "Jun 4, 2006", "ReviewID": "UR356700681", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "闃查煶瑷倷銈掆€?#x201d;   showReview(19156857, 'full');", "Date": "Feb 23, 2006", "ReviewID": "UR691408880", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銇傘倞銇曘倱   showReview(19156351, 'full');", "Date": "Jan 11, 2006", "ReviewID": "UR529898432", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "瀹夈亜锛佸畨蹇冿紒   showReview(19156331, 'full');", "Date": "Jan 10, 2006", "ReviewID": "UR514862434", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "椋熶簨銉昏卜銇勭墿銇究鍒?#x201d;   showReview(19155264, 'full');", "Date": "Sep 18, 2005", "ReviewID": "UR768564091", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "濞樸仺锛掍汉銇с兓銉汇兓   showReview(19154882, 'full');", "Date": "Aug 17, 2005", "ReviewID": "UR449565115", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "婧€瓒炽伄鏃?#x201d;   showReview(19929582, 'full');", "Date": "Jan 14, 2005", "ReviewID": "UR710470030", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "鏂欓噾銇嬨倝瑕嬨倢銇般儶銉笺偤...   showReview(19929261, 'full');", "Date": "Sep 20, 2004", "ReviewID": "UR885540653", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鍏堟棩琛屻仯銇︺亶銇俱仐銇?..   showReview(19928060, 'full');", "Date": "Jun 14, 2004", "ReviewID": "UR404029187", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "浠婂洖鍒濄倎銇︺伄瀛愰€ｃ倢鏃?..   showReview(19927896, 'full');", "Date": "Jun 8, 2004", "ReviewID": "UR680086814", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉愩兗銇屻亗銈娿€佸郊濂炽仺琛?..   showReview(19927672, 'full');", "Date": "May 26, 2004", "ReviewID": "UR689697422", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "褰兼皬銇ㄤ簩浜恒仹娉娿伨銇ｃ仧...   showReview(19927567, 'full');", "Date": "May 21, 2004", "ReviewID": "UR761244789", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉┿儕銈や粯銇嶃仹娴枫伅瑕嬨亪...   showReview(19926230, 'full');", "Date": "Mar 30, 2004", "ReviewID": "UR258729820", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉偆銈偔銉撱兗銉併亱銈夈伅...   showReview(19925621, 'full');", "Date": "Mar 2, 2004", "ReviewID": "UR241001031", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鍊ゆ銇屽畨銇忋仸銆佸牬鎵€銈?..   showReview(19920012, 'full');", "Date": "Jul 30, 2003", "ReviewID": "UR848385617", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉忋儻銈ゃ伅锛掑洖琛屻亶銇俱仐...   showReview(19917257, 'full');", "Date": "Feb 20, 2003", "ReviewID": "UR889072433", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60982-d90078-r23344040-Miramar_Hotel-Honolulu_Oahu_Hawaii.html", "HotelID": "90078", "Price": "$183"}}