{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Roomy condo-like suites!”", "Author": "Art531", "ReviewID": "UR123710469", "Content": "About 25 minute, easy drive, from Downtown Indy. Plenty of restaurants, grocery & retail stores nearby. Nice big kitchen and two bathrooms. One bed was not very comfortable but this place is well worth the value. Great if you are traveling with kids.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "chicago heights", "Title": "“Gatehouse Suites”", "Author": "peginchicago", "ReviewID": "UR122304321", "Content": "We took a special offer of two bed suites for one night. I called and asked if they were handicapped accessible as my parents are both elderly and do not do stairs. The person at the desk stated that they were. When we arrived, we found that all the two bed rooms were up an outside flight of wooden stairs. As it was raining and slick, it was impossible for them to use the rooms we booked. They were relocated in a ground floor one bed apartment, but it was some distance from the room we were in. The rooms themselves were clean and nice. The two bed room we stayed in had a pull down bed on the main level. A standard bed was located in a loft area with its own bathroom. A curtain separated the bed/dinning area from the main sitting area.It was very much like a small efficiency apartment. The fireplace was wood burning and we did not use it, but there are several stores nearby where a paper log could have been purchased. We used the pull down bed as hubby was afraid we'd fall down the open stair in the middle of the night and it was about as comfortable as the average sleeper sofa. There were plenty of blankets and pillows. We had no trouble with the internet and tv. Room temperature was comfortable and could be adjusted, The free breakfast was located in the main\"clubhouse\" area and again it was not handicapped accessible. It was located up a flight of stairs. It had a good selection of items and a generous supply. I took plates of breakfast items over to Mom and Dad and we made coffee in their kitchen and ate around the breakfast area in privacy. My recommendation is -if you do not need two beds opt for the single bed rooms. It is a bit off the main street area and may be hard to locate. We had no problem with noise during the night, but ran into Monday morning garbage pick-up around 7 am. Not a problem for early risers, but may be annoying if you want to sleep in.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“The Bates-House Suites”", "Author": "Christopher M", "ReviewID": "UR121815063", "Content": "My first impression was that we got a great deal. The room was big, had a full kitchen, and seemed like it would be comfortable enough to get a decent nights sleep. After visiting my niece at Riley's hospital in downtown Indianapolis, we were ready to fall straight asleep. The TV was fuzzy and hardly visible. Then when trying to fall asleep, the bed wasn't very comfortable (I am always a very sound sleeper), there was a draft from the wood burning fireplace in the room and I began feeling sick. I turned up the heat a few degrees when I noticed the picture facing the bed kept banging against the wall because of the furnace behind it. That's when it started to get terrifying. I took the picture off of the wall to keep it from banging and waking up my wife and myself revealing a PEEPHOLE. I was thinking to myself, this could not actually be a peephole, but on the back of the picture was a stack of paper towels duct-taped to the back so the biggest peephole just below the picture frame could have a direct line of sight to our bed, without being able to be noticed by the naked eye. My wife asked what was wrong and we looked behind the furnace room, and found a closet to the furnace room with a LOCKED door. Hmmm. We were tempted to break into it, but after thinking what we might find we decided against it. Needless to say, it was 3 am and we just needed a good nights sleep after driving 9 hours that day. All we wanted to do was fall straight asleep. Even if that is all you are planning on doing, do not stay here. We packed our things and fled the property as soon as we could and drove until we found another hotel that we felt safe at. I have a feeling our experience is not the only one, considering the lobby is isolated and has a TV in it, I wouldn't be surprised if someone was keeping a close watch on you there. If you stay here I would be VERY cautious of your surroundings.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Silver Spring, MD", "Title": "“Mixed”", "Author": "wildlife_lover", "ReviewID": "UR120050588", "Content": "Good Check in and checkout was quick and easy. Desk staff was pleasant. The suites are large with a full kitchen - more like an efficiency apartment. Free wifi worked well. Bad My card keys did not work well. Had the desk replace them once and it still required several tries each time to unlock the door. The burners on the stove worked, but weren't flat-like they didn't quite fit. Also, I called for a wake-up call one night and there was no answer! Finally, I am usually a sound sleeper, but the room I was in was quite noisy. FYI They don't clean the rooms every day. This is fine with me, but for a family it might be a nuisance. Also, that means they don't refill soap etc. daily. Location was convenient for me to visit relatives on the north side of town. It's just off the beltway and a major cross street. However, you must have a car to stay here.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Auburn, Indiana", "Title": "“Very Disappointed”", "Author": "Sticko1968", "ReviewID": "UR118676719", "Content": "Our stay started off with our key not working in the door, then being surprised as the door opened from the inside. The man said he was maintenance and that he checks all rooms before the guests arrive. Check in is 4pm, this was after 9pm. Seems odd, doesn't it? There were cobwebs, dust on the couch and what looked like some sort of berry left on the floor in the kitchen. It could have used a bit more cleaning. We got a room with a fireplace and I asked one of the desk-workers if they supplied logs to burn (since this was a wood-burning fireplace instead of a gas) and she said she had no idea and thought that the fireplaces might just be for looks. Only on checkout, when I inquired again, was I told that there were logs you could purchase in the gift shop for $4 each. Breakfast was advertised as being served until 8:30 on the weekdays and 9:30 on weekends. We got there at 9:10 on a weekend morning and most everything was already put away. We got the last two muffins and the only other choices were toast or cold cereal. The staff member cleaning up turned the waffle iron off minutes after we arrived in the room, and never asked us if we'd like anything, having seen that we had just arrived. It just seemed like customer service was the last thing on anyone's mind. We will not be returning.", "Date": "September 27, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“A good place to stay if you are on a budget”", "Author": "Betty Lou P", "ReviewID": "UR118024793", "Content": "We spent 7 nights here. The price was reasonable. This is not a regular hotel as the room is only cleaned on the third and the fifth day. So come prepared for this. Each unit has a full kitchen and there is a wood burning fireplace. The room was clean. The staff was extremely helpful and accomodating. We did not have breakfast as we had a kitchen to prepare our own food. The coffee and cookies were good. Would I come back? absolutely.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Essex", "Title": "“Needs updating”", "Author": "jackie4a", "ReviewID": "UR117654017", "Content": "The rooms are a good size, but look a bit tired and need updating, the staff were very helpful and when we had a problem with our room fixed it straight away and gave us vouchers for a complementary meal and cinema tickets, the breakfast was served to early for people on holiday and we missed it most days, but you must have a car when you stay at this hotel.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Toledo, Ohio", "Title": "“Big Disappointment, won't go back”", "Author": "DCoop_11", "ReviewID": "UR111432016", "Content": "Room smelled like smoke, ants in the room, food crumbs on the top of the refrigerator, disappointing breakfast, knock at the door at 3 am, minor maintainence issues throughout.", "Date": "June 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mt. Plesant", "Title": "“Never Again!”", "Author": "dacsac", "ReviewID": "UR109507913", "Content": "I have stayed here every May for last 5 years for a weekend to attend Indy 500 qualifying. The overall decline since taken over by Gatehouse Suites is obvious. In May 2010, I inquired about Gatehouse's plans for th hotel and was assured of major investment in the hotel. One year later, nothing has been done. Our room had no working AC,, the beds were not made or room cleaned after our first night. No fresh towels, soap, etc. Paint was missing around front door. My bathroom door was covered with handprints. The handprints could have been cleaned with a cleaner and a cloth. This was my worst stay ever in the facility. I won't stay again and cannot recommedn this facility to any traveler.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mundelein, Illinois", "Title": "“Very pleasant surprise”", "Author": "PattiB51", "ReviewID": "UR95434604", "Content": "The accommodations were perfect for the three of us and dog. The only improvement I would suggest is replacing the seal on the entrance as there was quite a draft which had to have impacted the heat! We did not partake in the breakfast as we brought our own food.", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mishawaka, Indiana", "Title": "“Gatehouse was our home away from home and we were treated like family.”", "Author": "Marylou87", "ReviewID": "UR95313622", "Content": "The staff at Gatehouse was great! We came for my father's surgery and ended up having to stay 3 weeks. Everyone went out of their way to make sure we had everything we needed to feel comfortable so that our focus was on our father in the hospital. We had a beautiful room with very comfortable beds and all the other luxuries of home. Such as full size fridge, oven, microwave, dish washer and fireplace. A delicious breakfast was served every morning and they also served supper 3 nights a week. We became fast friends. We were even asked for daily updates on how our father was doing. Thank you Ricky, Kim, Omar, Shawn, Nikki and others that I know I am forgetting. You are the best!!!!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tuzla, Bosnia and Herzegovina", "Title": "“Exceptional value for money”", "Author": "edindzeko", "ReviewID": "UR93452016", "Content": "I am glad to have opportunity to write a review for the hotel. I booked it thru hotels.com for only $62 (after reading reviews), and as soon as I entered the suite I realized it was a deal. It was more then spacious, clean, kitchen was neat, big separated bathroom, and the most important thing was that more then friendly front desk staff that allowed me to check out late, at 4pm since my son needed a rest during his competition. Also, they offered complimentary internet, breakfast, next to the bulding parking space and newspapers. Again, it was very pleasant stay.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Beware your belongings”", "Author": "pmcclainohio", "ReviewID": "UR79940708", "Content": "We had a valuable personal item stolen and the management handled it very poorly. I would not recommend this hotel based on their total lack of concern for your personal property and their inability to offer quality customer service. Beyond this, we have stayed here in the past and the rooms are quite good. Watch your back, though.", "Date": "September 17, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Your valuables are not safe here!”", "Author": "justalong4theride", "ReviewID": "UR79578264", "Content": "We had personal property stolen from our room. Very poor customer service. Would not stay here again. Completely do not trust the staff. Someone is now enjoying my daughter's 32 mb iTouch compliments of the Gatehouse Suites.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Watsonville, California", "Title": "“User Friendly”", "Author": "pacair", "ReviewID": "UR75350701", "Content": "Good value on an older Suites style hotel. This Place is clean and the rooms are spacious. Kitchens are adequately stocked, Refrigerator and dishes were clean. Combine this with easy access and a friendly staff and you have a user friendly hotel. This place shows its age and the Maintenance crew (If one exists) needs improvement. Housekeeping is very good. Still it's often about location, service and value. This place should be considered.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Port Jefferson, New York", "Title": "“Everything You Need,,,Increduble Value”", "Author": "pjmamaz", "ReviewID": "UR74763519", "Content": "I recently organized a 10 day group stay for 14 families attending the Junior Gold Championships and the stay at Gatehouse was better then I could have imagined. From the start, Gretchen, (group sales) did everything possible to make this a fantastic stay:, the group was put in the same location, all special requests for room locations were perfect and at check-in all guests were greeted with a wonderful welcome letter and a warm cookie. The rooms were great... clean, comfortable and had all we needed for a home away from home. The housekeeping staff kept the rooms spotless. After returning from a long day of competition the kitchen was spotless, dishes in the dishwasher were clean and our beds were all ready to climb in. They served breakfast daily and a light dinner 4 nights a week. It was great to come back and have a cold beer and/or glass of wine ready for you. The only downfall at breakfast was the eggs but they were really no different then any other scrambled eggs that are left to stay hot over a sterno. Finally, there was Omar...the everything man!!! The dishwasher leaked one night, Omar came running, anything the kids asked for Omar came running. By the end of our stay the entire staff made us fell like family. We are all still taking about the trip and Omar a month later.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Indianapolis", "Title": "“OK, but you could probably find someplace better”", "Author": "mmd2e", "ReviewID": "UR42443439", "Content": "My wife and I (and our baby) stayed here for 2 weeks while we were waiting to close on our new house. We stayed in one of the queen studios (which are at ground level). The hotel is set up \"apartment-style\" with clusters of small buildings (each containing 8 rooms), where the rooms are accessed from outside. The room itself was fine (albeit a little dark), and the bed was good (a little firm for my taste, but not bad). The room consisted of a sitting area (love seat, lamp, small desk, TV, fireplace), a food area (full kitchen, including oven, full size fridge, dishwasher, and table/seating area), sleeping area (bed, nightstands, lamps, sliding door to tiny patio area), and bath area (around a corner from the room, with tub/toilet in separate room). Highlights: Breakfast is pretty decent (although it's essentially the same thing every day, with a few other items rotated in now and then - it got old after a few days of it). Usually had eggs, potatoes, meat (usually sausage), waffles, bagels, cereal, fruit, occasionally biscuits and gravy or french toast, and one day there were doughnuts. Unlike some extended stay hotels, they do come and clean your room every day here. Staff was always friendly when I encountered them (and that included both an early check-in and a maintenance call, as well as daily interaction with housekeeping, since I was working in the room). Convenient location (near lots of stores, etc.) and good price (cheapest Residence Inn in the area). Downside: The property is beginning to show its age (especially on the outside - the insides appear to have been remodeled relatively recently). The toilet in our room actually sprung a leak twice while we were here (the first time was one week into our stay, so they did a temporary fix rather than making us change rooms - the second time was on our last morning). If you get a room on the back side of the property (like we did), you will have a lovely view of the back side of a somewhat run down strip mall. There was a huge gap all the way around the door (worst at the bottom, where the gap was probably about 3/4 inch) that made it so you could hear everything outside. Usually this was not a big problem, except for the night that some people staying at the hotel came home after the bars closed at 2 am and decided to make a bunch of noise out there in the parking lot. There is also an unexplainable sulfur smell in that part of town that we noticed twice while there (which of course could work it's way into the room due to the large gap around the door). The first time it woke us up during the night and we looked all around to try to figure out if something was burning or something, but eventually figured out it was coming from outside. With all that said, it was not the worst experience I have ever had at a hotel, but if I had it to do over again I would probably stay somewhere else. I don't want to make it sound like the hotel was BAD or anything, but I guess it just wasn't quite up to the level I expected.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Guy_From_Normal", "Title": "“Customary Residence Inn”", "Author": "Guy_From_Normal", "ReviewID": "UR22560719", "Content": "We recently stayed one night at this Residence Inn in a queen studio room. Our room was clean and equipped with a fireplace and a full kitchen. The mattress on the bed was hard and uncomfortable, and due for a replacement. The sheet on the mattress did not stay fitted very well either. This hotel consists of several suites located in many two story buildings. In order to have the free breakfast buffet, we had to walk outside up to the building that houses the front desk. That would be a nice stroll on a summer day, but not when it was 2 degrees and snowing (like our stay). Pros - Great breakfast - Friendly and courteous staff - Clean - Free newspaper Cons - Need to walk outside for breakfast - Uncomfortable bed", "Date": "December 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Lansing, Michigan", "Title": "“Spacious room but a few drawbacks”", "Author": "jpete02", "ReviewID": "UR21013251", "Content": "We stayed at the Residence Inn for two nights in October. We got a great weekend rate ($71) and overall were very pleased with our stay. This is an older Residence Inn and unlike the newer Residence Inns the hotel does not have interior corridors. The upstairs rooms are accessed by an exterior staircase which is kind of a pain when you are carrying luggage. It would even be worse if the weather is bad. The room we had was a studio with a king bed, which we found to be quite spacious, clean, and very nice. There was a full size kitchen, a living room area, and a bathroom with a separate sink/vanity area. The breakfast was also very good and had a good combination of hot and cold items. Besides the stairs, the other drawback was this hotel is located off of a busy street (Michigan Av). You can hear some of the louder traffic noise in the room. We were able to solve this problem by turning on the fan, which blocked the noise. Finally, if you are looking for a hotel that is convenient to downtown, you may want to look elsewhere. You can take Michigan Av all the way to downtown but it will probably take at least half an hour with all of the stoplights. The other option is to follow I-465 to I-65 but that takes at least 20-25 minutes as well. However, this hotel is pretty well situated if you want to go to the Art Museum or Butler University (about 10-15 mintues).", "Date": "October 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“May 9th - 11th, 2008”", "Author": "AmericanRNinNZ", "ReviewID": "UR15937310", "Content": "We stayed here for Graduation Weekend and had a studio and a 2-bedroom suite. My whole family (husband, in-laws, and gramma-in-law) all thought that it was very nice, clean, & functional. The rooms had more space than I anticipated, and the staff was very polite. We requested a late check-out time, and they let us stay till 3pm, which made things easier. I also liked the fact that they are pet-friendly, as we brought our little Westie along with us! I would probably stay here again. It is not luxurious, but they had breakfast every morning, complimentary grocery shopping, fully equipped kitchens, and were clean. The only downside was that it can be noisy from traffic due to its proximity to Michigan Avenue & 86th Street.", "Date": "May 11, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Delphi Indiana", "Title": "“Thank You Dee Dee!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1662467", "Content": "I haven't even been to the hotel yet, but I am so excited about our stay at the Residence Inn, Northwest, Indianapolis, Indiana. It is so true that the front desk and reservations employees are the true first impression of hotel properties. The lady, Dee Dee, who first gave me all the information I needed and more was kind, courteous, and down right enthusiatic. Now, whether it was her job, her life, whatever or whomever, she was a joy to speak with and succeeded in selling me a room at that particular property because of her enthusiam and overall excellent people skills. I use to work in the hotel business, in fact, hotel business was my favorite of all jobs and/or career choices. I truly loved my job, my life, and wanted other people to feel the same about their own lives. Dee Dee has a personality that is larger than life and that should be recoginized and rewarded because that is what makes other people smile. Ultimately that is what being in the service sector is all about right; giving people what they need. I look forward to our stay, and we all have Dee Dee to thank for that.", "Date": "February 20, 2004"}], "HotelInfo": {"Name": "The Gatehouse Suites Indianapolis", "HotelURL": "/ShowUserReviews-g37209-d91506-Reviews-The_Gatehouse_Suites_Indianapolis-Indianapolis_Indiana.html", "Price": "$66 - $113*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3553 Founders Road</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46268</span></span> </span> </span> </address>", "HotelID": "91506", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d0/6c/d06cffbc29b41b5f2165806176c584b53large.jpg"}}