{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Kandahar, Kandahar, Afghanistan", "Title": "“Little Bang for you buck.”", "Author": "Justin M", "ReviewID": "UR126225922", "Content": "SMALL rooms, high price, ancient commodities and indifferent staff. The only good thing is the location.", "Date": "March 17, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“HÄ±ghly recommend to try Cem-Sultan Hotel--Cheap prÄ±ce, Exelent servÄ±ces & FrÄ±endly Emploee”", "Author": "MonaAyda", "ReviewID": "UR115176562", "Content": "If you are lookÄ±ng for a place to call home thÄ±s Ä±s Ä±t! (even better than my own home;)) Murat ( manager) made my stay more enjoyable by takeÄ±ng care of my all need wÄ±th not only gettÄ±ng my breakfast Ä±nsÄ±de my room B/C I wasn;t able to go upstaÄ±rs, but also he helped me to set up my new (TurkÄ±sh) cellphone. I feel so welcomÄ±ng... I would hÄ±ghly recommend to try thÄ±s HOtel", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Overpriced hotel with good location”", "Author": "lacalif11", "ReviewID": "UR111991385", "Content": "My 1st choice of hotel was booked, so they recommended the Cem Sultan Hotel. I took a chance, and walked the 5 minutes to visit hotel. Pleasantly surprised. For the ammenities, the hotel was overpriced (50 Euro). However, the price included taxes, buffet breakfast and wi-fi. Some rooms have sea view. Rooms are small, yet clean. The hotel is very convenient - 5-10 minutes walking distance to major attractions (Blue Mosque, Aya Sophia, etc.). It's also 5 minutes to tram station to go out further. Would stay here again if the price was lower.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "michigan", "Title": "“delightful location, nice breakfast with a VIEW”", "Author": "bokarMichigan", "ReviewID": "UR102024796", "Content": "Daughter and I stayed 3 nights, Nov. 2009 and found all quite suitable, comfortable and clean. We both have traveled extensively and would have no qualms about moving to another location if this did not meet expectations. GREAT location, Nice staff.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“Quite literally one of the worst night of my life! Dustmites, cardboard walls, no central heating!”", "Author": "muzby1", "ReviewID": "UR60590381", "Content": "I read the reviews on this site before booking in at the Cem Sultan for 4 nights. There is a couple of really good reviews and some really bad ones. As an easy going and optimistic type of person I decided to ignore the bad reviews, book my girlfriend and I in get on with our holiday planning. I have stayed in hundreds of hotels and hostels around the world from $2 huts in Thailand and very budget hostels in Bolivia to the Ritz in Jamaica and Bellagio in Las Vegas and I have to say this is the WORST accomodation I have EVER stayed in. Trust me basic hotels do not bother me. First of all the room is horribly presented, ok I'm not overly bothered about that. Next the walls are paper thin, I could hear the room next door talking like they were in the same room and doors were slamming throughout the night. Next they turn the heating completely off so it wall really cold so we had do use the old air con unit to keep the temperature in the room. There were big black hairs in inside the bed which were probably from the previous people and the sheets were like they had never been washed, were old, very dusty and probably had all sorts living inside them. The dust being wafted around the room by the air con made me feel really sick and disgusted. Went to bed at midnight, was still awake at 3am when I just wanted to go and find somewhere else. I was still awake and 5am when the call to prayer started over loud speaker at the Blue Mosque (yes great location!!!) and by 7am I finally fell asleep after deciding to sleep in my clothes. At 10am I got up, refused to risk breakfast and checked out, refusing to stay the following night which my girlfriend I were book in for. and went to a different 3 star hotel called Asur which was basic but quiet and clean and a palace in comparison. Cem sultan would have ruined my first days sightseeing had I not been so tanked up on Turkish coffee (which is excellent!) I honestly would have rather lost all the money I had paid to stay any longer at the Cem Sultan then stay another minute!! After we were out of there our holiday was amazing, the people were really friendly. I really can't understand where the good reviews could have come from on this site for this place as this was literally the worst hotel or hostel I have ever stayed in!!!!!!!! Take it from me and please don't risk it!!!", "Date": "April 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Quito, Ecuador", "Title": "“Not worth it for price”", "Author": "Karuixia", "ReviewID": "UR59663518", "Content": "The location is really good but with the same price (50 EUR) you can go to a better hotel in the area. I donÂ´t think is worth it more than 30 EUR. It was a total rip.off.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“AVOID, AVOID, AVOID”", "Author": "traveller101011", "ReviewID": "UR49009743", "Content": "Disgusting attiude of owner and staff. Did our laundry, caused over 50Euros of damage and refused compensation, despite repeated promises to pay. Wouldn't stay there again if the rooms were free. Undoubtedly the worst service experienced in Turkey", "Date": "November 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Sleazy and Nasty!”", "Author": "Heidi1972", "ReviewID": "UR38230114", "Content": "My stay at the Cem Sultan was nothing short of a dissappointment as I paid 50 euros to stay in what should be described as a sleazy and noisey HOSTEL, not hotel! When we arrived we were abruptly asked to pay up on the spot at reception for the four nights that we had booked. However, it would only get worse as the lights in the hallway to our room flickered on and off as I passed rooms with their doors lying open and half naked teenageers lying on their beds with their televisions blaring loudly. The room was shocking as the ceiling lamp hung with wires exposed and also flickered on and off and for most of the stay did not work at all which was a problem as it was the only light in the room. The furniture was filthy and not acceptable to place your clothes in due to the dirt and the amount of space it offered and so we lived out of suitcases. I had to pile up some of the furniture to make enough space to put two suitcases in the room. The beds were hard and uncomfortable and the bathroom had no shower cubicle and so the water flooded the bathroom floor. The tiles near the toilet were not secured properly and looked like they were ready to drop onto some poor victim's head in the near future. The window in the room faced a brick wall and we could hear a baby crying a lot with a Turkish family chatting/arguing a lot at night and during the day. The first night we stayed, someone knocked on our room door several times and tried to open our door at one o'clock in the morning by turning the door handle - not pleasant! The breakfast room was dusty and old and very out of date decor and the view minimal and mostly of horrible crumbling roof tops. The breakfast consisted of stale bread and the jams etc looked like they had been there for some time! Overall poor and considering the hygiene of the place I mostly relied on a slice of water melon and a cup of coffee and avoided the rest. This hotel did effect my time in Istanbul and I advise you to find another hotel in this area as the location is very good but it has nothing else to offer.", "Date": "August 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Reasonable but nothing special”", "Author": "SydneyPearl", "ReviewID": "UR34714619", "Content": "I am slow to getting around to write my reviews but I stayed here last year with my family. Like so many have said the location is great for the Sultan Ahmet Area. Our room was exceptionally small (the cheap rooms at the back with no view). There was barely any room to keep our luggage. The service was rather cool compared to the hospitality of other hotels in Turkey. But it is clean and very reasonable compared to other hotels in Istanbul. On a previous visit I stayed at the Side Hotel, which although a better hotel was out of price range last year.", "Date": "July 14, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "birmingham", "Title": "“perfect hotel excelent location great staff and manager”", "Author": "edacom", "ReviewID": "UR31924561", "Content": "i stayed in this mind blowing hotel for 9 night the manager and staff were very helpfull and very kind .the location was excelent 2 minute away from the blue mosque and orther big location. the morning breakfast was very good on the roof terace were you could see the ship going past. every morning the manager mr murat will tell me where to go. they are orther hotel near there but i dont thing you could get the service that cem sultanet will give you. i will be coming back to your hotel next year.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington, DC, area", "Title": "“Superior value in great location!”", "Author": "nellenod", "ReviewID": "UR31908677", "Content": "Spent five nights here in a room overlooking the Bosphorus and could not have been happier. We chose a room in the Sea View category and both room and bath were comfortable size and quiet. Location can't be beat for access to Blue Mosque, St. Sophia, Mosaic Museum, Underground Cistern, and the tram--five to ten minutes' walk will get you to any of them. A block away are twenty or more pleasant restaurants serving typical Turkish fare as well as European dishes (our favorite was one called Family Restaurant). Breakfast was fine for a three-star property and included a beautiful vista over the water. There's no lift, so if climbing stairs is a problem, this might not be the place for you. The manager could not have been more pleasant or helpful.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Take your earplugs if you want to get even a wink of sleep”", "Author": "michelebrab", "ReviewID": "UR31578151", "Content": "It's more of a bed and breakfast than a hotel. 1. It's loud! We got a deluxe room with a Bosphorus Room. All rooms with Bosphorus views, as it turns out, are right next to the stairs. We could hear everyone coming in and out of their bedrooms and then down the stairs. What other reviewers have said about the staff sitting around watching their t.v. (loudly) is very true. From our room we could here conversations as well as the televison (which is on all day and all night). Their friends are over all of the time and it's more like their living room rather than a place for the hotel guests to sit and relax. Bottom line on this point is that I had to buy earplugs to block out the majority of the sound so that I could actually get some sleep. 2. It's not very clean. While pleasant in smell, I noticed that our sheets weren't changed until I asked and forced the issue. Not once in our week stay was the floor cleaned or the little rug vacuumed. The bathroom shower or sink weren't cleaned, and the garbage wasn't thrown out unless I requested. This probably won't bother you unless you stay more than two days. 3. Television only got Turkish and one French channel. 4. Breakfast was decent but not started on time and usually ran out of items early on. Overall, it's a step up from a hostel but a step down (way down) from any budget hotel you might be used to. The location, again is great, and the price was decent. Just remember, the earplugs.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Skip the 'Promotional' rooms”", "Author": "kaisatsu", "ReviewID": "UR29889352", "Content": "We stayed three nights at the Cem Sultan in a \"promotional double\" room. We wanted to book one of the hotel's normal rooms, but the budget room was all the hotel had available. The website listed this as a \"smaller room\" with a \"window looking to small space.\" Since the price was quite low, and many of the other hotels in the area were already fully booked, we decided to take a chance. We didn't mind a small room (we've stayed in smaller), and we didn't particularly care about having a view. The location of the hotel is fantastic, just down the street from the Four Seasons and only a block or two from the open gardens between the Blue Mosque and the Hagia Sophia. The location made it very convenient to visit all of the sights of Sultanhamet, and it was a short walk past the Blue Mosque to the Sultanhamet tram stop. Our flight to Istanbul arrived quite late, but we had no problems checking in at such a late hour, and the room was small but not uncomfortable. Breakfast was served on the top floor of the building, and the stairs might be difficult to manage for those with low mobility. The breakfast itself was only average, and the buffet contained cold meats, cheeses, raisins and dried apricots, corn flakes, white bread, and yogurt. The view of the sea from the breakfast room was nice, and we appreciated the fact that the room was enclosed, since we were visiting in a colder month when we wouldn't get much sun on an outdoor terrace. However, even with our low expectations for the room, it still managed to disappoint us. We certainly didn't have a view, since \"small space\" turned out to be little more than a ventilation shaft, and the room received absolutely no natural light. This was a bit inconvenient, since we need to turn on the lights even during the day, and in the mornings we woke in the dark. However, the most annoying thing was the bathroom. When we first arrived, we had to fiddle with the knobs on the plumbing to start water running to the toilet, and the shower was a constant source of grief. There was no curtain or stall, so luckily we didn't leave anything in the bathroom while we showered, because the floor drain was extremely slow. After only a few minutes with the shower running, the entire bathroom floor was flooded with 2 inches of standing water! Anyone needing to use the sink or toilet afterward had to wade through the room. And once the water did finally drain, some kind of problems with the plumbing meant that a bad odor would sometimes come from the drain. Glancing into the other rooms as they were cleaned each day, the standard rooms seemed quite large and attractive with plenty of light and attractive archways. One would hope that with more frequent use, they might have better-maintained plumbing and not suffer from the same issues as our room. Our \"promotional\" room was very inexpensive, so for the same price I think we might have been better off booking a private room in a hostel or lower-end pension that might have been brighter and better maintained. And while I do hope that the standard rooms are in better condition, there are some very nice choices in the same area for only a few euros more.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Halifax, Nova Scotia", "Title": "“lazy & charmless staff, grim tiny room”", "Author": "novaterracotta", "ReviewID": "UR29370762", "Content": "After reading the positive reviews about this hotel I thought it would be good value but quickly realized that it wasn't worth the 50Euros . I'd pre-arranged to be picked up at the airport but wasn't met by anyone. When I arrived at 3:30 pm the front desk clerk denied that anyone was supposed to meet me ( though I'd had written confirmation) & said my room wasn't ready.The front of the building still had Xmas lights up ( this was Easter) and junk stored in front of the building. The staff sat around the loud TV in the lobby day & night ( which I could hear from my room). The phone didn't work in my room. Bed was a mattress/boxspring on the floor. Glass shelf above bathroom sink was broken and kept falling down - so no where to put toiletries. My room was stuffy, dark & very small with a window facing a dark courtyard with the back of crumbling buildings. This may be adequate for 1 night but would've had a negative impact on my week long stay in Istanbul. Luckily I found a real gem , this new hotel which had just opened: the Darussaade ( in Sultanahmet) & for 95Euros a night had very friendly & attentive staff, small but elegant room with 2 bright windows, sauna in basement, extensive buffet breakfast. It cost twice as much as Cem Sultan but was 6 times better. My advice is to fork out the extra cash and upgrade for much better value if you plan to spend more than a couple of nights in Istanbul. I was traveling alone and looking fo", "Date": "May 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "VintagePeanut", "Title": "“Unfortunate little hotel”", "Author": "VintagePeanut", "ReviewID": "UR29033551", "Content": "Needed a place to stay for one night in Istanbul on the cheap last minute -- unfortunately I chose Cem Sultan Hotel. While the price was very good, the overall quality of the room coupled with the terrible service made for an unpleasant experience. The only upside is that the location is great if you are a tourist -- in Sultanahmet, less than 2 minutes from the Blue Mosque/Haja Sophia...but there are so many hotels in this area...please don't pick this one. My main complaint besides the rude staff who tried to swindle me out of quite a bit of money for a \"ride to the airport\" (who also lied about how much cab fare costs...luckily my local friends came to the rescue), was the fact that my bathroom floor was covered with a swarm of tiny ants. Unacceptable and gross. Would NOT stay here again or recommend it.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Very good value”", "Author": "sgoulart", "ReviewID": "UR28893888", "Content": "I spent 1 week with my husband at Cem Sultan. We stayed at the smaller (and cheaper room). We had a free airport transfer that was very helpful. The hotel has a great location, close to all main atractions in a quiet street. The breakfast is simple, but everything were fresh. Our room was tinny, but we expected that already. They cleaned our room and changed towels every day. The only con is that the walls are very thin and we could hear everything from the other rooms. There is wireless in the room and a computer with internet at the reception for free. If you are looking for a budget hotel with a great location, this is the one for you!", "Date": "April 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Tiny rooms, poor customer servce, great location though!”", "Author": "anniekLondon", "ReviewID": "UR28497820", "Content": "If you're not too fussed about the quality of hotel that you go to, want it to be cheap and within easy walk of all the major tourist attractions of Istanbul then this place might suit you. We were expecting the room to be small but were quite surprised with our standard room -we struggled to find a place to put our case and the bathroom..... Our room overlooked a sloping corrugated roof complete with dead seagull. On reflection, paying a little more for a better room would have been a good idea. Breakfast was adequate but the atmosphere was decidedly East Berlin before the wall came down. Our main complaint was with the customer service on check out -we checked out at 7am and were made to feel it was a great inconvenience. We also lost a guidebook from our room and have our suspicions...We were glad that we only booked to stay there for 2nights.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Decent Hotel for the Price”", "Author": "BayswaterBabe", "ReviewID": "UR28000222", "Content": "We felt that we got a good price for our hotel (about Â£40 for a double room per night) so we didn't have high expectations. The manager organised a taxi to pick us up from the airport for 25 Euros and gave us a warm welcome on arrival. Check in was efficient and very friendly. We had a room at the back of the building overlooking other buildings and was quite dark. The room was quite basic, very dated and run down. I think some of the rooms have been renovated quite nicely tho and the ones with a sea view at the front looked much bigger and far nicer. The lamp by the bed's plug looked precarious, the wall around the socket had crumbled away and there was a couple of exposed wires coming out of the plug which didn't look particularly safe. The room was quite loud - we could easily hear everything from every side of the room. The bed sank heavily towards the middle and wasn't very comfortable. The room was a bit too warm for me with a heater on which we couldn't turn off. There was an air conditioner but it didn't seem to be working. The bathroom was freezing, very small and very old. Getting in to the shower was a bit like doing an assault course. The shower nozzle was one of those annoying old ones with water going in every direction but it was hot (even if it was difficult to get the right temperature) which was better than our friend in the next room who could only get luke warm water. There was a small fridge to store water in and a television with hundreds of channels, a few English ones. The location was great for seeing the Blue Mosque and Aya Sofia (a couple minutes walk away) and the hotel is within short walking distance to the Grand Bazaar and the Topaki palace. The area around the mosques is quite touristy so there aren't that many good eating/drinking places around apart from lots of touristy ones but there are enough good spots for a few nights. The Sultanhamet tram station and the local overland train station is about 5 minutes walk away which is useful and we used both. Breakfast was ok. Tea. coffee, hard boiled eggs, some Turkish pancakes, most of the time there was some bread, some dried fruit, some cheese, a little salad, and some cereal and jams. On one day there was some boiled mini Frankfurter type sausages. Not amazing but the view from the top is fantastic. The manager was very friendly and helpful. There is one computer in the lobby area which has internet access which we used to check in for our return flights. All in all, a decent hotel considering the price and good location for sightseeing. I would stay again but only if I could get a better quality room for a good price.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jerusalem", "Title": "“Get a room with a sea view”", "Author": "martinlemke", "ReviewID": "UR20977706", "Content": "Cem Sultan (only after arriving in Istanbul I realized that it is pronounced as \"Jam Sultan\", for \"C\" in Turkish sounds almost like \"J\", e.g. \"caz\" for \"jazz\") is a small quiet hotel located on one of a tourist streets in the Sultanahmet district of Istanbul. On the opposite side of the street there are some peculiar remnants of Roman era and as a result the hotel obtains an unexpected feature - a broad view to the Bosporus joining the Sea of Marmara, Princess Islands and the Asian part of the city. From my window I could see scores of busy small fishing boats in the morning, passing the straits large cruise ships, tankers, ferry boats, military ships; once early in the morning I even spotted a submarine going to the Black Sea direction. It is an awesome experience, to wake up in the morning with the Bosporus before your eyes, or to see the full moon rising over it in the evening. My room had a \"deluxe\" prefix, which means two things - the sea view and some additional space. This additional space makes it a regular hotel room we are familiar with and makes space for another window - as a result the room looks bright and even spacious, though I would use this world carefully. Apparently, not all the rooms in the hotel has the sea view, probably four of them. The others, most likely, face the nearby buildings. Finally, everyone has a chance to admire the view from the cafe on the top of the building. The breakfast was surprisingly good, featuring very good turkish tea (Ã§ay), cherry and strawberry jams as an addition to a regular set of cornflakes, milk, coffee, fresh bread, cheese, sausages, eggs, olives and vegetables. Do not forget to add the boiling water to your cup of tea, otherwise it might be way too strong. The staff in the hotel was very helpful, non-intrusive and accurate, and I mean every world I said. Manager of the hotel, Murat, who speaks English perfectly, is your man for answering any questions, making arrangements and solving problems. There were some minor problem like TV having just one program (probably the last thing I would care in Istanbul is watching TV). The hot water in the hotel is typical for southern countries - sometimes you have to wait a minute for hot water to come, though sometimes it comes at once. The hotel is located in the very middle of the Sultanahmet district, as a result you can reach Aya Sofia, Sultanahmet (Blue) mosque, Cisterns, Topkapi palace in couple of minutes. The Bosphorus banks are in 5 minutes from the hotel, there is a beautiful park near the Topkapi palace - go left from before entering the Topkapi gates near the Aya Sofia till the next entrance in the palace walls, - which is good for jogging in the morning. The restaurants in the area are very tourist oriented, there are plenty of them but in fact I didn't find any that I really like. The only exception is the CafÃ© MeÅŸale in a minute walk from the hotel, which features life Turkish music performances, dervish dance and totally relaxing atmosphere in the evenings.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "istanbul", "Title": "“So friendly and clean...”", "Author": "Liny56", "ReviewID": "UR20866378", "Content": "We were so pleased with our choice of this delightful hotel. I didn't expect such a fabulous view from our room. We could see the Marmara sea and the Blue Mosque - This was enough in itself to be the perfect place to stay. The entire time we were there, we did not take a cab. Everything was within walking distance. The weather was perfect. The hotel was immaculate. I am extremely fussy and I believe this is the cleanest hotel we have ever stayed in. The staff are just wonderful - very friendly and helpful with anything you want. breakfast was great. The best treat was the rooftop restaurant. This is a must if you are in Istanbul. The view was breathtaking. We stayed six nights and had the hotel staff arrange all our day tours. We were picked up at the hotel for each tour and the groups were small. This was extremely convenient and time saving. I would like to thank to Murat (the manager) is so kind and funy person. We plan to go back to Istanbul and will definitely stay again at the Blue House. Thanks to all the wonderful staff that made our trip great", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamilton", "Title": "“Cemsultan is Greatfull”", "Author": "CarenHamilton", "ReviewID": "UR17040932", "Content": "We had a wonderful week at the Cem Sultan - the manager Murat and all of the staff were very friendly and helpful, particularly to my husband who is handicapped. The view from the breakfast terrace is great, and we enjoyed hanging out there in the mornings before commencing our tourist activities. The room was comfortable with canopy bed and Turkish style textiles that add extra interest. The bathroom was newly renovated and in excellent condition. in the lobby had a great celligraph works on cellin's. we loved it The hotel is right in the heart of the historical district and within walking distance of many key attractions, including Topkapi and the Blue Mosque.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Islamabad", "Title": "“wonderful stay at the Cem Sultan”", "Author": "sohailkhan", "ReviewID": "UR16956122", "Content": "Date 16th June 2008 Istanbul and Ä±ts people are wonderful! Before arrÄ±vÄ±ng from PAKISTAN wÄ±th my wife and children I was a little concerned as thÄ±s was my first visit to Turkey. We had booked at the CEM SULTAN HOTEL Ä±n the Sultan Ahmet area of the cÄ±ty. Since I was travellÄ±ng with children there were many questÄ±ons on my mind - What would the hotel be like? Would Ä±t be as good as Ä±t looked on Ä±ts website? Would there be any nasty surprÄ±ses Ä±n srore for us? Would we be charged hÄ±dden extras? I need not have worried! Murat (the manager) and the rest of the staff at the CEM SULTAN hotel gave the perfect holÄ±day of a lÄ±fetÄ±me! I can recommend thÄ±s hotel to anyone! The manager (Murat) kept us Ä±nformed and entertained all through our stay. Although we stayed for 9 days which is a long tÄ±me Murat helped us plan our days and where to go whÄ±ch was very helpful. They also booked taxÄ±s and a lovely tour to the PrÄ±nces Islands whÄ±ch was a fantastÄ±c day out of the maÄ±n cÄ±ty of Istanbul. The hotel was of an excellent standard and provÄ±ded good value for money.The rooms were comfortable and clean. The rooms were cleaned and the lÄ±nen changed every day whÄ±ch was so nÄ±ce to see. Me and my famÄ±ly have enjoyed a wonderful stay at the CEM SULTAN hotel Ä±n the lovely city of Istanbul. We love Istanbul and Ä±ts helpful, frÄ±endly and kÄ±nd people. Thank you to all at the Cem Sultan hotel for everythÄ±ng. We wÄ±ll be back soon for sure! Sohail Khan (Islamabad PAKÄ°STAN)", "Date": "June 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "canada", "Title": "“lovely hotel,frendly staff,”", "Author": "ersinCanada", "ReviewID": "UR15179702", "Content": "This hotel is a million miles away from your cookie cutter/formulaic hotels. Itâ€™s full of character/itâ€™s quirky and it has that old world feeling to it. My room was charming and cosy at the same time and also came with a wonderful view. The bathrooms are modern in the ways that counted, clean and are stocked with nice toiletries.The hotel is within minutes of all the top tourist sites which meant I could go back to the hotel easily in the middle of the day for a rest/get an umbrella/get an extra sweater/or drop off my many purchases! Itâ€™s also within a few minutes of a tram stop (which gives you easy access to the Grand Bazaar/Spice Bazaar/Taksim). The hotel couldnâ€™t have been better positioned. Also, the area felt really safe even when I walked back to the hotel at night by myself. They serve up a really nice/varied breakfast which means you can actually eat a healthy breakfast (fresh fruit/cereal. Their oranges were really sweet and especially nice.) But they have something for everyone, including freshly baked goods, boiled eggs//tomatoes/feta cheese/cucumbers.For those of you who are addicted to the internet like me, there isnâ€™t a computer terminal for guestsâ€™ use there but they do have free wi-fi in the bar/breakfast area. Lastly, I found the staff to be very helpful/efficient. I always figure itâ€™s a good sign when you e-mail a hotel and they respond to you within hours as opposed to days, which was always my experience with the Cem Sultan Hotel. And that high level of service was maintained by the staff throughout my entire stay.", "Date": "April 21, 2008"}], "HotelInfo": {"Name": "Cem Sultan Hotel", "HotelURL": "/ShowUserReviews-g293974-d919142-Reviews-Cem_Sultan_Hotel-Istanbul.html", "Price": "$20 - $119*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kutlugun Sokak 28</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34400</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "919142", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/34/c3/34c3992ed0c44a1249237cab2b4e02485large.jpg"}}