{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dortmund, Germany", "Title": "“Didn't sleep for 2 nights”", "Author": "Loopy L", "ReviewID": "UR125910050", "Content": "If you're looking for a hotel which is cheap and in a fairly central location, this place is for you. If you're looking for anything else - don't go here, it won't have it. Main gripes: The beds were VERY uncomfortable. Just a thin, unsupportive mattress on a hard base. The curtains were flimsy, see-through and barely stretched the length of the window so lots of light poured into the room (from streetlamps etc) even in the middle of the night. We opened the window to make the room less stuffy but then got disturbed by the refuse collections immediately outside the building at 7am. Also there was lots of noise from traffic on the street outside at all hours. There was no en-suite, so the bathroom was shared with ~10 rooms, and there was no sink in the bedroom. Might have been fine, except on our floor there were two bathrooms: One for \"men\" and one without a gender label, which I took to be the women's bathroom but it seemed some men were using it as their first choice because it was closer to their bedrooms . The shower cubicle was made of see-through glass, so either you had to shower exposing yourself to anyone who came in to use the toilet/sink (potentially both genders) or could you lock the door which meant noone could use the sink or go to the toilet while you're in the shower. I was especially annoyed when I couldn't use the sink to clean my teeth because there were 2 BOYS who had locked the door on the women's bathroom to take a shower. Minor gripes: The decor is shabby, and the place didn't really feel clean. Towels thin and a bit grubby. I gave it 2 stars because of the cheap price, and the staff were very friendly. However, if you don't have a tight budget and want any degree of comfort from your stay - I really recommend staying somewhere else.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pavia, Italy", "Title": "“Going to Berlin?”", "Author": "GeorgesPiriou", "ReviewID": "UR125198602", "Content": "Six months ago we spent a week at the sister hotel in Adlershof, much closer to the airport. However, this second Berolina Hotel was a pleasant surprise. Don't miss this good-for-money place, somewhat old fashioned, reasonably confortable and unbelievably unexpensive for the location, a few steps away from the Zoologischer Garten station (S-bahn and underground) and buses 100+200 (for a cheap touristic tour). Our two rooms were acceptably clean and simply furnished: no surprises, as we didn't expect frills nor whistles. Enjoy.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“scarce”", "Author": "Luca F", "ReviewID": "UR123821511", "Content": "I've been in this hotel last weekend, I have not a good impression in general because compared the price to the hotel rooms per night are very badly equipped, the wall paint is quality outdoor furniture and also maintenance needs , the hair dryer in the bathroom does not work and the internet wifi works some time, and finnaly I think too much to ask 10 euros for breakfast. On the other hand, the staff greeted us in a way wonderful, giving us all information, and good idea was have a free coffe in the morning. Anyway the hotel is located near metro station and too many shop around it. I only have a bad impression of the structure hotel. if I were to return to Berlin, I will return there only if all other hotels are unavailable", "Date": "January 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rostov-on-Don, Russia", "Title": "“Comfortable city hotel”", "Author": "doe1106", "ReviewID": "UR123058198", "Content": "Comfortable city hotel for exploring Berlin. Near the station of Zoology Garden where the buses number 100, 200. Tegel airport in half an hour. WiFi is not very good quality. In the hotel lobby computer and printer. Free fruit and coffee.There are a lot of shops famous KaDeWe is in the quarter. For the price of 24 euros is an excellent hotel. Nearby are many cafes are not expensive", "Date": "January 14, 2012"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Decent-amazing location”", "Author": "Kelsey M", "ReviewID": "UR117395124", "Content": "This location was amazing! Only a few blocks from the main zoo station and right off the Kudam. We could walk to everything. There were delicious restaurants and bakerys within a 1-10 min walk. So many shops all around! the hotel was okay-had a computer for you to use. The staff was helpful and nice. They helped arrange a taxi to pick us up and bring us to the airport in the middle of the night which we were very thankful for. Not the nicest rooms-very simple. Shared a bathroom which was work cutting over $20 off a night. Always felt safe walking around, even at night. So much to do all around you if you stay here. If you are not picky about how nice/elegant your room is and wanna stay some where cheap, you should stay here. No bed bugs either. I will recommend going on the Fat Tire Bike Tour-it was absolutely AMAZING!! So much fun, so much great history, and the BEST way to see the city!! :)", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Pinellas Park, Florida", "Title": "“GOOD LOCATION - POOR AMENITIES”", "Author": "MICHAELTAMPABAY", "ReviewID": "UR117257370", "Content": "Hotel Berolina has been recommended for its location, near subway station, etc. We appreciated this. Even when my wife needed a doctor, there was one next door (literally) and cost only 22 Euros (some $30). Incidentally, this doctor was discovered by the hotel receptionist on her computer – very special! The room was spacious, with high ceilings and accommodated four separate beds. Bathrooms were at the end of the hallway. No sink in the room. Forget about refrigerator, micro or coffee-maker. Or one of those electric tea kettles popular in Europe. None were there. The bath towels resembled kitchen rags, as seen in Europe quite often (not fluffy!). There was only one man’s toilet/shower per floor. It did not bother us since we tend to wake up after most of the other people. We did not buy the 10-Euro ($14) breakfast, which was overpriced for this class of a hotel (rather hostel). You can try the Berliner’s favorite Curry-wurst for some 2 Euros at a joint downstairs or across the street. One thing that worried me about this hotel was the occasional summer heat waves in Europe. The place does not have any kind of air conditioning, just big windows. When we stayed there, the temperatures were very moderate and the place was getting stuffy. In case of a heat wave, it would be very uncomfortable. Furthermore, I do not recommend this hotel to beer drinkers, as in order to pee at night, you have to dress in the middle of the night and walk to the end of the hallway, where the bathroom is. Worse than camping, where you can pee around the cabin.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Frankfurt", "Title": "“Nice small hotel directly on Kurfürstendamm”", "Author": "apfelwein", "ReviewID": "UR117040898", "Content": "The location is perfect, lots of shops, cafés, restaurants, public transport at your doorstep. We also had a lovely view of the Gedächtniskirche. The rooms themselves were large, clean an nicely furnished. There was a free internet PC in the lobby. I would definitely stay here again (and have in fact tried a couple of times but it has always been full).", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Basic, very well located”", "Author": "missfreakykitty", "ReviewID": "UR115238148", "Content": "Best thing about the hotel is location. Across from Kaiser Wilhelm Memorial Church (which is covered for renovations, so you can only see the disco like bell tower) and right down the road from the main train station (and the start of the fantastic 100 and 200 bus lines). Lots of shops and restaurants nearby, close to the zoo and Teirgarten Park. Hotel had a paid breakfast, which was 10 euro a day p/p so did not go for. Lots of bakeries and other shops around to buy cheaper options. Rooms small and clean, our room had a shower but shared toilet (no one else seemed to be using it though). Wireless internet available, but did not work in our room on level 4, so sat in lounge type area where internet much better (however, using a service that made you re-login every half an hour or so, very annoying!). No English language channels on TV. Our shower head was broken, and seemed to spray out more than down. Did mention to staff, but nothing done while we were there. Desk staff nice, spoke English well and were happy to point out Laundromat etc.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Florida", "Title": "“Excellent Location”", "Author": "evelynyeager", "ReviewID": "UR111626084", "Content": "The single best thing about this hotel is the location. Right across the street from the bombed out Kaiser church (which we did not get to see because it was covered for renovations) and the Europa Center. It is surrounded by restaurants and shopping. It is right next to the zoo and Tietergarten central park. We rented electric bikes at Europa center and saw all of the major cites during our week long stay. It was excellent to pop into the garden on one end of town and pop out close to our destination. You can even see a little bit of the zoo on bike trails through the park. As for the hotel, they offer a pay breakfast which we did not opt for. The rooms are spartan in furnishings but adequate. The rooms were cleaned daily. The desk help spoke excellent English and were helpful and nice. There were two vending machines in the lobby. The room had one bar internet and the lobby had four bar internet, so I went to the lobby to use the internet which was spacious and decent. They offered German language newspapers in the lobby. The TV had exactly ZERO English language channels. I wish they would have had at least one as this is how I relax just before bed time. The bathroom was decent by European standards. The bed and bedding was fine but not luxury. We had a court yard view, which was not particularly nice but it was quiet. There is no A/C which was fine for 6 of our 7 days at the hotel but on the last day, I sure wanted A/C or a fan. The room was hot and miserable -so I went to the lobby with my computer which was comfortable. At night, it cooled down and we were able to sleep comfortably. Overall, for the price, this was a very good hotel. Basic. Well run. Excellent location.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bangalore", "Title": "“Value for money at the heart of Berlin”", "Author": "thomaser", "ReviewID": "UR106640287", "Content": "Our stay at Hotel Berolina was pleasant. My brother and I stayed there for 5 days whilst attending ITB Berlin. The 2 girls who (wo)man the reception are friendly and always willing to help you with any issue – directions, restaurants etc.. The biggest USP for this place is the location. Located at the heart of Berlin in Kunfusterdamm, the hotel is a stones throw away from the Metro station (U+S Bahn), Bus station, Europa Centre and the Irish Pub J. The rooms are adequate for 2 people, though not overly spacious. The bathrooms are clean and dry with hot and cold water. However, they served the exact same menu for breakfast every day that we stayed there. It maybe because we are Indian, but the daily breakfast fare of Cold meats, pastries & bread were duly skipped by both of us. Whilst I wouldn’t rate this hotel as the benchmark of luxury in Berlin, at 90 Euro a night, it certainly is a value proposition.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Small but ideal for a short break”", "Author": "186460Peter", "ReviewID": "UR106207099", "Content": "Small but very clean little hotel. Staff were very friendly and helpful. Situated in the centre of the city with great access to all train bus and undergrounds", "Date": "April 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Petaling Jaya, Malaysia", "Title": "“Good price Great location”", "Author": "gr2k", "ReviewID": "UR102553978", "Content": "The hotel is within 5 minutes walking distance to the S+U Zoologischer Garten station and if you're lucky you may get a view of the Memorial Church right outside your window. The rooms and shared bath is very clean. Despite being a basic hotel, you get TV (all channels in German though), plenty of A/C outlets, wardrobe, etc..WiFi signal is only accessible from the 3rd floor (reception) where there's also a computer for guest use. Internet is hosted by a telco so you have to view some quick ads before using but no big issue. Internet speed is fast enough to get things done. Will definitely come back here for my next trip to Berlin!", "Date": "April 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Clean, safe, affordable & great location.”", "Author": "smkTraveler", "ReviewID": "UR82396593", "Content": "This is a clean, safe, low frills hotel in a great location. The staff is friendly and speaks English well. It is a nice hotel at the price of a hostel, and we highly recommend it. Location: The hotel has a great location next to the bombed memorial church, the Tiergarten, shops, and U & S-Bahn transport. Hotel: We had a double room with a private bathroom. It was very large with basic Ikea furniture, and a TV. The bed was comfortable & the sheets and towels were clean. They provided small soap and shampoo packets, and there was a hairdryer in the bathroom. Internet: They did have Wifi internet, but our room was upstairs and around a corner of the building so it did not work in our room. But it wasn't a problem for us to walk down to the lounge (or even just to the stairwell) to get a connection on our phone. They also have a computer for guests to use in the lounge (along with free coffee & fruit). Breakfast: we had breakfast our first morning (10 Euro). It was a good basic German spread, but nothing great. So the other mornings we chose to go to the nearby bakeries instead. Again, we would recommend this hotel to any of our family or friends. if we ever go to Berlin again, we will stay here.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Very good, basic accommodation. Perfect for a city break.”", "Author": "48_Richard_48", "ReviewID": "UR77477996", "Content": "This accomodation was perfect for what we needed on a city break. The room was clean, the beds were comfortable, and the staff were helpful. Free coffee at reception was a nice touch. My only gripe was that we came back to the room one night to find the door had been left open by the cleaners. All our belongings were still there, so I'd just put it down to \"one of those things\" and not let it put anybody off. I would definitely book this hotel again as it is also in a very good location.", "Date": "August 30, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "5", "Service": "4", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Good value for money”", "Author": "Dorothy O", "ReviewID": "UR72273683", "Content": "Our first impression when entering the hotel was that it is spacious - mainly due to the high cellings. We got a room on the fourth floor and it was indeed quite big. The furnishing is rather simple, almost ascetic (not to say uncomfortable - the beds were very good). Everything is in good condition though - no loose handles or wobbly chairs etc. Our room had no bathroom - we had to share with other guests on the floor which wasn't bad as only two of the four or five rooms on the fifth floor didn't have their own bathrooms. A downside of the room was that the elevator only reaches the fourth floor so we had to carry our luggage up a flight of stairs. The hotel staff speak fluent English and were all kind and helpfull. You can leave your post at the reception to be sent, buy stamps and snacks, store your luggage or ask about local curiosities and will always be served well. Something you should know is that the hotel has a specific policy considering linen and towel changes: unless you ask for a daily change at the reception they will change it only about 2 times a week (of course you do get fresh linnen at check-in!). The biggest drawback was the wifi access (or rather lack of it) in our room. We had to go down to the fourth floor to have a stable signal. The second thing we didn't enjoy was that there was no air-conditioning in our room (on the top floor of the building) which made it pretty hard to cope with over 28 degrees Celsius outside. However, I do have to admit that the hotel is a clean and pleasant place to stay in Berlin and it does have an excellent location too (close to the Zoologischer Garten U-Bahn and S-Bahn stations). Before our stay we had doubts about staying so close to the Kaiser-Wilhelm-Gedachtnis-Kirche (known for its six bells which toll a few times a day) but it turned out not to be a nuisance at all. The surrounding area is generally as loud as most city centres. The hotel is worth the money though.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Easy access from airport and to rental cars”", "Author": "pisapie", "ReviewID": "UR70749076", "Content": "We chose this hotel because of it's location. We wanted something that was walkable from the X9 express bus as well as close to the Avis rental car location where we were going to pick up a car the next day. We traveled with my husband's father, so we were on a very tight budget with two rooms, but wanted something comfortable. This hotel was in the perfect location and directly located near food, drink, entertainment, shopping, and transportation. We stayed only one night, but found the hotel to be clean and comfortable. For some reason my husband and I got a room with 4 single beds, but we enjoyed the space. The bombed church is a reminder of what has happened in Berlin, but at night it is a lovely and lit beautifully.", "Date": "July 13, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Dayton, Ohio", "Title": "“Clean & comfortable with easy access to transport into all of Berlin”", "Author": "alvenus5", "ReviewID": "UR65901082", "Content": "My room was small but sufficient as a single private, however my friends had a double which was much larger and nice. The staff was extremely friendly and helpful with any of our questions even for the smallest details such as the closest post box and renting umbrellas. They did have wi-fi, however my iPod wasn't picking anything up from either of the two spots the hotel gave me. No worries though. The best part was hearing the bells from the Kaiser Wilhelm Memorial Church across the street. I never heard anything so beautiful in my life. I would gladly stay here again, if anything but for the friendly staff and to hear those bells once again.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Allentown PA", "Title": "“Book me for next year!”", "Author": "AndyRn66", "ReviewID": "UR51326086", "Content": "Location,Location, Location! the view of Kaiser Wilhelm church could only have been better if we stayed in it! Clean, friendly, walking distance to everything! Great choice on my part, kids loved walking to Christmas market in the evenings and the Currywurst stand outside the door was a huge plus. Breakfast expensive at hotel, 10 euro a day per person- only ate there once. I was so sorry to leave, only a 18euro cab ride from the airport, after that the U-bahn and S-bahn across the street or on foot!", "Date": "December 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Good Budget Hotel”", "Author": "elandjohn", "ReviewID": "UR45815832", "Content": "This hotel is very good value for money. It's located close to the zoologischer garten s and u bahn and is also easily reached by bus from the airport. The staff were friendly and our room was large and clean. The communal bathrooms were also always clean. It's a good budget hotel and we would definitely recommend it!", "Date": "October 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Good value, good location”", "Author": "iestokes", "ReviewID": "UR29762230", "Content": "I stayed here for several nights while visiting Berlin. The room was simple but very clean, large and comfortable. The hotel is located very close to public transportation and there are many shops and restaurants within walking distance. The Berlin zoo is also close by, which makes for an interesting day trip. There was a complimentary breakfast of assorted meats and cheeses which was very good. I had no complaints about the staff or service I received while staying here and would definitely stay again.", "Date": "May 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sheffield, england", "Title": "“superb place to stay”", "Author": "regulartravellerfrom", "ReviewID": "UR7271692", "Content": "All the other reviewers have already said how great the location of this place is. And I totally agree. So I would like to comment a little on how well organised the hotel is and how friendly the staff are. On arrival we recieved a room key which works the main outside door, the door to our floor and our room. This means that you can come and go 24 hours without bothering the staff. Many hotels in mainland europe require you to leave the key at reception when you are out, and sometimes they have 12\" key fobs or bulky things attached which you wouldn't want to lug around all day. Not so here, a small security key with a small plastic tag. We spent a full 7 nights at pension korfu II and could have happily stayed for longer. We pre-paid for breakfast throughout our stay, and it was a good continental buffet ( warm hard boiled egg, cheeses, cooked hams, crusty bread rolls, cerials, youghurt, apples, oranges ). They even have a selection of electric toasters around the dining room, and provided nice sliced white toastable bread as well as german dark bread. £4 a day each I would have paid that for just the lovely unlimited coffee. Next to the front door is a shop which sells currywurst, chips and other snacks, coffee ( up to about mid afternoon) and beer, so if you want a quiet evening you can ride down the lift and top up. There is a restaurant opposite if you would prefer. also the huge bookshop nextdoor on the left does good Capuccino. In the main office is a free internet terminal which is easy to use. The staff are all lovely, half of them speak fluent English and the rest can get by ok. Our room was large and warm with an enormous double bed. They provide a TV which has only german channels but I soon got used to that. We had an en suite room with shower basin and toilet and it had it's own hot water boiler which is adequate for one shower, you have to allow it to recover, or be quick if 2 of you need one. A quick word about Berlin it is a modern and clean city, and one of the few places I have visited where I have thought about not going home. Pack your walking shoes, although there are hundreds of stations on the enormous public transport system, you walk miles along the subways and platforms. highly recommended ...", "Date": "April 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Enfield", "Title": "“Great Location”", "Author": "ZoeEnfield", "ReviewID": "UR7217494", "Content": "Great Location, slap bang in the middly of everything, near great transport links for the underground (U) and overground (S) and buses (100, 200). The hotel was basic but clean with large rooms, the breakfast was basic (continental style) but filling and plentiful. There is free unlimited internet access (something I have never seen in a hotel, a fantastic touch) in reception which we used to find a great Jazz club (budchen hof musikcafe I think) and had a fantastic night out there for only 13E. The food in Berlin is varied and fantastic, we ate something different every day. The italian across the road from the hotel was cheap and quick. plus the countless Bratwurst stores for a qucik snack. I would recommend you take a good street map and tube map everywhere as although the transport system is efficient and cheap it is a little confusing! Not really sign posted as well as it could be and no station assistants for guidance. We flew to Schonfield Airport and took a train into berlin straight from the airport, despite this -none of the train station signs/time tables were in english there were no assistants and we had no idea which train to catch for a good 10 minutes..A lot of people looked lost at the same time as us. But we got there in the end. I also noted a lack of tourist offices in the city so we were a little lost for what to do on our last day and just hopped on and off trains. Take a train to Postdam and visit the Sansouci PArk and Palaces of King Fredirick this was a beautiful town and a good half day trip. Also the East Side Gallary is very good for taking pictures of the Berlin wall with good graffiti. Its a lovely, clean, safe city with friendly people, would recoomend the city and the hotel.", "Date": "March 25, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Singapore", "Title": "“Great budget hotel”", "Author": "applerain", "ReviewID": "UR3733469", "Content": "First time to Berlin & Pension Korfu was the cheapest htl we could find on the net.Once we reached we realised the door was locked,my hubby panicked thinking the htl had closed down.We had to wait for 10mins for some tourist frm inside the htl to open the door for us.Once inside the recep gave us the key so that we could go in & out with it. Rooms are normal,we got 2 twin beds with a creaking wardrobe & suprising big & clean toilet with bathtub. The location was superb,only 2mins walk to the main train station & just beside the htl was a big bookstore,although most of the books were in German.", "Date": "August 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Korfu II hotel - great choice in West Berlin”", "Author": "DorotaK", "ReviewID": "UR1213438", "Content": "Too bad we only had 2 nights to stay in Berlin, as we had a great time in that city. Korfu II hotel is located 5 min walk from the ZOO station, next to Europa Center. Rooms are very clean, high cellings give \"extra\" space, and bathrooms are spotless. Also the breakfast was a great treat, as it was pleantiful and very tasty. We paid 99 Euros/night for a tripple-room, incl. breakfast. Considering prices in Berlin, it was a good deal, and we will stay there next time. Also, I would recommend to take a ride on the regular city bus #100 and #200 (bus stop in front of the ZOO station for both, and you can do the loops on them, as they have a slightly different routing), as they go by all of the tourist attractions, and you can get on and off as you like. Make sure that you purchase a Berlin Welkome Card (19 Euros) that is good for family of 4, and gives unlimited city transit traveling, plus discounts to some attractions, plus more. And last but not least, if you are traveling with teenagers who like skateboarding, make sure you come in the evening to the plaza in front of Europa Center, as you may witness how few guys show off their skills in skateboarding, and I must say, Tony Hawk watch out, there is a great talent in Europe.", "Date": "August 6, 2003"}], "HotelInfo": {"Name": "Berolina Hotel an der Gedaechtniskirche", "HotelURL": "/ShowUserReviews-g187323-d929414-Reviews-Berolina_Hotel_an_der_Gedaechtniskirche-Berlin.html", "Price": "$46 - $102*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Rankestrasse 35</span>, <span class=\"locality\"><span property=\"v:postal-code\">10789</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "929414", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c6/cd/c6cd93605683e97171ce498c94803f4e5large.jpg"}}