{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Charming stay with minor issues”", "Author": "novusdiei", "ReviewID": "UR126733513", "Content": "I thought Hotel Wales was a charming little hotel with very friendly front of staff and in a great location close to fabulous restaurants (particularly useful as there isn't room service to speak of - they will get food from restaurant next door). Modern decore and very comfortable bed... Only issues was the heating couldn't be controlled! Woke up at 04:00 boiling hot and had to open windows to cool the room down which had become really stuffy. Wardrobe space was very limited ended up by keeping most items in suitcase and only haning a few items.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Second visit, different experience”", "Author": "CynDS", "ReviewID": "UR126286533", "Content": "Stayed for the second time at Hotel Wales, but not in a suite this time. The regular room I had was tiny, although the bathroom was more than ample. The good: bed was very comfortable, room clean and neat. The bad: no individual heat control, so the room was hot and stuffy. Insufficient closet space. Windows open, but there are no screens, and since my room looked down on the second story roof below, open windows let in all the HVAC and other mechanical noise. There were two nights that my card key didn't work in my door. They took care of this immediately, so it was a minor inconvenience. The staff is very warm and welcoming, and very helpful. Even with the inconveniences of this experience, I'd stay here again, but would either opt for a suite, or a room on a higher floor.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Nice suites but expensive”", "Author": "PeteCanada", "ReviewID": "UR125956046", "Content": "Stayed here in February of 2007-08. Got a suite. Big minus: Bathroom was very chilly and unappealing, with only a standup shower. Other minuses: The free breakfast included in room price was not a full buffet, but a relatively light affair with some breads, juice, and coffee. Pay extra if you want more substantial bf. Internet in room was not free. Pluses: The suite itself was very nice, with ample sitting area and separate bedroom. Having stayed in suites at several NYC hotels (incl the Lucerne, On the Ave, and Excelsior), I can say that the Wales suites are comparatively the best of the bunch. Location is in upper east side, on Madison near Mount Sinai School of Medicine. Some interesting boutiques nearby and convenience stores (incl a Duane Reade). Just a short bus ride to the Met Museum and midtown, so hotel was well situated. Quiet nights, good sleeping. Price however, was quite steep (>$350/night). Would recommend other properties closer to midtown if location and pricing are major constraints.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Pleasant small hotel in good neighborhood”", "Author": "jim261", "ReviewID": "UR124274097", "Content": "I stayed one night by myself, mainly due to the hotel's proximity to Mt Sinai Hospital (10 minute walk). Friendly and helpful staff. Small neighborhood grocery right next door, with plenty of restaurants on Madison Avenue, ranging from upscale (Sarabeth's) to inexpensive. I went to Jackson Hole (chicken sandwich and fries) and Yura's (breakfast) and was happy with both. My room was small, with windows facing a small dark courtyard (i.e., no view). Hotel has an old feel to it. Room furnishings okay, but carpeting was showing its age. Even in winter, I had to run the fan on the window AC unit to get some air circulation in the room. Bathroom was absolutely spotless and in great shape. If you're claustophobic, you probably won't want to stay here more than a couple nights.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Good for business travellers”", "Author": "Danielle D", "ReviewID": "UR124218777", "Content": "We stayed one night at Hotel Wales. We arrived from the UK and had a few troubles with the booking made by a third party. The hotel staff were not very helpful, in that they wouldn't call the UK themselves or let us call them from our room, which was a bit awkward. Also they would not call within NY to book a restaurant table (although they did this for a more regular guest). The room itself was a good size, spotlessly clean and the bathroom was newly decorated, and there was complimentary fresh tea and coffee in the lobby. We slept very well, plenty of options for dinner and breakfast nearby. There was a business/computer suite but only the first 15 minutes session was free. It was $6 per 15 minutes thereafter. WiFi connection was not free of charge. Small things like complimentary WiFi would have made the stay better - bed and breakfasts we stayed at in upstate New York managed this with no problem. Overall the staff were very friendly including the lovely doorman, but I felt that this hotel was too business-like for a holiday stay.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, VA", "Title": "“MY FAVORITE NYC HOTEL”", "Author": "JustJay2000", "ReviewID": "UR123695470", "Content": "By best friend lives in NYC and I live in Richmond, VA. I travel there quite a bit and have found this to be my absolute favorite hotel in NYC. It's in a great location - upper east side - really close to the park - away from all of the major attractions. The room is small but perfect. The bed is super comfortable. The linens and towels are of high quality. The bathroom is AWESOME! The hotel has an amazing roof top. Every time I've been, I invite my NYC friend and a handful of her NYC friends over to the hotel to have wine on the roof. It makes for a perfect evening! I could not recommend this hotel any more! I love love love the Hotel Wales!!", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Nestled in one of NYC'S charming family neighborhoods!”", "Author": "patricia b", "ReviewID": "UR123101907", "Content": "Sits the Hotel Wales. it is a bit out of the way but fun to see how New Yorkers with families live. Most of the private schools are in Carnegie Hill so the neighborhood is loaded with families, kid friendly restaurants and clothing stores. It is a bus ride to mid town but a lovely one down Fifth Avenue. Fifth Avenue is one black from hotel!(Ask concierge where to get a \"metro card\" to make life on public trans easier!) The hotel is old, the rooms not anything special but the staff is lovely and the price is right! it is also nice to come home to a quiet neighborhood after a day of sightseeing bustling NYC!", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Elegant, charming, very pleasant”", "Author": "seekerofnewplaces", "ReviewID": "UR122363497", "Content": "We felt we drifted back in time when we walked into the lobby to this classy, elegant hotel. By no means does \"old\" come to mind. No stuffiness here. Dark wood furniture, warm tones and class all around. Cute quaint kitchen, large living room with a fireplace (for esthetic purposes only), queen sized bed with soft pillows and comforter. Small bathroom but we didn't mind. It was cute and clean. Bath soap smells heavenly. Complimentary coffee and tea all day. Hot cider in the lobby during the holidays. Sarabeth's kitchen, which is a well known brunch institution in NY provides the room service as well as the breakfast for the hotel. The big downside to this is that you MUST make a reservation for breakfast, even on a weekday. We weren't notified of this when we inquired at the front desk and it ended up being a 45 minute wait but couldn't go as we were limited on time. It was a big disappointment for me as I was really looking forward to it and had breakfast vouchers and couldn't use them. There were a few options in the neighborhood so we didn't leave hungry. Would definitely return!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Horrendous Experience”", "Author": "Sam l", "ReviewID": "UR121708606", "Content": "One of our worst experiences ever at any hotel.Checked into penthouse suite.No hangars,,heating system did not work.Had to bring in portable heater for 2 nights.No stopper to take bath.No hot water for bath or shower.Took a full day to turn around hot water.Inability to connect my I Pad.Clock did not work.Generally a comedy of errors.Everything that could go wrong did go wrong.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“Great choice on the Upper East Side”", "Author": "TriptheLifeFantastic", "ReviewID": "UR121695800", "Content": "When you look at a hotel map of NYC, the Upper East Side has a handful of very expensive places and little else. The Wales is a happy exception. Our room was small, but a lot of hotel rooms in major cities are small. It was well sparkling clean, decorated in neutral colors and boasted a good tv, a safe, a handsome bathroom and a very comfortable bed with fine sheets. Sarabeth's is next door for breakfast. You don't even have to walk outside. Finally, the staff is efficient and friendly. Our room was ready at 12:30 pm... a nice extra.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Hidden Treasure”", "Author": "allamo", "ReviewID": "UR120698938", "Content": "I have to say I have traveled to the Hotel Wales Many times with my family. We love is place where you can get away from all the busy stuff and tourist things from downtown and the park seconds away, which my kids enjoy along with the museums being so close. The Service great the utmost professional and warmest makes us feel like home away from home Staff knows our names and always available for any help specially the Front Desk and great advice and listeners when you even just want to talk about life and things. My most recent visit was on my own had a couple of business meetings and also enjoyed the positive experience and service. Great room a bit small but just right for this business man and the days I had to spend in New York, I like how the Queen Rooms have been renovated had not stayed in one since I usually stay with the family and get a King Suite which is a charm and very victorian style. The queen very different seems like a soho Hotel Modern quiet and just right for me. The service was great as usual even though I miss this Great Front Office Manager Edwin, who has moved up in position but his service has been the most exceptional, professional and warmest my family and I have experience in the world. My little girls asked for him when I got home and usually in the Hotel they are always asking is Edwin Downstairs he can help us. I wish the gentleman all the best and Front Desk really misses him I have to say service was good but one can tell Edwin was missing not fast and knowing what you need even before you approach them and just openly helpfull as he was but still great service overall in all departments. My Hotel Wales and Home away from home I believe is a treasure not everyone knows about in the world and I like it is my hidden get away!!!!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "south jersey", "Title": "“Disliked it, a lot. AVOID.”", "Author": "sjreviewer", "ReviewID": "UR120556225", "Content": "Horrible and expensive. It stated 4 + stars but it is bearly a 2 star. The shower had two options, freezing or scalding. The room had no tub. It was small and I could not get my 2 night suitcase in the room without putting it on the bed because the distance from the bed from the door was too narrow. The \"gym\" was a large closet with four pieces of old equipment that did not open until 8 am, the time of my confereance and it closed before I got back from dinner. The elevator was tiny so I took the stairs. I was charged for internet services and I had to connect on the desk and stretch my arms to use my laptop as the chair for the desk was deep and low to the ground. I sat on a pillow to use it. There was no guide to tell me what was on TV and there were few channels. The steam heater clanged all night. The furniture was old and beaten up. The carpet was warn. The alarm clock was glued to the night-table and difficult to use with no instructions. I arrived at 8 pm and there was no bell hop. The printer in the business center was out of serice. They bragged about free coffee and tea 24/7. The cofee was stale. There was no lobby to sit and wait for someone other one small couch. The only redeaming feature is that it is a quick walk to Mt. Sinai Hospital but the other docs at the conferance avoided it because of similar stories. I could on but you get the idea and you can read my other reviews. This hotel sucks and it cost my $1000 for two nights with no food or amenities or bellhop services. They did not even prepare a check out bill and it took forever considering the only thing that I charged to my prepaid room was one day of internet services !", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Beautiful small hotel, great location and service.”", "Author": "WengChoyLee", "ReviewID": "UR120328858", "Content": "Beautiful boutique hotel, converted from an older apartment building. Great location and service. It's near Central Park and the Guggenheim. The bed is large; the room well appointed. I really enjoyed my stay. But just three minor caveats: they charge for internet use, the room can be a little noisy at night -- from the street, and the plumbing -- and the bathroom while spacious and otherwise good, has a small shower. Highly recommended.", "Date": "November 8, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "new jersey", "Title": "“hidden gem”", "Author": "angiono", "ReviewID": "UR119943487", "Content": "was looking for a hotel in NYC during December that wouldn't break the bank.. While in NYC to meet some friends for dinner we popped up to 92nd and Madison to check out the Hotel Wales which had rates of $291 for a room, the Area is lovely quiet near many museums one block from bus route on 5th and surrounded by wonderful restaurants. We called our friend and we both booked the hotel for December a 400sq ft suite was $313/night. mid town hotels ranged from $760 tp $1800 a night. So for now I will rate it at 3 but I'm sure we will up the rating after our stay.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Comfortable stay in perfect location”", "Author": "lfrosales", "ReviewID": "UR119567916", "Content": "My family stayed at the Hotel Wales for five nights while taking in the fabulous sights and activities of NYC. The four (all adults) of us stayed in one of their suites and I was pleasantly surprised by the amount of space we had, considering that this is New York. The bathroom was particularly spacious for the age of the hotel and it was always spotless. The staff were unfailingly polite and helpful. Our room was on the Madison Ave side, so the nights were a bit noisy but earplugs solved that. Hotel is close to subway and on a major bus line, taxis also easy to obtain. We ate breakfast in Sarabeth's, the adjoining restaurant, and everything was tasty. There's a great bakery/deli across the street, Yura on Madison, that you should check out at least once. Lots of other fine choices for meals in the immediate vicinity.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“What was needed!!”", "Author": "Aeparker81", "ReviewID": "UR119496463", "Content": "Perfect location and appropriate price. Discovered a great French restaurant over the road, pascolos (spelling wring!). Reception and concierge very helpful! A/C is very noisy so in hotter months that could be a problem choosing whether or not to run it overnight.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Charming, with a European Vibe”", "Author": "KelliD", "ReviewID": "UR118896683", "Content": "Was pleasantly surprised when arriving at this Upper East Side gem. We needed a suite to crash in after a Central Park concert, and the Hotel Wales is only a couple of blocks from the park. The staff was friendly and the rooms were a wonderful mix of old-school decor with modern updates (new beds and bathroom fixtures.) If you want something slick, go elsewhere, but for a romantic weekend in an excellent location, this one is a winner.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Treasure Beach, Jamaica", "Title": "“MAdsion ave-Upper East”", "Author": "ownerMB", "ReviewID": "UR118654395", "Content": "the Wales Hotel is a bit older,but everthing is in order,spottless clean rooms,very friendly staff,(from Bellman to Frontdesk)for this location reasonable-take the suite with the extra sitting area-Thursdays to Sunday you can enjoy(Summer)the Rooftop Bar for Sunset and romantic moments-wishing to have a place in one of the best locations in the world-and for Dinner you go just arround the corner to PAOLA,S- one of the best iatalien Restaurant in town", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Unexpectedly nice boutique hotel - UES”", "Author": "CynDS", "ReviewID": "UR118425582", "Content": "Had a delightful and comfortable stay here. The hotel is old and charming, and well maintained. My room was spacious (I had a king suite), with a sitting room, bedroom, and large bathroom. Very comfy bed, plenty of closet space, and flat screen tvs in both sitting room and bedroom. All neat and clean, and I loved the woodwork around the doors. My room even had a (nonfunctioning) corner fireplace. So cozy! Sarabeth's restaurant is downstairs, and handles the room service for the hotel (great breakfast and brunch, btw). They offer coffee/tea on their mezzanine level 24/7. Staff was very nice as well. My room had only a shower, and a pedestal sink. Drawbacks: no counter space in the bathroom; my room faced Madison Avenue, and I learned that NYC picks up garbage at 11:30 p.m. and sometimes at 1:00 a.m. Although the view was lovely (can see the reservoir at Central Park), the traffic noise interrupted my sleep. All in all, though, I'd stay there again. Well situated to museum mile, restaurants, transportation, and the neighborhood is lovely.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Location Location Location!”", "Author": "bomboraboy", "ReviewID": "UR118284374", "Content": "The Wales is right in museum land - east 90's, a block from the Met, the Guggenheim, a short walk to the Fricke - right near Woody Allen's apartment. It's old world boutique New York but not fusty - unostentatious but subtly beautiful rooms with nice old world bathrooms. It feels cosy and classy, staying there. The staff were lovely. We were there on our honeymoon and it was perfect. There are lovely restaurants around there, and it's a great spot to walk into Central park.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Loved this boutique hotel on Madison Avenue”", "Author": "Susannah1952", "ReviewID": "UR117723509", "Content": "This is an old unique hotel - very clean. We had a large suite but noticed that the queen & king rooms were quite small as we passed by. Every morning we got up early, got coffee and lattes (from a neat latte machine) in the 2nd floor lounge - where one could relax reading the papers the hotel leaves - and went one block for a walk through Central Park. Good neighborhood, easy to get a taxi in front. The front desk staff is efficent and New York-friendly so no complaints there. There is a connecting door to a cute Cafe serving good food, always busy so we thought it was popular with neighborhood residents.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3"}, "AuthorLocation": "Concord, New Hampshire", "Title": "“Lovely, but a little too small”", "Author": "robinstamm", "ReviewID": "UR117604460", "Content": "The lobby photo of the Hotel Wales on their tripadvisor web page shows about 90% of the actual lobby. The hall to the elevator (and the rooms) are to the right. We were given room 509 (fifth floor) which had a window in the bedroom and a window in the bathroom; both windows looked out on other rooms of the hotel, which form a small architectural rectangle in which a pigeon stayed during the two nights we were there. Having windows was nice, but the view was to close to comfort (no offense to pigeon lovers). The room was nicely decorated in an odd sort of way. The overhead light is huge given the room's size, but I kind of liked it. The choice of blue paint in the bathroom was daring but, to my eye, doesn't work. (I'd have gone for a light sandy color which would blend with the other colors.) But that's all a matter of personal taste. The room itself made it necessary to swap places with hubby to get from here to there. It should go without saying the room was mostly bed, dresser and desk: a tight fit. The bed was a little soft for me, but I need a firm bed and I can't blame the hotel for not knowing how firm a bed I need. It certainly didn't sag. The sheets were wonderful and so was the down comforter. Bedside lights complement the overhead light, but the bulbs are too low for easy reading. (Disclosure: I wear glasses and I'm over 60). Other things to know: â€¢ wifi is an extra charge ($12.95/day in Sept. 2011) â€¢ we loved the restaurant next door (Island): great menu... although service iffy at times â€¢ one of the locals told us the French restaurant across the street (Panucue, or something like that) is just as good and a little less pricey* â€¢ the architectural features of the room are fascinating â€¢ the hotel advertises a roof top bar but when we checked it out, there were great seat and views, but no bar and a sign that said \"no glass allowed beyond this point\" (or something like that) â€¢ there's no refrigerator, microwave, or coffee maker â€¢ there were no knobs on the closet doors but the doors still opened fairly easily â€¢ there were no hangers in the closet â€¢ the closet itself goes from floor to ceiling and looks like it might have been a farmhouse kitchen wall cupboard. I liked it a lot, despite the lack of hangers and it really deserves to be in a bigger room. â€¢ the hair dryer is one of those that's attached to the bathroom wall â€¢ the shower needs a User Manual that's clearly visible to the customer. My husband somehow figured out how to get hot water (it took awhile), but when I tried I couldn't figure it out so hubby did it for me. For other travelers who've never run into set-ups like these, it's a two step thing (I think): you have to turn a knob and, separately, move a dial... both in a way that results in hot water... at least that's how it seemed to me, even though I couldn't figure it out myself so good luck â€¢ the stairs running up and down the hotel are charming. You can look all the way up and all the way down by poking your head over the fabulous wooden stair-railings. The turns of the stairs form a small, but beautiful series of matching rectangles. *I hesitate to specify the restautant names, since I worry it will date this review. But I opted to name them for the sake of those who stay there while they are. There are many pluses to staying here: the location being a biggie. But it offers other gifts that are worth a stay as well. The size s a drawback though. Our bags took up most of the \"extra space\" so it was impossible to do anything in the room without being in or working around the bed.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "San Diego, California", "Title": "“They tried to cheat me. They may cheat you.”", "Author": "John K", "ReviewID": "UR117599036", "Content": "The Hotel Wales tried to cheat me. In addition to the amount agreed upon for the room, and paid, they charged my credit card account for a separate $223. I have tried to contact Hotel Wales about this dispute but they donâ€™t seem to want to talk about it. I twice left messages on the Controllerâ€™s voicemail (8/24 @ 4:26 PM and 8/29 @ 9:59 AM) but have received no response. I also talked with the receptionist at the front desk (8/29 @ 10:05 AM) and was told she would call me back â€œin a few minutes,â€� but over 14,000 minutes have since elapsed and she has yet to call. I wonder why they donâ€™t want to discuss the matter. Do they think that the issue will go away of they donâ€™t comment on their attempted theft? Donâ€™t stay here. These people are thieves and they may try to steal from you too. Then you, like me, will spend your valuable time calling nonresponsive personnel, filing charge disputes with your credit card company and posting hotel reviews.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“Something's changed.....”", "Author": "pdxlorenzo", "ReviewID": "UR117464907", "Content": "As a relatively frequent guest at the Wales and someone who would not stay anywhere else, I (and other friends) have noted a deterioration over the past few years starting with an inconvenient remodeling. They went from continental breakfast from Sarabeth's to a lower quality one to none at all. The staff used to feel free to make adjustments to make your stay easier or more convenient (letting you check in earlier if the room were available or comping you a computer charge if it hadn't worked well. Now they say they must ask the general manager for everything. The staff all look sad and lethargic compared with the enthusiastic helpful people the same people were before. Seems as if it has something to do with \"the new management.\" I asked numerous times to have the GM call me and all I got was a generic survey the next day by e-mail. I'll have to rethink this as it is a beautiful hotel in a great neighborhood.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Fayetteville, New York", "Title": "“Excellent hotel, beautiful quiet neighborhood...”", "Author": "Edienoteddie", "ReviewID": "UR116848429", "Content": "We stayed at the Wales for three nights while on a business trip to the Met. Loved the room, the bathroom was a great size for NYC. Very cheerful staff, and a super bakery / restaurant next door that was full of repeat customers from the neighborhood. If you want to escape the chaos of the tourist hubs, this is a super choice. The only thing missing was a coffeemaker in the room and a fridge (or at least an ice bucket). Quiet and comfy. Coffee and a nice selection of tea was always available on a separate floor. May use this hotel again.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“Nice hotel in great location with great service!”", "Author": "Jemmapes", "ReviewID": "UR116287688", "Content": "What a pleasure to have some service with heart. The staff was helpful and friendly and went out of their way to make the stay pleasantl. When I mentioned the special purpose of the visit to NYC with my elderly mother (celebrating a significant birthday), they not only readily accommodated request for room with a good view, they sent up complimentary wine and desserts! The hotel though showing it's age is very comfortable and perfectly located away from the hustle and bustle of the city with easy access to Central Park. It is perfect if your main purpose in NY is to visit the Met or Guggenheim. Having Sarabeth attached to the hotel is a plus though there is a variety of cafes and bistros in the neighborhood to satisfy most needs. Overall, I would come back again without hesitation,", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Perfect Hotel, Perfect Location for a Perfect Honeymoon”", "Author": "Sean_Tan", "ReviewID": "UR116243216", "Content": "My wife and I were in NYC for our honeymoon and through recommendation decided to stay at Hotel Wales in upper east side Manhattan. The hotel was a stone thrown away from 96st station and we only had to walk about 10mins before reaching the hotel. Front Desk staff was really warm and eager to welcome us. Within a few mins, we were given our keys and checked into our suite. The room was spacious, clean and most importantly comfortable. Bed was plush and the sheets were immaculately white. Bathroom was clean but the light wasn't working. We gave a call to housekeeping and they had it changed in no time. Within 10mins of checking in, the doorbell rang and a staff appeared with a bottle of champagne for us! A pleasant surprise and we were touch by the gesture. We highly recommend Hotel Wales if you are visiting NYC. It's locale is fantastic with a short walk to Central Park, 5th Ave and the rest of lower Manhattan.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Merville-Franceville-Plage, France", "Title": "“Right utility of my money spent”", "Author": "aRanieLle", "ReviewID": "UR116192123", "Content": "I donâ€™t if my review will help you or not but I thought it a better way to express my appreciations for trip advisor. Reviews are very helpful, they have helped every time I have needed suggestions for myself or for my friends and relatives. Coming to my experience with Hotel Wales, I found it very comfortable. The room given to me was of average size but that hardly mattered at all, I was alone for my one day and one night stay. You cannot find a better deal for its price in the entire neighborhood. For me I have the right utility of my money spent. Staffs were very cooperative and always ready to do their best for the guest around.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "California", "Title": "“Centrally located, spacious room and bath”", "Author": "altu_faltu", "ReviewID": "UR115776302", "Content": "Great hotel at the prices. Near Central Park, good location for overall sight seeing. Older spacious building with a large bathroom. Not cramped at all for a family of 4 unlike other NY hotels. Clean. Breakfast served on terrace. Have recommended this place to other friends.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Berkeley, California", "Title": "“We came back to the Wales. but some things need to be put back into the package.”", "Author": "silkiv", "ReviewID": "UR115737902", "Content": "The Wales is still lovely, but some problems need to be remedied or compensated for when all is not perfect. For example, if a room is not ready on time, the air conditioning is not working adequately, or the complimentary breakfast is no longer being served, other perks could be offered instead. It seems like the very lovely staff is ready to do this on their own, when possible, but the management should automatically have the 'tidbits' offered to guests. Kudos to the staff!", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Took great care of me and my disabled wife.”", "Author": "Jagxkr99", "ReviewID": "UR115359309", "Content": "My wife was at Mt. Sinai Hospital about 5 blocks away and I needed a place to stay that was close by. The day I arrived was also a day my wife got a 'pass' to leave the hospital for a few hours. I wheeled her to the hotel and when I arrived (I hadn't yet checked in or seen the hotel) we found that there was no disabled ramp. However, the staff JUMPED to assist me in getting my wife up the stairs in her wheelchair and gave us a great room. When we left they JUMPED again to help me get her down the stairs. The hotel is in a great location with a couple of really nice restaurants next door. The room was average, a bit small but very clean. Complaints: the elevators had no a/c and the temperature had to be 100 degrees; no refrigerator or coffee maker in the room, limited TV stations, no coffee available before 8am. Positives: location, the staff was excellent, the bed was among the most comfortable I had ever slept in.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Gem of a hotel”", "Author": "licious12", "ReviewID": "UR115319982", "Content": "I have been coming to the hotel wales for the past 15 years due to business trips, and it's been a place home away from home, staff is marvelous and the location is great nearby museums and in the center of Carnegie Hill Neighbors. In response to the previous review of bed bugs, I think it's a false statement, a bed bug bite reaction takes 24 hours,and all these years that I've been coming to the hotel I have had no issues...if anyone is in doubt about the previous review it's inaccurate. Hotel Wales is a GEM!!!", "Date": "July 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Soldotna, Alaska", "Title": "“Would stay again.”", "Author": "jparet", "ReviewID": "UR112441784", "Content": "First time in NY to after a Yankee game. Pros Hotel is very clean, the staff is helpful, $300 for the night, great shower, close to central park Cons Small room, air conditioning only goes down to 60, coffee sucks, $300 for the night, a bit of a trip to Yankee Stadium", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Lovely, bright and sumptuous suite overlooking Madison Ave”", "Author": "ShelleyinBoston", "ReviewID": "UR110931272", "Content": "I can't say enought for this little gem of a hotel. Built in early 1900's, it is perfect for anyone exploring the upper East side of New York. What is your alternative? The Mark, The Carlyle...sorry too steep a price for my purse. We stayed in something called a Madison Suite. The rooms (note pleural) were spacious and the bathroom was adequate, nicely done with a boxed-in tiled shower. We were on 7th floor and little disturbed by Madison Ave. traffic. Holiday weekend, so we parked on the street for nothing (side streat). It was $15 cab ride to Times Square for a show. The room could have had a refrigerator provided, had we asked. The only concern was the overly soft bed, but, this is an observation, not a complaint.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florence, Italy", "Title": "“worth the price”", "Author": "Roossoklini", "ReviewID": "UR110445594", "Content": "My room gave a great view of Central Park that made me happy about the room I stayed in. The room was bigger with equally big bathroom attached. Hotel Wales is situated on an excellent location keeping all interests very close to it. I went out a few times to enjoy some of the French delicacies nearby. In all, my stay was worth the price they charged.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wellness At The Wales , The Juicy Naam and Naam Yoga Classes - Love it”", "Author": "lightlover777", "ReviewID": "UR110115346", "Content": "Last week, a small sign planted on a sidewalk called our attention to a new health-centric eatery located inside a boutique hotel. No, there was no hipster scene-y appeal, nor did the eatery have some hot celebrity chef's name attached to it. But we like to think of the Juicy Naamâ€”a popular Long Island-based raw food and juice bar that quietly opened inside the Upper East Side's Hotel Wales last monthâ€”as Madison Avenue's answer to The Donut Plant.The still-new superfoods superstore is tucked away on the mezzanine level of the 100-plus-year-old boutique hotel. Climb the marble staircase and make a right into the converted lounge to access a veritable emporium of juices, teas, smoothies, raw food snacks and prepared foods. Wall-Street-analyst-turned-raw-foodist, owner Giuliana Torre attracts wealthy, health-conscious New Yorkers through custom juice cleanses that suit their specific needs. To top it off, Juicy Naam is offering yoga once a week inside the hotel spaceâ€”show up at 7pm on Mondays for Naam yoga, a unique combination of Kundalini yoga and Kabbalah. But if the $150/day personalized cleanse program is more than you were looking for, simply show up at the hotel, browse the extensive menu (we recommend putting together your own smoothie, like our winning combo of banana, honey, cacao nibs, and almond milk, $12) and soak up the hotel's tranquil, detached vibe. Not to mention fragrantâ€”whatever flowers those were in the lobby sure smelled amazing!", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Andrews, United Kingdom", "Title": "“Comfortable and clean in an excellent locality”", "Author": "Lintlaw", "ReviewID": "UR102805656", "Content": "The Hotel Wales has come in for a bit of stick recently, but our experience was great. We had a Madison Corner Suite which was large, well lit and full of period detail. It had great views towards Central Park and down Madison Avenue - one downside was the noise of the traffic as the windows are not that well insulated. The location is superb, within walking distance of the Met museum, the Guggenheim and several other museums. You hardly have to cross a street to enjoy superb French and Italian food, and Sarabeths provides excellent breakfasts. There was no continental breakfast provided at the Wales, as promised, but we did not miss this as there are plenty of places to eat breakfast within 2 minutes of the hotel. Coffee and tea is provided 24/7, and this was great. The roof terrace provides great views, but it was too chilly at the end of March to stay there long. Staff were on the whole friendly and helpful, the one exception being a male employee at reception who needs to improve his people skills. If you are looking for a small, friendly hotel in a great location then look no further.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pemaquid, Maine", "Title": "“Bald face lies”", "Author": "ginya", "ReviewID": "UR102577766", "Content": "When we checked in, the desk clerk seemed to change his mind about whether breakfast vouchers were included in the room. We didn't get one, but all my colleagues did. We were given a room on the third floor overlooking Madison Avenue. A \"junior suite\", it was dark, sparsely furnished (and no wall hangings at all - we were told the previous occupant had stayed for 3 months and had all decoration removed), and had a shower so small the water poured out the door as you got in. I called the desk and asked to be given a room with a bathtub, only to be told there were no tubs in the hotel. Our safe didn't work, we were blamed and told to read the instructions on the back of the safe door (there weren't any); it turned out it was a broken. When we complained bitterly, we were given a larger suite on the penthouse floor -- with a tub. Although it was on the front of the hotel, there were no windows overlooking Madison and that, combined with the location on the tenth floor, meant it was quiet. We finally obtained breakfast vouchers. I would not trust anything the employees say -- and I would strongly discourage anyone from ever staying here.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Full of strange smells and leaking radiators”", "Author": "Culturist123", "ReviewID": "UR101186633", "Content": "The hotel is very overpriced. The rooms are painted in depressing green despite the fact that there are nice featutes around the doors - they are igniored. When I arrived (3pm) the staff was very unwelcoming. The room was opposite an open window in the corridor - strong cigarette smoke smell came from it. The bed was directly opposite the door which meant the light shined in the eyes. Radiator was very hot and made sttange noises. To be fair, I called the reception and a man appeared and fixed it. But it was still hot. There were water marks on the carpet. I could not sleep properly because of smell and heat. In the morning I asked to be moved. Morning receptionist was much nicer and agreed to sort this out. I heard another guest complaining and asking to be moved. The new room was nicer but I would maximum pay $100 because of location which is great. The hotel advertised 24 hour gym - I could not get in it at 5am. Coffee is promised \"all the time\" - there was none at 7am. Paola's restaurant is overpriced. Disappointing.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Sadly the hotel has gone down significantly since the departure of Robert Holmes”", "Author": "travelpsychologist", "ReviewID": "UR100826114", "Content": "I stayed at the Hotel Wales many times per month over a nine year period. Sadly, after the departure of the general manager this past fall the hotel has gone steadily down hill. After a three month hiatus to see if things would improve, they have gotten even worse. Broken blinds and fixtures in the room, housekeeping that cannot be reached by the front desk staff, elevators that do not work, and a generally shoddy, run-down quality overall. Very, very sad.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“A safe bet on the upper east side”", "Author": "Harkito", "ReviewID": "UR94656193", "Content": "This is the second time that my partner and I have spent the better part of a week at the Wales. The first time we took one of the Junior Suites, because the reviews said the doubles were so small. This time, since I needed to work in the room part of the time, we upgraded ourselves to one of the Carnegie Suites. Especially for a 6-day stay, this was well worth the extra expense, especially since the rate some days was reduced. Even the suites are by no means grand, and not everyone will appreciate the original, dark oak woodwork or the equally old-fashioned furniture, but the place has an unpretentious, domestic feel about it that is easy on the nerves. Coming down to the spacious breakfast room every morning is pleasant, even if the complimentary continental breakfast (fresh croissants, bagels, toastable wholewheat bread, yoghurt, etc.) is nothing special. The comfortable towels and sheets were changed every day, and the bed was, once again, seriously delicious. Certain amenities, like the complimentary terrycloth bathrobes and ditto bottled water, have to be requested for some reason. There is the usual nickle-and-diming, such as the $12.95 daily internet fee, steep rates even for local calls and so forth, but hey, the service is friendly and, if you want to be on the upper east side, the Wales is a comfortable, no-nonsense choice.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eugene OR", "Title": "“Classic, lovely, charming NY vintage hotel; would stay here again”", "Author": "lizberry", "ReviewID": "UR94551319", "Content": "This is a great place! I stayed in a smallish, classic room (real woodwork, high-grade bed linens) -- not an unreasonable size for Manhattan. I also saw one of the lovely suites here. During my visit (during a big cold spell) the heat was turned up too high (but I also visited a friend who was staying at the Waldorf and her room was too cold and she couldn't control the thermostat -- I preferred the extra warmth at the Wales!). Also, my room and bathroom were super-clean. The service was good; a continental breakfast is served on the 2nd floor, and Sarabeth's East (yummy) is right downstairs, and connected to the lobby. There are other eateries nearby. Very close to the Guggenheim and not far from the Metropolitan Museum of Art. I much prefer a classic place like this to a cookie-cutter chain hotel. I would definitely stay here again.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Hotel Wales Is A Toilet”", "Author": "squibjib", "ReviewID": "UR92469287", "Content": "So sad what happened to this hotel. 10 years ago Hotel Wales was a beautiful hotel with plush rooms & a great staff. This past December we made the mistake of booking a few nights here. The staff don't seem to care & are borderline rude. Our room was what I would expect in a Motel 6 in Tennessee. The bed was a joke almost like an air mattress. In fact I believe it was broken. This hotel was remodeled a few years ago & it did not help. The room just felt dirty & old. Breakfast was stale everything & horrible coffee. The muffin I got for breakfast was so hard & old it could have been used a s a weapon.The couch we sat on in the breakfast area was so full of stains we decided to just leave.( See The picture) There is a reason why the managers respond to all the bad reviews on Trip Advisor. They know they have a problem. For this kind of money go somewhere else. Totally insulted. Beware you have been warned.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redlands, CA", "Title": "“WOW! What has happened?”", "Author": "Spygurl007", "ReviewID": "UR90823894", "Content": "I was shocked, saddened, and disappointed to read the poor reviews this hotel received. I actually stayed at this hotel in 2002, but couldn't access that year in the drop down menu. I was in NYC for a church-sponsored event. The hotel was celebrating its' 100th year anniversary and had undergone some renovations. It was a fabulous vintage hotel with a modern feel. I stayed in a spacious room with 3 of my girlfriends. The room was lovely, with sitting area, fireplace, and two large, comfortable beds. The bathroom was more than adequate and had wonderful old-world charm with this cool, vintage black and white tile. I slept well, and I suffer frequently from insomnia and have a bad back. We weren't bothered by any noise. Towels, linens, and toiletries were all top of the line. We even stepped out the window onto part of the roof between buildings to take some photos of our group. I think we had a front view of the street and a back view of the buildings. The hotel was centrally located and within walking distance to the park, museum, and other local attractions. We really enjoyed our weekend there. We didn't have any problems with the service but we were at a conference and not at the hotel too much. I don't remember any breakfast. We ate at a wonderful, popular patisserie next door. I don't know what was paid for the room as it was an all-expenses paid trip for me. It is too bad, it has obviously gone down hill based on many of these reviews. It was a grand hotel and is rich with history. Hopefully the management will care enough to do something to improve the situation.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "AL1432", "Title": "“Ideosyncratic - But Nice”", "Author": "AL1432", "ReviewID": "UR87799621", "Content": "Hotel Wales is difficult to precisely define. It has idiosyncrasies on the one hand that could bother some people, yet on the other hand has some very nice features that could charm others. Being located in an older building with steam radiators for heat, there is a bit of noise from the radiators, but then again nothing terrible. Again, where noise is concerned, you do hear traffic on Madison Ave., if your window faces that way, but that is par for the course in Manhattan. Maybe a bit more sound insulation on the windows could help with this, but then again perhaps management has already done all it could...I really don't know. A pair of earplugs (which my wife and I both used), definitely comes in handy. And, of course, being located on the Upper East Side, some of the most expensive real estate in the world, assures pretty high costs and prices, but that's also par for the course and to be expected. We had a suite, which consisted of a full living room area, and a reasonably large bedroom. The rooms were very clean. I found the woodwork adorning and solid wood doors quite attractive. These added a real sense of charm and warmth to the suite. The bathroom was a bit small, but very functional. One problem we encountered was that the bedroom mattress would squeak when you moved...so much so that it woke us up a couple of times. It was also unduly soft. We resorted to using the pullout sofa in the living room one night, which was okay but very soft and not the most comfortable. I think management should address the issue of new mattresses where needed, certainly where there are squeaks or other noises. That said, we did get full night's sleep for the two nights we were there, so these were more inconveniences than anything else. The penthouse floor has open access to a rooftop penthouse with lounge chairs and some nice city views. This was a very nice touch. Our stay was in November, and it was a bit too chilly to stay outdoors for very long, but I could see where in warmer weather this could be really nice (and I believe there is some form of rooftop dining in warmer weather). If you like quaint, the elevators are adorable...I measured each of the two to be about four foot by four foot square...just large enough for four people, but actually with a lot of old world charm to it. The continental breakfast was adequate, and we enjoyed the mezzanine-level space with constant coffee machine, computer access, etc. We were very pleased with hotel service. Everyone was very responsive and friendly. The location is great. One block off Fifth Avenue with Central Park and all the museums on that strip. One word of advise: during our stay, my sister was at the hotel too, but in a regular room, not a suite. We peeked into her room, and found it to be significantly smaller (I would have to say too small for my tastes), and only about $75 less per night. My advice to anyone planning a stay would be to opt for a suite over a single room...much better value in my opinion. To sum up... Cons: Pricey, a bit noisy (though can't really help that), mattresses should be upgraded. Pros: Quaint and charming in its way, clean, responsive service, nice penthouse (especially in warmer weather), and great location. I would recommend this hotel, but the suite more than a regular room.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois, USA", "Title": "“Lovely little boutique hotel, beautifully restored”", "Author": "ophelia1953", "ReviewID": "UR87407173", "Content": "If the staff were friendlier, this would be the perfect hotel. As it stands, the renovations of recent years were incredibly tasteful, the bedding and other amenities lovely, and the hotel is very clean and totally bed-bug free! Some of the smaller rooms face a dark inner light well, but that's old NYC. Rooms are quiet. Location on upper east side near museums, Madison Ave shopping, and high quality restaurants is terrific. Only real downside is the coffee they offer for breakfast is awful--must be using the cheapest, greenest beans to be found! Oh, and why, in this age of cheap internet and routers, must they still charge 12.95 per 24 hours of internet access? I declined and depended upon my phone.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norfolk, Virginia", "Title": "“No toiletries in room, otherwise excellent”", "Author": "vonschwind", "ReviewID": "UR87149323", "Content": "I stayed at the Hotel Wales for one night following a business appointment in that neighborhood (Upper East Side). I did not select the hotel, and I did not pay for the room, so I cannot comment on its value. The room was VERY small, but plenty comfortable, and normal for NYC, I'm sure. No view worth mentioning-- side of another building, but the view from the rooftop terrace was wonderful. I wish I had had more time to relax up there. The free round-the-clock coffee/espresso/cappuccino service was awesome, and the continental breakfast was plentiful and delicious. All the staff were extremely courteous and warm. At check-in, the family ahead of me in line were inconsiderately asking dozens of mindless questions and requests, and the clerk gave me a sympathetic look and flagged someone else to help me, seeing that he wouldn't be free soon. I appreciated that. My one complaint was that while showering, I discovered that the cleaning staff had apparently forgotten to restock my room with soap and shampoo, which was extremely annoying. I had just used their small gym (very nice equipment!) and was a bit gross. However, since I was wet, naked, and rushed, I didn't really want to call the front desk and have soap delivered-- would have been awkward. I mentioned this at check-out, and the clerk was extremely apologetic. I'm sure these minor mistakes can happen, and since I wasn't paying for the room, no big deal.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Celebrity Encounter!”", "Author": "bernoulli2007", "ReviewID": "UR86782962", "Content": "While staying at the Hotel Wales on a Business trip, I visited the Carnegie Lounge for a complimentary Cappuccino when to my surprise standing next to me was music legend Smokey Robinson. It made my trip! I couldn't wait to get back to Ohio to share the experience with friends and colleagues. I only wish that I was carrying my camera. Great Hotel!", "Date": "November 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CA", "Title": "“Family Neighborhood on Upper East Side”", "Author": "HDTCa", "ReviewID": "UR83549293", "Content": "The hotel is quaint but updated in an area that both feels residential and has many restaurants. The neighborhood feels homey for Manhattan, and is easy to get a cab or walk 10 minutes to the subway. Best: Complementary Continental Breakfast in the breakfast room. Least: Having to pay for wifi, not enough New York Times in the breakfast room. I'll return.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Average is \"Special\" in New York”", "Author": "MyNightAtMauds", "ReviewID": "UR81932835", "Content": "This isn't the hotel's fault; it's just that in NYC, everything costs way more than it should, and the hotel is located in the Upper East Side, which is the most expensive piece of real estate in the world. I wonder what demographic is served by hotels like this one. If money is no object, one wouldn't necessarily want to stay here; but if cost is a consideration, this place might be too expensive. It's a head-scratcher. I stayed here for a night in September, paid $400.00. It's the most expensive rate I've paid for a hotel room, but it wasn't the most outstanding hotel experience I've had, which tells you about the disconnect. There was nothing wrong with the hotel, but nothing outstanding that I remember either. Sure, it's close to Central Park and Mount Sinai Hospital, and it's on the Upper East Side. They have a complimentary breakfast. The elevators were a little slow and I didn't have much of a view. But while I had a pleasant time there, I'm not sure that I can say it was money well spent.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "new jersey", "Title": "“lovely place”", "Author": "andreanne", "ReviewID": "UR79963020", "Content": "We celebrated our 15th Anniversary - the hotel totally lived up to our expectations. We had a beautiful suite,the staff was more than gracious and when they heard it was our anniversary, they delivered a beautiful rose to our room. The room was beautifully decorated, i believe it is a historic hotel. It was recently renovated and we loved it. Loved the complimentary contienntal breakfast - muffins to die for. The Wales plus an evening at Jersey Boys made for a great get away weekend.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California, USA", "Title": "“A find”", "Author": "SusieQTraveler", "ReviewID": "UR79453250", "Content": "This is a find for NYC. Nice rooms, rooftop terrace, an amazing location for site seeing, and at a reasonable price for the city. I was tempted not to share my secret find.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wayne, NJ", "Title": "“Charming elegant accomodations in fabulous location”", "Author": "MomandPup", "ReviewID": "UR78559480", "Content": "We had the pleasure of staying at Hotel Wales this past weekend. Our corner room was very spacious with a very large bathroom. The sitting area was very comfortable with a sofa, 2 chairs & a table. The linens on the bed were luxuriously soft. We had 2 flat panel TV's to enjoy. The hotel staff were kind & eager to help us in any way they could. The patio rooftop is wonderful space to sit & read & enjoy your surroundings. The location of this hotel is very convenient to Museum row.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“***BED BUGS***”", "Author": "G0Travel2009", "ReviewID": "UR78332461", "Content": "Public hair on the floor of the bathroom, bed bugs on the bed, a bad smell in the room and a double charge for the stay. The hotel would not refund the money for the first charge and charged us again. Managers were not able to talk to us even two days after we left. I think this is a good reason NOT to stay in this hotel.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“Not worth the money, no customer orientation”", "Author": "axelroemer", "ReviewID": "UR76711504", "Content": "Rooms have water stains at the ceiling. Location is difficult for jumping on the tour buses (overfilled at central park), you need a lot of caps. Managment was not able to react customer friendly, when getting complaints. In my case, my electric shaver disappeared - no compensation offered. Overall, not worth the money.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cucinista24", "Title": "“Beautiful and comfortable historic hotel on upper east side--hidden gem”", "Author": "cucinista24", "ReviewID": "UR74641550", "Content": "Ideally situated for visiting the museums, Central Park, or east side cultural events, the Hotel Wales is attractive and comfortable-- at a good price for the upper east side. Rooms have air conditioning units that are perfectly adequate! Public rooms are air conditioned! Do not believe some of these reviews. We had a two room suite with a connecting bathroom; the sitting room has a sofa bed. Both rooms were air-conditioned. Beds are comfortable. Non-down bedding was made available at my request. Rooms have gleaming original woodwork and spacious closets. The staff was friendly and eager to help. The breakfast room/\"tea lounge\" is charming and spacious, and is also air conditioned. There is an internet center, and a third lounge area where we were able to read and chat with a visitor. Complimentary breakfast consists of youghurt, fresh (whole) fruit, croissants, muffins, or bagels with jam or cream cheese, espresso, coffee or tea. The staff held our bags and even though we arrived early to stow our bags long before check-in in order to go to the Met museum when it opened, they invited us to have free coffee and bagels. How good is that? There are two very good restaurants in the same building which we tried for lunch and dinner with friends and liked: Sarabeth's and Paola's. If I needed to be on the east side again, I would stay here with pleasure. Rooms might see smallish to someone looking for a Marriott, (ha!) but are far superior to many NYC hotels in same price range ($325 a night for two rooms). Yes, the bath is old and the room carpets seem a little worn, but that is my sole criticism. If you want to feel that you are staying in Europe or Old New York, this place will fill the bill. Highly recommended for travelers on a (moderate) budget.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Atlanta, GA", "Title": "“Great Hotel/Great Location”", "Author": "DMEAtlanta_GA", "ReviewID": "UR72450121", "Content": "We spent a weekend this summer at the Hotel Wales. This was a great \"find.\" Great location, great room (Jr. Suite), great rate, great breakfast and great staff. We loved it. Located in a quiet neighborhood, close to Central Park, museums and subway (3 long blocks). room was spacious and bath room was huge. We would stay here again in a minute.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“A Good Experience”", "Author": "Pesapenny", "ReviewID": "UR72083209", "Content": "I choose the Hotel Wales because of the proximity to Mt Sinai Hospital, where a relative was having surgery and because it was pet friendly, as I had to bring my dog. I stayed a week, and the room completely suited my needs. I've lived in NYC and I didn't mind that the room had an interior view, although the larger suites do have street views. It is a boutique-y hotel, and not a large chain, which I like- but I do wish free wifi was offered beyond 15 minutes. I believe it recently underwent an renovation, and I saw no unfinished details, and the hotel had a comfortably trendy vibe. On Thursday, I noticed they offered a cocktail hour on the rooftop terrace (I didn't attend, but I thought it was a nice touch). Since the building is likely old, the room size was decent for NYC- I was comfortable with a queen bed, and the bathroom had a nice walk- in shower, and there was enough room for my dog as well. The AC unit was in the wall, and I did see a radiator-- I saw some of the older reviews complained about the sound- but those steam radiators make a ton of noise, and not much you can do. I heard no conversations or noise while I was in the room, and it was extremely quiet (aside from the AC unit). The neighborhood is safe, with ok restaurants, but highly overpriced, if you would like a top quality meal, do your research and go outside the neighborhood. I liked the breakfast- fresh orange juice, bagels, fruit, muffins, croissants, yogurt, toast, and all the tea/cappuccinos you can drink. It ran 7-9:30, and I would recommend getting down there before it got too crowded. Some issues: the paper keys which they use bend too easily and are too easily deactivated- of the six nights I was there, I had to get new keys four nights. I called for ice several nights, and waited more than twenty minutes. Not necessarily a huge problem, but reflects some service issues. I also had a bit of an issue with getting my room serviced, I was in it when housekeeping was working, then I went out, came back, and the timing was off I suppose. I really wasn't on a tourist's schedule where I was out all day- I was going back and forth to the hospital, so that probably contributed to the issue. But I found the best way to rectify this issue was to let the front desk know so they can be sure to have it cleaned while I was out. Checkout was easy, and they were kind enough to hold my bags at the front desk while I got my car. I found the staff to be extremely helpful and to exhibit concern for any issues which you may have. I am grateful that the hotel was so nice in an otherwise stressful time while my relative was undergoing surgery. I would recommend this hotel, especially if you want to avoid heavy tourist areas. I was pleasantly surprised with the kindness and professionalism of the staff.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“I Really Enjoyed My Stay at the Wales”", "Author": "dat702", "ReviewID": "UR69700318", "Content": "I really enjoyed my stay at the Wales. It is located in a nice quiet non-tourist area. Central Park is only a couple blocks away (I recommend the track around the reservoir for any joggers). The Guggenheim and Metropolitan Museum of Art are within walking distance. The 86th and 96th Street subway stations are also within walking distance. Good restaurants very close (I recommend the Soup Stop for good casual dinning). My room was clean and comfortable with a nice bathroom. Continental breakfast was adequate. Digital TV with basic cable and Showtime. I did not see ice machines or vending machines. I would definitely stay here again.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“decent value, attentive staff.”", "Author": "OttawaCatLady", "ReviewID": "UR69373998", "Content": "Rooms may be small at the Wales, but they are comfortable. The location, upper East side near Park Ave., is great. Buffet breakfasts are included and feature breads, muffins, pastries, yogurt, fruit, juice, coffee and tea. Staff are pleasant and helpful; requests or problems were handled promptly and pleasantly. Nightly rates aren't bad for NYC. You can walk to Central Park and you're on the Museum Mile.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Aside from hardwood details, what does this place have to offer??”", "Author": "SaysWho", "ReviewID": "UR67193721", "Content": "Yeah, this place had nice, old details, but that's pretty much it. We had a suite on the front of the hotel, facing Madison Ave. We heard every word of conversation of our neighbors in the adjoining room, every door shut in the hallway, and every car or truck that went by down Madison Ave (the window unit AC was not exactly sound proof). Bed was great, the bathroom was ok at best, def did NOT have that nice spa shower head that they show on their website!!!! Breakfast was whatever, nothing to write home about. Can't believe this place cost $430 a night. No free wifi, no mini fridge, no coffee maker, yet 2 flatscreens in a tiny suite.......?", "Date": "June 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A great hotel in a fantastic neighborhood.”", "Author": "billgorm", "ReviewID": "UR62438402", "Content": "They were renovating the hotel when we stayed there but to me it didn't really matter. What a great property. My wife and I visited with our four children for the first time and loved staying at this Upper East Side location. Sure you might be a little farther from everything but you are in more of a neighborhood and right off the park. I think people who stay right in the middle of everything are the ones who don't like New York. Not a problem here. We walked the neighborhood and found great restaurants and some good gelato also. The hotel itself was undergoing work which I understand has been finished. I am sure it will just add to the elegance of this hotel. Great continental breakfast in the morning and be sure to head to the rooftop garden for some coffee. It offers a great spot to read the newspaper. I would definitely return.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ft. Lauderdale, Florida", "Title": "“NICE HOTEL BUT NOTHING SPECIAL”", "Author": "China2002", "ReviewID": "UR61085681", "Content": "We stayed in the Hotel Wales for 1 night in March. The location is very nice if you are interested in the museums or Central Park, all within walking distance. The service in the hotel was non existent. I am not sure if I was there on an off day but had a hard time several times with my suitcase and opening the door as well as getting a taxi in the rain. The room was just okay, it was extremely small but we were there for 1 night so that wasn't terrible. We were given a standard room with a king bed that was very comfortable and clean. The bathrooms were also very clean and roomy. I didn't like the window a/c as it is hard to get the correct temperature. The carpet needed to be replaced but it looked like they were in the middle of renovations. I didn't have a chance to eat the breakfast that was included although the room was very pretty. Overall I thought the hotel was quaint and comfortable just not the most luxurious but definately adequate for my short stay.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan Capistrano, California", "Title": "“Nice place on the upper east side”", "Author": "CaTraveler7777", "ReviewID": "UR59078778", "Content": "This is a pre-war building with thick walls, thick wooden doors and elaborate wood trim in the rooms. In addition, it's been modernized, with new carpeting, modern bathrooms, flat-screen TVs, etc. It's one of the few hotels on the upper east side and it's a good deal to boot. The location can't be beat, since it's close to the park and the museums and there are a dozen restaurants in a two-block radius. It's quiet for sleeping, they serve a nice free breakfast and although the room is small, it's adequate.", "Date": "March 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saratoga Springs, NY", "Title": "“great stay at hotel wales”", "Author": "fivecontinentssofar", "ReviewID": "UR55312506", "Content": "I stayed for one weekend night and loved: the location, my room, quietness, everything was great. I traveled to visit museums and the location was ideal. I also loved being to close to the park and looking over it from the rooftop terrace. The room was certainly spacious enough for 1-2 people and I felt very comfortable at the hotel. It has a casually elegant ambiance. All my requests were quickly and completely fulfilled. The staff were really terrific. I will definitely go back. Sarabeth's and Paola's were top-rate as well.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“OK Especially for Museum-Goers”", "Author": "dwsact", "ReviewID": "UR54281766", "Content": "The price was right which was why we selected the Wales, and we got good value for the money. Breakfast was included, and the room in which it was served was very pleasant. Our daughter and her husband who are art historians steered us there because of its closeness to the Met and other art museums. In retrospect, we would have preferred our usual location nearer Broadway (The Algonquin or Iroquois). They are in walking distance of theaters, thus avoiding the nightmare of getting a cab post-performance. The Wales is not very near major shopping areas either. Our only major complaint about the Wales was their failure to fix our phone which was not functional. They kept saying it would be taken care of, but it wasn't. I suppose they would have moved us to another room had we asked. But we didn't think a move was worth the effort.", "Date": "January 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alaska", "Title": "“The Wales is quiet, clean, friendly, and in a great location.”", "Author": "dcor", "ReviewID": "UR53932561", "Content": "The staff at the Wales was friendly and accommodating. You were always greeted with professionalism and a smile. I felt very comfortable and the beds were very comfortable and the rooms excellent. Thank you, Wales", "Date": "January 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "NJ", "Title": "“Absolutely fabulous Hotel and accomodating Staff!”", "Author": "clukac", "ReviewID": "UR52675946", "Content": "Highly recommend this hotel for its charm and professional and courteous staff. Location is terrific! We will definately be back!", "Date": "January 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Palos Verdes", "Title": "“Beautiful Boutique Hotel on the Upper East Side...it's a \"10\"!”", "Author": "timetoexplore120", "ReviewID": "UR50569286", "Content": "I stayed at the Hotel Wales and had a fantastic time! Hotel Wales is located on the Upper East Side; itâ€™s a safe location for a â€œgirlâ€™s weekendâ€� and right next to all the wonderful museums. The hotel is beautiful now that they have completed their renovations. The hotel is designed in a tasteful palette of taupes and black. We had a corner suite and enjoyed looking out onto Madison Ave. It was breathtaking. Donâ€™t be shy about staying in the smaller rooms, too. Thereâ€™s too many positive features about this hotel to shy away from staying here. Itâ€™s a great deal: youâ€™ll get to stay in a quaint hotel in a fantastic location and breakfast will be included. The desk clerks were friendly and helpful. I loved the boutique atmosphere of the hotel, and the Upper East Side location made it convenient to walk the Met and Neue museums. Itâ€™s also easy to get to Greenwich Village and Soho by catching the subway a few blocks away on Lexington which runs north and south along Manhattan. I can't wait to visit again. Our stay was a \"10\"!", "Date": "December 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "USA", "Title": "“Too warm, too small”", "Author": "hoteltempcontrol", "ReviewID": "UR49223206", "Content": "I just returned from four nights. I agree with the wonderful comments about Sarabeth and the quaintness of the hotel. I would like to emphasize the incredibly small size of some of the rooms (mine). If the desk chair is not completely tucked into the desk there is not room to walk to the bathroom. The bathrooms was wonderful, however, this is the tiniest room I have every stayed in and just barely can squeeze in a queen size bed. The hanging clothes space is only adequate for one person. I had both windows open all the way and the room was still too warm to sleep in November from the eighth floor.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Atlanta", "Title": "“My room was barely large enough for a double bed!”", "Author": "sims8165", "ReviewID": "UR49062377", "Content": "I agree with all of the complementary comments about this hotel - the roof deck is great with views across the park to the reservoir and the common area for breakfast on the mezzanine was lovely with beautiful flowers. But my room - so small that it was barely large enough for a double bed. According to the floor schematic, it was the smallest room on the floor so my only caveat about this hotel is to careful about the size of your room!", "Date": "November 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“comfort, style, cleanliness, character, service -- all superior”", "Author": "pwkFlorida", "ReviewID": "UR49011201", "Content": "I stayed in nyc with my wife for NY marathon and I was pleased with all aspects of the hotel. I highly recommend the Wales and cannot conceive of a better place to stay while in NYC. For all of you wishing to see the marathon, it is an excellent location to see the runners go up 1st Ave. and back down central park.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great location on Upper East Side”", "Author": "GeoffGeri", "ReviewID": "UR42084317", "Content": "The Hotel Wales is a quaint friendly hotel close to Central park and the museums. We had a suite which I would recommend, ask for a view of the Park. The renovations are nearly complete so there was very little inconvenience. The breakfast was simple with fresh orange juice & bagels being the highlight. There is an excellent cafe right next door, Sara Beth's Overall its a great place to stay in NY if you want to get away from the tourist traps downtown", "Date": "September 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "virginia", "Title": "“quaint”", "Author": "weekendtravelers71", "ReviewID": "UR39805047", "Content": "Stayed here in August 2009 while helping our daughter move and found the hotel to be very clean and the staff very friendly and accomodating. We chose Hotel Wales because it is dog friendly. The rooms are small but adequate for those just wanting a place to sleep and unwind after a day in the city. Nice flat screen TV and the room we had was nicely remodeled particularly the bathroom. The only downside to the room was the ac unit in the wall.. it was alittle noisy but did not prevent us from getting a good night sleep. The continental breakfast was a plus!! The rooftop terrace was pleasant (perfect weather) and very relaxing. New elevator installed and opened while we were there. All in all I would say this is a nice hotel out of the hustle bustle of Times Square and still undergoing rennovations ~so I think Hotel Wales will continue to get better.", "Date": "September 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Great Experience”", "Author": "sixtyplus6", "ReviewID": "UR37315566", "Content": "Very enjoyable stay. Rooms were clean and confortable. Fine location. Service was great. Recommended.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new jersey", "Title": "“The best place in New York to stay”", "Author": "afc4011", "ReviewID": "UR37313850", "Content": "I am writing to let everyone know how much I loved my visit to the Hotel Wales.The hotel was very clean and the workers were very , friendly and it was ideally located to the museums we went to as well as the closeness of the places to shop. Tony", "Date": "August 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "ithaca, ny", "Title": "“Terrible - totally misrepresented online”", "Author": "traveler0626", "ReviewID": "UR35811755", "Content": "My experience at the Hotel Wales was TERRIBLE!!! Upon arrival I had to wait for an unusually long time while the one staff member (who was assisting three other families first) was able to help us check in with our bags and car. Then, to my dismay, the room was extremely misrepresented online. Our room, 609, had furniture that was worn, no clock or clock radio, duct tape on the blinds, a broken remote control and a bed that was so soft and unsupportive it was like sleeping on an air mattressâ€¦.and although in the drop down box on your website it says free internet, I learned that can only be accessed on the 2nd and tenth floor. And,the second floor is undergoing a major renovation. Which is something that should be communicated to guests. We have a baby, and a family member with allergies, and the amount of drywall dust that we came into contact with is unhealthy and unacceptable. Besides, the breakfast, which looked lovely online, was sparseâ€¦.and something Iâ€™d expect from a Quality Innâ€¦.with plastic spoons available just let inside a torn open cardboard boxâ€¦ I also had reserved a room using the valet and stay (which included a bottle of wine)â€¦.and had to request 4 times to have my bottle of wine. First time upon check in, three more times that night (we finally went to bed without it) and then finally the next day as I was checking out, they got a bottle of wine for us (but neglected to get the red as we had requestedâ€¦.and we left with a bottle of chardonnay). My experience was terrible â€“and I feel they need to amend their website to more accurately portray your hotel.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Lovely, clean hotel with friendly staff and lovely Yorkville location.”", "Author": "vacationnut3", "ReviewID": "UR32880016", "Content": "The staff were very friendly and helpful, the terrace and free coffee were so relaxing in the morning and evening. Clean rooms and really great area!", "Date": "June 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Not bad but I wouldn't go back”", "Author": "Susan0768", "ReviewID": "UR26882932", "Content": "The hotel has a lot of character but is in the middle of being renovated. The temperature in our room was erratic, often too hot. The room was small and the view from our window was a brick wall. The first night the radiators made a loud clanking sound, but the staff were very helpful and had sorted the problem by the second night. The bathroom needed updating. The hotel in general was quite noisy as you could hear guests in adjoining rooms. The location is ok, near Central Park but the nearest subway is not an express - we walked 8 blocks to get the faster line. The restaurant next door is very nice.", "Date": "March 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Island NY", "Title": "“A Gem in NYC”", "Author": "Vetteteach53_9", "ReviewID": "UR24516907", "Content": "Last week I was fortunate to have chosen the Hotel Wales on the upper East Side of NYC for my 5 day stay. My very fussy girlfriend had stayed there several times and recommended it to me. I was extremely impressed from the minute I walked in. The staff was quite courteous and the place was immaculately clean. I loved the wood touches and the quaint decor. My room was absolutely beautiful. From the crisp linens to the pictures on the walls, every detail was meticulously addressed. The room had such a warm and home like atmosphere I hated to leave it to attend to the appointments I had. It would have been nice just to \"hang out\" there all day. The breakfast was delicious and everything looked fresh and inviting. I couldn't decide what to choose, so I had a little of everything and wasn't disappointed by anything. The hotel is located in a wonderful part of the city. There were restaurants within walking distance that served delicious food. I couldn't get over how comfortable the bed was. I had a better night's sleep than I had at home. I needed some information about museum times and locations and the staff was wonderful with explaining how to get there and looking up the times for me. Everyone went out of their way to tend to my every need, from hailing a cab to storing my luggage for a few hours after checkout. I would highly recommend this hotel if you're looking for a comfy home-away-from-home place to spend a week in the Big Apple. I thought the price was reasonable for such a terrific place.", "Date": "February 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "West Yorkshire UK", "Title": "“This was poor dont stay here”", "Author": "fatcatdotcom", "ReviewID": "UR23745808", "Content": "we stayed here for one night before sailing on the QM2. We were extremely dissapointed with the standard of accommadation on offer, It did not reflect the description by our agent at the time of booking or the photographs on the brochure provided. When we arrived at the hotel at 22.15 hours we were shown to a room which was small and hardly had room for our suitcases let alone us. It was late so we got straight to bed but we soon found that we could not sleep because of the banging and clicking noises from the heating system. I rang reception to ask for a change of room but was told we had the last one. I called again only to be told to turn the heater down which I tried, but this made the noise worse, the heater starting to let out steam and there was then a constant dripping of water. I rang reception again and a porter arrived. He said we could change rooms this meant us getting dressed and moving to another room with our luggage at nearly 00.45. This room was extremely hot as the heating was on full, it was quite unbearable we ended up trying to sleep with the windows open for a while, in all this resulted in a very restless night. Both rooms had recently undergone some remedial work the walls being undecorated and cable channels covered with masking tape a far cry from the descriptions given. A continental breakfast was provided this was self service and consisted of luke warm coffee in paper cups, plastic cups for the orange juice and paper plates provided for toast and muffins, in a room which again was undergoing a makeover with plasterboard walls un-decorated. We have stayed in New York before and although some hotels are basic this is the poorest I have ever stayed in. I have complained to the hotel directly and th agent best@travel in the uk but neither are forthcoming with any apology or refund.", "Date": "January 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Leeds UK", "Title": "“Nice Hotel”", "Author": "ThornhillLeedsUK", "ReviewID": "UR21974034", "Content": "We stayed for a long weekend at the Hotel Wales. We found the hotel to be very clean and tidy despite the building work that was going on. Check in was very swift and our bags appeared in our room within minutes. Breakfast was buffet style with crossaints, bagels, fruit and yoghurts available. There are also hot drinks which are also available 24 hours. This was handy if you wanted a bedtime drink!! There is a rooftop terrace which I guess would be nice in summer but it was November and very wet so we didn't get to enjoy the views. The hotel also has free computers on the top floor with printers..........very handy if you wish to check onto your flight online. The only real problem we had was the rooms were very small. We stopped at the Affinia Manhattan last year and the rooms at the Wales were no where near the size of those. Our hotel room was also inward facing and therefor was very dark and gloomy (although the weather didn't help I guess!!) The location was also a problem. It's about two thirds the way up the east side of Central Park. A cab on an evening cost about $15 dollars and around half an hour to get to Times Sq. This is obviously not the hotels fault (we knew where we going before we booked) but you do lose the around an hour a day travelling to and from downtown. Over 3 days the cost of cabs also adds up. The other thing that would have been handy would have been a couple of bars nearby but we didn't find any whilst we were there. All in all a nice stay though and another great weekend in NYC!!", "Date": "November 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London", "Title": "“Hotel fine- but LOTS of building work so be warned!!!!”", "Author": "goolygoong", "ReviewID": "UR20332012", "Content": "We stayed for 4 nights at the start of Sept. We had to change rooms as the air con was so noisy- even after asking for a quiet room as I am 6 months pregnant. we did get a quieter room (but the air con was still an audible sound in the room) Many of the floors are being renovated, which I was not aware of when we booked intially. I guess this is why both rooms had views overlooking a central courtyard rather than out onto Madison Avenue. Breakfast was v basic, so we went out for it. The roof terrace is being used as the dinning area for breakfast whilst they do the renovations. Rooms were VERY small- but it is NYC! Our room was cleaned very day and cleanliness was not an issue. On balance, I prob would not stay there again, but location was great and the little contact we did have with staff was perfectly fine.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York, New York", "Title": "“Shabby with poor service”", "Author": "Florina74", "ReviewID": "UR20122890", "Content": "I've stayed at the Wales twice in the last two years as well as for a few days last week. The place seems to be in decline - there's a pervasive seediness to the public areas (except for what is still an attractive lobby) and the staff was unresponsive to problems and/or requests. Housekeeping neglected my room (a suite) for one entire day and paid lazy attention to it the other days. I have family living near the Wales and have been pleased to have it as an option - I will not stay there again.", "Date": "September 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens", "Title": "“Beautiful, Comfortable and Value for money!!!”", "Author": "Alexandravelvet", "ReviewID": "UR19583941", "Content": "We are a theatre company from London, who were desperately in need of an affordable, comfortable and practical hotel. We were more than pleasantly surprised upon our arrival at Wales Hotel! Not only were we welcomed by the most polite and friendly staff but we discovered we were about to spend our next 10 days in one of the most beautiful hotels I've seen. The rooms are decorated with delicately carved wooden furniture, beds that you trully sink in and a bath that invites you to melt in while drinking a lovely glass of chabli ;-) We had the privilige of staying there during the summer, so breakfast was up on the terrace with a fantastic view of Upper New York (water tanks and everything) and ofcourse the amazing Central Park!! The breakfast included very tasty bagels, flufy croissents, cream cheese, jams, fruits, serials and ofcourse a lovely cup of coffee!! The Hotel is also internet friendly with wireless throughout at a low charge and also for those without a laptop there are computer fascilities available. For those of you who are willing to spend a bit more dosh (but still affordable!) I can certainly reccomend the Carnegie Hall Suite with a great view, great space and pictures of some of your favourite stars who have also spent the night there!!! While we were there the hotel was redecorating the interior breakfast area which, after having a quick (illegal) peak through the cracks I discovered that, it was also staring to mirror the details throughout that make this hotel so pleasant to stay in. Overall as I point out in the title the hotel is Beautiful, Comfortable and Value for money!!! A very memorable experience I would reccomend to all and ofcourse I'm planning to return very soon!!", "Date": "August 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bucks, UK", "Title": "“Perfect break....”", "Author": "Vache1967", "ReviewID": "UR17153999", "Content": "Stayed here for four days with my sixteen year old daughter who is a huge 'Gossip Girl' fan. First trip to NY. Loved it all. Hotel was lovely. Staff couldn't have been more helpful. Bedrooms were small, but the beds were so comfy and we didn't spend much time in the room with so much to see and do. Complimentary breakfast perfect start to the day. Views from the roof terrace great although we were the only ones up there. Plenty of lovely restaurants and boutiques close by. Would definately go again. We both loved it.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "st. louis", "Title": "“not what the website portrays”", "Author": "linnie57", "ReviewID": "UR16970521", "Content": "We booked a classic queen room. The bed was very comfortable. The room was so tiny, it was difficult to walk to the bathroom when someone sat in the desk chair. It was very noisy due to the window unit AC which was located not even two feet from the bed. Had to sleep with it off at night. Nice quiet neighborhood but not worth the money. very disappointed.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“Boutique hotel, not quite...”", "Author": "RHQ16", "ReviewID": "UR16400131", "Content": "Stayed at hotel for weekend in May for 3 nights on Upper East Side - $200 a night, way uptown on 92nd street & not worth it! Beautiful neighbourhood with Sarabeth's right next door which was favourite of mine for breakfast when I lived in NY a few years ago but has deteriorated since. Small 'boutique' lobby which is typical NY however we were not quite prepared for how tight for space the room was - the door almost hit off the bed which took up most of the room, no room to open our cases. Room was shabby, crisp white bed linen had tear in top sheet! Door lock had been replaced as holes of previous one remained, large gap under the door, no door on the bathroom, tiling unfinished, mouldy shower curtain - the hotel did however move us the following day to similar styled room with smaller bed & there was a huge difference in how room was finished - there remained mould on the shower curtain & a large gap under the main door - and on top of everything, additional $14 per day for in-room internet access! Wouldn't stay here again.", "Date": "May 26, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "N.Ireland", "Title": "“Excellent Hotel”", "Author": "Soupyfamily", "ReviewID": "UR14678723", "Content": "Was taken by my wife for my 50th birthday. Hotel was top class we had a suite on the sixth floor which was very clean and the staff were excellent. The buffett breakfast was just what we needed to start the day and it was also handy to have coffee available all day in a very relaxing room on the second floor. It is a liitle bit away from the main shops theatres etc but it was surprising how quickly we walked it going down 5th avenue beside Central Park and a good taxi run is only 8-10 dollars. I would advise you to avoid the black cars which pull up at night when you are trying to hail a yellow cab as we were quoted appox three times the price of the yellow cab. Other highlights were ground zero which was very moving, a trip on the zephyr at pier 16 which was very informative and lasts an hour and a trip to Times Square. We tried to book the rainbow restaurant on 65th floor of Rockefeller Centre but we needed to book in advance. They give you the option of queing to have a drink only in a section of the restaurant. The view was excellent but the service was poor and the drinks very pricey. Enjoy New York it is very friendly.", "Date": "March 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Nice neighborhood, great museums, very small suite..”", "Author": "Meskuli", "ReviewID": "UR14660072", "Content": "I stayed in this hotel last May for 3 days. We booked a suite since I was traveling with a toddler. We requested a crib with our reservation. Once we were there (after a long trip) I needed to remind them about the crib because they forgot. I was not amazed by the receptionist's attitude. Finally we received the cheapest, folding travel crib in the carrying case and some bed linens for it. I set it up, it was dirty...they couldn't replace it with an other one. As for the suite: Sofa bed in separate (tiny) sitting room along with one armchair, a glass coffee table. I am writing \"tiny\" since we barely had room to place the portacrib somewhere, I needed to move the furniture. A small flat screen TV. The sofa and armchair also was ready for a cleaning... There is a French door between the two rooms but does not really separate the two areas. The window air conditioner was very noisy. BUT the king bed and the down pillows, linens, down comforter were amazing. Immaculate clean, as was the bathroom as well. The location is great. The room service is a bit slow since they bring the food from the restaurant next door, but delicious. The Central Park is two blocks, a very good playground is also close by. We had a great trip after the first disappointments. Great rooftop terrace.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkshire", "Title": "“great hotel”", "Author": "anderj", "ReviewID": "UR11008716", "Content": "The hotel provides everything I would want in a hotel (but donâ€™t always find): Warm welcome Efficient reception Helpful porter Lovely furniture Smart decor Fresh flowers Great quality linen Good toiletries Comfortable bed Cleanliness. The room was quite small but well designed and its not cheap-but this is New York!", "Date": "November 23, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sussex, UK", "Title": "“Avoid”", "Author": "AnemosSussex_UK", "ReviewID": "UR10415514", "Content": "Very very expensive $513 for a very small room with a Queen sized bed, for one night. Poor state of maintenance, cupboard and bathroom door not fitting, knobs missing, noisy next door aircon, Bathroom and room seemingly very old. Only one lift of two working. Complimentary breakfast was a bun and coffee not in a dining room but a lounge", "Date": "October 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Wonderful Hotel...lots of character.”", "Author": "MissR24", "ReviewID": "UR10062101", "Content": "Spent five nights at this hotel during July 2007 during a city break with my mother. I booked a double room (as that was all that was advertised), but decided to email the hotel to request a twin instead. I recieved a very polite response that same day stating that would be no problem. The hotel is in a very upmarket, safe area of the city with beautiful shops and restaurants on the doorstep. The only drawback of the location (for some people) is that you are some distance from midtown Manhattan and the hustle and bustle. However...the subway in a 5/10 minute walk and there are unlimited cabs. The hotel itself is a beautiful old building, nicely restored (the breakfast room is impressive). There is a lovely roof terrace which is very well kept and has views over to central park and the reservoir. Our room was slightly on the small side, but was very clean and the beds were very comfy indeed. The free toiletries were Aveda! Please ignore any negative reviews...some people just like to complain!", "Date": "October 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“A Good Homebase, with Minor Reservations”", "Author": "ElMusaferain", "ReviewID": "UR10005724", "Content": "We stayed at the Wales for two nights at the end of a long summer vacation in the States. I'd last stayed there about five years ago, and found on thist latest stay that, while it's still a fine choice for someone who wants a small-hotel experience, management may not have a firm grasp on all the details that makes hotels such as this special. It's also not quite the bargain it once was. That said, our suite was pleasant, with a distant view of Central Park, a very long entrance hall that guaranteed peace and quiet, and handsome details like original woodwork and a (nonworking) fireplace in the bedroom. The sitting room was small but comfortable and was if nothing else a good place for luggage, keeping the bedroom tidier. I'd last had a suite that combined the sitting and bedrooms (with an arch separating them), which was in some ways even nicer, as it made for a larger single space. The bathroom (shower only) was smallish, but immaculate and with period touches. Good mattress, pillows, and linens. We missed the Hotel's continental breakfast in the second-floor common room, but had a nice time at the adjacent restaurant, SaraBeth's, a Manhattan institution. Our one attempt to use the common room (which includes computers for guests' use - there is no business center) was spoiled by a rambunctious family waiting for airport transport; I was surprised that the staff present didn't do something to stop two small children from pounding on the (out of tune) grand piano. The hotel's location on upper Madison Avenue is out of the way, yet convenient to many museums (inculding the Met) and handy for attractions such as concerts at the 92nd Street Y. It can give one the illlusion of living in, rather than visiting, the city. Our rate included valet parking, which was prompt and seemed to take good care of the car. The downsides are comparatively few: window a/c units that aren't as unobstrusive as a central system, windows that don't fully open, and some aging and fading of furniture and fixtures. The night management was slapdash - loosened tie on the man at the counter, who was busy chatting with friends and listening to (very loud) latin/rock when we returned at one in the morning (not terribly late by NYC standards!). Finally, in terms of value, while the suite set-up is pleasant, at more than $400 per night, the cost was on par with some of the rooms at New York's big-name hotels. For the money, I would have hoped for a more polished overall experience.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "lancashire", "Title": "“Loved it. Value for money. Would definately stay again.”", "Author": "blondiebee", "ReviewID": "UR8711390", "Content": "Booked this hotel which was recommended by a friend. Booked direct with the hotel website. Stayed 7 nights which cost Â£1183. (For NY, I thought this was reasonable). The hotel is on Madison Ave & 91st St. (5 mins walk from Central Park). The staff were helpful; Khan took our luggage up and made us feel welcome. The room was a standard bedroom, but was bigger than i expected, 2 windows, clean, air conditioned, tv and a good size bathroom with bath & shower, wall safe & plenty of drawers, space, etc. (Room 719) The bed was made up with egyptian cotton bedding, white & starched (and was so comfy, it was difficult to leave in a morning!), a range of Aveda products in the bathroom. Every day our bedding was changed, our towels were changed and the room was spotless! The roof terrace was amazing and we spent every night up there with a bottle of wine to finish the day. We usually had the place to ourselves. The lounge on the 2nd floor is gorgeous, air conditioned, free internet and a printer, free tea, coffee 24/7. At 7.30am there are bagels, pastries, croissants, rolls, jam, cheese which are all fresh. We loved the hotel and would definately recommend it to anyone. (Tip: Everytime I plugged my hairdryer in, it blew the trip switch - its an old building, no panic, ring reception and they put it back on again & switch off the air conditioning before you plug anything in ;0) There are only 1 small point that I would mention: It is a good 20 minutes walk to 59th St which is the start of the main attractions, however on the 20 minute walk (or 2 min cab ride for Â£5) you are walking along Central Park and there are stalls, street artists and hotdog stands, etc so its a nice walk in the morning, but a long one after 11 hours walking around the city, so we usually got a cab, which is easy, stand in the road and flag one down, we always got one within a couple of minutes, they are all metered and they give you a receipt and very cheap! (E.g from the hotel to the seaport/greenwich village its Â£9) Other Tips: 1. Definately go to Pier 17/Seaport - lovely shops, restaurants and the best Â£10 each we spent all holiday was a ride on 'The Shark' !! Its a 30 minute speed boat ride around the statue of liberty. 2. If you fancy a helicopter trip, it was only Â£70 each for 20 mins. We just walked to the Wall St Heliport from Pier 17 and only had to wait 10 mins and we were up. 3. If you don't want to queue for 3 hours to go on the Staten Island Ferry, there is a ferry stand just 100 yards away and for Â£7 we had an hours tour of the harbour and statue. This ferry does not stop anywhere though, but you get to see the sky line of the city and the statue. 4. All restaurants expect a 20% tip! Some add it on automatically. 5. If you want to get a taxi from the airport (JFK) Its a fixed price of $45 (approx Â£25). Cheap & quick. 6. If you see a sign for 'Giggles' Restaurant (115th W & 40th) - It was gorgeous food and nice atmosphere. 7. In Greenwich Village, 'Olivers' was good food & good for people watching. (Or you can go to the Red Lion which is cheap & great for people watching). This is the 2nd time I have been to New York, (1st time was 6 weeks before 9/11) but I have to say to anyone who is worried about safety, etc. This time has been a real eye opener and the whole city and its people have changed beyond belief. I would definately agree that this is now one of the safest cities in the world. Everybody is helpful and friendly. We wandered all the streets, day and night and did'nt once feel uncomfortable. (Last time I went, I would'nt go out after 8pm ;0) Happy Holidays. (If you want to see any more pics, they are on our website www.andyeasthope-photography.com)", "Date": "September 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice, got some charm but noisy and \"old\"”", "Author": "borntoexplore", "ReviewID": "UR8609929", "Content": "I booked a room at the Wales based on the availability of a one-bedroom suite; the location was nice being close to Central park when you needed a break from the busy city. However, the noise level we did encounter was way above my expectation due to a very old and outdated a/c system throughout the hotel. Since they simply stuck the a/c unit (w/out really fitting them into) into the windows the noise was the same as sleeping w/ an open window towards busy Madison St - additionally you did get the enormous noise of all your fellow neighbor's a/c 's from the inside square bordering our room on the inside ! We did pay the \"extra\" for a King Size Suite being told we'd have 2 separate rooms - actually we received one room w/ a separate sitting area and a sleeper sofa. Considering the fact that I did travel to NY w/ our 2 children to meet w/ my husband for the weekend who had been working in NY for a couple of months a big disadvantage and certainly not worth the extra money spent for the \"separate\" rooms. While some aspects of the rooms were nice (like the fresh Rose service , altogether it was a very exhausting experience and I was happy to leave after 4 nights of non- sleep ! Our room was overlooking Madison Avenue. - we were kept awake all night by street traffic. The internet access ($14/day) was spotty -- the room phone worked only sometimes and never ever got fixed or even checked upon during our 5 day stay also I did complain several times ! The included Continental bfst was nice and convenient but the service was just okay - considering the price we paid I would not stay again.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alexandria, VA", "Title": "“Great Hotel & Staff!”", "Author": "hotels4me", "ReviewID": "UR8127366", "Content": "Had a wonderful stay at the Wales! The staff was incrediably friendly and helpful. My infant daughter got sick and had to be rushed to the hospital. The front desk told me where the closest hospital was and held a cab for me. It was such a tremedous help in such a stressful situation. More importantly the room was spotless, so I had no issues letting the baby crawl on the floor when we got back from the hospital. I would stay here again and will recommend it to all my friends traveling to NYC!", "Date": "July 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new jersey", "Title": "“Old world charm and the cleanest hotel i have ever stayed in”", "Author": "andreanne", "ReviewID": "UR8127311", "Content": "I came back to the Wales; and it was nicer than ever. The old world charm is still there, and enjoyed the most exciting breakfast on the rooftop overlooking new york city. I love this place, sheets to die for, fresh rose in my room and a very accomodating staff. close to all museums. what a treat. and the courteous staff makes it a delight.", "Date": "July 16, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“A boutique European Hotel on the Upper E. Side!”", "Author": "NyMia", "ReviewID": "UR8115939", "Content": "I went with my sister, not knowing what to expect...I lived in Manhatten a few blocks away, and had always walked by the Hotel Wales. I frequent Europe, and love the independent charm and service... Needless to say the hotel was just what the doctor order!!! Staff went above, and beyond. The room had the most comfortable beds, and the Egyptian Cotton linen. Joanna's restaurant right next door, was exceptional as well. I would recommend this hotel to anyone that wants a break from the daily grind of mid town Manhatten...It is only a subway, cab away! Mia from Long Island", "Date": "July 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Berne", "Title": "“Find somewhere else”", "Author": "fz750", "ReviewID": "UR8110291", "Content": "Booked this hotel as the final part of a trip to NYC, Washington & back to NYC. The worst hotel I have stayed in for a long time - the hotel's own web site *completely* misrepresents this hotel - it's an old, dowdy, run.down hotel deperately in need of modernisation. we had to change room 3 times. The radiators leek, showers don't work, the room (Standard room) is little bigger than the small bed, the bed felt like it was 100 years old, appalling. The furniture was scratched and damaged. The smell from the kitchens below invaded the room everytime they were cooking at the restaurant 6 floors below! The aircon unit was so noisy it was unuseable. The staff (night staff) were unsympathetic to our complaints (well, it's NYC, what do you expect for the price). Actually, the hotel was not cheap, but I will never stay there again. Additionally, reading the reviews here I do wonder why they seem to be split between \"wonderful\" and \"awful - I guess the \"awful\" ones were written by people who have stayed there, the others you can make your own assumptions...", "Date": "July 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great in the cool”", "Author": "skipAussieontour", "ReviewID": "UR7673522", "Content": "We stayed four nights at the Hotel Wales. The staff are freindly and the hotel is fine. We were in 417 and the room was quiet albeit a little warm, that was OK given the outside temp was 50 F at night. I do not know how comfortable the hotel would be in summer as the rooms only have individual room a/c, that looks a bit old. If you do not want to partake of the included coffee and muffins for breakfast there are plenty of options around the hotel. We would go back as the location makes up for any minuses and the staff were all friendly and helpful, just make the effort to call them by their name, after all that is why they have a badge.", "Date": "May 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hidden gem in a good part of the city”", "Author": "stef49", "ReviewID": "UR7478130", "Content": "I was in New York on business and a friend in the hotel business recommended the Hotel Wales to me. I didn't know anything about it before staying there but would definitely stay again. The first thing I noticed was that even before I'd got out of my taxi someone from the hotel came out to meet me and help with my luggage. The guy on reception (can't remember his name) was efficient and friendly and before I knew it I was in a warm (this was the middle of Winter), very clean and well sized room. For a NYC hotel the room size was pleasing, and my bathroom was pretty well sized as well. The hotel is located a stones throw from Central Park and I enjoyed a nice walk (some people like a jog) around the reservoir before my meetings. I'd definitely recommend this hotel to business travellers and holidaymakers alike. It's a great find if you're looking for a well located property with a personal customer service experiece that you just don't get in those large chains.", "Date": "April 28, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Baltimore", "Title": "“Awful, too hot, can't sleep”", "Author": "SleeplessInNYC", "ReviewID": "UR7299342", "Content": "I'm writing this review from the room because I can't sleep. The room is too hot and it is impossible to turn off the radiator (the maintenance man said he did, but did not). Management states that they cannot turn off the boiler because other guests are complaining rooms are too cold. Bathroom is outdated and needs renovating. Room service and room itself are way too expensive. Sleep sofa is uncomfortable. All in all, if you absolutely must stay awake all night, this is the place to be!", "Date": "April 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Customer Service is not on this hotels agenda!”", "Author": "Grimble73", "ReviewID": "UR6899693", "Content": "We booked the Hotel wales based on the hotel style and location. For an expensive hotel the service is shocking and the \"superior queen\" sized rooms are tiny. The breakfasts are very basic: bagels (with nothing but jam or butter to spread on them) muffins and fruit if you get down early enough. However the coffee is good and available free all day. The hotel itself is beautiful which is a shame as the reception staff are the most unhelpful and uninformed that I have ever encountered. On arrival we asked to change rooms as ours was tiny and badly laid out (as other reviews have mentioned) this was honoured reluctantly and it turned out all the rooms are very small. As Carlos explained \"what do you expect in New York where space is at a premium\"!!!! On departure our credit card was declined and we were made to feel inferior because of this. Following a call to our credit card company the hotel had been taking funds on a nightly basis instead of \"pre-authorising\" and had charged us for 6 nights in total when we only stayed for 3. We were not allowed to talk to the manager and receptionist was bordering on obnoxious and would not help until our credit card company advised him that this was fraud. Other customers were having the same problems as this so please beware. I think Customer Service courses for all Reception staff would be in order however I would never return to this hotel.", "Date": "March 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“It was great!”", "Author": "GoalieDMB", "ReviewID": "UR5706062", "Content": "Cute and quaint hotel. Classic style. Staff was very friendly, Bob (the manager) was very helpful with what we needed. I would definitely stay there again.", "Date": "August 24, 2006"}], "HotelInfo": {"Name": "Hotel Wales", "HotelURL": "/ShowUserReviews-g60763-d93625-Reviews-Hotel_Wales-New_York_City_New_York.html", "Price": "$264 - $463*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1295 Madison Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10128</span></span> </span> </span> </address>", "HotelID": "93625", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e7/3b/e73bdc6630fb7f75adcf3b622d68ef367large.jpg"}}