{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“My Favorite Long Term Stay Hotel in New York”", "Author": "tanasurfs", "ReviewID": "UR119965198", "Content": "If my stay in New York, is longer than overnight, my family and I always book at the Helmsley Carlton. It is like a Home Away from Home. The concierge and staff make it a point to get to know you. So when you return to the hotel you feel welcome. The rooms are very spacious with a living room and a separate kitchen. And the bedrooms are a nice size. After a day about town is a great feeling to be able to spread out. The decoration is traditional New York Hotel with french touches, not modern. It is located on Madison Ave. in the 60's block, near loads of great shopping and cafes.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“Great location and comfortable”", "Author": "elmerito", "ReviewID": "UR74935573", "Content": "We decided on this hotel for its great location and affordable price. The room was big and comfortable, yes the decoration is a bit dated but it is fine really. Our had a great tv and a kitchen. We were very pleased with the room, the staff is very nice and the location is superb. I would totally recommend it to a friend.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "paris", "Title": "“Excellent hotel . Very good staff . I strongly recommend”", "Author": "ParisPipo", "ReviewID": "UR62083181", "Content": "Very nice hotel ;Helpful staff day and night , parking facility ,excellent room service . All this in a very good location", "Date": "April 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "California", "Title": "“Never again”", "Author": "karen_gettman", "ReviewID": "UR17244803", "Content": "I was looking forward to this place; so close to Central Park. But the room was very old feeling, very spartan. Air conditioning did not work well. Paid over $400 and they forgot shampoo. The linen wasn't good. There are no bathrobes. Permanent residents are also in this hotel; which is weird - seeing them in their robes etc. Won't go back, that is for sure.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, TX", "Title": "“Upscale, excellent location”", "Author": "degefilter", "ReviewID": "UR7714198", "Content": "The service and hotel is first-class. Excellent all around. Personally, I was not used to having so much attention, the elevator operator is a bit overkill. The location is perfect, close to shopping and restaurants but still a short cab ride to Times Square and Museum Mile. The rooms are bigger than some apartments in New York, plus the one I had came with a kitchen. Highly recommended.", "Date": "May 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire, England", "Title": "“Gem of a Hotel”", "Author": "Yini", "ReviewID": "UR5612639", "Content": "This hotel is great - have stayed in NYC a number of times and this far exceeds anything we have stayed in before in a similar price bracket. The rooms are really spacious with sitting areas and kitchenettes - ours had been newly refurbished and was clean, bright and airy. Would recommend a room to the rear of the Hotel avoiding the noise of Madison Avenue. The hotel is close to subways and only one block away from Central Park, also lots of lovely restaurants within walking distance and being on Madison Avenue - shopping is on your doorstep.", "Date": "August 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "St Albans, England", "Title": "“Great Hotel, Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3373270", "Content": "This is a lovely hotel in a lovely location. We had 2 junior suites that were really spacious, 1 had a balcony overlooking central park which was a bonus, although the door didn't open fully so it was rather a squeeze to get on to it. Rooms were really clean and the bed sheets changed daily. Just a couple of minor complaints, the wallpaper in one of the bathrooms was coming off and the hairdryer in the other had fallen off the wall. Simple problems to fix but had been overlooked resulting in the bathrooms looking a tad shabby. All in all though very good, this was our fifth visit to New York and this was by far the best hotel. Would definately recommend", "Date": "April 18, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oceanview, DE", "Title": "“A Most Wonderful Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2900638", "Content": "We had seven rooms at the Carlton House the weekend before Christmas. Our family consisted of 18 people. This was the finest hotel experience I have ever had in New York City, and I have stayed in many hotels in New York over the years. The staff was super -- everyone was friendly and helpful at all times -- we couldn't ask for more. The rooms were very nice. The hotel had contracted a minibus for us, and everything went like clockwork. Overall, a wonderful experience!", "Date": "December 20, 2004"}], "HotelInfo": {"Name": "The Helmsley Carlton House", "HotelURL": "/ShowUserReviews-g60763-d93633-Reviews-The_Helmsley_Carlton_House-New_York_City_New_York.html", "Price": "$275 - $375*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">680 Madison Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10021</span></span> </span> </span> </address>", "HotelID": "93633", "ImgURL": ""}}