{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Respects the HIE standards ...”", "Author": "tiago_ken", "ReviewID": "UR128428331", "Content": "The hotel entirely respects the Holiday Inn Express standards. Continental breakfast and location is really good. Next Metro Station (\"Wittenbergplatz\") and \"KDW\" are about 10 minutes walk. Staff was ok (could be friendlier). Rooms are simple but clean.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“A Very good hotel in an excellent location.”", "Author": "tomersi", "ReviewID": "UR127907645", "Content": "My partner and I staying at the Holiday Inn Express for 3 days. Excellent hotel location. Large rooms clean and spacious. Hotel staff courteous, efficient and helpful. Two things to improve: There is no safe in the room. lack of places for clothes storage.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“Very happy with my stay here”", "Author": "Salsera713", "ReviewID": "UR127765083", "Content": "I stayed here with some friends for one night - we were just in town for a day to see Berlin on a road trip of Germany. I was very happy with the hotel. Courteous employees, very clean, great breakfast, good Wi-Fi, nice rooms. Location is great as well. Great value for the money. Absolutely nothing to complain about; would stay here again in a heartbeat.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tel aviv", "Title": "“Fair price, Good location”", "Author": "buiumb", "ReviewID": "UR127610999", "Content": "Very good location: walking distance to kudam st', Subway station, Station of Line 100 is in front of the hotel. Very, very clean room Breakfast basic but sufficient Courteous service of reception staff Missing in the rooms: safe box, Fridge or mini bar. the is a Coffee/tea kettle. Also in the late evening when we returned there was no one at reception The entrance to the hotel through the late night's is with the room card. To summarize: Anyone looking for a clean hotel good location at a fair price to 3 days it can fit Those who like to treat of 4 stars and up - less suitable I personally recommend and I'll be back again for a fair price up to 3 nights", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Worcester", "Title": "“Good hotel for short stay in Berlin.”", "Author": "WorcesterLinda", "ReviewID": "UR126725815", "Content": "This was our third visit to the hotel, which provides a good base for a short stay in Berlin. It has the usual Holiday Inn Express rooms, which are well furnished, modern, clean and well maintained. Not much storage or hanging space for clothing, but perfectly adequate for a few days. Good bathroom and shower. The reception staff were all very friendly, welcoming and ready to give helpful advice. The hotel provides an extensive buffet breakfast in the room charges, and we found this a good way to start the day. A choice of cereals, several cold meats, hard boiled eggs, bread and rolls, some salad, croissants, cakes and fresh fruit are complemented by fruit juices, tea, coffees and chocolate. If you get into breakfast by 8 to 8.15 we found no problem with the overcrowding reported by others. Close to the U bahn station at Wittenbergplatz, with the 100 bus passing the door, the hotel is well placed for city transport. We requested and were given a room at the rear of the hotel. We benefited from no overnight traffic noise, but of course the window view was limited. Unfortunately, being on the second floor, we were awoken at 6 am by noises from the hotel car park below and noises from the movement of the hotel’s linen trolleys! If you want a really quiet room specify rear and a high floor. We would recommend this hotel to anyone wanting a reasonably priced base for a few days stay in Berlin.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kochi (Cochin), India", "Title": "“My Visit to Berlin, Germany 2012 Mar.”", "Author": "binuprasad", "ReviewID": "UR126690573", "Content": "very basic hotel, no free wi-fi, same freak fast all the day, not good for long stay, near to the tube station and city.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Århus", "Title": "“Great value”", "Author": "family_hd", "ReviewID": "UR125145339", "Content": "Our family of 2 adults and 2 teenagers stayed for one night in 2 connected rooms, one double and one twin room. Even though our sons are now teenagers, we found the connected rooms to be extra value. Also great service was the late check-out at 2 pm offered at check-in with no extra cost (Priority Club). The breakfast buffet included in room rate was simple but fully sufficient. However service level during breakfast could have been better. Coffee and juice running out and they didn't seem to care a lot even then told. We had dinner in the Vietnamese restaurant just accross the road. For lunch we had Boulabaise in KaDeWe, also very close to the hotel. Both highly recommendable. We parked in the hotel parking in basement which were very convenient and reasonable priced.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Warsaw, Poland", "Title": "“City Hotel”", "Author": "Makka_mca", "ReviewID": "UR124334547", "Content": "Express Inn with the option of sofa bed for 2+2 family but size of the room is really minimum. With sofa bed prepared for sleeping no place for chair next to 40cm wide table. On the other hand free breakfast but watch out the time it can be really crowded in top hours. Take care about parking before as hotel can offer limited number and is small chance to catch something outside. Location is really in the center of west Berlin.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Germany/UK", "Title": "“Excellent value for the price”", "Author": "Ian2109", "ReviewID": "UR123684586", "Content": "We paid 62 EUR / night for a double room including breakfast. The hotel is very central - you can walk to the Ku-Damm in 10 minutes and the nearest U-Bahn station is also just five minutes walk away. The No. 100 Bus stops across the road to take you to the Brandenberg gate, Unter den Linden and the Reichstag. The staff were very friendly and breakfast was good for this price class. Unlike our last experience in an Holiday Inn Express hotel in London there was still ample food left at 9:30 am. There are so many hotels in Berlin it is difficult to choose. This one is good value for money, central and clean. If you just want a room and breakfast this fits the bill well.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very helpful staff”", "Author": "lornaliz16", "ReviewID": "UR123035650", "Content": "Staff were extremely friendly- no problems at all. All spoke excellent English, including the young lads doing the (buffet) breakfast service. Their friendliness was definitely the best thing about the hotel. The bar was open from midday until 1am with reasonably priced beer, the room was extremely quiet, and the shower was excellent. There were a couple of VERY minor gripes- the internet was a bit slow (when paying per 15mins it's not helpful) and the towels were a little small in the room. The sleep quality was marked down slightly by a rather annoying creaking from above the bed every minute or so! But these really were minor- it was otherwise a fantastic hotel in a good location. Good restaurants nearby (Argentinian steakhouse 3 doors up, and a good Italian in the basement of the Europa centre near the Irish pub), and near the big shopping district. Just a note of warning if you have kiddies though- there's a gay 'club' two doors away!", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lincoln, England, United Kingdom", "Title": "“Very good stay and very good location”", "Author": "Joe P", "ReviewID": "UR122686342", "Content": "I stayed here as it was basically the best I could find on a student budget- it was better than I could have expected! Double room was spacious, brand new feeling and with a sofa as well as the bed. Check-in and check-out were very fast, and the staff were extremely helpful. I am especially thankful to the young man on the desk in the evening who I asked if there were any good restaurants nearby. He recommended Ambrosius just 5-10 minute walk down the road for traditional German food and it was excellent, notice it doesn't have many reviews on here but it is worth a look if you stay here! He also spoke perfect English which I appreciate is quite common amongst those in Berlin but still impressive! Only problem for us were that the room was quite hot- we were incredibly tired so we just fell straight to sleep anyway but had to have the window open which made it loud for the road outside. We turned the fan right up too, but it was still very hot so we were kicking the covers off, surprising in January! I am sure this would have been sorted out for us had we asked but we were too tired to bother! Thanks to everyone there for our stay, would happily go back again if I returned to Berlin.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Very satisfied. Would come back.”", "Author": "PortOfCall99", "ReviewID": "UR122667489", "Content": "Very comfortable here for a one week stay. The location is excellent - close to a main shopping, eating, and entertainment area, down the street from the zoo and near the Tiergarten. I had considered Motel One around the corner, but for about 15 euros more, the Holiday Inn Express has bigger and much nicer rooms. The hotel is fairly new. The rooms are quiet, pleasantly, if minimally, decorated. I booked a double bed. It was fine for one, a little cramped for two - a queen size would have been better. The bathroom was big enough and the shower hot plenty of hot water at all times. I thought the single blue ceiling light was nice so you could use the bathroom in the middle of the night without being blinded. The room had plenty of electrical outlets. There was no individual climate control, but the temperature was fine. I don't know how it is in summer. The window could be opened if necessary. My room had a small fold-out sofa, a good workdesk, and enough light for reading on the sofa or in bed. The wifi was excellent. I think it should be free for all price categories, but 5 euros per 24 hours is quite reasonable if they are going to charge. A safe in the room would be handy but there is one at reception. This is a Holiday Inn EXPRESS, so there are no refrigerator or mini-bar in the room (not a deal breaker for me), nor closet nor drawers, but there is a place to hang a few things. The reception staff was really great. They printed my travel documents for me whenever I needed to do that. One thing I would like to see changed: the lobby vending machines have cookies, crackers, candies, etc. Some dried fruits and nuts would be good to offer.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Nothing special, but good location and reasonable price”", "Author": "EvilBorg", "ReviewID": "UR121816502", "Content": "Stayed for 2 nights in this hotel during business trip. Room i clean and comfortable, with tea / coffe facilities. No minibar. No problem with WiFi internet (EUR 5,0 per 24 hours). Breakfast quite frugal. There is a perfect Argentinian steakhouse restaurant near the hotel. Shopping street and railway station are within walking distance.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Modern/Clean and Cheap!”", "Author": "digitalmunkey", "ReviewID": "UR121626651", "Content": "We stayed here for 3 nights in Mid- November 2011. We flew into Tegel airport and the hotel is very easy to get to from there via bus (X9/100). All the reception staff we dealt with where very friendly and spoke perfect English. We stayed on the 5th floor over looking the main road (Kurfuerstenstrasse), although you could hear the traffic noise it wasn't annoying and it didn't affect our sleep. The room itself was modern and clean, with the bathroom being stylish - the blue led night light was a nice touch! There wasn't a wardrobe as such, just a rail and shelves, but this is common in budget hotels. The bed wasn't that comfy for me and I struggled to sleep in it at first, although my girlfriend had no problems with it. There is a kettle and coffee/tea in the room, although ours didn't seem to get topped up fully until it all had gone - basically limiting you to one coffee a day! You may of been able to get it refiled by reception but we never asked. We were pleased with the breakfast, they had a reasonably good selection of cereals/bread/meat/cheese/hard boiled eggs and pastries plus tea/coffee/fruit juices. The restaurant did get busy at times but there wasn't any trouble getting a seat. It is easy to get to the main attractions from this hotel, the 100 bus goes from outside the hotel to Alexanderplatz, the 200 bus does a similar route from the street above the hotel (Budapester Strasse) and Wittenbergplatz U-Bahn is 8-10 mins away. I would definitely recommend this hotel, it may not be anything special but it was perfect for a city break in Berlin.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Silence in the city centre”", "Author": "MMO_Istanbul", "ReviewID": "UR121121586", "Content": "Visited late November 2011, stayed for 3 nights in a very quite double room and enjoyed my stay. The staff were very friendly and helpful, picked my prearrived packages and safeguarded them until my arrival. The complimentary breakfast had less variety than is usual in German hotels however everything was fresh and tasty. The hotel is very close to the colourful Charlottenburg area (10 minutes walk) and the major sightseeing bus line 100 directly passes on the Kurfursten street across the hotel. Bus 100 operates between Zoo and Alexandraplatz almost every 10-15 minutes and crosses through all Berlin sightseeings including Musuem Island and stops at Schill street station, 100 metres from the hotel.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“The building carries the hotel”", "Author": "Maitland55", "ReviewID": "UR120661655", "Content": "The hotel opened only three years ago and represents the modern construction style applied to many HI Express properties of late. North American visitors may notice that the free breakfast does not offer all the times usually seen in Canada and the US., but bread and cuts are plentiful, and boiled eggs. No omelettes though. Located in the core of old West Berlin - I asked the front desk about another Holiday Inn in Berlin (Landsberger Allee). The receptionist first denied its existance, but then said that as they are franchised she would not know about other HI properties in Berlin. It seems to corporate brand of IHG is not very pervasive towards the staff.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oakham, United Kingdom", "Title": "“great location, easy access to public transport”", "Author": "boggiedoggie", "ReviewID": "UR120508156", "Content": "We visited Berlin in October 2011, stayed in a double room, very clean. Complimentary breakfast had lots of choice which gave a great start to the day. All staff were very friendly, helpful and polite. Hotel is situated close to many attractions and others can be easily accessed on public transport which is very close by. Plenty of amenities nearby the hotel for shopping or dinner. I would certainly return to this hotel on further trips.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Notts. U.K", "Title": "“Good base for seeing all the city”", "Author": "travellbugs779", "ReviewID": "UR119969756", "Content": "Stayed there Oct 2011.Extremely clean and well presented. Room very adequate for a travelling base.Excellent for visiting the zoo (at the end of the strasse) and 10 mins from the Europa centre and main shopping centre.Main bus route runs outside hotel and could not have been easier to travel to other areas of the city, 10 mins from Brandenburgh Gate and Riechstag. Breakfast continental buffet and amples of food continually refreshed, typically continental fayre but fresh. All receptionists spoke English and were welcoming. Excellent restaurants within five minutes and most cuisines catered for. Would definitely use again.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“All round good stay, let down by some little things”", "Author": "ChrisRoughead", "ReviewID": "UR119903730", "Content": "I stayed in a twin room with a friend for a week, and overall we were both pleased with our time there. The hotel is well located, just a few minutes from the Zoo and so there were many ways to travel around the city within walking distance. Reception staff were friendly and helpful, speaking perfect English - just what was needed, as neither of us spoke German. The continental breakfast was as described, although I felt there was never enough coffee available. The main downsides were, I felt, the lack of free WiFi and also the fact that the wall behind the bed in my room clicked late at night, preventing a good night's sleep. After asking to be changed (which all happened very smoothly) this continued in the next room. However, these were minor points in comparison to the good experience I had with the other services used.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Woking, United Kingdom", "Title": "“Bad Start at Front Desk”", "Author": "andy r", "ReviewID": "UR119853234", "Content": "Although smiling girl refused to acknowledge we were in Priority Club for early check in so had to wait 4 hours before we could do so Overall you get what you pay for- service is ok though will not get a drink in thebar if front desk is busy as receptionists were doubling up as bar staff. Breakfast good for price, space issues if you do not get up early enough though the hotel does make you aware of this. Good location except going west along the street at night you will see lots of ladies of the night so careful if you have kids with you Again if you have extra bed for child then room becomes tight for space and as beds are not particularly comfortable and temperature controls do not work, makes for uncomfortable nights. Also no wardrobe, no fridge.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Giv'atayim, Israel", "Title": "“Good value for your money”", "Author": "aunger", "ReviewID": "UR119711224", "Content": "I stayed in this hotel with my wife and son for 5 nights. Overall, we enjoyed our stay. The hotel is clean, breakfast is good and the staff is efficient. Location is good as there are restaurants, department stores and public transportation in a walking distance. The downside was the low quality wi-fi reception in our room.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chemnitz, Germany", "Title": "“UK hotel standards”", "Author": "ebm_post", "ReviewID": "UR119304671", "Content": "The HI Express is a new and well maintain hotel. But, you will be surprised by old fashion hotel beds with UK hotel standard and NO sleeping comfort. The so called bed is a divan made with spring coils and ontop a thick mattress also with spring coils. You can feel every single spring and you have to lie in the centre of the mattress otherwise the whole composition tilts to the side. And when turning around it swings like a trampoline. The mattress is manufactured in the UK and it complies with BS7177 UK fire regulations which is mandantory in UK for hotels, dormitories, boarding schools, care homes and prisons.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swansea", "Title": "“A good hotel in a great location”", "Author": "Ynysforgan_Jack", "ReviewID": "UR119262821", "Content": "We stayed here for 7 nights and thought the hotel was excellent. Check in was very easy with the receptionist speaking perfect English and our room was very comfy with a flat screen TV, tea and coffee making facilities and sofa. The staff at the hotel were always helpful and offered good advice on getting around the city, and they even opened a bottle of wine that we had bought for us at the supermarket. (Since we didn't have a corkscrew). We booked the hotel as a base to explore Berlin and it was in a great location for this. The number 100 bus stops near the hotel and Zoo Train Station is only a 15 minute walk away. Even though the selection at breakfast was excellent and the food ok, it was sometimes quite difficult to get a decent table. This was a very minor inconvenience, but it is advisable to get to breakfast early. All in all this was an excellent hotel and I would definitely use again and recommend to other travellers.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Great hotel, great location! Bed a bit unconfortable...”", "Author": "gobitz", "ReviewID": "UR119110049", "Content": "It's a \"new style\" holiday inn express, with nice furniture, room with a flatscreen, Free internet for platinum members (otherwise it's only five euros anyway). Breakfast is not bad, it's free so you cant really complain. The choices are not as good as the express hotel in Stuttgart, but it's still a great way to start your day. The area is great. All the shops are close. The Tauentzienstrasse is really amazing, there afe busses and metro stops close.", "Date": "October 9, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "perth", "Title": "“great location, good hotel”", "Author": "26andcounting", "ReviewID": "UR118325113", "Content": "very clean and very well appointed. the staff were very friendly and helpful. our room was spacious and the shower was powerful. i have no complaints about the hotel . breakfast was a well stocked buffet, although the room could get a bit crowded at times and you might have to wait for a seat. so get there early. the location is great for buses, u-bahn and walking to the KaDeWe. it is mainly hotels, resteraunts and appatments. no noisy night life close to the hotel. but close enough to get to those things.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Netanya, Israel", "Title": "“Nice hotel in a very good location”", "Author": "romanliv", "ReviewID": "UR118207482", "Content": "The hotel's location is very convenient for those who come to Berlin for a city trip. You can easily get to/from the Schönefeld Airport by the Airport Express train or by the S-bahn/U-bahn. The Zoologischer Garten train and S-bahn/U-bahn station is located at 15 minutes walking distance from the hotel. There is another U-bahn station (Wittenbergplatz) close to the hotel. The 100 bus route stops at a minute walk from the hotel, you can use it to get to all the must-see attractions in Berlin. The breakfast in the hotel was good enough. The twin room was clean and had enough space for two people and baggage. There were a flat TV and an air-conditioning unit in the room. The room also had an electric kettle and two cups for making tea/coffee (coffee, tea-packs and sugar renewed every day, if it was necessary). The wi-fi connection was fast enough to make VoIP calls from a cell phone, but we had to pay 5 euros/day for it. In my opinion, internet connection today is such a basic need in hotels like electricity, shower, TV, etc., and maybe the hotel administration should consider including it in the room's rate. There wasn't a mini-bar or a fridge in the room, for those who need it.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bangkok", "Title": "“Loved it!”", "Author": "Iwishiwascanadian", "ReviewID": "UR117985714", "Content": "Stayed here for three nights and haven't got a bad word to say. Well, except that I very specifically asked for a COT for our 20month old and was told it was available, only to find that all there was for him was a sofa bed... he was okay sleeping on it, but if you travel with a younger child make sure that you really can get a cot. Other than that everything was perfect! I have never slept so well in a hotel. Our room was very quiet, the beds very comfortable and the room temperature just right. The staff were very friendly and helpful. The breakfast buffet was wonderful. The location was excellent and we were able to walk everywhere (despite me being pregnant), and also had the option to jump on the bus right outside the hotel (route 100). Should we ever return to Berlin we will most definitely stay here again!!!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Norway", "Title": "“Good hotel, but not great”", "Author": "TiggiNorway", "ReviewID": "UR117833957", "Content": "The hotel is good, but not very good. The location is very good. Bus 100 just outside the hotel, U-bahn Wittenbergplatz only 5-6 min away, KaDeWe and Kudamm very close. The hotel has good clean rooms, good size. Rooms have AC. Can't hear any noise from outside. Bathroom is good as well. Staff OK. Why do I just give average rating? Because the hotel is missing three things: minibar, safe in room and free wifi. For many people is these things important. In 2011 we want free wifi.", "Date": "September 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Excellent location and great breakfast spread!”", "Author": "Ameetha", "ReviewID": "UR117382183", "Content": "Stayed here for 2 nights with 2 kids. The room was neat and functional. Close to most of the touristy spots especially the zoological gardens( walking dist) and there's a bike rental just next door for those who want to do a bike tour of the city. There's a steakhouse, vietnames ( nice food) , italian and Chinese resturants in walking dist as the hotel doesn't have any restuarants dinner options are available. Most take orders until 23.00 HR.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“ideal location for sightseeing & excellent accomadation”", "Author": "pollyandbill", "ReviewID": "UR117354778", "Content": "four of us recently stayed at this hotel on a four day stay.on arrival we were met with very friendly reception staff.we were checked in very promptly and allocated our rooms.Both rooms were very clean(as if brand new)large bed & sofa and an excellent bathroom.Beds were made up every day and clean towels everyday.Breakfast(although continental )was very good--plenty of variety,also guests were encouraged to take food & coffee out with them for the day(handy take-away coffe cups supplied with tops)At all times staff were friendly & very helpful.if you required directions to visit a tourist attraction the reception staff would print you out directions and which bus/underground/train that you needed to catch.The location of the hotel was ideal for the tourist attractions(checkpoint charlie/berlin wall/brandenburg gate)we bought berlin 3 day passes for approx£24 each and they were well worth it(get a pass for zones a/b/c this covers to and from schonfeld airport). we would certainly return to this hotel in the future and would highly recommend it to others. staff efficiently dealt with a fire alarm @ 8.45 in the morning!!(4 fire engines attended!!) (someone had sprayed hairspray too near the smoke alarm!!)", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Rishon LeZiyyon, Israel", "Title": "“OK location, fine budget hotel”", "Author": "ilan0s", "ReviewID": "UR117210594", "Content": "The Holiday Inn Express West is located near the Berlin zoo and the famous shopping street (Ku'damm), but the nearest subway station is a 10 minute walk away in not the most impressive neighbourhood. Otherwise this is a fine budget hotel with large, well furnished room. Ceiling was bit dirty, and the breakfast was offered in a crowded messy hall, but it's acceptable for the price.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Netanya, Israel", "Title": "“Nice and comfortable hotel in a very good location”", "Author": "romanliv", "ReviewID": "UR117193296", "Content": "This is a nice and comfortable hotel in a very good location. The twin room was clean and had enough space for two people and baggage. There wasn't a fridge/mini-bar in the room (for those who need it), but there was an electric kettle to make tea and coffee (tea-packs, coffee and sugar also included). The internet connection was fast enough to make VoIP calls from a smartphone, but note that it costs 5 euro/day. In my opinion, Internet connection in hotels today is such a basic need like electricity, TV, shower, etc., so maybe the hotel administration should consider including it in the room price. The hotel is situated close to the Zoologischer garten train station of S-bahn, U-bahn and regional trains (15 minutes by foot). You can easily get to the hotel by the Airport express train from Schönefeld airport or by S-bahn or U-bahn (need to change trains). Ku'dam street and KaDeWe shopping center are located at 10 minutes walking distance. The 100 bus route stop just a minute walk from the hotel, so you can easily get to the main tourist attractions in Berlin. I will definitely recommend this hotel to people who want to visit Berlin and get a reasonable price, good service, comfortable rooms and convenient location.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Very good hotel”", "Author": "ELENI A", "ReviewID": "UR116791357", "Content": "A very good hotel in the best price.The rooms were small but very clean and modern.Good breakfast with a variety of food.The hotel is very close to the zoo and to main roads of Berlin.Nearby there are restaurants,cafeterias and super markets.Very good public transportation which you can use to go to the centre in a few minutes.I will certainly choose it again.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Palmela, Portugal", "Title": "“Good Location, nice staff, good breakfast”", "Author": "patte_noire", "ReviewID": "UR116661332", "Content": "We stayed at this hotel because we were going to a meeting. We thought this would be close to the place and cheap. Indeed it was. It's a 10m walk from KaDeWe, 10m also from the great Tiergarten. You also have an Hop On Hop Off bus near KaDeWe and great places to eat in the same street (india, argentina, italia, vietnam... from from all over the world). The rooms are large enough, confy and the staff is 5 stars. We also enjoyed the breakfast buffet (included). I recommend and would stay there again.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lancaster, United Kingdom", "Title": "“What a great find!”", "Author": "julie h", "ReviewID": "UR116446669", "Content": "Great location, near to Wittenberplatz U bahn and Zoologicher Garten U, S and HB train station. Exceptionally helpful and friendly staff, room clean and spacious, good-sized bathroom. Quiet except for odd occasion when noisy guests arrived at or left the car park beneath our window. Plenty to choose from breakfast bar - various hot and cold drinks, several cereals, cheese, meats and bread rolls, 3 different yoghurts and tinned fruit, fresh fruit, toast with several jams, hot croissants and one morning pain au chocolats too! Always managed to find seats. Beds comfy, asked at desk for another pillow which arrived a few minutes later. All in all, can thoroughly recommend this hotel .", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Coventry", "Title": "“Very good value”", "Author": "trevCoventry", "ReviewID": "UR116177429", "Content": "Although part of a world wide chain this was an excellent hotel with good accommodation and very good food", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aldershot", "Title": "“loved it”", "Author": "docboy", "ReviewID": "UR115462821", "Content": "No frills, value for money, clean, decent hotel. Pleasant staff. Real value for money but good standards all the same.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Singapore", "Title": "“Clean, Efficient Housekeeping, Good breakfast and close to transportation..:)”", "Author": "KMSM44", "ReviewID": "UR115107016", "Content": "My husband was on a business trip and I joined him. The hotel is close to the metro and some shops as it is housed in a small town. Supermarket, small cafes around and I enjoyed just walking thru the area. No complaints about the location, the service of the staff or the cleanliness of the hotel. No free wifi though in your room, had to pay. Would have liked some English channels on top of CNN and BBC as I had time to kill in the room while waiting for hubby but I was on top of world events.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Nice & clean, quite basic hotel”", "Author": "Saima11", "ReviewID": "UR115094587", "Content": "Hotel's interiors looked really new and also the rooms were in excellent condition. There wasn't any minibar in the room so among other things that gave an \"express\" feeling that you just sleep in a tidy room and then continue your journey. Breakfast was also quite basic, no warm dishes only bread, cheese, ham and yoghurt. They advertised also glutein and lactose free breakfast products when I asked about them they were rice cakes and soy milk, so all lactose intolerants, take your tablets with you. There was niceterrace though where you could eat the breakfast outside. In the hotel there wasn't free WiFi but you could buy 10 minutes internet usage with 2€ form the reception. Location isn't the best possible but the walk from U or S-bahn stations takes only about 10-15 minutes. Though next time I would choose 2 star hotel at the same price nearer Mitte. It was great that you could easily go jogging to Tiergarten in the mornings and visit the Zoo.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“I liked it”", "Author": "petania", "ReviewID": "UR113623884", "Content": "nice hotel with good location (close to KaDeWe and Zoo). Near to bus station. Good staff, clean room. But place for breakfast is not enough for many guests. Unfortunately without free internet", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Burton upon Trent, United Kingdom", "Title": "“Fantastic hotel and great value for money”", "Author": "janatnotts", "ReviewID": "UR112606896", "Content": "This is a fantastic hotel. The rooms are quite spacious and modern. Nice clean and modern bathrooms. Reception staff very helpful. Breakfast room very modern and seating also possible outside on terrace. Standard of breakfast very good. Set in a good location just around the corner from U-bahn and a few restaurants on the same street with more just round the corner. I cannot recommend this hotel highly enough.", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very conveniently located”", "Author": "b0h0l", "ReviewID": "UR112109874", "Content": "Bus #1 that passes in front of the hotel allows you to go to all the sights in berlin at a fraction of the cost of a hop-on-hop-off tourbus. A metro station is also a short distance away. The Zoo is close by and the zoologister train station which connects you directly to main berlin train station is about 10-15 min walking distance. The hotel is very close to kadewe and the kurfurtesdam shopping area. Its just unfortunate that I was there on easter sunday and the next day, monday, is also a holiday so all shops are closed. The room is big and very comfortable and clean. It is tastefully furnished. Bathroom size is more than your average european hotel bathroom and very clean. Wifi in the room is free. The breakfast is standard HIExpress fare- cold cuts breads, fruits cheeses but sufficient.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Juan", "Title": "“Nice but the usual Holiday INN”", "Author": "SanJuanNana", "ReviewID": "UR110640194", "Content": "1. Airconditioning was not working for the first two nites. they gave us a tiny fan. when you open the windows it gets a bit noisy. 2. Room was clean but small 3. Pretty good location close to Kadewe and a lot of Chinese retos. 4. I liked the comfort of Holiday Inn, breakfast was pretty good, but all cold. They had a good coffee machine and a very good selection of breads, spreads. 5. Most importantly they had clean bathrooms and the staff were very accomodating. 6. Coming in from a verly long flight they could not arrange for early check in.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dovje, Slovenia", "Title": "“Exceeded my expectations”", "Author": "matevzh", "ReviewID": "UR108882239", "Content": "I had two nights reserved in the Holliday Inn. For the price I payed (69 EUR per night) it completely exceeded my expectations. Room was spacious and clean. I had really good stay in the room, and the people behind the check-in desk were informative and helpful. Ok, the view wasn't anything to write home about (just a parking lot), but the room itself was quiet. Breakfast was also OK, with good selection, provided that you arrive there early (or late) enough to avoid the cues. Seating arrangement is great (bistro like) for a quick bite in the morning, there are also some papers available and large LCDs with news. Although hotel could provide a free wifi connection (preferably), internet for 24h was 5 EUR, what i find quite inexpensive comparing to other hotels. All in all. Great stay. Would come back even for leisure. Location itself is fairly OK (walking distance to bus station and train station, ZOO, nearby is also one of main shopping streeets and U-Bahn). For business traveller this is an excellent choice, for leisure is still OK, although i prefer a location with some more charm.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "High Wycombe", "Title": "“Better Than The Crowne Plaza!!”", "Author": "craigvassie", "ReviewID": "UR105387494", "Content": "This is by far the best of the various IHG offerings in the area close to \"Zoo\". The Intercontinental is stuffy and overpriced, whilst the Crowne Plaza (with its rather strange \"Basil Fawlty\" ish manager) is extremely dated and upstairs smells of stale cigarettes. This hotel has friendly and welcoming professional staff and good quality clean rooms. All rates include a good \"German\" breakfast of cold meats, cheeses, fruit and a selection of pastries. Its on the 100 bus route so there's easy access from Zoo station (train from Schoenefeld or X9 / 109 bus from Tegel). Good selection of restaurants within walking distance, and a small supermarket 100m away for wine, beers and soft drinks. Internet access at €2 per hour; a workstation for guest use is in the lobby. Only downside is the standard size double beds!!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Fantastic value and efficient and spotless with good location”", "Author": "antyes", "ReviewID": "UR104826653", "Content": "This is a bargain compared to the competition . We had a room at the back on 5th floor staff were excellent quick and efficient. The room was spotless as was the shower room. Rate of 59 euros for all 3 of us including a good breakfast was a bargain, other hotels would charge this just for breakfast. Only downside was usual hotel issues as air conditioning was poor but the heatwave in early April was unusual. Hence window had to be left open which let in bass noise from adjacent club but only for 1 night other 2 nights quiet.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“new rooms, great staff, convenient location”", "Author": "snapshotinmymind", "ReviewID": "UR102676863", "Content": "The staff was wonderful - always with a smile and very helpful. The rooms are new and clean. The free breakfast buffet is plentiful and more of a typical European style (meats, cheeses, cereal and bread) vs the usual HIX fare in the States. It's located close to the Zoo and Kadewe dept store, and on the bus 100 route, which hits most of the tourist spots. Definitely my choice for my next trip to Berlin.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Nice hotel, low price and superb location”", "Author": "BharatYatri", "ReviewID": "UR102029090", "Content": "The location of the hotel is its highest selling point. Easy access to the rest of the city because of close proximity with U-bhan station. The room was good and spacious.The breakfast was average. We were here to celebrate new year's eve and stayed for 3 nights at this hotel. Due to the holiday season there was huge rush and hence you have to be there early for breakfast else you might have to wait for food items to be refilled.Basic amenities like shower cap are not available in rooms but can easily be obtained from the reception. The people at the reception were polite. What I did not like was the cleaning standards. On the first day a dirty towel had not been removed from the floor of the room and neither were the coffee mugs cleaned. But this was not repeated on second and third day. I filled up the review form mentioning the same but did not receive any reply. I would say you can opt for this hotel as it is economical and centrally located.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Joensuu, Finland", "Title": "“Great hotel for reasonable price”", "Author": "Taski63", "ReviewID": "UR99736353", "Content": "The HIE surprised us pleasantly at first sight, having our room ready for us when we arrived before 10am due an early morning flight. The staff was polite, helpful and welcoming. The hotel itself is modern, clean and tidy, as was our room, too. Spacious enough shower booth, ingenious one-door system for bathroom/wc, good beds with choise of pillows etc. A small minus for lack of the fridge, but that goes with the HI Express concept. Location is almost perfect: pretty quiet, peaceful and safe neighbourhood - but busy enough to have enough restaurants, shops etc. nearby. The Wittenberg U station is indeed within 5 min walk, and next to the hotel runs the bus n:o 100 which takes you to the main tourist sites (route: Zoo - Alexanderplatz, can be crowded time to time). The breakfast was good with basic selection of coffees (automat), juices, cheese, cold cuts, eggs, bread rolls, sliced bread, croissants, cereals, youghurt and fruits. Large enough breakfast room. The staff was swift to clean the tables and keep the trays filled. Altogether, a nice hotel that I would recommend for a friend and wouldn't hesitate to stay over again.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hampton, UK", "Title": "“Good location and great budget hotel”", "Author": "CliveS", "ReviewID": "UR98366364", "Content": "Just returned from a 4-day trip to Berlin with my wife and our 5-year old son. We picked the Holiday Inn Express (City Centre-West) hotel for it's location and price, and were very happy with our choice. The hotel is located on a fairly busy road but we were not disturbed by noise at all despite having a room facing the road - the soundproofing was excellent. The room was very clean and large enough for the three of us, with a well-appointed shower room (powerful shower even on the 7th floor). Comfortable bed, with a choice of pillows, and our son slept like a log on the sofa bed. The complementary breakfast was great for the room price - the usual selection of meat and cheese with various breads, as well as cereals, fruit, yoghurt and pastries. Signs in the lifts warned guests to expect queues as peak breakfast hours, but we experienced no major problems, on weekday or weekend mornings. Access to the city centre sights is easy - just 15 minutes or so on the U-bahn (U2 line). The nearest station, Wittenbergplatz, is only 5 minutes walk away. Located on the south side of the Tiergarten and within a few minutes walk of Berlin Zoo and the Kurfurstendamm shops (including KaDeWe, the Harrods of Berlin), there are plenty of opportunities for longer walks and retail therapy nearby. There are also loads of restaurants and cafes to suit any taste and pocket nearby. However, anyone looking to visit the Reichstag and it's iconic glass dome should note that it is currently closed to casual tourists - due to a terrorist threat - but you can (apparently) apply for permission to visit 14 days in advance of your trip. Something that wasn't made clear on any of the Berlin tourism websites I looked at prior to our visit, which was most annoying. Plenty of other sights to see, of course! In summary a great hotel at a great price, and one we'll recommend to others. The staff were very friendly and helpful and even let us check in to a room much earlier than advertised when we arrived quite tired and emotional after a 3am start, thanks to Easyjet - although I expect this depends on whether they have spare rooms free on arrival. They also looked after our luggage after the generous 12 noon check-out time while we popped back into the city centre for one last wander about before flying home.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Good Hotel with Friendly Staff in Good Location”", "Author": "pbkeber", "ReviewID": "UR96957579", "Content": "Reception staff, bar staff, room cleaners and breakfast staff all very friend and helpful. The room was neat and cleaned well, every day. Breakfast was served fro 6.30 am and the supplies stocked up as soon as they ran out. Breakfast room can get busy at times. The bar staff were very helpful and explained a few of the tastes of the local drinks. All round experience of the hotel was very good. The location of the hotel is also a big plus point. Easy to get to from the Airport on the train. the Underground is between 5 and 10 mins away and easy to use. Bought a 3 day transport ticket which once validated just needed to be with you in cased checked.. Three days using the underground and the train I was never checked. Best to buy a ticket. Local eating and drinking near the hotel was also very good and easy. Plenty of different style of food to choose from. All in all one of the best short breaks in a hotel I've had. Berlin definitely worth a few days to see.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Limerick, Ireland", "Title": "“Quiet Location”", "Author": "GemmaOD99", "ReviewID": "UR92088019", "Content": "We have stayed in Holiday Inn hotels many times before but never before in the Express version. The rooms are minimalist in comparison but are comfortable and also have a good shower. The location is quiet and ideal for a good nights sleep. The nearest U-Bahn (Wittenbergplatz) is a short walk away alongside the shopping street of Kurfurstendamm and the Zoo. The staff were very friendly and the complementary breakfast was ideal before a day of sightseeing.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gdansk, Poland", "Title": "“Very good hotel in the heart of Berlin.”", "Author": "dylannever", "ReviewID": "UR88910869", "Content": "The location was excellent for our short stay in Berlin - near KaDeWe and U-Bahn station. Very quiet and comfortable place. Attentive, helpful and friendly stuff. The room was small but comfortable and clean.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Memphis, TN", "Title": "“The reviews said it is a great place to stay and we found this to be true.”", "Author": "Ronmem", "ReviewID": "UR87007467", "Content": "The hotel staff is very friendly and helpful. We did not find any problems in communicating since we spoke little German. The rooms are on the small side but very clean. The bathroom is of good size and the shower was strong and hot. The hotel is in a great location. We caught the 100 bus just outside the hotel doors which goes to most Berlin sights. The Metro is three blocks away. About 4 blocks away you hit the KaDeWe store and many others and very large crowds. There are many, many eating places near the hotel. We went to the Berlinchen Restaurant (non-smoking) which was recommended in an earlier review. We liked it enough to take a lot of our dinner meals there. The menu has a little English and the staff speaks a few words but the food is good, plentiful and affordable. We found the hotel breakfast room to be large. The offering was the same each day but it was good and any shortages were soon replaced by the attentative waiting staff. The Kaiser supermarket is about 3 short blocks from the hotel and there are a few smaller markets within a few hundred feet of the hotel. I totally agree with the other reviews that this is a great place to stay. The hotel is in a quiet area and we felt very safe walking around at night.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Excellent Value and well situated”", "Author": "Arferion", "ReviewID": "UR86730292", "Content": "Very friendly and helpful staff. Close to a number of excellent restaurants, Ka De We and many historic sites. The buffet breakfast was just right. I would definitely stay here again.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Friendly service, great rooms”", "Author": "Wayne_Toms", "ReviewID": "UR85452536", "Content": "I spent a week on business in Berlin. This hotel is centrally located (near the U-bahn and KaDeWe); rooms are clean, quiet and well appointed; and the service was always friendly and accommodating. The free breakfast was awesome as well! I'd have no hesitation recommending this hotel.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Great base to explore Berlin and surrounding area”", "Author": "xgeorgeAthens", "ReviewID": "UR81860459", "Content": "The Express by Holiday Inn chain now has two Berlin City Center hotels, one in the west and one in the east. I have been to both, and while they are both typical of the chain (which I am quite fond of), and I was quite happy with both, I think that this one (West) is preferable in terms of location for the average Berlin visitor. One block from the hotel there is a bus stop for the very frequent 100 bus which starts from the Zoo and ends at Alexanderplatz, passing in front of the Brandemburg gate and Museum Island. You can take a bus to Tegel airport from the Zoo or the S-Bahn to Potsdam. Three blocks away there is a metro station used by multiple lines, that can take you everywhere else. The area around the hotel is full of shops, restaurants and cafes, and the nearby area between Savigny Platz (S-Bahn) and Ernst-Reuter Platz (U-bahn) is full of bars and restaurants, being close to TU-Berlin. As Berlin sights are spread out, you will need to move around, so staying at a convenient location is a big time saver, and this hotel is perfect in this sense. As far as the hotel is concerned, it is a typical Express by Holiday Inn, brand new, well designed and functional. Despite the central location, it is very quiet, even in a front room. They do charge for Internet and (obviously) it is not cheap. The continental breakfast was OK, apart from the coffee; what's the point of an espresso machine if the coffee is not up to it?", "Date": "October 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Walldorf, Germany", "Title": "“Great location great hotel”", "Author": "-C_h-e_s-s_y-trip", "ReviewID": "UR81382332", "Content": "It is very centrally located, very close to the Kadewe, the metro station and the pedesterian zone. very nice hotel, small but modern, trendy, colourful, brand new and non-smoking :) The first non-smoking hotel in Berlin and in none of the rooms of this hotel has never been smoked. The rooms are also very nicely and colourfully decorated. It may be a little bit too small for the people who stay longer but we stayed only 2 nights and did not really spend so much time in the room, so it was OK. The breakfast was nice, was similar to that of the hostels. Not that big variety but it was all enough.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "near Phila.", "Title": "“Nice, modern, and great location”", "Author": "CJIMI", "ReviewID": "UR80999961", "Content": "We had talked of going to Berlin, for years. This Holiday Inn was just the kind of hotel we were looking for. This is a very nice, new, and modern hotel in the western part of Berlin. The rooms are air-conditioned ( nice ) and the entire hotel is non-smoking ( really nice ). There are 3 english language TV channels available on the flat screen TV in the room. The room design looks like it came out of an Ikea catalogue - clean and very functional, with excellent space utilisation. A buffet breakfast is included in the rate. You can walk to the Bahnhof Zoo ( train station ) in about 15 minutes. The Wittenbergplatz U-bahn station is less than a 10 minute walk - right next to the enormous KaDeWe department store, where you can purchase almost anything you want. There is a supermarket about a block away from the hotel - turn left as you exit the front door. The No. 100 bus stops near the front of the hotel, and is an excellent way to get an initial overview of this vast city. Make sure you purchase a transit pass to get around - Berlin is large and spread out, but public transit is excellent. Check out the very few fragments of the Wall which remain. If you have a rainy day, check out any of Berlin's Museums - starting with the Gemaldegalerie ( a world class art collection - and it is rarely crowded ).", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Very good hotel in close location”", "Author": "warwicks", "ReviewID": "UR80269981", "Content": "Very comfortable hotel. A short walk to U-bahn and S-bahn. Not too far to walk to Potsdam Square, Brandenburg Gate. Good service. Free internet.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Not bad; should have been much better!”", "Author": "Grin X", "ReviewID": "UR78148038", "Content": "The location was very good: right on the line of the 100 number bus which takes you to all the important locations including Alexanderplatz. Alexanderplatz is where you get tourist buses etc and is the center of the city. But hotel breakfast and service were average. Staff wasn't the most resourceful. Breakfast was all tinned and average. Internet is not free. Rooms are extremely small. Staff forgot that we had payed for the Internet/had kept no track on the same and we were asked for payment again. Otherwise, nice, lighted, bright place. It's a decent hotel for the price, but the location and brand gets most of the credit!", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "monaghan", "Title": "“would stay again”", "Author": "patMonaghan", "ReviewID": "UR77560155", "Content": "just returned from berlin, holiday inn express was a great hotel in good location. staff very friendly and hotel itself spotless. rooms lovely but could do with more space for hanging clothes. breakfast very bisic as just hams cheese, bread rolls, there was cereals but surprised there not hot food as in sausages, well it was germany we were in!!! showers very good. no shampoo nor conditioner. just shower gel.great pillows!! in all its a good hoyel and would stay again", "Date": "August 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Angus", "Title": "“Shocking Service”", "Author": "Jingsy", "ReviewID": "UR77384712", "Content": "Just back from 1 night in the hotel. Arrived in from Athens, went to desk around 1130am. Was allowed to check in, and was pleased I was to get a room after my flight - then told to come back at 1500hrs (why let me check in?), managed to talk it down to 1400hrs - great, 2.5 hours to kill. Let me leave my bag which was met with a frown - very welcoming. Went out, back at 1430hrs. Met with another unhappy face at the desk, and then asked for my bag. She had a look, then advised she could not find it, after looking for a couple of seconds. Kind of stared at me, then answered a ringing phone where she obviously knew the person (a personal call?)....errr, what about my bag? Another girl came through, and managed to get the bag. Had a few hours sleep, then down for a drink - managed to get a beer eventually, then was joined by my friends who actually gave up waiting and we left. Room OK, Breakfast OK - real real shame about the staff. For that reason - avoid.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tampere, Finland", "Title": "“Poor Service”", "Author": "Jerry_99a", "ReviewID": "UR76901217", "Content": "Two poeple at the reception, one of them a trainee explaining all of Berlin's attractions to a guest, the other one watching him (!). In the meantime, we had to wait 27 minutes to check in as the only waiting customers. The room was clean but clearly too small to hold the (broken) extra bed set up for us, so it was impossible to move around, get to the window, or use the desk. There was almost no wardrobe space. Beds are hard. At least three customers including ourselves had problems with Keys not working. A simple rearrangement of the (minimalistic) breakfast buffet (e.g. coffee away from the rest) would avoid the constant build-up of long queues and help serving more customers. The employees are not very helpful and borderline rude as we have experienced ourselves and also observed with other customers. Overall, this Hotel did not at all meet what the name \"Holiday Inn\" promises.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Good value for money”", "Author": "matthijst", "ReviewID": "UR75654975", "Content": "The room was OK, wifi internet was 5 euro for 24 (real) hours. Breakfast was good but the diningroom was quite busy, although they had a listing in the elevator showing at what times when breakfast would be busy or quiet. There is parking available at the hotel and there are restaurants and a supermarket closeby, so all in all a nice place. The hotel is close by KADEWE and gedachtsniskirche and bus 100 stops right in front and takes you to all the major tourist attractions.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Good price”", "Author": "suaterus", "ReviewID": "UR74251772", "Content": "We stayed 2 nights for a medical congress at a near hotel. With its nice price and good location (near Ku'damm) Holiday Inn was the best choice for Berlin.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reykjavik, Iceland", "Title": "“the best one affordable”", "Author": "DenLilleHavrue", "ReviewID": "UR73643012", "Content": "We stayed here for 3 nights. Everything was excellent, pricewise, breakfast, staffs, and the room. But there is one thing bothered us a little bit, we found some mosquitoes in the room and got some bites as well. I don't know where they come from. But this problem won't keep us from staying there again in the future. We just hope it could be sorted out, since it's quite annoying :) A minibar in the room could be a nice bonus. Location is perfect, close to many shops, bus, train, metro station, and the sophisticated KaDeWe are within walking distance. We took bus from Tegel airport to Zoologischer Garten then walked all the way to the hotel, less than 1 km I guess. The no.100 bus to Alexanderplatz where you can find many interesting spots along the way, pass the street where the hotel is. Eateries are endless. we did enjoy our visit to Berlin and our choice of hotel was spot on. Two thumbs up for this hotel. Would love to be back.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sverige", "Title": "“Excellent – all Holiday Inn Express hotels should be like this!”", "Author": "ErikL86", "ReviewID": "UR72589921", "Content": "Newly opened HIE hotel near Tiergarten and Charlottenburg, with efficient staff, good breakfast and nice rooms. The hotel has a car park directly below. We only stayed one night, but we walked along Kurfürstendamm and in Schöneberg which was nice. All other Holiday inn Express hotels should look at this one – everything was spot-on. If you book through the hotel's own website, you get free wi-fi. We got it despite booking through holidayinnexpress.com – a nice touch!", "Date": "July 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Excellent location and rooms”", "Author": "lena312", "ReviewID": "UR64155943", "Content": "Clean, location perfect if you choose to stay in the western parts. Buses 100 and 200 right outside and a few minutes walking to Bahnhof Zoo with both s-and u bahn. Hotel and rooms are clean and breakfast is included. I travelled with a friend and the beds of the twin rooms had enough space beetween them. If I go back to Berlin I would stay there again. Lots of restaurants within a 5-10 minutes walk. We paid 80 Euros/night and if you don't expect roomservice or minibar this is a perfect hotel.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Skopje, Republic of Macedonia", "Title": "“Nice hotel...”", "Author": "lisa71Skp", "ReviewID": "UR63930168", "Content": "We spent realy wonderfull weekend in Berli.Hotel is with a realy good location for city tour .Bus 100 stops in front of hotel.The front desk is realy helpfull.Book the hotel and you will enjoy your stay in Berlin.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean, very comfortable and well-priced”", "Author": "yardayardayarda", "ReviewID": "UR63330927", "Content": "When we arrived we were really surprised, this hotel room was one of the cheepest we have booked in a European city but it was also very modern, clean, comfortable and well looked after. Everything was very clean, staff were friendly and helpful, and the rooms were a great size with a little couch to watch TV as well as the usual. Breakfast also was only a little extra each (we added this when we booked), and was a neat spread served in the restaurant on the ground floor. Breakfast consisted of cold meats, cheeses, boiled eggs, many cerals, bread buns, toast, and jams etc. The coffee was also not too bad. The hotel is busy, travellers were often coming or going, and the breakfast room was very busy at all times of the morning. But staff were efficient, and there was never any shortage of breakfast foods. I would really recommend this hotel, it was great value.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“well priced, well located hotel and a good stay overall”", "Author": "WorldTraveller5000", "ReviewID": "UR62184484", "Content": "Well located to Ku'Damm shopping area and the Zoo station (Wittenbergplatz is the closed underground though) the Holiday Inn Express had really nice rooms (better than I expected for the price). The double glazed windows meant that the room was silent; the bed was comfortable and the bathroom pretty. The breakfast was plenitful in choice and good quality. My only disruption/dislike during my stay was the constant prroblems with the lift access from the lobby meaning delays every time i needed it", "Date": "April 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A great hotel for a city break”", "Author": "Whitby1964", "ReviewID": "UR59896237", "Content": "Chose this hotel after studying TripAdvisor and we were very pleased indeed. Very clean and modern. Rooms are well equipped and the shower extremely powerful. Breakfast can get very busy but it is well managed and we always found somewhere to sit and the staff are very careful at making sure that supplies are kept topped up. Throughout the hotel the staff are excellent; helpful, cheerful and polite at all times The location is ideal for a city break. The 100 bus into the centre of Berlin runs right outside the door and there is a bus every 5-10 mins. Always full, but we never got turned away. A choice of U-ban stations are within an easy walk away too. We took advantage of the Berlin Card, which gave us free travel for 48 hours and reduced entrance to several museums and galleries. The “open top” bus tours are recommended and as early as possible in your stay to help you get your bearings. Don’t think we have ever stayed in a hotel with such a nice choice of restaurants so close at hand. We tried the Vietnamese restaurant opposite the hotel, the Argentinean Steakhouse (out of the door then on the right in the same block), the Italian (out of the door and left on the same block), the little bar between the hotel and the Italian and a great traditional German restaurant (right out of the hotel, cross the main road then left, past the new Fish restaurant then left by the dry cleaners – it’s then on the left hand side) – a bar and restaurant run by a lovely couple who could not have been nicer and the food was wonderful (very popular with locals) Would recommend this hotel to anyone who is looking for a great base for a city break in Berlin.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Den Haag", "Title": "“If I go back to Berlin again, I'll stay here!”", "Author": "ilah2001", "ReviewID": "UR54697439", "Content": "This hotel had exactly what we required and for a really good price. The rooms were large and comfortable, underground parking for the car, good food and the staff were lovely. It is very centrally located, near the zoo for the kids and near the shops for me! Well connected for the Ubahn too. Can't say much more other than it was perfect for us, a great place to crash! Oh and Berlin's just so cool as well:)", "Date": "January 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Glasgow", "Title": "“Good hotel - Excellent Location”", "Author": "PSRMN", "ReviewID": "UR54385979", "Content": "Just back from 3 night break to Berlin. Excellent standard of hotel 10 min walk from Zoo station and plenty of restaurants nearby. Would definitely recommend if you want a clean bedroom with excellent breakfast close to all ameneties.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Great Hotel in Great Location”", "Author": "SusieQ1973", "ReviewID": "UR51415027", "Content": "Booked this last minute primarily due to the inclusion of a breakfast, but turned out to be a great choice, from the moment we arrived the service was excellent, receptionist very friendly and spoke excellent english. Checking in was very quick and we were in our room within 10 mins. We were on the 7th floor looking to the back in a Priority Club Room as I am a member, Room was very clean and spacious with tea / coffee making facilities and the ensuite was a good size with great shower. Rooms were serviced every day. Breakfast was good, a nice selection of things to eat and certainly helped start the morning. Hotel was in a very good location, bus no 100 stopped not far from the hotel although it was always a very busy bus but it goes to all major locations on Unter Den Linden and Tiergarten. There is also only a 10 min walk to the U Bahn of Wittenberg Platz which runs to all major locations too. Plenty of Resturants and bars nearby and at the Europa Centre and there is a also a Netto only a few mins walk to stock up on water etc. Highly Recommend the Chinese in the Europe Center, Ming Dynasty, food was excellent and was always very busy. Hotel has a nice relaxing bar after a long day of walking. I will certainly return to this hotel next year maybe in the summer months this time. Wifi is available at a cost of 5Euros for 24 hours, but this onoly counts down the time you spend on it so we found that a 24 hour pass lasted us the full 7 days. Only downside was the lifts, they can get very busy in the morning with people checking out etc so it quite often involved a wait.", "Date": "December 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "St Albans, England", "Title": "“Good value city hotel”", "Author": "UncleMike66", "ReviewID": "UR50881735", "Content": "We were in a party of 20. All rooms were as required. Check-in was fast, rooms were clean and adequately large, staff were friendly, breakfasts were good. Hotel was well situated with 100 Bus stopping in street and U-Bahn only 5 minutes walk. A generally good value city centre hotel.", "Date": "December 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New England", "Title": "“It was all we could ask for: location, amenities, great staff.”", "Author": "Technical-Rose", "ReviewID": "UR48786475", "Content": "We booked our vacation a little late so our options were limited. My preferences are proximity to transportation, safe area, breakfast included, in-room coffee, bathroom ensuite. Am I asking too much? By chance, this hit the nail on the head. We were a 5-10 min walk to \"Zoo Station\" but why walk when the bus stop was one block away! The area was basically safe with lots of tourists and a number or restaurants. And yes, we had in-room coffee and bathroom ensuite. We arrived early in the day from our overnight flight, too early to check in, but the front office gladly put our luggage in a safe place until our return from the zoo. We had breakfast included: cereal, cold cuts, fruit, cheese, yogurt, and all sorts of bread and rolls. It was more than enough to start each day. The room was a basic hotel room, no frills but neat and clean. There was cable TV with 2 English speaking stations: CNN and BBC. Internet was in the front lobby; one euro for 15 minutes. A grocery store was less than one block away. The biggest plus for this hotel however was its staff. Every employee that we encountered was friendly, knowledgeable, and professional--and all spoke English. If I asked for information that they didn't know, they would take the time to find out, checking the internet or making phone calls. They helped us in so many ways. The dining room staff was equally pleasant and professional. Most of them were young adults who really seemed to take pride in their work. We stayed there for seven nights so I think we encountered most of them. The only negative here was no room refrigerator--not an option with HI Express. We had meds that needed to be kept cold so the desk made sure that we had a container to hold ice. The ice machine was off the lobby. All in all, this was a great hotel for us. It was a little pricier than we originally wanted but it was worth it and I would definitely stay there again. .", "Date": "November 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Excellent Hotel”", "Author": "JFMStuttgart_Germany", "ReviewID": "UR48479457", "Content": "I just returned from Berlin, where I stayed for two nights at the Holiday Inn Express Berlin City Centre-West. Absolutely recommendable! the hotel is very well located, near to the \"Wittenbergplatz\" metro station. It is very well furnished, rooms are very clean and comfortable. Delicious breakfast! Very friendly staff, especially at the reception.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Glasgow", "Title": "“Excellent value for money at very friendly hotel”", "Author": "slowal", "ReviewID": "UR47941938", "Content": "Stayed for 5 nights with party of 5 adults. The hotel is good value for money with very friendly staff, clean rooms and an excellent continental breakfast, which can be rather busy at times but not a great issue. Handy for main station 7 minute walk. If you like thai food you must try the Suksan Thai restaurant, turn right out of the hotel cross road and walk in the direction of the zoo. Pass by the fish restaurant and you will see the Suksan on Ansbacher Strasse. The food is to die for, as good as any you will eat in Thailand and at very reasonable prices. The irish bar in the euro centre is good for live music. All in all a great trip.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Huddersfield", "Title": "“Great Hotel”", "Author": "Dimpaler", "ReviewID": "UR46824746", "Content": "Excellent Hotel in a Excellent Location everything about my stay at this Hotel was great", "Date": "October 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Brussels", "Title": "“nice new hotel, but busy road”", "Author": "CHDD", "ReviewID": "UR46707478", "Content": "we stayed in this hotel based on the reviews on this site and weren't too much disappointed; the hotel is very new, convenient and crisp indeed, the breakfast is really good for a free service (and cheap if you want to enjoy it as a visitor from another hotel); it's not really situated in the most beautiful nor interesting part of the city, but it's close enough to one of the main U-bahn lines, so it's well situated to discover the rest of it; apart from an issue with the cleanliness of the bathroom, our only bad experience was the road in front of the hotel that didn't seem to bother others so much, where as for us it really made it impossible to sleep with an open window due to the nightly traffic, so we had to switch to a room in the back of the hotel", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Porto, Portugal", "Title": "“Superbly located hotel!”", "Author": "parutakupiu", "ReviewID": "UR45395433", "Content": "Apart from the good accomodation and service, this hotel is very well located in the city's centre, close to the Kurfurstendamm centre and metro stations.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Minnesota", "Title": "“Good location and friendly staff”", "Author": "MCSMinnesota", "ReviewID": "UR43128529", "Content": "The hotel was rather new with a good breakfast buffet. It was a great location in that it was under 15 minute walk to Potzdamer Platz, Checkpoint Charlie Museum, and Jewish Museum.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Winfield, Kansas", "Title": "“3 star should rate 4 stars!”", "Author": "Kansan57", "ReviewID": "UR38915790", "Content": "From the front desk clerks to the room to the breakfast and location, this hotel can't be beat when visiting Berlin. Great price for all of the amenities. Clean, modern, and well-appointed rooms. Bus 100 stop is just a few yards away and hotel is within easy walking distance to Kaiser-Wilhelm-Gedächtniskirche, plaza, and KaDeWe Department Store.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Nice, clean and quiet acommodation”", "Author": "AIST66", "ReviewID": "UR37719989", "Content": "Our family of three stayed in this hotel for three nights at the end of June as a part of our 2 week trip to Germany. We liked the hotel. It is very modern, clean and very reasonably priced. The rooms are not too big but have all the convenniences that you might expect. Air conditioning was very handy as it was very warm during our stay. The breakfast was very good and coffee machine served very good coffee too. There is a broadband connection that you have to pay for. You can buy 1 hour or 24 hours. I purchased 24 hour access for 5 euro (1 hour access was about 3 euro) and was very delighted because only time when you are logged in is counted. So 24 hours was plenty of time and I did not even spent it all within four days. Two underground stations serving different lines are within a short walk, plenty of small restaurants around and Berlin Zoo is nearby. We recommend to try Roter Sand restaurant just across the street. It is an Italian seafood restaurant that we liked very much and visited twice. All in all it was a very nice stay and I do not have any hesitation to recommend this hotel.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dartmouth, Canada", "Title": "“Great location, basic clean accomodation”", "Author": "Nick_and_Michael", "ReviewID": "UR37082601", "Content": "My husband and I spent a week at this hotel last month. The hotel is very new! Our room was small, but well laid out and quite clean. Our room, like the hotel, was very energy efficient...you had to put your room key in a slot to turn the lights and a/c on! We had a great time in Berlin, and our room was a great place to crash after going out for the evening. It wasn't a luxurious place, but it certainly suited our needs for a great rate. The included breakfast was pretty good, and the coffee was quite good from the automated machine at the breakfast bar.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Buckinghamshire", "Title": "“What an emotional journey - not a place for the faint hearted”", "Author": "Dianne8868", "ReviewID": "UR35845158", "Content": "I stayed in this hotel for 3 nights 26-29th May on a bed and breakfast basis. On first impressions its a very modern new clean hotel. We arrived slightly early and had to wait to check in which wasnt too much of a problem. The reception staff were ok but not very helpful in terms of giving suggestions re places of interests to visit etc, however they were pleasant on other matters. I used the hotel bar once during my stay and there was internet access which could be used at a charge. Travelling from the airport by train was straightforward taking about 45mins, however once in the City of Berlin finding the actual road was a bit tricky as we didn't have proper directions. Berlin itself is a very interesting place the social changes and developing infrastructure is exciting to observe, with good shopping centre. The former East side of Berlin particularly is progressing and what is even more fascinating is the changes in such a short period of time. I was left with an overwhelming sadness though as the enormity of the atrocities really comes home to you when you visit the places of interest. The holocaust memorial, check point charlie the museum, the sachsenhausen concentration camp outside of berlin, the plaza and seeing remnants of the wall was a reminder of the situation as it was back then, brandenburg gate all accessible via the train/metro and reasonably priced travel. The city tour buses were also good and value for money I found the walking tours very informative but you could quite easily get around Berlin on your own steam with a good map. I was glad I came here but not sure I would return I think perhaps its a place everyone should go once in their lifetime to remind ourselves of the horrors and dangers of extremism. To talk about the pros and cons of the hotel seems a little trivial when you consider that the history of this city is relatively recent which makes the visit here even more poignant.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Berlin", "Title": "“Great hotel”", "Author": "mela123", "ReviewID": "UR32963243", "Content": "Stayed at the Holiday Inn Express one night with my mom. Staff was very friendly, rooms were modern and clean. We paid €69, very good price for Berlin. Kudamm was only a couple of minutes away. Also had a very nice view from our room. Loved the hotel so much, Im gonna be staying there again with some friends in July.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin", "Title": "“great value for a city centre hotel”", "Author": "aqualeo", "ReviewID": "UR31665660", "Content": "great location - rooms a little small but had everything needed.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great Hotel!! Very clean and modern!!”", "Author": "nonhorva", "ReviewID": "UR28978223", "Content": "The hotel is very modern and clean! Close to transport and virtually on the main street in Berlin! The staff were very friendly and helpful and spoke good english. The rooms are very modern and clean. The only negative that I can say is that there is no bar fridge. But then again, they do have a free ice machine downstairs. During the time that I stayed there, the A/C was not working for the during of my stay. It does get quite hot in the rooms. Overall, I think that this is a very nice hotel. Clean, modern and with friendly staff. The price that I paid was reasonable as well and if you are Priorty Club member, you might be able to get further discounts or upgrades.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“Great Hotel”", "Author": "Aktaion", "ReviewID": "UR28145981", "Content": "Just returned from Berlin where we stayed at the Holiday Inn Express (Kurfuerstenstrasse 78). This is a lovely hotel, pleasant environment, well situated, very clean and good quality breakfast. Our room was on the 4th floor (to the rear) and was very quite. The No100 Bus passes just outside from the hotel and its a very frequent service, taking you nearly through all the points of interest in Berlin. On one side from the hotel a couple of doors away is a nice Italian cafe-restaurant and on the other side couple doors away is a good quality Argentinian restaurant. About 5 minutes walk to the rear of the hotel and across from the Intercontinental Hotel (Budapester Strasse) is 'Romiosyni' a very good Greek Restaurant. Staff at the hotel always ready to help and pleasant to deal with. Definitely we will be staying again at this hotel.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Lovely hotel in good location”", "Author": "marysr", "ReviewID": "UR27109785", "Content": "I stayed at this hotel for 3 nights in March with my husband & sister. If you're looking for somewhere clean, tidy, friendly and inexpensive then this is the one. I got a very good deal on their website for 53euros a night double room B&B although I had to pay at time of booking but it was worth it to get it so cheap. The hotel is about a 10 minute walk to the zoo where you can pick up a train to take you vitually anywhere in Berlin. Or pick up a bus close to the hotel, although we tended to use the train rather than the bus. If I go back to Berlin I would definitely stay here again.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Peterborough", "Title": "“Great value, well located and excellent staff”", "Author": "johnboyPeterborough", "ReviewID": "UR26316954", "Content": "My wife and I stayed at the Holiday Inn Express in March. The hotel is probably best suited for shorter breaks of up to about 4 days. The location is great and many of the cities attractions can be reached on foot. The nearest tourist bus stop is only about 5 minutes walk away. It is also very handy for restuarants, bars and shops. The hotel itself has very friendly and helpful staff. The bedrooms are very comfortable and clean and the bathrooms are also well appointed. Coffee and tea is provided in the room.The breakfasts are plentiful and of excellent quality. We stayed on a Saturday and Sunday evening and our room was at the front of the building. The traffic was a bit noisy on the Saturday evening till after midnight but by no means horrific. If you tend to be kept awake by traffic it is probably worth getting a room at the rear Overall for 148 Euros for two people for two nights it was great value and the staff were fantastic", "Date": "March 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cardiff, Wales", "Title": "“good value hotel”", "Author": "fiftysomething100", "ReviewID": "UR25293853", "Content": "We stayed at the HI express for two nights. We picked the hotel on my son's recommendation since it is close to his apartment and we were visiting him. Staff are welcoming, pleasant and helpful and we found it a comfortable and convenient base from which to explore Berlin. The room was very clean, the shower larger than average and the bed comfortable. Toiletries are limited to a wall mounted soap dispenser and tissues, but this is a budget hotel and we did not expect more. Unlike many hotels on mainland Europe there was a tea and coffee tray, which was much appreciated. Breakfast was plentiful, if a little limited, but the breakfast room was large and there was no waiting for tables. We stayed in room 714, which was high enough to be quiet. Other members have mentioned the walk from the Zoo station, but if you change at Zoo to Wittenbergplatz, which is only 1 stop, you come out near KaDeWe, very close to the hotel. It was very icy underfoot whilst we were there so we were glad to avoid the walk. This hotel is a good value hotel in a well-regarded area of Berlin and the absence of smoke was fantastic. I am very happy to recommend it to other members. There are several nice places to eat under the station at Hackescher Markt. This station has several arches underneath which have been converted to restaurants and cocktail bars and the area had a good atmosphere at night.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "N.Ireland", "Title": "“Great Location, great price”", "Author": "N_IrelandFranco", "ReviewID": "UR24541558", "Content": "We had a 2 night stay at this hotel and it was in a great location to take in the sights. The city tour bus stop was just down the street. The hotel itself is modern and clean and the staff are lovely. The rooms aren't overly big (but not tiny either) sufficient for a short trip when the room is merely being used to sleep in. The complimentary breakfast was very welcome and set us up for the day.", "Date": "February 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Germany", "Title": "“Good location for a short trip”", "Author": "wanderlust_2009", "ReviewID": "UR23368492", "Content": "We've been in the hotel last december for three days to see Berlin and the hotel has a perfect location. It's close to the zoo, the Kurfürstendamm and one of the bus routes passing all the main attractions in the centre stops just next to the hotel every couple of minutes. The interior is simple and new, most of the staff very helpful and the rooms are small but nice and clean. Breakfast is okay but nothing special. I'm sure it might be boring after a couple of days because it's the same every day. Furthermore, the hotel provides a car park for 10 Euro per night which seems a bit to much. Nevertheless, we would come back to this hotel as long as we're just going for a city trip.", "Date": "January 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "5"}, "AuthorLocation": "Northern Ireland", "Title": "“What a Find”", "Author": "thenexttrip_8", "ReviewID": "UR22784550", "Content": "We stayed for four nights in late November and booked it with reward points. We were a bit unsure of what standard to expect for 15,000 per night but as our trip was to enjoy a low cost break before Christmas and to visit the markets we weren't expecting 5* standards. Boy, were we pleasantly surprised. The hotel was bright and clean with the new HE Express colourful branding. The room we were given was slightly larger than usual with a 'wet room' style shower. Of course the room was fairly basic but the bed was very comfortable with clean linen and we had a sofa to sit on. The breakfast was fantastic, with lots of choice breads, croissants, cereals, cheese,meat, eggs, fruit yoghurts etc - all extremely fresh and constantly replenished by helpful staff. They also have a wonderful coffee machine which makes delicious cappachino.The girls on reception were delightful and were very happy to help, either with directions, information and our on-line flight check-in. As priority club members we were given a voucher for a free drink at the bar one evening . We have stayed in much more expensive hotels in Berlin on previous visits but will definately return to this one and would have no hesitation in recommending it . Great location too - very central.", "Date": "December 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "West Orange, New Jersey", "Title": "“Friendly, Immaculate, Easy To Reach From Tegel”", "Author": "rojersey", "ReviewID": "UR22739271", "Content": "We were a little skeptical about booking this hotel using Priority Club Pts. After all, for a mere 15,000 points how good could the place be? But, our faith in Holiday Inn Express was well served as we could not have asked for a better place for our overnight in Berlin. We took the airport bus from Tegel to the Zoo and walked (with only hand luggage) to the hotel. It was about 15 easy, flat minutes and luckily, since it was midmorning, they found us a room promptly. The room was certainly small and the view was nonexistent but the beds were heavenly. Spotless linens and a wonderful duvet were too inviting so we caught a nap before doing our city wandering. Ok, so the little bathroom amenities were in absentia and we only had those impossible to squeeze wall mounted soap shampoo combos. They did the trick and we were exceptionally comfortable. Breakfast was absolutely superb with crisp, flaky croissants, wonderful artisan breads, the usual array of cold cereal, butter, cheese. Very very nicely presented and all delicious. The neighborhood was safe but the other mealtime eating options were limited and the crowded fish restaurant across the street disappointed. From the hotel we were able to walk miles and revisit this fascinating city. As Jews we are always a tad uncomfortable in Germany but the abundant markers throughout the city of crimes against Jews will hopefully be the constant reminders needed to make sure that such events are never repeated. As a matter of fact, directly across from the hotel was a historic site decrying the mass murder of European Jews and the admonition \"never forget.\"", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire,UK", "Title": "“Wonderful find in Berlin....”", "Author": "airedale1", "ReviewID": "UR21475269", "Content": "Having stayed on previous visits in Berlin during the last 12 months at the Swissotel (twice) and the Sofitel by the Zoo, i was recommended the holiday inn express berlin city west by family. I am so glad I listened to their advice. This hotel is a real gem. The rooms are modern, spotless and above all comfortable and the complimentary breakfast set me up for a days sightseeing. Forget the rest- This hotel is everything you need and the price is a BARGAIN!", "Date": "November 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Great Location”", "Author": "alisontheresealison", "ReviewID": "UR18925818", "Content": "I really liked this hotel! It was very clean and in walking distance to all the big attractions. I felt like I was in a safe area at night and the breakfast in the morning was great! I would stay here again!", "Date": "August 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carluke, Scotland", "Title": "“Biking to Berlin”", "Author": "fantlot", "ReviewID": "UR17762023", "Content": "Travelled to Berlin by motorcycle and stayed in this hotel for 2 nights. First class hotel only a short walk from the city centre and handy for all the major sight seeing points. Rooms excellent as expected as was the buffet breakfast. Parking was available under the hotel but a bit pricey for my liking. Well worth a visit and one place i would stay again if visiting Berlin.", "Date": "July 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Düsseldorf, Germany", "Title": "“Very Good Central Hotel”", "Author": "kenandaxel", "ReviewID": "UR17684287", "Content": "Overall, a very good hotel and great value for money. The room was modern, very clean and functional. The bed was Comfortable and the bathroom, although small, was very nicely appointed. Some people here mentioned the lack of a wardrobe, but we found the storage space ample. Enough space to hang a few shirts and fold some clothes. Tea and Coffee making facilities in the room is always a nice extra. Very good continental breakfast and very pleasant staff in the breakfast room. The hotel is also very central with the No. 100 bus stopping outside the door. The only issue we would have, is that we reserved 3 double rooms for 3 couples (the confirmation said that the category was double bed with sofa in room). All 3 parties got twin rooms. A request to change only one of the rooms to the confirmed category met with a very inflexible response (change not possible). Only after much discussion with the receptionist did the category we had booked \"suddenly\" become available. Other than the above, we'd have no hesitation about recommending this hotel and will definitely return here the next time we're in Berlin.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Berlin", "Title": "“Good, affordable hotel with only minor flaws”", "Author": "net11", "ReviewID": "UR17446828", "Content": "This hotel is inexpensive but offers a lot for the money: clean, comfortable rooms with modern furnishing and facilities, very good location, helpful staff, complimentary newspaper, coffee/tea maker in the room, air conditioning. When we requested a room change in the middle of our stay (we wanted a quieter room facing the backyard rather than the street), the person at the reception was friendly and handled our request efficiently. Our only, minor complaints: Internet access is expensive (EUR 5 per day); there was no wardrobe in our room, just a rail with a few coat-hangers; the image quality of the TV in our room was very low (very distorted picture); they serve the same kind of cheese (just one single kind) and the same two kinds of sausage every morning.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warsaw", "Title": "“OK - best value for money”", "Author": "Andy_Warsaw", "ReviewID": "UR16928273", "Content": "Great location, nice price, clean room and tasty breakfast! I was very surprised when I saw my room. The staff were very helpful and quick. Only a few steps to U-bahn station Wittenberg Platz and KaDeWe. I'd like to recommend Rivaldo Steakhaus at dinner time - 30-40 m from hotel main entrance.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“A great place to stay”", "Author": "polarspeech", "ReviewID": "UR16866262", "Content": "Just returned from our Berlin stay at the Holiday Inn Express City Center West on Kurfurstenstrasse. Great place! Here's why: -Wittenberg Platz U-station a short walk from the hotel. -bus stop to the airport- short walk from hotel -Ku-Dam (major shopping area)- short walk(by U-bahn) -free continental breakfast daily with sandwiches, croissants, coffee, juice, cereal... no need to go anywhere else -AIR CONDITIONING IN YOUR ROOM!!! -comfortable beds -nice room and bathroom-very pleasant view of street -wireless internet (for 5 euros/24 hours) -small bar downstairs -big screen t.v. in lobby if you like Overall, this is a great location to get anywhere in Berlin. We were there 8 nights and will definately stay here again if possible. The price was right, close to all the transportation and very pleasant atmosphere.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“A disappointing stay”", "Author": "Bywalec", "ReviewID": "UR16740853", "Content": "I am a frequent visitor to Berlin and like this city very much. Usually I prefer to find a cheaper rate in an expensive hotel, but I am no stranger to Holiday Inn Express. We have seen the hotel being built and anticipated our first stay. What a disappointment it turned out to be! First off, the rooms were truly small. The quality of \"furniture\" was bad. The laminate veneer was already peeling off in places. The \"double bed\" was too small for two, and the mattress was uncomfortable. The bath was functional, but it's cleanliness left much to be desired: several drops of recent blood as well as a few pubic hair on the floor of the toilet cubicle, suggested that the HOUSEKEEPING WAS INADEQUATE. My reservation confirmation from the IHG (parent group for Holiday Inn) listed: 1 DOUBLE BED WITH SOFA BED NON-SMOKING - 3 PERSON(S) MAX PER ROOM WITH HIGH SPEED INTERNET COLOUR TV WORK DESK WITH LAMP ENSUITE WITH POWER SHOWER TEA AND COFFEE MAKING FACILITY SELF CONTROLLED HEATING HAIR DRYER DUVETS DIRECT DIAL TELEPHONE. You would think that the wireless internet is included in the rate, same as the bed and the TV and the direct dial phone, but no, the hotel demanded a 5 Euro charge for the Internet access. The hotel manager (visible from the reception), would not come out and talk to us, and the clerk would not budge. It was only after the intervention from the Holiday Inn (toll free to Ireland) that the charge came off my account. The hotel does not offer wake up calls, and the skeleton staff looks visibly stressed. I am a top tier member of the Holiday Inn Priority Club, and that review is based on apples to apples comparison with other Express Hotels by Holiday Inn. Not surprisingly this hotel is a franchise operation owned by a small English topmast with a distinct ring of a Ma and Pa operation. I will not stay there again, regardless of rate advantage it might offer", "Date": "June 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Good value for money”", "Author": "have_a_suitcase", "ReviewID": "UR16497506", "Content": "Typical HIE, great for a few nights in Berlin if all you're looking for is somewhere to sleep and have breakfast. Location is fine (Berlin is very cosmopolitan) and although in the Western end of town, transport connections are very good - the 100 bus stops nearby & runs through the Tiergarten, past the Reichstag then along Unter Den Linden to Alexanderplatz; U-Bahn station at Wittenbergplatz (next to KDW store) is 5 minutes walk. True, there are no cupboards, just open shelves/hanging rail, but you pay your money, you make your choice. The place is clean, new & breakfast was good cold buffet Do try the Vietnamese resaurant across the road, we had the 3 course lunchtime menu - soup or salad, chicken & noodles, ice cream scoop - all for EUR6!!", "Date": "May 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, UK", "Title": "“A Good Deal All Round”", "Author": "BillyMcIlroy", "ReviewID": "UR15735324", "Content": "This wasour first trip to Berlin and we were impressed to be stayng at the city's first completely non-smoking hotel. On arrival, we were dealt with quickly and efficiently by the young reception staff. Our room was located to the front of the fairly busy K'strasse, but we soon learned that the double glazing was very effective at keeping out the traffic noise. The bed was comfortable and the room clean ansd generally well presented. We knew that the HIE brand was a basic one and our expectations were ranked accordingly, but we were very happy with ehe overall presentation. Slight minus points on the lack of a wardrobe to speak of and safes in the room. The bathroom was very nicely preesented, and we both loved the funky violet light! Good shower, towels and tea making facilities were fine. Breakfast was included in the price (not always the case), and was decent with a limited choice but tasty and excellent value. Bar prices a bit of the high side, and range of drinks limited. Lifts were on and off during our second day of stay and I had to leave my showere when the fire alarm went off and we had to evacuate. Another minus point here is that some of the staff hung around the side of the building while the guests were left to exit the building and mall around outside on the street. A young staff to be sure, but they tried hard to please and they were polite, friendly and generally decent. Location is great fro Wittenbergplatz, the Ku'damm and Zoo all within 5-10 mins easy stroll. We wanna go back, but would like to see just how quickly the building will wear own.", "Date": "May 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "israel", "Title": "“Nice hotel, but...”", "Author": "shoshi", "ReviewID": "UR15519894", "Content": "We stayed there for 6 nights from April 23rd to April 28. It is a new hotel, rooms are designed carefully. Our bathroom had only a shower, which was fine with us. The WC itself is in the same space but the door can close it leaving the sink and shower free for others to use. Really sophisticated. The room was small-medium in size. What I did not like at all is the there is no wardrobe, only a few open shelves. A desk with no drawer, and only 1 chair. Another chair would be great although the room is small. Staff - young and nice, but when the hotel was full they did not cope so well. We had a problem and it was not dwelt properly. Breakfast - a small buffet with rolls, jams, cereals, salami and cheese and some other items. The same everyday. Thgey did not replentish items fast enough, and many times items were missing for over 20 minutes. Location is very good, with good transport right out of the door, some restaurants and a nice cafe next door. It is suitable for a short stay 1-2 nights, for longer stay it is not that comfortable. Room too small and no where to put your staff.", "Date": "May 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "solihull. west midlands", "Title": "“Really great hotel”", "Author": "notakid", "ReviewID": "UR15506373", "Content": "I love holiday inn express brand very good value esp when you have children in tow. We stayed 3 nights at this newly opened hotel. Check in was quick and easy and the rooms were lovely and clean. As its been mentioned breakfast can be a little hit and miss but there is plenty of food if you can wait! They seem to be a little late in replacing certain food stuffs but hopefully they will get better at this as time goes on. The breakfast on offer is typical. Warm bread rolls (brown and white) sliced breads for toasting, Crossaints(warm) sliced salami,cheese and turkey/ham. Yogurt, cereals, Jams and boiled eggs. Nice coffee from a machine as well. The staff were lovely and friendly too and the hotel bar served a nice beer! We came from the airport on a late flight and this is how we got to the hotel. We arrived at Schoenefeld airport at 11 p.m and asked at the imformation desk the times of the airport express trains. We then brought tickets (A B and C Zone) from the newsagents inside the airport. The train station is a five min walk across from the airport. We stamped our tickets and boarded the train. At the Zoo Station we turned left and walked towards Berlin Zoo, after the Zoo we continued walking up the Kurfürstendamm and the hotel is easy to find. From the Zoo station it is approx a 15 min stroll.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Västerås", "Title": "“Non smoking heaven in Berlin”", "Author": "Laban1", "ReviewID": "UR15368676", "Content": "Stayed in this brand new 158 room hotel for 3 nights and got a very good deal: € 62.00 per night including a buffet breakfast with a minimum 14 day advance non-refundable reservation. The entire hotel is non smoking which is absolutely wonderful. Location is very good on Kurfuerstenstrasse, about a 10-15 minute walk from Bahnhof Zoo station & Europacenter & 5 min from Ka-De-We & U-station Wittenbergplatz.. Bus 100, which runs from Bahnhof Zoo to Alexanderplatz stops 1 block from the hotel. It's a fairly quiet area, mainly residential and with a god mix of different restaurants. Enjoyed an absolutely wonderful dinner at Indian restaurant \"Mumtaz\", only 2 blocks away. Highly recommended ! The hotel opened early April this year. Rooms are of average size, equipped with flat screen TV & coffee maker. Beds & pillows are on the firm side, bathrooms are small but well planned & functional. Safe deposit boxes are available free of charge at the front desk. No restaurant on premises, only a bar and a breakfast room. A parking garage is available if you drive. The overall experience was very positive except for a disorganized breakfast service and uneven food supplies. They constantly ran out of bread, boiled eggs, cold cuts, clean cups etc and there was appearently no one in charge of overseeing it all. Instead you had to tell the staff to add missing items which they gladly did but it should not be up the guests to ask for this. Maybe part of growing pains since they only had been open for 2 weeks. Would definitely return !", "Date": "April 26, 2008"}], "HotelInfo": {"Name": "Holiday Inn Express Berlin City Centre-West", "HotelURL": "/ShowUserReviews-g187323-d940460-Reviews-Holiday_Inn_Express_Berlin_City_Centre_West-Berlin.html", "Price": "$70 - $308*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kurfuerstenstrasse 78</span>, <span class=\"locality\"><span property=\"v:postal-code\">10787</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "940460", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7d/c3/7dc3a4865f5f832fb0975f8bf1acd89b7large.jpg"}}