{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Warwick, Rhode Island", "Title": "“Awful”", "Author": "Traceyd1980", "ReviewID": "UR126156646", "Content": "This hotel is not worth the savings, stay at a more expensive place and get your money's worth. We arrived at the hotel and we had to pay 20 dollars to park in their parking lot, I am told this is normal in big cities. The hotel booked on orbitz and payed in advance was 138 dollars for the night. We checked in and got to our room which was clean but run down, it was freezing in there. We looked at the thermostat and it said 80 degrees, it was clearly not that. We decided to go to dinner at the chinese restaurant in the hotel and we told the woman at the desk about the heat, she said the thermostat was backwards, so we went back to the room and turned all the way to the opposite side. We had dinner and went back to the room and it was still cold. We told the woman at the desk again and she offered us another room, but asked if our room was clean. We had unpacked, used the bathroom and changed my son's diaper,so we did not move. They made no attempt to check the heat at all. We went to breakfast at the chinese restaurant in the morning and encountered a very rude waitress and cold, greasy food that was not included, are you kidding me. We made two or three calls when we were there to the MBTA lost and found, a local call, no where did it say the phone was not free for local calls. When we went to check out we were told we owed $2.50 for phone calls. So $138 dollars for a run down, cold room with horrible service. Not impressed.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Frat House...look somewhere else”", "Author": "Shedawg1013", "ReviewID": "UR124827128", "Content": "Just got back from a one night stay. We were in town for a concert at nearby House of Blues.You can't beat the location and things to do HOWEVER it was the worst night that I have ever experienced in a hotel/motel. Paper thin walls made for the party in the next room a nightmare. No management/security to quiet things down that went on til 3:45 am. A long night of door slamming, loud music, screaming women, and various other activities. We were going to just leave, but felt completely unsafe to leave our room as most of the party goers were also in the hallway frolicking as well. It seemed like a scene straight out of a movie. Do not stay here", "Date": "February 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“not recommended”", "Author": "sugarmagnolia8", "ReviewID": "UR124440244", "Content": "I recently \"stayed\" here for a nearby wedding. The price was only $99 but it was worth about $39 even in Boston. I say \"stayed\" as we did not even stay over night but used it as a parking/changing station; it was too shabby to attempt to sleep in - and the windows were so old that the freezing winter air just rushed through them, no matter what. The room was very musty and moldy, everything was very old. I would say it was as *clean* as it could be but that cannot overcome the old, run down nature of the place. My friend and I said we would've stayed overnight if we were young again and had too much to drink at the wedding! ;) Instead, we just cut our losses and got out - it was just far too uncomfortable with the dinginess, old, old blankets and sheets and carpet, bad smell and insecure locks to contemplate getting a good night's sleep. As others have said, it is a good location and it is inexpensive, but it just wasn't worth it for us.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thornhill, Canada", "Title": "“Surprisingly pleased”", "Author": "aitche13", "ReviewID": "UR123316634", "Content": "I stayed at this hotel with some initial trepidation. I was on my own for three nights to see two Boston Red Sox games versus my team, the Toronto BlueJays. I was on my own because my wife was travelling in Peru at the time. The hotel was very convenient and low cost. It turned out to be excellent; clean, the people were very nice. I had trouble with my door card and they were very nice about it and rectified the situation as soon as possible. Highly recommend.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ithaca, New York, United States", "Title": "“Not bad”", "Author": "Retiredcrab", "ReviewID": "UR121037418", "Content": "Well it is not a palace but our room was very clean and comfortable. There was an awful odor in the hallway like someone got ill. Good point is that it is close to restaurants, drug and grocery stores. Only real complaint is that the heating unit was loud.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Woonsocket, Rhode Island", "Title": "“Tried and true”", "Author": "allen n", "ReviewID": "UR120966273", "Content": "We stayed at this Howard Johnsons-Fenway hotel a few years ago. This August we had the opportunity to visit Boston again to take in a baseball game. We figured that since the first visit went so well we would stay again at this Fenway location. We were not disappointed at this decision. We arrived a little early and we felt that maybe we would not be able to check in. This was not the case as the desk people were very accomodatiog and let us check in as well as park our car. This was very valuable time saved which enabled us to walk to the game in plenty of time. The accomodations were clean and the room was spacious. Having a restaurant on the premises, even though we were not able to take advantage of it, was handy. There was pleanty to do in the immediate area surrounding the motel, with restaurants, drink establishments, and night clubs. These were all within walking distance which saved moving the car. All in all, this is a great spot to stay if you are going to the ball game, or even if you wish to partake in any of the other entertainment spots. We will be coming back when the opportunity presents itself.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Not Bad at All”", "Author": "Ruarri", "ReviewID": "UR120381569", "Content": "Despite the plethora of poor reviews this hotel was pleasant and adequate. The accomodations were affordable and clean. The proximity to Fenway can't be beat! Sure, it's no five-star with monkey butlers, but it made our trip to Boston more economical.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Friendly faces”", "Author": "Nana F", "ReviewID": "UR120159980", "Content": "I make business trips at least one week out of every month and have been doing so for years. Thus I have many hotel experiences to compare with my stays at Howard Johnson Boston-Fenway Park. This hotel is an older one so the furnishings reflect its age. It does not have elevators so it is important to ask for a room on the bottom floor. I do not repeatedly go to this hotel for its appearance. I return because the staff members have been very friendly to me extending me courtesies such as a late check out time so I could take a conference call, ability to leave my luggage at the desk after I have checked out and offering me change for the vending machines. They recognize me when I return and seem genuinely glad to see me. There is a free van available which takes me to and from my work site. The rooms have a refrigerator and microwave oven at no extra cost. Bottled water is placed in my room without the usual $3.00 at other hotels. There are restaurants within walking distance, a little grocery store and of course the ball park. There is a restaurant within the hotel but I have never eaten there. Its appearance is drab but the conveniences and friendly personnel tip the scale for me and I keep coming back.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Very run down and dirty”", "Author": "Vinee S", "ReviewID": "UR119689283", "Content": "We checked into this hotel for two nights, luckily it was not more than that, There is no elevators so if we had heavy luggage im not sure what we would have done. Luckily the staff at the front was nice enough to give us a room on the ground floor. The hallways smelled so bad we had to cover our nose all the way to the room and even in the room there was a lingering odor. Beds were clean. Very noisy at night we could hear babies crying and doors slamming till the early morning.We requested a wake up call for 7am and never recieved one, luckily the alarm on my cell phone went off; other than that the staff is very friendly. They gave us free wifi-which didn't work. The chinese restaurant in the hotel is the best part about the hotel stay food is great! If your going to a red sox game i suppose staying here is worth it, but if your going to tour around Boston there is alot of better hotels that you could stay at!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Disgusting”", "Author": "J M", "ReviewID": "UR118846708", "Content": "\"Fleabag\" is the word that comes to mind. Strong smell of mold in the room (the clothes in my luggage still smell of it); Dirty, stained carpet and furniture (You can literally \"feel\" how dirty the carpet is under your bare feet..I kept my socks on after that); The blanket on one of the beds was actually sticky! Cracks in the ceiling, torn wallpaper, unfinished paint job in the bathroom. I thought of just turning around and walking out. But it was late, was only staying one night, and was not up to finding another hotel, and then fighting to get the charge for this dump off my credit card. To add insult to injury, they charge to park your car in their own lot. When I saw that on my bill, the clerk pointed to a sign the size of a postcard that said: \"Parking $20/night per car.\" Really? For $236 a night? I don't think so.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“disaster”", "Author": "Jon S", "ReviewID": "UR118635951", "Content": "There is no elevator, which makes impossible for carrying luggage. The place hasn't been renovated in decades and is downright nasty. The room smelled from a horrible musty/moldy odor. My baby developed a bad wheeze and is still wheezing over a week later. The furniture was all broken. The ceiling was aweful with cracks and black mold. There was a BLOOD SPOT on one of the pillow cases. The lighting in the room was terrible. I would never go there ever again and I would never recommend going to anyone else. NO ELEVATOR in the place. Not handicap or child friendly.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“College Tour Boston”", "Author": "jufi788", "ReviewID": "UR118548183", "Content": "In Boston for college tour. Only stayed one night. The room appeared clean on the surface. However when I opened the bedroom curtain the entire window frame and on the outside window sill was covered with rust and mold!!. The room was freezing because the air conditioner was on. I turned the air conditioner off but was unable to warm the room up inspite of the fact that the control indicated three settings-cold, normal and warm. The temperature control cover came off in my hand. The bath tub drain dislodged from the pressure of the water.", "Date": "September 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Southington, CT", "Title": "“Great location - Don't expect too much and you won't be disappointed”", "Author": "JackiKC", "ReviewID": "UR116765260", "Content": "I've stayed here in the past and although it's not \"dirty\", it's not very well kept up either. The only complaint we had was that one of the beds had a horrible, sticky-textured feel to it and the pillows weren't very comfortable so you may want to bring your own. The rooms were decent in size (2 double beds), the a/c was ok, TV in working condition, pool was out of service \"indefinitely\" and the restaurant below was pretty good - Asian food and they were open pretty late. You can't beat the location if you're coming in for a Red Sox game at Fenway, which is why we chose it and would probably choose it again unless someone opens up a nicer hotel in walking distance.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Peconic, New York", "Title": "“Location, location, location!!!!!!!”", "Author": "rob d", "ReviewID": "UR116680059", "Content": "We just returned from our annual trip to Fenway Park! For the last two years we have stayed at the Howard Johnson Inn....and will be back again and again! As avid Red Sox fans this is our Boston home-away-from-home. We arrived a bit early for check in (11am), but our room was ready. The hotel staff was extremely helpful and guided us to the local Kinkos to print our tickets for the game. We headed to Yawkey Way to begin our Fenway vacation. Oh, did I forget to mention that Fenway is adjacent to the hotel???? Yes, you get the idea....a room with a view. And what a view it is for Red Sox fans!! At around 3pm we went back to the hotel to freshen up and then merely had to walk through the parking lot to watch the players arrive for the game while our children hoped for autographs. After the game, no worries. A few steps and everyone was back at the hotel, tucked into the comfy beds with visions of Red Sox players dancing in their heads. Anyone who is a Red Sox fan needs to try the Howard Johnsons. As my husband says, \"Location, location, location!!\" You can't get any closer to Fenway. Although the hotel may appear a bit dated, the rooms are clean, everyone is very helpful, and the beds are comfy. There is also a pool and an attached Chinese restaurant. And, if you have ever been to Boston, you know parking is a concern. The hotel provides safe parking for only $20. per night!! Again, we would highly recommend the Boston Howard Johnson Inn at Fenway! It is definitely the place to go!! Remember, location, location, location!!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Halifax, Canada", "Title": "“A No-Brainer for Red Sox Fans”", "Author": "FourSunChasers", "ReviewID": "UR116662634", "Content": "We stayed at HoJo Fenway August 1st while in town for a Red Sox game. This is THE CLOSEST hotel to Fenway, and depending on the room you might even see the park from your window. It took us about 2 minutes to walk from the hotel to Fenway, and after the game, even with 35,000 fans leaving at the same time, it only took us 7 minutes to walk back. No traffic headaches, no hailing cabs, no subways to deal with. Check in/checkout were fast and the staff were most helpful, particularly the parking attendant. Speaking of parking, the HoJo's daily rate for parking is $20, which is about half of what it costs at other hotels in the area. Parking lot is well lit and secure. Don't judge a book by its cover. Although the decor did appear dated, the beds were clean and comfortable. Bathroom was clean, shower was always hot, with excellent water pressure. The room overall was clean, well maintained, and had all the amenities one would expect like A/C, hairdryer, coffee maker, room safe, etc. Don't pay attention to the negative reviews. Are there fancier hotels in the area? Yes, at double the cost and not as close to Fenway. Are there cheaper hotels? Yes, but they are nowhere near Fenway, so make sure you have lots of time before and after the game to deal with traffic or make transit connections. This was our first of many Red Sox games to come, and Howard Johnson Inn Fenway Park will always be our first choice. Hands down the greatest value in the best location for Red Sox Fans!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Houston", "Title": "“Don't Do It”", "Author": "LoneStartraveler", "ReviewID": "UR115979520", "Content": "Noise all early AM hours, hallways with odd over-air freshened odor, curtains falling down, stains on ceiling.....We hardily recommend spending more and staying elsewhere!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0"}, "AuthorLocation": "gabsbren", "Title": "“Hotel should be condemned”", "Author": "gabsbren", "ReviewID": "UR115714907", "Content": "This Ho-Jos is dirty, and very old and smelly. I would not every stay there. I was very disappointed. I took my son their for a game at Fenway and we just wanted a place to put our heads after the game. However, the place was so gross that we decided to drive 2.5 hours home in the middle of the night then to stay in the FLEE BAG HOTEL. Also, it was 90 degrees that day and the POOL IS CLOSED FOREVER!! This is my first FLEE BAG HOTEL. Do not stay here.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Dartmouth, Massachusetts", "Title": "“Overall best place to stay in Boston”", "Author": "thebearstoo", "ReviewID": "UR115669757", "Content": "We have stayed in just about every hotel Boston has to offer and we keep coming back to the HOJO at Fenway. If you are planning a stay in Boston, for the price and location it cannot be beat. Just steps from Fenway park and all that Red Sox Nation has to offer it is also convenient to restaurants and great night life. Take a left out of the parking lot and in a short and safe walk one can be in Back Bay and world famous Newbury Street. In addition, a right out of the parking lot leads one to the Longwood Medical area with world renowned health care. The staff is very courteous and friendly. There have been times when we forgot some needed toiletries and the front desk was more than accomidating....at no charge might I add. The rooms are comfortable and clean and I would be hard pressed to find a shower with better water pressure!!! Finally, some would say the hotel is in need of an update. I prefer to call the lobby retro. I love the open staircase to the second floor. I also feel comfortable knowing that the parking lot is well patroled . In addition they offer a very family friendly pool area that is not only well kept but protected from the general public. All in all we love it at the Fenway HOJO and they will definately see us again next time we are in Boston!!!!", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "GMLsoxfan", "Title": "“Our favorite Fenway Park Hotel!!”", "Author": "GMLsoxfan", "ReviewID": "UR115504279", "Content": "My boyfriend and I go to a few games a year at Fenway and we absolutely love staying here at the Howard Johnson's Fenway! It is so close to the ballpark you can actually smell the hot dogs and sausages as soon as you go out the door!! This past trip 7/7,7/8 and 7/9, we were lucky enough to stay in the room where part of the movie \"The Town\" with Ben Affleck was filmed! A great view of the street where most of the players arrive and leave from, so we got to see many of the players right from our room!! The hotel is older, but it is clean and everyone is very gracious and helpful. It was very warm while we were there and the A/C didn't seem to keep up with the hot temps, so they brought us a fan which was great!! They provide everything you could need for your stay and are always willing to provide extra towels or coffee or whatever else you may need. Another great feature is the price for parking!!! It is only $20 per night! It would cost much more if you went to a lot to park for the ballgame! And we really like the Hong Kong Cafe that is located on the premises! The food is great and they are always open late after the ballgames! So needless to say it is my first choice when I come down to Boston especially for a Red Sox Game at Fenway!! Can't beat the location or the price!!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Easthampton, Massachusetts, USA", "Title": "“Great trip, would definitely stay again.”", "Author": "DonnaD29", "ReviewID": "UR115355365", "Content": "Howard Johnson Inn was very accomodating. We arrived early because of the Bruins parade this day and the hotel provided us with parking for a very reasonable fee. The time of the Red Sox game that we were there for had been changed and we decided to go to the parade. The hotel property is nice. They have an outdoor pool (we did not use) and restaurant. The breakfast that we had the next morning was very good and the gentleman that was working there did it all. He seated us, took our order and served our food. We were within walking distance to everything that we were interested in going to (Fenway Park is literally just around the corener). The hotel was in a great location and very easy to get to. The staff was very pleasant and willing to accomodate our needs. The room was nice, simple but nice. Nothing fancy. The room was clean the beds were comfortable and that was all that we really needed it to be. Would definitely stay at this Howard Johnson's again.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Marstons Mills, Massachusetts", "Title": "“A pit- don't stay here!”", "Author": "piris", "ReviewID": "UR115303986", "Content": "Old, worn, dirty, noisy- not worth the low cost! We stayed here because it is so close to Fenway, but decided that it is worth the longer walk and higher cost to stay in a good hotel at Copley Square.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "St. Catharines", "Title": "“Another Awesome Stay At Howard Johnson's Fenway Is In The Books!”", "Author": "CdnSoxBruinsFan", "ReviewID": "UR115290009", "Content": "I live in Canada and am a lifelong Bruins & Red Sox fan. I have been to Boston many times to see both teams play & have stayed at this hotel for each trip. The Howard Johnson Fenway is the only hotel in Boston I have ever stayed in. To be honest, it is the only hotel we need to stay in. This past trip was perfect. We went to a Red Sox game on Sunday night and then went to a Bruins playoff game on Monday night. It couldn't have worked out any better since both teams won. Both venues were very easy to get to with the hotel being next door to Fenway Park & the TD Garden being just a short subway ride away. The staff is always kind, courteous & very helpful. I have become such a loyal & returning custumer that the front desk staff even recognizes me at check in. That is a good feeling. A special thanks to Franny, Beverly, Kevin, Rich & Lisa for there continued excellent front desk service. Also to Mr. Doucette ( the hotel manager) for always going out of his way to make sure me and my family are well taken care of. Although it is an older building, it is a more than adequate place to stay with fair prices. It is not the Ritz, so don't expect the Ritz! There are plenty of other hotels in the area that charge $500 a night if that is what you are looking for. Although the rooms are not flashy & won't knock your socks off, they are always clean & the bathrooms have everything you need. Housekeeping does a very good job and work hard to keep the rooms & the building clean. I think they deserve credit for the job that they do. I will admit one thing though, do not eat at the Chinese Restaurant on the first floor. The food and the service is terrible. You will not find a better location in Boston for a hotel than this one. It is literally next door to Fenway Park. What more can you ask for? Even if you are not a baseball fan, the location is still amazing as it is right in the heart of Boston's beautiful Back Bay area. There is plenty of nice restaurants, shopping, drugstores, liquor store, Dominos Pizza all within walking distance. Also, downtown Boston is just a 5 minute subway ride away. You are in close proximity to everything you need while at the Howard Johnson's Fenway. I will continue to make the Howard Johnson's Fenway my first choice of hotels for my future visits to Boston and highly recommend it to anybody else visiting Boston for any occasion. Thank you Howard Johnson Fenway for always keeping me & my family in good hands. See you next time!!", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Saint-Felicien, Canada", "Title": "“Well located”", "Author": "DanielB1965", "ReviewID": "UR115287096", "Content": "I've been to Boston 4 times and the last 3 times I stayed at Howard Johnson. Last time I went was in May for Game 7 of the Bruins-Tampa series. A short walk + the subway takes you straight to TD Garden. Usually I go to Boston for baseball (I'm returning in August). This hotel has the perfect spot. It is 1 minute walk from Fenway Park. Basically, you go attend the game and come back to the hotel to see the after game show on TV. Around the hotel, you have everything you need: grocery store, beer store, restaurants, drugstore, .... and the Prudential centre is 20 minutes away walking. The hotel itself is not new but it is clean. It is more than OK for me. The area is quiet at night. You should sleep good.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“No,No,No ....”", "Author": "b0b5", "ReviewID": "UR115281946", "Content": "If you would like a bad trip back to 1978 this is the place to stay. The smoking rooms of that era are now the non smoking rooms of 2011. No reno...the pillow smell of smoke not to mention the black mung that hangs from the air vent in the bathroom. The cleaning staff is working overtime to clean a building that is falling apart. The front desk staff scream at family over the phone at all hours of the day. The poor maint guy is run ragged by a front desk crang who shouts demands from her chair. The hotel chain has obviously not had a visit from anyone from head office in years..they have no idea the state of their hotel next door to Fenway. what could be a landmark hotel in a beautiful city is slowly running itself into the ground. The manager probably makes more money parking ball gamers cars in his lot on game night than actual room renters so he is not worried...why fix his cash cow? Cudos to the cleaning staff...these ladies have their work cut out for them...", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicoutimi, Canada", "Title": "“Great hotel in fenway`s backyard!!!! The place to stay”", "Author": "andre4415", "ReviewID": "UR115257306", "Content": "Hi I`ve been staying at this hotel in Boston for the past 5 years and the location is simply amazing. If you go to Boston for a sports trip or simply to be within walking distance from almost everything in Beantown, that is the place to stay. Many rooms have a fridge and an oven so you can stack up all you want from the nearby Shaw`s grocery store. You only have to walk 8 minutes to get to the place. There is also the always convenient garage a block away. I had my car repared there last year and I was glad it was so close. There is also 2 drugstores and a bar with a terrace right next to the hotel. If you want to go and visit TD garden, you are only 60 minutes away by foot. The nearby subway station is also within walking distance of the hotel. The staff is always ready to help. Last time I was there (the famous bruins lightning game 7), we arrived early and they gladly gave us our room right away. There is also a parking that is available for 20 dollars a night. The Chinese restaurant next door also offers a great breakfast. The rooms are clean and of good size too. The bedrooms are convenient and clean as well. It is usually quiet whatever room you have. Of course, there may be occasions where some neighbours are noisier than usual but it can happen at any other hotel. I definitely recommend this hotel to anyone going to Boston whether for the Bosox or simply to enjoy a great walk in downtown Boston. You are 10 minutes away from Boylston and Newbury street as well. So overall, this Howard Johnson hotel is a great location to stay at and is worth going to.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Rude staff, terrible rooms, and a parking fee. Oh my!”", "Author": "shiningetoile", "ReviewID": "UR115133718", "Content": "My family of four and decided to stay here because of it's proximity to Boston University (we were on a college road trip) and unfortunately, it was the biggest mistake of our entire journey. Right off the bat, the woman at reception was extremely rude and uncourteous when we asked her if there really was a parking fee. She responded by rolling her eyes and accusing of us being ignorant, as \"every hotel in the city charges for parking.\" NOTE: there IS a parking fee, even though you're paying for your room!! Moreover, the rooms are dingy. We only stayed one night and were able to tolerate it, this hotel is not at all worth the price, which is inflated because it's proximity to Fenway Park. Literally, a two minute walk. If, however, you are looking for an expensive place to stay that treats customers like trash, then by all means book a room at the HoJo Fenway! They will be more than happy to ignore and look condescendingly upon you!", "Date": "July 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Cottekill, NY", "Title": "“Desperate Need of Renovation”", "Author": "REALGrunge", "ReviewID": "UR112472965", "Content": "I stayed at this hotel because the hotel I usually stay at on Copley Square was fully booked. I figured, how can you go wrong with Howard Johnson's? Well, you can. I have read quite a few of the other reviews and they either describe this hotel as a roach infested rat hole or fabulously inexpensive gem. It falls somewhere in the middle: The halls smell like stale smoke and pine cleaners, the windows had rust around them and no screens. The A/C was wonky and didnâ€™t really cool the room off and the room had a funky smell to it. The bathroom was pretty clean, but the sink had a spider web crack in it. The Wi-Fi did not work and I had to log on with wi-fi from Childrenâ€™s Hospital Boston. There was, however, a coffee maker, fridge and cable TV. This might be the best cheap affordable hotel for you if you're going to go watch a Boston Red Sox game. Overall, this is a very old hotel in desperate need of a major renovation. However, it would probably be cheaper to just raze the building and build a new modern hotel on the spot.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Montreal", "Title": "“Great location, hotel just okay!”", "Author": "MontrealBobby", "ReviewID": "UR111204726", "Content": "Went to Boston to see a Sox's game and could not have been any closer. Hotel staff were very friendly and tried thier best to please us. They even found us a fan for the room, don't think the ac works. The room was dated and in need of renovations but clean and comfortable. The windows are a security concern, especially on the first floor. As for the attached Hong Kong restaurant that everyone seems to rave about, go some where else. I only had breakfast there but it was terrible. My stack of pancakes, 3 small silver dollar size, were frozen microwavable type that somehow were still served cold. The one person serving and cooking seemed to be bothered by us, should have know something was up when I entered the empty restaurant.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "yes", "Title": "“worst place in Boston”", "Author": "tomuchtraveling", "ReviewID": "UR105259924", "Content": "rooms smelled like smoke & mold, bathroom really dirty, windows don't close, window treatment covered with mold, lights dim, service terrible, lobby looks shappy", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Goose Creek, South Carolina", "Title": "“Great value”", "Author": "navywrslr", "ReviewID": "UR104671569", "Content": "I was worried by some of the commentd made about this hotel,but I found them to be baseless. For its classification,it is a fantastic value with great service and location. I was in Boston to run the marathon,and the hotel is with in wlaking distance of the expo,and all other race activities. Its right behind FENWAY PARK,but I was never bothered or hear any noise from the games that were being played. This is not a luxury hotel,and if you are expecting that,you will not be happy. But for its rating,the room was large,clean and the bed comfortable. It had a coffee maker and fridge,and cable tv. If your trying to save money,this is the place to stay. The Chinese Restarant attached to the hotel served really good food,and alot of it. If I get the change to run Boston again I will bestaying here.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dalton, Massachusetts", "Title": "“Boston Trip”", "Author": "bdouglas1", "ReviewID": "UR94746542", "Content": "I had to bring my husband to the Bringham and Women's Hospital. I would recommend this hotel to everyone. It was clean and the people there were very helpful. The shuttle brought me back and forth to the hospital. It was great. The restaurant there had good food. There prices were reasonable compared to other hotels. Not fancy but comfortable and clean. The rooms were nice. Fenway park was right behind it. You couldn't ask for anymore then that. Thanks staff you were great.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Rothesay, Canada", "Title": "“One purpose only!”", "Author": "ERCam", "ReviewID": "UR91866106", "Content": "This hotel is legendary. If any guy in Atlantic Canada makes a pilgramage to Red Sox Nation this is the hotel to go to. For all you other folks who are looking for a hotel in Boston be prepared and accept the realization and purpose of this place, \"in baseball season\". The price is too high but LOCATION..... If you stay outside of ball season, then beware of the price you pay for these accomadations. When we arrived my wife would not stay. I quickly got on line to HOTWIRE and got her a 4 star ( the Inter Continental downtown) for $142 /night. The guys and I were paying $187 / room / night here.........We loved it! She loved it, everyone was happy!", "Date": "January 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "elmira, ny", "Title": "“awful”", "Author": "jeaniegirl", "ReviewID": "UR81979928", "Content": "The carpets were stained in the hallways, there was no elevator, and when we arrived (3 adults) they gave me a room with one bed in it. When I called down to ask for a different room i was told, \"Well that's the room they assigned you. \" Really? The vending machines didn't work. The thermastat had two functions, blasting ice cold air or off. The only good thing about it........it is across from Fenway Park.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Good hotel”", "Author": "ilovetotravel5", "ReviewID": "UR81635584", "Content": "This is a good hotel. Clean, not too noisy (there was noise during our trip but people were talking in the corridors). We went to Boston for 2 days and could walk back home at night, it is only 20 minutes from the Prudential center. It is also well connected to the T. It was expensive but all hotels in the city seemed expensive. Would recommend although it is only a place to sleep;-)", "Date": "September 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bridgeport, Connecticut", "Title": "“Watch out for additional fees”", "Author": "TommyT12", "ReviewID": "UR77811175", "Content": "Upon arriving at the hotel we were informed that parking was an extra $20 per vehicle, per night. We had brought 2 cars as one member of our party was splitting off. No where was it listed that parking was not included, and thats unacceptable. We got into our room and the whole place smelled of cigarette smoke, despite being a non-smoking room. The windows had rust around them, and the AC vent looked like it was about to fall off. in addition, every time the AC kicked on it sounded like a small jet had just landed making it hard to stay asleep for the light sleeper. If you aren't going to Fenway (which is right behind the hotel), this place isn't worth it. Go deeper into boston, pay the extra $50 bucks for a night, and get a better stay. After parking fees it won't be that much of a price difference.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "wallingford, connecticut", "Title": "“Awesome again!!!!!!!”", "Author": "baseballfan72", "ReviewID": "UR76214774", "Content": "We stayed at the Howard Johnson on a friday night on our way to Maine for vacation. We spent the day in Boston. The Howard Johnson people were helpful and friendly to us during our stay. The hotel is close to the subway line and it is right in the heart of Fenway. We previously stayed here once before last september for a Red Sox game and we had an equally awesome experience... I'd recommend this place to anyone.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Malmesbury, United Kingdom", "Title": "“Worst place I've ever stayed!”", "Author": "Jackalak", "ReviewID": "UR74406837", "Content": "Rooms booked in order to be close to Fenway and at $220.00 a night you'd expect it to be at least clean......not a chance. The rooms smelled of mold and moisture, you couldn't open the windows and the a/c barely existed. It was not very pleasant. The public transportation system is quite good in Boston so there really is no reason for anyone to stay in this Holiday Inn.....you can get where you need to go for a reasonable price and quickly. This place sucked!", "Date": "August 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vermont", "Title": "“Close to hospitals - good medical discount rate”", "Author": "risabenny", "ReviewID": "UR73586995", "Content": "The rooms were small, the bathroom was old and there was no hot water, lukewarm showers. The beds were made for little kids height, they were maybe 6 inches off the floor and the sheets didn't even reach the top of the mattress. Very firm mattresses that hardly moved when you sat on them. The main restaurant was chinese food although they did serve breakfast. Breakfast was served by one man only who was the seater, the order taker, the cook, the bill giver. VERY POOR SERVICE, the waffles came out of an Aunt Jemimia Box!!. The only good thing about it is the \"free\" shuttle to the hospital, course you are required to tip the driver, so its not really FREE. and it doesn't run between 2pm and 6pm so you need to stay put or find a different way back to the hotel.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Catharines", "Title": "“The location of this hotel is second to none!”", "Author": "CdnSoxBruinsFan", "ReviewID": "UR73254481", "Content": "I live in Canada and have been coming to Boston since 1992 to watch the Bruins and the Red Sox. I have faithfully stayed at the Howard Johnson's Fenway for each of my visits. I have become such a regular customer the some of the front desk staff know me by name. Although it is an older building and the accomodations are average, the pros out weight the cons in deciding to stay at this hotel. While I wouldn't spend my honeymoon here, there are certainly other perks to this hotel that make it more the adequate enough to stay in. The location of the hotel is second to none. It is in a prime spot right across the street from Fenway Park. There are also all kinds of nice restaurants within walking distance and downtown Boston is just a 5 minute subway ride away. You are in close proximity to everything you need at this hotel. The staff here has always treated me very well including the general manager Ron Doucette. My wife & I brought our 5 year old on our last visit for his first trip to Boston. As I am familiar with all the room types, I reserved a room that has a dvd player. When we checked in, we noticed that there was no dvd player in the room. Within 5 minutes of speaking to the general manager, we had a custodian knocking on our door with a dvd player in his hands. He set it up for us and everything. They really went beyond the call of duty to make sure our needs were meet. There is also a lifeguard on duty at the pool which is an added bonus if you are bringing children. I read a review of a parking issue someone had. I have never been asked to park my car in the back to accomodate Red Sox parking for which they charge $40 on game night. I pay my $20/night and my car stays in the front until we go home. I will continue to make Howard Johnson's Fenway my choice of hotel for my future visits and have no problem with recommending it to anybody else.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Holbox Island, Mexico", "Title": "“Best experience and best staff anywhere.”", "Author": "FromCapeCod", "ReviewID": "UR73016625", "Content": "Travelers to Boston, Red Sox Fans, and Visitors to New England, my wife and I have discovered a gem of a motel in Back Bay. The Howard Johnson Motel on Brookline Avenue is our destination whenever we travel to Boston from our home on Cape Cod. We have always found the Motel clean, our room clean and the amenities just fine. The most telling fact is that EVERYONE who works there are just WONDERFUL, HELPFUL, and COURTEOUS. The front desk is always staffed with friendly, knowledgeable, helpful, personalities. Fran and Kevin greet us most of the time and I cannot say enough about them: hardworking for your successful stay, helpful with your plans to visit Boston, and swift whenever a difficulty arises. This is not a POSH, high style, high maintenance, blue blood type of place. Nearby is such a place that increases its rate to over $500 per night on game nights and the help donâ€™t move their lips when they, â€œWelcome to Baahston.â€� HO JO is just simply a great place to stay. Next door is the new Jerry Remy Sportsbar. Across the street is another pub where you can get delicious pub food at very reasonable prices. Our favorite is to walk to the Longhorn and get Floâ€™s Fillet with onion strings. We arrive, park our car, check-in, relax, walk to the Longhorn, then, walk to the ballgame in Fenway. We donâ€™t have to drive back to the Cape, or, if it rains, we go back to HO JO and then can watch the rest of the game on TV. Oh, by the way, you can watch what ever you want until you hear the crowd, turn back to the TV to see what happened. You see it happen because there is an 8-10 second delay in the broadcast. More fun is to arrive earlier in the day or the night before and get out before the game when the players arrive at the park. You see them arrive, see amazing wheels that they drive, and they wave and chat with the small crowd there long before the game crowd arrives. Boston Back Bay museums, stores on Newbury Street, Prudential Towers, Copley Square all are within short walking distance from this inexpensive motel in one of the most charming cities in the US. Jump on the â€œTâ€� and all of Boston is there for you. My wife, the Red Sox fan, had the opportunity to help one of the Boston pitchers sort out World Series tickets for his family who were staying there. Pretty neat place. PS: It is pet friendly!!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Stephen, Canada", "Title": "“Location Location Location”", "Author": "DBriz", "ReviewID": "UR72904472", "Content": "If you are going to Boston to catch a Red Sox game then this is the place to stay. The rear parking lot faces Fenway Park so if you are unfortunate enough to not get tickets to a game you can still hear the roar of the crowd! This was our third stay at this hotel because of it's proximity to Fenway. It is also just a short walk to the subway. It has a chinese restaurant on site that serves delicious teryaki beef, or you can go directly across the street to 'The Baseball Tavern'. It's claim to fame is a mini replica of Fenway Park on the roof where you can enjoy pub food and beverages. There is also a beer store very close as well as two drustores, a pizza joint and the very new 'Jerry Remy's' restaurant. Yawkey Way is around the corner so you can participate in the pre/post game excitement. Although not new, the rooms are clean, the staff are friendly and the price is right! We will return again and again.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint John, Canada", "Title": "“What a Location !!!”", "Author": "Marlie506", "ReviewID": "UR72869932", "Content": "Hi i just want to give a little feed back on my recent stay at Howard Johnson Inn Fenway Park Boston. First off like alot of people out there im a pretty big sox fan.. this location is the greatest for such a person.. The Ball park is literally in your back yard.. parking is very affordable,.room service and front desk very efficient and helpful. to tell you the truth i base my traveling to Boston on if i can get a room at this hotel.. hope this helps you with making your choice...", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canada, Kentucky", "Title": "“They were the Best”", "Author": "Wendy39254", "ReviewID": "UR72775524", "Content": "I booked my rooms by telephone, due to our daughter expecting her baby. We knew that we would need to be near her and her husband, and the birthing house. I was extemely happy with the fact that the staff was quick to tell me due to my daughter having a child, all I needed to do was obtain a letter from the birthing house, and the rate was cut in half. This allowed us extra time to stay in Boston with her and the new wee one. Upon our return to the hotel that evening, we were asked how everyone was, and if we had pics of the baby. I have never had a front clerk take any interest in the highlights of my life. I had a whole weekend of clerks asking to see pics and how the new family was doing. The staff at this hotel is extremely friendly and kind. When we arrived at our room, we found that, of course, we needed extra pillows. We made a quick call and they were delivered in minutes............literally minutes. Bravo to housekeeping. The room looked out over the pool (of which my hubby enjoyed immensely). The room was clean and there were plenty of clean towels, etc. As well, when we left the room the next morning, the room was made up perfectly for us upon our return. Clean towells, extra pillows, fresh soap, shampoo, etc. While being older, the room was very clean and I slept quite well. There is a restuarant in the Hotel, if you like Chinese. This would be the only thing that I would say I would change. There was not enough options on the menu. While having said that, there are tons of excellect restuarants very close by. My husband is Scottish, so food is very important. Overall our experience was very satisfying. While I recongize I will never get that room at that rate again, until I become a grand mother again, I would definately recommend this hotel to anyone who is looking for accomodations in this area. I have spent a lot of money to be treated badly at high end hotels. This is a small hotel, located by Fenway Park, with the best staff I have ever encountered. They were pleasant and very easy to deal with. The room was clean and spacious and the pool area was as well. I might also note that there was a life guard on duty, which would be great if you have kids at the hotel. I will be returning to Boston to see my grandson and I will definately be returning to this hotel.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, FL", "Title": "“PAX East 2010, great time.”", "Author": "Johnny1986", "ReviewID": "UR71672247", "Content": "I stayed here with my friend so we could attend PAX East, it was only a 15 minute walk to PAX and only 10 minutes to the subway. Conveniently located across from a Domino's Pizza and there is a Subway's deli nearby as well. There was Rite Aid next door which saved my food budget since the McDonald's was demolished. There is no longer a McDonald's across the street, from the hotel, Google Maps is outdated. It is now an empty parking lot. The room was clean, had wifi,a mini refrigerator, a microwave, heating lamps in the bathroom, clean towels, and basic television. Friendly check in staff. A great stay, shame PAX East is moving to another center or I'd stay here again next year.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great place to stay on a fun trip.”", "Author": "StaceyAnnL", "ReviewID": "UR69976229", "Content": "It's well maintained, and clean. Nothing fancy, but the price reflects that nicely. Wonderful location, and great staff. I would definitely stay here again. Just make sure you know whereabouts on Boylston you're aiming for.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Massachusetts", "Title": "“Any place is nicer than this gross, not too safe dump”", "Author": "Redsxlvr", "ReviewID": "UR69926703", "Content": "Security nightmare! windows on first floor are a mix of plexiglass and glass. Not secure at all. The exterior doors to the property are not secured at night. There is direct access to the entire hotel from right off the street- anyone can get in without a swipe card. The room was in need of a major renovation, torn wallpaper in bathroom and bedroom, pipes banged during a shower and made a terrible screeching sound so bad it woke up my teenage son. Room had a funky smell to it, we went to CVS next door and bought an air freshener. Asked for a cot upon reservation and upon check in. Was told one would be sent and it never showed up. No air conditioning the 2nd night and no fans were available. Temp in the room reached 90 degrees. The hotel gave us 20/night for the lack of ac but that wasn't nearly enough to compensate for the miserable situation. Phone had 2 messages on it that weren't for me and wouldn't clear out of the system so I didn't know if someone had left me a message without listening to the two other messages for the previous occupant. not a big deal but just one more annoyance. Checked several times before arriving at the hotel and each time told they couldn't find my reservation. Spent hours on the phone getting it straightened out only to call the next time and be told again 'we're switching our system\" and they can't find my reservation. Was charged $20 a night to park the car which I knew about ahead of time-what they don't tell you is that if the Red Sox are in town the hotel guests have to park way in the back so they can charge people wanting Red Sox parking $40 each. Lucky guests end up having to walk all the way from the back of the property to get back to the hotel. No bellmen so be prepared to carry your own bags. We were there as part of a wedding party. if we were there just by ourselves I would have never checked in and would have found another hotel to stay at. Front desk were not friendly and had a care less attitude. I wouldn't even let my teenagers walk down the hall by themselves to the vending machine for fear for their safety. If you are looking for quiet, safe hotel than look elseware. The only thing this hotel has going for it is that it is close to Fenway park.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Durham, North Carolina", "Title": "“AWFUL SERVICE”", "Author": "Kaiacali", "ReviewID": "UR69921256", "Content": "My husband and I just got back from spending 3 nights at this HoJo's near Fenway. We were part of a wedding group who booked a total of 10 rooms. During our first night there, the A/C stopped working. I got up around 2am to adjust the thermostat only to find that it was all the way down to 60 yet the reading was 87 degrees. They next day we mentioned it to the woman at the front desk who mumbled to me \"glad my shift is over soon\". She said they were working on the problem and it should be fixed. The next night (wedding night) we got home at midnight to find that the A/C STILL was NOT FIXED. We spent another miserable night in a 89 degree room. The next morning AGAIN we were told they were \"fixing it\". We shouldn't have listened. They are all a bunch of jerks who blew hot air up our \"you know what\". That night after getting back from the fourth of July fireworks at 11:30pm the room was still sweltering. We went to the front desk and the woman tossed a key at me and said \"see if this one is working\" The man behind me in line said good luck as he was moved to another room and that A/C wasn't working either. Not to our surprise, the new room didn't have A/C either so I gave up and we went and slept at my cousins condo in another section of town. The next morning when all of us were checking out, the front desk wanted to charge us FULL PRICE!!! We all (including other guests who were outraged) said NO WAY. They argued with us until we finally had to just leave and dispute the charges with our CC companies. This is a terrible place, with terrible service. I have never been treated so bad by a hotel for whom I WAS the guest. It was completely ridiculous and unprofessional. DO NOT waste your money.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“For a Sox game the location could not be better!”", "Author": "SURFSUP1011", "ReviewID": "UR68237023", "Content": "We were in Boston for my 30th Birthday, I brought 4 friends and my girlfriend. For what we paid the closest hotel in price was the Holiday inn, for double the cost per night. If you want the Ritz, pay for it. You get a room (outdated but clean), outside pool and great staff. We walked almost everyplace.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“A terrific spot near Fenway Park”", "Author": "John-in-Monument", "ReviewID": "UR65852748", "Content": "It's an old HoJo's and and could use some touch-up BUT staff and location were wonderful. It's located : a 3 minute walk from the gates at Fenway; in the midst of a vast selection of night spots; 7 minutes from the T at Kenmore Square. Front desk staff friendly over the phone, and really helpful in person . They quickly arranged airport cabs and answered local area questions. Rooms were comfortable, clean, and quiet. Service staff quickly responded to a bathroom problem (my fault). On-site Chinese restaurant was good. The bartender got us dinner for 6 at 1am on Saturday with a smile on his face and a friendly word. Book early because it fills quickly, especially during graduations and Red Sox home games. Room rates are very reasonable for all its benefits.", "Date": "May 30, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Exceptional Customer Care”", "Author": "BrahmsMonet", "ReviewID": "UR65705561", "Content": "The Manager of the Howard Johnson Fenway; as well, the Assistant to Robert Sage of Sage Hotels Ingrid Tapia have bent over backwards trying to accomodate my return visit. My October 2009 one night visit didn't go well. Since then I have been offered a free night when possible by the management. Sadly, my two attempts to return I have had to cancel. I regret that very much. The management leadership could not have been nicer to me ! David D. of Philadelphia", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "1", "Sleep Quality": "2", "Rooms": "5", "Location": "2"}, "AuthorLocation": "sharpsburg", "Title": "“very hard to find but very nice”", "Author": "grantmd403", "ReviewID": "UR63368366", "Content": "the hotel guide said there was an exit for the street where the hotel was, it wasn't there. after getting lost all over the city found it. once there I was pleasently surprised to see fenway park for a game. the A/C did not work too well and the pool was unavailable but nice otherwise, friendly staff and a view that can't be beat. I would reccommend this hotel if you like the sox! the parking isn't as bad as they say.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kinsman, Ohio", "Title": "“The staff members were not only very helpful in everything they assisted me in they were also courteous and friendly!”", "Author": "jpdnld", "ReviewID": "UR63017949", "Content": "In our previous 3 visits my wife and children have found the best in service with everything connected to running a first class hotel. As soon as I pulled into the parking area and went to the front desk an employee said he would obtain a parking space . It was relatively late and I somewhat expected parking to be a problem but it was not. My spot was obtained efficiently and rapidly and I was checked in a minute or two. Everyone was very helpful. My room was spotless and smelled very nice..Housekeepers did a spotless job of preparing my room for the second night. Even though I was there for leisure the room was arranged so that I could have done business paperwork and other work related jobs as necessary. The second night I went into the lounge for a drink and the service provided was excellent. The hostess found time for smalltalk even though she was quite busy. I did not eat at the restaurant this time but have enjoyed their food in the past and was always quite satisfied in both the quality and the quantity of the food and the service provided. My family and I like the location of the hotel. We are usually there for the Boston Marathon but find the location of the hotel ideal for sightseeing, shopping and dining. And of course the hotel is very close to the home of the Red Sox .The baseball fans are always friendly to everyone . When I was departing after the marathon the people at the desk gave me instructions on how to hook up to the turnpike, thanked me for visiting and staying at Howard Johnson and wished me a safe trip back to Ohio. In conclusion I would say everything about my stay at Fenway Howard Johnson was positive and I would highly recommend it for travelers to Boston!", "Date": "May 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Qc", "Title": "“An affordable stay in Boston- can't be beat.”", "Author": "Canadian_girl98", "ReviewID": "UR60108348", "Content": "I booked at the HoJo Fenway mainly because of the price and distance from the Hynes Convention Center (we were in town for PAXEast2010). Parking is half the price of parking at every other hotel in town. It's a 10 minute walk to the Copely area. There are nice bars right next door, as well as fast food joints and 2 pharmacies. I've read other reviews about noise complaints, and have to say that I had no problems with noises. Not to mention you get hallway noises at any hotel whether it be 2 or 5 star. The bathroom was extremely clean, they clearly have a great cleaning staff. We have no complaints about the hotel. Great location, great price, free wi-fi, clean rooms. The night staff were very friendly. If you can get a room at the rate that I did- 100$ a night, then book it! Also, the wi-fi connection was a good one. I've had experiences where the free wi-fi is slow and that wasn't the case. I hope to stay there again on my next trip to Boston.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Rittman, Ohio", "Title": "“Prime Location & Service .... Not So Sure About the Rest ...”", "Author": "soyduck", "ReviewID": "UR59899249", "Content": "My husband & two of our friends shared a room on the weekend of the Penny Arcade Expo in March of 2010. I booked this hotel because of the great price & reviews I'd read here on Trip Advisor. Most people attending the convention chose to book the hotels closer to the Hynes Convention Center, but a walk has never bothered us, and the price spoke for itself. When we arrived Thursday night, we found a parking spot (which is $20 a day, a good rate for Boston) and checked out our room before strolling about town. Before you even get to the room, the hallway is pretty narrow & just dirty looking. Not like you're gonna step in a puddle or something, but it looks OLD & worn. The room .. *shrug* None of the decor matched, there were old stains/bleach marks on the bedspread ... and a very questionable stain dribbling down the curtain which wasn't noticed til later ... but I digress. We came back to our room for a good night's sleep before the convention and kind of got one. The walls were extremely thin, and being that the hotel is on a busy intersection, lots of revelers were outside and even someone just walking down the hall could be heard. There was no way to turn on a fan or some kind of noise making device to drown this out. The beds were okay. It definitely felt good to get into my own bed when we got home, though. When any of us tried to take a shower, the bathroom didn't have a fan either ... it just had this red light contraption that is supposed to dry out the room, but it really just made it feel like I was in a lizard tank. The bathroom was fine though, no other complaints. The location was very good, literally right in front of Fenway Park. We were about a 15 minute walk from Hynes Convention Center, which was the perfect amount of time to enjoy a good view of Boston and find some great restaurants, which are either direction you leave the hotel. The people at the front desk were very helpful in restaurant guiding, and also supplied me with two band-aids. Checkout time was noon, which is always nice to have a later checkout. We really had no real problems at the hotel, just a general feeling of cheapness. But we got a great deal, and Boston is a beautiful city. Given the relatively cheap parking and free WiFi, I would consider staying here again but maybe only with my husband - our friend's snoring was too much too handle in a room that didn't offer a fan to drown it out!", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Coral", "Title": "“Home away from home”", "Author": "stockzCapeCoral", "ReviewID": "UR59874708", "Content": "This is my fourth visit to The Howard Johnson Inn at Fenway Park in Boston. Each time my stay has been comfortable and without stress because of the friendly personnel and the amenities provided. The desk staff is always welcoming and very service oriented. They make it their business to treat me like one of the family by advising me on the best restaurants in the area, printing out boarding passes for my return to Florida, supplying any toiletries which I have forgotten. For example, the airline security staff took away my toothpaste, and the desk clerk, seeing they had none on hand at the moment, went to the store and bought me some. The decor and furnishings are not the newest, but the cleanliness of the hotel can be favorably compared to any of the area. Since I travel to Boston for very brief stays, a good night's sleep is extremely important. The comfort of the mattress and the lack of interruptions and loud noise put me in dreamland almost the minute I hit the pillow. The Howard Johnson Inn is in a prime location for my purpose. It is convenient to Fenway Park, and a variety of restaurants, including the Chinese restaurant in the hotel itself.. Shuttle service to nearby hospitals is available at no extra cost. At the end of each visit, I have felt very refreshed, satisfied with the value received, and pleased with the service provided by friendly and helpful staff members. Already I have put in a reservation for my next visit to Boston.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bedford MA", "Title": "“Great Location, Great Value”", "Author": "KathyTBedfordMA", "ReviewID": "UR58834035", "Content": "This is our second time staying at the Fenway Howard Johnsons. We found the checkin staff extremely friendly and helpful. The rooms were clean and roomy. You can't beat the location. The restaurant is yummy, the entertainment in the Tiki Lounge was great. We were there when Dirty Vibrato was playing. We will definitely return again!", "Date": "March 17, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "4"}, "AuthorLocation": "Evansville, IN", "Title": "“Howard Johnson”", "Author": "talulu6", "ReviewID": "UR58513749", "Content": "The location is good if you're going to watch a baseball game it's about 15 minutes ride on the subway to the downtown area, and the hotel is about 10 minutes away from the station. If you dont want to pay a lot of money on a hotel in the downtown area this is definitly a good option, since it's easy to get downtown from there.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gilmanton, NH", "Title": "“Good Place To Stay”", "Author": "JenniferParker", "ReviewID": "UR56746666", "Content": "I've stayed at this hotel in October and found one staff member a little rude. The room itself was nice, no micro or fridge though. I stayed again in Feb 10 and am very pleased. Staff was very nice and smiley. This time we got a fridge and microwave. Only complaints are that there weren't enough outlets for my brother and myself to charge our laptops. Also, free coffee would be nice, considering what I payed. This is a great hotel if you're coming down to the House of Blues for a concert. We live about 2 hours north of Boston and don't like driving at night. This hotel is affordable and convenient. I will definetly stay here again!", "Date": "February 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Portland, ME", "Title": "“Ghetto”", "Author": "zoomin76", "ReviewID": "UR55929680", "Content": "No refrigerator nor microwave in room. Cable TV was broken...cable torn from outlet. Windows were a mishmash of glass and plexiglass secured with silicone. Really dissappointed in amount paid - especially in the middle of winter. Had to sign a waiver that quiet time was 10PM, enforced by the Boston Police Department....ON A FRIDAY NIGHT?! Went to see Trey Anastasio Band at The House of Blues. Hotel was very close to venue.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "bstngirl", "Title": "“Great value made hospital stay much less stressfull”", "Author": "bstngirl", "ReviewID": "UR54320206", "Content": "For the value you will not find a better location. Hotel is clean and comfortable staff is very freindly and accomodating. Free parking and shuttle to hospitals make it ideal if you have family in the hospital.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Hampshire", "Title": "“Best value anyone can find in Boston with a refrigerator, microwave and a hospital shuttle”", "Author": "snazzy71", "ReviewID": "UR53883161", "Content": "I stayed at the Fenway H.J. twice recently. One visit was a 6 night stay while my husband had a very serious spinal operation at Beth Israel Deaconess Medical Center in October, 2009. The second surgery was the first full week of 2010 which led to a 4 night stay at the Fenway H.J.The hotel had all the things that I could ask for under these circumstances. The price was reasonable for a big city. In January, the off season for New England, was even $20 cheaper per night. As a senior citizen, unfamiliar with the transportation system and the streets of Boston, the shuttle that Howard Johnson provided was a big relief to me and my hospitalized husband. We had enough concerns and worries without worrying about me walking to a hotel alone after dark. After our first stay and a scheduled surgery in January, I planned ahead and brought a few food items for snacks, soda, fruit,etc, When I came back to the hotel I brought back breakfast items that could be stored in the refrigerator and warmed in the microwave. Instead of spending nearly $20 per day for 3 meals, I spent less than $10 using the H.J. facilities. I found the staff to be sympathic to my situation and great listeners. The shuttle was easy to use and always available within the the reasonable and lengthy travel hours which were clearly noted. The shuttle was available immediately or within 10-15 minutes if I was calling from the hospital. The drivers were knowledgable and courteous. The services at this hotel was a life saver for us. The rooms were clean and comfortable, more than adequate.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Hampshire", "Title": "“Very helpful staff, clean rooms and convenient to hospitals.”", "Author": "fa1sg", "ReviewID": "UR53566851", "Content": "My husband and I have stayed at Howard Johnsons Fenway for the past five years. We have found the staff to be very helpful, rooms to be clean, convenient to Brigham and Womens hospital. They also offer transportation to the hospital. My husband had a heart transplant five years ago. A family that we met at the hospital recommended the hotel to us and we have stayed there ever since. I would recommend this hotel for its cleanliness, helpful staff , restaurant, close to many attractions and the price was right. We have already recommended this hotel to our nephew and friends, they went to a game at fenway this past september and stayed at Howard Johnson.", "Date": "January 15, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Location": "4"}, "AuthorLocation": "Bronx, NY", "Title": "“Best value”", "Author": "supiano", "ReviewID": "UR50816827", "Content": "If youy are searching for a reasonably priced and convenient hotel, the Fenway Park Howard Johnson is a clear winner. The price for a double room was half that of other hotels in downtown Boston. The decor is a little drab, but everything one needed was in the room, The bathroom was sparkling clean and had the required amenities. The area was quiet (no baseball at this time of year!), and the room well insulated from noise. The people at the reception desk were friendly and helpful. Altogether, our night there was a positive experience.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Marseille, France", "Title": "“Excellent value for money”", "Author": "jo_cicco", "ReviewID": "UR50612078", "Content": "Regarding the location in Boston, I chosed the H.J. primarily because of the incredible room rates, by far much lower than any other hotels in the same district (and secondly, I already stayed in another H.J. in Anaheim CA and I quite enjoyed my stay). The hotel is located within a walking distance from the Convention Center (where I attended to a Meeting actually) and Fenway Park is one of the most attractive and touristic part of Boston. Apart from the great location, this is a typical H-J hotel (I mean, don't expect trendy rooms, high-tech bathrooms or beautifully designed lobby) but at least you have no bad surprise upon arrival. The only downside is the lack of complementary breakfast - I think that most guests would accept paying a couple of extra dollars for having some toasts and orange juice in the morning, even if there are plenty of places around the hotel to have some breakfast. Overall, I highly recommend it.", "Date": "December 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vermont", "Title": "“Great Location - Friendly Staff”", "Author": "Brown6", "ReviewID": "UR49553860", "Content": "The Howard Johnson in Boston is in a great location, right near Fenway Park and has very reasonable rates. The reason for our visit was that our son had an appointment at the Children's Hospital. The Hotel is just a few minutes away, and offers a free shuttle to the hospital. The staff is extremely friendly, and made our stay very pleasant. The rooms are kept clean, and the beds are very comfortable. For the location we thought that it might be noisy and loud at night, but to our suprise it was very quiet, and we had a great nights sleep. The location, price, and frienldy staff make this a good place to stay.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bristol CT", "Title": "“Parents Weekend - Another great stay!”", "Author": "bostonumom", "ReviewID": "UR48577131", "Content": "This is the best hotel for the money! Reasonable and well kept. Clean and neat. The staff is all around helpful and polite, very respectful. The location is amazing, behind Fenway Park and easy walking distance to Kenmore and other subway stops. Very safe area as most of Boston is. Very close to Boston University where our daughter goes to school, as well as many other universities. Boston is such a wonderful city and to find an economical hotel makes it even nicer. Stay there - you won't be disappointed.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Great Place to stay in Boston.”", "Author": "bipwin", "ReviewID": "UR48526967", "Content": "Allowed for early check-in. Fenway Park - House of Blues and Sports Bars. Short walk to \"T\". Clean room, refrig and Microwave. Helpful staff.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "califorina", "Title": "“great place to stay for baseball game,across the street from fenway park”", "Author": "juanraider", "ReviewID": "UR47364915", "Content": "the room was bigger than expected.had everything we needed.lots of places to eat near park,house of blues across park.front office was real nice and helpfull,let us check early so that we could tour fenway park.had a great time.had to pay for parking during game,but it is worth it.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toledo, OH", "Title": "“The best place to stay for Red Sox fans!”", "Author": "RedSox25Toledo_OH", "ReviewID": "UR46761084", "Content": "This is our second time to stay at this hotel. Although it is a little older, the rooms are clean and the staff were very helpful. This is a great location for Red Sox fans, the rooms on the back of the hotel look right out on Fenway Park! The front desk was helpful in directing us to area attractions and made our stay comfortable. We will definitely stay here again next year.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maine", "Title": "“Can't stay any closer to Fenway Park!”", "Author": "MamaDukesMaine", "ReviewID": "UR46618150", "Content": "Four of us shared a room for one night to attend a Red Sox/Indians game. The room was very large and clean. The beds were comfortable and the service staff were GREAT! We loved the Chinese Restaurant and bar located in the hotel! We couldn't believe how close we were to Fenway! It's right in the backyard of the hotel! We will definitely stay there again!", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vermont", "Title": "“Great Time at Howard Johnson Inn and Fenway Parks”", "Author": "MrBVermont", "ReviewID": "UR46583202", "Content": "My wife and I went to Boston in late September for two Red Sox games. Our stay at the Howard Johnson Inn at Fenway Parks was fantastic. The hotel was very nice with a great staff and friendly people. Two minute walk to Fenway! We had a great stay. Can't wait to go back. George Bond", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Waller, TX", "Title": "“Great Hotel and So Close To the Green Monster (Fenway Park)!”", "Author": "hibiscusgaltx", "ReviewID": "UR46561073", "Content": "This was a great hotel and so afforable. It was close to Fenway and close to alot of eateries. Will Stay there again.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dover NH", "Title": "“Ideal spot for a Red Sox Game”", "Author": "Whitto48", "ReviewID": "UR46399724", "Content": "The staff were very friendly and courteous. The hotel is a bit dated, but very clean and comfortable. wouldn't think twice about staying there again for our next visit to Fenway Park.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Maine", "Title": "“Staff at the hotel were extremely helpful and gracious in meeting our needs.”", "Author": "ClaraMaine", "ReviewID": "UR46212611", "Content": "This hotel is a perfect location to see Boston sights. We were at a Red Sox game and it is right behind the park. It is a short cab ride from North Station. The rooms were large and clean and beds were comfortable. Hotel staff was the best I have encountered. They were very considerate and welcoming. It was obvious that they enjoy their work! Nice little restaurant on premises as well. The price was also great. Have stayed here before and will again.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "new york", "Title": "“Staff was exceptionally helpful in meeting our special needs.”", "Author": "teachertraveler54", "ReviewID": "UR46139213", "Content": "We were traveling to Boston in a 16 foot moving van to help our son move into an apartment for college. Having had difficulty with parking on past trips to Boston, prior to booking I called the hotel to ask about whether arrangements could be made for parking such a large van. They checked the schedule, and noted the need to block off 2 spaces on the side of the building for our use. You can't imagine our relief upon arrival (after a 10 hour drive) to see orange cones carefully marking our space. The staff was so very accomodating and helpful- a real treat.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cape cod", "Title": "“Red Sox”", "Author": "codmanCapeCod", "ReviewID": "UR46138952", "Content": "This is the best Hotel in Boston to Stay at for Red Sox fans. Right at the ballpark and easy to get around the area.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maine", "Title": "“This hotel is in a great location!”", "Author": "reds0xfan01", "ReviewID": "UR45715683", "Content": "This was my third stay at this hotel. Everything has been great each time. The location is the best part. It is right behind Fenway Park! I will definately continue to stay at this hotel in the future.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "central New Jersey", "Title": "“It was an out of the park experience!!!!!”", "Author": "redsoxfan57", "ReviewID": "UR45674776", "Content": "This was the first time we stayed at this hotel and plan to stay there again when we return to Boston. We picked it especially for the location which is right in front of Fenway Park. We were going to several Red Sox games along with a stadium tour so it was perfect. We parked the car and only took it out once during our entire stay. The Front desk was very friendly and check-in was a breeze. The room was clean and comfortable. If you want a great view of Fenway - ask for an even number room on the second floor. The staff was very helpful and we had no problems when we were there.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Tilton, New Hampshire", "Title": "“This hotel hits a home run near Fenway Park”", "Author": "greygh0st", "ReviewID": "UR45385104", "Content": "This is a great place to stay if you are coming to Boston for a night game at Fenway Park.We arived in the morning well in advance of our check in time. We were geated by a friendly host. We were able to leave our car in the parking lot and take the T to downtown Boston for the afternoon . Since we were already checked in, that evening we were able to come back to the room, refresh and walk to the game. The only drawback was that this hotel did not offer a free continental breakfast but breakfast was available in the restaurant housed in the same facility.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Massachusetts", "Title": "“Hotel of choice for my next stay in Boston”", "Author": "clabma328", "ReviewID": "UR45355612", "Content": "I can't say enough about this place. The location alone was super convenient. Fenway and the bars are within minutes of walking. The room was spotless. Nice comfy bed and pillows with clean sheets. The bathroom was also spotless. Plenty of clean towels and assortment of travel items for use. Awesome pressure in the shower and a plus was that the tub even drained! Couldn't be happier, will most definitely will stay at this place again and again.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Hampshire", "Title": "“Great Location But Over Priced”", "Author": "WHTMT_NH", "ReviewID": "UR45287643", "Content": "Great locations near Fenway Park but at $200+ night for what you get not worth it. Parking is $20 extra a day too. Rooms are fairly clean but we needed to switch rooms since our first one smelled like moth balls. The hallways are disgusting smelling of smoke (although non- smoking) and must. Walls are very thin and you can hear people upstairs and next to you. The cleaning people are extremely noisy early in the morning knocking on peoples door and talking in the hallway. They even knocked and opened our door at 9:00 a.m. when I had a do not disturb sign on the door and check out was not until noon time.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "wallingford, connecticut", "Title": "“AWESOME!!! COULDN'T ASK FOR ANYTHING MORE!!!”", "Author": "baseballfan72", "ReviewID": "UR45219957", "Content": "We recently stayed here and went to a Red Sox game that night. Check in and check out went very smoothly. The front desk was very accomodating as well. There is a Chinese restaurant on the premisis as well although we did not eat there. The hotel is just a couple blocks from Fenway and a short walk to the subway line which we used the next day when we went to Quincy Market. The best part of this place is the location. We will definitely be returning... no doubt.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Plano, Texas", "Title": "“Great place to stay if you're visiting Fenway Park”", "Author": "CyclingGeo", "ReviewID": "UR44309637", "Content": "This is a renovated motel that offers good accommodations for those wanting to stay close to Fenway. No breakfast is offered by the hotel, but there is an independent Chinese restaurant on the premises that does, Food was adequateat the restaurant but service was awful. Service was good, as housekeeping had to provide a replacement battery for the room safe, and the front desk arranged for a taxi.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Rochester, Mn", "Title": "“Good Place For a Game”", "Author": "Theo55", "ReviewID": "UR42768910", "Content": "I have stayed here in the past and it's not a bad hotel for a baseball game, I doubt I would stay here with my fiance but with the guys it was Ok as all we did was sleep in the room for a few hours after the game and bars were over. It was Memorial Day weekend and 90 degrees outside, one of the rooms we rented had no AC which was not good but I guess this being the first hot day of the year I will give them a pass, that and because my room had AC, lol. So there is some advice check to make sure everything in the room is working when you check in. We were able to enjoy some cold beverages in the parking lot literally 35 feet from Fenway park, that was nice because there is no tailgating around Fenway. Room was $150 with tax and another $20 to park and $15 for a cot, good prices for Boston.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Massachusetts", "Title": "“Great Location!”", "Author": "teriNmike", "ReviewID": "UR40880360", "Content": "We stayed here for a Red Sox game. We were able to check in early and leave the car for the game. We could see the Brick walls of Fenway from our room! Plenty of places to eat and drink within a short walking distance of the hotel. The hotel staff was friendly and courteous a great value for being in the city. We will deffinitely stay there again!", "Date": "September 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Fredericton, New Brunswick", "Title": "“Already Planning The Next Stay!”", "Author": "SoxJaysFan", "ReviewID": "UR40814678", "Content": "Came into town for a couple of Red Sox games with my son. Took the train from Portland to North Station, the subway to Kenmore and walked to the hotel. They checked us in early...wow that was great. Clean, comfortable and very convenient. The staff were friendly and helpful. We are already planning our next stay. We also enjoyed the incredible location...what a trip! Thanks Howard Johnson at Fenway Park. Cheers.", "Date": "September 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "VERSAILLES, KENTUCKY", "Title": "“Enjoyed Howard Johnson-Fenway, great proximity to the ballpark, and downtown.”", "Author": "LUMBELLE", "ReviewID": "UR40705716", "Content": "Enjoyed our recent trip to Boston and our stay at the Howard Johnson-Fenway. It was great to be close to all the wonderful place to visit at within walking distance to Fenway Park. We will stay there again.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Union, NJ", "Title": "“Place to Stay if you are going to Boston”", "Author": "brenjess103", "ReviewID": "UR40694864", "Content": "Went to Boston to go to Fenway Park with my teen-age sons. Could'nt have picked a better place. The hotel is right next to Fenway which made it great going and coming from the game. We also walked the Freedom Trail. An entrance to the subway is a couple of blocks away. The expert staff showed me where to go and how to properly use the subway to get to where I wanted to go.The rooms were confortable and the service great. We received x-tra towels and pillows as soon as we asked. There are convenience stores and places to eat all around the hotel. I will be going back to Boston to see the Bruins and will definitely stay here again.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new brunswick", "Title": "“GREAT STAY”", "Author": "flushy", "ReviewID": "UR40181404", "Content": "When your heading to Boston for a ball game, this is the place to stay. The rooms are clean and the price is right. The staff is very helpful and friendly. Great location as it is right across the street from the ball park. We have stayed there the last couple of years and will continue to stay there in the futrue, Can' tgo wrong with this hotel.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Cape Cod", "Title": "“Motel should be demolished!”", "Author": "VacatonTrip", "ReviewID": "UR40013807", "Content": "This motel may have been a nice place to stay when it was first built, but I would never stay there again. My husband checked in early in the day. We were moving our daughter from one apartment to another and picked this motel becasue it had a parking lot and it would be eary to park the uhaul van we rented. The halls and rooms smell like stale smoke, the smell is something I am sure they could never get rid of no matter what they did. When my husband checked in he opened our window because of the smell. There are no screens on the windows and we were on the first floor. Our large window was right in front of the hotels dumpter ( I mean 5 feet from our window). My husband decided it was better to keep the window open with the dumpster smell than smell the smell of the room. I never made it to the room that night until 12:30A.M. since we were moving all day. If it wasn't so late I never would have stayed in that hotel. The door going into our hallway from the outside did not lock so anyone could enter the hotel. When we did get back to the room that night we had bugs from the open window in our room. The furniture was so old that the finish was warn off, the curtains looked to be very old, the rugs were ok, the bathroom very old also. We put our bags on top of the desk, did not want to touch anything in the room. Before we even got out of bed the next morning my husband said \"Let's get out of here!\" The restaurant attached to the hotel is in the same condition of the hotel. The pool area looked like it had been deserted. Not enough water in the pool and looked to have algea in the pool also. The motel needs to be torn down, there is no way this place can be renovated! There are too many problems. It is a disgrace to the Howard Johsnon company we all new as children. Build a new hotel on the property. The price was not a bargin. We paid $200.00 after taxes and parking. We could of stayed at another upscale hotel for that money. Even the towels were old and warn!", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Portland", "Title": "“Overall it was awesome.”", "Author": "RedSoxGirlPortland", "ReviewID": "UR39548680", "Content": "My husband and I have gone to at least one Red Sox game every year for quite a while now. We usually take the train from Maine and then we have to do the subways and worry about getting back to the train on time after the game is over. You can see Fenway from your hotel room. It is literally around the corner. This was so much more convenient. After the game we watched the players getting into their cars and waving to the crowd from the window in my son's room. It was pretty awesome. My daughter in law and I enjoyed the Chinese food in the restaurant while the guys walked across the street to Dominos. The hotel was clean and surprisingly quiet(after a win over the Yankees!)", "Date": "September 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chicopee, Massachusetts", "Title": "“Not too shabby”", "Author": "junebug2874", "ReviewID": "UR39480773", "Content": "Considering your in downtown Boston and what you could pay for a room that your only sleeping and showering in, the price is definately worth it. The're are smoking rooms, so it can be a bit stinky, but nothing a little air freshener wouldn't take care of. The a/c wasn'r working at its peak for such a hot day, but they did provide a high velocity floor fan that more than made up for it. I would definetly stay here again.", "Date": "September 1, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Utica, New York", "Title": "“So Close to Fenway You Can Smell the Hotdogs!”", "Author": "TravelingToosome", "ReviewID": "UR39150801", "Content": "Arrived about 3 hours before check in and much to our delight our room was ready! Staff was cherry and very helpful. Room was clean, quiet and certainly larger than any we'd ever had in NYC. Fenway a hop, skip and not even full jump from the hotel side door. Parking was reasonable considering an out-of-towner does NOT want to adventure through Boston streets/traffic and would prefer the subway which, by the way, was also close and convienient. Would definately recommend HoJo's to anyone coming to ballgame or doing some historic sight-seeing. BTW...Hotel bar was great too!!", "Date": "August 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Philadelphia", "Title": "“The people make the difference”", "Author": "jmentis", "ReviewID": "UR38868143", "Content": "The room was clean and also smelled that way. I thought the rate was a little high but the Red Sox were in town. What was I to expect. The convenience to the ballpark was great as well as the close proximity to all Boston has to offer. The best was the lady behind the desk. When we checked in 5 hours early, (after a 6 hour drive), she was able and willing to give us a room at that time. I wish I remembered her name to request she get a raise.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Augusta, Maine", "Title": "“No worries here!!!”", "Author": "Nativemainer", "ReviewID": "UR38687948", "Content": "We booked this hotel because we were attending a Red Sox/Yankees game. Location cannot be beat. From the time we left our room until we were sitting in our seats in Fenway was, at the most, ten minutes (walking from hotel). Staff is very pleasant and accomodating. Room was basic, but clean, and beds were very comfortable. Restaurant is very good, both for supper and breakfast. We did not have time to try the pool, but it looked OK. Clean and well kept up. Will stay here again when I am attending a game at Fenway.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oakland, CA", "Title": "“Clean, Comfortable, Very Gracious Staff”", "Author": "OAK2BOS", "ReviewID": "UR38180339", "Content": "This is a great value in the heart of Boston. I was very happy to find a clean room, very clean and comfortable beds, and a clean bathroom with ample towels and toiletries. The staff is very friendly, helpful, knowledgeable and accomodating. and they're good at their jobs. We felt safe walking the streets at night and loved the proximity to the ball park. At $20/day, the parking is a real bargain as well. In this part of Boston parking is either metered or restricted to residents. And on game days everything is at least $50. With a son in college nearby I'm sure we'll be staying there again.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "south glens falls NY", "Title": "“Very convenient and friendly”", "Author": "doughboy71", "ReviewID": "UR37687072", "Content": "we had to bring our son to Boston because he had a appointment we Dr. Black at Brigham& Womens hospital the staff on the front desk were very helpful & friendly & explained where every thing was & how to get to different places it would be an excellent place to stay if you wanted to go & see a ball game fenway is right there you don't have to worry about parking etc.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Central New York", "Title": "“Soooo Conveniently Located”", "Author": "MBCNY", "ReviewID": "UR36940976", "Content": "We booked the HoJo hotel room because of its location. We went to Boston to see Paul McCartney and wanted a hotel w/in walking distance of Fenway. Fenway Park is literally in its backyard. Our expectations were not very high but the hotel proved to be perfectly suitable for our needs. After the show we were pleasantly surprised that the Chinese restaurant in the hotel was still serving dinner at 11 pm , and the food was pretty good. The hotel could use a little cosmetic work (okay maybe a lot) but the room was fine, the sheets were crisp, the bathroom was clean, and the beds were comfortable.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New England", "Title": "“Unmatched proximity to Fenway Park”", "Author": "qhill", "ReviewID": "UR36814788", "Content": "Basic, but clean accommodations. The proximity to Fenway can't be matched (we had a great view of the park from our room). Hotel is non-smoking, but our room did have a stale nicotine odor (we were glad we packed air freshener). Small bathroom, but clean. There were only three bath towels provided for our party of four. We requested extra towels and pillows at front desk. They were delivered to our room within minutes. AC was turned to coldest setting when we arrived. However, the room was warm, not cool. Ventilation was poor and uneven. This was the one major negative for us. After reading the rave reviews here, we were eager to try the Chinese restaurant on premises. The food was mediocre at best. Server did not seem entirely familiar with menu, and tried to discourage us from ordering an appetizer because it would take \"an extra ten minutes.\" However, restaurant manager/owner(?) was lovely and courteous. Prices were reasonable, and the portions, generous. We parked mere steps from the hotel entrance, for $20/day. We will stay here again when visiting Fenway. The location and convenience to the ballpark are unbeatable.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "maine", "Title": "“Could crawl to Fenway!”", "Author": "quiltingbabe", "ReviewID": "UR36630182", "Content": "Our room was very pleasant and you could have crawled to Fenway. No parking worries or trying to get away from the Park afterwards. Very pleasant staff and clean room", "Date": "August 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Massachusetts", "Title": "“Smoker's Hotel”", "Author": "wjboisseau", "ReviewID": "UR36213472", "Content": "We asked for a non-smoking room and was assurred that the hotel is smoke free. There was even a sign on the lobby door stating this. But the two rooms we were given stunk - even the hallways! We signed a nasty legal form upon check in that said if we smoked in the room we had to pay a $150 fine. However, the room we had must have had a party in it the night before. The staff happily let us change rooms. The second room was mildly better, but still had a strong smoke odor. The A/C was barely cirulating air but eventually got the temp down to 78 degrees by morning. On a positive note, the location was wonderful - right next to Fenway Park! The staff is polite and seem responsive, although they are unable to do anything about the odor or A/C. If you are a smoker, this is the place for you.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Maine", "Title": "“A Special night at Fenway Park”", "Author": "grammieknits", "ReviewID": "UR36159847", "Content": "I recently retired after 28 years in education and as a retirement gift some of my co-workers gave me two tickets to a Red Sox game. Although I am an avid fan I have never been to Fenway Park. The Howard Johnson Inn at Fenway park was the perfect place to stay. It was easy to get to, check-in was quick and easy, parking was available on the premisis (additional $20 fee) and it was just steps away from the Ball Park. The Red Sox won the game, we walked back to the hotel, had a nice late night dinner at the attached restaurant, and a comfortable night's sleep, with no worries about driving through traffic. We will definitely use the Howard Johnson at Fenway Park the next time we go to a game.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "new jersey", "Title": "“don't buy in to the hype”", "Author": "xxonejunxx", "ReviewID": "UR35715919", "Content": "the location of this place is pretty awesome. fenway is literally right next door. and many colleges are 2 minute driving distances from the hotel. but the problem was that it seems to be mislead by a sign that reads \"hong kong\" restaurant. so it threw me off guard since i thought it was a restaurant instead of a hotel. as soon as i walk in, i assumed that this place is pretty nice. the lobby is kept clean and such. also the lady on the front desk was pretty nice, even though it was 1 in the morning. the room itself was pretty cool, and the ac is pretty awesome as well. but then, there were couple problems we had. the outlets were insanely horrible bc there was 5 outlets, which 3 of them were hoooked on to by a lamp. so charging the phone and the laptop was an issue. secondly, there are 2 outlets that are COMPLETELY hidden and ghetto. it is directly behind the bed, so you physically have to move the bed in order to plug in your electrical device. one condition. you MUST put the bed back in place, if you don't, the cord will fall off and completely stop doing what ever it was doing. it took us a pretty long time to find that cord, i mean honestly, who has a cord BEHIND a bed?! also, we couldn't turn on the tv for good 30 minutes bc it was not connnected to a power. all teh cords were occupied by the lights, and there are only limited plugs in the room, which was .. really bad. the bathroom was pretty clean. the bed was okay. good blanket, but bad pillows. i suggest to bring you're own pillow for this hotel. oh.. and there's the tv. the tv .... is not GREAT. if you want crisp picture, its def. not it for you. its mainly used for sound. the tv screen seems to panic like crazy half the time. so it hurts your eyes for a minute. also, they must redo the walls. some parts of the room were peeling apart, and it did not look appealing. lastly, if you are looking for internet... this hotel's internet is pretty... bad. its worse than a dial up i believe even though it is a wifi. the connection gets lost every other minute, checking emails would take hours. oh. btw. one thing that threw me off was the breakfast. i remember seeing it on ads saying they serve free breakfast, but .. it obviously didn't. some chinese man kinda gave me a tone saying \"no we have no free breakfast, you pay here and eat.\" so yea.. kinda disappointed. false ads are a disappointment. conclusion if you're gonna go watch a boston red sox game, go ahead, this might be the best cheap affordable hotel for you. cause you literally have to take 5 steps to get there. if you're gonna go to boston for college visits, dont come here. its awful. if you want free breakfast, dont come here. if you're willing to spend hours on the internet and watch tv to spend the day, no dont come here. so i recommend this place strictly, for red sox fans who will be going to the game.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "CONN", "Title": "“Most convenient”", "Author": "Therealtoni", "ReviewID": "UR35100081", "Content": "The hotel was much closer than I imagined to Fenway Park. Plus, it was walking distance to the \"T\" which brings you to downtown Boston. I saw a gameat Fenway. It rained and it was a blessing to be about a block away from the hotel. I could hear the cheering and music of the stadium at my room. A traveler unfamiliar with Boston would find this very convenient and helpful to use as a base for visiting the area..", "Date": "July 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Portland, Maine", "Title": "“HoJOs @ Fenway was way cool”", "Author": "Trooper223", "ReviewID": "UR34956589", "Content": "The Howard Johnson's Hotel at 1271 Boylston Street in Boston literally sits within arms reach of historic Fenway Park. It is an awesome location if you are into sports and particularly if you love Baseball as I do. Literally if you have a room in the back of the hotel you can watch the players arrive for a game right from your room. It was fun to just walk around the historic ball park too. The hotel itself is an older hotel and in need of some updating but on the other hand everything was clean, neat, safe, and in working order. The people at Howard Johnson's were all very professional, helpful and went out of their way to help in any way that they could. This was probably my 5th or 6th time staying at HoJos there at Fenway and definitely recommend it.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bangor", "Title": "“I would recommend Howard Johnson for any visiting Red Sox Fans”", "Author": "BangorPeter", "ReviewID": "UR34937669", "Content": "II stayed briefly at the Howard Johnsonâ€™s near Fenway. The staff was extremely helpful and knowledgeable. Upon checking in the front desk staff noticed I have a cane and very generously suggested I stay on the ground level. Going to a Soxâ€™s game this is a must stay hotel. I not only would recommend this Howard Johnsons but also will stay there again myself.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Central Maine", "Title": "“They say location is everything, this hotel proves it”", "Author": "dragon600", "ReviewID": "UR34877514", "Content": "The location to go to a sox game is unbeatable. I have two young children and didn't want to walk around the city or drive after the game. We could see Fenway from our room. The rooms are adequate, nothing really special, but for the the convenience it's a good value.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "berkshires, mass", "Title": "“great place to stay very friendly”", "Author": "connieredsox", "ReviewID": "UR34749749", "Content": "we love staying here every time we come to boston for the red sox games it is right across the st. and every one is very friendly we like franny at the front dest always knows us and will help us any way she can keep up the good work. \"go sox\"", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Massachusetts", "Title": "“Convienent and Affordable”", "Author": "Candice87", "ReviewID": "UR34266566", "Content": "I really enjoyed my stay at the Howard Johnson hotel. I wanted to go to Boston for my birthday, so I chose to stay here because it was the most affordable place to stay in the area. It was also appealing because it was in walking distance of fenway park, lansdowne street, and other popular attractions. I was surprised to find how nice and clean the rooms were for such a cheap price. The beds were comfy and I slept very soundly at night. I was most impressed with how helpful and friendly the staff were. Overall, I would recommend this hotel for anyone looking to stay in Boston for the best deal possible.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Fort Worth", "Title": "“Would not stay here again”", "Author": "BlessedinTexas", "ReviewID": "UR34210258", "Content": "Although the location to Fenway is a plus, this hotel is in need of major renovation. Number one priority is that they get new beds. These were REALLY bad. They also need new bedspreads, curtains and carpeting. The smell in the room and in the hallways was also not good. There was one girl at the front desk that smiled and was helpful. I think her name was Natalie. The rest seemed like they couldn't care less. On the plus side, the location is great for Fenway. The bathroom was clean and there was hot water. The man in charge of the Chinese restaurant for breakfast was very nice and they had good coffee. If the management would work on these other important issues, it could be a great place. But the last straw for us was on the second day there was the definite strong odor of marijuana wafting down the hallway as we walked with our 7-year-old grandson. I also heard other people commenting about this. We would not stay here again. There are other hotels not that far from Fenway.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "CT", "Title": "“Only if price matters”", "Author": "Uconnhoopsfan", "ReviewID": "UR34162364", "Content": "Stayed for 4th of July, rooms are old, peeling wall paper, stained ceilings, grouse carpeting and temp. contols in room missing. But the female working the front desk Saturday and Sunday morning really needs a lesson in HOSPITALITY. Spend the extra money and stay some where else.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "SF Bay Area", "Title": "“Spend your travel dollars elsewhere!”", "Author": "VOR87", "ReviewID": "UR32737895", "Content": "We stayed at this hotel for two nights during a first-time visit to Boston. My husband chose this hotel based on proximity to Fenway, where we were going to attend a game, and price ($150). The proximity to Fenway is both good and bad. The park is located around the corner and down the block from the hotel. All of the rooms at the back of the hotel look out at the ball park. The downside is the noise that continues throughout the night. and as a previous reviewer said, there is a frat house element with drunken fans milling around. Thank goodness we kept our earplugs from our Jet Blue flight! The hotel is old and needs serious upgrading. The hallway, as well as the first room we were assigned, smelled of smoke, the mattresses, including the rollaway, lacked proper support, and the bathroom is small and the configeration is just odd. With competitive rates available through Travelzoo & Priceline at other area hotels, I would recommend considering other options first.", "Date": "June 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Calgary, AB", "Title": "“Comes down to convenience versus comfort”", "Author": "Steve_in_Calgary", "ReviewID": "UR32547702", "Content": "My wife and I planned to spend 4 nights in Boston to catch to Red Sox games, tour Fenway and enjoy Boston before heading to Cape Cod. I booked the HoJo because of the decent rate and the proximity to Fenway which would be convenient after night games. Based on the reviews here, I thought it would be a decent stay. We arrived around 7pm on June 6th after a long flight from Calgary AB with a stop in Toronto. We were given a room on the first floor at the back of the hotel. When I asked if a second floor room was available, I was told that that this was the last room. Although we were staying through June 10th, no suggestion was made that we could change rooms the next day. The windows in all the rooms are single pane. Any outside noise is barely muffled. When on the first floor, people having a discussion outside their car in the parking lot at 3am might as well have had it in your room. The bed in our room on June 6th must have bee 20 years old. After lying on the one side for 20 minutes, when I got up, there was a crater where I had been lying. It would disappear in about an hour. The bed was so uncomfortable and the noise from Fenway unmuffled by the single paned windows that I barely slept that night. My back is still recovering and I've been in constant pain for two weeks. My wife finally suggested that we sleep across the bed instead which provided marginal improvement. The next morning, we asked to change rooms to one with preferably a firmer mattress and the desk staff got into a long discussion before putting us into the \"best room in the hotel\". I almost changed hotels and, in hindsight, wish I had. Supposedly, these were newly renovated but I suggest they have only been repainted. The decor, furniture and bedding were exactly the same. The bed was slightly better, at least allowing for an OK sleep. The hot water took so long to come to the room that I called the front desk. Turns out you need to let the water run for 10 full minutes before any hot water will arrive. This is very \"un-green\". Whenever I dealt with the front desk staff, they always left me with the impression that they dislike their job and I was bothering them. They were polite and provided assistance but the occasional smile couldn't hurt. Conversely, all dealings with the housekeeping staff were very pleasant and helpful. Every night after games at Fenway, there is alot of noise from the cleanup crews. I do understand that this is out of the hotel's control but a whole new set of windows (to upgrade the single panes) would minimize the noise from this. What was unacceptable was having to sign a document that I could be evicted from my room without refund if I was disturbing the peace but then having to endure an entire night (I think it stopped around 4:30am) on June 9th of screaming, yelling and door slamming from my neighbours. I guess I should have called the front desk but we felt it would be safer to remain quiet. These rooms are right by the staircase by the front lobby desk. There is no way the front desk could not have heard the constant disturbance. If you are going to have guests sign a form like that, then enforce the stipulation for the benefit of all your guests. When I checked out the next day, the rate for the 1st night was correct but nights 2-4 were 25% higher. The staff were quick to correct the error. Other comments: - They might as well fill the pool with dirt. The algae on the sides gave you the distinct impression that your health would be compromised by swimming in it. - The restaurant was OK at breakfast - nothing to complain about but nothing to recommend either. In summary: - The front desk staff needs training on how to smile - ALL the mattresses need to be replaced - Noise minimizing windows would be helpful - Manage the unruly guests - Compliments to housekeeping", "Date": "June 17, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Value": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Convenient to Fenway Park”", "Author": "kayefa", "ReviewID": "UR32460890", "Content": "We stayed at this location as it was close to the Red Sox Ball Park. My husband was unable to walk far due to foot injury so this worked out fine for us. We took a cab to and from hotel which was very convenient and reasonable. Staff was very nice and was able to assist us with our questions regarding restaurants and assistance with cab back to Boston Airport early in the morning.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“Superior Service, good value, and excellent location”", "Author": "stockz", "ReviewID": "UR31553633", "Content": "I go periodically to Boston for a medical checkup. The Howard Johnson Inn at Fenway Park has the most competitive prices and the location is convenient to the medical complex. Timely shuttle service to the hospitals is available to customers. Although the facility could use a face lift, the staff at the front desk more than compensated for the aging quarters. The desk personnel printed out my boarding pass for the flight home, directed me to good restaurants within walking distance, and showed a personal interest in my well being and comfort. I am recommending The Fenway Holiday Inn to friends and will certainly stay there myself on future visits. Michael Van Dress", "Date": "June 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Massachusetts", "Title": "“If you're going to Fenway with the guys or a girls' night out, stay. Otherwise, you should maybe keep looking.”", "Author": "choolie", "ReviewID": "UR31330609", "Content": "I stayed here with a few girlfriends for a concert at Fenway at the end of May. [Disclaimer: I travel with this pack of girls a bunch, and yes we do usually stay at newer, more like Courtyard-type hotels and we like shopping, pampering and jacuzzis, so consider the source.] The good: You can't get closer to Fenway. It's right-there, and that goes a long way toward making this a value. But it's old, and smells like smoke in the room and halls and the outdoor pool is green and the room doors all slam, and since it's right at the park everyone was partying in the halls until the wee hours. So I wouldn't bring the kiddies in -- stay nearby in Cambridge instead. The partying didn't bother us, even with yelling from room to room at 3am. One of my girlfriends read these reviews and brought her own sleeping bag and pillow and slept on top of the covers-- turned out to be a bonus move because when we returned from the concert around midnight our room was 60 degrees and when we called the front desk about the heat we were informed that the whole hotel has no heat. (No apology-- just matter of fact.) Set your expectations to frat house with an awesome location and you'll be alright. Bonus- Chinese restaurant in the lobby is pretty good and open pretty late.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Seattle", "Title": "“Location, location, location and great service.”", "Author": "KLA529", "ReviewID": "UR31248279", "Content": "I made a list of a few pros and cons about this hotel: Pro#1: Location, location, location. The hotel's location can't be beat for games or events at Fenway Park. You literally walk out of the hotel, walk half a block, turn the corner, walk another half block, and there's the Gate B entrance to Fenway Park. It's also convenient for meeting up with a particular trolley tour that I took that stops in front of Fenway Park and lets you board at any stop. My hotel room on the second floor (top floor) had a peek-a-boo view of Fenway Park and faced out onto the hotel courtyard where there was an outdoor swimming pool. Pro#2: Great service. First example- I had a package delivered to the hotel. I thought it was going to be delivered during my stay at the hotel, but the package arrived a few days prior to my arrival. I called the hotel and was delighted when the lady at the desk said they would hold it until I arrived, no problem. Sure enough, when I checked in, they had it ready for me. Second example- I checked out early in the morning and was waiting in the lobby for an airport shuttle. When I had been waiting a while, the two men on duty offered to call the shuttle for me. When they couldn't get ahold of the shuttle, they offered to call me a taxi. The taxi pulled up a minute later. Third example- The cleaning service restocked the toiletries. (I stayed multiple nights.) It's something I took for granted until I stayed in a hotel that didn't! Con#1: No breakfast offered in the hotel. In the Fenway Park neighborhood, there are lots of bars and lunch/dinner restaurants but no coffee shops or other places that serve breakfast (that I could find). I would've even paid for breakfast if the hotel had offered it. (The restaurant inside the hotel is Hong Kong Cafe, a Chinese restaurant that is open for lunch and dinner.) It looked like there used to be a McDonalds across the street from the hotel but it was no longer in business. Con#2: Older hotel Because this is an older hotel, there were a few problems. I couldn't adjust the temperature in my room. It was freezing cold inside the room the first two nights when it was cold outside, and stuffy when it was warmer outside on my last night. Along with that, there was no way to turn the fan on in the bathroom. Also, the room smelled faintly of cigarette smoke. The hotel is now 100% non-smoking, but until they replace the carpets, freshen up the paint inside the room, etc, it will always smell. To be fair, they are in the process of refurbishing the hotel. They were painting the halls when I was there. I didn't have any trouble sleeping because of noise. Sure, I could hear people in the hall, faucets, the soundcheck at the concert across the street at Fenway Park. But maybe I am more used to noise than others since I live in an apartment building. All in all, I would definitely recommend this hotel if you are looking for a hotel with great service very close to Fenway Park.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“It was OK.”", "Author": "NomadForLife", "ReviewID": "UR30564817", "Content": "I'm not sure if I just got a crap room or what, but some of the reviews describe a much nicer hotel than what I stayed in. The good: LOCATION LOCATION LOCATION! Literally across the street from Fenway, can't beat it. Also, the staff is super friendly/helpful and the rooms are (dated but) clean. There is a restaurant attached that serves breakfast, lunch, dinner and it is reasonably priced. The bad: I realize this is not the hotel's fault, but our room was on the second floor facing the park. I requested a \"room with a view\" and while the view of Fenway was fantastic, it was NOISY. Each night after the game around midnight the cleaning crew and their equipment could be heard as well as early AM deliveries. It made sleeping difficult. The inside of the hotel is a bit noisy as well, you can hear toilet's flush, doors open, etc. Then there were \"little things\" like, the WI-FI working one day but not the next (they do have a 24 hr service number to call and they were very nice and helpful). And NESN? We were told they didn't get it, so I'm curious as to how the other customers got it on their TVs. The parking situation concerns me, I wish they had better supervision. There is no security and I looked out the window one night to find a man on a bicycle riding around the lot looking into people's cars. There is also no elevator. Let me say, I am 28 but I was traveling with my two senior parents. I booked the hotel at the \"Senior Rate\", which is deeply discounted, so I'm wondering if they assign less desirable rooms to those rates. Overall the hotel is good enough to crash for a night after the game and if I were traveling alone for just a night, I would stay again. However, it is not comfortable enough for another extended stay.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "South Jersey/Philadelphia", "Title": "“Any closer and you'd be in the dugout !”", "Author": "Crazy2Ski", "ReviewID": "UR30306259", "Content": "What a great surprise to open the drapes and practically reach out and touch one of baseball's true gems. Not only is the hotel close to Fenway, but if you want to go downtown, the MBTA Green Line is a couple of blocks away in Kenmore Square. Once I parked my car, I never needed it until it was time to leave. The hotel looks like an older property, and has a '60's look to the lobby. Nothing elaborate however the room was a standard hotel room. Nothing overly fancy, but everything was clean and in very good shape. For the value you could not go wrong. Check in was quick, and the staff more than helpful.", "Date": "May 19, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Rooms": "3", "Service": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“You don't get closer to Fenway than this!”", "Author": "FenwayFanFlorida", "ReviewID": "UR30204700", "Content": "Great location! It is as close to Fenway as you can get. Good value for the money. We plan on staying at the hotel on our next Fenway visit.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Harrisburg, PA", "Title": "“Best Place to Stay for Fenway!”", "Author": "tsarnick3", "ReviewID": "UR30049869", "Content": "This is a baseball fan's dream hotel. From our 2nd floor room we could see (and hear) Fenway Park ...the back of the right field seats, the signs, etc. Pahk the cah and forget about it because it's a 2 minute walk to the games. Our room was very clean and comfortable (the bedspread was very colorful to say the least); it was also surprisingly quiet even tho the hotel was packed the 1st 3 nights we stayed. Didn't try the Chinese restaurant but made it to the hotel Tiki bar every night.... highly reasonable prices ($3 for a 16 ounce can of beer, $5 or 6 for a mixed drink....friendly if a little rowdy at times. All in all a great value. About a 7 minute walk to the nearest subway stop (Kenmore).", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Holyoke,Massachusetts", "Title": "“Open Day Game along to Aquarium with Kids - no car needed”", "Author": "Fancy_9", "ReviewID": "UR29912801", "Content": "We were able to walk to Fenway Park and enjoy all festivities that go along with Red Sox Opening Day Game. Did not have to pay for parking which is very steep since we were staying at the hotel. Open Day was canceled because of weather , no problem , Howard Johnson's was able to accommodate us for another night. The adults enjoyed the day at the many pubs in Boston. The next day we were able to take the \"T\" to the Aquarium with the children since the rescheduled game did not start until 4:00 p.m. We got back in time to see a great win by the Sox and had some night life while the younger adults and children went back to Howard Johnson's and ate a delicious Chineese meal. ALL THIS WAS DONE WITH TWO HANDICAPPED PEOPLE. The staff was great!!", "Date": "May 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "new hampshire", "Title": "“great location”", "Author": "kmscy", "ReviewID": "UR29865007", "Content": "I had to get some testing done at Brigham and Womans and the hospital said that this hotel does hospital rates with proof. I stayed with my daughter and we were very happy with everything here. The room was large and clean. Close to the hospital and very close to Fenway and some great places to eat. The room has a fridge, always a plus. There is also a chinese place in the hotel with great food and a lounge.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "CONCEPCION, CHILE", "Title": "“Excellent for runners of Boston Marathon!!!!!!!!!!!!!!!!!!!”", "Author": "Feredia", "ReviewID": "UR29335018", "Content": "Excellento location, everything was clean, and just what you need if you are running Boston marathon. Within 10 blocks of everything and an excellento cost for 2-3 runners splitting the room rate. Thumbs upppppppppppppppp!!!!!!!!!!!!!!!!1", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hamilton", "Title": "“Exceeded Expectations - Courteous Staff, Cleanliness & Location”", "Author": "Tammy_Ooku", "ReviewID": "UR29140319", "Content": "Needed an affordable location that was also centrally located. This hotel provided this and more. The facilities were clean and the staff very courteous. Also the shuttle service provided by the hotel to the hospital was very convenient. During our trip my mom inadvertently misplaced a personal item. We called the hotel and they sent it in the mail ASAP. This was very commendable!!!", "Date": "May 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Halifax, nova scotia", "Title": "“Location,Location,Location”", "Author": "Halifax_19", "ReviewID": "UR24840116", "Content": "Number 1 location in Boston for those visiting to see Redsox. Have been staying here for years and have been impressed with improvements in cleanliness/ambience of rooms and helpfulness of staff. Adjacent to Fenway Park yet minutes from Downtown by cab or train. Great value for the dollar.", "Date": "February 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kentucky", "Title": "“Wonderful: Highly Reccommend”", "Author": "KentuckyGardenGirl", "ReviewID": "UR24089437", "Content": "I can not say enough about this hotel and its staff! My family and I spent three weeks there in November, while I was recuperating from hip surgery at Boston Childrenâ€™s Hospital. Needless to say it was an extremely stressful period for my family; the staff went above and beyond to make us as comfortable as possible. I was in the hospital for a week, but family stayed in the hotel. I will be honest, it is an older hotel; however it was being renovated during our stay. We stayed the first two nights in a regular room because we had not thought to make prior arrangements for a handicap accessible room. The room was on the smaller end, but was comfortable. It also had a refrigerator and microwave. The staff was able to move us to a handicap accessible room after the second night. This room also had a refrigerator and microwave both of which were useful during our extended stay. The hotel has complimentary transportation to and from the hospitals. I had complications from surgery and had to return to see the doctor. The van was unavailable this time so the manger not only called us a cab, but he even paid for the trip. The best part of the hotel is the staff. They went above and beyond. Every time someone from my family returned to the hotel the staff would ask about how I was doing. The housekeeping staff was always mindful of my condition and cleaned the room as quickly as possible. The van driver always friendly and helpful. Since I was recovering from surgery I was slow getting in and out of the van. However, the driver was patient and tried to help in any way possible. By the time we left, we had come to think of the staff as family. Without reservation, I would recommend this hotel to anyone.", "Date": "February 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochester", "Title": "“Just Right at Fenway”", "Author": "khadley1", "ReviewID": "UR23120653", "Content": "Needed an affordable hotel near Fenway/Back Bay to pick-up one son from Berklee College of Music and visit Northeastern University with another son. This HoJo fit the bill perfectly. The room was clean and comfortable, the cost was very reasonable especially for Boston, the location was perfect, and the staff was very friendly and helpful.", "Date": "December 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ansonia, CT", "Title": "“Loved Hojos”", "Author": "esulkowski", "ReviewID": "UR22355447", "Content": "The service was excellent, from the front desk to the housekeeping staff. We experienced a problem with our refrigerator, they gave us a new refrigerator in no time. I was given great directions and advise during our trip. I would definitely visit this location and would tell my friends and family about our experience.", "Date": "December 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maine", "Title": "“A hotel with genuine customer service”", "Author": "CatherineMaine", "ReviewID": "UR22179264", "Content": "I was immediately pleased with the genuine friendliness and graciousness of the front desk attendent upon check-in. My family had a few special requests (to keep our car a few hours longer in the lot after check-out, an extra cot, extra towels, etc..) and each request was acted upon quickly and with an attitude of friendliness. The housekeeping staff was also friendly and attentive, and each time I had a need or question about the area the front desk attendent was very helpful (even looking up for me where in the area I could get my favorite coffee). I found it to be comfortable and very friendly.", "Date": "November 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Weekend Break ( 3 nights ) - will be back.”", "Author": "DeargDoom", "ReviewID": "UR21995642", "Content": "To Summarise - 1) a very good welcome on check-in (thanks Beverly and Anthony). And indeed, no hassle getting my boarding pass printed prior to departure (cheers Lisa), 2) superb housekeeping (including 2 bottles of spring water left daily - most appreciated - thank you), 3) a nice walk to the Prudential Centre etc., 4) excellent Chinese Restaurant onsite - there are also fast food / pizza options just across the road, with Shaws Supermarket a 3-minute walk away (turn right as you exit hotel), 5) a nifty lounge (to the left of reception) - alas no draught beers, 6) not alone did the room have a fridge & microwave, but also a DVD/Video unit (channel 00 on the remote, folks) - GREAT idea ( I did indeed use the DVD to check out some discs purchased in the 'Best Buy' store, also on Boylston Street ), 7) Sometimes there IS a (pleasant) aroma from the Restaurant downstairs, but only noticable in the hallway, not in the room itself. mmmm - nice. 8) ok - so some of the furniture looks a tad worn but so what ? You can store your stuff in the drawers etc. and isn't that the important thing ? 9) and of course, it's nice to be able to stash your luggage for a few hours post check-out but prior to the airtport-dash. Overall, I recommend the HoJo. Anytime. ( Useful tip - the cab-driver didn't appear to know where HoJo Boylston was, until I specifically mentioned Fenway ).", "Date": "November 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "canada", "Title": "“great location for red soxs fans,will be back!!!”", "Author": "b_radCanada", "ReviewID": "UR21154670", "Content": "loved the local,everything needed within 2 blocks and friendly staff.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "joaovasco", "Title": "“You Got To Love Howard Johnson at Fenway”", "Author": "joaovasco", "ReviewID": "UR20979430", "Content": "Last month we went to a Red Sox / Yankees game at Fenway Park. We got the tickets early in ther season and planned to make a weekend out of. With a little research we found Howard Johnson Inn at Fenway Park and it didn't disappoint. It 's reasonably priced and is right behind Fenway, (just a 5 minute walk to Fenway). Even though normal check-in isn't until 2 PM we got there an hour and a half early (just to park in there lot), we were able to check-in. We stayed in room 222, which if you looked out the window you could see Fenway Park. Actually any even numbered room will have a great view of Fenway Park. (Rooms 218, 220, 222 have probably the best view of the players parking garage area on Van Ness St). The front desk staff was great, they had a lot of local knowledge and gave us some suggestions on things to do. It was too cold to go swimming but, they do have an outdoor pool. It's close to many restuarants and bars such as Boston Beer works, Cask and Flagon, etc. It's also next to many T-stations including Kenmore Square (about 15 minute walk). Its not the most luxurious hotel in Boston however it was a great stay and would recommend it to anyone.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Fantastic for Fenway!”", "Author": "babybou", "ReviewID": "UR20939361", "Content": "We stayed at this hotel on a night of a Red Sox Game. It was perfect for what we were looking for. Nothing beats the location if one is going to the game. The parking at the hotel is priced well for the area and once the car was parked, there was nothing to worry about! We had a very positive experience. We arrived a bit earlier than normal check in time and were given a room straight away. We could leave our stuff and freshen up before our afternoon of sightseeing. The room itself was comfortable and clean. Bed was big and comfy after a long day of walking around and catching the game. Bathroom facilities were fine as well. The shower had good water pressure. Can't beat the value for money for the location. Would stay again at this Howard Johnson's without hesitation!", "Date": "October 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pennsylvania", "Title": "“Great place”", "Author": "crwrlw", "ReviewID": "UR20765638", "Content": "I have stayed in this hotel many times and I always find it a great place. The location is excellant and the rooms are always very clean. The staff is courteous and helpful. You simply cann't find a better place to stay in Boston.", "Date": "October 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wrentham,Ma", "Title": "“Great place at a great price.”", "Author": "Chipsue", "ReviewID": "UR20676886", "Content": "My wife and I were going to Boston for the Red Sox game and a little sightseeing. We had been to The Red Sox before and stayed at different hotels. Someone told us about Howard Johnson by the Fenway, so I got on the computer and booked a couple of nights We got there early in the afternoon and had no problem checking in early .Thet directed us to a number of restaraunts in walking distance and answered all our questions. We got to our room and were very happy with it. It was very clean and spacious. It was in walking distance of Fenway Park and close to all public transportation.It had a lounge and restaraunt right in the building. We will definitely be back the next time we are in Boston", "Date": "October 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "", "Title": "“Stay away!”", "Author": "keysmank", "ReviewID": "UR19969139", "Content": "Putting our kid into college, HJ was the cheapest accomodations at $127/night. Staff was more interested in their personal conversations than attending customers,offered forgotten personal items on a in room card but request to the front desk didn't result in the items being placed in the room and a request at the desk resulted in an admission that they didn't have any. Parking was $20/night but was only displayed on a small card and they don't inform the customer upon arrival. Staff is surly and will not give their names. Probably illegals. Stay only if no other choice and I can recommend the restaurant food and service which were the exact opposite of the rest of the place. Consider it a liitle better than hotels you rent by the hour.", "Date": "September 10, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Terrebonne, Canada", "Title": "“Not bad”", "Author": "boule", "ReviewID": "UR19609402", "Content": "Room was small, service can be with more smiles, location was great. No breakfast, fee for parking. It was clean.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlottetown, PEI", "Title": "“Excellent Experience”", "Author": "MerrySox", "ReviewID": "UR19252553", "Content": "Our experience with the HoJo Fenway Park hotel was unbelievable. As huge Red Sox fans, my girlfriend and I had been looking forward to our trip for months. Because the hotel is located directly beside Fenway Park, it seemed like an obvious place to stay. We weren't disappointed. The room was very clean and was kept that way by the excellent housekeeping staff. The people at the front desk were extremely helpful, going as far as walking outside with us to the sidewalk and giving us very precise directions to a number of excellent restaurants within walking distance of the hotel. The in-hotel restaurant featured great food at great prices; we highly recommend the \"All-American Breakfast.\" All in all, our time spent at the Howard Johnson Fenway Hotel in Boston was a very enjoyable one. We plan on visiting Boston again in the future and will definitely be staying at this hotel again!", "Date": "August 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trappe,MAryland", "Title": "“HoJo's - Best Hotel in Bosotn!”", "Author": "jyates17", "ReviewID": "UR19128017", "Content": "My family andI have been traveling to Boston my whole life and the \"HoJo's\" is our favorite place to stay. We have stayed in other hotels and none are as wonderful as the Howard Johnson at Fenway. We just can't get enough. We love EVERYTHING about it. The customer service you receive there is wonderful. No matter when we go, and we go several times a year, the staff is always so pleasant and friendly. The life guard at the pool is great, the maids that clean the room are great, all the way to the staff at the restaraunt downstairs. I would recommend HoJo's to anyone that is going to stay in Boston. You get a welcoming, family oriented atmosphere that makes being away from home relaxing. I just love that place and can't wait to go back in October.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "worcester, ma", "Title": "“Loved the Location”", "Author": "dee2769", "ReviewID": "UR18006934", "Content": "It was a great location especially how close you are to Fenway Park. It also has great restaurants across the street. Everything you need is very close to the hotel. The room was also nice and clean and a good size. I would definately stay there again.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Convenient and Affordable”", "Author": "karsus9", "ReviewID": "UR17737088", "Content": "I was visiting Boston on short notice, and was quite pleased to find this establishment. Located near convenient T stops and Fenway Park, it was extremely clean and comfortable. The staff were excellent, and I couldn't have asked for a sounder night's sleep. To top it off, the price was far better than other exorbitant fees in the area. Highly recommended.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Saint George, Canada", "Title": "“Great for Sox Fans But Quality Issues”", "Author": "StandingRoom", "ReviewID": "UR17671771", "Content": "Ok, if youâ€™re traveling to Boston with \"the guys\" to attending a Sox game, this is a great spot since it is located directly adjacent to Fenway Park (many rooms have a Fenway view)! Now if you're heading to Boston with your family and not willing to sacrifice cleanliness to sleep next to Fenway, you may find this spot a little \"worn\" and over-prices as a result. I have traveled to this hotel every year since 2003 and have watched prices increase only to see no renovations to rooms or facilities. Many rooms smell of must and mold, which may not a concern when vacationing with the sports team or guys! The hotel is close to Kenmore Square, with Kenmore MBTA station, Dunkin Donuts, Popeyeâ€™s, McDonalds, ect. (5-10 minutes walk) There is a McDonalds and several drug stores located next to the hotel with a Burger King and Shawâ€™s Grocery store to the west of the hotel. There is a great night life on Lansdowne Street, a few minutes from the hotel. This hotel needs major renovations (we've seen stains in 2003 that are still present) or need to be rebuilt (which may be in the plans)! If the price was on par with the quality one might not real to bad about staying here but there are other hotel options in BackBay/Downtown for a similar price and high quality. As mentioned in other reviews, the staffs at this hotel are wonderful; it is a shame that the product is not the same.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Great Location, Great Staff”", "Author": "ABSOXFAN", "ReviewID": "UR17341678", "Content": "With the proximity to Fenway Park, it's an excellent place to stay if you're catching a Red Sox game, plus it's only a 10 minute walk to downtown. Not only that, the staff are absolutely fabulous! After numerous stays at this hotel, there is nothing that I can complain about. Compared to other major city hotels, the price is more than reasonable.", "Date": "June 29, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "vermont", "Title": "“Great Place to crash for a redsox game”", "Author": "biztravelerelvis", "ReviewID": "UR17154020", "Content": "I stayed here with a bunch of guys for a bachelor party. Perfect! Fenway right next door. Great hotel bar. The bartender Mary Beth is awesome. If you need a place that is reasonable and don't expect much else it's perfect.", "Date": "June 23, 2008"}], "HotelInfo": {"Name": "Howard Johnson Inn Fenway Park Boston", "HotelURL": "/ShowUserReviews-g60745-d94354-Reviews-Howard_Johnson_Inn_Fenway_Park_Boston-Boston_Massachusetts.html", "Price": "$166 - $228*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1271 Boylston Street</span>, <span class=\"locality\"><span property=\"v:locality\">Boston</span>, <span property=\"v:region\">MA</span> <span property=\"v:postal-code\">02215</span></span> </span> </span> </address>", "HotelID": "94354", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/88/8b/888b9e47250d8e511d23414cc4d8c8171large.jpg"}}