{"Reviews": [{"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Malaysia/Singapore/Australia", "Title": "“NEVER EVER STAY HERE”", "Author": "Renee82", "ReviewID": "UR115872789", "Content": "WOW. I referred to reply on my post (long time ago but still valid nevertheless). Sarcasm at its best from 'resort' manager. Last line was epic. No wonder this place has been voted the worst in Singapore.", "Date": "July 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Singapore", "Title": "“Worst Resort - Bed Bug and Dirty”", "Author": "apple_first", "ReviewID": "UR98500348", "Content": "I was shock of the bed = bug and bugs everywhere . The toilet, bed cover, rubbish and everything. This is the worst resort i ever stay. Staff was rude and service was really bad.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Horrible Service and Hidden Charges”", "Author": "xinli29288", "ReviewID": "UR55062987", "Content": "We visited this place for a 21st birthday party. The service staff were very rude and they have strict guidelines such as no outside caterer furniture and they would make a scene in front of the guests instead of being nice and polite when they demanded that the caterer furniture be paid for per chair. You cannot move furniture outside of the chalet as the security guard would demand them to be put back even if it is just in front of the chalet. There is almost no security although the premises is being guarded by a security guard. There are not gates. The environment outside retains the nice charm of the 1980s but some of the lights are no longer working and brooms and stuff are being left at the turnstile which is not longer in use. The main building is quite dark and gloomy when I arrived. The only good thing is its value. Nice value but horrible service. The stay was ruined by the strict rules imposed, the additional charges for the catering furniture, the bad attitude of the staff. It is such shame that the historic Costa Sands has deteroriated to such a stage under the new management.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Malaysia/Singapore/Australia", "Title": "“Not Recommended.”", "Author": "Renee82", "ReviewID": "UR18330409", "Content": "I booked this chalet for a gathering. Upon checking in and inspecting the place, I had requested staff to help clean up huge puddles of water in the duplex. We couldn't possibly use the white towels provided for guests to clean the floor.Throughout the day, my friends called and requested for clean up as we were expecting kids. Each time we called, and we had even walked over to reception a few times, staff said yes, they would do so immedately. Lip service. They never did. As expected, even with close watch, kids tripped and fell. The whole place is so run down with holes in the walls, broken funiture, broken toilet. I did know it was under renovation, but that was too much. Plenty of millipedes in the bathroom too and broken taps, fridge not working properly as well. Please do not waste your money on this place.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pune", "Title": "“Average service”", "Author": "crazydancing", "ReviewID": "UR16796504", "Content": "We arrived at the hotel on 6th of May 2008 at ard 10pm. There was no bellboy available and we were given rooms at the end of the resort,because of which we had to carry all our luggage till our rooms. We were a tour group of 25 people and all of us were dissatisfied with the welcome that we had. Also the breakfast used to get over before the time sloted and the service was not quick because of which we missed having our breakfast . The rooms are fine but we missed all our fun because of the poor service.", "Date": "June 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thailand", "Title": "“Loved the experience!”", "Author": "VTrav", "ReviewID": "UR16385522", "Content": "The rooms were good, the view was great and the service was acceptable. I diden expect this kind of a view in singapore even though ive been traveling for years! In malaysia, yes but if i go for this kind of a resort the distance to the nearest city is in hours! in this case it was only 17 mins by taxi (yes i timed him..) The atmosphere was so perfect that i could not help myself but awe at the view as time went by! I'd reccomend this place to all those who want 2 c a peaceful side to Singapore, but don expect the rooms to be the same type! (the quality is not bad, but normal hotels provide a more controlled environment...) The area though needs some building up with more facilities... i'll try to upload some pics of the area next time if i can find my camera! ;)", "Date": "May 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "sydney", "Title": "“\"The faulty towers of singapore\"”", "Author": "MissDSydney", "ReviewID": "UR14845912", "Content": "Don't stay at this hotel unless you want to throw your money down the drain ,or experience the worst service in singapore just so you have a good story to tell your friends! For $200 a night you can expect - A very rude reception as you arrive, they make you pay for the whole week upfront. , the whole check in took about an hour as they handwrite everything, while I was waiting I looked around the lobby and spotted shabby second hand sofa's, plastic garden chairs a broken pool table and about 500 old matresses stacked on top of each other! Our room was dirty the bedsheets had holes in them the toilet didn't flush and leaked out the back, no tea or coffee. Breakfast was a joke, the choice of hard boiled eggs, cold greasy noodles or hot dogs served on paper plates with plastic knives and forks. outside our room about 50 old broken lamps and light fittings had been dumped. What is this place! I tried to complain to the manager but he looked like he was about to breakdown crying and I ended up feeling sorry for him....", "Date": "April 7, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Singapore", "Title": "“Most disappointing resort!”", "Author": "UnhappyStay", "ReviewID": "UR13399223", "Content": "Even though the resort has been renovated and the furnitures are new, the room is very smelly. Advise anyone planning to stay there to bring air-freshner. As a beach-side \"resort\", we would never expect that we have to bring our own towels because the hotel will only provide two towels for a room with 1 single + 1 double bed. There is no blanket or quilt, which means either we leave the door or windows open (which do not have mosquitoes net), or we will be freezing if we use the air-con. In addition, if you are planning to have any water activities or BBQ at night, make sure you bring a hair-dryer as no hair-dryer can be loaned. There is basically no service at all and all BBQ things need to be rented from the self-service mini-mart. The attitude of the manager was absolutely unhelpful when we requested for extra towel for our child who is sharing the room with us.", "Date": "February 9, 2008"}], "HotelInfo": {"Name": "Island Resort", "HotelURL": "/ShowUserReviews-g294265-d951092-Reviews-Island_Resort-Singapore.html", "Price": "$140 - $205*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1110 East Coast Parkway</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">449880</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "951092", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bc/2f/80/island-resort-thumbnail.jpg"}}