{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Northport, New York", "Title": "“Tiny room, good location”", "Author": "ktitone", "ReviewID": "UR139854798", "Content": "You're really close to the metro here. Good location, central to some good nightlife in a cute neighborhood. There was wifi in the rooms. However, I definitely felt like I overpaid for this room! It was TINY! The amenities were very minimal, and there was a half eaten sandwich in the fridge. The shower was tiny too- it seriously won't fit a big person.", "Date": "September 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sicily, Italy", "Title": "“Extra Tiny Small room”", "Author": "dave19764", "ReviewID": "UR139762606", "Content": "My single room was extremely tiny! The venue is ok, is few steps close to the underground, this is great! The cleaner shout too much when they cleaned the room beside me. My room was clean, except for wet carpet already used. The bed is not confy, is quite hard!", "Date": "September 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great value compact hotel in excellent location”", "Author": "boat1021", "ReviewID": "UR139155284", "Content": "This hotel may not be all things for all people, but if you are looking for the following it is an excellent choice: - Great location (right in the heart of Sheung Wan, close to MTR station, ~2 blocks from express bus to the airport (or walkable to the Airport Express at Central), interesting neighborhood with lots to explore, near Macau ferries as well) - Clean modern facilities (comfortable bed, spotless shower and bathroom) - Compact room that are fine for sleeping (If you have a lot of luggage, could be inconvenient....and don't expect much more than a bed + bathroom + hallway) - Good service (friendly check-in, 24 hour availability) It is important to remember what you aren't going to get in a hotel like this as well though: - A large room to hang out in (don't plan to spend a lot of time in the room - and why would you? HK is a great city with all sorts of places to explore) - A wide range of amenities you would expect in a full-service hotel (You get what you pay for in a major world city. There isn't a gym, restaurant, bar, lobby, lounge, etc....but of course the neighborhood has a lot to offer) - A wonderful view (you are in a local neighborhood, not along the harbor) So if you are looking for affordable, above-hostel quality accommodations in a great location in Hong Kong - and don't need a lot of frills, this place should work out great.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Great hotel but you can have very noisy neighbours”", "Author": "Meryl D", "ReviewID": "UR138080785", "Content": "The hotel is very well situated, literally less than a minute from the MTR station which enables you to easily go everywhere in Hong Kong. Restaurants, shops and supermarkets are nearby. Price is very interesting for Hong Kong. The room was bigger than expected. It is in fact narrow and long and has a nice, rather big bathroom. The room is well equipped, including a DVD player and nice and easy way of turning on and off the lights in the rooms. The bed was very confortable, the room and bathroom were cleaned every day. There is a nice wifi (no cap on data). People at the reception speaks a correct English. However even if the hotel is great, depending on how the room is organized, your bed may be next to the door (mine was but not all my neighbours') and the walls are quite thin and therefore you can hear EVERYTHING happening in the corridor. I might have been very unlucky but my neighbours were really noisy (and crazy), going back to the hotel all night long (from 9pm until 4am), chatting noisily on the corridor, may be drunk, taking a shower until 2am (you can hear the water running). On my last night there was even a couple who fight at each other. Therefore you really need not to have a light sleep. I will definitely return to this hotel as the rest of it is great and I might have been just unlucky with my neighbours but if I book a room I'll try to tell the hotel I want a QUIET floor.", "Date": "August 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Florida, USA", "Title": "“Room is tired, needs basic repair work”", "Author": "UsuallyFarFromHome", "ReviewID": "UR136553347", "Content": "I have stayed at several of the Mingle hotels, including this one about a dozen times. I keep returning because the price is right. Yes, the rooms are very small, but I just need a shower, a place to sleep, and Internet. The place is bright, clean and efficient - very clever and smart use of the small space. Very easy access to the MRT. Food and laundry nearby. Good, so far. Usually, I leave a good review, but the trend on the condition of the rooms is clearly in the wrong direction. There are lots of little things that would not be that difficult to fix, but don't get fixed. I have never had a room at this Mingle with shower water that would stay at warm. Set it how you want it and in a few seconds it is either too cold or two hot again. You get about 10 seconds at the right temperature. This time I got the same room as a few months ago, and the very same little things were not fixed. A strip of wall covering next to the mirror ripped off and staples exposed. The button in the shower to change from the hand wand to the overhead shower was missing, stuck in one position, and it just wouldn't take much to fix it. The tile over the toilet that probably covers the hot water heater is broken and held in place by a bunch of ugly black tape. Guys, at least get some tape that is the same color as the tile! Somebody has stopped caring about this place, and that is too bad, so I have found alternatives. Maybe I'll give the Mingle a year off and then come back to see if they have done some of these basic repairs.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tokyo", "Title": "“Perfect for short stay”", "Author": "Anna-Maria M", "ReviewID": "UR136339016", "Content": "I spent only few days in Hong Kong and stayed in Lite room. That is perfect for short stay and if you only plan to sleep in your hotel. It's very clean and comfortable with soft bedsheets, clean shower and nice bedside lighting. The room is very very small though. There is no special place for bug luggage, but if you are a backpack traveller, this room is perfect for you. Location is also good on Hong Kong island as pretty much everything in the centre is walking distance and there's a metro station just round the corner.", "Date": "August 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Malaysia", "Title": "“Not good but acceptable”", "Author": "Lugosi915", "ReviewID": "UR135936080", "Content": "Stayed here for 10 nights during May 2012 due to Business trip. The room is small as expected, but acceptable. Room with attached bathroom and basic amenities. Strongly need improvement on sound proof for the wall as you can clearly hear the conversation inside/outside the room. Location is very good, walking distance to MTR, HK-Macau Ferry Terminal etc. 24-hours convenient stores are nearby too. The phone and TV didn't really work well, but the staff tried their best to fix it. Do check the mini bar first time you enter the room and ensure that all the items are there otherwise you will be accused to have taken the item and asked to pay for it.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Torn carpet, blocked fire escapes, unhelpful staff”", "Author": "ianfly", "ReviewID": "UR133498643", "Content": "Housekeeping trolleys, bags of used linen and hotel paper product supplies block the fire stairs. My room had torn carpet leaving exposed metal spikes beside the bed. The wardrobe door could not open fully as it hit the TV. Paintwork in the bathroom was cracked, and there was no hot water in the shower 3 times out of 4..... and that was in the Executive room I was moved to from the first room with a broken shower. When I first asked for the move I was told I would have to check out by noon next morning - and wait with my bags on the street until the 2pm check in time when a different room could be allocated. I was also asked to leave a signed credit voucher with no amount filled in - on top of being required to prepay the entire stay at check in. Eventually we agreed that I would leave a voucher for HKD500 for a 2 day stay and remove the mini bar contents from the room. The actual spend - HKD2. The location is convenient - but not worth risking your safety with blocked fire escapes, and poor maintenance.", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“It's small, but if you book an hotel in that location you wanna go out!”", "Author": "dariosir", "ReviewID": "UR132950668", "Content": "The small tiny room was clean and new, plus has a decent big bathroom, with a stupid position for the mirror.(I am coming from Tokyo were it was normal to have an airline style wc). The personal at the door helped me changing my reservation, anticipating it at no cost, and keeping my luggage after the check out time.", "Date": "June 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Pleasantly Surprised”", "Author": "Honestreviewer32", "ReviewID": "UR132869417", "Content": "When researching accommodation in Hong Kong we were shocked by how expensive the hotels were. Mingle on the Wing was extremely reasonable, in comparison to others, and included free wi-fi - something which was almost always extra in the 4 and 5 star hotels we looked at (but could definitely not afford!). Our 2 nights in Mingle on the Wing was about €136 all in, absolutely great value. Located in Central, only minutes walk from everything, including the Ferry terminal to Macau/Shenzhen/Mainland - our reason for choosing it as we had luggage. Also on metro line - a few doors down, and easy to get to Hong Kong airport and Kowloon etc. Hotel is REALLY small, does not offer any sort of breakfast, and the rooms are absolutely TINY. Do not underestimate how small they are - not a lot bigger that what you would find on a passenger ferry. The standard double is too small really for 2 people with luggage, and a little claustrophoic but its do-able for 1 or 2 nights. You really cannot swing a cat in the rooms, and my husband and I had to keep getting out of eachother's way to get dressed or to get at things. The hotel is modern though, and very well decorated and clean and tidy with friendly staff. Bathrooms again, are very small, but this place is definitely worth it for what you pay - a place to lay your head down at night. Next time I stay here I would probably ask for a suite though. I think it would be worth paying that little bit extra for more space, especially for 2 people with luggage, and definitely for any kind of extended stay beyond 2 nights. DEFINITELY TERRIFIC VALUE!", "Date": "June 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brummie in London", "Title": "“Perfect for first-time solo visitor to HK”", "Author": "WWEGuy", "ReviewID": "UR132641510", "Content": "Having been warned off the hostels in HK by two friends and left it too late to go down the AirBnB or couchsurfing options as I'd planned, I stumbled across Mingle Place On The Wing via wotif.com and ended up booking my first night in HK direct via their website. I was drawn by their location (genuinely 1 minute from Sheung Wan MTR station exit A2), the fact they had single rooms (and so wouldn't be paying for a non-existent second guest) and their reasonable price for the Wednesday night in question (although the rate was due to drop even lower after the weekend which I have since found out was because Friday was a Chinese holiday and there was also a conference on that weekend). Unlike some of the other recent visitors, I couldn't have been happier with my choice. I was expecting a small room and this was what I got, but as I wanted a simple, safe place to rest my weary head, it served its purpose. The room also had a safe (a pleasant surprise) and whoever said the shower was too small obviously didn't spot the overhead drench option and only used the wall-mounted one, because as someone who is 5ft11, that was most definitely high enough for me to fit under. Bizarrely, for a single room, it would have comfortably fitted two people in it too. The internet is fast (with indiviudal routers apparently in each room) and although I had a slight issue with the entertainment system upon check-in, this was resolved as requested whilst I was out exploring the nearby area. I was so happy with the place in fact that having spent a couple of nights in Macau and another night elsewhere in HK (see other reviews), I snapped up a Lite room for my last 3 nights in HK at the very reasonable price of 400HKD per night and is where I am whilst typing this review. If anything, I actually prefer this room as it is long and thin rather than square and so am able to hide my suitcase on a bench on the side. Once again there's a slight issue with the entertainment system, but once it is up and running again, I'll have an incredible selection of films to choose from and with something so ambitious and complex, I was expecting there might be the odd teething problem. I would have no hesitation in staying here again (hence I already am) and would highly recommend the hotel for any solo travellers visiting the city. I cannot comment on its suitability or otherwise for more than one person as I have no personal experience of that or their rooms.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Tiny and run-down rooms”", "Author": "cookie25", "ReviewID": "UR132264961", "Content": "Was attracted to Mingle Place on The Wing solely because of the location. Wanted to stay in HK island for a change and decided to settle for this since its so convenient and near the MTR. We are a group of 3, so we took the Deluxe Double Room. The Deluxe didnt sound or look that deluxe though, the room was too small to be called Deluxe, but enough for 3 of our luggages to be placed on the floor with ample walking space. Room condition was bad. Everything, from the desk to looks old and because of that it looks dirty to us too. The aircon was old and extremely noisy too. Luckily the bed was clean. The lift was right outside our room and it can be really noisy when other guests come back or are going out. The bathroom was in quite a terrible state. The holder holding the shower looks as if it's going to drop off anytime. Everytime after we showered, the floor will be wet even though we closed the glass door. There wasnt enough space for our toiletries and no space to hang our clothes in the bathroom when bathing, it's just really small! Hot water didnt worked on one of the nights until we alerted the staff. The fridge is almost close to useless as it is not cold at all. We bought our own drinks/milk and put them in the fridge, and it turned bad just over the night in the next morning. Why bother to put a fridge there when it doesnt even serve the purpose?! The best thing about Mingle is the free wifi access it offers. It let us stay connected with friends and family and is convenient when we need access to the internet. I also love that the 7-11 is just a few steps away from the hotel, its really really convenient. Not forgetting the close distance to Sheung Wan MTR, it makes it all up for the condition and size of the room. No complains about the staff. They are helpful. If the management of Mingle on the Wing could spent a little to improve and refurbish their rooms, Im sure it will be beneficial to them in the long run given the ideal location of their establishment. I personally do not mind small rooms, small rooms can be cozy too, but at least they have to be in good decent condition. Im not sure about their other rooms, but the Deluxe Double room we were in is REALLY old and run-down! Im not sure if I would be back to Mingle on the Wing again. If Im travelling solo or in pairs, I may consider since the location is really good. But for a group of 3, its not quite advisable to stay in Mingle. Unless the rooms especially the bathrooms are refurbished and improved, its not going to be a very pleasant stay, at least for me.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Just what I needed”", "Author": "Rejser2012", "ReviewID": "UR129731767", "Content": "I was in Hong with some friends but they left before me and had to book a hotel as a solo traveller for 3 nights. Most hotels are pretty much the same price regardless if you are 1 or 2 therefore I choose On the Wing - They had good prices for solo rooms! The rooms are small (as mentions many many times) but to me that is fine. The bed is however very short, I'm 174 cm/5.7 ft and too short in my opionon. The Wifi is super fast and really works. The entertainment system will movies was excellent, really enjoyed that:) Location is perfect, you can work anywhere and a lot of stores/food in the area. 7/11, startbucks, subway, Pret and loads of local places. As a solo traveller I will highly recommend this place - due to price, entertainment (Wifi, movies). But if you are travelling in a pair I would look at one of the bigger hotels for deals and comfort.", "Date": "May 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Erractic but considerably good value”", "Author": "Wayne H", "ReviewID": "UR129593275", "Content": "I've stayed at Mingle on the Wing 3 times in the past 2-3 years, and each time it's been a different experience. The 1st + 2nd time the front desk staff were grumpy and not very welcoming. But this trip has been nothing but wonderful .. I think each time I walked in + out of the hotel the front desk staff greeted me. Perhaps I was hallucinating? Location could not be more fantastic. EXIT A2 of Sheung Wan MTR. Bus A11 takes u from airport to the bus stop across Western Market in less than or aprrox. 35 mins. No doubt the standard room which I stayed each time are shoe-box size but considering the rate I paid this time HKD 650-700 I have no complaints. Keep checking the website and only book when the rates are lower, as it always happens. Regardless of the stay dates vs booking dates. It was Golden Week in China last week but surprisingly the rates were not as high as they could have been + were in the past year or two. HK - the city never ceases to amaze me! p/s there is no swimming pool but I think the cafe next door belongs to the hotel?", "Date": "May 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Expensive, miserable staff, wouldn't stay again”", "Author": "stellalocal", "ReviewID": "UR128305874", "Content": "I moved here from the Ibis North Point as it was full and I couldn't extend my stay. This hotel was twice the price and I expected it to be at least as good as the Ibis but it was very disappointing. The location is good, but that's about it. The room was tiny, I only had a rucksack and it pretty much filled the floorspace. The water in the shower was terrible, it took ages to heat up and then would go freezing cold suddenly and I'd have to wait for it to heat up again. The wifi was mediocre. The tv was incredibly slow to respond when using the remote. The staff were just plain miserable. There was one lady on the front desk that actually responded when I said 'good morning' or 'hello'. The others just ignored me, giving me surly looks, which I found pretty shocking for receptionists. The cleaner downstairs was friendly, maybe she should swap roles with one of them. Overall an expensive and disappointing stay, maybe I wouldn't be as harsh if I hadn't already stayed somewhere else.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Exactly what I needed - no more, no less.”", "Author": "Hazza H", "ReviewID": "UR127792737", "Content": "Hotel prices during the period that I stayed in Hong Kong this time were extremely high, so I chose to stay at this hotel for the price. I paid what I usually would for a 4-5 star hotel and was not really happy about paying so much to stay in a 'boutique hotel'... but I was happily surprised! Much better than I expected. Clean, quiet and comfortable. The bathroom was clean, the shower was hot and had great pressure, the bed was comfortable and the internet was very fast (and free!) Plus, the TV had hundreds of free movies to watch. Plus, the location is great! On a small but busy street on Hong Kong Island - you really get the feel for this place if you stay here. If you need somewhere to stay without the bells and whistles, then you'll be happy here. If you need somewhere with a restaurant, a gym and a sauna, then this is not the place for you. I'm thinking that in the future I might stay here again, if the price is right.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Size equivalent to the price”", "Author": "Jakub_KL", "ReviewID": "UR126909081", "Content": "I stayed in this hotel for one night as part of the short business trip to HK. Rooms are small so is the price, if you want to stay in the central part of HK and same time not pay a lot Mingle is the right choice. Bathroom is ok, room clean, service also ok although don't come there too early, they seems to be strict with the checkin and checkout time.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very very small rooms but location is ideal”", "Author": "K L", "ReviewID": "UR126704486", "Content": "Stayed here for one night and did find the room far too small. Once the suitcase was on the floor, there was literally no room to move at all. Shower room/toilet was reasonable. Strong selling point is the location of the hotel, right to Sheung Wan MTR station & short walk to LKF & Soho where the bars/restaurants are. Another negative was request for a double bed but given 2 single beds, but guess that could happen to any hotel. If criteria for room size it's not a big issue then hotel can be recommended because of low price for the area and location, but unfortunately for us the room was very small, too small for us.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Just what I needed!”", "Author": "Alytan", "ReviewID": "UR125778414", "Content": "Spent a 5 nights stay in this small but good hotel. We stayed in a standard room, the air con started to leak on the 3rd night. We complained to the hotel receptionist and we were changed to another room without delay. Besides from the occasional loud bangs of doors from others on the same floor, we had no problem sleeping and we loved the hard mattress. I do think the edges of toilet sink and shower cubicle can be cleaned more thoroughly. Love the location of this hotel, a lot of cheap and good eateries near the hotel, MRT is just one block away, tram stop is also another stop away. This was my third time staying at this hotel, would definitely go back again!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“\"Valued for money although small, Near to MTR\"”", "Author": "Evon_lst", "ReviewID": "UR124304156", "Content": "Stayed here for one night on Mar' 11, booked a standard room for 2 ppl, although the room is small, but bed is comfy and big enough to even sleep 3 ppl. Valued for money and way too near to Shueng Wan MTR. Rooms should have more better sound proofing as i can even hear the water from the shower next door in the middle of the night. Best for those who just need someplace to sleep after a whole day of shopping and eating.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida, USA", "Title": "“I keep comng back to the Mingle for the value”", "Author": "UsuallyFarFromHome", "ReviewID": "UR123395406", "Content": "The Mingle on the Wing has the right price and the right location. It is less than a minute's walk to the Sheung Wan MTR station and you won't find a better price for what you get. The rooms are certainly small, but they have everything you need, are clean and in good repair. One little agrevation is that it has always been tough to regulate the water temperature in the shower for some reason - get it to the right temperature and in less than a minute it changes - arg! The Internet connection is good. For the value, I'll keep coming back.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“A re-review after 3 years.”", "Author": "wanderlus", "ReviewID": "UR123338304", "Content": "It's been awhile since I visited Hong Kong. I remember my first review of Mingle on the Wing back in 2009 and it had brought significant readership and followers from my blog which many took an interest and stayed at the hotel. Having said that, my reason for staying in Mingle is definitely due to the location, which is in Sheung Wan. The sure way of saving taxi fare is to hop on the Airport Express Train that cost around HK$70 (Est US$9) to transit at Central MTR, pay another HK$24 to Sheung Wan MTR (Last stop on the Island Line in Blue). The nearest walk to the hotel is by exiting \"A2\" and try to look out for 7-11. Its just a quick 3 mins diagonally across. I never do like to comment on unpleasantness of the staff bearing in mind that they still need to keep their jobs but that particular trio on shift, showed no interest or hospitality on their faces. I was allocated to a room, which was directly in front of the lift and what made it even uncomfortable was that the bed was directly facing the main door and lift door. In chinese feng shui, one should never have their feet facing directly the main door, as it signifies the 'coffin position'. I was ill throughout my stay and was little disturbed by the chattering of the chambermaids due to the close proximity to the next room and thin walls. As mentioned by another reader, the bed takes up pretty 95% of the sleeping area and that, my friend, is absolutely true. It is unusual for me to switch loyalties and find a new place or environment to stay in but I think I've outgrown my time with Mingle and unless you upgrade to an Executive or Deluxe Room, which I was unable to upgrade as it was full. On the positive side of things, it is definitely a place in the heart of a nostalgic sleepy district, great in-house movies to watch, a Skype phone to connect to your account and decent music systems. My take is, something gotta be revamped to take the hotel to greater heights.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Not great”", "Author": "hayhefen", "ReviewID": "UR122911812", "Content": "I stayed here 2 nights with a friend on the 2nd floor, the room was small, the air-conditioner was constantly leaking, the TV didn't work, 1 day the electricity tripped and the whole system couldn't work for awhile and the bathroom door kept getting stuck and couldn't be closed. I felt it was over-priced, despite the great location. Our friends had better experiences though. Perhaps the room closest to the staircase on the 2nd floor should just be avoided!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great base to explore Hong Kong”", "Author": "J-dog9842", "ReviewID": "UR122551466", "Content": "My wife and I spent 5 nights here over New Year's Eve (2011-12) and can thoroughly recommend it. Pros: the main pro is the location. You can see the Hotel's entrance from the Sheung Wan metro (MTR) exit - it's a 60 second walk. If you're not familiar with Hong Kong, being so close to an MTR station is great. You can be anywhere in Hong Kong within a quick, cheap and easy ride on the metro. That being said, the location is also good enough that you can walk to plenty of the key places, including Soho (10 mins), the Central Ferry Terminal (10 mins) etc. There's a Starbucks around the corner, plus a 7-11, restaurants, ATMs etc all on the same block. In short, it's right in the heart of Hong Kong island. - other pros include fast (and free) wifi in each room, plus a big TV, DVD player and even a decent sound system, funnily enough. Also, the staff all speak decent English and will help with directions, restaurant bookings, recommendations etc. The cleaning staff did a great job every day, and we left our laptops, cell phones, passports etc on the bed when we went out, without any problems. Cons: the standard rooms are clean and modern, but tiny. Seriously tiny. Like novelty size. The bed takes up about 95% of the floor space. For us this wasn't a problem, as we were out exploring most days and nights, so it was fine to return to the room and sleep/recover and watch TV in bed. But if you have other plans, this might be a factor for you. The bathroom was also tiny, but clean and modern. - The price for New Years Eve (A$400+ p/night) seemed crazy given the size of the room, but this was the cheapest room just about anywhere on Hong Kong island for that time, so we can't complain. We'll be back.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Nice, clean hotel for solo traveller. Location reasonable depending on your itinerary”", "Author": "hmtan", "ReviewID": "UR121550273", "Content": "Stayed here over 3 nights in the lite room for my short trip in Hong Kong. Room is definitely small but spacious enough for 1 person. However, if you have big luggages and have many clothes for hanging in a cupboard, space might be limited. Perhaps the bigger rooms might be more spacious? Location of the hotel is good, less than 5 mins walk from Sheung Wan MTR station (Turn right after taking the A2 exit). If you plan to travel to Mongkok or Tsim Tsha Tsui area, the train rides are quite fast too. Of course, it is within walking distance to Lan Kwai Fong and you can save the cab fare on a late night out. Roughly about 5-10 mins walk. Condition of the room is good, nice and clean. Free Wi-Fi and free movies on demand. The downside might be the noise if you are a light sleeper as you will be able to hear the closing of doors and people talking outside the corridors. Toilet is small but still bearable. Overall, it was a pleasant stay and had a great 3 days in Hong Kong.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Good location, reasonable value for money”", "Author": "Terry_in_Oxford", "ReviewID": "UR120813045", "Content": "I needed to book somewhere last minute for one night, that allowed me to easily catch the train to the airport in the early morning. This hotel is small and so are the rooms, I had a deluxe double room which I would still describe as \"compact\" (maybe able to swing a small cat...) but it was fine for one night, the bathroom was clean and after running the water for a while the shower was hot. The on-demand movie facility in the room was an unexpected extra. The front desk staff were pleasant enough, although I did not need to ask them to do much. Hotels in Hong Kong are expensive compared to many cities so never really great value for money, and even more expensive if booked last minute, however this one was cheaper than most and is in a convenient location. It is very close to an MTR stop and in theory you could walk to the Airport Express station, however not with a large suitcase... a taxi costs about HK$25 each way (which is essentially the minimum fair with luggage).", "Date": "November 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kaohsiung, Taiwan", "Title": "“Not Bad”", "Author": "FormosaKT", "ReviewID": "UR120644362", "Content": "My wife and I stayed at Mingle on the Wing for one night at the beginning of November. It served us fine. Yes, the room was tiny but we weren't in it for very long. The bed was comfortable and the bathroom was alright. It's location was great. Just a few steps away from the subway and only a stop away from Central and Lan Kwai Fong. We paid a bit too much as it was a busy weekend for conferences and conventions and they increased their rates but would stay there again if there wasn't so much going on in the city.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Disaster of a Place”", "Author": "Geoff W", "ReviewID": "UR120367248", "Content": "The rooms are tiny and the staff unhelpful. The appointments are o.k. and the room was clean albeit the smallest area outside a submarine I have slept in. They cut power to the room at check-out time and with no windows it was pitch black. Never experienced such a lack of customer service like it previously. Look around there are much better than this at the money. No windows in the room. Clearly a prevention of suicide measure for people who choose to book here and find what they have done!!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Much better than expected..... A Gem found....”", "Author": "SFOFriend", "ReviewID": "UR120045359", "Content": "I visited HKG during mid-Oct when hotels occupancy are either FULL or 4X higher than normal. I ended half of my stay here with a single room. When entering the hotel, I had a bad omen. The hotel entrance is just a door, I meant literally a door and can be missed if you walk too fast. The lobby is narrow and when someone is checking in, the passage between the entrance and elevator will be blocked. I went to my room, it's small as expected.... It's HKG, what do you expect. The room is pretty good, much better than I expected. Bathroom is clean which I care a lot about. Shower room is a good size, I had shower room in HKG hotel where I will touch either the wall or the curtain when I turn. Bed is clean, didn't find any problem and slept well during my stay. There's window in the room. TV has many channels, I didn't spend much time watching TV but did watched some local and Satellite Channels and in addition there's a DVD player which I didn't use. A/C is functioning. Room has a mini fridge which is useful. LAN & WiFI is provided free of charge. The front desk is very helpful, providing suggestion and willing to go an extra mile. Location is excellent. It's in a very safe neighborhood, ok to go out and come back late at night. Very close to transportation. Ferry terminal to Macau/Shenzhen is just a 10 mins walk away. Subway station entrance is just a stone throw away. Two convenience stores are just steps away. Hong Kong Tramways is a 3 mins walk if you have the time to ride slowly and enjoy the different views of HKG main street and inexpensive too. Tons of must-try or to die for HKG delicacies(Lin Heung Tea House, Lan Fong Yuen, Tai Cheong Bakery, just to name a few) are within 30 mins strolling distance. Conclusion, I will definitely come back again and not spend excessive $$$$$ on accommodation. Will definitely recommend to friends who visit HKG.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“bargain neat place but drawbacks”", "Author": "greenpossum", "ReviewID": "UR119801920", "Content": "First of all the facilities are very comfortable and a great deal considering the prime location (50m from the MRT entrance) and scarcity of HK land. I had a Lite room for one and in fact didn't feel the lack of space, maybe I happened to get a room with a good layout. However there are some things Mingle could improve on. First of all, invest on quieter doors. You can be woken by an inconsiderate neighbour slamming their door coming back from a late night out. Also improve the soundproofing, you can hear your neighbour coughing in their bath. Also the gee-wizz technology is cute, but can be hard to figure out and is unreliable. When I was there, the on-demand movies and music crashed.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Excellent price given the location”", "Author": "LittleWingBrisbane", "ReviewID": "UR119208126", "Content": "This hotel is smack in the middle of Hong Kong Island, and is cheap as chips relative to other hotels in the same location. I had 2 nights there in September 2011 and was more than happy. The rooms are, as other reviews state, pretty small, but then you're in Hong Kong and space is at a premium. I was by myself and it might have been a bit more of a squeeze with a partner, but you get everything you need. They have free internet and access downstairs in the lobby. Lifts are pretty slow but it's only 12 or so stories high. Shower and bathroom are both fine. It's actually not that easy to find - it's worth checking the map before you search it out from Central Station (I didn't bother and had to search around a little bit late at night). The best thing is the location - the hotel is right in the middle of town and walking distance to the tram up to the peak, public transport, the water front and pretty much all tourist destinations. Soho (good for bars etc) is about 600 metres up the road. Reception was super friendly and helped me figure out how to meet up with the people I was visiting etc. If you're looking for a cost-effective but comfortable place to stay while you're visiting Hong Kong, this hotel is perfect.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Meets expectations”", "Author": "traveltim", "ReviewID": "UR119174377", "Content": "I chose Mingle because I needed a place to sleep for a few hours, in a good central location, clean and comfortable, and didn't want to spend to much. This place met all my expectations. Location is excellent, within walking distance to airport express, and close to Central. As expected, the room is small, clean and efficient. I agree with a previous reviewer that maintenance could be better; some tiling areas and fittings need to be tidied up, but generally it is comfortable and quiet. I can't think of much to complain about. I would stay there again if travelling alone and not requiring much space.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“more than expected”", "Author": "MaebelleEllebeam", "ReviewID": "UR118572848", "Content": "i got a bit apprehensive after booking Mingle on the Wing when i read some of the reviews about it. when i got to the place i was pleasantly surprised, more so when i got to the room. yes, the room is small, but everything i need is there! the bathroom and toilet are fully functional, toiletries that you will need are available, there's a refrigerator, the wifi is fast, staff is pleasant, the tv has discovery and national geo (when you find time to watch tv), there's even a small balcony that you can stay in. the room is clean and is maintained well. it is very near the mtr, close to the western market and loads of other malls and shops. i read somewhere that it can get noisy especially if your room is near street level; i did not have that problem, i slept like a log. i will definitely go back to this place, it was perfect for what i needed and more. i am a very happy customer.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Nice Quick Insight”", "Author": "Shpaki", "ReviewID": "UR118474658", "Content": "very nice small hotel on on of the main street. just 2 seconds from MTR. close to shopping and evetything else. great internet rates. nice room. even slippers were there. no breakfast. al in all enjoyable and convenient! excellent for visiting a friend for 3 nights!", "Date": "September 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good things do come in small packages”", "Author": "BPAdventures", "ReviewID": "UR118291342", "Content": "We had a great stay in this hotel. The rooms are small relative to a normal hotel room, but this is Hong Kong so not sure what other reviewers expect. The room was clean and well maintained. All the technology was working during our stay. We enjoyed some of the movies from their very impressive collection. Our frustration were tiny: poor lighting at the sink in the bathroom, no CNN or BBC and the shower water went luke warm afte about 10 minutes. The room is not a bargain, but for Hong Kong it's a good deal.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Seoul, South Korea", "Title": "“Location and price are still great”", "Author": "JohnK2", "ReviewID": "UR118039580", "Content": "Mingle on the Wing is still cheap compared to most places in HK, especially with such a fantastic location. My wife and I have stayed here at least 10 times in the past 3 years. They are perhaps thinking that price and location are enough however, as the maintenance has been slipping over the past few visits, now getting to the point where even the towels are starting to be frayed or holey in the shower. The room size while small is fine, and shouldn't be a surprise to anyone in HK. Overall, at 5-600HKD a night it is still worthwhile, but having seen last minute rates rise on various booking engines lately to over 1000HKD I would really have second thoughts!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Location + Price = Perfect”", "Author": "jarokun", "ReviewID": "UR117112384", "Content": "There are a lot of negative articles concerning this hotel, which surprise me. Let me address some of the main ones: 1. Rooms are small - YES! This hotel is in an amazing location, one stop from central, in the funky Sheung Wan area. What do you expect for this very reasonable price? 2. Hard to find - Yes, this is true...but there is a great map on their website. Print it out, and you will have NO trouble finding it! 3. Technology - Yes, there is a lot of useless technology that is difficult to use as some may or may not work. However, unless you are planning on spending all day in the room, then does it really matter? Overall, this is a great, small hotel in a fantastic location, perfect if you are doing a few days in HK on a budget.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Beijing", "Title": "“Cheap, clean and convenient -- near Macau Ferry Terminal”", "Author": "tmmahony", "ReviewID": "UR116502662", "Content": "Mingle on the Wing, like its sister property, Mingle by the Park, is a rarity in HK: cheap, clean, centrally-located and a decent place to stay. If you book on a last minute hotel website you can get rooms for about HK$400-500 (around US$50-60). As between the Mingle on the Wing and Mingle by the Park, the former is better located if you are planning on taking a visit to Macau as it is very close to the Macau Ferry Terminal (walking distance). As with other Mingle properties, the Mingle on the Wing is in an old HK building that has been renovated with a certain amount of character and style, with pictures of old HK on the walls and tasteful tiles on the floors. It is also completely high-tech with free wifi and a large movie library on demand. Now if you are wondering what the catch is, it is room size. The rooms are tiny. I would advise against the \"lite\" rooms as they are really, really tiny. But the single rooms and above are livable (but if you are very tall then this probably is not the place for you). Basically, if all you want is a clean bed to sleep in, a good shower and free wifi in an excellent location, consider the Mingle on the Wing. Note, this property has an elevator (Mingle by the Park in Wanchai does not) so it is easy to get to your room, but given room sizes there won't be much space for a lot of luggage in any event. Again, this is a place for the solo traveler or couple who want a convenient and cheap base from which to explore HK but who are not planning on spending a lot of time in the hotel itself.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Orlando, Florida", "Title": "“Next time we will mingle elsewhere!”", "Author": "lovinlivin", "ReviewID": "UR116251914", "Content": "This was one of the worst if not the worst hotel I have stayed in, as far as upkeep and amenities. My paperwork said we would have twin beds for my daughter and I, but we were given two beds pushed together as a king size bed and crammed into a room with literally a one foot wide aisle on one side of the bed. It really was the size of a walk-in closet and felt claustrophobic. One of the sliding wooden window shades was off track so if you slid it to a certain spot it could fall on your head while sleeping. The ceiling-mounted A.C. vent was stuck almost shut so no air circulated, so I had to stand on my tippy-toes on the edge of the bed and was just barely able to pull it down into place. After several hours I also discovered the A.C. remote had no batteries so that was why the A.C. was not cooling the room. I also did not appreciate several black hairs on the bathroom floor, which had the appearance that it had not been washed or not washed well. I scooped them up before my teenage daughter saw them and was grossed out on what we had planned to be a special getaway for the two of us. There was a nice flat-screen television but the dvd player, music system and 200 movies library advertised on the website as a highlight of their rooms did not work. Our dvd came out in black and white and had no sound. The lady at the front desk kindly tried to get it to work but she is a desk clerk, not an electrician. She told us the second day that the dvd player was fixed, but now it only played the music track of dvds, no speaking at all. I told them it still didn’t work. The desk clerk was apologetic, but it was never fixed nor did we ever have any of the music or 200 movies advertised on the website. So instead of having enjoyable movie nights we scrounged around their 3 English-speaking television channels and found a Discovery channel program of skinning seals and a sappy Mom’s Cooking program. The electrical outlet is crammed way back inside a cupboard shelf that is about 5 inches tall so it is impossible to use the electric teapot which is placed on the shelf above it. Fortunately I found another outlet hidden on the tv table to boil water. Our second evening there, while we were in our room still trying to get that dvd system to work, apparently our phone was not working because my husband tried to call in several times and was told by the front desk that my daughter and I were not back to our rooms yet – causing him unnecessary worry that we were not back yet when we were. Our last morning as I hurried around to boil water for coffee and use my hair straightener, all the electric outlets in our room stopped working. This also meant that when I returned from getting something at the store for my daughter who had the stomach flu, the room's doorbell and also key system did not work so she had to get up from her sick bed to let me in. They did fix it when I notified them, but this was one too many of a series of poor upkeep on this property. On the positive side, it is very convenient to the subway. The bed was comfortable. One or two of the front desk clerks tried hard to help. The bathroom looked like it had been redone and was in some ways larger than the bedroom – but there was no place to put things so it still felt inconvenient. The neighborhood was good and the hotel was quiet. Mingle on the Wing looked like a place where my daughter and I could build some special memories together. We did build some memories, but not the kind I imagined. Thankfully we chose to see the unique humor of living in a closet, the repeated failed attempts to get the dvd system to work, and all the other things that if we didn’t laugh we would cry over – but I will remember what appeared to me to be the shoddy management and upkeep of what could be a very nice hotel. Next time, we will choose to “mingle” somewhere else!!", "Date": "August 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Pleasant stay, super convenient, 12th floor shower iffy”", "Author": "EatSeeDo", "ReviewID": "UR104696963", "Content": "Stayed for 5 days. Room is small & has no view but no problem; far better then tiny noisy quirky room @MIngle Park. You can walk around in room w/o smashing into fixtures. Twin bed is 6 feet longer, so beware if you are taller. Convenient free PCs in lobby. Location is fantastic, 2 blocks from MTR stop & tram. Wing Lok street is fine, quiet and no problems with dried fish stores. Multiple convenience stores within 2 blocks. Try the Cafe de Coral chain 2 blocks away. all fast food should be this good; recommend the glutinous chicken rice & coffee for breakfast @~HK$24, that's ~$3 US and very tasty! Only issue is shower, I stayed on 12th floor room and water temp kept alternating from very hot to very cold so it took 3X as long to shower.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Irkutsk, Russia", "Title": "“Small very small room even for Hong Kong but unbelievable price ...”", "Author": "otitov", "ReviewID": "UR99596802", "Content": "Location is fine and thats all. Tiny room, absolutely no hotel lobby, pictures and description on site totally disappointed. Yes, their have internet - but very slow, yes - have 5.1 system but for DVD only (can't connect my computer). And everything is cheap and dirty. Just throw away 900 HKD. Search within 1 mile and you have good (but old) hotel with great rooms and free upgrades for 570 HKD.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Changshu, China", "Title": "“Teeny tiny rooms, great location”", "Author": "travelgurl2011", "ReviewID": "UR97910802", "Content": "Mingle on the Wing was a last minute booking during the Chinese New Year and the prices were inflated and not worth it. The room was SO tiny, but the hotel was in a great location if you want to stay on Hong Kong island. For any other time of year, I am sure the price is more fitting. The staff that I interacted with were not overly friendly or helpful- which I was not expecting. For location and if you are not planning on spending time lounging in your hotel this is a fine choice, for a long vacation- you might want to find somewhere else!", "Date": "February 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Macau, China", "Title": "“Convenient location, bad housekeeping”", "Author": "herbsandspices", "ReviewID": "UR91474730", "Content": "We wanted a room for a night's sleep before catching an early flight out of Hong Kong. The location of this hotel worked well for us and it was better priced than other options. The taxi driver had never heard of a hotel on Wing Lok Street, but the staff was able to give him directions over the phone. We checked in a little after midnight. When we entered our room, we were dismayed to see big dust balls in plain sight on the floor. We complained and immediately got another room which was cleaner. The telephone in the room did not seem to work, although it was a fancy-looking branded phone; we had to call the front desk on our mobile phone! The room size was within expectations for this price range in Hong Kong. As for sleep quality, we were really tired and managed to sleep quite well through the night. We did not pay \"anything goes\" room rates, though. The big dust balls really showed how much housekeeping cared. I have little confidence in this property and do not recommend it.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Very cheap for HK. If it wasn't you wouldn't stay here.”", "Author": "FamilyfromBris", "ReviewID": "UR91370280", "Content": "I've stayed here on two occasions throughout 2010. I only needed a room for 12 hours or so whilst in HK for meetings so couldn't justify paying up for a decent hotel. Accordingly, I stayed here. Location is good. Price is good. Free Wifi is good. Nothing else is. It is dirty. All the technology overviewed on the hotel website simply doesn't work - eg the swipe card to my room didn't work so I had to go back to reception and get a good, old key. Suggest you stay at Bishop Lei on Robinson Rd if you're looking at budget hotels in HK.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Good for shorter people(*read on) and location”", "Author": "HelenAmsterdam", "ReviewID": "UR88166274", "Content": "We stayed at this hotel during Chinese New Year in 2009 - so a little while ago, but I'm especially blessed with a good memory, and we were chatting about our stay here just yesterday, which prompted me to write down our experience anyway. We chose this hotel because of its reasonable pricing during the national holiday. And because of it convenient location in Sheung Wan. It was literally a minute walk to the MTR station and walking distance from the Macau ferry terminal (a day /overnight visit I can definitely recommend to those staying in Hong Kong for a good few days), and with plenty of Chinese/Western breakfast options. The room itself was very clean, crisp white and despite being officially 'The Smallest Room We've Ever Stayed In', it had everything we needed. Also, there was free internet on 2 computers at the reception, which is always a plus as I'm aware that still most hotels literally rob your wallet when it comes to using their internet facilities. Now why do I mention that it's good for shorter people? Two reasons: - The room was really so small that we joked 'Oh dear, one of us is definitely going to trip over the suitcase at some point.' 15 minutes later, the man did exactly that. And I had a good laugh at him, before going through exactly the same the next day. - The beds! Before I go into this, my disclaimer: I'm half Hong Kong Chinese, and I LOVE my country of origin and its people. However it must be noted that the Chinese are often not the tallest people on the planet. Therefore, some establishments will have thought of this, some won't, or some don't have the space to. We think Mingle On The Wing falls under the third category, as there was just no way a longer bed could fit into the room. My partner, standing 6\" tall (1.83 m), had his feet and ankles firmly sticking out when lying down. I could just about fit in with my 5.6\" (1.70 m). He didn't mind too much, but admits that it's not too comfortable and will be looking for possibly a western chain hotel for the next visit. If you're staying for just a few nights and are as tall or taller, it's doable but not any longer. The only other concern we had was that in our room at least, there was only one tiny window above our bed which did not allow for viewing outside. So if you really feel the need to be able to look outside, this isn't the place for you. Mind you, should you not be staying in one of the spectacular 5 star hotels in the city, you're more often going to be treated to looking into another flat rather than any stunning city views anyhow. DO keep this in mind when travelling to a place like Hong Kong. The views always come with a price tag! All in all, if you're my height or shorter, and if your main value is a decent location for a stopover, yes, it's fine. However, if you're staying more than 2-3 nights, have a lot of luggage and/or if you're my partners height, consider staying at any of the many western chains found throughout Hong Kong Island and Kowloon, should you have the budget.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canberra", "Title": "“Small but great location”", "Author": "Ramblinman101", "ReviewID": "UR79015605", "Content": "When I booked this place online I really wasn't sure what I would get. A friend had stayed here on route to Korea and said the room was small, so I was worried considering I was travelling with a small child. At the end of the day, it was just what we needed. Yes the room was small, but apparently just about every room in HK is, and it was big enough to fit the three of us in nicely. The location is excellent. A minutes walk from the front door to the entrance of the Shwuen Wan MTR station (HK is SO EASY on the MTR), 15 minute walk to the Victoria Peak tram, and the food......the best Asian food IMHO is the \"hole in the wall\" and there are plenty of those nearby. About 5 minutes walk to Lin Heung, one of the best Chinese restuarants in the city. One small issue is the air conditioning. The temperature must drop about 10 degrees as you walk in the front door. That's nice, but it's a bit of a shock to the system when you walk back outside into the 30+ C / 90% humdity. It's like that on the MTR as well - lots of great air conditioning, but remember you will have to go outside some time. Great free WI-Fi, very fast. Two English speaking TV stations that I could find, plus Asian Channel V. Staff were great, and we kept our luggage in the foyer for free on check out day (7:30pm flight). Also, checkin for most international flights can be done at Central station, just a station up from Shwuen Wan which is just ridiculously convenient. This is a really good place to explore HK from and I highly recommend it.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“The Rooms Are Too Small!”", "Author": "Guccigirl25", "ReviewID": "UR78406754", "Content": "The hotel is so difficult to find, it is located near the dried food stalls behind the main road. When we arrived, it was a bit modern however it was too small. You would think it's not a hotel. The staff are friendly and nice. The door was so difficult to open, we had to force open them and we did that every time. The hotel is located in Hong Kong Island so the food and everything else are expensive. The room and bathroom are too small. It was very hard to walk around, my boyfriend and I would always bump into each other when walking. We did sleep comfortably though. I will not stay in this hotel again, I'd rather be at Tsim Sha Tsui area where accommodation and food are waaaay cheaper.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“This place needs some sprucing up”", "Author": "MarcusLiSGP", "ReviewID": "UR75534674", "Content": "Had stayed in Mingle on the Wing 2 years ago and was pretty impressed by it superb location and value for money. Was rather disappointed when I returned this month, the room condition has deteriorated - varnish on furnitures has faded, dusty in nooks and corners, and what's more shocking, there were giant silverfishes crawling beneath the wash basin! It's no longer value for money. Unless there is a major renovation, I won't be staying at Mingle Place again.", "Date": "August 16, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Small but Convenient”", "Author": "DocAppleV", "ReviewID": "UR68864788", "Content": "The hotel is very small, there was some confusion during check-in, but everything went on well after that. The room was also very small but the technology was very impressive, the wake up alarm was also great and the bathroom was very clean. The hotel is very near the metro station so it was quite convenient for us! We traveled with our 3 year old daughter and she was very happy to find some of her favorite cartoons on their list! Advise: you need to talk very slow and make sure they really understand what you are saying, don't assume that they know what you mean. You need to get the code for the free internet from reception desk. Also get the outlet converter while you're there too.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shanghai", "Title": "“A good value for money”", "Author": "junjie-blog", "ReviewID": "UR68124812", "Content": "After I stayed a night in a terrible hotel, I finally changed to come to the Mingle. I was a bit scared after read what was written on tripadvisor! Finally, it's a good place. I was in the \"Lite Room\" and for the price you get what you need. Fast and free internet, a shower/toilet and a bed for 1.5 person. A flat TV is added but don't try to work there as the table is definitly not a desk, or you will need your pillow on your seat... The bed was comfortable. The telephone was down as well as the light of the bed. The TV channels are not interesting. The service isn't amazing but they are not bad. Smilling when you smile, a special thanks to the womens who clean the room that were very funny and speak a little english. Close to the subway (30 seconds by walk from Sheung Wan station), a few minutes walk to the mid levels and Central. There is a coffee shop downstir that is not very interesting. We can't use the internet of the hotel :/", "Date": "June 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Got DOWNGRADED to teeny tiny shoebox!!”", "Author": "PennyW26", "ReviewID": "UR63075469", "Content": "I found this place for HK400 which seemed like quite a good deal. When I saw the size of my room, however, I understood why - it was the tiniest room that I have ever seen in my life! This didn't bother me so much as I was travelling solo, though I found the whole high tech gadget thing extremely annoying. You can't even reach out and flick a switch to turn the light off - it's all done by a stupid remote control that's really hard to figure out! Then the lights went in my room and didn't come back on, so I was moved to a single (from a superior single) which, staggeringly, was even smaller than my first room! Was pretty annoyed at being downgraded as the least they could have done was upgraded me! Luckily I was only there for one night and was leaving at 6 the next morning so I didn't have to spend long there. It's not an entirely unpleasant place to stay but make sure you don't get downgraded - it's not fun!", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“Looked a lot better on line!”", "Author": "Murdoch-James", "ReviewID": "UR62216743", "Content": "Only plus here was free broadband, but rooms tiny and poorly laid out. Seating at desk was so low I had to reach up and over to even get to my keyboard! Described as the ideal business hotel, one would have to say it fell well short of that benchmark. Not recxommended", "Date": "April 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Not a happy stay”", "Author": "carolzero", "ReviewID": "UR59982528", "Content": "I have only just checked out of this hotel... and not very happy about the followings: - The Bed smells of... well, doesn't smell clean at all and i guess they have not change the sheet as i can see some dirty marks on the sheet along the crease. (skin got very itchy later at night) - Suppose to be a double... the sheet is surely double but beds are two singles put together...very uncomfortable to sleep in. - staffs are extremely NOT friendly, nor helpful, lobby small and no air-con, was sweating at check in. - The Door Knob is broken and when i asked them they have no reply about the issue. - The TV/media system broke down (took 20 mins to fix) - The Patio Light is broken (staff replied \"yes, it was broken last week\") WT...??? didn't fix it... - Very thin walls... can hear people coming and going. - asked the male staff about late check out and he said the latest check out is 12:30 and so I told him I was hoping to check out at ONE... half an hour only and he said i will need to pay a charge??? what??? half an hour man... for god sake!!! Good things about this is - location (close to the last stop of the HK Island line) Sheung Wan. next stop to central - the superior room is VERY small but i got the one with patio and is something diff. - I paid at a rate HKG$550 for superior double.(last min) would not pay a penny more for this hotel~~!!!", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CPH", "Title": "“Clean & Bright in a Good Location”", "Author": "hol113", "ReviewID": "UR58351022", "Content": "I booked a superior room with a balcony at a very resonable rate. Entering though a big glass front door a friendly and efficient checking in staff member dealt with me. The room was ultra compact, bright and well laid out. Liked the T.V. system. Not much of a view from the balcony, but it did give the feeling of extra space. The bathroom was nicly appointed with a lovely shower. Good touches with shaving kit, toothbrush kit, comb and lots of different soaps. The two computer terminals located in the entrance were very useful. The only drawback was the noise from the water system when other people took showers in the room above - very noisy.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "singapore", "Title": "“A Pigeon hole”", "Author": "hpngpatrick88", "ReviewID": "UR55851235", "Content": "The room is definately too small for a couple to stay. However the room is high tech and good sound system. Location is good, next to MTR and near to Dry Seafood goods. But 400HK a night is not value for money. Greatly disturbed by the water pressure noise from the ceiling. No safe box. Will not stay again.", "Date": "February 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good place to stay on HK island”", "Author": "Eurotrash77", "ReviewID": "UR55834326", "Content": "Stayed at the Mingle for a total of 10 days in January. The location is great, on a reasonably quiet street in Sheung Wan yet only steps away from the subway - also loads of different restaurants in the area and only 10 minutes walk from Soho. Staff was not overly friendly but helpful. Would definitely stay there again.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Very Funky Little Place”", "Author": "lemonmerangue1", "ReviewID": "UR51270662", "Content": "I stayed here one night before catching a flight back home- they have what is called a \"lite\"room for single travellers. it is small but well set up with tons of gadgets and movies and so much high tech stuff I had to have the front desk come up and help me! I got it for an amazing price online but I think their regular prices are too high. I paid 350 Hong Kong dollars and it is on the island walking distance to Wanchai and Soho. Nice staff too.", "Date": "December 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Singapore", "Title": "“Clean but small rooms”", "Author": "euniceps", "ReviewID": "UR49150284", "Content": "We decided to book this hotel mainly because of the central location. The hotel was really difficult to find. We exit from the Sheung Wan station. The entrance of the hotel was very small and hard to spot. We literally walked past it. Luckily, with the help of the shopkeeper there, we managed to find it in the end. The rooms were quite small but they are clean and well made. We were a little surprised when we didn't find a safe in the room. On the second day, there was a blackout at our floor. All the lights were out and this made the packing difficult as we were checking out that day. The receptionist was trying to help as much as possible but I guess there's nothing much he can do. Overall, it still quite a nice experience staying there.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Lima, PERU", "Title": "“Can't find it at first, small as others in hong kong, but good hotel and great Hong Kong”", "Author": "Sergio_Claver", "ReviewID": "UR48657053", "Content": "So i arrived with the airport express to the central station I tried to use my airport express to take the metro to the next station Sheung Wan, wrong, the metro ticket guy tell me i have to pay 4 $HK, ok now i'm in the metro exit. I get to find the street Wing Lok but all the buildings are very small, lots of tiny shops, lots of persons, it's around 22:00. I ask a fellow in one of the shops, no problem with the english, i find the number, the front of the building is modern and different to all the other buildings but the enter seems old and dirty, it wasnt that the entry ! is the next door, much better, i arrived to the hotel. The reception is serious but respectful, two ladies, they make me an upgrade to the standard room instead the one i reserved \"the lite\". I was a little sad because i wanted to make the review to the lite, but as is a free upgrade, who cares ! :D OK, free wifi, and if you dont have your laptop you have pcs in the reception too. The bed has a decent size, the room is little and the space the minimum, but i have a plasma TV, Surround Sound, a hot shower and I'm in HKG, BIG TIME !. So I will suggest this hotel for couples and also for singles looking for friends ;) by the way the heat of the moment is around the corner ;) I really like hong kong, the time i visited it, hong kong was nice, warm (in all senses) and so alive. The only downside could be that in the metro and centric streets ... there is tooo much people ! :D anyway i will be there soon again, i know that by sure.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great value for location”", "Author": "meatshawarma", "ReviewID": "UR48164111", "Content": "This place is all about location, situated in the middle of Central. Tiny rooms, but quiet, clean and modern with comfy bed. Service a bit iffy but we didn't go there expecting Four Seasons service. Our double bed was pretty much the size of the room, but our room came with a big balcony(!). So long as you're not planning to spend all your time lounging in your room during your stay in HK, this hotel is excellent value. Recommended!", "Date": "October 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“you will be back.”", "Author": "wanderlus", "ReviewID": "UR46161749", "Content": "being a pseudo-hotel-photo-journalist, i have taken several shots of this small yet IT savvy hotel. the location is in \"sheung wan\", just a stop away from \"central\" MTR and if you are arriving from macau, this hotel is just a 10-15 mins walk away via a tunnel. been there, done that. everything is pretty much accessible and within reach. a convenient store to your right, a small local fast food chain and on your left, several shops selling bird's nest & other chinese herbal stuff. minus, the size of each room, swimming pool or gym facilities, which is incomparable to the \"big boys, Mingle makes up with the minimalist decor room for the IT savvy who needs to stay connected all the time. Think internet, skype & wiring your laptop to the telly. What more can i say? ever since putting up pictures of this hotel on facebook and giving testimonials, i've had & referred more than 5 different groups of guest to this bold & young hotel. one word to sum it up: you might be back on your next trip. (just like i did) - wanderlus®", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good value hotel in great location”", "Author": "manchai", "ReviewID": "UR45667728", "Content": "I stayed in a \"superior room\" for 3 nights. I travelled from Macau and the hotel location is ideal as it is a short walking distance from the Macau ferry terminal. The entrance of the hotel is not very easy to spot and I found out when I walked in to their cafe instead. I finally walked to their lobby which is tiny, although it is a good sign to see two computers by the side, meaning use of the internet. The room was actually not too small, although by no means large. I opted for their \"superior room\" rather than their standard room or lite room, which I could imagine must be very small. My advice is if you could afford a little bit more, definitely go for their \"superior rooms\". The quotation marks mean those rooms are by no means superior, they are just a bit better. The location is fantasic, metro stop is close by and Central and Soho district is within walking distance.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Macau", "Title": "“Great for budget travellers”", "Author": "Rhianna9", "ReviewID": "UR45142803", "Content": "I stayed here with my sister for one night, the rooms are small but when you are in Hong Kong you dont want to spend time in the room! The single beds are quite short, for me at 5'9'' but so comfy! Ikea furniture, looks cool and smart. Small wardrobe and not much space for a big suitcase. TV and DVD player, hairdryer, complimentary tea and coffee and ac. The bathroom is small but very nice with a great rain shower. Mini bar has no alcohol just juice but there are 7elevens on every corner nearby and a great little cafe next door for coffee and food. The staff are friendly, you can leave your bags in reception no bother all day, we went back at 11pm after shopping and exploring :) Free internet in reception. If you like travelling cheap but want something a little higher and nicer than a hostel this is the place for you!!!", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Perfect Hong Kong accommodation!!”", "Author": "bettyb20", "ReviewID": "UR44232181", "Content": "What more could you ask for from a city break in Hong Kong? Mingle on the wing was perfect. The location was ideal 2mins walking distance from the station and easy to get to from the airport. Staff were very helpful and professional. The hotel itself was much better than i expected for the price, as it was one of the cheapest accommodations I was able to find in the city. Yes the room was small, but this did not casue the slightest problem. The room was impeccably clean and had excellent facilities. Would stay again!", "Date": "September 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Great place, small clean rooms, MTR on doorstep”", "Author": "globetrotterNz", "ReviewID": "UR37689330", "Content": "I booked a Standard TWIN room with my mother but when we checked in, I was surprised to find that we had a double bed. No problems, just a little glitch with our booking - staff quickly fixed this up by separating the two single beds. The room was around 400 HKD/night (fromwotif.com), but be warned: the Standard rooms are very tiny. But I got used to it and after 2 nights it didn't bother me. After all we only used the room for sleeping and washing. Room was very clean with comfortable beds. The bathroom was clean too, fairly modern and reasonably sized. Only minor glitch was that the fancy techno light switches in our room didn't work very well, but this was not such a big thing. Location is fantastic - only a minute's walk from the MTR entrance (not the train platform, as you could spend hours walking through the tunnels, etc). The room was relatively quiet too. Room was on the 4th floor and I'm a light sleeper but there was very little traffic noise. I would definitely go back there - great value for money, clean, great location. Free internet in reception area.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "perth wa", "Title": "“Perfect... and cheap!”", "Author": "cbcbcbcb", "ReviewID": "UR36275712", "Content": "We stayed here for next to nothing. The staff were friendly, room clean, nice and the mini bar cheap. They had a big TV, lots of free movies, internet and and airconditioning. The most important thing however was that it was very close to the train-about a one minute walk. I would highly reccommend it.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Why stay in dingy hostels?”", "Author": "t-puk", "ReviewID": "UR35047997", "Content": "For just HKD270, you get a single room, comfy bed with proper linen, complete with free wifi, interactive lcd tv with free on-demand movies (not fuzzy pirated images)/music/online radio stations from all over the world (select country then radio station then play, although BBC 1/2/3 didn't work but Capital was fine - 2nd hotel I've been to with built-in online radio, the other being Pullman Bangkok), Pioneer hifi speakers, electrical sockets, flask, coffee/tea, wardrobe, dvd player (hidden in wardrobe), mini-fridge, paper slippers, alarm clock (mine wasn't crazy), proper toilet with glass door shower stall with rainforest shower head (fantastic water pressure, glass door closes properly no water spilling all over the place), toilet bowl with dual water-saving functions, sink and storage below it. Yes the room is tiny (L-shaped), but that's because the toilet is of decent size. I've stayed in different hostels, from Hotel USA to Yess In, and for the same price MOTW is a godsend, they've got bathrooms where your body can actually move and have a decent shower. Recep girls didn't smile alot but when I told them my speakers couldn't work, they promised to fix it and by the time I got back, it was done. When I enquired with the night shift guy he wasn't informed of the problem, but immediately went up to check. Such attentive service. The only thing I couldn't figure out was the skype phone, but didn't bother. There's also 2 laptops in the lobby for surfing, but if you need to print boarding pass (which is unnecessary), its HKD10 per copy. The MTR exit is 30 seconds away. diagonally across the street, there's a Fairway next to the hotel, no funny smell anywhere although the famous Hoi Mei Gai (chinese shops selling raw seafood) is nearby. Fantastic location if you ask me, but those coming from the airport should take note, it's better to take bus A11 (HKD40) than the Airport Express simply because it is cheaper, more convenient and faster. Get off at the 4th stop (buses are equipped with electronic signage), then find your way into Wing Lok steeet (about 5 to 10 min walk).", "Date": "July 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Singapore", "Title": "“Complete disaster, stay at your own risk”", "Author": "nymph2106", "ReviewID": "UR34890041", "Content": "I was apprehensive about booking a stay here after reading the mixed reviews, but I decided to go ahead since the most recent reviews were pretty decent. Well, I totally lived to regret it. The day I arrived at the hotel, I was given a single room on the 9th floor - that was already occupied by a male guest. The gentleman in the room was equally confused, and he called the reception to tell them about the mix-up. I returned downstairs and was asked to wait. No explanation was given by the staff about why my room was already occupied. Fifteen minutes later, one of the staff told me my room's ready and escorted me upstairs to the 9th floor, and back to the same room I was given earlier. The male guest who had earlier occupied the room was moved to the room next door. I didn't know if he had entered the wrong room by mistake (although as to how he could have entered my room with another room's key card, I had no idea), or if the staff had given the both of us the same room key. Either way, I didn't know because no explanation was offered by the staff. On my second day at the hotel, I returned in the afternoon to find my room door unlocked. Thankfully, nothing was stolen. I complained to the staff at the reception, but again, no apology or explanation was given. That evening, I decided to leave the hotel and move to another one. I'm a woman travelling alone, and I felt that my safety was being compromised at Mingle. The staff at Mingle refused to refund the unused portion of my stay, and again, made no effort to apologise for my horrid experience at their property. Safety issues aside, the rooms here are dreadfully small. There's no room to put your luggage, the bed is sandwiched in between the wall and wardrobe, and the sink in the bathroom is so small that water gets everywhere when you use it. The walls of the hotel are also dreadfully thin, my first and only night at Mingle was spent awake, accompanied by the noise of slamming doors and the muffled conversations of guests in the other rooms. Also, the clock radio in my room went off at random times throughout the night. I'm not a light sleeper, but I didn't manage to get any sleep at all in Mingle. You'd have to be dead to sleep through the noise. All in all, I will not recommend staying at this hotel unless you don't mind putting your own safety at risk or dealing with ignorant staff who don't seem to understand much English. Pay a little more and go somewhere else. I did, and moved to The Cityview, where I was rewarded with a clean, quiet, bigger and safe room and extremely attentive staff.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Possibly the best value in Hong Kong”", "Author": "quietshoes", "ReviewID": "UR31269144", "Content": "I have stayed at many different places in HK, and this was a big surprise. To be warned, the room is tiny, but it's incredibly efficiently designed. 1 min walk from MTR. They have free wifi and free wired broadband, which seems to less common these days in HK. There is an LCD TV with a wide selection of free movies to watch, and a DVD player if you bring your own (if you are coming from the Mainland you may have acquired a few.) You are also able to attach your Ipod to the sound system. There is a Skype-based phone, which I have never seen before. The bed is not hard as a rock, as is the usual in China. The biggest surprise was there was a private balcony almost as big as the room itself! I got my room for less than 40 USD.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“No Complaints -- All as expected”", "Author": "SydneyTraveller001", "ReviewID": "UR31189523", "Content": "I had a business trip to Korea, and took a couple of night stopover in HK on the way back home to Sydney. This rate was cheap and I was sceptical about booking. Yes, my single room was small, but sparkling clean and fresh. Unless you want to work or spend all day in the room it should not be a problem. There was the usual outside noise, as you will get anywhere in HK, but closing the window soon fixed this. While some reviewers mentioned about the mis-alignment of the bathroom mirror and shadows caused by lighting, I did not notice this as a problem. I don't think you would get a bathroom, minibar, or DVD player in your room at this price elsewhere in this central location. I was satisfied with this hotel. In fact I was checking reviews again because I am suprised again by the low price available for my next visit to HK! and will be staying again.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "BKK", "Title": "“A nice place to get sleep!”", "Author": "Jeab_BKK", "ReviewID": "UR29207950", "Content": "Accommodation??? depends on our style and the purpose of our travels. A trip to Hong Kong was such a nice trip,\"Mingle on The Wing\" gave me a nice place to get sleep. I have been to Hong Kong to take a sit for the US nursing license examination with Pearson Test Center at Grand Millennium Plaza locates in Central Island and because I like travelling myself,so I prefer to hire a safe, clean and convenient place for my relaxation period and more important in style to be fit. I like \"Mingle on The Wing\" as it could give me most of what I want, good location just one minute walk from Sheung Wan, MRT station to get anywhere else around this island. To see most of attractions is not so difficult in minimal expense. I met \"Mingle\" at \"Wotif.com\" after I had been searching all around from other websites for 3 night stay on 21-23 April. I realise at first from theirs photos that this hotel is not a type of \"stand alone building hotel\" as many hotels I have seen.I also got some reviews about it here before,however after I had a look in details I finally decided to book \"standard room\" in advance. I arrived in HK around 9 pm,after getting \"Airport Express\" to travel to HK station to reach Central Exit, although I could then get the hotel by MRT but I tried a taxi which is $ 18 for 5 minutes. When I checked in at the hotel,the 'Standard room\" I had been booking was not available the staff who speaks English quiet well upgraded me to \"Superior type\" without any more payment for the first night. The photos about them I have attached with this review you can compare for yourself. Including a short distance to Grand Millennium for my test, I also easily had much of time to visit \"The Giant Buddha\" at Nging Ping Village by Nging Ping Cable Car, walk around Central Area in Soho, Take a ferry to Kowloon, Try a Peak Tram to have a fresh breath on the top of HK at Peak Tower where I got many nice souvenirs back to Thailand for my friends. Nearby the hotel, there are two \"7 eleven\", qualified restaurants for tourists, fresh fruits shop for collecting, after daily trip I love hot shower at room,enjoy LCD TV + Bloomberg,Discovery and Fox channel in nice and clean bed without any allergies. The rooms in Mingle do not have strong smell, the light and security systems are perfect, I felt safe and really had nice sleep through all three nights. Yes! I will certainly recommend this hotel to anyone who are seeking an unique hotel in reasonable price. \"Mingle on The Wing\" is my style!", "Date": "May 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“small room but fab location and value for money”", "Author": "ahamill", "ReviewID": "UR25367846", "Content": "We stayed at MoW for 4 nights in mid Feb 2009 while visiting family in Hong Kong. We wanted to stay in Central rather than the hotels in Kowloon so we could be close to everything and within walking distance. We couldn't believe the value for money of the hotel in AUD$ - and were nervous about what to expect. To say we were pleasantly surprised was an understatement. We were in standard double on the 11th floor. The bedroom itself was very small with about 0.5 metres or less around the king bed - this was basically the room so we had to be patient with the suitcase storage and be pretty tidy when we were there. The bathroom is a reasonable size with a really good shower. All the electrical stuff worked well - we didn't have any problems at all. The decor is in the boutique hotel mode - clean, crisp and modern feeling. Just beware of the building work - we were wlong at about 715 am witha thud thud noise that sounded like it was in the area and the bed/room actually shook a little - it lasted for about 20 - 30 mins. Talking to family linving on the Island they said they also felt it (in SoHo) and it was a development where the foundations were getting put in. The mornings after we were less disturbed and got back to slep pretty quickly after. Its location is also fantastic - walking distance to the Macau and Kowloon ferry terminals, plus the MTR, plus main shopping strip etc. If you want to relax in your hotel room a lot during your trip you might want to go for somewhere further out and bigger but we were up and out everyday so it was perfect for us. If you are travelling alone and can afford it we would recommend going for a double room to give you a bit more space (based on the reviews of the single rooms) It is also in an area that still has a really Chinese/ Old Hong Kong feel and smell. In 2007 we stayed at a place in New York that wasn't hugely bigger for 5 times the price of MoW.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "los angeles", "Title": "“Mingle Gave Us Headaches”", "Author": "deighter", "ReviewID": "UR24059620", "Content": "The Mingle rooms look great in the promo photos, but they are actually terribly small -- even the \"upgraded\" suites. There is no place to put large suitcases, and the only place for cosmetics or bath items is a tiny 2\" wide shelf running under the bathroom mirror. Both the bath mirror and the mirror on the wall between the bathroom and the bed are useless. Why? Poor lighting design... it is extremely difficult to shave or apply makeup. We had endless problems with the music player//tv// sound system. The front desk people were very helpful, but they had to come to the room every day to fix something. Terrible. The Mingle looks like it would be the place for sophisticated travelers, but beware, it is not. Rather if you can live out a backpack, have no need for personal grooming, and are happy in a room that you cannot even turn around in because it is so small, then the Mingle might be for you. Noise Warning: Loud construction noise up and down the street until at least April, 2009. But then again, you may find the sound of jackhammers at 8 a.m. pleasant. We did not. That's why we moved over to the Stanford Hillview, to enjoy a real large room, for the same price.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, good value, tiny room but free wi-fi in HK”", "Author": "cUb4", "ReviewID": "UR23459809", "Content": "Right down the street from the Sheung Wan A2 exit with three late night conveniences stores nearby. Also taxis always going through the intersection to get to the harbour. Coffee shop advertised on the website was closed. Room (12th floor) very small (the shower is wider than the hallway), little awkward to store and move around, and never figured out how to unplug the sink (service had to do it). Had issues operating the TV and the 'technological settings'. But clean, convenient, free wi-fi and for the price, excellent value (booked on hotelclub.com). Hotel will want a $500HKG deposit up front which is returned at the end. If you're not planning to spend a lot of the time in the room, it's well-located (no issues coming back late) and in a interesting area (traditional herb/medicine shops instead of mega malls).", "Date": "January 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“An unexpected pleasant surprise”", "Author": "janda0808", "ReviewID": "UR23380705", "Content": "After spending a miserable day at another hotel, I didn't have much hope for Mingle on the Wing - I just wanted to leave Hong Kong asap. However, Mingle on the Wing turned out to be much better than I expected and I truely enjoyed my stay with them. The first thing I noticed was the location. WOW! The hotel is extremely close to a MTR stataion. Unlike the other hotel, this time I only had to walk for 30 seconds after leaving the MTR station, and that is great for me as I had 3 big luggages. The lady at the reception (Matty) was very polite, very friendly and extremely helpful. As my room wasn't ready, she asked me to leave my luggages behind her desk and she even carefully labelled all my bags for me. After a good walk around the hotel area, I came back to the hotel and was able to check in before the actual check-in time. My room was on the 8th floor and I was totally blown away when I first saw it. First of all, the door was locked electronically with a magnetic card so I felt safe inside the room (unlike the other hotel which only uses hand locks). The intensity of all lights were controlled by an electronic switch on the wall so you don't have to spend time looking for different switches. You can also choose whether you would like room services on the switch which was cool. The room was elegant, posh and sparkling clean with a foot rest and I was able to use the free high speed internet like they said. The room also had a 37\" LCD TV, a fridge and a big open window. I actually booked and paid for a single room, but Matty managed to upgrade me to a bigger room with a double bed. The toilet was very clean with all the supplies I needed (the other hotel didn't even give me a soap). And there were two strong showers for me to choose from, rain-type and normal - I used both! There were other facilities that I didn't use so I can't comment on them, but they all looked very good: DVD player, Cordless IP Phone with Skype, Free Wi-Fi & In-room Surround Sound System. I would like to thank Mingle on the Wing to make my stay so enjoyable, so enjoyable that I had to come and give them a good review on tripadvisor.com. Lastly, thank you so much Matty for your unbeatable customer service - you are a star and you deserve a huge pay rise!! Would I come back to Mingle on the Wing again? Absolutely, and I am telling all my friends to stay there too! :-)", "Date": "January 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“value for money, worth it”", "Author": "Tayug", "ReviewID": "UR22882176", "Content": "as expected a small hotel, lite room, but worth every cent, great location, next to MTR, walk to CBD, free broadband, both wired & wireless staff were friendly, all facilities in room, bathroom 100% clean etc agree room are very small, but will stay again there next month", "Date": "December 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Attractive hotel, but too many problems”", "Author": "maynard7", "ReviewID": "UR22295072", "Content": "The hotel is fairly new, and I found it attractive. But, it has Technology Gone Wild. You can use the TV and remote control to set the air conditioning, turn the lights off and on (and select mood lighting), tune the TV, watch movies, listen to the radio, among other things. It would be great if it all worked flawlessly, but it doesn't. On two out of my five nights there, all the lights in the room suddenly turned on, waking me up. I guess there's some short-circuit somewhere in my room, but how will they ever find it? To turn on the TV and tune to channel 9 took 12 key presses on the remote control. The TV volume was fine, but when I tried to watch a movie from their online collection, there was no volume. The very helpful girl from the front desk fixed it, but the next day I had the same problem. It would just be better to have equipment that works, instead of making things so complicated. There is no lightweight blanket in the room, only a thick comforter. This requires you to set the air conditioning temperature very low to be able to sleep in comfort. Seems kind of wasteful on their part, since most businesses like to keep energy costs low. The mirror in the bathroom is not in front of you. It's mounted on the wall to the side of the sink. Every time you shave, brush your teeth or put on makeup, you have to lean uncomfortably over the sink and look to your left to see yourself. Because of poor lighting, one side of your face is lit up more than the other, which makes shaving or makeup difficult. They should have mounted the mirror on a hinge so it could swing to a position in front of you. Otherwise, the bathroom is a good size and very attractive. In fact, the shower stall is oversized compared to the rest of the room. Ladies, there's no full-length mirror. There is an utter lack of space to put anything. This was a glaring oversight on the part of the planners at the hotel. This could have been avoided by simply putting the mattress on a platform raised a foot or two off the floor, thereby providing empty space under the bed. Such space is handy and critical in a room of this size. Just being able to slide your suitcase underneath the bed, along with shoes, shopping bags, etc., would be a great help to guests trying not to trip over their belongings. There is a tiny closet next to the bed, with a 10 inch wide pathway to reach it. You have to be on your knees (on the bed) to access the closet. There were four rooms on my floor. The springs that close the doors are so strong that it takes a concious effort to not let your door slam (and some guests don't make that effort). The cleaning woman was the worst offender, making all sorts of noise. There is a new high-rise building going up a block or two away. This may annoy light sleepers, or those who like to sleep late. On most days, though, the noise wasn't that bad. There are 2 free laptops in the lobby to use for internet. This is very valuable, since I didn't see any other place to use the internet in this neighborhood. They apparently have free wireless internet in the rooms, which I didn't use. A warning to people that are using a credit card issued outside of Hong Kong to pay your bill here: The hotel's credit card processing machine will convert the Hong Kong dollars to the currency of the country where your card is issued. This doesn't sound all bad, but they are not using the exchange rate provided by your credit card company. They choose an exchange rate that favors the hotel, and you will end up paying more (interestingly, about enough to cover the fees they pay their bank for accepting credit cards). I spent at least half an hour talking to hotel employees about this, and they even got their bank on the phone to talk to me. I wanted to pay in Hong Kong dollars so that Visa would determine the exchange rate, and the solution the bank came up with is to use the old-fashioned credit card imprinter, rather than the electronic one. I don't appreciate the way they are manipulating the exchange rate to charge more. Everywhere else in Hong Kong I used my Visa card, the sales slip always came up in HK Dollars. At this hotel, nobody knows the button to press on the machine to make that happen. I would urge anyone traveling overseas to always refuse having the sales slip prepared in their home currency, as every time this has been offered to me, it has always been in the merchant's favor, sometimes by as much as US$20. Insist that you be charged in the local currency, and let Visa, MasterCard or American Express determine the exchange rate. This hotel even shows the exchange rate on the receipt, not as the very familiar 7.75 rate between the HK Dollar and the US Dollar, but as the inverse 0.132973. Presenting the exchange rate in this manner makes it impossible to quickly evaluate the exchange rate they are using. Service from the front desk employees is not consistent. Some are much more fluent in English than others. Some are very helpful, and some are not. You'll find the best ones very quickly. My room had a window, but some apparently do not. I think they have a room category called \"Lite\", and these are the lowest priced rooms with no window. Excellent public transit, as it's only a block from the Sheung Wan Subway Station (from this station, take exit A2, go up stairs to street, turn right and the hotel is about a block away). I took the airport train to Central Station, then it's only one subway station away. No need to take a taxi unless you have lots of luggage. Overall, I found the hotel to be attractive and conveniently located. Although my review may sound negative, I don't want to make the hotel sound like a bad place, because it isn't. It just could have a been a much nicer experience. I would stay there again only if I got a low rate, otherwise I would do some more hotel shopping. I probably would have given it 4 stars out of 5 if it hadn't been for all the problems.", "Date": "November 29, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Australia", "Title": "“Go Elsewhere! (Seriously, don't bother)”", "Author": "Wentworth21", "ReviewID": "UR22258866", "Content": "I arrived to a small, EMPTY hallway as it seemed the \"concierge\" (who was rude and unhelpful) was attending to a personal call outside. When someone finally arrived to help, I was told the elevator was broken. As a result I had to haul my suitcase up 7 flights of stairs! (I kid you not.) Communication between employees takes place through \"oh-so-modern\" walkie talkies with messages being repeated several times (and in several languages) as no-one can understand each other. The room was TINY. There is no bath (although there is their famous \"torrential rain\" shower--which switches between ultra hot and ultra cold, not to mention is a complete waste of water.) Their shower TV, which is \"cutting edge technology\" was broken. I WATCHED several movies but HEARD none of them as their sound system is terrible. There is no view (and the windows hardly open anyway). I could go on, but I think you get the point. The price may be attractive, but there are better places at similar prices in the area. While the concept of a \"Technology Hotel\" is great, it is NOT executed here.", "Date": "November 28, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Singapore", "Title": "“No windows in single rooms”", "Author": "Worktravel01", "ReviewID": "UR22093352", "Content": "Please be aware that the single rooms do not have any windows. Tiny rooms when you just need somewhere to sleep are fine but I found it more then a little suffocating to be in a windowless room.", "Date": "November 22, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Singapore", "Title": "“Great Location”", "Author": "SavvyInTheCity", "ReviewID": "UR21924344", "Content": "I booked a room at Mingle on the Wing for its accessibility to the Ferry Terminal and proximity to the MTR station. As expected, the room was small (as of most hotels in HK) but it was relatively clean. It lived up to my expectations until, I experienced problems with not just the TV remote, the heater but also the fire alarm, Firstly, I had to ring the reception a few times so that they could come up and check our remote control which was only finally repaired on the second night. Then as I was about to take a shower, the water turned cold and I had to get my husband to ring the reception to turn on the heater. In the end, I got tired of waiting and just showered in the cold water. To make matters worse, this happened not just once but twice. Lastly, we were woken up by the fire alarm at ard 10 plus in the morning when it went off. The only consolation was that it was not that early and about time we got up. On the flip side, we really enjoyed the wide selection of movies available when we could not sleep at night. However, our stay would have been a lot more enjoyable if not for the hickups.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“Great locatiion - great value”", "Author": "minnowlam", "ReviewID": "UR21155170", "Content": "This hotel is on a small street but one block from the main Des Veoux Road. We took the airport express train from the airport and then took a cab for $16HK dollars to the hotel. The cabs here are cheap! It's 1/2 block from the Sheun Wan MTR station which is really convenient as you can get almost anywhere on the subway. Subways are extremely clean and safe. The area is safe to walk around late at night as well with a 24hr 7-Eleven variety store on the corner for late night drinks and snacksl. You can walk to the Macau ferry terminal in 5 minutes and to the other ferry terminals in about 10-15 minutes. The staff are friendly and the rooms are clean and compact. I guess for HK standards this is typical - we stayed in a deluxe room on the 4th floor. I would recommend getting an upgraded room as it's a little bigger but by no means large by Canadian standards - just enough to open our two suitcases. The wake up call feature that you can program on the TV is really interesting...TV comes on first and then all the lights and then the phone rings... I would recommend this hotel as it's a great location and great value.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mann01", "Title": "“love it!!!”", "Author": "mann01", "ReviewID": "UR19962391", "Content": "this hotel is recommendable to everyone. Esther the receptionist assisted us very well. She is excellent,she took care of us.to the management of mingle on the wind thank you so much!!! we really enjoyed our vacation. our room was very clean, could not ask for anything", "Date": "September 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Modern and Cosy”", "Author": "AVCHD", "ReviewID": "UR19649685", "Content": "We had two rooms, a single room and a twin room. Firstly reception is efficient checked in at 3pm and was quickly into the room. Need $HK500 per room for bond or credit card imprint. Single room was on 5th floor, Twin on 12th floor. My single room had a balcony, very compact bed and bathroom. Literally 30cm between toilet bowl and basin, so its very tight. Shower was strong on 5th floor but weak on the 12th floor. Twin room bathroom was larger however shower area was smaller than single room. Nice LCD screen which has some weird controls, so wont be suprising if you experience some difficulties. However very nice modern renovation, like an ikea style room. Location is just 1 min from Sheung Wan MTR station entrance and 10 mins to HK ferry terminal, however there are stairs so may need to carry heavy luggage. The area isn't too touristy so there arent hawkers around. We were allowed to leave our luggage for an extra 5 hours past checkout for no charge. Wifi unfortunately didn't work on 5th floor, but there are two computers to use on the ground floor. If you need power adaptor they have convertors to lend out. With sleeping, I'm 165cm and I find my feet overhang the bed. They supply toothbrush/paste/razor/cream/slippers. The lighting is very minimal the lighting can cast shadows when you look at yourself in the mirror. One criticism is they need to have hooks for coats behind doors/bath door. However its clean and quiet for a good nights rest. Would come back again good value/location. But might try its other hotel at Tsim Sa Tsui.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Awesome Stay”", "Author": "Cambium", "ReviewID": "UR19172445", "Content": "I stayed at Mingle on the Wing for four nights when I was in Hong Kong with my girlfriend. I think we got a good deal as we paid only around $60USD for a double. The room was very cozy (or tiny) as there was only enough room for two twin beds (worry not, they were pieced together), a big LCD TV, and our two suitcases. The TV is connected to a central server, and there was a big selection of Hollywood (and Asian) movies, including new releases that you can watch for free. Also, there is free wireless internet in the room. The room itself and the bathroom were exceptionally clean, and we were very happy about. The outlets in the room are not compatible with North American appliances, however, a converter (for the shape only, not for the voltage) can be borrowed at the front desk free of charge. The location of the hotel is also very convenient -- a two-minute walk to the nearest subway station, which is only one subway stop away from Central Station (central Hong Kong). The famous Man Mo Temple is only a few streets away (although there's really nothing to see).", "Date": "August 20, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "bishkek", "Title": "“Technical Issues”", "Author": "nanooki", "ReviewID": "UR14292980", "Content": "Although well located and close to an MTR stop, our stay at Mingle on the Wing could have been better. The rooms are small but cute and and clean. The lobby and the elevator have seen better days. The staff who work there seem a bit sullen except for the night shift guy who's always helpful. They staff also need to brush up on their English language skills to make the stay of guests more comfortable. The whole deal with Mingle is that there's an accent on technological innovation but sadly that all exists on a much lower level than needed for the functioning of this type of hotel. Some kind of message concerning hotel air temperature flashes constantly on the flatscreen TV and a loud alarm goes off. We had to ask the receptionist to come solve this problem a number of times. There are two laptops available for the use of guests but they are not connected to a printer and that really is a problem especially if you are trying to franically print out a boarding pass.", "Date": "March 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Room was cold!”", "Author": "Ski_Kaos", "ReviewID": "UR13686196", "Content": "Whilst the staff were all very polite and appeared sincere and concerned, we found the following problems at this hotel: 1. We booked a 5-night stay and EVERY day (yes 5 times) we complained that the room was cold and there was no heater. The first time the receptionist said it would be too hard as they'd have to find a heater factory!!?! I suggested they just go buy a HK$150 heater from a shop, but that seemed to make no sense to him. The staff seemed to rotate to new staff almost every day. The next 3 people over 4 days (to whom we complained about the heating) all seemed very concened that we were cold and assured us they would have the aircon fixed (apparetly the heat output on it was broken, apart from the fact that it had a secondary fault where it would never turn on in the first place without a technician resetting something in the hall cupboard). On the final day one of the earlier staff members said she had previously ordered a technician and didn't know what had happened. She assured us that she would chase it up, ...but it still was not fixed. They probably fixed it the day we checked out, as if that is of any use to us... So all in all we were very cold in our (HK$730/night) room!! Absolutely unforgivable, a backpackers would have provided a cheap and effective heater, so why can't a mid-range hotel do it?? We had to wear long sleeves and long pants when we were not in bed. 2. The room was TINY - shoebox sized. At first I thought this was just a Hong Kong standard but then we moved to a slightly cheaper (and far nicer) hotel very close by and got a room almost 3 times the size for less money and of a higher standard. At Wing On Lok we paid for a \"Deluxe Room\" as opposed to a standard room, so I expected some space, it was so small that I had to do my morning exercises (push ups, yoga) on the bed! 3. There was no wifi service in our room, despite this \"tech-hotel\" bragging that wifi is \"everywhere\" in the hotel. I got zero bars and could not establish a proper connection. To be fair, there was a CAT5 connection but this meant being tied to the (tiny) desk so I could not use my laptop in bed which would have been a lot more comfortable at times. 4. The AV system was still not complete (hence not working at all apart from the TV), despite the hotels advertisement claiming it would be ready for February (we stayed Feb 12-17). There was no DVD played and I could not plug in my MP3 player. 5. The reception staff member when we checked in (late) could not speak more than a few words of English, In addition he had no concept of trying to communicate in other ways (sign language etc..) although the latter seems to be a trait of all HongKongese. 6. Although this did not matter to me, the hotels advert was all about personal service - but there was none of this whatsoever, larger hotels have always been far more personal. Reception couldn't even give (or even sell) me a map of Hong Kong!", "Date": "February 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Good budget find in a convenient location”", "Author": "Cucques", "ReviewID": "UR12827635", "Content": "We got a good rate for our room by booking online - it was a four day consecutive rate. HK$490 per night. It was a standard room ie. the basic one. Room - Tiny but we had expected it as this is Hong Kong and we had also chosen the cheapest room, rather than going for a superior, deluxe or otherwise (as we knew we were going to be out most of the time). Basically, we had a queen sized bed which took up most of the room. Having said that, everything was brand new, modern and the room was very clean. The bathroom had a shower (no bathtub), was modern and compact but had enough room. We also had an LCD TV and wifi. Liked the fact that you could switch off the aircon and open the windows. Location - Brilliant - metres away from the A2 exit of Sheung Wan MTR (underground) station. Central is a stroll away too. There are many local cafes in the area for breakfast, laundry/dry cleaning shops, a 7/11 a couple of doors down. HK Airport Express station is a short taxi drive away. Service - Perfectly fine. Overall we thought that the value was good, despite the size of the room, due to the location/convenience and price.", "Date": "January 20, 2008"}], "HotelInfo": {"Name": "Mingle Place On The Wing", "HotelURL": "/ShowUserReviews-g294217-d951969-Reviews-Mingle_Place_On_The_Wing-Hong_Kong.html", "Price": "$81 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.105 Wing Lok Street, Sheung Wan</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "951969", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e5/18/e518067c7a9ff9c2e6871df3ee3be5431large.jpg"}}