{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wilkes-Barre, Pennsylvania, United States", "Title": "“Park, sleep, fly.....”", "Author": "Patty H", "ReviewID": "UR126513409", "Content": "I should start by saying that the entire hotel is surrounded by swamplands so getting in and out can be confusing. Front desk staff is not helpful or friendly,the restaurant was closed and when we asked who could or would deliver they were not very informative, a passer by guest told us we could get food at the bar and so we did, it was average at best however the barmaid ( I forget her name was very personable and fun) .I feel like I got very little from the Renaissance Hotel for how much I paid. I was disappointed that they charge for Wifi and the room was expensive.We had a very early flight and read that there would be coffee in the lobby and there was no such thing...very disappointing to my husband. The service to and from the Airport was good.", "Date": "March 22, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Slingerlands, New York", "Title": "“Did I stay in a different hotel than the past reviewers?”", "Author": "Rhapsodyinblue", "ReviewID": "UR126425384", "Content": "I normally stay at the Airport Marriott, however for various reasons I stayed at the Renaissance for the first time. Yes, it is in the middle of nowhere, but it is an airport hotel. I did not find any of the age and wear and tear as did the other reviewers. I was greeted very warmly, arrival gift was not an issue, and given a lovely suite (220) which had slightly worn carpet, but looked fresh and was very clean. I did not find magazines, nor anything else in the bed which did not belong there. The wireless internet was quick, quicker than many properties at which I have stayed. No, I don't think you are going to choose this hotel if you are here for the Liberty Bell, but for a quick stop and to be close to the airport it is great. The Airport Marriott still beats it though as it is IN the airport!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Dirty and out dated”", "Author": "pb4y", "ReviewID": "UR125823333", "Content": "When you stay at a Renaissance property you expect more, but no. Outdated and below average rooms. Internet never would log on and the front desk said it was working. I tried three different devices and none of them would log on, had to go to the lobby to complete my work. Bathrooms need to be fixed, clogged drains and towels that belong in a gym. NOTHING near the hotel, you must have some sort of transportation. Staff is very friendly but way under staffed. Hotel vans belong in a junk yard, not the way to make a first impression. Look else where unles you must stay close to the airport.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Pittsburgh", "Title": "“Expected more from a Renaissance...”", "Author": "Oncman", "ReviewID": "UR125723391", "Content": "What a tired property. Outdated and depressing. Half the parking lot was blocked off leading to a 100 yard walk in 18 degree weather to get to the lobby entrance. Wall paper peeling in foyer near ballroom, depressing lobby bar and poor excuse for a fitness center. High point was being upgraded to a suite due to original room given was already occupied. Nothing quite like walking into a room containing a half naked octogenarian....I am a Marriott Platinum Premier member and this is the worse property I have seen in a LONG time. Pay the extra and stay at the Marriott at the airport, I know I will.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "chicago illinois", "Title": "“Meh”", "Author": "lawdogs1", "ReviewID": "UR124661935", "Content": "I stayed overnight in February for business. I am very familiar with the Renaissance brand and a Marriott platinum member. This property was disappointing and a little off from what I usually expect from a Renaissance. First, I had to call twice, with an over 20 minute wait, for the hotel shuttle - late at night. I watched numerous hotel and rental car buses go by more than once. On the second call - after I was getting creeped out waiting out in the pick up area, almost alone, the phone rang (literally) over 25 rings before anyone answered. I had the same non answering experience the following morning when I had attempted to call the front desk to ask a question. Only this time - no one answered - twice in a row. I gave up. Other odd missteps - the hotels magazine was actually under the sheets and mattress pad on my bed, when I got in I heard a crumpled sound and wondered what in the world, only to find the magazine stuck under there - odd. The shuttle driver, I was convinced, was not even a Renaissance employee. I was picked up in a white cab truck with the renaissance logo DUCT Taped onto the side of it. He had 2 girls sitting up front with him. The driver had a white box with oranges, apples and waters in it - odd and began babbling on about how he would be \"our driver\" if I wanted to go to a bar or convenient store. I just wanted him to shut up. Then on arrival, he planted himself right next to me at the check in counter and stared at me until I forked over the obligatory tip - I asked the clerk to cash my 20 - and he handed me 1 10 and 2 5's. Annoying, as I had no intention of tipping this much for an over 20 minute late overly solicitous ride, with 2 girlfriends in the front seat and super weirdness in terms of the offers for transportation. Mind you, I am no newby - and this just smelled odd - and as a female traveling alone - which I frequently do all over the country, I did not appreciate the presumptive nature of the experience. The staff overall were friendly, but I did not receive my platinum food gift - I realize it was late at night - but why offer it then? The room was clean, but the bed not as comfortable as the usual Renaissance bed - even after I removed the magazine. No flat screen tv - very old school box style and small. Bathroom ok - shower curtain (which I hate - but a girl cant expect everything - can she?). Concierge lounge was fine - I had no complaints there. I will say the shuttle service the next morning was exactly what I would have expected - polite, on time and friendly. Overall, this hotel needs some work. Its just not what I expected and thats the very reason I frequently stay in Marriott hotels - because I know what to expect.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Renaissance hotel Philladelphia”", "Author": "deb-5584", "ReviewID": "UR122833173", "Content": "Very clean and nice hotel, friendly staff, excellent concierge, need more space for parking, which probably impossible due to the wetland.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“OK? I Guess”", "Author": "Fred W", "ReviewID": "UR122572867", "Content": "Staff is very friendly, great bunch of people. However, service in the restaurant and bar are terrible. VERY slow. Food is sometimes cold. I have had a waitress disappear forever and a new one in her place. Showers are usually plugged up and the toilets seem to be hit or miss if they flush. Ceiling leaks if you get a room on the 12th (top) floor. Rooms are relatively clean. Terrible old TVs that you can barely read/see anything on. The Heat/AC units do not work properly (blows cold air when heat is turned on, happened in multiple rooms I've stayed) Most of the room doors do not shut all the way, I'm sure it would be easy to break in to one so don't leave anything too nice in your room all day. Wi-FI is terribly slow and hard to get a connection, you need to connect to the network cable at the room desk. The moat out front smells interesting. The concierge lounge is nice but has minimal food most the time. At least the drinks are good, you'll need one staying here. Comfortable beds though!!", "Date": "January 5, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "WILMINGTON, DE", "Title": "“Reservation cancellation - hotel was very nice”", "Author": "SOMEFUNINTHESUN", "ReviewID": "UR122026819", "Content": "I booked a room with the thought of staying the night after a company Christmas party but cancelled 2 days ahead of time. However, my card was charged for the room anyway. It has now been over 2 weeks, many phone calls and a dispute filed with my bank and I don't have the money refunded yet. Now I'm told it takes up to 14 days to get a refund. They can certainly take it out of your account fast but it takes up to 14 days to get it back? Make sure you check your statement if you ever cancel here.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Providence, Rhode Island", "Title": "“Great front desk staff, updates to hotel needed. Clean”", "Author": "GoldensRI", "ReviewID": "UR121751258", "Content": "Wonderful front desk staff.hotel is a bit dated. Old television in room rca about 21\"no flat screen, broken tile in bathroom. In need of updates but clean decent cardiovascular equipment in gym.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Boston MA", "Title": "“Front desk staff awful”", "Author": "richardhk3", "ReviewID": "UR121636494", "Content": "Granted we arrived late at night, @ 1 AM, so there was a skeleton crew of two hood rats behind the desk... totally rude and uncommunicative. When we asked where to park, they just shrugged, mumbled \" over there\" while pointing to the door, and walked away. You could feel the hate. Morning staff wasn't much friendlier. Maybe it's a training spot for people just getting out of prison. Rooms were OK, clean. Got a great price on a Sunday through a third party, but due to completely unprofessional staff I would give a low rating.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Better than expected for an airport hotel”", "Author": "DoctorDeen", "ReviewID": "UR121150224", "Content": "Rooms could use a little TLC and updating (tube TVs)...but were clean and comfortable. Staff was very friendly and helpful. Breakfast buffet very good. A tip for you...there are rooms that have balconies into the pool area...not so good if you want to sleep in as kids (being kids) were in the pool early doing what kids do. A good choice...if I need to be in that area again I would stay in this hotel. One pet peeve...$13 a day for internet?", "Date": "November 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hilton Head, South Carolina", "Title": "“Rooms are fine but service is not good”", "Author": "EssHHI", "ReviewID": "UR120875693", "Content": "I stayed in this hotel prior to a flight out of Philly. I had driven in after business meetings and had to return a rental car. Unfortunately they wouldn't pick me up from the rental car facility so I had to take the shuttle to the airport and wait to be picked up there. Shuttle driver was very friendly and courteous. Check-in is where the problems started. They didn't give me the concierge level room I paid for and he argued with me saying I didn't pay for that room and this is what I was getting. I had to pull up confirmation on my smart phone to prove to him I paid extra for concierge floor and he said there weren't any rooms there any way so it didn't matter. Finally someone else got invovled and gave me access, but I was on a low floor with my room. Room was fine - clean but not very updated. I didn't feel welcome here at all - they could have treated me in a different way. Interestingly, I filled out the hotel survey they sent me after I checked out and asked for someone to contact me and haven't heard anything in 4 weeks. They don't seem to care much about the customer experience.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Very nice for an airport hotel”", "Author": "aerojunkie", "ReviewID": "UR120733644", "Content": "Stayed one night on business and met clients for dinner. We were to go to a restaurant downtown but it was raining, cold and foggy, so decided to stay at the hotel. I was pleasantly surprised with the quality of food in the restaurant and the bar/lounge area was lively and fun. The hotel is showing a bit of age, but the rooms are large and nicely done with all the amenities you would expect. I was upgraded to a deluxe room which was well appointed with free bottle water, robe, large bathroom, etc. Bed was very comfortable and the room came with a free breakfast buffet. Staying near the airport made it easy in the morning catching a flight home. Location is average near the airport and industrial parks, but convenient if flying the next morning. Overall a nice stay.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Great Hotel if Flying out of PHL”", "Author": "DNA513", "ReviewID": "UR120703103", "Content": "This is the Hotel to stay in if you are flying out of the Philadelphia airport in the morning. They offer free parking during your vacation and the rooms are very nice. the Shuttle to the airport runs every 20 mins to the airport and upon your return you call the front desk and they send a shuttle for you. The shuttle ride to the airport is less than 2 mins depending of the few traffic light that you travel through, so you don't have to schedule extra time in to for the shuttle (this is important if you are flying out early) Hotel have basic restaurant and bar so you can grab a bite the night before without leaving hotel. I fly out of PHL 3-5 times a year and my first choice for the money and location is always this property.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Very comfy for overnight stays in Philly”", "Author": "AusBeagle", "ReviewID": "UR120646629", "Content": "The hotel looks a little daggy on the outside and the decor is a little dated, but for an overnight stay it's ideal. We stayed here overnight on the way to Washington after flying into NYC earlier in the evening. The king bed was very comfy and the bathroom was a decent size. A few minor complaints: Car park seemed very dodgy, air con was too loud to sleep with, and the pool outside the balcony created a fair bit of noise in the morning with children swimming which isn't the best post-jetlag wake up call! All in all though, hotel serves it purpose and it's only a 20 min drive to the old city to visit all the tourist sites.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne Australia", "Title": "“Great Staff, Room & Bed .. food needs some work”", "Author": "FionaJM", "ReviewID": "UR120475092", "Content": "Spacious room and one of the best king beds in any hotel. Bathroom spacious and water pressure good.Staff were fantastic as we were stuck there due to flodding from Hurricane Irene. Rooms were very quiet also as I slept thruough Irene passing by. The only complaint would have to be the food, it just wasn't of a standard I would have expected from a Renaissance. Abit bland and basic.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Burned my shirt”", "Author": "Evan G", "ReviewID": "UR119953504", "Content": "The iron in the room burned my work shirt in the morning and destroyed it. When I brought it up to the desk staff upon check out they were sympathetic but didn't offer any reimbursement. The hotel sent a generic follow up e-mail a few days after my stay (sent to many customers, not directed to me personally), I responded to the e-mail with my complaint and have yet to get a response. If your room doesn't have a window that looks outside expect to hear a lot of hotel noise and expect to get a poor night's sleep.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Irene Stranded Us, But Staff Was Amazing”", "Author": "TravelLover32380", "ReviewID": "UR119950228", "Content": "My husband and I stayed here for two nights after hurricane Irene left us stranded in Philly after our vacation. The parking lot flooded so badly that we could not leave the hotel for two days. Though we were trapped, bummed we couldn't go home (we were planning to hop in our rental car and drive the three hours home), and had to eat hotel food for two days, the staff was super helpful and flexible and supportive of the situation we were all in. The hotel itself was perfectly clean and the bed was comfortable. Just don't choose this hotel if you are stuck in Philadelphia before a tropical storm!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Wales, PA", "Title": "“Excellent 1 night stay”", "Author": "My2Kitties2", "ReviewID": "UR119916823", "Content": "stayed one night as friend was flying out at 7am...my daughter and I went down with her and we went to the casino just a few minutes down the road...had a great time... the staff here is wonderful...we needed a roll away and it was there within minutes of us getting to the room...the beds were comfortable...coffee in lobby in the morning...unfortunately we did not get a chance to use the pool or have breakfast due to SNOW in October...we got a early phone call saying it was snowing and we better head home...the beds were so comfy were we sound asleep... we will definately use this hotel again...for heading to airport early am since they have a shuttle every 20 minutes 24/hrs... thank you Renaissance...especially the front desk staff...", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Binghamton, New York", "Title": "“BUGS!!!!!”", "Author": "1324traveler", "ReviewID": "UR119439992", "Content": "I stayed on the 5th floor of this Hotel in early September. Since returning home I have discovered bedbugs! I always check mattresses for signs of these pests before sleeping and did not see any at the time. I should have checked the reviews before staying however as there are several mentioning bugs and or bites! I am a loyal Marriott Hotel rewards member and will NEVER stay in this hotel again! Beware!!!!!!!!!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Cleveland", "Title": "“depressing location”", "Author": "Pinot09", "ReviewID": "UR119163244", "Content": "Price was good for the weekend but the location and the hotel itself are depressing. Decent room, clean but dated - no flat screen TV. Shower/bath didn't drain. And why does Marriott provide free internet at Courtyards but not at higher end properties. Didn't want to spend $14.95 just to check traffic conditions. Hotel is non smoking but smoker hang out right at the entrance, where the ashtrays are and pollute the air as you enter and exit. If an area needs to be provided for smokers, can't it be AWAY from the entrance?", "Date": "October 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Worst Service Ever”", "Author": "fdavidelder55", "ReviewID": "UR118489454", "Content": "We had two rooms booked and guaranteed to my credit card for September 21, 2011. Arrived at the hotel at 11:20. After talking to the desk and then waiting 25 minutes while they checked in 5 Southwest airline pilots, we were informed that there were no rooms available and that our rooms were not guaranteed. The night manager then proceeded to offer me a phone book so I could find another place. After being lied to and disrespected for 15 more minutes he consented to put us in a single smoking room in the worst flea bag motel I ever stayed in. Absolutely the works experience I have ever had in a Hotel anywhere in the world.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Whitefish, Montana", "Title": "“Tired and mixed service for the Renaissance brand.”", "Author": "dcslatts", "ReviewID": "UR118258927", "Content": "Surprisingly the Renaissance Philadelphia Airport is a step below the typical Marriott hotel rather than a step above. The hotel is close to the airport, but twice I have had 15 minute delays in the shuttle leaving as scheduled. So this is not the place to stay if you like to cut it close. The staff was very kind, but not very fast or as sharp as I typically find at Renaissance. The responses to the late vans were polite brush offs about business as usual or blaming it on airline crews. The real complaint is that for a premium hotel I was surprised at the tired condition of the rooms, the lobby and restaurants. This obviously is not the staffs fault, but it contributes to a mentality that it is okay for instance to leave food trays and piles of used towels in the hall for two days. I stayed at the Marriott Philadelphia Hotel the prior week and was much more satisfied. And that hotel is attached to Terminal A & B. My hope is that the ownership will upgrade this hotel soon. It has the potential to be good.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Stinky”", "Author": "ArtVandelay96", "ReviewID": "UR118234678", "Content": "The hotel over all would've been ok had it not been for the stench in the room. There was this weird smell of sewage or something water related that had me dreading going back to the room each night. That alone ruined my stay which contributes to my low marks.", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "alberta", "Title": "“Room Great; Staff Great...Restaurant - not so much...”", "Author": "ykbuffalo", "ReviewID": "UR117840067", "Content": "One night stop over before a flight the next day. Good price; very close to the airport and nice clean room. The restaurant though was simply not good; without a doubt the worst meal and service we experienced on a three week trip on the East Coast. Definately over-priced for four very bad meals; seemed like all canned food dumped on a plate and slightly warmed. Poor service and we were the only ones in the restaurant at dinner time on a Saturday night...no wonder. Would stay again at the hotel for the room - but would eat elsewhere.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Beaumont, Texas", "Title": "“Nice Enough for Corporate Travel”", "Author": "karenjsmith1", "ReviewID": "UR117496367", "Content": "My husband needed to be here on business so I came up to meet him for the weekend. If we travel for fun we do not normally stay at the airport, but as this was a business event for him the room was selected by his company. The hotel was nice and clean. The lobby is marble and updated and I would rate it at the level of 3.5 stars. The rooms are large and clean, but are badly in need of updating. They still have tube televisions and the furniture looks like a very traditional home from the eighties. The bathrooms are much more modern than the rooms themselves. They are on point with most 4 star hotels. We stayed here the same weekend that Hurricane Irene blew up the East coast, and while the hotel could use some updating the service is 5 Star all the way. We were originally in a suite on the 12th floor, and as the storm approached they moved us to a suite on the 2nd floor for our safety and convenience should they loose power during the storm. If you are staying here without an impending storm then I would recommend that you ask for the 12th floor as they offer concierge service with a nice breakfast and evening appetizers. This hotel also has an indoor pool which is small and loud, but also very nice. There were several children in the pool when we viewed it and it was a little to rowdy for my taste. The food was overall fairly good with the exception of the hamburger. No seasoning at all. I would stay here again because it was clean, and the staff was incredible, and that really makes for a nice experience more than modern decor and flat screen televisions.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paterson, New Jersey", "Title": "“AWESOME - They set the bar high”", "Author": "Kevin M", "ReviewID": "UR116866572", "Content": "We got in late after the Christmas snowstorm 12/28/10. Front desk did all but walk us to the room. Kitchen was closed but room service manager gave us her dinner. Who does that..? (Thanks Ms D). Room was fantastic, comfyyy/clean bed, 2 flat TVs. We thanked the manager in the morning for such great service. He was great also.Shuttle service was prompt & friendly. (refused a tip) This is a 4 star rated that deserves 5 stars. My wife still tells friends about our stay to this day. Would go to Philly just to stay here again. Thanks everyone. (wish I had photos to share :-(", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Decent Choice near the Airport”", "Author": "ejbondar", "ReviewID": "UR116806668", "Content": "I have stayed at this property many times and find it is a decent choice in the PHL airport area. The rate varies based upon demand, but most times you can get a good deal using the Marriott website and AAA. The property has ample parking, but if it is very busy you may find yourself in a space that is a bit of a hike from the hotel. Due to its location and layout, the parking lot is safer compared to other PHL airport hotels in my experience. Use common sense and NEVER leave anything valuable in plain sight when parking you car at airport area hotels. The property has a fitness center and an indoor pool. The rooms are typical for a Renaissance and the ones on the upper floors are the best. Room service is usually prompt and they have a decent menu of choices. The bar usually has some sports programming on the many screens and even has a pool table to keep you entertained. Lee behind the bar is an attentive bartender and reportedly is a decent soccer player as well.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Winsted", "Title": "“Nice hotel for the value”", "Author": "WinstedCT", "ReviewID": "UR116555423", "Content": "The hotel was very nice . It was clean and the staff helpful. It was close to the phillies games by cab. Downtown attractions were 15 minutes away. For the value it was worth it.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Stroudsburg, Pennsylvania", "Title": "“Disgusting and severly understaffed.”", "Author": "tiabear1984", "ReviewID": "UR116443346", "Content": "I will never stay at this hotel again, My family and I were looking forward to spending two nights at the renaissance enjoying the pool and a trip to the zoo. While making the reservation it says on there website NO BOOKING FEE'S WHEN BOOKING ON MARRIOT.COM. I also called up the hotel just to verify that there would be no fee's. I was told I would not be charged ANYTHING until the day of check out. on my way to the hotel I called up my bank to check my account and realized my balance was lower by a few hundred dollars. So when I checked into the hotel I asked the lady If they had already charged me, She told me no and informed me that they do put the total on hold until check out, my total was $335.00. When I returned home I had a bank charge of $418.00!!!!! I called the hotel back and they told me it was a security hold incase I didnt show up for my reservation and that it was refunded back to my account at checkout and would take a few days before its avalable,I flipped, because not ONE time was I ever informed of a security hold. I was told NO FEE'S and because of this \"fee\" my bank account overdrafted!! Also the hotel is severly understaffed. I stayed a total of 2 nights and 3 days in this hotel and not one time was my room serviced. no beds made, no vaccuming. They had ONE lady working the whole floor that I was on. which is around 100 rooms. NOT her fault but the staffing leaves something to be desired. The room itself upon arrival \"seemed\" nice and comfy, but upon closer inspection it was dusty and the toilet seemed as if it hadnt been cleaned in a month. when i first glanced at it i thought someone had forgotten to flush. But no It was stains in the bottom of the bowl. The floors in the bathroom were sticky. Whoever cleaned this room did what I like to call a \"illusion cleaning job\" or cover up. The pool was disgusting the whole room and locker rooms reeked of urine and the water smelled like urine. it seemed there was no clorine in the water. Im not sure if its the color of the pool itself or if the water WAS actually green. after getting out of the pool you feel like you have a slime over your skin. They also have a VERY hard time keeping things refilled. such as clean pool towels,coffee in the lobby and items in your room itself, I suppose this is due to being understaffed. The beds were extremely uncomfortable!!!!!! I woke up so stiff my husband had to help me out of bed. On the up side, \"what staff there was\" was very nice and polite. But really didnt offer any compesation to the troubles we encountered. Yes the hotel has low rates, but I would never referr anyone to this hotel. EVER!!!! I also woke up in the morning with these phantom bug bites all over my legs and arms. I didnt actually see bugs and this could be due to mosquitoes outside. BUT I seemed to wake up with more than I had the night before. PLEASE PLEASE think twice before booking this hotel.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Connecticut", "Title": "“Fine airport hotel.”", "Author": "Elle481", "ReviewID": "UR116385472", "Content": "Stayed here with points after a last minute late night flight cancellation. Very convenient to the airport with shuttle service. Clean spacious rooms - what you would expect from a Renaissance.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bryn Mawr, Pennsylvania", "Title": "“I wanted to call the Health Department”", "Author": "GSierraGold", "ReviewID": "UR116324635", "Content": "This is the dirtiest hotel I have ever stayed in. If the rooms and bedding where as clean as the lobby, no problem, but this place is so dirty, I started to write a serious complaint to the Health Department. Sham on you Marriott!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Terrible Service, Noisy Room, Damp Carpet”", "Author": "dnumgis02", "ReviewID": "UR116165286", "Content": "This is by far the worst Marriott I have ever encountered. I am a Marriott Platinum member and even though we were upgraded to a top floor on one night and a handicap suite on another night, the rooms were still run-down and the carpet in the suite was damp on one side of the bed. The walls are paper thin and we were interrupted with loud voices coming through the vents in the early hours of the morning. The front desk staff was apologetic but no actions were taken to resolve the noise. I have contact the Marriott's customer service and they have in turn contacted the upper management of the hotel. Stay here at your own risk! I will never stay here again.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Enfield CT", "Title": "“The hotel was great-the other guests..not so much”", "Author": "jessicar82", "ReviewID": "UR116026358", "Content": "The hotel was great-very clean and it was a comfy place to come back to after a day in Philly. Overall, our stay was great and I would stay here again but ONLY if we could get a room that doesnt have a balcony facing the pool. It was extremely noisy. We had a hard time falling asleep even with our sound machine on. I believe that the pool was supposed to close at 11pm and it was so loud right up until then with people screaming and just being generally obnoxious. On our second night we were actually woken up by a ton of noise around 1am and I thought it was people arguing in the hall but it was actually people who snuck into the pool area and decided to have a drunken party. The parking was also somewhat of an obstacle. It was free parking, which was excellent but it was very hard to find a place to park because the hotel was so busy.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“LOVED IT!”", "Author": "Nakethia", "ReviewID": "UR115977294", "Content": "Our hotel accomodations were provided us with an excellant view of the nature reserve which surrounds the Renaissance. The room was clean, and the hotel provides a single serve coffe and teas. The beds are very comfy. The staff was helpful. My only complaint is that the wi-fi isn't free!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "swo5014", "Title": "“Great service, Great staff... we'll be back, for sure!”", "Author": "swo5014", "ReviewID": "UR115773949", "Content": "We spent last weekend at the Renaissance Hotel in Philadelphia (near the airport), and were so happy with the service we received. It's an older property, but still maintains the high standards you come to expect from a Marriott/Renaissance hotel. We immediately felt so welcomed by the front desk staff member who checked us in (Patrick). His bright & friendly personality was just what we needed after a long drive. He quickly checked us in, and gave us all the information we needed about the hotel (gym, pool, restaurants, parking, etc.). The next morning, we hit the gym, and had a great workout with plenty of state of the art equipment, water, towels, tv's, etc. This is a complimentary service as well. The pool is beautiful, in a fully enclosed atrium, and some rooms even have balconies that open up to overlook the pool. It is a pretty nice setting. After working out, we went to the restaurant for a delicious breakfast buffet (although they do have a regular menu too, I believe). All the food was great, and fresh. Even better than that was the service we received from our server Tiffany. We were lucky enough to sit in her station both days, and she always went above and beyond for all of her guests. One example I found remarkable was when another guest asked her for some eggs (which were made to order at the buffet), but rather than telling that guest where to find them, she asked how the person wanted them prepared, and then she went over to the buffet & ordered them for the guest, and delivered them to her personally. It just seemed so great to me... and the guest was thrilled with her order. This young lady was professional, friendly, and really made us feel special. Our room was pretty nice. We stayed in a spacious junior suite, and the bed was super comfortable. The bedding was crisp & clean, and they use the linen duvets, so you know they are fresh (I am not a fan of hotel bedspreads, so I was very happy). One more thing to note, this hotel was nice & quiet. Despite the very close proximity to the airport, we did not hear a single plane the entire time we were there... although we viewed several planes taking off from our bedroom window. Very good soundproofing! The only downside I can think of is the parking. There is plenty of parking, and it is free, however the lot is quite large, and much of the parking is a little far from the entrance... and so you may have a long walk if you happen to come home late one night. I also don't think they offer valet parking. If you happen to be flying out of PHL, they do appear to have a complimentary shuttle (FYI). Checking out was quick & easy as well, and Sean at the front desk seemed genuinely interested in making sure we had a great time... which we did! Overall, everything was fantastic, and, we'll certainly be coming back.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Attacked by bugs while I slept”", "Author": "Dawn_St_Charles", "ReviewID": "UR115655747", "Content": "I am a frequent business traveler and have spent about 80 nights in hotels this year thus far and this was one of my most disappointing experiences. The lobby and entrance of the hotel are clean and in order but the rooms leave a lot to be desired. I stayed in Room 521 and awoke with more than a dozen bug bites on my calves, ankles and feet. I had inspected the bed the night I arrived and while the mattress looked very worn I didn't see much to be concerned about at the time. The next morning under closer inspection (with more daylight) I found the bed to be quite dirty with stains on the sides and corners...there was a mattress pad and cover but they were littered with pubic hair and I found several small, dead bugs on the mattress under the mattress pad. They did not appear to be bed bugs but I could not identify them, even upon closer inspection with a camera. There was a chaise lounge in the room that had stains all over it as well. I awoke in the middle of the night running a fever and feeling very sick, which is probably when I was being bitten, but didn't know it at the time. I also used the exercise room in the morning which I found to be quite dirty as well. I've stayed at many Renaissance hotels and generally find them to be very clean and nice places to stay but this hotel does not match up to the Renaissance standard. I did report the bug problem to the front desk so they are aware of it and did some online research when I got home and the bugs resemble snow fleas.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Avalon, NJ", "Title": "“What are your priorities?”", "Author": "Adream1", "ReviewID": "UR115401678", "Content": "The reason I pose that question is that this hotel has many good aspects, and some not-so-good aspects. It's not terrible...it's okay, depending on your requirements. Not-so-good: We paid for access to the concierge lounge. Not worth it. It's open from 5 to 10 p.m. then opens again for breakfast until 10 a.m. You can't even pick up a bottle of water outside of the alotted time frame. The evening service was nice; the lady attending stayed on top of keeping the tables clean and the food and beverages fresh. We stopped in for breakfast early the next morning, and I'm sorry to say it was mediocre. Another lady was attending, and maybe it was too much for her to handle by herself. The coffee and hot water carafes were allowed to sit empty for an extended period of time, the tables were not wiped clean through several 'waves' of guests coming through. The 'scambled eggs' sat in yellow water puddles at the bottom of the server. They ran out of items and when guests asked for them the lady had to tell them that she didn't have it; in fact the entire hotel ran out of the same items. Poor lady - not her fault. She was nice. C'mon HOTEL MANAGER - send someone to the nearest supermarket and buy the items guests are requesting. Bananas, milk for the kids' cereal...not exotic, hard-to-find items. Surprisingly, the counter area that held the warm foods (oatmeal and scrambled eggs) had 4 light sconces on the walls above. I almost took a picture with my cell phone to post here. They were hanging off the wall at different angles, the shades half off. The handle on the little acrylic case holding the bagels and bread slices actually partially came off when I opened it. It was hanging by one screw. This is not a \"concierge lounge.\" Do not pay for it. On another note: dust in the room. Must have been in the corners because the furniture was not dusty; in fact the room appeared clean. My poor husband is still sneezing and we checked out this morning! The windows do not open, even a bit, so it's all circulating through the room. Good: The proximity to the Philadelphia Airport is fantastic. We had to pick someone up on the morning we checked out, and it literally took us under 5 minutes from the hotel's front door to the airport's Arrival curb. Turn right out of the parking lot and head straight to the airport. The bathroom was acceptably clean, although the little lotion bottle was half-full and the hair-dryer & bag could use a good cleaning. The staff is friendly. Free parking & large parking lot (lots of spaces). Free USA Today and Wall Street Journal. Nice indoor pool, although you have to walk through the lobby to get there. Never been a fan of walking through the center of a hotel to go to the pool. Shuttle service to the airport. Nice restaurant (didn't eat there, however very attractive room), & nice bar (had a cold draft in the late evening before we went up to our room). Comfortable mattress, clean linens, feather pillows available. If we had to stay in a hotel to catch a morning flight, I would stay there again. It's cheaper than the airport Marriott (by half). If we were attending a show or sporting event at the Philadelphia arenas, and didn't need the proximity to the airport I'd stay in a different hotel.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "dublin,ohio", "Title": "“Average for Marriott brand.”", "Author": "dublinvol", "ReviewID": "UR115336778", "Content": "Rooms were basically clean but had a few minor spots that needed attention.Hotel still needs some updating in decor.Front desk staff needs some training .Struggled for anwsers for many of my general questions for information about services, directions etc. Took 15 minutes to process a Marriott gift card at check-out.Seems a general problem with Marriott these days.Breakfast was above average however.Main dining room a bit stuffy and overpriced compared to other options in the area.Club lounge was pitiful compared to others I have used in say Chicago.Monday morning breakfast there was a joke compared to buffet downstairs.Ran out of food, napkins, silverware just about everything.Seem to have corrected their vehicle break-in problems that others have mentioned which is good.Beware of the geese at night though.They roost on the service drive near the front of the hotel at night and leave a terrible mess to clean up the next day.Room rate was very competitive though versus other chain hotels in the area.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Mateo, California", "Title": "“Not bad for Airport”", "Author": "Travlin_Tom71", "ReviewID": "UR115299674", "Content": "Suited my needs for a 4 day business trip to Philadelphia. I couldn't get a room in Downtown Philly so our team decided to tough it out by the airport. It has Free shuttle to and from the Airport, good size pool, and friendly staff. If you want to take the train into Downtown, the shuttle will take you back to the terminal at the airport. Their exercise room is a bit neglected, and could use some work and maintenance. The restaurant on site is decent at best, but it gets the job done with out indigestion (which is hard to do in Philadelphia).", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "", "Title": "“45 minute wait for airport shuttle”", "Author": "RobReno", "ReviewID": "UR114838967", "Content": "Things started off bad when we had to wait 45 minutes for the shuttle. Called twice and another person waiting also called twice. It is less than a ten minute ride when we finally got on the old beat-up van with a paper sign taped on the door. I thought later, anyone could drive up in a van like that one and take us anywhere Check in was okay and we got a room on the concierge floor. Lounge was minimum and unlike other Renaissance Hotels we had to pay for a glass of wine. Person serving in lounge sat on her butt and was of little help. Had dinner in restaurant and staff there was good and tried to make up for prior problems. Chris did a great job. Missed breakfast, which was probably not a loss, because of an early flight. In the past we have stayed at Airport Marriott ( no shuttle, can walk to hotel). It was full so we tried the Renaissance - never again.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lancaster, PA.", "Title": "“Great Hotel for good price”", "Author": "countryboypa", "ReviewID": "UR114772459", "Content": "Stayed here on a getaway weekend with spouse. Room rates were great for a weekend deal. Hotel is at a great location for Phila travel to and from city. Parking is free. You won't get that in the city hotels. Center city is only 15 to 20 minutes away on 95. Hotel is very large but quiet and clean. We had a king room . Room was very large and the bed was comfortable. The TV was outdated as was some of the furniture, but the bathroom was nice and large, and clean. Staff was very nice. Pool was nice size and felt good after a day of sightseeing. Two complaints, one is they charge for internet in the rooms, nobody does that anymore. And second there is no breakfast buffet at all.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Raleigh, NC", "Title": "“One Night Stop - LOUD LOUD LOUD”", "Author": "telamm", "ReviewID": "UR114652187", "Content": "There was a wedding at the hotel the night we stopped in on our way home during our travels. This was a mistake. All the rooms around us were loud, in the middle of the night we called security and in stead of going to their room he came to ours and told us to be quiet! The bustle continued, including the drunken bride screaming at the top of her lungs, hope she remembers it... It was okay, not really worth the money, though", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boston", "Title": "“Close to PPL park and downtown.. near the airport”", "Author": "soccergirl123", "ReviewID": "UR113428921", "Content": "Hotel was clean and the staff was awesome. Very close to PPL park about a 10 minute drive. Rooms are big and spacious. Buffet breakfast was nice fresh waffles and omelets. Near the airport, but you need a car to go anywhere.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ice cold minnesota", "Title": "“ExcelGreat place to stay”", "Author": "luvtorelax", "ReviewID": "UR112987803", "Content": "Was concerned based upon reviews. Found this place great! Love the AVEDA products!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Santiago, Chile", "Title": "“Very nice airport hotel”", "Author": "kyleracine", "ReviewID": "UR110162896", "Content": "I really liked this hotel. The rooms are nice, modern and very clean. I also appreciated that they were quite quiet. Staff made checkin and checkout quick and painless. And there was a shuttle that left to the airport every twenty minutes which made it convenient to get into downtown Philadelphia. However, the shuttles were often late, which was kind of annoying to try and be able to plane your arrival to the airport. That was my only negative about the hotel.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dru_travels_alot", "Title": "“Average at Best”", "Author": "DES_travels_alot", "ReviewID": "UR108860994", "Content": "The room was spacious however needs to be updated. I have stayed at MUCH nicer Renaissance hotels - not sure why this one wasn't up to par. I was happy that they had a \"real\" hair dryer in the bathroom - I am not a fan of the ones attached to the walls. The Aveda hair products were also a nice touch. I had the crunchy french toast for breakfast - it arrived promptly for when I ordered it (put the order card on my door the night before) in the morning and it was quite good. Probably would try a different hotel at the Philly airport next time I stay there. Other hotels seems closer to the airport and easier to find. Though ok, this one didn't win me over.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Guayaquil", "Title": "“Lost its Luster Long Ago”", "Author": "alanisinecuador", "ReviewID": "UR107422531", "Content": "The lobby staff made a valiant effort at trying to make me happy, but the physical installations were beyond their customer service. The hotel desperately needs renovation.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rock Hall, Maryland", "Title": "“Park and Stay Package”", "Author": "evetsmd", "ReviewID": "UR103935243", "Content": "Needed a room close to the airport to be able to catch an early flight out of Philadelphia. This hotel gave us a package for Park and Stay that was less than what we would have paid for long term parking. Courteous staff, clean comfortable room, quick shuttle service. We couldn't have asked for any better accommodations. Thanks Renaissance!!", "Date": "April 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Stay elsewhere if you can”", "Author": "lucycan", "ReviewID": "UR102296328", "Content": "I read all the PHL airport hotel reviews on here and really thought this one might just be misunderstood. I didn't want to pay $250 for the Marriott so I stayed here. Mistake. I have stayed at probably 25 different Renaissance around the world and this one is, by FAR, the worst. PROS: Good location if you get in at midnight like I did. Marriott at the airport would be better. The staff was generally friendly. CONS: This place needs a major rehab. Its, at best, old Super 8 quality. The elevators are shabby, the wallpaper is coming off the walls, the carpet is filthy and I wanted to wear my socks in the shower. The lock (the one that flips over on the inside) on my door was completely broken off. The shuttle was missing a rear door seal which made it sound (and feel) like the door was open. Cold and uncomfortable. The cleaning staff was LOUD. At 8am they were shouting up and down the halls to each other. Not just once, but several times. I was not sleeping but I was on the phone. Not sure who (if anyone) cleans the rooms, but I had nuts on the floor (in front of the door) and stains on the (old style Marriott) bedding. The glasses in the bathroom were dirty. The bathroom needs a serious makeover. Caulk has been used around the edges of the tub (typical) but has come off in most places. The sink knobs looked like they were from the 70s and had not been cleaned since. The light switches were the DIRTIEST I have ever seen in a hotel. The concierge lounge had a very sparse breakfast. A few apples. No yogurt. Eggs were ok.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Bremen, Germany", "Title": "“close to the airport, nice staff - but needs renovation”", "Author": "Freizeitmokel", "ReviewID": "UR101761646", "Content": "I would agree to people posted on this hotel before. This one needs some renovation. The rooms are definately used and even they are clean you feel a bit uncomfortable. Not the Marriott level I'm used to. Other than that it's a good place, free parking, very close to the airport, downtown is less than 30mins by car, so is King of Prussia. The hotel pool is also nice-indoor but with glass walls so it's nice and bright. Overall a good place with a very friendly staff.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Austin", "Title": "“Good Hotel at PHL”", "Author": "FlyguyAustin", "ReviewID": "UR97212042", "Content": "The Renaissance Philadelphia Airport is a nice hotel and you will like it. Friendly staff at front desk, big rooms, nice bathroom with average amenities for this rank hotel. Two telephones, big, comfortable, bed with lots of pillows, free coffee maker in the room and in the lobby. TV was older CRT, and there is a $13 a day charge for internet..I did not find free internet in the lobby. No charge for parking. Although not a problem, this hotel, as is the case of so many others, is not keeping the public areas upâ€”cracked elevator buttons, peeling wall paper, carpet getting a little too wornâ€¦guests are very hard on hotels and some of it is showing. If you get a good rate, you will like this hotel and I recommend it.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster PA", "Title": "“Just What I Expected from Renaissance”", "Author": "sgtrudz", "ReviewID": "UR88464843", "Content": "As I read the other reviews, I can't help but wonder if some of them stayed in the same hotel. My stay here was exactly what I expect from a Marriott product. It was updated, clean, and the staff was friendly. The staff went out of their way to accomodate my request for a room overlooking the runways. The van drivers were great as well! My only complaint would be that the hotel did not seem prepared for the large number of people who needed transfers to and from the airport - expect a wait. This hotel prefectly suited my needs and I would not hesitate to stay here again.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Carlisle, Pennsylvania", "Title": "“Great Service, Very Good Hotel”", "Author": "BES09", "ReviewID": "UR85972462", "Content": "14 of us went to a conference in Philly airport area and got a great rate here via Marriott. Even though the hotel was very busy the service was excellent! The rooms were large and well kept. Air vents in some bathrooms could use more cleaning. The staff knew the area restaurants and routes to and from various places. Calls for extra towels and other requests were taken care of quickly and with in friendly manner. Would certainly go here again!", "Date": "November 4, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Adequate...that's all.”", "Author": "justjo30", "ReviewID": "UR84385603", "Content": "This hotel is under construction. The new rooms are quite nice. Furnished with tasteful items. Beds are very comfortable. There was still a strong \"new carpet\" odor. The older sections of the hotel are quite worn. Be specific that you want a renovated room. Front desk staff was friendly and accommodating, very professional. Fine for an airport hotel. Got a great rate on Hotwire so, for the price it was fine.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Better than Expected”", "Author": "NY1124", "ReviewID": "UR76738723", "Content": "Stayed here one night, as we missed our flight connection home. Arrived very late and very tired to a nice, comfortable, clean hotel. Check-in was quick and easy. Staff was pleasant and empathized with our situation. We had no luggage with us, and therefore had to take advantage of any and all toiletries offered. The room was huge...I could have done cartwheels across the whole room! The bed was very comfortable...I slept like a baby. Bathroom was big, maybe a little old, but good sized. All the toiletries provided were of decent quality. There was a room service menu for breakfast that had quite a few options. There appeared to be other dining options available, but we literally stayed in this hotel for 7 hours. 24 hour shuttle service to and from the airport was very convenient. We really had no complaints. If we ever need a hotel in Philadelphia again, I would not hesitate to stay here!", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia", "Title": "“A smidge nicer than most airport hotels.”", "Author": "oversold_plus_2", "ReviewID": "UR75443458", "Content": "While the service was impeccable, the property was not. Bedskirt was stained, dusty furniture, holes in upholstery and a broken air vent. Like a ghetto Motel 6! The pool, while nice and big, needed a good cleaning too as I felt it was a little cloudy and I saw some hairs floating around. Bed was super comfortable and the only noise was from a couple of jumbo jets landing nearby. You can see the airport from the hotel and, as crazy as it sounds, it is easier to get to the airport from the hotel than to the hotel from the airport. A few signs would have been nice so I could be assured I was headed in the right direction as the area seemed unsavory. A call for extra towels and more soap, (Aveda ammenities! Wonderful!) was quickly answered and a sub par room service order was rectified ASAP. Staff was more than friendly, but someone needs to go the extra mile on the cleanliness and cosmetics here.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tampa", "Title": "“Good Stay”", "Author": "BiggestJohn", "ReviewID": "UR73388838", "Content": "I stayed in this hotel 1 night for a personnel trip. The location is bad. Very hard to get to, but then most hotels in the area are a challenge. The staff was very helpful. There was a huge line but they took care of us very quickly (less than two minute wait). I was on a special rate but forgot my card, but they gave it to me anyway. The room was very good, typical for Marriott hotels. Clean room, comfortable bed. Check out was very quick. Only thing that was strange was there was 100 kids running abound the hotel. Not sure why, did not affect my stay, just odd.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Horrible”", "Author": "MarkiePoo", "ReviewID": "UR72245661", "Content": "I shouldn't known better. Checked in on a Saturday night and asked for a quiet room and ended up on the third floor as one of the ballrooms. Party goers screamed from the third floor down to the first floor for hours while the security folks were nowhere to be found. Received free breakfasts and Marriott reward points for my pain, but would never ever stay in this place again. We booked through Priceline and did we ever pay for the deal!", "Date": "July 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Dirty hotel with no standards and no leadership”", "Author": "Lovetheeastcoast", "ReviewID": "UR70702588", "Content": "This room was booked on Priceline and as usual, we received a non-standard room. We arrived at 10:00 PM with six bags and no bellman present. My son found a cart and we then checked in with no issue or offer of help. The room was 431. We opened the door and looked into the room. My first thought was that the Philadelphia SWAT team had kicked in the door as the security latch was broken in half, the frame around the lock was missing, and the sound proofing rubber strip was missing in places. The carpet was heavily stained and not vacuumed. Both quilts were very soiled and the sheets had more wrinkles than a plum left in a hot car. I found a dirty comb in the desk drawer along with more crumbs. From the hair on the floor and in the tub, and dust on the towel rack I would say the floor in the bathroom had not been cleaned anytime in the recent past. I walked down to the front desk and let the front desk clerk what was going on. He was very apologetic without making any recommendations or any offer of help. He said Housekeeping was gone for the night. I asked for four clean sheets and pillowcases which was delivered within 15 minutes by an angry man out of uniform. I remade the beds and didn't sleep well needless to say. At 8:20 a housekeeping knocked on the door asking when we would be checking out. No good morning and no thank you for answering her question. With a plane to catch and five people in line with one clerk I did not pursue this issue any further.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Millville, New Jersey", "Title": "“Nothing to Complain about for only 1 night!”", "Author": "travelenfool", "ReviewID": "UR68242842", "Content": "We stayed at this hotel the night before flying out of PHL, we parked our car there for 7 days with no problems. Hotel was very busy but staff were still very friendly. The shuttle drivers were great and timely with thier schedule. We would recommend this hotel for a stay, park and fly.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "3", "Location": "1"}, "AuthorLocation": "South River, New Jersey", "Title": "“Definetely not a 4 star hotel”", "Author": "feuza", "ReviewID": "UR67211442", "Content": "Pros- room was spacious and it was the MOST comfortable bed I have ever slept in so if you are looking for just a good nights rest than this is the place for you Cons- it reminded me of a 3 star hotel with older building fixtures and not so modern furniture as if it was an old building trying to be new, the area was weird, seemed like it was a by a swamp place, kind of secluded and odd to get to, did not have time to try the restaurants we did get a very crazy cab driver referred by the check in attendant, this hotel was very far from downtown, we had read it was 7 miles but more like 11 miles and there was a lot of traffic on freeway", "Date": "June 11, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Unsafe parking! Park at your own Risk!”", "Author": "ctlvr069", "ReviewID": "UR66332732", "Content": "We stayed one night at this hotel on a park and fly plan, and returned a week later to find our car window smashed. We were told that ours was one of many vandalized in the hotels parking lot. What was even more frustrating was we were told that security patrols the parking lot, however our window was smashed the night we checked in and nobody told us the next morning before we left for the airport. We also found out that there are no surveillance cameras in the parking lot and that this happens often at this hotel. WIll not stay agin. Park at your own risk!", "Date": "June 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Altoona", "Title": "“Good Value~if you book through Priceline”", "Author": "jnr91203", "ReviewID": "UR65129850", "Content": "Parking was free which you almost always get outside of the city~room was clean~nothing spectacular. The plumbing in the bathroom needed to be fixed. I shouldn't have to hold down the handle on the toilet, nor shake it for it to stop running. Tub was clogged with hair,etc.. Nasty! When we checked in one of the front desk staff were entertaining friends~one looked like he had just gotten out of prison. Elevator buttons were dirty~for the price we paid on Priceline (65/night before fees), it wasn't a bad deal. No way would I pay even the government rate to stay there though. I guess I thought it would have been nicer for on the upscale Marriott branded hotels.", "Date": "May 24, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "CA", "Title": "“Worst customer service in Philadelphia”", "Author": "dontlikehotel", "ReviewID": "UR61828657", "Content": "The hotel charged my account without my notice. When I returned home I noticed an extra charge on my account. I phoned the hotel and the clerk began to lecture me on finances. What a joke. She explained why the charges were there. I asked why no one at the time of check in explained the charge before my actual check in. The clerk said in a rude voice that someone should have. Like it was my fault that I did not know... I will never stay at this hotel again or any Renaissance Hotel. The customer service is awful. The tone of voice the clerk used was awful. She did not say thank you, I sorry about that, let me explain. First impressions are everything. Terrible hotel! Please do not email me!!!!", "Date": "April 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Tampa, FL", "Title": "“Restaurant Warning”", "Author": "NikonLady", "ReviewID": "UR59228008", "Content": "This Renaissance is not what you would expect from a Renaissance Hotel. The hotel is clean, but expect to find orange lady bugs dropping from nowhere in your room; these are the lady bugs that bite. Rooms are adequate, but not a luxury room. Also this hotel is located in a not so good area where you might feel uncomfortable going out to eat unless you know the area and know where you are going. Parking is in a lot not well lit and surrounded by tall grass and railroad track, no security outside. In addition, no free internet service, you must pay. Even in the business center, if you need internet access they charge you on the business center computers. But more so, do not eat in the restaurant! First night I ordered salmon, it did not resemble the description on the menu, and for $25.00 you got a small piece of salmon, a few not fresh green beans and not fresh, but frozen cooked potatoes. The second night I ordered tortilla soup. When I got to the bottom of the bowl the chicken was raw and I mean bloody raw, gross. I also ordered a tuna burger with the soup, horrible. It was like rubber, had a hard time cutting it with a knife, never mind a fork. The manager came over and took the soup off the bill and gave me a free desert. Order the deep dish apple pie with vanilla ice cream. They came back and said no vanilla ice cream only chocolate or strawberry. OK, ordered with chocolate. Well the deep dish apple pie was a mushy pie that was micro waved, horrible. I had stomach problems for 5 days after eating here. If you decide to stay here, make sure you eat somewhere else before returning to the hotel for the evening. Value - not so good. I will not be staying here again.", "Date": "March 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Columbus, OH", "Title": "“No issues here, great stay!”", "Author": "bretb88", "ReviewID": "UR58941173", "Content": "I was hesitant to stay here after some reviews I read but I'm loyal to Marriott so I tried it out. I was unable to check in (I did come at 1PM, so I wasn't upset or expecting a ready room necessarily). They sent me up to concierge with a free drink and snack. I also had internet service and television in there. My room was clean and comfortable when I got to it. It does have an older style TV, but to me that is not an issue (easier to flip through channels then the new flat screens)! As far as food and drink, yes it was steep. But this is like any other full-service hotel near an airport (Westin, Hilton, Hyatt etc.). You pay a premium for location and inclusivness. We had transportation, so it wasn't a big deal. If you staying here without, expect to pay more than usual for food and drink. It had a nice fitness center and pool.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Anchorage, AK", "Title": "“Best hotel at the Philly Airport”", "Author": "AKdogs", "ReviewID": "UR58755243", "Content": "Outstanding value for the price. Huge rooms, terrific pool, very quiet, super clean. If you need to spend the night near the airport or if you are looking for a base of operations for the Philly area, this is a terrific choice. Only drawback: not really anything within walking distance. Our family stayed in two adjacent (but not adjoining) rooms. The rooms were very large and well-designed, with extra-spacious bathrooms. Despite the proximity of the airport, our rooms were perfectly quiet and we were able to get excellent rest. Beds seemed very new and were thoroughly comfortable. No flat screen TVs, but they offered a very wide range of channels which made up for it. We were upgraded (without even asking) to the concierge level, which offers a nearly continuous free repast (Continental breakfast, midday snack, afternoon tea, hors d'oeuvres, then dessert). Breakfast included a wide range of options to suit nearly everyone - cereals & oatmeal; fruits; bagels/muffins/toast with jams, peanut butter, cream cheese; hard-boiled eggs; cottage cheese; cold cuts etc. There is an evening honor bar with wine and liquor/mixes for cocktails. Hors d'oeuvres included jalapeno poppers, mixed nuts, sliced meats & cheeses. After that, the desserts (one night's offering: both triple chocolate cake & cheesecake) were almost too much. The hotel features exceptional staff who were genuinely friendly and helpful. Although it was our first time staying there, it was clear from the interactions that many of the guests had been there repeatedly. The guests & staff greeted one another like old friends, inquiring about this one's grand-baby and that one's new car. Free parking and good location near the airport and highways.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Nice hotel...for 7 hours!”", "Author": "MileHighGirl", "ReviewID": "UR55972665", "Content": "I stayed overnight at this hotel on February 11, 2010. I arrived at PHL at 11:45 PM. I called for the shuttle and it took 25 minutes for it to arrive. The driver of the shuttle didn't get out of the van or help with my bag and he wasn't that friendly to me. I had a bit of a wait to check in. There was one person to check people in and two pilots were checking in and they took a long time. Someone else eventually came to check me in. I was in room 708, a junior suite. I had trouble with my key card not working. A trip back down to the desk got me someone to come with me. It took him 9 tries for the door to open. They offered to get me a new key card but I was leaving the hotel in less than 6 hours. I didn't need to go in and out. The room was great. Big. I turned the temperature down. It was comfortable but it never got as cold as I like it. I needed to check the status of my flight the next morning and I had to pay for the internet access. $2.95 for an hour. That definitely effects my decision to ever stay there again. There was an alarm clock radio but the alarm time wouldn't change. I called the front desk asking for a 5:20 AM wake up call. They called at 5:10 AM. The bed was big and comfortable. I only slept for 4 hours but it was a good sleep. I went downstairs at 6:30 AM to catch the 6:40 AM shuttle to the airport and there were 5 families already waiting with 6 to 10 pieces of luggage. It looked like the hotel let people park there for free while they were on their trip if they stayed one night. That put me last in line behind several families for the shuttle. I didn't have the time to wait so I took a cab to the airport. Overall I would not stay here again. I'd probably recommend it to leisure travelers but not for business travelers. It's a nice hotel, nice rooms, clean, etc. But when I'm traveling for business I like specific things and this hotel didn't measure up for me.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dallas", "Title": "“Not as bad as the reviews say”", "Author": "LonghornDallas", "ReviewID": "UR55658512", "Content": "I was very nervous about this hotel after reading the reviews. Overall, I was very pleased with my stay. The hotel shuttle was prompt, but it could have been cleaner inside. The check-in staff (Khalil) was very personable and helpful. The room was very clean and comfortable. The TV is older, but it worked fine and had plenty of channels. Breakfast was very good, just a little pricey. It did snow during the stay, but the parking lot was getting plowed. Overall good experience and close to the airport.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "allentown", "Title": "“Surprized when we returned!”", "Author": "painter13", "ReviewID": "UR55605510", "Content": "Our car was parked there for a week during the February snow storm. Flying home from the caribbean I was wondering how I was going to dig it out. Was I surprised to see it swept off and cleaned all around. I warmed it up and drove off. Hats off to the staff.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "3"}, "AuthorLocation": "pennsylvania", "Title": "“Not a very safe environment”", "Author": "iceland04", "ReviewID": "UR54421162", "Content": "We stayed at this hotel, paid the $50.00 parking fee, and returned to find our car windows smashed and the vehicle vandalized. We were told that ours was one of many vandalized in the hotel's parking area, that there is no \"secure\" parking, and that there aren't even surveillance cameras. After meeting with police, we stayed another night since it was too late to travel home in a car without windows in January. Upon going to our car the next morning, we found yet another guest's vehicle with its windows smashed and vandalized just that morning. Thankfully, our timing was such that we weren't confronted by the perpetrators and escaped physical assault. A parking lot along high weeds and railroad tracks is not safe and a lack of surveillance cameras is inexcusable. In retrospect, having to put the requisite \"parking permission card\" on the dashboard was an open invitation to theft. So far, no satisfaction from the hotel - they just reiterate that they are not responsible for theft and loss.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "detroit", "Title": "“Very comfortable room.”", "Author": "kkkkathy", "ReviewID": "UR53408281", "Content": "We checked in after arriving on a late flight and were upgraded to Club Level. THe rooms were very clean and comfortable and very quiet. Unfortunately the Club Lounge was already closed for the night but the front desk gave us some water bottles and a warm cookie. We moved back there prior to leaving the area because we didn't like out other holel in King of Prussia. Again we were upgraded to Club Level and since the Lounge was closed for the weekend we were given tickets to free buffet breakfast in the restaurant. I thought the hotel was very comfortable and would recommend it as being convenient to the airport.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "4"}, "AuthorLocation": "NJ", "Title": "“Not Up To Renaissance Standards”", "Author": "Caroline2008", "ReviewID": "UR51996979", "Content": "This hotel is over-rated and should not even be categorized as a Renaissance property in my opinion. The Marriott luxury hotel brand is the Renaissance chain. Over the years we have stayed in numerous of their hotels. This one is sub-standard and as such is extremely over-priced. Adding to our disappointment was the fact that our visit was on Christmas day when our expectations were high. Chief among our complaints? The hotel reeked of grease during the complimentary breakfast service. The hallways were filled with that stench and our clothes carried those smells for quite some time. The hotel location is somewhat obscure. Navigating around the airport side roads in attempting to reach or leave it, were problematic. The front desk was disorganized. We had booked a package that included tickets for an event and breakfast. Upon check-in we were not provided with those items. Several phone calls and a wait for several hours the next day when we realized the omissions, delayed our entire schedule. Pre-printed directions to the event had the wrong highway exit number on them. We missed the performance as a result and had to wait another two hours for the next one. On a positive note, the exterior architecture of the hotel was beautiful. The staff were amazing. Say hello to Otis in the dining room. Overall, this property is not a luxury one. The small touches that add to it such as soft towets, shampoo amenities etc were missing. We had to pay for Internet which is disgusting. Stay somewhere else until Marriott improves this property.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Tokyo", "Title": "“Convenient to Airport, not a 4-Star”", "Author": "oliviapulley", "ReviewID": "UR51824864", "Content": "We booked via Priceline for a good rate. Convenient to airport but not to Philadelphia. They offer a free shuttle to airport. Warm cookies and friendly service on arrival. Large clean room and bathroom. Very nice bedding and toiletries. No mini-fridge in our king size room. Gave a packet of \"forget me not\" flower seeds, which was a really sweet touch. Free parking. I believe there was a free fitness center and pool, but we didn't check them out. Not really a 4-Star, more like a 3.5-3.75-star, as not same class as Sofitel, etc.--not the same level of service, amenities (eg robes, in-room yoga and the smaller touches).", "Date": "December 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "BelAir,MD", "Title": "“The staff steals”", "Author": "BelAirMom", "ReviewID": "UR51813939", "Content": "We stayed here when our flight was snowed in. We left the hotel at 8:30 am in the hotel's shuttle back to the airport. When we arrived at the airport we called the front desk to say that we had left the ipod plugged into a lamp on the desk. The guy at the front desk said he'd go up to our room. I called back to the front desk 15 minutes later he said that when he opened the door the sheets had been taken off of the bed and the ipod wasn't there. We were told that the the woman who had cleaned the room said she hadn't been in there (even though security said her key card had opened the door). We have called and stopped back to the hotel. Eventually the GM credited us our room for that night but that only covers 1/3 the cost of the ipod. It is upsetting to know that your belonging are not safe in their rooms. As a side note room service took 90 minutes to arrive.", "Date": "December 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Yardley, Pa", "Title": "“WONDERFUL END TO A TERRIBLE DAY”", "Author": "AllegrosFlight", "ReviewID": "UR50042233", "Content": "My wife and I found ourselves drained and depressed after learning that our RV had become ill. We had to leave it at the dealership for a few days of repairs. We checked all the hotels through all of the third party providers...none seemed right. We had never stayed at a Renaissance facility and although the price was at the top end of our budget, we opted to try it. We were so happy. The entrance is grand, the lobby, a beautiful 12 story atrium was nearly elegant. The atmosphere was subdued and pleasant. I was checked in by the nicest young man who was the Front Desk Manager, Mr. Kyle Welsh is his name. Kyle was upbeat and cordial. He could tell by my face that our day had not been a good one. Suffice to say that the room he gave us, his wonderful attitude and the breakfast the next morning moved us enough to remain at the Renaissance for an additional day. I also had the opportunity to meet the General Manager who was also delightful. When we are in the Philadelphia area, we will pop in to the Renaissance to spend another night there. By the way, although it is very near to the airport, we never heard a single take off or landing....it was so quiet there !!! Thank you so much Mr. Kyle Welsh, we will return.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "CA", "Title": "“Inconsistent - great looking”", "Author": "boorad1", "ReviewID": "UR49203125", "Content": "I stay at this hotel often both for business and pleasure. Great looking hotel on the outside but rooms are old and tired looking. TV is from the early 90s. Pool is very nice if you are about 30 feet away but as you step closer you can tell that it's old and not well maintained. My daughter slipped too and hit her head because it was so slippery. Some staff members are Excellent - very helpful while others are just terrible and couldn't care less so very inconsistent that way. Whenever i've had a complaint though the staff have always been very helpful. Also - the hotel was extremely noisy one weekend when i was there. The staff did nothing to quiet some unruly guests down.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Los Angeles", "Title": "“Gym, Pool, Room, need help!”", "Author": "2much2x", "ReviewID": "UR48862201", "Content": "I'm a platnum member. Staff is friendly as a whole. Good rate. Gym is lacking and dirty. Swimming pool is not well maintained. Rooms are not well maintained.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "New Jersey", "Title": "“Shame to the Renaissance name”", "Author": "Speedywheel", "ReviewID": "UR47914539", "Content": "Not recommend to others unless you absolutely have to stay here. When I checked in around 8:30 pm I was told the hotel was over-booked (even I had my confirmation the day before). I refused to be sent to the other hotel so they managed to find a room for me. The room and equipment are pretty old (carpet worn, etc.). For breakfast it was very fatty, not healthy at all and selection was very limited. Most of the staffs are friendly. Hard to find the entrance (not well marked) and easy to miss.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Wausau, Wisconsin", "Title": "“Needs some TLC”", "Author": "Harry_Gein", "ReviewID": "UR46691521", "Content": "While this hotel wasn't too bad, in my opinion it just doesn't live up to the other great reviews here. We received a (supposedly) upgraded room, but the toilet handle was loose, the sink drained poorly and some TV channels were missing. In the common areas, some elevator buttons were unmarked and carpeting was worn. The hotel's sign on the building was not lit, making a difficult-to-get-to hotel even more hard to find. Does any of this affect your night's sleep? No, but hearing the music from a wedding on the 3rd floor does. Breakfast buffet food was poor; I don't recommend it, even for free. We've stayed at several Marriott Renaissance hotels and this one was disappointing. You don't want to pay more than $120/night here unless you're desperate. But in spite of the facility's shortcomings, the staff was truly accommodating and deserve recognition.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Sayreville, New Jersey", "Title": "“Mildew problems in room 1013”", "Author": "Faithie4", "ReviewID": "UR46004863", "Content": "The staff was very nice. Especially Rachel, she is a doll. Our room had a few wet spots and the blankets and the whole room smelled like mildew. We didn't ask to switch rooms as we didn't have the time since we were running out for a conert. So I don't know if it was an isolated incident or not. We had breakfast at the buffett in the morning and it was very good. Have a clean room is a pretty important thing. I wouldn't recommend this hotel to a friend just in case it wasn't an isolated incident. The hotel is located on marshlands so I am not sure if that is a factor.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Miami, Florida", "Title": "“Not what you expect from a Renaissance........not even close”", "Author": "GEOFFS3", "ReviewID": "UR45624317", "Content": "I stayed at this hotel 5 times during September. This is where my company forces us to stay due to the low rate. At first you are like......wow....a Renaissance. This place is nothing to get excited about, trust me. LOCATION: At the end of the airport runway, sort of tucked away in a business park. There is absolutely nothing within walking distance except a couple of office buildings. It's literally surrounded by a swamp. I'm not sure you could even go for a walk if you wanted to. SHUTTLE: Generally OK. However, the vans also double as an employee shuttle to the airport (so can can catch the airport train). You can spot the employees standing outside the front entrance smoking. Classy, huh? SERVICE: Hot and Cold. Really no other way to put it. I've dealt with some really nice folks that were rather helpful. But mostly you are dealing with total apathy. In fact, there are a few employees I dealt with whom I thought were going to pull out a gun and rob me. Needless to say, the staff is without a doubt unrefined and a little gritty. I don't think most people like their job or the company they work for. Just a little guess. ROOMS: This is where this place REALLY needs some attention. For starters, the decor is early 90's, if not earlier. The furnishings (some of which are falling apart) are a mish-mash of styles that don't really go together. The bedding is not bad and I generally slept well. The bathrooms are rather large. HOUSEKEEPING/UPKEEP: Can I give MINUS 5 stars here? Whoever runs their housekeeping department needs to be fired. Where do I start......... 1. Twice, my bathroom had USED (yes, including the mouthwash) toiletries that were less than full. 2. Sheets/pillowcases that I'm not sure were changed (mystery spots!) from the last guest. I finally started \"marking\" the sheets with a little shampoo or toothpaste to make sure they got changed. 3. Lots of scuff marks/stains on doors, walls, etc 4. A tub that would almost completely stop up. I love standing in dirty water. 5. In the gym, I found a lone piece of fruit rotting in a fruit bowl....with a roach crawling on it. Yum. 6. There was a cobweb (with spider) outside the front entrance between a post and a shrub. I don't think anyone had paid it any attention for months. 7. Maids bang on the door (or call your room) starting very early wanting to know what time you are leaving. 8. One morning, 2 maids got into a cat fight right in the hallway right outside my room. Nice. IF YOU ARE GOING TO STAY HERE: 1. I hope it's REALLY cheap. I mean REALLY cheap. 2. Avoid a room that has a window/sliding glass door that opens into the atrium-pool area. You get a VERY strong whiff of chlorine. 3. Try and get on the 10th (top floor). I get the idea those rooms are the \"real\" rooms they actually get cleaned. 4. There isn't much as far as food at the hotel. Some days, it appeared as if the restaurant was closed, even during peak eating times. In any case, there is NO food available (even room service) after midnight. SECURITY: Let's just say....the employees here don't make me feel confident about my safety and security. Twice, I had key problems with inoperative keys. In any case, I would avoid this place if you can. There is a brand new Marriott at the airport that is walking distance to the terminal. Honestly, I'd rather try ANY other airport property than go back here. Ick.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Canada", "Title": "“Nice hotel but housekeeping needs improvement”", "Author": "swhli", "ReviewID": "UR39729068", "Content": "We stayed in Renaissance Philadelphia Airport Hotel not by choice (put in there by US Airways because of canceled flight) and just slept there for a few hours before catching our next flight. The junior suite was very spacious. Shuttle to airport was very efficient. My only complaint was on housekeeping: they did not even clean up the coffee machine and left the old coffee bag inside!", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Altoona PA", "Title": "“AWESOME HOTEL”", "Author": "kimol99", "ReviewID": "UR37944512", "Content": "Gorgeous hotel. State-of-the-art. You feel like you're making a grand entrance into the lobby. Fast, efficicent, extremely friendly & helpful staff both at the desk and in the restaurant. Rooms were very comfy, cozy, clean, and remodeled or new for current colors & trends. We loved our stay here! With the relocation of family members to Philadelphia we'll be staying here more frequently.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Pa.", "Title": "“Nice hotel”", "Author": "BigMalPa", "ReviewID": "UR37187968", "Content": "Very nice hotel. Took the shuttle to airport (free) and then Septa to Center city e. market st station. Very easy, Nice pool, quiet location, good service, had a nice 2 days here.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Jupiter, FL", "Title": "“An Old Radisson Retagged with a Renaissance Name”", "Author": "JPinJupiter", "ReviewID": "UR36745905", "Content": "I'm not really sure how Marriott allowed this hotel to brand itself as a Renaissance. My wife, my one year old son and I were stranded in Philadelphia after our flight was cancelled. Here is my review- 1. Transportation. The airport shuttle drivers were terrific. The individual that picked us up from the airport was friendly and helpful. Another shuttle bus driver agreed to take my wife to a local store to get baby formula. They went well beyond their jobs to help out. 2. Physical Condition: As we pulled up to the hotel, I immediately recognized the hotel as an old Radission that I had stayed in back in '97. Given that the hotel was now carrying the Renaissance name, I had expected that it had been renovated. No such luck. The room (Room 500) was aging, the door lock latch was broken and the bathtub drained extremely slowly. 3. Cleanliness: The hotel housekeeping staff isn't performing its' job. There was a stain on the comforter and a dirty tissue from a previous guest left behind the curtains. Additionally, our room had an indoor balcony that had a dead cockroach on it. If you're an optimist, I suppose you could say that it was an indication that they hotel's pest control service is doing its' job, but I'd prefer not to see cockroaches in the hotels in which I'm staying. 4. Service. I had to make the request for crib three times before one was finally brought to our room. I will say that my negative experiences were all with the nighttime hotel staff. Our interactions with the day staff were somewhat better. I hate to give this hotel a poor rating because the shuttle bus drivers were so helpful and went out of their way to help. However, the reality is that this hotel is a really about a 2 1/2 star property.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maryland", "Title": "“Great hotel, good location, quiet area!!!”", "Author": "JoviFan", "ReviewID": "UR36592760", "Content": "We just spent the night here - great hotel, large clean king room - large bathroom, great view from our window of the planes! Amazingly quiet being so close to the airport! Staff was very friendly. Loved the huge 'pond' on the grounds! Would definitely stay here again! Only downside was our room AC wasn't working properly -thermostat seemed broken, no matter what temp we set to, it was like the artic in the room, so we finally just turned it off!", "Date": "August 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "baltimore, maryland", "Title": "“Insensitive to Customer's Concerns”", "Author": "pooky_9", "ReviewID": "UR33781171", "Content": "Worst service ever!! Don't stay in the over priced hotel with the worst service I have ever encountered. They were responsible for the damage of some of my clothing items, no one even offered to replace, send me a card, nothing. I had to buy new.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Lancaster, PA", "Title": "“Great Airport Parking”", "Author": "kewldog4", "ReviewID": "UR32442903", "Content": "I was immediately drawn to this hotel by the 10-day (I think) parking for airport travelers (especially with the gated parking lot!). We stayed there the night before the flight. Got up at 4:30 AM to hit the airport for an early morning flight. The service at this hotel is unmatched. However. the rooms were somewhat noisy. You could hear neighboring room and outside noise in the courtyard. However, we didn't mind because we just wanted to get to the airport as stress-free as possible and this hotel provided that. I probably would not stay there again UNLESS I had another early morning flight.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Bethesda, Maryland", "Title": "“Neat little extras”", "Author": "Ijit1975", "ReviewID": "UR32324297", "Content": "I stayed just one night here, but it was certainly a pleasant stay. I loved the little extras that I normally don't get other places; the nightly pretzel, chocolates on the pillow, and the Philadelphia Mike's soda. The only reason I didn't get this hotel the full five stars is the room I was in was a bit dated (old CRT television and well-worn desk). No big deal because it was all clean. Overall, an enjoyable stay.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Lovely”", "Author": "txrus", "ReviewID": "UR32074652", "Content": "Stayed one night prior to starting a business trip. I'd stayed at another Renaissance property in Dallas in May so I pretty much knew what to expect &, for the most part, the property didn't disappoint. Beds are wonderfully comfy. I actually had a mini-fridge in my room, though it would have helped if someone had actually plugged it in. Bathroom was quite large & nicely decorated. Cable tv line-up was more extensive than one usually finds in a hotel. The hotel restaurant, which IS open every night for dinner (despite claims to the contrary by the front desk staff) was very nice, especially the tilapia which is part of their new 'T.A.R.P.S' menu-most definately recommend it!! The downside is that this hotel is literally out in the middle of nowhere. When my friend came to pick me up the next day, the front desk gave her a total of 4 different street address' for her to use in her GPS to pick me up, but the GPS system couldn't find any of them. Also, be warned, this hotel is the layover spot for at least 2 different airlines & the flight crews tend to take over the airport shuttles w/little regard to the rest of the passengers on-board (I had the misfortune of having to ride w/a crew from both Delta & Southwest & it wasn't pleasant).", "Date": "June 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Sacramento, CA", "Title": "“Beware-no hot water-poor A/C-aging hotel”", "Author": "Ariktravel", "ReviewID": "UR29301184", "Content": "I had clients booked at this hotel. Upon arrival last night, the clerk had no reservation. They called me and I referenced the confirmation numbers to the call center. The call center indicated the HOTEL cancelled the reservations on April 29. No reason for the cancellation was stated. One client complained of poor A/C in his room and they both had no hot water this morning. The hotel did give them 10,000 bonus points for the inconvenience. I have conducted several events in this hotel in the years past and never had problems. I must agree with other reviews that the hotel is aging.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“had a problem but it was handled well”", "Author": "TheSidingGuy", "ReviewID": "UR25966522", "Content": "There were issues with the food but they took care of. We had a convention there. Staff was very friendly and helpful.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia", "Title": "“Horrible!!!”", "Author": "Mistysthe1", "ReviewID": "UR24626051", "Content": "My husband and I checked it to hotel for Valentines weekend, We were very dissapointed at what we walked into. There were 2 teenage girls basketball team and 3 boys hockey teams staying the weekend aswell. There were kids running ramped all night through halls,screaming slambing doors, security had thier hands full chasing them all weekend! Had no piece and quiet all weekend. I have 2 teenage girls myself who would never act like that ever! They were pouring shampoo in the whirlpool and it was a bubbly mess. Indoor pool was a mess and was screaming all night till 10 pm. Did not sleep at all the whole weekend! Was very dissapointing!", "Date": "February 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lancaster, PA", "Title": "“Older hotel, but nice”", "Author": "bahoss", "ReviewID": "UR24010320", "Content": "The hotel is a little hard to find, we drove right by the road you needed to turn onto. The hotel is older and has been refurbished many times. The room was nicely decorated and we got a small bottle of sparkling wine at check in. We did have a problem with our toilet clogging and since it was 11:00PM there was no one there for maintenance so we had to change rooms. The next morning our shower had a VERY slow drain. The manager apologized and said they are in the process of working on bathrooms since the hotel is old.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Loved this hotel!”", "Author": "starrynites0514", "ReviewID": "UR19848600", "Content": "To keep this short and sweet. My husband and I stayed here from one night to fly out in the morning. We were pleasantly surprised when arriving. Staff was nice and check in was smooth. When we got to our room we were more than happy with the decor and especially the bed. It was VERY comfortable. The pool area is nice however we didnt use it. The bar was also cute. We had a drink to start off our vacation. I will say, it was hard to wake up in the morning due to the comfort of the bed. BUT it had to be done! I would most certainly return here. The service is great and the shuttle service is very convenient.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“Can't Beat The Service”", "Author": "grobma", "ReviewID": "UR19620527", "Content": "I stayed at this property because the conference I was speaking at was being held there, so it was not as if I had chosen it. Based on it's location, the only other reason to stay here is if you are flying in/out of PHL. Based on the service, however, I wish they were located wherever I travel frequently. The hotel is truly isolated in the middle of nowhere except near the airport. Upon arrival, the front desk staff were exceedingly friendly and helpful. Actually, they approached the level of \"sickly sweet\" without quite hitting that threshold. Kudos to them for outstanding service! When we wanted to take a cab to South Philly for dinner, they called a local cab company and were told that it would be a 20 minute wait. They suggested, instead, that we just hop on the airport shuttle that was leaving in a couple of minutes and just pick up a cab at the airport, thus also taking advantage of the airport flat fee into town. It was an excellent suggestion and we were in a cab within a few minutes. The rooms in this atrium style hotel were a decent size and nicely furnished - about what I would expect from a Renaissance. The concierge lounge was very well stocked and staffed as well.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lehigh Valley, PA", "Title": "“Relaxin' at the Ren'”", "Author": "jazzpants", "ReviewID": "UR18824617", "Content": "My new wife and I needed to stay at the hotel for one night because we had an early flight the next morning. We took the train down to the airport. We phoned for a shuttle and they picked us up in a reasonable amount of time. Upon arrival, we were greeted by some terrific people at the front desk. While checking in the gentleman asked what the occasion was. When I told him we were on our honeymoon, he upgraded our room. He was even kind enough to grant us access to the conseirge room. I was extremely pleased by all of this. They did give us a Polish water ice as well as soft pretzels in the room. The upgraded room did have a seperate room with a large table and chairs for perhaps a meeting, and the bedroom was large and included a small couch. Once settled, we took a small walk around the property and ventured into the bar. While the bar is nothing that special, it was clean had a flat screen tv. Most people in there were ordering burgers and other bar food as well as drinks. The fine dining restaurant was next door but we did not want to spend the money nor did we want to get dressed up for it. We did head up to the Conseirge room. Once you enter, you sign in. There is some tables, chairs, as well as a couch. There is a small staff keeping the fridge stocked with free soft drinks, water, snacks, and some small buffet items. By no means was this an all you can eat bar, but it did the trick. They had some warm finger foods and desserts. There was a wonderful woman who was in charge of the room and kept things running smoothly. She was very personable and plesant. She was very familiar with the \"regulars\" as she knew their names etc. I imagine that would make a traveller feel more at home. She promptly introduced her to us. What a great person. While there, you can drink wine and beer but it is billed to your room. No biggie. There is a TV to zone out to or you can look out the window and watch the planes lift off from PHL. We eventually returned to the room for the night. The bed was set up well and was comfortable. It was not the most comfortalble bed I was ever in but it was good. We left at 5am and checked out. Check out was smooth. We then took a shuttle to the airport. I WOULD STAY HERE AGAIN! People do make the difference and the Renaissance is doing a great job managing that and making it happen.", "Date": "August 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Cheaper alternative to downtown Philly lodging--FREE parking”", "Author": "luvtakintrips", "ReviewID": "UR18102779", "Content": "Stayed here for one night to go to a Phillies game and visit downtown Philly. We found this hotel to be more than $150 cheaper than downtown lodgings. The parking here is free, unlike the downtown hotels. The hotel is located south of the airport and is tricky to find. But we found the hotel to be clean, with a spacious comfortable 2-bed room. And it's a 10 minute drive to the ballpark and a 15 minute drive to downtown. For being considered an airport hotel, we didn't hear a sound. The hotel is nestled in a wetlands preservation area. Pros - Free parking, much cheaper rate than downtown hotels, only a 10-15 minute drive to ballparks/downtown Cons- Tricky to find at first, more remote location away from food/gas", "Date": "July 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Nice hotel, friendly staff”", "Author": "VaTravel1", "ReviewID": "UR17494230", "Content": "Booked the room well in advance, and got a great rate of $117 per night for 4 nights. Room was clean and comfortable, and the staff was some of the friendliest I've dealt with in a long time. From the front desk to the cab stand to the wait staff, everyone was extremely pleasant. Kids loved the pool. One drawback is that there are no restaurants within walking distance, so the airport shuttle or a cab are the only options. Fortunately, the hotel breakfast buffet ($14 per person) was open until 11am, so we used it as a combined breakfast/lunch. Be sure to have Otis make you an omelette or fresh waffles with real whipped cream. The food was so plentiful that we didn't need to eat again until dinner. Would recommend this hotel if you don't mind being a bit out of the way from center city attractions.", "Date": "July 3, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Maryland", "Title": "“Convenient option”", "Author": "travels-from-MD", "ReviewID": "UR17083171", "Content": "We stayed here after a long flight back from an overseas vacation. On the plus side: Extremely helpful and pleasant staff - some of the best I have encountered anywhere. Comfortable beds. Park/fly option is convenient. Great burgers in the lounge. Good breakfast in the concierge. Things that could be improved: Overall cleanliness of rooms, carpets, pool area, etc. (There was refurbishing work underway during our stay which should help.) Note if using the airport shuttle: When flying out, we found a regular shuttle service departing from the hotel - very efficient with clear departure times. I would suggest calling the hotel to specifically request a pick up from the airport terminal as soon as you return so that you don't wind up waiting nearly an hour (as we did) for the shuttle to take you back to the hotel.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Exeter, Rhode Island", "Title": "“Worst Renaissance hotel property!”", "Author": "EmilyC123", "ReviewID": "UR16856644", "Content": "I have just returned (June 9-11, 2008) from a two nite stay at this property and I vow not to return. I am a very frequent Marriott business traveller and I stay in Marriott properties almost exclusively. Apparently, the hotel air conditioning system is in need of upgrades. My room was so hot for 2 nites that I slept very poorly. The staff said that \"there was nothing\" that they could do. I ordered room service and my meal was lukewarm and my chicken looked like death warmed over. I used the concierge lounge for 2 mornings. The room was so hot you could barely stand it. The staff had provided a large stand up style fan which helped but not much. The coffee maker in the lounge was \"out of service\" and the coffee pot provided was empty. The desk clerk made me wait at check in while he checked in airline personnel that arrived after me ( I am a Marriott platinum member). This hotel is not worth it at any price.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warrington, Pennsylvania", "Title": "“Best Customer Service Ever!”", "Author": "dillybarPa", "ReviewID": "UR16848750", "Content": "Check-in was the best ever! Khalil Rembert greated us with a smile and gave us water ice to enjoy while he was waiting for housekeeping to finish getting our room ready. We even received an upgrade! Although the room was a bit worn the rooms by us were being updated. Khalil made our stay the best! Thanks Khalil!", "Date": "June 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Greenville, SC", "Title": "“Comfortable room, good service.”", "Author": "ArthurMF", "ReviewID": "UR16258718", "Content": "Took a chance on this hotel based upon the recent reviews. It was quite nice. The room (9th floor) was in excellent shape, quiet and very clean. Upon check-in, received a Hanks Gourmet root beear and hot cookie. And the concierge level. Went there, but they were closing and cleaning. Nice woman let me have anything I wanted from the snacks and non-alcohol (rest was locked away already). Breakfast the following morning was in concierge and acceptable. Cereals, cheese, fruit, toast. Hard boiled eggs. I swam in the pool and then sat in the hot tub before I needed to leave. $223 for the night. Which for Philly airport was reasonable. I would stay there again.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“Best experience in Philly hotels”", "Author": "sig225", "ReviewID": "UR15373464", "Content": "Been to Philadelphia a lot over the past two years and stayed in a variety of hotels... uniformly they have been over-priced and the hospitality and cleanliness have been substandard. The Renaissance has been a pleasant surprise... for the first time I wasn't greeted by surly staff.. they were so helpful, pleasant, polite and welcoming! While there is a small problem with the speed at which they clear dining materials from the hallways and the thoroughness with which they clean the rooms (I am particular) the hotel itself was great and they were quick to respond to needs. Oh... if you want to sleep past 8am do not accept a room overlooking the pool. Children tend to get up early and play \"Marco Polo\" in the pool and you'll be wakened as soon as the pool opens. Otherwise, having a poolside room gives you a nice balcony and a beautiful view of the wildlife preserve.", "Date": "April 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "upstate NY", "Title": "“A good deal through Priceline”", "Author": "knight_w_o_armor", "ReviewID": "UR15198472", "Content": "Stayed over two nights (4/18-4/20/08). Tried and got it on Priceline for $70/nt, after being unable to get a 4* hotel on PL in downtown Philly for less than twice that amount. (www.biddingfortravel.com has great tips and info for this). Upon asking, the front desk was very willing to upgrade us to Concierge level- but since the Concierge Club Lounge is not open on weekends (this hotel is hardly busy on the weekends apparently), they also gave us complimentary passes for a continential breakfast buffet (could upgrade to the full hot buffet for $3). Buffet was okay, not great but did have an omelette station. The room was recently renovated, but still had a slight air fresher scent (a concern I had given other recent reviews). Very nice bedding. Quiet room. Large bathroom with good shower and good toiletries (come on, you know you're gonna take 'em home). Room renovation was ongoing, so just make sure your room is one of the renovated ones and not close to any ongoing work. The pool area is very nice, decent exercise room and the staff was very accommodating. Parking is free- which is a significant deal. You can take the hotel's free shuttle to the airport and pick up the SEPTA train into downtown Philly for $6 (trip takes a half hour). Would stay here again if unable to get a good deal at a 4* in downtown.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Poconos, Pa", "Title": "“Smelly Room, Great Service”", "Author": "Motomom243", "ReviewID": "UR14646346", "Content": "We stayed for one night for the \"park and fly\" option and were excited to try a new hotel. Usually we stay at the Sheraton Suites and enjoy it there. We should not have changed. The positive is that our service there was really great. With that said, the room was very smelly, like mold and urine. Since we were only there for a quick nights sleep we didn't complain. The other complaint is that when we flew back in we waited for over an hour for the hotel shuttle, saw all the the other hotel shuttles multiple times, and then finally called the hotel, They said that we were supposed to call for pick up but that is not what we were told. We were told that the shuttel runs every 20 minutes so we were trying to be patient. They then told us it would be 10 minuted to get us and about 20 minutes later, they finally came (they are only 1 mile from the airport) and the driver said that you need to call them unless it is a busy time of day for travelers. Oaky, well we don't know when that is so get the story straight. I try to stay at Marriott brands whenever possible since I am a silver member but will not be coming back to this one.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "USA", "Title": "“Great hospitality!”", "Author": "vero_isa", "ReviewID": "UR13889276", "Content": "This hotel exceeded my expectations. The person at the front desk greeted us when we arrived and was very courteous and professional during the check-in process. They gave us 2 ice tea bottles and fresh pretzel as a welcoming snack. That was awesome!! Once at the room, it was totally clean and nicely decorated. There was a personalized letter in the desk welcoming us to the hotel. Also with the letter was a card with the weather forecast for the entire weekend. Iâ€™ve never received such attention when arriving to a hotel before!! Not even at the Ritz. The room was spacious and comfortable. The bathroom was also spacious and very clean. The bed was amazing. The linen was at least 400 threads and cotton, which make it a better night sleep for tired tourists. No noise from the highway at all. Very quiet ful for a light sleeper like me. The staff at the front desk was always courteous and helpful. One night we asked for directions to nearby movies and the person was extremely helpful with locations and other suggestions in the area. The location of the hotel is convenient for anyone needing a hotel near the airport or visiting the Philly area. The hotel is well located with easy access to I-95. It took us less than 15 minutes to drive to and from Philly downtown from the hotel. Overall, this Renaissance is much better to other hotels including its partners, Marriotts. Iâ€™m totally impressed and I would definitely stay at this hotel again when returning to the Philly area.", "Date": "February 27, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“A good ending to a not so good day.”", "Author": "jblairgolf", "ReviewID": "UR13584754", "Content": "After missing our flight in Philadelphia I tried frantically tcalled my wife and asked her to try and get us an airport hotel at PHL. She quickly got on PL and bid $95 for a 3* hotel, hoping I would get the airport Marriott (since their lowest rate was $269). Much to my dismay (only initially) they 'upgraded' me to a 4* which was the Renaissance, but I didn't want a 4*, I wanted a 3* due to their location. So much for thetheory of bidding higher to have a better chance at the3* hotel I wanted. Initially I was not happy because the hotel is clearly father away from the airport than the other 3*'s listed. To make a long story short, wechecked in and spoke with Patrick, a lovely man from Haiti that speaks 5 languages...quite impressive. He took very good care of us, and offered us an upgrade to the Concierge level. What a nice surprise, especially after the stress of missing our flight, changing our car rental, dealing with cancelling and changing guaranteed hotel rooms, etc. We are very discriminating travelers, and I was nervous (based on a few negative reviews) about how they we would react once at the hotel. Our service on the Concierge level was very good, check in easy and professional, rooms very clean and comfortable, and overall a very good ending to a not so good day. I would not hesitate one minute about staying with them again.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“One of the BEST airport hotels ANYWHERE!”", "Author": "elmarko", "ReviewID": "UR13227284", "Content": "Just returned from a one day stay at the Renaissance Philadelphia Airport. What can I say? This hotel was a total surprise. Great staff and attitudes at check-in, wonderfully, spacious, well-appointed room, large, immaculate bathroom, great shower, comfortable bed with choice of pillows, great workspace. I totally surprised! The staff in both the lounge (which serves full-course dinners as well) and cafe were superior. All were extraordinarily friendly and provided great service at very reasonable prices. Their workout room was perfect and not crowded. If you've got to stay over at Philadelphia Airport, this is the only place to stay. It's easily a 4 **** facility which is reflected in the attitude and service of the staff. This is a fine hotel in most every other city, but at this particular airport, I consider it a total find!", "Date": "February 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Your opinion is going to depend on how much you pay...”", "Author": "jpetralia", "ReviewID": "UR12830396", "Content": "I booked this hotel through priceline.com for $72 a night. I feel I got a pretty good deal. This hotel is not dirty. It is not unsafe. It is however in need of a renovation, and does not carry same quality that most upper level Marriott hotels carry. Bottom line: if you get a good deal on this place, you'll be pleased. If you pay full price, I guarantee you'll be disappointed.", "Date": "January 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lubbock, Texas", "Title": "“Great Hotel Near Philadelphia Airport”", "Author": "Lifeontheroad", "ReviewID": "UR8464130", "Content": "I had the opportunity to stay at the Renaissance Philadelphia Airport Hotel in early August 2007 on business. What a great stay! The room I had was on the 8th floor, and it had an exceptional view. The room itself was smartly appointed and decorated, spotless, and very warm and inviting. I also had the opportunity to have two meals in their onsite restaurant, which was very good. All interactions with the hotel staff was positive. The location is extremely convenient to the airport. I would recommend this property to anyone wanting/needing to stay in the Philadelphia airport vacinity, for business or pleasure.", "Date": "August 21, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Weymouth, Massachusetts", "Title": "“Not a bad hotel but a horrible location....”", "Author": "bceagle90", "ReviewID": "UR8429412", "Content": "Stayed here three nights for a business conference. Technically speaking it is close to Philadelphia International Airport but what they don't tell you is that it is located right next to one of the active runways. This basically means you will hear jets take off and land all day and all night. While they do offer a complimentary shuttle service to and from the airport you still have to go literally a couple of miles out of the way to get to the place. The hotel sits right in the middle of a swamp, or as they like to refer to a \"wildlife preserve\". If you don't have a car you are screwed as there is NOTHING within walking distance of the hotel. Unless you order pizza delivery your only dining options are the two in-house restaurants, one is actually more of a bar than a restaurant. If you want to travel to downtown Philly a cab is approximately $40 each way. Room was fine and staff was generally very friendly and helpful but this is definitely not the best place to go if you want a hotel with things to do within walking distance.", "Date": "August 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore", "Title": "“Nice Hotel at a good priice”", "Author": "BigBruno", "ReviewID": "UR8391514", "Content": "Booked on priceline for $65 for a Friday night. Front desk staff was very friendly and they gave me a very nice room. Bed, sheets, and pillows were soft and wonderful. Room is older style but still elegant. I parked my car at the hotel and took the shuttle to and from the airport. Parking is $50 for a week. Nice way to go it you have an early flight out of Philly. If I could get that kind of price again, I'd stay there in a heartbeat. If your a smoker, this is a non-smoking hotel. You can't even smoke in the bar so be prepared to go outside. I wasn't there long but the hotel certainly served its purpose at a good price.", "Date": "August 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dearborn, Michigan", "Title": "“Good Week-end Value, But Beginning to Need Freshening”", "Author": "tylerarb", "ReviewID": "UR8357648", "Content": "Stayed here one night (August 4) because of a family emergency. Got the senior rate of $110 which is a decent but not outstanding value. We had stayed at this property on 5 or 6 previous occasions, always on week-ends and have generally been satisfied with it. The room--on the 9th floor-was clean, fresh-smelling and what we wanted. There was a view of the air conditioning equipment on a lower, flat room, but we weren't there for the view and only used the hotel to sleep. Check-in was smooth, quick and courteous. We arrived shortly after noon and the front desk made a special effort to have a room serviced so that we wouldn't have to return late at night and check-in again. All of the staff we met were friendly and helpful. Parking was OK and free (my favorite price) but although the lot is large, it always seems to be fairly full and finding a space requires a careful search. Both the room and some of the public areas of the hotel are beginning to show wear. It isn't a serious issue for the most part, but does require attention. One family member spent Aug 3 and 4 at this property and always has liked it. She also mentioned that her room was not up to the standard of previous stays. Our room had what looked like a spilled red wine stain on the bathroom wallpaper. [It was between the toilet and the tub, low on the wall and not immediately noticeable.] The foot stool fabric was completely torn or worn through on one corner, showing the padding. The entry to the hotel needs a good power washing, sealing and regrouting in some areas. A careful inspection of the hotel likely will turn up dozens if not hundreds of places that need maintenance attention soon. This property still is above average for the Philadelphia Airport Hotel properties we have used: Sheraton Suites, Embassy Suites, and Residence Inn, though some of those mentioned obviously offer more space and comparisons aren't completely fair. We would stay there again and, despite the comments above, were happy with the place and the rate. If I stayed during the week and paid twice as much, I would be far less satsified. The Renaissance is not easy to find for first-time guests using rental cars and not immediately convenient to much of anything else, other than the airport. It is, however, only about a 10-15 minute drive or cab ride from Center City Philadelphia.", "Date": "August 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cleveland", "Title": "“Great Service”", "Author": "NeuroAngiodoc", "ReviewID": "UR8282847", "Content": "No complaints, was treated extremely well at every step. A lot of freebies in the room, and was upgraded to Conscierre Floor which was awesome. Food in bar/restaurant was excellent and I highly recommend if you need a 1-2 nighter near the airport. BTW about 5 minutes from Harrah's Casino, the closest hotel to the casino and racetrack!!!!!!!!", "Date": "August 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Excellent!”", "Author": "maureenfh", "ReviewID": "UR8138216", "Content": "We picked this hotel based on reviews here, and I was not disappointed. Our room was neat and clean, the price was comparable to others in the area, the staff was friendly and helpful, and the location was great. We had a great time. Upon checking in, I asked about coupons for breakfast, and the person at the desk gave me a pass for 2 free breakfast buffets. Definitely make sure you do this, because the breakfast is fine, but not really worth the $12 per person they charge. They also seem to have a regular menu to choose from, but we just had the buffet. After our room was cleaned the first night, we found ourselves with only one clean bath towel. I called down for more towels and they arrived very quickly (within 10 minutes) and the desk staff person called a few minutes later to make sure we had gotten them. We were in town for a wedding west of Philly, and this was close to the interstate, so very convenient for getting to where we wanted to go. We also went into downtown Philly for the afternoon and it took only 20 minutes. My only complaint was the difficulty we had finding the hotel. Another reviewer here mentioned this, and I should have taken it more seriously! The directions on the website are USELESS, so don't take them. Even the Google maps directions were vague unless you are familiar with the area, so maybe call the hotel and get someone to give you specific directions? Once you actually get there, there is no sign at the entrance to tell you where to turn, so we found ourselves elated at finally finding it, only to despair as we drove past it again, realizing we would have to go back to the main road to turn around and start again. A little frustrating after a long flight. One more tiny complaint: my husband had to run back to the airport for a lost item and took the hotel shuttle, which was fine, but he waited a long time for it to come pick him up later. If you are relying on the shuttle, be sure to call and tell them when you'll be arriving, and give them plenty of time.", "Date": "July 17, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Western Iowa", "Title": "“One Night Stay”", "Author": "KitinIowa", "ReviewID": "UR8079237", "Content": "This hotel is very convenient to the airport in Philly. I used it for one night before an early flight out the next morning. They upgraded me to the club floor upon asking without additional cost since I was a Silver Rewards member I assume. The club attendant was very nice and interested in you. The pool is adequate, but the whirlpool had cool water in it, they did come in and adjust the water temp while I was using it and I think it was warming up but didn't stay in long enough to find out how warm. The hotel needs attention and a remodel, but otherwise I found it to be a nice place to stay. Over the long term I would choose somewhere else, but for a night it was fine.", "Date": "July 8, 2007"}], "HotelInfo": {"Name": "Renaissance Philadelphia Airport", "HotelURL": "/ShowUserReviews-g60795-d96721-Reviews-Renaissance_Philadelphia_Airport-Philadelphia_Pennsylvania.html", "Price": "$130 - $221*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">500 Stevens Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Philadelphia</span>, <span property=\"v:region\">PA</span> <span property=\"v:postal-code\">19113</span></span> </span> </span> </address>", "HotelID": "96721", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/71/e7/71e7301dcaacc36216a537f77acca2886large.jpg"}}