{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Midland, Michigan", "Title": "“Very Inconsistent Service”", "Author": "FLJ021251", "ReviewID": "UR124386335", "Content": "This is the second tme I have stayed at this hotel property. I have found on both occassions the staff to be friendly and helpful with suggestions for dinning and such. However, the management evidently is signifiantly lacking. After checking into the hotel I found the room to be very poorly cleaned. The tolet was dirty, coat hangers still haning on doors and just overall below the Marriott brand quality. I know some people compain of the section of the city the hotel is located. There are many unsavory businesses and possible inappropriate activity. However, I have found if you stay to yourself and don't go out unless you are driving or taking a taxie it is not too dangerous. The sleep qualaity of the hotel was poor, with an obviously worn mattress and form pillows. Two pillows was just too much to sleep on, but one was not enough-very uncomfortable. The rooms seems to be quiet and there is a pool and exercise room. I wanted to print my boardig pass in the bussiness center, but the computers were excessively slow. This hotel is supposed to provide a free breakfast for guest and the sign is up clearly stating that breakfast starts at 6:00 AM. However, when I went down at 7:00 AM, they were still not open. Several guest came expressed frustration, beacuse they had to leave to get to the airport, and breakfast was still not available. A man came out fromt he kitchen and announced that they were running late and he was not sure when breakfast would be available. The did finally put out some cold foods and milk. The sad part is that there are few options for hotels in this area. I think all of the hotel in this area are more of the lower brands so the selection is somewhat limited. Memphis is not really that big of a city and I think next time I am here I will just stay in one of the hotels further away.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Venice, Florida", "Title": "“dirty”", "Author": "Susan D", "ReviewID": "UR123808903", "Content": "I flew into memphis on business for the 1st time, thinking the courtyard was a good choice for the 1st night. Wrong! Staff was fine, hotel dirty, on the elevator where the help phone is had no door and 2 inches of dust, no hair dryer in room, dirty bath mat, I was wondering when the bugs would come. Large security gate around parking lot,( you need to give name/room before parking into the area for your room, (this is to make you feel safe?) In then worst part of Memphis as I found out later after visiting my accounts. The Marriott chain should be ashamed to have this dirty hotel in need of many upgrades other than the staff.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Summit, New Jersey", "Title": "“par for the course”", "Author": "tewey", "ReviewID": "UR121827629", "Content": "Stayed here for a night on business. A classic airport hotel. Everything was clean, tidy, as expected. Would stay here again.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“Perfect location for early a.m. Flight”", "Author": "60one", "ReviewID": "UR121716548", "Content": "I was on a marathon business trip and needed one night in Memphis. I grabbed a fresh sandwich and snacks in the lobby? Settled in for a nice quiet evening. Josh was great at the front desk.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“The Bistro hasn't arrived here buts it's a good property”", "Author": "Supermagictasticguy", "ReviewID": "UR120401968", "Content": "For the second year in a row this property fit the bill of a cheap hotel near the local Enterprise rental location and the airport. The two-level Courtyard is vintage original design. Both times the room assigned was Courtyard view. This probably helps with noise reduction, the back of property rooms face a busy highway. No Starbucks as the lobby is very old-school Courtyard, not updated like many others have across the country. TV's are flat screen, very large sized and have some HD channels (ESPN included). Staff was friendly and helpful throughout. Shuttle driver was also very courteous and conversational for 6 a.m. The rooms are comfortable and have a temperature adjusting thermostat on the wall. The location is very off-the-beaten path and no restaurants are nearby, save for the Subway across the street.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Average Courtyard, close to airport and Medtronic”", "Author": "jennibeans", "ReviewID": "UR119013634", "Content": "Location: I was traveling for Medtronic an able to walk next door for my meetings, literally next door. The airport is about 5-10 minutes away, but the rental car location is even closer. No restaurants nearby - just a Subway. The hotel is in a business park, nothing glamorous at all. Room: My room had a parking lot view and was a little smaller than most Courtyards. Very nice bed and TV. Mini fridge, coffee, and full plug-in hairdryer (nice). There was a couch and table and a work desk. I got a strong WI-fi signal and that was free. I was in 159 and got the Medtronic rate - I mention this because I actually had to prove that I was there for them. It saved me $45 per night. Bathroom: strong shower, separate room from sink. Again a little small it fine for one person. All very clean. Gym: let's call it a room with a treadmill, elliptical, a bench and tweets of dumbbells (15 & 20). Whirpool is inside next to gym - windows to gym & business area. Pool is outside and pretty nice - closes at 11pm. Business area had about 5 computers and was open in the lobby. Breakfast: good buffet, several hot and cold voices, eggs, sausage and gravy, waffles, cereal, fruit, etc. Service there was awesome - they GET business travel and were super quick. I'd recommend for Medtronic, may look elsewhere for airport, definitely go downtown otherwise if I return.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Northern California", "Title": "“No frills airport hotel”", "Author": "NativeCalif", "ReviewID": "UR117027222", "Content": "Basic hotel, a bit dated. No coffee or tea other than 5am -12pm in lobby. Breakfast start 7am so not good for early flights. Shuttle pickup at rental cars is good, as is to airport. Small, dated bathroom but all is adequate. If you don't have a car, forget redtaurants as there is nothing commercial close.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "West Virginia", "Title": "“Good Location, But Noisy”", "Author": "HappyTraveler43", "ReviewID": "UR116969526", "Content": "Had to spend a couple of nights in a hotel near mid-town Memphis, and this hotel fit the bill in terms of location and price. The hotel is located in an office park comlpex near the Memphis airport. Not a whole lot nearby in terms of retaurants, etc, so if you stay here you will need a car. Pretty muchyour standard courtyard hotel--our room had 2 queen beds (reasonably comfortable), a large flat screen tv, the standard desk, and lounge chair. The bathroom was basically clean, but there were a few small places where mildew had built up. I stepped into the shower the night we checked in, and had a lot of problems controlling the water temperature and pressure---something was wrong, and really struggled with the shower know to turn off the water. Called the front desk and asked them to send someone up to take a look--they said it would have to wait til tomorow, but asked if I wanted a new room; I stayed where I was give the late hour, and the next day when I returned in the afternoon, they had fixed hte shower--so pretty decent service---no complaints how it was handled. Upin checking in, the front desk staff was ok---professional but hardly friendly. Biggest complint was the noise--lots of noise coming frm the A/C--maybe the loudest I have heard in a hotel. In addition, there are constant flights taking off and landing at MEM (FedEX I guess) all through the night---you can most definitely heare the planes as they arrive and depart. Does not make for a soothing nights sleep. I also used the hotel's exercise facilties twice--very limited in terms of equipment--two bikes, one treadmill, and some free weights. TV in the room gets lousy reception too. Overal all, and adequate stay, but would likely look for another place next time I am in Memphis.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Cumming, GA", "Title": "“Terrible”", "Author": "RoadWarrior0219", "ReviewID": "UR114649614", "Content": "I was scared to stay here, based on the reviews, and sadly, they are right. I didn't have much choice . The woman at the front desk was the rudest person I have ever experienced in the hospitality industry. I was shocked. Room was not very clean. The only place to eat is a Subway...honestly. And the hotel is behind a very tall iron gate, that is both comforting, I guess, and disconcerting, as well. I didn't sleep well and left very early. Never again.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Huntsville, Alabama", "Title": "“Very disappointing”", "Author": "whizgeri", "ReviewID": "UR99803915", "Content": "I stayed here with my two daughters as part of a dance group competing in Memphis. The staff was very surly - almost ugly at times. The pull out bed had food on the mattress. There were many maintenance issues in our group - missing refrigerator, broken toilet, The breakfast was good but the hostess was hostile and not helpful. The hotel is in a bad neighborhood not near restaurants or activities. Airplanes flying oeverhead all night. We travel frequently and usually stay at Marriotts. This was definitely not up to standard. Could have tolerated alot but the attitude of the staff was that they were doing us a favor by letting us stay there.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Atrocious”", "Author": "agbarksdale", "ReviewID": "UR95327003", "Content": "I honestly would not suggest to anyone to stay at this hotel. The location is descrete and in the middle of a business park, and one subway directly across the way from it. My experience here was not very good. I had to wait 30 mins to an hour for the airport shuttle, while I saw other hotels come and go constantly picking up guests from the airport. Once I made it to the hotel the front desk clerk was no where to be found, it was night time so I was very tired and anxious to get to my room. The next day I found that the breakfast they serve was out of date and highly overpriced. The up side to it was the young lady who was my server was very nice and gave me other options to go with. Most of the front desk clerks I dealt with were very rude and heartless, especially the young lady who wore the wig, which I thought was so tacky! The housekeepers were very nice and kind and the night driver was very nice and helpful with my bags. Will I believe his name was. Overall I would rate this hotel a 5.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Tampa, Florida", "Title": "“Just okay”", "Author": "57Lulu", "ReviewID": "UR94537711", "Content": "I stayed here at the tail end of a business trip because I had an early flight out the next morning. The positives: The shuttle will pick you up at the rental car return so you can avoid the car shuttle to the aiport. Front desk staff were very helpful with my questions. The not so positives: Even though I requested a room away from road traffic, my sleep was disturbed by highway traffic all night as I was on a side of the building. Be prepared. The shuttle only runs on the half hour. If you call at 8:05, the driver will pick you up on his next run---when he leaves the hotel at 8:30. It is a 10 minute ride. The location was literally in a business park with no restaurants or amenities around the area. You are paying for the room, that's it. No coffeee available until 5am in the lobby. This hotel served my purpose but I will stay somewhere else next time.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Good and decent”", "Author": "orp", "ReviewID": "UR92874916", "Content": "Stayed here for two nights during Elvis week; yes the hotel is not \"the new line of Courtyards\" with all the bells and whistles, but it is clean, comfortable and all the staff we interacted with was freindly and welcomming. Location is OK we did not experience any noise, eventhough the airport is nearby and there is heavy traffic on the freeway next to the hotel, the area is mainly offices, but there is a Subway across the street. The layaout in the \"original courtyard style\" is actually very nice, you park around the edge of the hotel close to you room and in the middle you have the very nice pool are. Only downside we encountered was that there seemed to be a mismatch between prive / value of the breakfast - as in, too expensive - when compared to what you get \"for free\" at e.g. Fairfield, Towne Palce and Residence Inn.", "Date": "January 14, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "texas", "Title": "“Not Good!”", "Author": "TexasKatdaddy", "ReviewID": "UR87586121", "Content": "My son and I stayed here after Delta airlines delayed our original flight and we were stuck in Memphis. Delta put us up in this hotel. We waited approximately 40 minutes for the hotel van to pick us up which was about 10 minutes away from the hotel. They brought one van to pick up more than 15 people who needed the shuttle leaving a lot of us waiting for the van to return. In the time we sat there we saw Holiday Inn come and go 5 times along with other name brand chains. There was no excuse given as to why they didn't bring the other van over to pick us up. When we arrived they would not take the airport voucher for food saying we could order from a restaurant in town that would deliver however it was after 10pm and waiting an hour for our food didn't seem a good idea. They have food next to the front desk called the Market but couldn't seem to part with it for the voucher. We were given a room on the second floor which although not right next to the highway it sounded as if it were on the highway. One of the noisiest rooms I have ever been in. The room was very small, a king bed, a flat screen tv. The toilet did not work, meaning not water in the toilet or tank and no flushing. A nice young man came up and got it to fill again but after one flush it never worked again. There is a breakfast buffet but it is not included with the room. Overall, I would never stay here again.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "California", "Title": "“Agree with other reviews- one of the weaker Courtyards”", "Author": "lucyandethel", "ReviewID": "UR83541066", "Content": "As a Marriott Platinum, I stay in a lot of Marriotts. The ONLY thing this one has going for it is that it is near the airport. We rented two rooms and neither was very clean, and the doors in the bathrooms had lots of dark fingerprints etc on them. The rooms smelled like they needed a good airing out, and the staff was efficient but not overly friendly. It IS near Graceland (5 min drive) and the Graceland ticket package is a very good deal, where you book a room and get 2 free tickets... the added cost of the package is still a 50% discount on individual Graceland tickets. Only stay here if you have an early morning flight.", "Date": "October 14, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Do not select this place to stay.”", "Author": "BJM53", "ReviewID": "UR77241263", "Content": "Generally, you can trust a place like the Courtyard Marriott to have everything you would want. Not the case, with this particular place. We stayed there one night in July. It was billed as being close to Graceland which we wanted to see. what we didn't know is that it is in a bad area of town, even though it is close to the airport. The first indication was that the parking area outside is surrounded by a high metal fence which you can only access with your room key. The next indication was that the sliding glass doors on the first floor rooms were permanently shut and the worst thing was that although there were other hotels on that street there were NO Placees to eat. There weren't even any fast food restaurants. Be sure to avoid this hotel.", "Date": "August 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Jose, California", "Title": "“A hit or miss depending on the room and who's working the front desk”", "Author": "krystyles", "ReviewID": "UR70707233", "Content": "I stayed here July 1st-6th for a family reunion that was going on. I love all brands of marriotts' because of their cleanliness and awesome customer service. Although this particular location wasn't on par with the rest of the other properties I've stayed at. I've been here one other time before and got a room on the interior side that faces the courtyard/pool area. That time was actually pleasant and I didn't have any noise complaints as some people have mentioned. This last time I stayed, we got a room facing the freeway which was somewhat a pain cause at night you could hear the crickets and traffic NON STOP unless the AC was on which drowned out the sound. Once in a while I'd hear the planes fly over too but it wasn't something that made the stay unbearable. On the 2nd day or so, I was going to put some water in the mini fridge when I noticed something on the floor and next thing you know, it was a dead cricket right in front of the fridge. I then proceeded to try and call the front desk but for some reason, both phones in our room weren't working for like 10-15 min. I was already upset that I found a dead bug and I didnt even want to try and look around the room to discover more surprises. Eventually the phones worked and I asked the front desk if they could have someone from housekeeping come vacuum around the room but since it was early evening, the housekeeping staff already left for the day which is understandable but she didn't even bother to say that she'd have someone come and take care of it. Her excuse as to why that dead cricket was there was \" I'm sorry mam, but it probably flew in when you opened the door\". First of all, I didn't even open the sliding door to go outside and how could it just fly in when the room entrance is inside the hotel? She eventually sent someone 10 minutes later after speaking to her but just the way she handled it was unacceptable, especially for marriotts' standard. Those are my main complaints. The rest of the staff were great except for her. I wish I got her name, but owell. Overall this courtyard is ok. You're not always going to get the exact room you request but if you do stay here, try to request a room facing the courtyard.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Not up to Marriott Standard”", "Author": "tomnel", "ReviewID": "UR70529133", "Content": "Stayed for four nights in June 2010-Internet did not work most of time, when it did it was very slow. Only wireless was in lobby and also very slow. Dishes dirty at breakfast. Food stuck on cutlery,greasy dishes, stained coffee cups. Attendants attitude was' Looks clean to me\"! Terrible location, no restaurants in area and I was warned not to walk outside in the evening. I am a platinum member and obviously stay in a lot of Marriotts- This is the worst Marriott property I have ever been to. Never Again.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“Great for it's purpose”", "Author": "nancyalcalde", "ReviewID": "UR69324383", "Content": "Visiting Memphis for the weekend and needed a decent place to stay. I found this hotel to be nice, clean and safe. Although located on a business district street, it's not as bad and I felt safe in my surroundings. The front desk has cameras located in several areas outside and you need to get buzzed in to park inside the gate. The bed was comfortable, good ac, and soft good smelling towels. The hotel is minutes from downtown and all other shops and restuarants are no more than 10 minutes away. For the price and convinience, I had a pleasent stay. I would reccommend it.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "O'Fallon, Missouri", "Title": "“DO NOT STAY HERE Poor Customer Service”", "Author": "Zebrina13", "ReviewID": "UR69113007", "Content": "My first night here after my children was put to bed i decided to go for a swin and 3 min after getting in the water the staff came and closed to pool (said it was for safety resaons) got back to the room and noticed the toilet was running. I tought maybe it was just filling up but no it ran all night long, got up the next morning and noticed the carpet was hanging off the walls. I went to the manger and she said she would fix it however after return back to the hotel after a long day with four children the carpet was the still hanging off the wall. I called front deck and they sent a guy to rip the carpet off the wall and when he was unable to do it he just walked out. Later that day, I went to get in the pool again around 6pm and they said they were closing the pool for cleaning. We had they worst time ever my husband, my children and myself had a horrible experience. When I talked to Management at check out, she said that I was paying for a bed and they provided that.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Underwhelming but functional close to airport”", "Author": "erk42", "ReviewID": "UR59103015", "Content": "I was looking for a hotel relatively close to downtown via priceline as a stopover on a cross country trip. This hotel was an excellent value, was comfortable, but underwhelmed in general. I would have been disappointed if I was purchasing based on brand, or if I paid more. Really remote location with nothing around except some office buildings. But then again, I knew that when I booked it. The parking is gated and someone was calling the police to the hotel as I was checking in (which concerned me when I checked in) but my stay was uneventful.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Boston, MA", "Title": "“Good for One Night”", "Author": "BlackJM", "ReviewID": "UR57662313", "Content": "We were staying over in Memphis before our flight out the next morning to PR. We got a cheap stay through Priceline. The rooms were pretty clean, and nice enough. Nothing fancy, but nothing horrible. The staff was very nice and attentive. The airport shuttle was timely, and at the front desk they set us up with a pink cadillac limo ride to Marlowe's for BBQ! You aren't near down town, but if you just need a stopover place, this one works.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Nevada", "Title": "“Great staff but hotel need updateing”", "Author": "bandogal", "ReviewID": "UR51105601", "Content": "Delightful staff both front desk and shuttle drivers. The room was in need of updateing, mattress worn, shower curtain stained . Desk chair and arm chair dirty. No luggage rack, only one waste basket, 9 in bathroom none by desk) Breakfast buffet served only grapefruit sections, no apples or bannas , selection of creamers or different sweetners even though they were avaible at the coffee station near the front desk. Parking wassecure and great location near the rental car side of the airport.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "ark", "Title": "“great stay, clean, quiet, friendly service”", "Author": "ArkSunlover", "ReviewID": "UR49857623", "Content": "stayed one night before a flight, the hotel was clean ,super quiet, comfortable beds, and reasonable. We needed a ride to the airport the next morning at 4:30 a.m. the shuttle was there waiting with a friendly driver. We left the car for a week, when we came back shuttle from hotel came and picked us up and took us back to the hotel straight to our car which was kept in a gated parking lot. Airport is only a few miles away. Only downfall is that there is nothing close by except industrial. Have to drive for shops, food, etc. We would absolutely stay here again", "Date": "November 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "1", "Rooms": "4"}, "AuthorLocation": "Tacoma, Washington", "Title": "“Nice hotel, bad location”", "Author": "keatt", "ReviewID": "UR48456521", "Content": "We stayed for 2 nights, got a great price on Priceline. Room was clean and comfortable. Parking was in a secured fence area. All employees were very nice. Location is very bad. Wanted to stay close to Graceland, did not realize it was a bad area, arrived at night. Could not find a decent place to eat or get a drink anywhere near the hotel. Would probably not stay there again due to the location.", "Date": "November 3, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Location": "4"}, "AuthorLocation": "florida", "Title": "“The service outweighed the room”", "Author": "dosen", "ReviewID": "UR47921837", "Content": "i would say the room was OK. Other Marriots have the down beds, this did not. Old TV (nothing fancy) but it was clean. I had a major problem develop and I cant say enough about the front desk girl. She couldn't of been nicer and more helpful. That made up for the room. Also, the van driver was so nice, that really meant alot. Thanks guys", "Date": "October 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Ohio", "Title": "“I would never stay here again!”", "Author": "clastory", "ReviewID": "UR47397592", "Content": "Lousy location! Any close-in restaurant is in the slums. I had to drive down the freeway to Mississippi to find a halfway decent place to eat. The desk was clueless about \"fine dining.\" Very skimpy amenities. I had to call the desk for a tiny bottle of lotion. The tv is a big bulky thing that at least swivels. There is no easy access elevator to the second floor. There is a tiny single-serve coffee maker in the room with one only reg coffee and one only decaf....no tea or anything. For this type of lodging one would expect a free breakfast buffet. There is nothing here to make a customer feel welcome or satisfied.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Hotel is great!!! I don't know what others are talking about!”", "Author": "chrisncraz", "ReviewID": "UR39016683", "Content": "I stayed here for one night because I had a last minute business trip to Memphis. I actually booked the hotel at MEM airport 20 minutes before arriving on priceline.com for about $46 plus taxes/fees. Anyway, the hotel shuttle picked me up and the driver was very polite and explained how to get back to the airport in the morning via the complimentary shuttle. Memphis can be a somewhat shady area but this hotel was safely located in a professional office park. Check-in was quick and easy. The front desk woman was very professional. Although I do agree with others that the elevator location is bit bizzare. If you'd imagine the furthest point from the front desk... that's where it is. Odd.. but whatever. The rooms were very nice. The decorating in the room was very warm and inviting with nice woods/colors. The beds were very comfortable with nice linens... probably the same used with other Mariott properties. King Rooms had nice pull out couch. The bathroom was extremely clean with a sink outside the bath/toilet area. There was a nice desk for my laptop. One bad thing is there isn't wireless internet outside lobby... but it is free in-room via ethernet cord. Slept well, checked out the next morning, and then back to the airport via timely shuttle. Free coffee in the lobby in the AM as well as free computer use in lobby. Overall great staff, great room, great shuttle, great property, great price. I highly recommend. The pool didn't look half bad either!", "Date": "August 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Clearwater, Florida", "Title": "“NEVER - EVER - AGAIN”", "Author": "yankee-peddler", "ReviewID": "UR33896118", "Content": "Checked in July 2 about 11:30PM. Key card machine broke. Had to have security let me in my room. I waited out side locked entrance for 15 minute. Parking is behind a locked gate but someone tailed me in. I DID NOT FEEL SAFE. No complimentary breakfast. This property is a Motel-6 with a fresh coat of paint. This is not Marriott Courtyard quality. I did speak to the General Manager- Leslie (I think). He reponse to my concern/trouble was \"Things Happen\". What happens is I will not stay here again. I was very disatisfied. Of Note: I am not hard on ratings. Check my record, but this place is worthy of this review.", "Date": "July 4, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Relatively convenient but nothing else”", "Author": "EfficientTraveler", "ReviewID": "UR32932958", "Content": "closest big-name chain hotel near airport, but in the middle of no where. No restaurant. No bar. Was clean and comfortable, but I\"ve stayed in much nicer Courtyards with more services. Luckily, internet was free.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Message to Marriott: Bulldoze this Place!”", "Author": "eustexas", "ReviewID": "UR32075443", "Content": "OK I've been platinum with Marriott and Diamond with Hilton for 5-6 years now, so this is not just a random drive by review: I cannot believe this is a Marriott property. Key gate access still doesn't work? After SIX MONTHS??? (see other reviews) that is Inexcusable. Please fire whoever is in charge of maintenance. Now. But wait, there's more! Maybe it's a Memphis derelict attitude thing... But is there anything that works, well, in this city? Beds were failrly comfy, but softer than most Marriotts (maybe they bypassed this property in their nationwide renovations?) Towels were - as one previous reviewer noted - made of something, but not cotton. Paper towels? Sandpaper? Rice wafer thin and - not Marriott quality (recurring theme, here) Nice neighborhood if you are looking for a broad selection of truck stops, strip joints, and tatoo parlors. Sure wish I knew that before I made the reservation online. But then again, I trust MArriott 98% of the time. Here's to the 2-per center.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "bsbruce", "Title": "“Typical Courtyard with Motel 6 Towels”", "Author": "bsbruce", "ReviewID": "UR30273418", "Content": "In the past I've stayed at the Radisson but could never sleep because of the airplane noise. I never really heard any planes at the Courtyard. In fact, I had an inner courtyard room and there was no noise at all. I don't understand why there isn't an elevator convenient to the lobby. You need to go to the far corner of the hotel or use the stairs (with heavy luggage). The shuttle driver was great and I was picked up at the car rental within 5 minutes of my call. My only real complaint would be that the towels were obviously left over from whatever this hotel was before it was renovated and became a courtyard.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Great Hotel!”", "Author": "pnmbn", "ReviewID": "UR23266623", "Content": "We chose this hotel after reading others' reviews here. The proximity was close to Graceland (the reason for our visit). The hotel is located in an industrial area. Gated parking was an added plus. We felt secure here. We used the pink limo service to go to dinner at Marlowe's, which was very nice. The only negative I would give is that the desk staff upon checking in was not particularly friendly. THe night staff was great, however. Our son got sick in the middle of the night and vomitted on the floor and they promptly moved us to a new room.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Tampa", "Title": "“Decent Hotel”", "Author": "monte94", "ReviewID": "UR22788760", "Content": "I stayed at the Courtyard Memphis Airport on Dec 12th for one night -- and was pleased with my accomodations. The hotel is located about 10 minutes from downtown Memphis, in a business park, just off of the interstate. Some noise from the interstate, as well as the airport, could be heard but it was minimal --- and in no way affected my sleep. (The A/C unit helped to drown out the outside noises). My room was clean and located on the 2nd floor. It had an alarm clock, a bulky TV (not a flat screen), an iron & ironing board, a coffee maker, a mini-frig, a hair dryer, in-room internet access, and a super comfortable bed. The hotel also had a small gym, a pool, and a whirlpool. Although the hotel had a bit of an isolated feel to it, it did have gated/secure parking which made it feel relatively safe. Unfortunately, the rooms do not have safes in them. If I were to pass through the area again in the future, I would be open to staying here again, although it would not be my first choice --- I'd rather stay a little closer to downtown Memphis, where there are more things to do and a lot more dining options.", "Date": "December 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "2.0", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Edmonton, Canada", "Title": "“A Few Problems......”", "Author": "a78jumper", "ReviewID": "UR20613023", "Content": "Everything everyone else states here effectively describes this hotel...however the following really were disappointing about this property. First off arrived at 1345 hrs on a Thurs aft after flying all night , and was told to come back later as housekeeping was in a conference. For an airport hotel, inexcuseable, I suspect there had to be at least one room made up and ready in the place given housekeeping had to have been at work since early morning. If they are not cleaning the vacated rooms first they need to start doing so. Second, I had arranged to have two deliveries made just prior to my arrival, and alerted the hotel to this fact. They found one box right away, but could not find the the other, which FED EX had delivered the day before. This went on for two days until someone finally looked in another spot and found it. Third, my room was on the back of the building and the interstate one parking lot away was a little noisy, though it did quiet down somewhat at night. Get a room facing the interior court if possible. On the afternoon of the third of three night day, my key card no longer worked so I went down to the front desk to inquire what was wrong. They rebooted it, and confirmed that I was not checking out until Sun am. At 0330 hrs Sun morning someone else checked into my room while I was asleep on top of the bed( I do not wear PJs). I do not know who was more upset, me or the poor lady who walked in on me. Women travelling alone would not be impressed if a strange man walked into their room, and I as a male feel exactly the same way about nocturnal strangers of either sex entering my room unexpectedly. I suppose I should have double locked the door, and will in the future, but obviously some incompetant had punched into their computer that the room was unoccupied and thus available for the night. It took me until 0600 to get back to sleep as I was somewhat stressed. In Marriott's defence, I did complain on line right away and they credited the whole night's stay and apologized profusely, however this and the above would be cause to consider something else next time.", "Date": "October 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Antonio", "Title": "“A high quality Courtyard”", "Author": "DigitalDrifter", "ReviewID": "UR17351760", "Content": "Well maintained and very friendly desk staff. Interesting feature is the parking lot is gated for security. Property is clean and nice. As Courtyards go this one is above average. For those Elvis fans it's 2 miles from Graceland. About 10 miles from Beale St.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“Friendly staff”", "Author": "etapngav", "ReviewID": "UR16799111", "Content": "We went to Memphis and decided to stay at the Courtyard Marriott near the airport, it was a great decision. We enjoyed our stay in Memphis but the hotel staff was outstanding. The rooms were average but it made up with the staff. We were treated very nicely and everyone always had a smile on their face. We enjoyed the included breakfast buffet as it made it easy to eat and start our daily routine. We were also able to get a late check out without any problems. We would definitely stay there again. Thank you Felicia for having a smile and making our morning breakfast a very pleasant one.", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Fabulous Breakfast”", "Author": "Local-Beer", "ReviewID": "UR16247983", "Content": "After traveling the \"Tamale Road\" it was quite a pleasure to find this Marriott tucked away in the woods near the airport. It was a quiet location with a great staff. A little busy at the front desk, but Natisha was very courtious and professional,. The property was very well kept and accessable. The best came in the morning, that was the breakfast buffet of eggs, bacon, biscuts, juice and great HOT coffee. I must make special metion of this staff, Tallulah Mosley and Felica Frelos provided great service with a beautiful professional attitude. Along with Darrin Partee made this a real experience. It was a great place for the money and convenient to our business.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lovettsville, Virginia", "Title": "“A comfortable place to stay.”", "Author": "MTCSS", "ReviewID": "UR14157067", "Content": "I spent a night at the Memphis Courtyard due to an early morning flight. The front desk personal was friendly and explained the use of the gate that allows you into the secure parking lot. Check in was a breeze. The room had the typical layout that I am use to, nice comfortable bed, a couch, refrigerator and a workstation with free Internet. The bathroom and rest of the room were very clean. There is no restaurant nearby, however the front desk has info for restaurants that deliver and instructions on how to get to nearby eateries. They do have a breakfast buffet in the mornings. It should be noted that since it is near the airport, noise could be a problem if you are a light sleeper. FedEx has planes landing at all hours of the night so there is the sound of jets flying overhead. Overall, a good place to stay.", "Date": "March 9, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Great hotel, but beware of venturing out after dark”", "Author": "honeymoonin", "ReviewID": "UR13773747", "Content": "The hotel was great. Comfortable beds, friendly staff, descent delivery from local restaurants. No room service. Nice seafood restaurant just a few minutes away. Bad location, but it does have gates around for security. Great for a hotel close to MEM, but it is too far for a night on Beale. By the way Marriott Rewards members, they don't seem to look at your preferences when they give you your room. You might want to make sure of your room before you get there with all of your luggage.", "Date": "February 23, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Clean Clean Clean”", "Author": "Dara123", "ReviewID": "UR12330647", "Content": "We stayed here at the end of December. The hotel was extremely clean, and the room we got was a king suite! It had a bedroom with a TV, a bathroom, a little kitchenette area (fridge, microwave, counter), and a living room area with a TV. (room 210) We parked in a gated area, and although the hotel is located near the airport, it was still close to Graceland, which was our main purpose of visiting Memphis. If you stay here, eat dinner at Marlowe's, which is about a 5 minute drive from the hotel, and also at Four Way Restaurant (good soul food). If I were to ever find myself to be in Memphis again I'd stay here again, hands down.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Edinburgh", "Title": "“OK airport hotel”", "Author": "JayGee111", "ReviewID": "UR11679728", "Content": "We stayed here before catching an early morning flight from Memphis Airport. There was no food at the hote when we arrived in the early eveningl, but their recommendation for takeout food was excellent, although we had to eat in our room.", "Date": "December 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago", "Title": "“Winner by default”", "Author": "betacamsx", "ReviewID": "UR8619594", "Content": "Anyone who has stayed near the Memphis airport knows its pretty much hit or miss on a good hotel. This is not the family friendly walk you toddler along the street type of area. That being said the Airport Courtyard offers the most in the safe category with a gated entrance to the parking lot and a location among office buildings. The hotel itself is also not too bad, but the location is everything in this case and the courtyard has it hands down.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "az", "Title": "“YUCK!!!!”", "Author": "kmjg", "ReviewID": "UR8615285", "Content": "YUCK! We flew in to Memphis got to the hotel at midnight. There were wet paint signs on all the doors and hallwwy areas. The outside door to the parking lot was propped open. We were on the first floor in a 1 bdrm suite. I think the word to descibe this place was DANK! We were wiped out so my 15yr old opened the sofa sleeper and lo and behold old bed linens and towels....ok at this point we are gorssed out. We did call the fron desk and about 15 mins later we had bedding. There were no remotes in the room so the simple act of the tv turning on and off was even tought. The furnishings looked circa 1980. We are BIG Marriott people just look at all of our reviews but for the cost of the room which was like 189 a night we would have done better elsewhere. so my advice STAY AWAY!", "Date": "September 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Best part of the trip next to Graceland!”", "Author": "maystamper", "ReviewID": "UR7488144", "Content": "After finally arriving in Memphis after many plane delays, rental car hassles we were greeted by the most friendly hotel staff in Memphis! The front desk check in was great, the room was very clean and the beds were the ultimate in relaxation! Every staff member we met at the Courtyard was wonderful! Once our key had become deactivated and the front desk person was more than accomodating for the inconvenience! The hotel is centrally located just off the interstate and minutes from downtown, Graceland and other activities. A wonderful place to stay and highly recommended!", "Date": "May 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Great Service!”", "Author": "FloridaSoccerMom", "ReviewID": "UR7238193", "Content": "Staff very friendly and accomodating. Breakfast staff in the morning exceptional. Convenience of computer for flight checkin was great time saver and shuttle to airport. Rooms are nicely decorated and comfortable. Price was reasonable.", "Date": "March 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Richmond, Wisconsin", "Title": "“Great Stay at the Courtyard Hotel”", "Author": "FreezingInWisconsin", "ReviewID": "UR6590465", "Content": "Starting from when my wife and I were picked up at the Memphis Airport, (after a huge screw up and subsequent airline delay) by the shuttle bus driver from the Courtyard Airport Hotel in Memphis our stress and anger with the airline were forgotten when the driver of the hotel shuttle had some jazz playing on the radio and told us about some of the sights and places to eat near the hotel. He was genuine and the great service did not stop when we got to the hotel. The front desk staff was just as gracious and made our unexpected stay a great one! Just wanted to let some one out there know that it is a hotel you can feel good about staying at. Thanks Courtyard by Marriot! Take care, D.B. and T.B. from Wisconsin", "Date": "January 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Perfect Airport Hotel”", "Author": "Ryokousha", "ReviewID": "UR6495664", "Content": "We came from an international flight with a stopover in Memphis. We needed a clean hotel, near the airport, with a certain level of comfort to guarantee a good night's rest. Coming from an almost 24 hour flight, we were very tired with our 9 luggage in tow. I had tried to check our luggage from Asia all the way to Paducah, our final destination, but tighter airport security would not allow this so it meant my family of 5 plus 1 nanny had to check out our 9 luggage in Memphis and recheck them the next day for our onward flight. This trip was to visit relatives so 5 of the 9 luggage were for Christmas presents. :) We booked the Courtyard Inn located at 1780 Nonconnah Boulevard in Memphis and were very happy with the choice. First, the free roundtrip airport shuttle was a big help. The driver was in fact very accomodating and even offered to make a second trip for our luggage since they had brought the smaller van not anticipating the number of luggage we had. When we got to the hotel, the front desk staff offered to keep our luggage in their office. They explained that this is not a full service hotel so they did not have a concierge. Despite this, the staff went out of their way to make our stay very comfortable. When I asked for nearby restaurants, they provided info and even gave me a menu of several restaurants who could deliver. We could not have been more pleased learning that we could have food delivered to our hotel as we were too tired to even think of going out. The free internet was a big help as I was able to do online check in and print out our boarding passes for our flight the next day. The rooms were very clean and had everything we needed for an overnight stay. If you want to see photos, visit the marriot website and look for Courtyard Memphis Airport. The rooms and facilities are exactly as they look in the website photos. On our return trip to the airport, they used the bigger shuttle to accomodate all our luggage. Overall, we enjoyed our stay. It just seemed to me that they had anticipated all our needs. Great hotel, excellent staff!", "Date": "December 25, 2006"}], "HotelInfo": {"Name": "Courtyard by Marriott Memphis Airport", "HotelURL": "/ShowUserReviews-g55197-d98020-Reviews-Courtyard_by_Marriott_Memphis_Airport-Memphis_Tennessee.html", "Price": "$113 - $167*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1780 Nonconnah Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Memphis</span>, <span property=\"v:region\">TN</span> <span property=\"v:postal-code\">38132</span></span> </span> </span> </address>", "HotelID": "98020", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e5/1f/e51f492c77602bf7cd6e118573c22cbf6large.jpg"}}