{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Houston,TX", "Title": "“If you want All work and no play...this is where you stay.”", "Author": "TheGlamorousLife", "ReviewID": "UR128424165", "Content": "I stayed here for two nights because I found an exceptional weekend deal. The room I stayed in was just average at best. The hotel was filled with conferences and wedding events. Nothing exciting just a standard Fairmont. You must rent a car to get to anything exciting beyond work/business related activities. I was in town for a wedding so it served it's purpose quite well and I couldn't be the deal.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Very nice downtown hotel.”", "Author": "TexasDad1836", "ReviewID": "UR128171643", "Content": "Exactly what I expected from a Fairmont Hotel. Helpful, friendly staff. Beautiful, spacious suite (they had no rooms for common folk like me and had to upgrade me!). My only nit was some pipes (I guess) that were banging nearby (I was in Room 400). Not enough to keep me from sleeping, but would have been annoying had I stayed more than one night. I'll definitely stay here again.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pristina, Kosovo", "Title": "“Good 5-star with all the usual bells and whistles”", "Author": "Bennelong", "ReviewID": "UR127970440", "Content": "I spent three nights here for some meetings. Perfectly nice place, slightly dated but well-equipped - wifi throughout (not free), good sized room with desk, large TV with lots of channels, ironing board / iron, decent bathroom....and ice machine on each floor - nice touch! Ok gym that's open 24/7, outdoor pool, good (but slightly over-priced) restaurant. Service appropriately slick all round. About 30 minutes drive from DFW. Would I stay again? Sure, but only on business, not for fun.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Nice Hotel; Spacious Room”", "Author": "ECtraveler12", "ReviewID": "UR127747796", "Content": "Stayed here for business in the South Tower. Ask for a quiet room and got a corner suite. Room is big and nice. Only complaint is the poor lighting in the room.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta", "Title": "“Good for a conference”", "Author": "Pir8guy", "ReviewID": "UR127293474", "Content": "I spent a couple of days here for a conference (which was held at the hotel). It's a nice place, probably a little older than some, but it seems to have been renovated over time to keep pretty high standards. The room was nice, pretty large, with a good work area/desk. Room service was kind of pricey, but the food was good. I ate at the bar a couple of times (the restaurant is really expensive) and a couple of items were outstanding (pork tacos and the cheese plate). I was there earlier in the week when the tornadoes ripped thru metro Dallas. Kudos to the hotel and it's staff for having a plan in place and for executing that plan for it's guests.", "Date": "April 5, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dunwoody, Georgia, USA", "Title": "“Nice comfortable hotel”", "Author": "W4ATL", "ReviewID": "UR127192271", "Content": "The Fairmont is a nice historic hotel in the arts district of Dallas. I had a 2 queen bed room which was comfortable and not crowded. There was a separate area near the entrance to the room where the desk was to work with your laptop. The TV is Hi Def with most all of the channels in Hi def. The shower has a fully adjustable head so it can be adjusted for height. Tall or short people will have no problems with the shower. HVAC was quiet and worked well. The bar adjacent to the lobby is nice with 2 TVs on sports channels most of the time. The menu is limited if you want to eat their. Mostly burgers and sandwiches with a few salads. For a better meal the Pyramid restaurant next to the bar offers a high end dining experience but it is pricey. The food and service at Pyramid is great. There is a Starbucks located in the hotel if you want a less expensive breakfast or lunch. Internet works well but was over $15/day. I tried to wander around the hotel but there is not much around. The 2 restaurants I tried to go to were closed (it was a Sunday) plus there are a lot of Urban Outdoorsmen wandering around so I decided to stay close at the hotel for the remainder of my time here.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not bad for a meeting space.”", "Author": "ZMyers", "ReviewID": "UR126992877", "Content": "All in all, a decent spot. Good room size... A/C did not work too well Tubs needed resurfacing/replacing. Lighting was good. Flat Panel TV. Slow elevators.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Not the best water situation...”", "Author": "RoamingTexan", "ReviewID": "UR126987877", "Content": "As others have said, the staff is excellent, but the hotel has some real problems. We couldn't get hot water so after a cold shower the first day, I called and complained. The man came and let the water run full blast in the tub and sink for five minutes and we finally got hot water. We had to do that every time. The AC wasn't cooling well at all although it was bearable. There were very load noises coming from the elevator that we could hear in our room all night. Not a very pleasant experience.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Texas Gulf Coast", "Title": "“The employees are amazing... the rest not so much!”", "Author": "kdm311", "ReviewID": "UR126793746", "Content": "We recently stayed there two nights as part of our niece's wedding weekend. The employees are extremely helpful and polite. After the first night, we called to have them check the air conditioner which was not cooling. An employee came promptly, but it still did not work. I would choose another place to stay the next time we need downtown Dallas.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Not the type of Fairmont I'm used to...”", "Author": "PackLightTravelHeavy", "ReviewID": "UR126782785", "Content": "I will caveat this post with: I am a Fairmont platinum member. I stay in a Fairmont very regularly. But I have never stayed in this particular one before. The parking is all valet - a great convenience, unless you have to unpack your car, which has to be done in front of everyone in the lobby. Check-in was easy and nice, and they are great about allowing dogs. The hotel, room, bathroom was very...tired. I just think this Fairmont is in need of a facelift. We stayed in a suite, which was large, but it just had an \"old\" feeling to it. They really need to do an upgrade to this hotel and restore it to its previous grandeur. I remember coming to brunch here as a kid, and it being the nicest hotel around. It's still nice, but not the immaculate, to-the-nines Fairmont that I am used to staying in all the time (DC). We did have some issues with their service (they made me chase down people in the lobby and then the bar to get a corkscrew), but the manager rectified the situation upon checkout and was very professional about the issue. It did not color our stay at all, given the response from the staff. Overall, decent if you can get a good rate, but I wouldn't pay full freight for this property. Stay at the new W in Dallas instead!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Airdrie, Canada", "Title": "“Constant Disappointments”", "Author": "CDNPrairieGal", "ReviewID": "UR126226900", "Content": "I would first like to begin by saying that I am a dedicated fan of the Fairmont brand-and it is not just because I am a Canadian. I have stayed at Fairmonts around the world. As I type this, it is with the background of being a fan and the sadness that this was the worst stay I have ever had at a Fairmont. I struggled with the thought of not posting this, because it may taint the Fairmont brand, but rethought since I feel this site deserves honesty. I stayed at this hotel for a week over Christmas. I was first escorted up to my room by a very nice bellman, JD. The ice machine outside my room was broken and the whole hallway smelled of must/mould. The fan used in the hallway to clear/dry up the leak was very loud and could be heard through my room door. Although the suite was a recently renovated space and as lovely as it was, it was as if someone had stopped renovating/decorating it right before the last of the finishing touches were done. There was one phone in the whole suite, no lamp on the phone table in the living area, toiletries were incomplete and the musty smell was intolerable. I asked for another room. When JD moved me again, I have to say, I was exhausted from my trip-I had been up 36 hours by this time and I just wanted to go to sleep. This was not easy-my new room,1201 had: a leaky tub faucet ( I had to close the door to not hear it) a torn arm chair arm no recycling basket the note pad stuck to a spill on the end table which also was missing the finish in several places the garbage was missing in the bedroom there was a paint chip missing out of the door at eye level the toiletries were mixed up (no lotion but 2 body washes) I was ill on the on the second day of my stay, so I did not want people coming in and out of my room. I called down later to let the front desk know of the tap and the end table issues only, because at that point, I had not seen the other problems. When I returned later to my room the third day, I saw that none of the issues had been dealt with. In addition, I then saw the torn chair arm. I had a friend coming to visit me and I had been bragging on the Fairmont chain; this was embarrassing. I asked for a new room and came to be in 1600. Daniel was excellent in helping me move-very kind and professional. He is proud to work for the chain. I began to feel better about my Fairmont brand. He helped me set up-again. Whenever he saw me, he always said hi and asked if he could be of service. I looked around my new suite and found that the end table was also missing several chunks of finish and had black stains on it. I asked for a new table-for two days. It never came. The TV in the bedroom had no cable but was eventually fixed. The toiletries were mixed-Miller Harris with their new brand. I never knew if I would find small bottled water in this room or not. In the other room (1201) there were always several bottles-very inconsistent housekeeping. The portable phone by the bed did not work nor did the remote control for the TV in the living room. I asked for them both to be dealt with- the remote was but the portable phone still did not work. I let Royal service know and said that could be addressed tomorrow. Later that night, a manager and a maintenance fellow showed up with a new phone. I said I could live without it for the evening and was getting ready for bed, could they come back tomorrow? I did appreciate the fruit tray sent to 1600, but housekeeping left it in the room for 3 days and things were beginning to mould. I left the lid off the tray to indicate removal-but I guess I needed to put a note on it for it to be taken away. I am assuming the tray was an apology? I called down to find out why it was in my room, but the clerk didn't seem to know why. I can say the food and the fellow who delivered the room service were great as were all of the valet staff. Sadly, the rest of my stay did not match. When I let management know, they apologized by email and offered me one free future night in a suite -for the whole week of issues and having had to move three times in said week. In my many Fairmont experiences, this hotel is NOT up to the brand name or attention to detail or quality experience.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“The maids steal and the food sucks”", "Author": "FairmontSucks4", "ReviewID": "UR125682136", "Content": "I am from Dallas and have been to all of the nicer hotels downtown for business... Was recently at the fairmont for a 3 day regional sales meeting. The food was poor, okay to say the least. The valet service and check in were below average, slow and unprepared. Also, items were stolen out of the room that they claimed to be unresponsible for. If I left it in the room, and then it was gone, they didn't take responsibility for their staffs actions at all. Very poor service and accommodations for the level this hotel is perceived to be at. Cool banquet rooms but I will be disappointed if our company holds another meeting of this magnitude there. We all missed the Westin Hotel very much, but they couldn't accommodate the number of people we had attending. Sadly to say neither could the fairmont. Will never stay there again.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Close to the museums”", "Author": "Albiart", "ReviewID": "UR125483800", "Content": "Nice upscale hotel very close to the museum district - I'd give it 3 & a half stars if I could. I was in Dallas to see the Caravaggio show at the Kimbell Museum in Fort Worth but we also went to the Dallas Museum of Art, Crow Collection of Asian art & Nasher Sculpture Museum, all of which were easy walking distance from the Fairmont. I asked the concierge how to get to the Kimbell on public transportation & he sent me a few blocks away to the bus station - apparently no one had ever asked such a thing before in Texas's car culture. (It was relatively easy to do, although the trains & buses do NOT run on Sundays!!) The room was very nice & the gym was fine, but for the price we paid breakfast & wifi would have been nice. The neighborhood is not that great - kind of deserted & seedy on weekends. We ate dinner in the bar both nights as there were no local restaurants that looked vegetarian-friendly - tasty food & cocktails, not too pricey.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Quapaw, Oklahoma", "Title": "“Great weekend in the City”", "Author": "jemandrews", "ReviewID": "UR125259601", "Content": "We spent the weekend in Dallas at the Fairmont with our kids. It is a good hotel for the price (which is pricey). They do not have an indoor pool which we had hoped by the outdoor pool was open and heated. We got in (despite the February chill) and thankfully it decent weather but chilly! Wish they had a hot tub on the terrace so you could get in and warm up. We had a good experience with the service, our room was clean and comfortable (but two double beds were small - wish they were queens). The hotel was really busy with multiple groups/events including a ton of cheerleaders - but we never had an issue with noise in our room. The lobby was a bit crazy at some points but we had a great weekend.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Youngsville, Louisiana", "Title": "“Nice all around”", "Author": "RaginCajunCuisine", "ReviewID": "UR125225686", "Content": "The room was very nice, the bed was extremely comfortable. Great view of the AA Center. Was in room 1409 on Feb 19-21. Valet was extremely friendly and the cocktail waitress named Tiffany was hilarious, nice, and a great addition to the lounge. Will definitely be back.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Houston, Texas", "Title": "“Kind of unremarkable”", "Author": "MJPourpak", "ReviewID": "UR125211190", "Content": "I normally really like Fairmont properties, but I found this one to be a bit unremarkable. The rooms seemed incredibly tired and in need of some refurnishing. The service was only so-so.... in fact, I was a bit put off by how the concierge started examining my luggage which was on a luggage cart (waiting for the bell boy to take it to the room) and when I asked him what he was doing he said he was just trying to see who I was. It seemed incredibly improper. The staff at the restaurant was cold/unprofessional. The food was OK, but not amazing. I don't know Dallas well but I'm sure you can find a better place to stay.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bridgeport, Texas", "Title": "“Customer Service is bar none!!!”", "Author": "Penny39", "ReviewID": "UR124979153", "Content": "I booked a room for my husband & I for Valentine's. Before our visit I arranged with Phillip in the concierge dept an in room massage for my husband and I. He was also very helpful with other information. We arrived and were treated like royalty! Very helpful staff & friendly! The hotel is aged a little but the customer service makes up for it hands down!! The bed was very comfortable & the liens soft. Room was very clean. The only issue I had was that the massage therapist named Sarah tried to cheat me on my 90 min massage but Phillip not only adjusted the different between the 60 massage I received but also took off the amount of the tip that I gave her plus more!!! He was one of the best concierge's I have ever had the privilege to work with. Everyone really cared to listen to me and made me feel very important. So the only suggestion I would recommend is that if you get an in room massage which is pricey but sooooo worth it, is to make sure the therapist can come up shortly before your schedule time and reenforce the time amount with the therapist. Check the time before & after. If they cheat you then take it up with them at that time. Also don't pay them directly charge it to your room so if you do have an issue with them the hotel can address it. Again I can not stress how great the customer service was, everyone from James at the bar which made the best mudslides I've ever had to the valet guys which had my car johnny on the spot to Phillip....I can't wait until we can go back!!!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "West Plains, Missouri", "Title": "“Great Staff, Good Food, Tired Property, Discordant?”", "Author": "Hobietim", "ReviewID": "UR124623532", "Content": "A great Staff, obviously well trained and dedicated to service, food and service excellent, the physical property is ttired, TVs not working, noisy ventialtion and premises, very sad excersize facility. Overall a reasonable location, close to the trolley and tram, 8 blocks to convention center, i would not choose to stay here again until the physical property improves.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel, shame our stay wasnt longer”", "Author": "Al b", "ReviewID": "UR124304142", "Content": "Excellent stay in this hotel, we booked something that was a bit above average price so expected a decent hotel, and we were pleasantly suprised by the standard of the Fairmont. great customer service, lovely rooms, friendly staff. Also nice swimming pool and pool service. i got the feeling this predominantlly a hotel for businness men/women but there were also a fair amount of friend/families/couples there too. location very good, your in downtown dallas pretty much. only downer was the wifi wasnt free,but thats a minor and theres a free internet room in the lobby, unlimited internet if needed. The breakfast was perfectly cooked and the bar was nice to have a drink in the lobby. obviously there are cheaper options in dallas downtown but for the slight extra you seriouslly cant go wrong with this hotel, was worth paying the extra 30 or 40 bucks", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Loved the fairmont”", "Author": "PrincetonBelle", "ReviewID": "UR124083739", "Content": "Excellent stay and breakfast was phenomenal. Staff was very friendly and efficient.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Vallarta, Mexico", "Title": "“Excellent location, very pleasant stay - service dedication is behind”", "Author": "MexicoViva", "ReviewID": "UR123676801", "Content": "The Fairmont Hotel is located in the artist center and is greatly reachable and only 25 min distance from the airport, almost downtown. We had a very pleasant stay, however, the service was somehow 'very professional' instead of warm and obliging.... We stayed for 4 days during the week and had a great suite at the executive level â€“ plenty of room for 2 persons. The highlight in the morning was the breakfast at the lounge at the 18th floor and I really enjoyed the choice of fruits, warm dishes and great coffee. The only thing missing for a really excellent stay: by spending 4 nights at the hotel, I would have expected that our towels might have been changed at least once (and there was no ecologic hint available in the bathroom) and that amenities like shower gel and body milk would have been replaced at some point in time. Instead I was frustrated by squeezing out the rest of itâ€¦.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bryan, Texas", "Title": "“Smooth, pleasant stay”", "Author": "texanroadtripper", "ReviewID": "UR123619465", "Content": "I stayed in a lovely room on a high floor. The room itself was immaculate, the view was great, and the hotel itself was warm and well-appointed, with nice touches like excellent, non-glaring bathroom lighting and artwork in the lobby. The staff I encountered were uniformly efficient and kind, and I walked to all of my downtown business meetings. A few warnings: food and parking are pricey (half a grapefruit: $8; parking: $25/night), and avoid rooms by the ice machines, which are loud.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle, WA", "Title": "“Nice place in Dallas”", "Author": "TravelLib", "ReviewID": "UR123617334", "Content": "This was a conference stay for me and as I'd booked late, there wasn't a lot of choice left for hotels near the Convention Center. I'd stayed at other Fairmont properties, so this seemed like a good choice. Fantastically comfortable bed. Housekeeping was good, but not great--it didn't look like anyone had really LOOKED at the room as the valance on the curtain was hanging off about 2 feet.. Concierge and bell staff were wonderful. The restaurant was very good, which was helpful since there isn't a lot nearby. All-in-all, the weekend stay was ok.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Clean, safe, and a great location”", "Author": "Sallad13", "ReviewID": "UR123529664", "Content": "Went to Dallas on a business trip. Stayed at Fairmont, room was large, clean, it was fine. Over zealous maid threw out my unread newspaper...and I am still waiting for the management to call me back. After breakfast, I waited and waited to pay, and I had to track someone down to pay (apparently, my waiter was sent to lunch and no one picked up my table). Would I stay here again? Probably not...but as I said, it was clean and I felt safe. Beds were double rather than queen, and I wish it had a fridge, rather than the minibar... Would not stay here again, but rather the Magnolia Hotel instead.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "hickory, nc", "Title": "“eat somewhere else”", "Author": "aphrab", "ReviewID": "UR123474627", "Content": "Roomy, clean, but battered table in the sitting room. I paid $37 for room service of nachos and Coke. Absurdly pretentious, overpriced menu in the Pyramid Restaurant. Bar food lacks character--there's no Southwest item available. Poor bar service. My phone cut out regularly, requiring expensive redials. Engineer said stop using the phone. Low bathroom water pressure. Nice people take complaints but do nothing to help. For this price and this much annoyance, stay somewhere else.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Nice Hotel!”", "Author": "JoeRFreitas", "ReviewID": "UR123425676", "Content": "I stayed in this hotel on a business trip in 2006. It is very well located and offers a very good service.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Excellent hotel, great downtown location”", "Author": "runner409", "ReviewID": "UR123162518", "Content": "Typical but very good Fairmont amenities in a great location -1 block away from Dallas Museum of Art and with easy access to other downtown locations and freeways. At a business meeting- group food was ok but not outstanding. Attractive lobby bar. Fitness center in basement- no view but functional machines and weights. Interesting art in lobby and elsewhere in very nice building. Staff was uniformly helpful and pleasant. Internet access was overpriced.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "DFW", "Title": "“Furnishings dated, no spa”", "Author": "divefan", "ReviewID": "UR123115796", "Content": "I was in the South Tower, and as a Fairmont Premier member I should have been in one of their nicer rooms. Maybe the North Tower is nicer? The furnishings, carpet, drapes etc. were dated. The bathroom was small. The bathrobes were stiff and scratchy rather than soft and fluffy. My heating unit made noise the first night, but I was able to get it fixed the next day. I guess they're trying to be hip - they played rock with electric guitars at breakfast, which is not what I want to wake up to on a Sunday morning before I've had any coffee. On the plus side, it was a very short walk to the Dallas Museum of Art. There were a lot of staff around trying to be attentive. The bed had nice linens and was very comfortable. The price was quite reasonable.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“Happy New Year”", "Author": "simonbill1", "ReviewID": "UR122935696", "Content": "We have stayed in several Fairmont properties across Canada, USA and were not surprised to find the Fairmont Dallas to be anything but your typical Fairmont deal. The building was ideally located in the arts district of Dallas. In easy walking distance from the rail system, Historic sites and the American Airlines Centre. The room was comfortable with plenty of storage space, we are used to a power shower and found the shower lacking, however the hotel is \"green\" so we did save water. Staff at the hotel were excellent. We arrived late having missed our connection from Atlanta and just wanted to go to bed. We have a smooth check in considering the place was alive with wedding parties. The breakfast buffet at $21 was okay, and you could order basically what you wanted. A good hotel in a prime location.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kansas", "Title": "“Great stay”", "Author": "powercat", "ReviewID": "UR122738550", "Content": "Great place to stay while in Dallas. Everyone was very nice and rooms where great. Wish starbucks had better hours, but the people at the bar made some lattes for us when starbucks was closed. Great service", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“great hotel at TravelZoo price”", "Author": "robmcliberty", "ReviewID": "UR122635901", "Content": "got 3 rooms and stayed with wife and 2 daughters and son in laws December 2010. Went to Mavs game. Fine room. Only surprise was valet parking at $20 a day.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“The Fairmont and State Fair”", "Author": "brian62hill", "ReviewID": "UR122589622", "Content": "Every year I make a pilgrimmage to Dallas Texas for the State Fair. If you love fairs, you must check out Dallas; it's like none other. It's set in beautiful Fair Park, the largest collection of Art Deco buildings in the US, built to commemorate Texas' Centennial in 1936. The architecture, landscaping, sculpture are all exquisite. Not to mention the Corny Dogs and the wonderful infectious sense of pride every Texan exhibits. It can be hard to find a hotel depending on when you go. This year, I stayed at the Fairmont, a favorite of Dallas' well-heeled set from Highland Park. Dripping in elegance (from the 70s), and conveniently located to the nearby Arts District. Fabulous views from the North Tower. Elegant lobby bar and professional staff. Taxis at the ready, or a few blocks to the DART. Large hotel, too, so if you want space in a large or not so large group, you're not on top of each other. Nicely appointed rooms. Could use a bit more housekeeping support - particularly for replenishing the rather cheap in-room coffee machine. Wi-Fi access. Quiet.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, tx", "Title": "“Loved Fairmont Gold”", "Author": "GJ123", "ReviewID": "UR122300390", "Content": "We just came back from a 2 night stay at Fairmont. We got a good deal on the Fairmont Gold level room, and absolutely loved it. I would not stay without the Gold level because you get such great amenities in the lounge. We had breakfast (hot and cold), snacks, and desserts available every night. Loved the cappucino machine!! The people were all so very nice and provided everything we asked for with no problems, even allowing for late check out to let us enjoy the aquarium on the last day. It turned out that we needed a late check out because our daughter got \"pooped on\" standing below a bird at the aquarium, and needed a shower after we got back. Thank you for that! The only slight complaint that I had was the there was a stain on the carpet in the room, and it was obvious to see, which took away from the luxury feel. Other than that, I loved the slippers, potpouri in the closet, umbrella (just in case), robes, thick towels, rain shower, and the nice smelling lotion!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“WE WILL NEVER STAY HERE AGAIN!!!”", "Author": "Jara C", "ReviewID": "UR122157896", "Content": "I will try to make this as short as possible. My husband and I, on a budget, thought that this hotel looked really nice online, the price was nice, so we figured why not! When we arrived we found out they had MANDATORY valet parking (which yes is very nice and convenient, but NOT when you didn't budget for it!) This service at a whopping 26$ a day, took a little chunk out of our spending money. (Nowhere on their website or Orbitz did I see this information) Next, we brought our dog, which the hotel so nicely accepted. Surprise! There was a 25$ a DAY fee for that too! Another chunk out of our spending money. (Once again NEVER mentioned) After checking in, yes this hotel is BEAUTIFUL. But I was very disappointed with our room. It was very small. I have had much bigger hotel rooms for the price. When we walked in our hotel room was very warm and stuffy. We immediately turned the AC on and turned it down low. (Yes it's cold weather outside, but we like to stay cool and snuggle in blankets). After leaving for a few hours, then coming back, our room was still super stuffy! We called the front desk and they sent someone to fix it. He came up, \"fixed it\" and left. Let's just skip forward about 2 hours, after they showed us 3 other rooms, tried to fix it again, to finally the front desk calls us and says the AC is completely turned off in the wintertime. TURNED OFF. They said they could give us a box fan. And move us down a few floors, maybe it will be cooler. A BOX FAN. So we sat in our small hotel room with a dusty box fan from maintenance. On a side note, when we moved rooms, since we packed up in a hurry, we had accidently grabbed the remote from the first room. When we realized it, we took it down to the front desk and told them about the mix up. Later we checked our bank, they had already charged us for that remote!! They had just issued a credit. We were still in the hotel and they didn't even ask, they just charged us. Also, that's about the time we noticed they had put a $150 hold on our account for \"just in case\". Now seriously, I understand this is a fancy hotel. I just wish all these crazy fees would have been listed!! Through all of these unknown fees, we ended up paying about 60$ a night MORE than we originally bought. We will never stay here again, no one could give us a straight answer and they did nothing to help us with the AC. Our stay was terrible all because of this hotel. We were so stressed out from not knowing what we were going to find out next that we are now glad to be home, and having to relax from taking our VACATION.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Great Experience”", "Author": "Landrysmom", "ReviewID": "UR122123803", "Content": "Too short a visit but great staff, accommodations, service. Will choose Fairmont next time in Dallas! Easily accommodated family of 4 with 2 adjoining rooms. Join the President's club for free internet.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“Very good hotel in Downtown Dallas”", "Author": "2Traveller2", "ReviewID": "UR122087856", "Content": "I've stayed here a couple of times on business. From the moment you arrive, the staff are excellent, especially the room service staff. The hotel is big, but comfortable. It is close to most downtown locations, so you can walk from the hotel to where you need to be, but I'd feel uncomfortable walking to/from the hotel late at night. I have to point out that the room service is excellent, especially for a hotel in this part of the country. They have surprisingly healthy options on the menu, which are really tasty. As I mentioned before, the room service staff is really top notch. The rooms are what you'd expect from a Fairmont, though avoid the ones by the swimming pool during the summer where there are often kids out late at night. Cleanliness is a major factor for me, and this hotel was very clean and well-kept. Unless you or your company wants to pay for the Ritz Carlton, this is the only hotel to stay at in Downtown Dallas.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corpus Christi, Texas", "Title": "“A Wonderful Experience”", "Author": "Simmonsgirl1961", "ReviewID": "UR121964451", "Content": "Our stay at the Fairmont Dallas was everything I expect in a top-level hotel. The amenities provided on the Gold Floor were impeccably presented, the atmosphere ideal for adults seeking quiet elegance and convenience. I must commend the entire hotel staff for their gracious and efficient manner. The restaurant was also a delicious and delightful experience. Highly recommended.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Big Hotel In An Arty Area”", "Author": "tripstyler", "ReviewID": "UR121712436", "Content": "The Fairmont Dallas is Texas big with two tall towers and a lengthy lobby. Originally built as residential development, the property was converted to a hotel. Architecture and interior decor buff will larger concrete overhangs in place of balconies. Right in the midst of Dallasâ€™ mod Arts District, you can walk to any the AT&T Performing Arts Center theaters or museums. If you have time, do this. The buildings are architecturally impressive. In the opposite direction find casual restaurants in the Old Town, or a more NYC- feel near Neiman Marcus. Like most hotels, some rooms are renovated, some are not. All rooms are spacious. Renovated rooms have granite surfaces, sliding glass doors, fresh wallpaper and paint. The bath products are in the midst of being converted from Miller Harris to Le Labo, Fairmontâ€™s new bath amenities provider. Le Labo products have a nice consistency with a faint---almost unisex---rose smell. Based on interactions with the front desk, housekeeping and maintenance, the service was mostly excellent aside from an off night we had in the Pyramid Lobby Bar {where we had to ask to be served etc...}, and a concierge who was earnest and helpful, but a little glass half-empty. Perhaps isolated experiences? All in all, I would stay at the Fairmont Dallas again if I return to Dallas because of my Fairmont loyalty and points accrual. The hotel is EXCELLENT value {in comparison to other fairmonts and upscale hotels} for the price point paid. WHAT TO KNOW - free wifi if you join the Fairmont Presidentâ€™s Club {the hotel groupâ€™s free loyalty program] - there is no shopping mall within walking distance, the closest is NorthPark Center, located a $25 cab ride from the hotel - Thereâ€™s a Starbucks in the lobby - Highly recommend: The Nasher Sculpture Center and Dallas Museum of Arts - Also recommend Private Social Restaurant, a 7-min drive away - If the gold floor upgrade is available at the time you purchase the room, I felt it was good value---the best value Iâ€™ve seen at any Fairmont, and Iâ€™ve stayed at close to 25 worldwide. - The Fairmont gold staff are incredibly helpful and having what feels like your â€˜living roomâ€™ at a hotel makes for a more pleasant travel experience. - The city, mostly office buildings and not much residential, is pretty quiet on the weekend.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Loved this hotel - Gold lounge is a must!”", "Author": "Emma N", "ReviewID": "UR121711849", "Content": "Myself and my husband stayed here with another couple, at the end of September. We had spent just over a week travelling around Texas and this was our last stop for 2 nights before flying home. We booked rooms which gave us access to the Gold Lounge as it meant some free food and free access to the internet, so we could book in online to our flight, but we could not recommend this hotel enough. The first day we got there, my friend and I went straight to the lounge while our other halves dropped the car back to the rental company. It was so nice to relax there after our hectic week. When the men came back we had a few drinks and the evening nibbles were served. We didn't need to get any dinner after this. We then went down to the pool as they were showing 'Ghostbusters' against a wall down by the pool. Picture quality was not as good as a cinema, but the sound was excellent and the whole experience was wonderful. We had a few cocktails and popcorn and there were some people dressed up as Ghostbusters as well. It was a great atmosphere! The rooms were very nice, our view was of a freeway and part of the city, looking towards the Hard Rock Cafe/Hooters area, but it also looked towards the setting sun and the sunset was beautiful. The rooms were clean and the beds were comfortable and huge. The Gold Lounge was the best thing about the stay though. You are told when you first enter that you should treat the lounge as an extension of your room. It includes a living room area on one side, with TV, books and internet access (1 terminal). On the other side are tables and the kitchen, which always has food available and drinks. Soft drinks are free, but alcohol is not, it is an honesty bar, so you write down what you have and your room number. The food served in the lounge was delicious, breakfast has a great selection and was very tasty. Once breakfast was finished there was tortilla soup and some other bits available, including sweet stuff, the tortilla soup was outstanding. In the evening there was hot and cold food, the first night included mini pots of macaroni cheese, that were so delicious, I think it had truffle oil in it - YUM! You can order food from the restaurant up to the Gold Lounge as you would to your room as well. The lounge is never over crowded as only 3 floors, which means about 30ish rooms have access to it and the 2 ladies who were looking after the lounge in the time we stayed there were so wonderful. I wish I could remember their names as they made our stay perfect. Thank you Fairmont Dallas, it was the perfect end to our holiday.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Service questionable”", "Author": "Mec0415", "ReviewID": "UR121670493", "Content": "I was truly looking forward to this hotel. Across the board I have never had a bad experiance with the Fairmont group and have always had a lovely time- but this was different. We checked in and the bellman (who was very friendly and nice) brought us to our room- except that it wasnt our room. I went to put my clothes away and someone's things were in the closet! We called down to the front desk right away and they moved us to another room but it was a bit bizzare- moreover, when the bellman came up to help us with our bags he left my briefcase in the other room- I should have been more aware admittedly but thankfully the women whose room we had disturbed brought it down to the front desk and said she had found this in her room... I wonder if they mentioned the mixup to her? Then we ordered breakfast the next morning and it didnt come even close to the time listed on our door hanger. My husband asked for his shoes to be shined and we requested that they be available at 8 am- they were done and looked wonderful- but it took two calls and an hour and a half to locate them. It just was not what I had expected from this hotel and it left me dissapointed. That being said, the hotel was beautiful and the rooms were very clean and well appointed.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Braunfels, TX", "Title": "“Very nice choice for downtown”", "Author": "txtvldude", "ReviewID": "UR121290475", "Content": "Just returned from a conference at the Fairmont and was very impressed. Service was excellent, from the bellman upon arrival to them holding by bag during my conference after I checked out. Check in/check out were professional and quick. Rooms were very nice.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Choctaw, Oklahoma", "Title": "“Service, Service, Service!”", "Author": "Oklahoman71", "ReviewID": "UR121129965", "Content": "Stayed at The Fairmont for the first time and would highly recommend it. It is a great location if you are going to a NHL game;close enough to walk. We booked on-line and stayed in a large suite for a very good rate. It is a pet friendly hotel and so were able to take our cat with us. The room was very nice and the room service was excellent for breakfast - we didn't have any other meals at the hotel. The location of the bar is unusual in that it is right off of the foyer and so you are not afforded any privacy. The bar food was so-so. What makes this a place that we look forward to going back to was the service. The staff know what they are doing and how to treat their guests.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Katy, Texas", "Title": "“I slept last night at the Fairmont Hotel...”", "Author": "davidtevans", "ReviewID": "UR120921160", "Content": "Considering what everything costs these days, we got a pretty good deal, at the last minute on a 17th floor corner room with a decent, but not spectacular view. I've stayed there once before, in a full size room, and the view is fantastic. This time it was a last minute bargain. I wish the mandatory valet did not cost $24 per night, but what can you do. A big wedding was going on, and that could explain the noisy neighbors, banging their door, in and out and I almost called the desk to complain. Luckily, the activity settled down. Very nice room, walking distance to very good food, and an added bonus...hot breakfast in the lounge on the 18th floor for gold level guests. Do not miss this. Tthe food and choices are excellent, and tit is complimentary. As in free. This would have cost at least $50 anywhere else. Impeccable and friendly service. A great hotel to stay in. Regret the weather was just a bit too coldto swim at the rooftop pool, which is wonderful on a nice day. Definitely recommend the Fairmont.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Very nice, dependable Dallas hotel.”", "Author": "Andaltex", "ReviewID": "UR120839920", "Content": "As a former Dallas resident, I've had many opportunities to attend functions at the Fairmont and to stay at the hotel. My most recent visit was for a short weekend in the Dallas area. As usual, I was not disappointed. The room was in a quiet corner of the hotel, large, well appointed, and with a very nice bed and bathroom. The staff is pleasant and \"on top of things\". The only thing that keeps this review from being a \"5\" is the chronic valet parking issue at the hotel. 15 minutes before my departure, I attempted to call the valet desk, but there was no answer. When I arrived at the valet area, I had another 20 minute wait. The lady at the window was very pleasant and apologetic and appeared really hassled; there appeared to be only 3 valets attempting to serve many departing guests - a lot of whom were headed to \"Jerry's World\" for the Cowboy-Bills noon kickoff. I hope they made it...I arrived at my scheduled stop barely in time. In spite of that inconvenience, the Fairmont is a really nice hotel and often will have nicely discounted rates. Its downtown location and convenience to Uptown and the AAC are definite pluses. We'd be more that happy to return.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Banff, Canada", "Title": "“Staff Extremely Helpful”", "Author": "bkosterski", "ReviewID": "UR120683008", "Content": "The Fairmont Dallas was a great location to historic downtown. I was there on a conference and was pleased to being staying at the host hotel. The outdoor pool was outstanding. As a 1st time visitor to Dallas the front desk, concierge and bellman were most helpful and friendly with all my questions along with giving directions and recommendations. The lobby bar was great as it was open and lively.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Comfortable and elegant”", "Author": "Brezzzz", "ReviewID": "UR120576337", "Content": "Stayed here this past weekend. Booked through Fairmont's website a couple of months earlier and got a really great weekend deal by prepaying (cost was less than many suburban hotels/motels). The room was a double queen, which was huge with a living room area, big desk, floor to ceiling windows and a walk-in closet. The beds were very comfortable with lots of comfortable pillows. The lobby lounge was nicely busy and our waiter really knew his drinks. The Italian eggs benedict in the Pyramid dining room was incredible....fresh dill and basil...incredibly tasty. As per Fairmont's corporate policy, we were provided with free valet parking since we were driving a hybrid....a $24 a day saving.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tyler, Texas", "Title": "“Nice Stay”", "Author": "Coconut2011_4", "ReviewID": "UR120437886", "Content": "Went for a business conference and our room was very nice. We had a corner room so the bathroom didn't just open directly onto the bedroom, but onto a small alcove with a built-in desk. Another wonderful feature, was the large walk-in closet. Room Serice was impeccable. In fact, everyone we encountered who worked at the hotel was great. For lunches during the busy convention, they had set up a quick-serve buffet which was a very nice added touch. The hotel is older, but has been beautifully updated. My only complaint was about the heating/AC. During our stay, Dallas experienced a massive cold front and we never could get our room to warm up after that. Other than that, we had a wonderful stay.", "Date": "November 10, 2011"}, {"Ratings": {"Overall": "2.0", "Service": "1"}, "AuthorLocation": "Dallas, TX", "Title": "“Time to get it wrong, but not to get it right?”", "Author": "TurkeyTrotFinisher", "ReviewID": "UR120397254", "Content": "We previously stayed in the lovely Magnolia Dallas for the Turkey Trot, and it matched the Fairmont's special Trot price. This year, the Magnolia won't do that (even though we're long-time guests...but that's the next review I'm writing). So we contacted the Fairmont. Who first quoted a rate which was $30 higher than the special Trot rate they offer on the Trot website. Then agreed that OK, maybe they DID have a lower rate, after we showed them the Fairmont promo on the Trot page. When we expressed regret for the length of the call (keep in mind - it was THEIR ignorance of their own pricing that dragged things out), the rep said \"Indeed I do have other customers to help.\" Well, OK, then consider yourself free to go help them. Because we won't be staying at the Fairmont. Now or ever. Rude. And either disingenous or uninformed about major event pricing.", "Date": "November 9, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Nice hotel, horrid valet service”", "Author": "suzym27", "ReviewID": "UR119918174", "Content": "This is not the type of hotel that my husband and I typically choose. We were in Dallas for a family thing and decided to stay here since other family members were there. Nice place - but locked, crazy expensive, mini-fridge sort of place. Pros: Very friendly staff, clean rooms, every call we made (fan request, wake-up calls, etc) they were super friendly and accommodating. The coffee in the room was quite tasty - Newman's Own. Very comfortable beds (could have used a firmer pillow - but that is personal preference). Both nights we grabbed drinks at the bar the staff were very nice (even though they were out of a lot and the upholstery in the bar is in the most dire need of cleaning). Cons: When we checked in we asked for a good Mexican restaurant and we were directed to El Fenix. Turns out it is a local chain - and it is horrible. We did not ask for any other recommendations after that. The wait for your car at valet is RIDICULOUS (and there is no street parking for quick in-and-out trips). Yesterday, we went down at 10:40am and waited for 30 minutes for our car. We were told that we could call ahead of time, so the next day we did. Called down at 11ish to say we would like our car ready in 20 minutes. Went down, and they claimed they never got the call! Proceeded to wait 20 minutes for the car. Biggest annoyance to my husband was, rather than apologizing for the wait - the drivers just looked immediately to your hand. I am a generous tipper - but not when someone expects a tip regardless of service. People can smoke right outside the front doors - this results in the lobby smelling like an old cigar. Also, those of us waiting up to 30 minutes for our car get to hang out in a smokey area. Thanks Dallas.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Various", "Title": "“Comfortable Stay in Central Location...Just Okay Service”", "Author": "ooHereandthereoo", "ReviewID": "UR119896345", "Content": "Very comfortable rooms and amenities at the Fairmont. The location is central to restaurants and businesses in the downtown Dallas area. Most restaurants are in walking distance (about .25 to .5 miles away) which can also be reached by cable cars that run on St. Paul. Internet access is also provided for free to club members (which is free). Restaurant and bar food and drinks were okay and we did not find it worth the price. We encountered a couple of issues with service. Our first issue was with the Bar. It took over 15 minutes before anyone came to take our order, then our server disappeared and it took us another 15 minutes to track down someone who was willing to help us. So we didn't have the opportunity to order additional drinks or food. Also, we noticed several inefficiencies with the valet service. Although it didn't impact me directly, I noticed that their disorganization caused significant back-ups in the valet and drive through area for the hotel which is already small to begin with. Be prepared to wait a while if you are looking to pull through during peak times.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "kansas city", "Title": "“Very nice & well-located”", "Author": "sheknits", "ReviewID": "UR119789827", "Content": "Comfortable room & friendly, helpful staff. Easy access to Art Museum and free streetcar service both one block away. Enjoyed lunch in the lobby restaurant and the banquet department served an excellent BBQ brisket at a dinner reception. Meeting facilities were adequate for our meeting size, however, the ballroom used for exhibit space is poorly lighted. Walk across the street to the YMCA for a quick sandwich/salad/smoothie lunch.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Over rated”", "Author": "Bernerbaby", "ReviewID": "UR119756008", "Content": "I had a fun weekend in Dallas; however, next time I travel there I would not stay again", "Date": "October 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "AndWhere2Next", "Title": "“Pleasant stay, friendly staff, but the overnight shift needs help”", "Author": "AndWhere2Next", "ReviewID": "UR119630507", "Content": "I recently stayed at the Fairmont Dallas for a conference. Overall, the stay was pleasant and everyone I encountered was friendly and helpful. One pleasant surprise was that the banquet food was better than I had expected. The rooms could use some updating but the bed was comfortable and the room was very well cleaned. My (insignificant) complaint was that it was very difficult to reach anyone at the front desk on the overnight shift on Saturday night. I had to walk downstairs at 2AM to have my question resolved. Other than that, I enjoyed my stay.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "southern plains", "Title": "“Good Conference Hotel”", "Author": "AmuseMeImBored", "ReviewID": "UR119572659", "Content": "Just attended a conference at this hotel. Hotel room is nothing special for the price and could use some updating, and the bathroom is on the small side, but most important, the bed is very, very comfortable. Towels are nice and fluffy, and the drapes block sunlight/outside light nicely. Pyramid restaurant is quite expensive for the few bites of food served but what there was,was excellent. Extremely tender steak! Just tiny... especially considering it's Texas! The main conference rooms were convenient to the sub-conference rooms, and all were convenient to the hotel rooms. Elevators were fast with virtually no waiting. I would likely not choose to stay here for a personal retreat, but would certainly return for a business conference.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Greenville, Texas", "Title": "“valet/concierge(customer service) was their best asset”", "Author": "Angi T", "ReviewID": "UR119496029", "Content": "Ok the good list: Valet/concierge and room service customer service was outstanding! Location was ok, not much shopping in close proximity, bars/clubs are a $7 to $10 dollar cab ride one way. The room rate was a fair price. Yep thats the whole good list. Ok the bad list: I was not informed when I made res that there was a gay/lesbian convention goin on at the hotel, I have nothing against that but when your having a girls weekend away its not ideal! They took the lounge chairs and towels off the pool deck around 11 am to make way for the gay/lesbian party that was going on later which I could hear from my 17th floor room well into the night. The pool was bitter cold, there is no hot tub and half of the day the pool area is in the shade. Nobody came to take food or drink order poolside. When i found somebody and asked for towels and water they acted as if I was a bother. The room had no microwave or useable frige only a very expensive mini bar. The bathroom was extremely small, there are no balconies, the lounge bartenders were RUDE AS HECK! I dont see this being a four star hotel, just 4 star prices! I would not recommend this hotel nor will i ever stay there again.", "Date": "October 19, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "USA", "Title": "“Nice hotel”", "Author": "USA_Super_Traveler", "ReviewID": "UR119458681", "Content": "We got a great rate for this hotel from Hotwire. All around, a very nice hotel. The lobby and bar area were very fancy and recently upgraded. The room itself was pretty regular, and didn't seem to be nearly as nice as the lobby would let on...but it was still a very nice room. But, it was clean, comfortable, and had a great view. Parking was a little steep at $24 per day, but it was valet service, and I'm not sure we could have found anything cheaper. Location was good, but not much within walking distance. All around, no complaints, and I would definitely consider staying here again when I'm in Dallas.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Excellent All Around”", "Author": "Megan M", "ReviewID": "UR119153115", "Content": "We, as a company, have stayed at The Fairmont Dallas four consecutive years now for the TX/OU Red River Rivalry, which I imagine is one of the busiest weekend's of the year for the hotel. The staff is always friendly and helpful through parking, checking in, and assistance over all. The rooms are always above par with cleanliness and amentities and the lobby bar has a great atmosphere for entertaining. We will recommend The Fairmont Dallas for any clients that need a place to stay and anytime we go for business. We look forward to our stay every year and wouldn't think of looking at another hotel!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“The Gold Standard”", "Author": "D'sGirl", "ReviewID": "UR118633087", "Content": "I really enjoy my stay at the Fairmont. Everyone was so friendly and informative. I got in at 12:30AM thanks to a horrible experience with Super Shuttle. My room was on the \"Gold Floor\" this is worth the upgrade. Wonderful breakfast, nice atmosphere and a lovely hostess. The only thing they got wrong was my gender on my bill and gold letter. No biggie. I was treated wonderfully by everyone.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Folsom, CA", "Title": "“An aging landmark”", "Author": "JHFIII", "ReviewID": "UR118461711", "Content": "I was in Dallas for a business conference held at this property. Although work has been done to spruce up the place, the rooms show their age. While my room was large and generally pretty clean, the carpet and furnishings were a bit tired. That said, the bed was extremely comfortable and the bathroom was clean with all the fixtures working as advertised. All the meals I had on property were in a group setting. The quality of the food was good. One thing that this Fairmont does well is service. Wherever I went and whatever I needed, the hotel staff were eager to please. It is clear outstanding service is an objective the hotel management strives to deliver. It was too pervasive to be the result of individual initiative.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Lyon, France", "Title": "“New home in Dallas...”", "Author": "ngblackpearl", "ReviewID": "UR118140636", "Content": "It is a pity,I only could stay 2 days in this magnificient place,I did not want to leave as I had a wonderful experience at The Fairmont.Everything was so nice.From checking in to checking out.I took the Gold room and the service was excellent.Nice,big room with all the confort. Private lounge for breakfast,tea time or evening cocktails.Donna and Darvet were absolutly wonderful .I had time to enjoy the Pool where you can enjoy nice food .The hotel is huge but you feel like home.Excellent location if you are here for business or holidays. I really recommand this fantastic place ...", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Calm under pressure”", "Author": "MovinLew", "ReviewID": "UR118042796", "Content": "I attended a conference at this hotel last month. Although there were hundreds of participants, the front desk staff was calm and cool. As a frequent traveler, I appreciate that. Rooms were well kept and all amenities were stocked. Our room was much larger than I expected. The only thing that I don't like is that the valet is an extra $24/day. It should be half that, or at least discounted based on the number of nights one stays. I will certainly return - my car may not.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Valencia, California", "Title": "“THE BEST SERVICE EVER!!”", "Author": "julie d", "ReviewID": "UR117981712", "Content": "We stayed for 4 nights celebrating my daughters 23rd bday. The service was fantastic. We upgraded to the gold floor where we had a suite and access to the the gold lounge. Donna, Jada and Darvet were fantastic. Great food and drinks through-out the day. They had flowers,champagne and cupcakes for my daughters bday. The front desk, the concierge(Phillip) the door guys (Tony) the bartenders were all fatntastic. We have never felt more celebrated and welcomed. The pool area is lovely. The bar is fun with big screen tv's. The location is great. close to trolly and downtown sightseeing. We cant wait to go back...would choose the Fairmont again for sure!! Thank you for a wonderful time and a great stay...", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "USA", "Title": "“Nice stay, would come back”", "Author": "kvyas", "ReviewID": "UR117981385", "Content": "The stay was nice, hotel was good for the special price I got. The rooms were nice, nothing different from a nice marriott or Hilton. The parking is expensive and did not realize that cheaper options were not easily available until i got there. Didn't try the restaurants or bars", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pensacola, Florida", "Title": "“Great hotel, great value”", "Author": "I10driver", "ReviewID": "UR117898905", "Content": "I stayed there for 4 nights and have no complaints. The staff were great. The rates were very reasonable. The room was clean and well appointed. The food was good. The pool was nice. Overall a really nice place to stay in Dallas.", "Date": "September 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "adelaide", "Title": "“Service at its best”", "Author": "Jayne L", "ReviewID": "UR117796244", "Content": "Hotel fairmont Dallas was the light at the end of the tunnel after a long, exhausting flight from Australia. Service upon arrival was exceptional, and this trend continued throughout our stay. Breakfast a highlight in 'Pyramid' restaurant, where staff were pleasant, friendly and food on offer high quality. For those aussies that love value, good service, and the most comfortable sleep, this is the place. It is in the ' arts' district, so don't expect retail outlets in the vicinty, however a $20 cab ride will get you to ' Northpark' shopping centre, where every brand imaginable, plus Macys, neiman Marcus etc are at your disposal. All in all a great experience, and we look forward to our next stay in Dallas. Aussie hotels, lift your game!! This is the benchmark all hotels should aspire to.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bend, OR", "Title": "“Higher end hotel at good value and good location”", "Author": "yreme", "ReviewID": "UR117749705", "Content": "We have normally stayed at the Ritz but they were sold out and went to the Fairmont Gold Level. Pricing at the Fairmont was very favorable compared to the Ritz. The rooms while small are very comfortable great bed and we did not hear any traffic noise. Service on Gold Level was excellent. One difference from other Gold Levels is the drinks are not included you pay via an honor bar. With that we did appreciate the water but I think next time we would forgo the Gold Level and upgrade to a suite for the same price. They offer breakfast and day time snacks in the Gold level which we did not use. Fitness room has a large number of cardio machines and limited weight equipment. Since no one else appeared to use the fitness room the limitation on weights and equipment did not prove to be a problem. Location while it initially does not look great turned out fantastic. We walked to the North End and a block away is the free street car that can take you to many of the restaurants and shopping. Room service was the only disappointment we had there. Free internet is available on Gold Level or for members of Presidents Club Over all while this is not the fanciest hotel in Dallas there is a very good price value here and the hotel is very clean and comfortable. We would go back.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“This place is wonderful!”", "Author": "Renee S", "ReviewID": "UR117666377", "Content": "The staff went above and beyond to make our stay Perfect! The rooms and pool are sparkling clean. The restaurant was good and the staff attentive. The concierge was the best we have ever found! We will always make the Fairmont our home when we visit Dallas.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "2"}, "AuthorLocation": "Concord, California", "Title": "“Great hotel but don't leave store your bags with them”", "Author": "Kasia2001", "ReviewID": "UR117588055", "Content": "I stayed 5 nights, part business part pleasure. The hotel service, food, and conference facilities were great although there were some problems with keeping both the hotel rooms and conference rooms chilled enough. Since this is in the middle of a huge heat wave I would not blame the hotel. My problems came later, when I checked out and left my bags in storage. The operation seemed to be somewhat disorganized and against my better judgement I left without ensuring that my storage tickets were attached to my bags. Upon return my luggage could not be found. What ensued was 30 minutes of \"deer in headlights\" looks from hotel staff, including concierge, with very little explanation as to what was being done and what to expects if my bags could not be found. All I was told was that if my bags were found they would be shipped to me at no charge. Nobody said they were sorry for the inconvenience, gave me their name, business card, phone number so that I could follow up, etc. Throughout I had the feeling that everyone just wished I would go away. When I mentioned that I missed my airport shuttle I was told that I should just take the next one. When a woman from security took pity on me and put me in the cab she got evil looks from concierge as if she was doing something totally unacceptable. The good news was that just as I was about to leave for the airport without my bags, the shuttle driver returning from the airport arrived with the missing luggage. Apparently the hotel gave my bags to another hotel guest and loaded them on the airport shuttle. It was not until the guest arrived at the airport s/he realized that it was the wrong luggage. Hope the hotel shipped it to them at no charge.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A hotel so great I want to live there!”", "Author": "Firsthope", "ReviewID": "UR117549049", "Content": "My recent and all too brief stay at the Fairmont Dallas was excellent! From the minute my cab pulled in and the bellman got my reservation started, to the time I checked out and had one last memorable conversation with Bellman Tony, I was enamored with the Fairmont. They certainly understand the concept of customer service, ensuring you are comfortable, and making you feel at home. My room was extremely spacious and well decorated. I didn't want to leave. The health club facilitites were clean, available 24 hours, complimentary to guests, and had an array of machines from which to choose. The business center was also complimentary to guests and it came in handy when a personal situation arose where I needed internet access. The food was wonderful; lobby atmosphere trendy and inviting. They have the most fabulous piece of art sculpture in front of the registration desk. My room was very quiet and my window views of Dallas were great by day and night. Staff were very friendly and helpful. A delightful visit...and very reasonable. Give it a try!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "durham, nc", "Title": "“A Classy Hotel but valet needs some work.”", "Author": "interviewqueen", "ReviewID": "UR117541036", "Content": "We recently stayed for 2 nights over the weekend. It is a beautiful hotel and well polished, inside and out. I opted for the standard king, was on the 10th floor. The view was of downtown Dallas and it was beautiful. Our room was clean, the furniture was updated and even the night stand tables had granite tops. The entry into the hotel is also clean, and the service fantastic. Parking is available for 24 per night and all taxes, fees included unlike some of the other hotels. The valet available any time and the only complaint is that they do take about 15 mins to get your car. We were there the weekend they had an event and they said they had over 400 cars and for that reason they messed up pulling up my car. Because elf this our table at bolsa almost got given away. I had to ask to speak w the manager and after telling them we were waiting for 25 mins they told me they didn't know where my car was. They offered and paid for the cab. However that screwed up the rest of the nights plans as we were going to a show after dinner and I had to come back to hotel after dinner to get car. We missed the show. So just remember if they Have an event, you may have to wait for 30 mins for valet to bring your car. The neighborhood is near the arts district but nothing immediately next to it for bars/ nightlife. Walk about 6 blocks and it will get you to downtown Dallas where there are more bars. We did not get to use the pool or the exercise facilties. We were still happy for the rate we got and we will be back.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oakland, California", "Title": "“Stay in a Gold Room”", "Author": "chingcm", "ReviewID": "UR117257276", "Content": "Upon checking in we were upgraded to a Gold Room. The amenities are great if you're staying in a Gold Room. Free internet and fast. Free breakfast, hor d'oeuvres, and dessert. Beautiful room on the top floor with a great view of Downtown Dallas. Bathroom was updated and shower was great. Bed was so comfortable. Would definitely stay here again.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Loved it - Pool area awesome”", "Author": "mandmshow", "ReviewID": "UR117251839", "Content": "Room had everything you could want for the price. It's not 5 star and does not pretend to be so if you are looking for that look elsewhere and pay more. Staff are very friendly and the food is good. Starbucks attached to hotel. The pool area is fantastic and gets plenty of sun. The pool very large and is 9 feet deep at one end. Pool area could just do with some cleaning attention (There are cigarette butts scattered around). Will definitely be staying again.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NY, NY", "Title": "“Stay in the gold club floors. Fantastic service and amenities. Internet worked great. Fantastic shower”", "Author": "akasnowboard", "ReviewID": "UR116876178", "Content": "Stay in the gold club floors. Fantastic service and amenities. Internet worked great. Fantastic shower.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Coral Gables, Florida", "Title": "“As 'hot' as Dallas in August!”", "Author": "ciscokid23", "ReviewID": "UR116802809", "Content": "Stayed at the Dallas Fairmont the weekend of August 5-7 for pleasure. A central downtown location - close to the Amtrak Union Station (a convenient and enjoyable way to get to Dallas if it fits your travel times and connections and your travel plans are flexible), the arts district (Dallas Museum of Art, the Nasher and the Crow collections), the West End entertainment district, the legendary downtown Neiman Marcus, etc., etc. - make for a convenient weekend getaway. The hotel, the facilities, and the personnel are all top notch. Special mention needs to be made of the breakfast hostess at the Pyramid Room - efficient, friendly, and remembered us from last year. Finally, the weekend rate for the Fairmont quality was a great value (go ahead, splurge on a two-room suite. I certainly did!). Stayed here last year, stayed again this year, and will probably return next year.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Natick, MA", "Title": "“Good business location with fine amenities”", "Author": "RollCaster", "ReviewID": "UR116657575", "Content": "Can't miss the striking & imaginative horse sculpture in the lobby. Very friendly & helpful staff - everywhere. Nice, big guest room, comfortable bed, terrific shower head & nice bath towels, very quiet A/C. Bedroom floor - not completely clean. Good fitness center - not just treadmills. Breakfast and dinner charges for meals in the 1st floor restaurant were more expensive than the moderate room rate would lead you to expect.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Comparable To The Marriott”", "Author": "mjcco", "ReviewID": "UR116403186", "Content": "They think of themselves as a Ritz or Four Seasons, but they are really a Marriott equivalent. The concierge can arrange champagne, but if you're hoping they will add you to any private club lists, forget it. Perfect location - located a few blocks from the McKinney Streetcar (St. Paul N of Ross) , which you can take to Perry's, Sambuca, the Ritz, Theater Three, West Village and the bars along McKinney. The Fairmont is a short cab ride from the Arts District (Wyly Theater, Winspear Opera House, Dallas Museum of Art, Nasher Sculpture Center and the AT&T Performing Arts Center. If you are older, a cab to Reunion Tower, Nieman Marcus, Iron Cactus, the Adolpho and the PM Lounge beneath the Joule Hotel are options. If you're 20-something, Zouk's, American Airlines Center and the Hotel W are not far away, not to mention RJ's Mexican Restaurant in the West End. The DART rail is 4.5 blocks south. This is a family-friendly hotel. I recommend the junior suite. Rates were very reasonable ($119 a night). Disappointed that we didn't have an iPOD stand and that refrigerators were extra. The pool was nice. They don't have a spa, so I recommend going to the Hilton Anatole for that. They don't have indoor tennis, so go to the Irving Four Seasons. The outdoor whirlpool needs to be a lot bigger and it would be nice if there were a water fall or something. The view is awesome. If you want a great hotel for your money, this is the place.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Abilene, TX", "Title": "“Not too bad”", "Author": "txninja", "ReviewID": "UR116120805", "Content": "The service from the staff was excellent, the interior and exterior was very nice, the rooms were comfortable, and the lounge was adequate. We spent a lot of time on the terrace level while at the hotel where you had great views of downtown. The attendant was there, yet very busy with the larger groups. The gift shop was nice, yet pricey. The bar had some unique local brews on tap and the after sampling them both I grew quite fond of one. I'm not too keen on hotels that nickel and dime you for everything. As a previous reviewer mentioned, $7.50 for a bottle of water in your room is a bit outrageous. The internet access price of $15+ per day was a bit high as well. It was a running joke during our stay that everything we did at the hotel was going to cost us money. That being said, the location downtown was great. You had several attractions nearby and the trolley stopped a block away from the hotel which could take you to shops and restaurants. If it wasn't for the service and location, it would be hard to recommend this hotel just on face value.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Magnolia Texas", "Title": "“Wasn't Bad, Wasn't Great”", "Author": "harleymomma74", "ReviewID": "UR116105397", "Content": "Stayed July 30th and 31st with my husband and 2 kids ages 9 and 4. I have slept better at a La Quinta and so have they. Those that claim the beds at this hotel are wonderful must not know what a wonderful bed is. All I felt all night were springs in my back and each time my spouse moved, the bed rocked and jiggled. So we ended up with a kid in my double bed and a kid in his double bed. No better. Each of us moved so much to get comfortable that none of us got good sleep. It was a rough. Do not get breakfast here. Rip off to the max. Seriously? $20 for 3 pieces of bread and juice or coffee? Oh more if you want eggs.... and then they nickle and dime you for everything. Valet is $ but you get to come and go as you please with your ticket. So at least they only charge you once. The swimming pool was nice enough. Plenty of seating for the few who were at the pool. They keep a bar outside stocked ready to take your money, and towels on hand. Yes the place is very clean. They don't skimp on that as far as I could tell. Check in time is very crowded. Starbucks is downstairs. They use Keurig coffee makers so if you want to bring your creamer and Kcups then do it. I would have if I had known this ahead of time. I really loved seeing the garden on the deck level. The Pyramid Restaurant grows their herbs and some veggies and fruit there. It looked a bit bare and unkept but maybe it was because of seasonal things? I don't know for sure, I don't garden. But they have a greenhouse up there too. Pretty neat. Stick to business travel when using this hotel. Not really a family focused hotel at all. The double beds are just too small for two people, unless you are the size of a four year old.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Perfect Situation For Art Lovers”", "Author": "ozscot", "ReviewID": "UR116081790", "Content": "This 8 day visit was not my first at The Fairmont Dallas. It is within minutes walking distance from Dallas Art Museum, Nasher Sculture Garden ( my favourite ) and The Crow Asian Collection. You can walk to Union Station or spend a few taxi dollars to get there in order to visit Fort Worth and The Modern, Kimbell and Amon Carter. In the hotel itself the rooms are well appointed, clean and comfortable. Love the walk in wardrobe as it keeps the place tidy on an extended stay. The Pool Terrace has plenty seating both shaded and sunny and interesting herb and vegetable gardens on the same level. Staff recognize you from day one and are always friendly and helpful.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Houston", "Title": "“Great club floor lounge - questionable air conditioning.”", "Author": "shellzj", "ReviewID": "UR116071701", "Content": "I stayed here for a one night business trip in July. Pros: The \"Gold\" club floor lounge is one of the best I've experienced. I normally stay at Starwood properties (Westin, Le Meridien, Sheraton). It's definitely better than almost all of the Westin/ Sheraton Lounges, and almost as good as what I've seen at Ritz Carlton. The afternoon food service included fruits, cheeses, tuna tartare, bacon mac n' cheese, and great mashed potatoes. There's an honor bar (you should pay for what you drink). Breakfast was similarly impressive. It rivals the full size buffet of many hotels--scrambled eggs, scrambled omelets, two kinds of sausage, bacon, hash browns, cold cuts, smoked salmon, cheese, fresh fruit, oatmeal, cereal, lots of juices and so on. Really great food service here. Cons: The air conditioning is questionable. My room must have been 85 degrees when I checked in and was still at least 80 at midnight. I had a corner room on the 19th (highest) floor. It had two sets of large windows and only one inadequate air vent. The hotel engineer brought a Lasko box fan and poked the vents when I complained about the heat. Eventually, the hotel moved me to the 17th floor where the air conditioning was much better (this whole ordeal took about an hour between 11pm and midnight). It was 105 degrees outside when I checked in at 3pm. Rooms are \"met expectations\" for a 4 star hotel. The king room I originally had was spacious enough and almost junior suite like with its small work area separate from the bedroom. The bathrooms are small and have only a walk-in shower. The fixtures are average for a 4 star hotel (granite vanity, Restoration Hardware like fixtures). Really, the bathroom reminded me of a newer Westin (which I think is good). The work chairs on the Gold rooms are Herman Miller \"Embody\" chairs which are very ergonomic. In juxtaposition, the work table is too high to be ergonomic and the crossbeam supports underneath are routinely hitting my legs as I write this -- this is very annoying. Check-out at the Gold floor lounge was pleasant. The staff comped my parking ($22) and alcohol charges due to the inconvenience. I am undecided as to whether I will stay here again.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Virginia Beach, VA", "Title": "“Nothing to do. . .”", "Author": "sawsan22", "ReviewID": "UR115900482", "Content": "Hotel was nice and clean, yet, the surrounding area offers nothing. No decent restaurants, no night live, not even a bagel shop. Downtown Dallas shuts down at 4:00pm, you would have to drive good 30-45 minutes to go somewhere for dinner. Ghost town after 4pm. As for the hotel, they charge $7.50 for a bottle of water.... A 1/2 cup of fruits cost $17.95 WiFi is $24.99", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington", "Title": "“Only place to stay in Dallas!”", "Author": "mkcheather1", "ReviewID": "UR115335702", "Content": "Great location, amazing service, all the extras and more! I always stay at the Fairmont Dallas hotel when I come to the Mary Kay Seminar/Convention each summer. Yes, it is crazy hot, but the hotel is always very comfortable. Incredible service - always attentive and goes the extra mile. I am there for Mary Kay, we have a formal night. I had a floor-length ball gown and it got horribly wrinkled during my travel to Dallas. The hotel staff were great, steamed my dress in a short amount of time and I was ready for the event looking great! The restaurants have great food, and great service. Love that there is an on-site Starbucks. Love the great selections for breakfasts/brunch and the elegant dinners! Since The rooms are well equipped, beds very comfortable. Highly recommend it!", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Awesome experience and wonderful staff!”", "Author": "happyandfree2011", "ReviewID": "UR115302235", "Content": "Our stay was the best! Greg at the front desk too such good care of us!", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "York, NE", "Title": "“Wonderful stay; elegant hotel”", "Author": "YorkResident", "ReviewID": "UR114942349", "Content": "Stayed here for a Saturday night in June. Had a suite on the 15th floor (Galveston Suite). Enormous room, 4 phones, 2 flat-screen TV sets, sofa & loveseat, full-size dining table, walk-in closet, marble bathroom. Staff was very helpful and efficient. Only glitch was valet parking when I was leaving Saturday night to meet friends at a restaurant. Called ahead from my room, 20 minutes before I was to leave, and it still took an additional 20 minutes of waiting in the heat before my car finally arrived; was late to the event as a result. Probably just a one-time thing; other times when I used this service they were very quick. The pool was wonderful, and pool-side dining was excellent. Also had room-service breakfast which was very elegant, delicious, and delivered promptly with style. The king-size bed was like sleeping on a cloud. Would love to return and stay again when I'm in Dallas.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Nice staff, very dated hotel, air conditioning broke down in June...”", "Author": "DoesNotGetOutMuch", "ReviewID": "UR114760541", "Content": "Hotel has been here for years - nice bar, long term staff, nice helpful. This time back after 5 years, it really looked dated. The rooms are sizeable and reasonably appointed. Unfortunately for most of the first day of our meeting at the hotel, the air conditioning did not work. June, Dallas, 100+ degrees, not good. It took an age to get the air conditioning person in to fix - rumored to have been in Cancun for the weekend. This ok but its no longer a luxury hotel.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Very nice - good stay - some issues with age”", "Author": "LeaveFromPA", "ReviewID": "UR114206920", "Content": "The Good: (1) Very pleasant and professional staff. From check in to check out - the bar, the restaurant, the valet, the housekeepers, etc - all are great. (2) The bar in the lobby is nice. The food is affordable and good. Careful what you ask for from the beer menu - they had none of the bottles listed on the menu that I asked for - and I asked for four different brews. (3) The room was spotless and cleaned well everyday. It is a bit annoying that I was out of my room from 8am to noon on most days and found my room not cleaned until after that often. Still, the housekeeping staff does a great job and I was impressed with their attention to detail. (4) Location is great. Easy walk to west end - many good places to eat - the art museum, the aquarium, other hotels, etc. Valet is expensive but only half what you'd pay in most East coast cities, so it is all relative. (5) Other guests all seem to be happy - evidence to me that they are enjoying their stay. The Not as Good: (1) The hotel is older - so while it is nice, it lacks some modern flair. The rooms are dated...again nice, with flat panel HD's, but the bathroom tub in my rooms struggled to drain. The air conditioning simply could not keep up with the 100+ degree sun beating on the windows all day. It was well into the evening until the room cooled off. Id recommend this hotel to anyone.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great hotel, amazing Concierge Floor”", "Author": "rmeri", "ReviewID": "UR111618337", "Content": "I stayed here for FIG. I upgraded to the concierge floor. My only complaint was that the hallways were very hot. The staff in the concierge lounge was so nice and the lounge was beautiful. The pool area was super nice and the staff constantly brought pitchers of cold ice water. So easy to get a shuttle to the airport, the GO shuttle is there every thirty minutes! LOVED THIS PLACE!", "Date": "June 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Need to upgrade the elevators”", "Author": "SKocurek", "ReviewID": "UR110531303", "Content": "Don't stay here if the hotel is full! The property doesn't have enough elevators and the existing elevators are small & slow. I don't like waiting in line for an elevator and I don't like my wife walking down 18 flights of stairs. I understand that elevator upgrades are expensive, but the hotel bills itself as a \"luxury\" hotel. Shame on management for letting this happen.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“A wonderful experience in a hotel that's a bit older than most”", "Author": "sologirltraveler", "ReviewID": "UR108773496", "Content": "I was here for two nights for a few business meetings and while I haven't stayed at many Fairmonts, I knew it was an upscale brand that should be comfortable. Pulling up to the building I had my doubtsâ€”the towers look like they were built in the 80sâ€”but once you get inside it's lovely. The FOOD is fantastic and the staff is some of the BEST out there. Three cheers for Donna in the Gold level lounge! (LOVE the honor bar, drinks, and food in there. Worth paying to stay on the Gold level. Also a nice spot for meetings with free internet.) The staff is VERY attentive and even a man delivering my room service added one of my dietary preferences to my client record for my next stay. And the house driver gave us a complimentary lift to Texas de Brazil (a great dinner out if you love meat!). My room was a suite and was nothing super fancy but nice and spacious and mostly modern. Loved the little kitchenette and having a fridge was handy. I do wish the room had more outlets. There is a lovely vanity area and I sat down to blowdry my hair and then discovered there was no outlet in that area at all. Caution: You WILL catch glimpses that will flash you back to 1989 in some places like old phones in the bathroom and an elevator that sometimes acts wonky. And I'm sorry but I can't STAND having to use my room key to access all floors in the elevator (not just the Gold floors). It's very inconvenient when you are carrying files or bags around. I doubt there is that much of a security risk at this hotel to warrant that. Fitness center is in basement but has nice, clean, modern equipment. I do wish they had a real spa. They can arrange services in your room, but I didn't want someone in my room.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Laredo, Texas", "Title": "“Great Stay”", "Author": "Shacheb75", "ReviewID": "UR108341384", "Content": "My boyfriend and I stayed at this hotel and it was just a beautiful hotel. Everything is just exquisite. The food at the restaurant is very tasty and it is located in a wonderful. My boyfriend proposed to me at this hotel, so it definitely holds a very special place in my heart!", "Date": "May 15, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hook, Hampshire", "Title": "“Modern hotel with a nice pool but expensive compared to the Adolphus which we preferred.”", "Author": "AngelaHook_Hampshire", "ReviewID": "UR107285470", "Content": "We stayed in Dallas for 3 nights recently - 2 at The Adolphus and 1 at The Fairmont. We enjoyed the pool at The Fairmont and the free uptown tourist trolley ride round the corner to the uptown restaurant area. The staff were good and it was clean and modern. However, we actually preferred The Adolphus in downtown which was cheaper too and nearer the museums.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Lives up to the Fairmont standard”", "Author": "brigette_garbin", "ReviewID": "UR107063224", "Content": "Great hotel, as we expected from the Fairmont brand! Room was elegantly appointed and we had quite a nice view of the city. Close to the West End, which was good for us because we went to the basketball, the JFK museum and the Butcher Shop Steakhouse, all of which were located there. Fantastic restaurant in the hotel, with exceptional service and great food. No free wi-fi in room, and business centre computers were slow but otherwise nothing bad to report.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dayton, Ohio", "Title": "“A great place to stay”", "Author": "LikeToTravel0", "ReviewID": "UR100913096", "Content": "I should have reviewed this hotel before now. We booked through Travelocity. Upon check in we were offered a room upgrade to a Gold Club stay. It was only thirty dollars more per night per room. So for thirty bucks more a night, my husband an I got access to a concierge level that provided unlimited beverages, snacks, a lounge area, etc. It became our hang out with a group of 10 friends. We were able to have a continental breakfast each morning (it was a very good selection). We returned for snacks, appetizers, and night snacks all day long. Any time you wanted a beverage, it was right at your fingertips. A very good deal considering you would pay at least that to grab breakfast and lunch for two of us elsewhere. Hotel was very nice, very good rooms and in a good location to the downtown area to walk and find dinner. I liked the unlimited valet service that let you take your car out all day long without fees.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "dallas tx", "Title": "“if you value sleep - don't stay here horrible beds”", "Author": "farela", "ReviewID": "UR100753708", "Content": "the beds have no support you sink so low in them they must be the cheapest value beds on the planet. you actually roll towards the middle. horrible.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“What a great experience”", "Author": "andy8550", "ReviewID": "UR99259796", "Content": "Even though this is a somewhat older property, it is magnificent. Convenient downtown location, albeit a $50 (w/tip) taxi to DFW. Also, no real \"green\" space in the area for running or walking. Nearly a mile and one-half to the nearest trail. Great morning buffet (but with the hefty price tag to accompany it). Restaurant staff referred to me by name, which is a nice touch. Excellent & Timely Room Service. Keurig coffee maker in the room was an added bonus. Check in was lightning fast -- less than a minute (probably closer to 30 seconds). The hotel was fully booked, but room was extraordinarily quiet (just some muted street noise since i was on a lower floor).", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Darlington, United Kingdom", "Title": "“fantastic !!!!”", "Author": "djh2601", "ReviewID": "UR98906035", "Content": "I am a very fussy hotel guest but the hotel was near perfect. I originally booked a one bed suite, as I am a member of their presidents club they have my preferences stored, within a couple of days of booking they contacted me to advise that all of their one bedroom suites connected to another room which I hate and is on my list of preferences they offered me several options non of which costing any more. I took the Gold floor option, a very nice room very modern ( which isnt my taste but very comfortable ) and a great view over Dallas. I explained to the manager of the gold floors what I wanted to do and within minutes of telling her she came back with maps and directions to the sites and attractions, even where the nearest drug store was because I had a headache !! Every time I went into the gold lounge she and her staff rememberd me be name, very impressive. Upon checking out the doorman asked me where I was travelling to when I said dallas love field airport he offered one of their sedan cars and he said that the cost was only two dollars more than a regular cab what a nice way to travel to the airport. My only slight let down was on my second night I thought that I would go down to the bar for a martini bet everywhere was full to bursting and very very noisy this is because the hotel has a lot of conference business, but that said i cannot reccomend this hotel more !!!!!", "Date": "March 4, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Midland, texas", "Title": "“Wonderful service and comfortable beds!”", "Author": "cofjoy", "ReviewID": "UR97774756", "Content": "My friend and I stayed one night to attend a concert. From the valet staff, front office staff and wait service all was topnotch! Very friendly and very accommodating. We ate in the Lobby Bar and food was good. We had a room with 2 double beds. The bed was comfortable. I loved all the pillows and the linens. Bathroom shower was good and the bathroom was well lighted. I enjoyed my stay here very much. If you are planning to spend time in the arts district and Myerson Symphony Hall then the Fairmont is a great place to stay.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great location..hotel needs to keep up with brand's quality.”", "Author": "Nepsaevoli", "ReviewID": "UR93667770", "Content": "Excellent VIP service upon check in. Love the President's Club benefits. But the room was below the Fairmont's standards from my perspective. Which is based on staying in several in the US and Canada. I went into it expecting too much, but brand expectations can do that. A few specifics, furnishings worn, messy grout, curtains worn and carpet spots. The hotel was channeling the 1990s. Early 1990s. Still, I'd recommend the hotel, but only based on location. PS. Free internet with membership in the Prez club. It's free to join.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Classy and comfortable.”", "Author": "Sniper33", "ReviewID": "UR93576246", "Content": "This is a classic 4-star downtown hotel. The public areas are beautiful. The location is great for business or downtown sightseeing. It is close to Uptown and highways as well. Parking is expensive, but options other than valet are available esp. on the weekends. I had a non-Gold level suite. It was large but laid out differently from the pictures on the website. The bedroom was huge and the parlor area was smaller than pictured. The bathroom was very small but had high quality finishes. There was a huge walk-in closet. The mattress and bedding were fantastic. The decor is classic and high quality. It is not trendy, but I don't agree with others who say it is \"dated\" either. We had lots of privacy and quiet. We didn't interact much with the staff, but when we did, we found them polite and helpful.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Fort Worth, Texas, USA", "Title": "“Clean, friendly, great drinks at bar”", "Author": "tiburonlatina", "ReviewID": "UR92611679", "Content": "Our 5th wedding anniversary could not have been better. Great shower head, we had a view of the aa center. Which is about a $7 can ride from the hotel. Had drinks at the bar they were great hot wigs were hot but very very delicious. A bit pricy on drinks and food but one was enough. Well worth the try. Stayed only 1 night it has been the best hotel ever.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "forney", "Title": "“wonderful place to stay for a special anniversary”", "Author": "jazzyforney", "ReviewID": "UR91754733", "Content": "My husband and I stayed there for our anniversary and had a blast. We arrived to our room and there were rose petals all over the place,champagne,chocolate covered strawberries and much more. The price was excellent.The food in the restaurant was also good and the service was good.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Suite...nothing sweet about it”", "Author": "jrmcd52", "ReviewID": "UR91597257", "Content": "Having stayed at other Fairmonts in Ariz and Canada I had high hopes for their Dallas location. Offered a suite at check-in for $100 additional and took it. I should have kept the original room. The living area of the suite were tattered and torn. Mis-matched furnishings simimlar to my college days and about that old. Cpmplained to front desk but was not offered any options. The bar and restaurants were very lively and service good as well as the food. Great pool but no service offered. Will not stay there again.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sun Peaks, Canada", "Title": "“Great hotel, very attentive staff”", "Author": "robS101", "ReviewID": "UR91052209", "Content": "I've stayed here numerous times, and I must say I've never been disappointed in the staff. They are well trained, courteous, and prompt. The hotel is always clean and well organized, and the food is excellent. The only thing that I think would improve it would be some updating, as some of the rooms are looking a little tired.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Simmesport, Louisiana", "Title": "“Great Hotel!!!!”", "Author": "bralossus", "ReviewID": "UR89240812", "Content": "We stayed here for a short weekend getaway and this was by far the best hotel that I've been too..The service was 2nd to none..Every aspect of this hotel is great from the beds to the bar!! Its location is also great..It is located next to many of Dallas's attractions..(Mckinney Ave., Historic West End, American Airlines Arena).", "Date": "December 7, 2010"}, {"Ratings": {"Overall": "5.0", "Rooms": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“great hotel”", "Author": "jenmarley36", "ReviewID": "UR86535571", "Content": "I went to Dallas this past July for business. The Fairmont was highly recommended. The hotel was great but a little outdated. The rooms could use some updating. I was able to spend some time by the pool which was great. The location of the hotel was perfect. A few steps from the hotel is an M-line stop. The M-Line is a free trolley service. I used it almost everyday to go to uptown. The service at the hotel was great. The only thing that I didn't really like about the hotel was its fancy restaurant. The food wasn't that great and it was very pricey. Overall when I go back to Dallas I am going to stay at this hotel.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Beware of bugs”", "Author": "donnalovestraveling", "ReviewID": "UR86295212", "Content": "Hotel staff leaves room service carts in the hallways overnight, so I guess it should be no surprise when a Texas-sized roach ran into my bathroom. Pretty grossed out and couldn't sleep that night. Location is convenient but cleanliness is more important.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Loved the Fairmont”", "Author": "donnalovescheese", "ReviewID": "UR85835715", "Content": "My husband and I stayed at the Fairmont for 2 nights. The location was fantastic and we found it easy to walk to all of Dallas' downtown attractions from her (6th floor museum, pioneer plaza, west end, etc.). More importantly we felt safe walking in the vicinity of the hotel at night which is something we hadn't felt at other locations in Dallas. The hotel itself was beautiful and felt very luxurious. Staff were friendly and helpful.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Expectations exceeded in my stay at The Fairmont.”", "Author": "JoeZimmy", "ReviewID": "UR85582002", "Content": "My fiance and I were in Dallas for her work conference held at the Fairmont. I had high expectations based on the reviews I read and research that I did before arriving. I am happy to say that not only were my expectations met, they were exceeded from the moment we checked in until we checked out. We arrived around noon to check in and the woman at the check-in desk informed us that since they were still cleaning the rooms, our king bed room wasn't available at that time. She gave us the option of waiting or she could assign us a queen sized bed room. We decided to wait for the king and she took our cell number and promised to call as soon as the room was ready but then said \"Let me check one more time\" and found us a king room. She did all of this with a smile on her face and a great attitude. She also gave directions to local attractions and places to eat and was more than happy to answer our many questions. We arrived at the room, which was nestled in the corner of the hallway, and found the room to be clean and spacious. The bathroom was good sized but only one sink but since my fiance and I were on different schedules, that wasn't a problem for us, though it might be for other couples. A desk with two chairs was convenient as both of us brought our laptops and needed to work at the same time. A mini bar refrigerator and plamsa HD TV rounded out the room. Heading out to lunch, we encountered a doorman/bell hop that asked us if we needed help. That was the theme of our stay: all employees were pleasent extremely willing to help. He directed us to a great BBQ place and gave us tips for getting around Dallas. Overall, our stay was great. The bed was comfy, housekeeping did an excellent job keeping the room clean. The staff was helpful and available. The only complaint I have is that the prices for drinks at the gift shop were outrageous. Ten dollars for a water and soda. The drinks at the bar were pricey too but I expected that. However, those are minor complaints and I would stay here again in a heartbeat. The hotel is close to the DART rail system, the West End district, the Kennedy Assassination site, American Airlines Arena and the Dallas Art Museum. There are several restaurants within walking distance as well so it is very centrally located.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Elegant hotel with exceptionally helpful staff”", "Author": "Francesca35", "ReviewID": "UR83359810", "Content": "The Fairmont is an elegant hotel with friendly and helpful, staff. The rooms are spacious and have extremely comfortable beds. There is a very nice terrace with swimming pool, shady seating areas and a herb garden - this was the highlight of the hotel for me - the perfect place to relax. The hotel is situated in the Downtown area of Dallas and is convenient for the Dart train and the McKinney Trolley - making visiting different areas of the city easy. The historic area and arts district are in easy walking distance - including the JFK museum which is well worth a visit. The hotel breakfast was quite expensive but the YMCA round the corner did a good burrito, freshly squeezed juice and delicious yoghurt smoothies. There is also a Starbucks on the corner of the hotel. There are few shops and cafes nearby because of the nature of the business area and this was the only slight downside to our stay.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Great service & Great Hotel”", "Author": "normychu", "ReviewID": "UR83174478", "Content": "A friendly staff greeted us. The hotels was super clean and in a prime location of Dallas. Shopping and attractions were near the hotel and good food was all around. Soft pillows and a soft bed as well. I highly recommend The Fairmont Hotel. Price paid for 1 evening $130", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toowoomba, Australia", "Title": "“Excellent”", "Author": "Drbackup", "ReviewID": "UR82693809", "Content": "Great personal service and friendly staff. I would gladly come back.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Salem OR", "Title": "“Great stay except for the lounge...”", "Author": "tiffanyls84", "ReviewID": "UR82256978", "Content": "The hotel was very nice! It had one of the most comfortable beds I've ever had the pleasure of sleeping in. The only problem with this hotel was the waiting staff at the lounge, which I was basically forced to eat at due to lack of restaurants in the area. Every single time I ate at the restaurant, the wait staff did not get my order right. The people at the front desk were not really on top of things either. As we were to have a special group rate for our business conference. When we checked in they didn't even know what we were talking about. It was a lovely hotel but don't expect anyone who works there to know anything and order the simplest food that couldn't be screw up. Although they did screw up a hamburger and fries....", "Date": "October 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very Nice Hotel”", "Author": "galveston_gal", "ReviewID": "UR80192506", "Content": "We stayed one night for the $79 rate. The room was non-descript, but had a very comfortable bed with quality linens. I also loved the large windows which ran the length of the outter wall. Our bathroom was small and did not contain a rubber mat to go in the tub, which I found very slippery. The common areas are nice, and I loved the pool area. The pool had lots of seating with drink service. It was also nice to walk through the herb garden. There did not seem to be many areas to sit in the lobby area other than the large open bar. I would stay there again if the price was right, but I don't think I would pay rack rates.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Very nice property and great staff”", "Author": "Bob1717", "ReviewID": "UR79577141", "Content": "Spent three nights and was very satisfied. Location in walking distance to Sixth Floor Museum and various restaurants. Staff was great, very customer focused and helpful. Nice pool set up as well.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“FINE HOTEL IN DALLAS ARTS DISTRICT”", "Author": "tobeginwith", "ReviewID": "UR78511973", "Content": "The Fairmont is a fine hotel in downtown Dallas. Keep in mind that even thought you're in the so-called arts district, good restaurants are hard to come by and the hotel's Starbuck's has limited hours so nighttime repasts are a bit of a challenge. You can have nice bar food in the overly-lit hotel bar (the staff here is the hotel's weak link, with a somewhat attitudinal bar staff) The rooms are clean and comfortable (how I wish the windows would open, however!), ther terrace pool is clean and large and the staff is friendly and helpful. Overall, a fine stay.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great Staff!!”", "Author": "sf8717", "ReviewID": "UR77580799", "Content": "We stayed at the Fairmont for 5 nights and it was excellent. Good amenities are easy to find in hotels these days, good people are not....the staff at the Fairmont is wonderful. The views from our room on the 19th floor were amazing and the terrace pool is beautiful, especially at night.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockwall, Texas", "Title": "“Special hotel AND a great location!”", "Author": "txmasonmom", "ReviewID": "UR75327389", "Content": "The Fairmont Hotel is absolutely wonderful! I visited for 1 night with my mother and my sister. As soon as we valeted the car and walked into the lobby, we were in heaven! It is a beautiful lobby and the service at check-in was wonderful. The lobby is very big and opulent; plush carpeting is throughout all the common areas on the first level. The bar area and Pyramid restaurant are right off the lobby. The terrace level includes a huge outdoor pool and garden area. It was all very lovely. The one flaw to this hotel that we found was no indoor or outdoor hot tub. We definitely were wanting to enjoy a relaxing night sitting in a hot tub and the cool pool (which is absolutely fabulous with 100 degree weather) wasn't inviting or relaxing at night with kids everywhere. Don't get me wrong, we love kids and left several at home with their dads for the night. This is definitely a kid-friendly hotel which is sometimes hard to find in a downtown location. The hotel room was wonderful, well appointed double room with a nice large desk, several lamps and reading chair. The bathroom was very nice with granite counters and rainshower shower head. The valet attendants were all very friendly and everytime I called for the car, the lady I spoke with on the phone was wonderful! The fountain place building next door to the The Fairmont has a lovely area to sit and enjoy especially with all the cypress trees and fountains! We visited the 6th floor museum and Dealey Plaza. The museum and surrounding area was an easy 5-6 blocks away along with all the restaurants in the West End. The Fairmont is now my go to hotel with I'm looking for a hotel in Dallas!", "Date": "August 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Nice stay, Front desk staff friendly, pool, and service was wonderful”", "Author": "endless_summer1966", "ReviewID": "UR74914109", "Content": "Upon arriving I felt a bit overwhelmed, Old School Property, elegant and grand. Front office staff very friendly, had small issue with A/C eng dept came up to attempt to fix, front desk moved us to the other side the property quickly. Concierge staff attentive and helpful, and housekeeping was thoughtful. Enjoyed the stay, would book again.", "Date": "August 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Walled Lake, Michigan", "Title": "“Comfortable and clean.”", "Author": "AmyWasHere", "ReviewID": "UR74779396", "Content": "I stayed here for a business meeting with a large group of colleagues. The rooms were clean and the bed and furniture were comfortable. I had a nice view of the city from the 18th floor. The meeting rooms were spacious and the food was good and had many healthy choices, which is unusual for a big meeting such as this. The hotel bar was nice and the bartenders were friendly and quick. I also enjoyed having a Starbucks in the lobby, which also featured friendly people. My only complaint was that unless in a public area, there was a charge for WiFi. Fortunately, by asking nicely the front desk clerk happily took the charges off my bill. I was surprised because a few months ago, I asked nicely at a Ritz Carlton for the same and was told, \"no.\"", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Overpriced/Outdated”", "Author": "gulfcoastgirls", "ReviewID": "UR73968043", "Content": "I found the Fairmont to be a little long in the tooth. The lobby was cool but the upper floor hallways were hot and the room was about 78 degrees even though the thermostat was set on 70 when I entered. When I got to my room the first time, the key wasn't programmed so I had to return to the front desk once again. Forgot my hairspray so I thought I'd pick one up at the gift shop - $10.00 for a $.99 can of Aquanet! The room never cooled down and there was no fan in the room. Made for a long, hot night. The staff were friendly and very service oriented but within the first fifteen minutes, I had to tip the Head Valet, the Bell Boy and since I was not allowed to go to my car that was parked in the garage to get my laptop, I had to ask someone to get it and there went another tip. The restaurant was very overpriced, a breast of chicken with a 1/4c of lentils = $20 plus tax plus tip. Should have ordered a salad via room service as there really weren't a whole lot of options close by that I could see. The best part about this hotel is that it was a block and half away from my early morning appointment, other than that - not impressed.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Magnolia, Arkansas", "Title": "“Over priced for service”", "Author": "mulerider", "ReviewID": "UR72646846", "Content": "Stayed at the Fairmont in Dallas a few years ago . My wife was in a pagent and it was there. Was given wrong room one bed for five people and they would not move us. Grease from the door hinges got all over one of the dresses and had to get nasty with the manager before they would dry clean it. When needing to go out to pick up odds and ends the staff had no clue as to how to get anywhere. The pool is located on the roof top which my kids liked but it stayed dirty all the time. Upon checking out the parking atendant gave me the keys to my car with the alarm device in three pices and all they said was sorry . If you like the glitz and overpaying for it this is the place for you.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chattanooga, TN", "Title": "“Excellent property but those who work here need lessons on customer service!”", "Author": "TNLZ", "ReviewID": "UR71926553", "Content": "I stayed at this property to attend a family function. We made advance reservations and made several inroom requests. On the day of checkin around 8pm i waited over 40 minutes for Eric and the manager in training to check me in. I was not off to a good start. I had a 7 week old baby that was needing to be fed and we waited in the lobby as a room was being found. I was very disappointed. To say the least my first 24 hours was filled with a very disappointing glitches and errors and problems. I requested a meeting with the hotel property's management.. I have to say Once I spoke with him he tried everything to make up for the bad experience. I really appreciate all his efforts and was able to enjoy the rest of my 4 nights at this property.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Midland, Texas", "Title": "“Excellent service, excellent location, excellent stay”", "Author": "awrootbeer63", "ReviewID": "UR67980548", "Content": "We had never stayed at this hotel before but chose to stay there after receiving a special offer via e-mail. Our charge was $99/night incluing valet parking. Upon arrival, we were greeted by the most friendly staff and had an easy check in. The motel itself is centrally located to downtown and is convenient to many attractions including Stephen Pyles restaurant, the World Aquarium, The Museum of Art, Fair Park and nearby access to Interstate 45 which connects easily to the rest of Dallas. The room was clean, spacious with very nice accomodations and comfortable bed. The motel is absolutely gorgeous, with a focus on modern art for their lobby area and the pool area is breathtaking in the evening with all the lit up skyscrapers as your view. Lounge area is open to the lobby and has lots of activity without it being packed full of rowdy drunks. It was actually the first time I enjoyed the lounge at a hotel. The service was prompt, friendly and warm in all areas of the motel (including lounge). Just beware...since this is a beautiful motel numerous weddings and celebrations take place there. I am sure the reason we received such a discount is because there were five weddings and two graduation celebrations scheduled during our visit. However, the motel in general is very quiet on the room floors and the only inconvenience we experienced was at valet parking (they were very busy!). But patience and kindness goes along way and, eventually, service is provided by a very friendly staff. Or better yet, schedule your arrival/departure to accomodate. So before you stay, check on the scheduled events and get a discount if you can...paying less goes a long way in making a person more accomodating. In the end, I can't wait to go back...I've stayed at a lot of nice motels but the service at this one stands out and makes me want to return. This place actually has their customer in mind!", "Date": "June 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlotte", "Title": "“Excellent Service”", "Author": "lchjr", "ReviewID": "UR65620846", "Content": "We stayed three nights here, getting a bargain weekend rate. I was struck by how service-oriented the staff was (from the various concierges to the valets and bellmen). With the Fairmont name, I had been concerned that the overall feel would be formal and snooty. But it was totally the opposite, such that on the last night I made a special effort to express our gratitude to the night manager. Everybody was very friendly and engaging, and every question or issue that we had was dealt with expediently. Even a woman from the accounting department helped out when we were going to be late for a dinner reservation because our streetcar broke down. Our 17th floor room was fine, although in a few spots showed some aging. The elevator system works very well---even as far up as we were, we never had to wait long. The lobby area is elegant. The location is in the Arts District just a block or two from several major art museums, and within a 10 minute walk of the West End entertainment district and the downtown hub. There are many good restaurants nearby, or you can take the free streetcar a mile or so up to the trendy Uptown district. Another plus is that the hotel is easy to find and access if you're driving. Getting out of town is easy---just one block over and you're on an expressway. Parking is valet only, and we never had to wait for our car. The hotel's fitness room was just OK, but the outdoor pool area is very nice, a large area with lots of foliage. As expected, given the hotel's weekday corporate crowd, the prices in the hotel's restaurant were very high, but we never planned to eat there anyway. We ordered a glass of port one night in the bar, and all they had was one for $20 a glass---ridiculous! We passed. In addition to the restaurant, there is a Starbucks in the hotel, so you can get some muffins, coffee and juice (but no orange juice) there for breakfast. In summary, this hotel proves how important a positive, friendly attitude by the staff can be to the overall guest experience. Our experience with the Fairmont was great, and the special weekend rate we got was an incredible value..", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Where to Stay with Wife for 8 years of Marraige”", "Author": "wescooling", "ReviewID": "UR63695032", "Content": "Staff was very friendly, checked into the hotel within minutes we had our card to get into room very quickly. Beautiful view of Downtown Dallas. We stayed in the North Tower. Had a bottle of champagne in our room upon arrival from the staff. Staff was very kind, helpful, and best customer service I have ever seen from a posh hotel possible. If you are on the fence between choosing this hotel over another chose the Fairmont you will not be sorry. Lastly, scored some huge points with the wife staying at this hotel. Customer service, fast service, nice hotel guest and staff, and great intangible products from the Fairmont.", "Date": "May 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hartlepool", "Title": "“A hotel that wants for nothing”", "Author": "lindi3", "ReviewID": "UR62793642", "Content": "An excellent hotel. Very central to Dallas. Staff are incredibly friendly, helpful and knowledgable about the local area. Nothing was too much trouble. Rooms were well decorated and attractive, the beds big and comfortable. A beautiful terrace which is perfect for relaxation and allows great views of the city. Highly recommended!", "Date": "April 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cable Beach Broome Western Australia", "Title": "“Great Hotel - Pity they have theives working for them!”", "Author": "MonsoonalBlue", "ReviewID": "UR62706471", "Content": "The hotel to stay in was wonderful. My negative comments pertain to what happened afterwards. My 10 year old daughter left her bag behind in the room. On arriving in Washington we phoned the hotel to advise them of this. They had found her bag, but BIG SURPRISE - her camera, cash and Nintendo magically disappeared. Hotel was nice enough to forward what was left to Waldorf Astoria New York - thank you. The explanation was ordinary (including - staff are screened and checked blah, blah, blah). The fact is you have a theif working for you - and unless you install airport style xrays on your staffs baggage and person when leaving the hotel - don't kid yourself that it didn't happen - and I hope for future guests you have implemented some changes, because clearly whatever you are doing doesn't work.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Edmonton, AB", "Title": "“Great location but rooms need some TLC”", "Author": "Bastion123", "ReviewID": "UR60655490", "Content": "The location of the hotel was great, right next to the trolley which we used a lot and within walking distance of many sites. Upon check-in we were charged an additional $50/night for a 'just-in-case' deposit...I've stayed at numerous other Fairmont properties and never had to provide an additional deposit, so keep that in mind when you are checking-in, but the front desk assured us that the $300 would be reversed from our credit card within a few weeks...thanks guys. When we got to our room, we noticed that the bathtub had what appeared to be blood/coffee/? splattered all over it! We were given another room but this didn't leave us with a good feeling. The room was a nice size and had a great view but things like the wallpaper peeling off, baseboards being full of dust and no fan in the bathroom causing a mold-like smell to be unleashed whenever you showered left a lot to be desired. The first night I had problems with my key. I went to the front desk to get it reset which, apparently they did, but it still didn't work. I went back down again to get a new card but instead was given a lesson on how to work a hotel swipe card and was told that security had to let me into my room and to go up to my room and wait by the door for them. After waiting a while, security finally came to let me in. They said that my card was faulty and needed to get a new card from front desk...this is what I wanted in the first place!!! Also has trouble with the tv...it wouldn't turn on. After a call to front desk and another lesson from them, this time on how to turn on a television the finally sent up their 'engineer' who dicovered that the cables had been unplugged from the back of the tv. The bell staff and concierge desk were the best part of the hotel...extremely helpful and knowledgable!", "Date": "April 7, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto", "Title": "“Great”", "Author": "MrWonderfulToronto", "ReviewID": "UR60358578", "Content": "We had a suite and it was fab! Great concierge by the name of Philip.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Location is fantastic if you like walking to the Art Museums”", "Author": "travelerstyle", "ReviewID": "UR59872253", "Content": "We were only in town for a couple of days passing through and wanted to be close to the Dallas Museum of Art and the Nasher Sculputure Center which were both wonderful. The front desk staff not very friendly, however the bell staff was very efficient, accommodating and friendly. Dated bathroom such as small tubs and obsolete WC however very clean. Room service was a disappointment with both service and food lacking in taste and value for $100 dinner for myself and an 6-year-old. Upon checkout the doorman was friendly but service was very slow.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Very helpful staff”", "Author": "H_SOHongKong", "ReviewID": "UR58975379", "Content": "I needed to attend a conference at Dallas. Prior to the trip, I communicated with the hotel and its chef concierge did supply me valuable information regarding internet service and transportation to and from the airport. During my stay, the chef concierge helped me to collect my lost lugguage and booked a shuttle for my return trip. I am very satisfied with the staff service.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“comfortable bed and friendly staff”", "Author": "cambridgecate", "ReviewID": "UR58410392", "Content": "I went to the Fairmont for a conference and was very satisfied. The staff were incredibly friendly and helpful from the second I arrived. There was not a hotel shuttle from the DFW airport and the front desk recommended an express shuttle that I never saw at the airport. Plan on taking a cab or driving to the hotel. The room was a decent size and it was clean. It had almost all of the amenities I needed including an iron, a hairdryer and a sizable desk. The desk chair left something to be desired and the extra charge for an internet connection seems odd at a conference hotel. I ordered room service for breakfast the first morning and it hit the spot. Even the healthy breakfast had generous portions although it should for the price. The conference food was also quite good for such large scale service. The view from the 4th floor was nonexistent, so request a higher floor if that is important to you. There was a bit of noise from the hall outside and housekeeping is persistant, so use that Do Not Disturb sign! The 4th floor terrace and swimming pool are a lovely spot to get some fresh air although it wasn't quite swimming weather. The best part of this hotel was the bed. Do not lay down if you are not planning on falling asleep immediately! I never sleep well, even at home. If there was a way to smuggle that bed home I would have done it!", "Date": "March 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Wonderful Upscale Hotel - Centrally Located”", "Author": "hotelcritic10", "ReviewID": "UR58376988", "Content": "I stayed here on business. The rooms were spacious, clean, beautifully decorated...a wonderful room. Pillowtop mattress was comforatble and the pillows were nice, although the sheets were no very soft. The bathtub was on the shallow side for those interested in a long hot soak...ok, but not great. There was only one available plug in the desk area, a common problem. And the internet was not free - also a problem in my mind. The only other issue, is one that haunts every hotel on the market these days, which is the presence of LED lights which light up the room at night. The placement of these LEDs (smoke detectors only - no clock or thermostat LEDs here) wasn't that bad. But I was woken from a deep sleep and opened my eyes to stare into one. I have been in hotels where this is a major problem - just a minor one here. The location was very nice. A short walk to alot of restaurants and the art museum. Even though you are surrounded by office buildings, there is a lot of architecturally interesting things to see. For example there is a water park next door unlike anything I've ever seen in an office building city scape, and a nice little zen-like park right across the street where the sun streamed in late in the afternoon. It was March and warm in Dallas, and I came from cold and snowy PA, so getting to sit out and soak up a little sun was a nice thing. The breakfast buffet and meals from the menu were very good. And I had a banquet-style lunch at the conference I attended which a nicer banquet meal than I've ever had anywhere. The AA stadium and opera house are a short drive. If you want the perfect downtown hotel experience, this would be it for my money.", "Date": "March 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Excellent”", "Author": "aesb0405", "ReviewID": "UR57964719", "Content": "A Nice place to get away, it makes one feel pampered! I would never hesitate to stay at another Fairmont Hotel. It is very luxurious and well worth the money spent! They anticipate everything one would need such as offering massages, restaurants, gift shops, and postal services just to name a few.", "Date": "March 7, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“excellent”", "Author": "LilianaN1", "ReviewID": "UR57360129", "Content": "perfect location high standard services. Good food also", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Bathrooms a little out-dated.”", "Author": "Traveling-Roo", "ReviewID": "UR55678928", "Content": "I stayed at the Fairmont Hotel - Dallas for a sales meeting with my company. The hotel room itself was very cozy and a nice size. The bed was comfortable and the TV was a nice flatscreen. The one thing that seemed strange in this nice hotel room was the crummy bathroom. After waking up feeling like a mature adult, I ventured into the bathroom and had a time warp into my college days. The toilet looked like something that belonged in a public bathroom and the shower head reminded me of dorm showers - you need to block your skin so as not to get seared by the spray! Maybe I'm being picky but when you walk into a room where to unlock the door all you need to do is wave your key in front of the lock you would expect the bathroom to be a little more 'up to date'. All of that being said, the room service was prompt and tasty. The meeting rooms were very nice and the hotel was very accomodating for our extremely large group. Everything was in either walking distance or a short cab-ride away. One quick tip - become a member of the Fairmount President's Club to get free internet access while at the hotel.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Humres32", "Title": "“Mixed Review”", "Author": "Humres32", "ReviewID": "UR53794444", "Content": "I booked this hotel via Priceline for $97/night. Given what I paid, most of my experience was very good. The room was nice. We were close to the elevators so we could hear faint sounds constantly, but it was not imposing. The bathroom was a little small, but it was clean. The concierge was very helpful. He recommendend Y.O. Steakhouse where we had a good lunch and RJ's (Mexican) where we went to dinner one evening. I highly recommend RJ's! The food and drinks were fantastic. Other positives to this hotel -- it had a Starbuck's in the lobby and it is very close (about 5-6 blocks) to the West End where many restaurants reside. The West End is also where the 6th Floor Museum (aka The Book Depository) is located. We had an easy walk to the West End and also to the American Airlines arena to catch a hockey game. Ok...here is where I have to point out a MAJOR flaw of this hotel. The bar and its service were abysmal. We had to beg for service. We went there on 3 occasions and each time it was the same. One night the couple next to us got up and walked out without ordering anything because they were tired of waiting. One afternoon we were the only ones in the bar. We went up to the bar to order our drinks (we had learned our leason from the night before to not wait on them to come to you). We sat down at a table and enjoyed our drinks. Do you think the bartender checked on us even once? No. And when they are fairly busy (Fri/Sat nights) you are definitely better off going to the bar to get your drinks, otherwise, be prepared to wait. Although even getting your own drinks could be delayed. When we went to the bar one night and the service was also slow there, they tried to say they weren't supposed to give more than 3 drinks to a single customer. Ok...then get a good waitstaff! Also, their drinks are not cheap and the pours are not generous, so if you can go somewhere else for drinks, I'd highly recommend it.", "Date": "January 18, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“The Fairmont”", "Author": "ElizabethM6", "ReviewID": "UR53049973", "Content": "This hotel is gorgeous and has all the amenities you could ever want. The service is exemplary. The location is convenient and centrally located.", "Date": "January 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“To Be Expected”", "Author": "MachitaMeg", "ReviewID": "UR51693191", "Content": "The room was nice and clean. The lobby was beautiful and a starbucks right off the lobby. Would recommend. Very busy w/conferences though", "Date": "December 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dallas", "Title": "“BEST HOTEL EXPERIENCE YET!!”", "Author": "Danielle91", "ReviewID": "UR51463713", "Content": "My husband and I stayed here for our anniversary and we had the best experience. The price was excellent and the service we received was even better. We stayed at one of their gold rooms and from the moment we arrived we were treated especially well. We also had dinner at the pyramid restaurant (at the hotel) and again, received the best treatment! We will defiantly be staying there again, anytime we are in downtown Dallas.", "Date": "December 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Orlando", "Title": "“Very Poor for a Fairmont”", "Author": "BusyBizTraveler20", "ReviewID": "UR50152875", "Content": "1. Missed wake-up calls 2. Missed package delivery 3. Banging plumbing 4. Indifferent/Surly Front Desk Staff and Night Operators 5. Food quality on Thanksgiving Buffet was just so-so and service was slow 6. Internet is $15.10 a night - outrageous! and worse,their internal internet server flashes a toolbar on your screen every time you open a new page 7. Parking is $21.00 per night 8. Restaurant staff tried to be helpful.", "Date": "November 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "North Carolina", "Title": "“A pleasant stay downtown.”", "Author": "Lee S", "ReviewID": "UR49266948", "Content": "Mostly positive two-night stay at the Fairmont. Great downtown location was within easy walking distance to the West End. Particularly enjoyed the bouncy carpet and great bed. Common areas nice but did not visit the in-lobby bar or restaurant. Efficient elevators. Quick response and follow-up when my tv had audio but no video. Nice bath products. $7.50 bottled water in room was a joke. Missed a bath fan-my pet peeve. Also searched on site and adjoining local area for local newspaper but none to be found. Concierge desk not staffed when I could have used it. Did reach behind desk for area map. Overall a pleasant stay.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Anniversary trip. Overall nice stay.”", "Author": "Member_Too", "ReviewID": "UR49225692", "Content": "We stayed for one night, 11 years to the day of our wedding. I tried to get the same room. They did their best to accomodate us, but there was en error on my part on the room number (not the name of the suite), and we ended up on the opposite side. They were very nice and tried, but our room was already booked. Awwwww. This hotel is very nice for an older hotel and is very close to major attractions in the heart of downtown. Walking distance to the arts district, close to West End and American Airlines Center/Victory Park, etc. The rooms while being older are nicely appointed. The suites have small bathrooms! The Terrace Level pool and herb garden is a nice touch. A (relatively) calm haven in the busy city. Be advised that it is close to a highway, so you may hear traffic noises, sirens from a fire station a couple blocks away, etc. The lobby areas are nice and the Pyramid Grill was nice the last time we were there a few years ago. Valet service was prompt and courteous. All in all, it was a good stay and nice to be back there after all those years. Maybe we will return and try again for the 15 or 20 year!!", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Fairmont very pleasant & comfortable”", "Author": "NYnyvisitor", "ReviewID": "UR48695471", "Content": "We spent a weekend at the Fairmont and found it very pleasant and comfortable. It is rather like a very nice old-fashioned hotel in ambience, with modern amenities. Our room was very good, with expansive view. The only particularly disappointing thing was breakfast in dining room: buffet food was cold, stale and pretty tasteless.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Falls Church, Va", "Title": "“Great hotel if you get a good price”", "Author": "Nads82", "ReviewID": "UR47110286", "Content": "So I stayed here for a weekend night with some friends. The lobby was nice and quite impressive but the room wasn't that clean and the hallway was in need of some serious renovations. The pool was fantastic. with a great view of the city The location was excellent. I some how got a fantastic deal on the hotel off the Fairmont website as a AAA member - $89. It was overall a nice stay and the bath robes were a nice treat.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Gore, OK", "Title": "“Wonderful but pricey”", "Author": "loldreamlove", "ReviewID": "UR46467387", "Content": "I loved staying at the Fairmont. One thing though, be sure to have backup cash after checkout. The minibar in the room is super pricey. On top of that WiFi is not free. It's 13.00 for 24 hours. Most cheaper chained hotels have free WiFi and with the price of the rooms, WiFi SHOULD be included. On their website, it's listed as being available but they do not tell you it's free. The Pyramid bar and restaurant in the hotel is not very good for the price. I would recommend this hotel if money was not an option. Otherwise, look elsewhere.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Good location downtown”", "Author": "mbar2009", "ReviewID": "UR46241692", "Content": "We have stayed at Fairmonts all over the US. This one is one of the older Fairmonts, but still very nice. We had a suite which was definitely very spacious. We notified the front desk that it was our anniversary prior to arrival, and we were greated wtih a lovely dessert sampler with Happy Anniversary written in chocolate. That was a very nice touch.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Moraga, California", "Title": "“Pretty darn nice, especially if you get one of the updated/bigger rooms”", "Author": "EastBayTraveler", "ReviewID": "UR45706155", "Content": "I have stayed at the Fairmont three times in the past three months. Once I got a kind of tired room in the south tower. The second time I got a club level room in the north tower (verrry nice). The third time I got what looked like an updated room in the south tower. Things I like: the first and third rooms; the club lounge food, drink , and kind hostesses; the fact the bellmen and front desk staff remembered me on my third visit; the lobby was a comfortable place to wait to meet people or just to hang out and read; room service got my food to me quickly, and it was tasty and hot; the mini-bar is well-stocked; the bed and bedding were very comfortable and nice quality-feeling; bathroom is good-sized and the towels are above-average; the wireless was easy to access; nice TVs; the bartenders were super-nice, one even made me a glass of lemonade from scratch (it was outstanding!). Things that were misses. The \"business center\" is incredibly over-priced ($30 to receive a small UPS box that held two binders, and then the shipping people took forever to bring it, finally the cashier in the business center went to get it). I think the restaurant menu could be a little broader, and that the breakfast buffet is ok, but could have more variety and be presented more attractively; after 10 pm or so, if you call room service, you get the hotel operator, who then has room service personnel call you back. My room had some sort of ventilation thing that I couldn't control, so there was quite a bit of white noise; it didn't bother me, but light sleepers probably would not like it. On balance, I think this hotel has a lot of good qualities, and I was very comfortable staying here, especially when I had the nicer rooms. The first visit was a little underwhelming.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Plymouth, Massachusetts", "Title": "“Best deal for upper end hotel in Dallas”", "Author": "jerryedw", "ReviewID": "UR40629970", "Content": "I have stayed in the Fairmont three times in the last 2 months. I compared prices at other hotels (Mansion on Turtle Creek, Ritz Carlton) and found prices to be half as much. Stayed in the \"Gold\" rooms with complimentary club room. Over all an outstanding value. Only negative was the restaurant (Pyramid) which was substandard.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Penticton, BC", "Title": "“Great Place to stay”", "Author": "boborr", "ReviewID": "UR38547104", "Content": "We visited Dallas for the Paul McCartney concert and stayed at the Fairmont. Would go back again,rooms were clean,service was good. Good lounge area,drinks very pricey though,not a surprise given it is a downtown hotel.Pool area was great,it was clean,good after a day around town. Very comfortable bed too. Maybe the only issue was the air conditioner was a little loud at night,but not a big deal.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "colorado", "Title": "“Make sure house keeping doesnt make calls from your room!!”", "Author": "vonooca", "ReviewID": "UR38247505", "Content": "I enjoyed the hotel untill i checked out and went to work. I noticed the one day I let house keeping in to clean someone had made a phone call from my room. This was the first time I traveled for work so I glanced at my bill and made sure i had all my reciepts. Ive learned a lesson for that I thank you .", "Date": "August 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Good hotel in a good location”", "Author": "mrchunky", "ReviewID": "UR36733063", "Content": "Stayed on the 'gold floor' as Fairmont Executive Club members. Great breakfast area although slightly standard fare to be had - nice at night to be able to go for a pre-dinner drink there with a tv and a selection of beers, wine etc. Honour bar in operation which was a great touch. Friendly and efficient staff. Bar downstairs a pretty typical hotel bar - stopped serving fairly early though after we had been promised a late license. Room a good size and well laid out. Nespresso coffee machine and Ihome docs for music was a nice touch. Pool area a bit dated and service out there almost non-existent - I had to find a phone on two occasions (in 3 days) to call to ask for someone to stop by. Nice staff though for the most part.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Austin", "Title": "“Fairmont Downtown Dallas, Could be Better”", "Author": "tinsel57", "ReviewID": "UR35417111", "Content": "I was excited about our weekend trip to Dallas, My 25 year old daughter had purchased concert tickets for me as a Mother's Day gift. I thought I would treat her to a night at the Fairmont. Being a travel agent I love the opportunity to preview hotels so that I might add them to my arsenal of suggestions to my clients. I was looking forward to seeing what the Fairmont had to offer. Though the Dallas traffic and bumpy roads are never delightful, the location of the Fairmont offers easy access to major interstates and many downtown options. As expected, there's no parking at the hotel itself but you can find parking garages within walking distance, or, as many do, use the valet system at a cost of $21 per night. It's just plain easier and if you're a woman alone, especially traveling at night, this might be the suggested option. Car drop off didn't take long and we wheeled our small bags into the lobby. It's less than grand, looking slightly dated but we pressed on. We received a lovely warm welcome at reception and in no time were on our way to the 15th floor to our room. The room overall, was nothing to write home about. Drab. But I had expected this. They rarely give travel agents the best room in the house. Great view with really fabulous window darkening curtains that really do work. The highlight was the bed. One of the most comfortable I have ever had. High marks here. Granite top night stands. A LG flat panel TV which was not functioning. Turned out the cord had been pulled from the set itself but they sent someone up to fix it right away. Three phones, one on the desk, one on the nightstand, one in the bathroom. Just incase you can't walk three feet to reach a phone, I guess! There is a small coffee pot with choice of regular or decaff and a few tea bags. A huge locked honor bar where A rice crispy treat was $3.75. Fiji water, $7.50 a bottle. Not having time to run around looking for places to eat, we ordered room service. A simple meal, hamburger and chicken roll up, both came with french fries and a pickle. This was delivered on a cart, not tray, and rolled into our room. Very nice service at a cost of $47, with ice water to drink. Morning brought quick check out and the bag boy collected my bags from reception while the concierge desk printed out my directions to find my way back onto the interstate. Our car was waiting bags were loaded and off we went. It wasn't until I returned home that I noted one bag was missing. It was a small canvass monogrammed tote that luckily, contained nothing of value however, the bag was brand new and I really wanted it back! A call to the Fairmont proved fruitless. No one located my bag, which would have easily stood out in the crowd. Nothing was found in lost and found, nothing at the bell station. Somewhat disappointing but not a huge loss. Would I stay again? Yes, but mainly because I get a Travel Agent's discount and the price I pay is an exceptional value. It's not the Fairmont of San Fran or Hawaii and while the staff tries very hard, there's just something off the mark here for a Fairmont. I had expected more because it's a Fairmont. That being said, the location is excellent, the rooms are very clean, the bed exceptionally comfortable. Staff was accommodating and very polite. It just needs the Fairmont Wow! makeover.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austin, TX", "Title": "“Solid location for downtown”", "Author": "Pecksonthego", "ReviewID": "UR33975451", "Content": "My wife and I just returned from a quick trip in Dallas over the fourth. We enjoyed the hotel with a great rate ($90) for the slow weekend. Had a couple good martinis in the hotel lobby bar. The workout room had recent cardio and weight machines. Small details such as a ceiling panel missing in an elevator and a plastic coating on a ceramic tub were very minor. $21 dollar a day valet seemed a little steep.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“We loved it!”", "Author": "BostonArmywife", "ReviewID": "UR32885543", "Content": "While not the nicest hotel we've ever stayed in, they pay attention to the details which is what made our stay such a nice one. Little things like super comfy beds, nice sheets, great water pressure in the shower, robes, HUGE rooms in our suite, water pitchers poolside, are just a few of the things that we enjoyed and we've missed at some hotels despite a higher price tag and star rating. Some of the decor was a little outdated, but it was classy and not tacky in any way, and it certainly didn't affect the things that matter most to us. The pool is great - much bigger than some we've seen in major cities which allows you to find a quiet corner even if there are rowdy kids splashing around but it's not open year round so check with them first. Some reviews commented on the staff but we had very little contact with them which is just the way we like it. They were there (and very accommodating) when we needed them but not in our faces. The location is perfect if you're interested in the JFK stuff, Market Street restaurants, and the arts district, as well as some of the nicer restaurants. Valet parking is a little steep considering you can park in any of the local lots for $5 a day as compared to $21 at the hotel but at least we knew our car was safe. We'd definitely stay here again, and we'd probably stay in a suite again although we certainly didn't need all that room .", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Portland", "Title": "“Stay on a GOLD Floor”", "Author": "PDXStocks", "ReviewID": "UR32811903", "Content": "Having read some previous reviews, we stayed on a newly remodeled Gold floor. Our rate was $139 and we also belong to the Fairmont President's Club. The rooms are well appointed and updated in a neutral tones. We had a corner king room with excellent views in two directions. The food presentations in the club lounge are excellent and second only to the Ritz in quality. The club rooms at other hotels nearby are nowhere near the quality of the Fairmont. The restaurant Pyramid is very well reviewed in the Dallas Press and currently running a four course $40 prix fixe menu to celebrate the Fairmont 40th Anniversary. It's a wonderful offer. The Fairmont has an excellent and quite large gym along with a large outdoor pool. Given their normal rates, it pays to do a little shopping online for specials which are easily had in this economy. We enjoyed the rooms, our incredible bath robes, free internet, soft down pillows etc. It's all a lovely experience. There is twice daily maid service and with one phone call we had anything we requested without waiting any longer than 5 minutes. Very impressive. We were surprised by how quickly the valets had the car each time we called, even with the hotel being quite full and handling three weddings that we counted. Don't worry about the previous people who seemed to have numerous complaints for one wrong or the other, we did not experience anything close to these experiences and again, I would do a little a shopping online and definitely book a Gold level floor it is well worth the extra amount you'll pay.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Boston", "Title": "“Needs to updated.....”", "Author": "ajjl57", "ReviewID": "UR30206103", "Content": "I'd pass. Really looks like it needs an overhaul. Pool was not yet open. Our suiyte was large but the decor is old and dingy looking. NOT a 4 star hotel.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“The Fairmont is about service--not here”", "Author": "teachlaw1", "ReviewID": "UR29876792", "Content": "We had a terrible time with the valet at this hotel. The comment was made that they did not know if I was coming or going. My response was, does it matter? The hotel was fantastic. The room was great and the hotel was wonderful. Call before you go, we went looking forward to a great afternoon at the pool. No one said anything about the fact that it was drained and not a single pool chair or chaise to be found. Disappointed my son a great deal. Would stay here again, but would make sure that I called and asked if the hotel was providing full service.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "north america", "Title": "“I've stayed in nicer Holiday Inns!”", "Author": "duckfisney", "ReviewID": "UR29698428", "Content": "Second buisness trip to Fairmont Dallas in 3 weeks, both stays were bad. First stay room OK but awakened by engineering pounding on something in the hallway at 7am! complaints to front desk did no good. Also Valet parking was terrible took about 45 minutes to get my car after calling 20 minutes ahead! Come on people some of us have to get to work! Current trip I am in 4th room to finally get something marginally acceptable. First room had bad mildew stench, set my allergies off just opening the door, actually just getting off the elevator. the whole south 4th floor smells bad. Second room had a big wad of tissue like a spitball stuck to the wall by the bathroom, yellow water in the toilet and lots of missing towels. The third room had unbelievably a huge cigarette burn, ON THE BATHTUB! There were actually many burn and melt marks in the tub! Nice! My request to get a manager to come to my room and look at the tub were ignored but the front desk took me on a tour of available rooms to find clean one. Some luxury hotel. I stay in hotels usually 230 to 260 nights a year, I have rarely seen hotels in such run down condition. Maybe I have been lucky for the last 20 years.", "Date": "May 10, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Upper Valley", "Title": "“Upscale Experience”", "Author": "mmurarka", "ReviewID": "UR29687569", "Content": "Really great experience. Room, Staff, Location.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Iowa Park, Texas", "Title": "“Enjoyed my stay”", "Author": "PrincessEthel", "ReviewID": "UR29203503", "Content": "Just returned from a conference at the Fairmont. The staff were very professional and acknowledged me even when just passing in the hall or lobby. Very easy check in and out. The bed was comfortable, spacious and clean. There were some signs of aging in the bathroom and it certainly could use a new showerhead. I got a great promotional rate so the price was right. The conference facilities were also very nice.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“Nice Hotel, I would absolutely stay there again!”", "Author": "Jpw62", "ReviewID": "UR28981607", "Content": "I just got back to Boston from Dallas today and as tired as I am, I wanted to write this review. I am VERY picky person when it comes to cleanliness and safety and The Fairmont is a pretty nice hotel, the room I was in (King bed) was a good size fairly update and there was a few dumb things like the pool being drained and re-tiled, flat panel tv was nice, and the room was clean- except I have to be honest, they do need to vacuum around the bed frame legs... anyhow I always wear slippers, but, it was clean, the bed had failry crisp white down feather pillows and blankets, in another review someone complained about the throw at the end of the bed being dirty, I think its the fabric that makes it appear that way...crushed velvet type of fabric. Anyhow, I went to the Hyatt at Reunion Blvd, where my colleagues where staying and it was nasty- the rooms were old and dated, and a street person was roaming the lobby asking for money! The Fairmont is really safe, they dont even allow pizza delivery people up to the rooms, you have to come down to get it. The bellman is an older man and the valet guy as well, both are really helpful and awesome! Checking in was a breeze, but make sure you check your itemized bill, they accidently charged me for 1 day of parking @ $21.00- I called the desk and it was taken care of before I checked out... Check out was so simple, no waiting at all.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austin, TX", "Title": "“Excellent downtown/Arts District location”", "Author": "Austini", "ReviewID": "UR28880412", "Content": "The Fairmont Dallas has an excellent location for the downtown Arts District; 1 block to the Dallas Museum of Art (with, for a few more weeks, the traveling Tut exhibit), 2 blocks to the Nasher Sculpture Center, 2 blocks to the Crow Collection of Asian Art, 1 block to the McKinney Ave. Trolley, just a few blocks to the Dart rail line, and a few blocks to Thanks-Giving Square with its interesting chapel. We got an extremely good, online-only rate of under $100-a-night for a deluxe king room on the Fairmont Web site (one slightly scary catch: it was a pay-in-advance, nonrefundable rate; fortunately, we didn't get ill or otherwise have to cancel our trip, so it did work out perfectly for us, but it still made me a bit nervous). The room was large, well furnished and had a nice downtown view (we could see Dallas' famous, old Mobil Pegasus neon sign from our window). You could find a few little signs of normal wear-and-tear in some of the furniture and fixtures, particularly in the bathroom, but nothing that in any way detracted from our comfort or enjoyment of the room. Might be just enough to disappoint someone heavily fixated on a utterly immaculate 5-star luxury hotel experience, though. The valet parking is a notable extra expense at $21 per day. While I naturally would like free parking, I do understand that this is downtown Dallas and parking is at a premium. What bugged me far more than having to pay extra for parking is that it was valet-only and we weren't given ready access to our car. So, just to fetch something out of the glovebox of the car required going through the valets with an additional 10-15 min. wait (could grow to 20 mins. at really busy times) for them to bring the car around, along with the polite but clear expectation from the valet of a small tip. Quite a substantial inconvenience; I vastly prefer self parking, whether it's paid or free. One other minor annoyance is that the rooms, even the deluxe kings, don't come with mini-fridges. Mini-fridges are available, but only for an additional $25 (that is per stay, thankfully, rather than a per-night charge). Our room would've had plenty of space to inconspicuously place a mini-fridge. Probably a minor item for many travelers, but I must say that it definitely struck me as rather chintzy that a luxury hotel like the Fairmont didn't have as standard an amenity that's now pretty much expected in your average Comfort Inns and Best Westerns. One tip: It's a good idea to go to the Fairmont Web site and join their free \"President's Club\" loyalty program, ideally before making your reservation. As a \"President's Club\" member, you get free in-room Internet access and free local calls, plus expedited check-in and check-out. Since there's no charge to join, it's definitely worth the few minutes it takes to sign up.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Oklahoma City", "Title": "“The Fairmont is AMAZING!!!!!!”", "Author": "charlieswife17", "ReviewID": "UR28320769", "Content": "My fiance and I just returned from a weekend get-a-way to the Fairmont in Dallas, TX. We were in Dallas to see the King Tut exhibit, which was amazing! The Fairmont is just two blocks from the Dallas Art Museum so it was easy access to get there. We had planned to stay two nights, but unfortunately, I became very ill and we decided to check out early. We checked out at 4 pm on Saturday and we were not charged for that night at all!! The staff was awesome and completely helpful. The rooms were beautiful and very comfortable. This was an EXTREMELY nice hotel but we booked via Travel Zoo and got an amazing rate! I can not recommend The Fairmont more!!", "Date": "April 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Dallas", "Title": "“Not as advertised....is an understatment”", "Author": "COBDallas", "ReviewID": "UR25529182", "Content": "My boyfriend and I stayed there for a night as his birthday gift. After being charged $21 just to park, we walked into a very dingy and musty room. There were stains on the throw blanket and the room was nothing like the picture on the website. After speaking with the consierge the day before, I was promised the highest floor available with a good view, but we ended up staying on the 7th floor overlooking a parking garage. In the hotel's defense, I did request a smoking room, so I am sure that is where most of the dinginess and smell came from, but it was overpowering. We had tickets to the Mavs game that night at the American Airlines Center and it was an easy walk from the hotel. We chose to hang out at a local restarant for most of the night after the game to avoid having to come back to the room! It was pretty embarrassing and not at all romantic, to say the least. Again, in the hotel's defense, I did not call and request a room change or housekeeping, had I done so, the hotel probably would have been able to help. The hotel staff is very nice and courteous. I will definitely stick to hotels I know in the future!", "Date": "March 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Dallas", "Title": "“Will never stay here again”", "Author": "IRISHdjt", "ReviewID": "UR24641176", "Content": "Gave me a room with 2 double beds even though I booked a king bed. A/C would not cool the room. TV remote did not work. Bathroom flooded when showering. Staff was abrupt and rude. Valet service was incredibly slow.", "Date": "February 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Houston", "Title": "“Do NOT stay here if you don't like beds that are hard as rocks!!!”", "Author": "dlr25", "ReviewID": "UR24608997", "Content": "My husband and I chose this hotel as a weekend getaway. It was the first time we have been away in quite some time since having our young son. We were really looking forward to spending Valentine's at the Fairmont. The hotel is nice. Ambience is nice. Hotel bar was great. They put us in a quiet area as we requested. BUT THE BED WAS AWFUL. I mean dreadful. It was like a rock with no give. My back hurt so badly. I barely slept the second night. AND, they charged $13.95 for internet usage. AND, parking was $21 per night for guests. AND, they tried to charge me for in-room dining service to deliver chocolate covered strawberries and truffles that were placed in my room BEFORE we checked in and that were part of the Valentine's promotion that we got. Thank goodness the restaurants we ate at (not the hotel restaurant) were awesome. We will not be staying here ever again.", "Date": "February 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Middle TN", "Title": "“Visited Dallas for the Cotton Bowl”", "Author": "tnoccther", "ReviewID": "UR23267124", "Content": "Hotel was at full capacity due to mostly Ole Miss fans in town for Cotton Bowl. Checked in at 5:00 p.m. and had to wait an hour for room to be readied, Manager knocked about 25% off rate for both nights' stay. Have stayed at this hotel 4-5 times in last few years, and never come away disappointed.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Great Service and Big Room”", "Author": "mattmc", "ReviewID": "UR22753766", "Content": "Our stay at the Fairmont was almost perfect. The staff were the most courteous and helpful of any hotel at which we've stayed. The concierge gave great recommendations on dining and things to do in the area and check in and out was smooth and easy. The room (a standard room with two queen beds) was much larger than rooms at comparably priced hotels and we really enjoyed a relaxing time. Two reasons prohibit me from giving this hotel 5 stars. (I won't even mention the $21 a night parking. I realize that this is the case pretty much anywhere, but it's highway robbery. At least the valet service was excellent and efficient). First of all - why charge for high speed internet when you're already getting $120 for the room (not counting parking)? That seems a bit greedy and unnecesary. Secondly, they charged me for a local phone call! It only amounted to fifty cents, but still. In a hotel this nice and service oriented you would think that internet and local calls should be included. Overall though - this was a great stay, we fully intend to return, and heartily recommend the Fairmont to anyone.", "Date": "December 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Professional Staff & Comfortable Bed”", "Author": "patrickstpaul", "ReviewID": "UR22718699", "Content": "I spent one night at the Fairmont during the holiday season and although the hotel lobby had a lot of activity and the entrance was packed with cars and valets (you can only valet your car at this property â€“ about $21/day), the staff was friendly, professional and calm and check-in was quick. My room was in the South Tower and if you overlook the garish hot-pinkish door, youâ€™ll appreciate the neutral ambiance of the rather large room with excellent workspace and very comfortable bed. There is a well-equipped exercise room on the level below the lobby and had the weather been warmer, I would really have enjoyed the beautiful terrace-level (select â€˜Tâ€™ in the elevator to get to the pool) swimming pool and gardens. I imagine this hotel pool is the perfect summer retreat in Dallas. We spent the evening in the Cedar Springs/Throckmorton area of Dallas and it was only a $10-$12 cab ride about 2 miles away (you have to pay a $4 fuel charge â€“ in Dallas? When gas is $1.60? anywayâ€¦) and it was easy to get a cab to and from the hotel. I would stay at this property again and recommend it to anyone wishing to stay in the downtown area. Also, if you have the time, rent a car and drive over to Fort Worth â€“ especially during the holiday season. The stockyard area was decorated for the holidays and had lots of interesting shops/restaurants to explore.", "Date": "December 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“Would absolutely stay again”", "Author": "dnjscheer", "ReviewID": "UR22242737", "Content": "We booked an air/hotel package through Travelocity with the purpose of seeing the King Tut exhibit at the Dallas Museum. Booked a regular King room and were pleased and surprised at check-in to be upgraded to a suite. The desk agent told us that he \"didn't have any King bed rooms left\" so was upgrading us to a king suite. Strange as the bartender later told us they were only at 12% capacity and we never saw a single other guest on our south tower elevators in 3 days. Hey, no complaints! The suite is wonderful. Nice walk in closet, sofas (one pulls out) and eating table in the sitting room with flat screen tv, large desk and sitting table in the bedroom with another large flat screen. The only complaint is with the design of the bathroom where the door nearly hits the toilet. You'd think that in the design of a suite they could've found another couple of feet to steal from the bedroom to make the bath more comfortable. Still, this is NOT a big deal. Service was incredible throughout. Very nice concierges who were helpful as was the rest of the staff. The bar never had more than 4 other guests in it. They told us that this is the low season for their main business which is conventions. Maybe that's why it was so nice and quiet. We were a little grumpy about the nickel and dime-ing that happens with the internet service. $13.95 to connect (wireless or wired) in the room. Then because I don't have a printer, I had to use the hotel's business center to print our boarding passes -- another $7.99 for those 6 minutes. At the price per night, I'd expect this to be less. The restaurant is one block from the museums which was perfect for us, and one block from the free McKinney Ave Trolley which can take you uptown a bit to more restaurants and shopping. The downtown area where the hotel is has zero restaurants for breakfast that we could find. If you don't mind walking, there are several good restaurants within about 1/2 mile. The very pricey but excellent Stephan Pyles is one block away. The Dallas Fish Market is also great (about 1/2 mile). We also walked to the JFK museum, about 3/4 mi. I think, and on the way the Village Corner Bakery is a good breakfast spot. We did this trip without a rental car which is doable but ONLY if you like/don't mind walking...a lot...for everything. This area has little but office buildings. We would stay here again for the service and quality.", "Date": "November 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Even better the second time!”", "Author": "clkc86", "ReviewID": "UR22169093", "Content": "This was our second stay at the Fairmont. The level of service here is excellent. This stay we booked a Gold level room and felt it was really worth it. We had a corner room that was very nicely decorated in a more contemporary style than the room on our first stay. The bathroom door wasn't typical, it was more like a pocket door. There was a HUGE shower that was very enjoyable. The bathroom also had a makeup mirror, which I missed in the \"regular\" room. Still had a big walk in closet. The evening appetizers and morning breakfast were nice. Drinks are available but not included in the price of the room. We enjoyed the in room Nespresso machine as well as the one in the lounge. Before our trip I emailed the hotel for restaurant ideas. The concierge staff responded quickly and very professionally to our requests. They made all our dinner reservations for us, so we had no worries about where to go for dinner. We had one dinner in the hotel's Pyramid restaurant. The service was outstanding. The wine steward was a great help and provided some great information. My husband thought the filet he had for dinner was one of the best ever. My lamb needed a bit of work, but was cooked as I ordered. We shared a charcuterie appetizer and it was a good choice. We didn't order a dessert as the hotel had delivered a pice of cake to our room to celebrate my birthday. Every staff person at this hotel greeted us warmly, and it didn't seem forced as I would have expected. The housekeeping staff left me a thank you note for leaving a dollar tip on the bed every morning and evening. It's hard to find any real problems at this hotel. It is an older property, but the service is more than enough to make up for that. I will certainly stay here again and I will book the Gold room for future stays as well. Thank you Fairmont Dallas!!", "Date": "November 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“You MUST stay at the Fairmont!”", "Author": "FriarBri", "ReviewID": "UR21498925", "Content": "By far one of the best hotel experiences I have ever had. Not sure where to begin because everything was superb. Great location within walking distance of many places. Right around the corner is the fantastic restaurant Stephan Pyles. JFK Museum just a 10-minute walk, as is the entire Historic District with many other restaurants. The staff here goes out of their way to welcome you and greet you every day, from Front Desk people to Housekeeping, etc. The rooms are spotless and well appointed. The beds are so comfortable you might not want to get up in the morning! The hotel bar and restaurant, Pyramid, has great food for breakfast, lunch, or dinner. Or if you'd rather like something light there is a Starbucks off the lobby to get a coffee and pastry in the morning. I honestly cannot think of anything that was negative. I would not stay anywhere else in Dallas.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Barbara", "Title": "“Great Service”", "Author": "Dukekit", "ReviewID": "UR21442112", "Content": "Had a very nice 4 day stay. The hotel is older and if you look closely you'll notice a few nicks and scratches around, but generally nice facilities. Everyone was very nice - front desk, reception, concierge, valet, housekeeping, bar. I was very impressed with the consistently friendly service. Oh, one complaint was the low-flow showerhead. Yuck. But what do I know, maybe Dallas is having a drought. The aquarium was an easy walk (2 or 3 blocks) and was great. The West End neighborhood was also an easy walk and had lots of restaurant options (lot of steakhouses, no surprise, but some other options too). Would definitely stay here again.", "Date": "October 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Nice stay”", "Author": "j'smomTexas", "ReviewID": "UR20877510", "Content": "I stayed at this hotel for 3 nights while attending a conference at the Dallas Convention Center. I was very satisfied with my choice. The service at this hotel is top-notch. My room was very nice â€“ my favorite part was the large walk-in closet. Inside this big closet was an oversized safe that fit both my camcorder in its bag and my camera. The TV was a large flat screen. The bathroom was a little small and the tub and toilet could be updated, but the vanity was very nice. There were two plush robes available to use. I had to call the front desk right after I arrived to report a problem with the toilet flushing properly and someone arrived in less than 10 minutes. Housekeeping did an outstanding job, room service was good, and the concierge was always very helpful. The buffet breakfast was very good, although it lacked a good selection of fresh fruit. I have only two minor complaints about the room. At night you can hear the elevator running. If you sleep lightly as I do, it may bother you at first. I did get used to it. The room only had one electrical outlet that I could access. When I needed to use the iron or recharge my cell phone, etc., I had to get down on my hands and knees and crawl under the desk to plug it in. This hotel is within walking distance to many things, including the Plaza of the Americas, the Dallas Museum of Art, the Dallas World Aquarium, the West End, and the Sixth Floor Museum. I got a special rate of $155 per night and it was definitely a good price. I do think I would be hesitant to pay the rack rate of $300-$400. I only say this because the room is nice but not especially luxurious.", "Date": "October 14, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "texas", "Title": "“Good location-great beds”", "Author": "neicie", "ReviewID": "UR20821683", "Content": "we got a great deal through Hotwire for Texas/ou weekend. the hotel is in a great location-only a few blocks from West End and Victory Park. The lobby was very nice with a relaxing atmosphere in the bar area. we didn't use the pool, but we had a great view of it from our room and it looked nice. The bed was one of the best i have ever slept in. The only downside was parking was $21. that is a bit steep in my opinion. I would stay there again if i needed a downtown hotel.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Fairmont Dallas - the BEST luxury hotel in town!”", "Author": "travelbound28", "ReviewID": "UR17162144", "Content": "Booked one of their new Fairmont Gold Suites via Expedia.com, and was a little worried if the pictures and descriptions were 'too good to be true', but we felt the rate was appropriate for a club level - type suite at a luxury hotel (around $400/night). What can I say... I was SOOO impressed with the entire experience! We were escorted to the Gold floor as soon as we got out of our car at valet, and introduced to our private concierge at the Lounge. We were checked in, had dinner reservations made, and got a snack, within minutes of arriving - WOW! The suite was worth every cent - completely brand new everything. Loved the bed - didn't want to get out ever! Having access to the private lounge was the best part - we made it our 'home-away-from-home' over the next few days. My husband used it to get away from me for a few hours to do some work (ha ha), but it worked out nice for me because I used that time to relax and watch some sappy girl movies. The restaurant was fantastic - food quality, service, wine list - we were happy with everything at Pyramid. The location is perfect - I read some other reviews saying how there is nothing to do in the area, but those people must have been blind! The Dallas Art Museum and Nasher Sculpture Museum are 1 block from hotel, and we even walked to the Victory Park for dinner and a show at House of Blues the last night. Everything was perfect - you MUST stay at this lovely hotel!", "Date": "June 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Houston, TX", "Title": "“THIS is a Fairmont hotel?????”", "Author": "jillhou", "ReviewID": "UR16796069", "Content": "My niece got married at the Fairmont and I wouldn't recommend it to anyone. I suppose the wedding part went ok. The Bride was happy and that is what mattered. BUT if Fairmonts are supposed to be in the upper echelon of hotels, this one falls EXTREMELY SHORT. We arrived after check in time the day of the wedding (about 3:20) and had 2 rooms booked. I would guess there were about 25 - 30 rooms booked for this wedding. One room was ready and the other was not. Same thing happened to my brother, one room was ready and one was not. We had plans to go to dinner before the wedding at a restaurant nearby. We waited in our sons' room for our room to be ready......nothing.....nothing. I finally called down about 4:30 as I needed to change clothes for dinner and wanted my room. They said they would put it on a priority cleaning status and that it would be at least another 30 minutes and that they would call (shouldn't they just bring me my keys???). Had to scrap our plan for dinner and just go grab a bite at the hotel bar. ( Mediocre at best). Mother of hte bride walked by and asked how things were and if we were settled....we told her we were still waiting for our room....she went to desk and got a manager and came back with keys. The room had just been cleaned! So we got into the room about 5:30. A/C did not work well at all. Room was hot even though it was set on 72....there was no way the room was 72. We turned it down and turned up the fan speed. Bathroom temp was unbearable, had to bring my makeup/hair supplies out to the desk in order to have some decent ventilation and cool air. Sons' room was the same as temp goes...as was my brother's rooms. Was a sweaty mess by the time we left for the wedding downstairs.......lovely way to feel! Room was still warm when we came back up.....front desk staff was not helpful. Would NEVER stay here again!", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rockville Centre, New York", "Title": "“Pleased with the Fairmont Dallas!”", "Author": "Landwlkr", "ReviewID": "UR16678046", "Content": "Overall, we were very pleased with our recent stay at the Dallas Fairmont, located in downtown Dallas. The hotel is very clean, and our room was spacious with floor to ceiling windows (room 1910). The pool was good, but not spectacular; it could use a little modernization. I was very impressed with the level of service. The staff, from the valet to the concierge, were all extremely friendly and helpful. I appreciated that they even remembered my name and greeted me on arrival and departure. We ordered room service for twice and were very impressed both times. I emailed Phillip, one of the concierges, prior to our arrival with some questions and his responses were helpful and efficient. Keep in mind that the area around the hotel is pretty dead on weekends. We struggled finding a place within walking distance to have breakfast. We don't travel to Dallas very often, but we would definitely stay at the Fairmont again.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ohio", "Title": "“Recommend as a thumbs up”", "Author": "DeTravler", "ReviewID": "UR16000613", "Content": "This was a Very Good Experience. The front desk personal friendly & helpful, Concierge desk extremely helpful and accommodating, rooms clean & quite spacious, and comfortable beds. The reservation department was informative and easy to work with. The media center had one printer down and it added a minor expense. There is fine dining and food available at the bar area, however there was no moderate restaurant. Definitely would recommend and stay there on my next Dallas trip.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“Exceptional Hotel”", "Author": "Butrfli1227", "ReviewID": "UR15195335", "Content": "The Fairmont Dallas is a great hotel, and for $149/night, a decent value. I highly recommend it to anyone staying in Dallas. Facilities: The lobby is upscale and never too crowded. They have a nice pool & gym, as well as an upscale restaurant. A starbucks opened the day I checked out. Rooms: Very comfortable beds and nice bathroom with ample space. They even had a walk-in closet. My only complaint is that the rooms could be bigger. It was a tight squeeze with 2 beds in it. Food: I ate at a few catered events and it was very good compared to most other hotel food I have had in the past. Service: Was great!! Everyone there was super helpful, room service was a breeze. I even had a small problem with the bill and it was corrected quickly with no questions asked.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Mixed bag: Lovely Room but...”", "Author": "travelsavant", "ReviewID": "UR15174208", "Content": "A long review but trying to be fair as I am normally a big fan of this chain. Went to Dallas for a special art exhibit & just to play tourist & the Fairmont was within 2 blocks of Fine Art museum & had a great rate offer for a suite. Perfect! Then I read the TA reviews and got nervous, but as first night was at another hotel, thought I'd keep the suite for major portion of stay & look it over day before checking in. Did & everything looked great. Upon check-in, suite I was shown was lovely but was advised that the new Gold floor was open and would I like to upgrade. Looked at that suite - wow, stunning! Took the beautiful new suite. Really outstanding decor and club floor was great for breakfast & nightly appetizers. OK, so for the negative: room A/C did not work very well entire stay; if it had been summer, oh boy, room would have been unbearable. Gold floors were still undergoing final \"tweaking\" so there were minor to major inconveniences: no elevator one day-hiked down 3 flights to lower floor; hot, scalding water in bathroom sink one morning (yikes!) and sadly, not very knowledge staff in Gold Lounge (although they did refer us to main concierge for help.) Response to all our daily issues/problems was polite, quick & fixed as much as possible, but some things, just weren't fixable. So, while room was great & hotel is lovely, not sure I'd stay again just because, heat, A/C, water are pretty basic requirements & having inconsistent basic necessities really cuts back on quality of stay. Too bad because the Gold floor is a real addition to hotel.", "Date": "April 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent Experience”", "Author": "marcia0222", "ReviewID": "UR14950272", "Content": "I booked this hotel via the hotel website and came up on a really good deal. It was a 3rd night free deal. So I paid $99 a night for the first 2 nights. The hotel was very nice and a good location downtown. It was actually the weekend of the Dallas/Green Bay football game. The staff was very helpful and I just really enjoyed the hotel. The bed was super comfortable. I would highly recommend The Fairmont, Dallas TX.", "Date": "April 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Repeat Customer!”", "Author": "DarthBane", "ReviewID": "UR14602380", "Content": "I stayed at the Dallas Fairmont 3 years ago, and it's still as good as it was then. Fantastic location...Walking distance to the art district and JFK memorial and plenty of good dinning. Rooms are very comfortable, clean and quiet and the service is friendly and quick. I ate downstairs at the buffet, and it was really good. All food was warm and fresh. Would be nice if they allowed members free access to the business center (internet), but that's a minor thing, and overall you can't miss with this hotel.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“High noise levels and tired rooms mar good service”", "Author": "Faience44", "ReviewID": "UR13816831", "Content": "It sounded like an unmissable opportunity -- a combination of two Fairmont upgrade certificates and a last-minute cancellation at the hotel meant I obtained an enormous king bed suite for the equivalent of $150 a night instead of the $350 a night it should have cost. I should have known it was too good to be true. I often wonder whether the management at hotels actually spend the night there occasionally to see what guests go through. If the Fairmont by chance does this, it's been some time since the last try-out. They need to take a look at this property. First impressions are good. It's in an excellent location downtown and the lobby is as plush and impressive as you'd expect from a Fairmont. The service was good. Unfortunately, the room wasn't the same. It was the size of a small European country with a large sitting room and an enormous bedroom. The furnishings looked a tad tired and for some bizarre reason the insides of all the windows were soaking, so the first noise I head was a gentle drip-drip of water dripping on to the carpet. The bathroom was small and the tub was miniscule, no longer than about four and a half feet, so I had real trouble getting washed. And this in what was undoubtedly supposed to be one of the best rooms in the hotel. Worse was to come. I was on the 21st floor of the south tower in a room that looked out both over a highway and some sort of industrial facility (or a massive block of air conditioning units) which churned out an amazing amount of noise. I quickly fled the bedroom and took refuge on the sofa bed in the sitting room, which of course happened to be next to the elevator machinery. So I slept badly all three nights. Everywhere there are signs of people asleep on the job. The TV turned on with the greatest of difficulty (I had to press the button with both thumbs) and when I called downstairs to ask about the handy \"Internet on the TV screen\" function the person at the other end said \"Oh, I've got a note here, it doesn't work\". According to the room guide you could either have a formal breakfast in the restaurant or something less formal in the lounge downstairs. Nothing was on offer in the lounge for the three days I was there. That said, the restaurant breakfast was very good (as tends to be the case with Fairmont) and I consider $18.50 for an unlimited hot buffet in the morning a great offer. Dinner in the restaurant was pretty good too. A hint -- don't bother paying the daily $20 valet parking charge. There are plenty of parking meters and lots very close to the hotel. If I came back I'd insist on a room well away from the noisy side of the hotel. That is, if I come back. I think I might try somewhere else in Dallas the next time I'm in town.", "Date": "February 24, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Galway", "Title": "“Fair Enough Fairmont”", "Author": "MissyGalway", "ReviewID": "UR13103737", "Content": "We stayed here for 2 nights and had booked a smoking room yeah i know how bad it is but well we were on holidays and the option was there. I found the check in staff quiet abrupt, she growled that firstly she did'nt think they took travellers cheques and that she did'nt have a smoking room because they were busy, fair enough but i had gone to the trouble of phoning to enquire about both issuses and was told neither was a problem. The receptionist stomped around because i had a few traveller cheques to sign and then gave me a key and i had to ask her what floor, i found her attitude a bit crap and i was after an 11 hour flight with stopover and delays. The room was nice but small and the bed was small for a kingsize but squash in and it was comfy. We had a corner room so maybe avoid this type. The bathroom was small but spotless with nice selection of toilitries and towels. Concierge desk was a breath of fresh air very polite and helpful. The hotel itself is lovely a bit of old fashioned glamour in a handy location quiet close to Dealey Plaza and there is tourist office also near Dealey Plaza which was convient . Breakfast outside the hotel is mission impossible,however if you walk towards Dealey Plaza there is a carpark on open ground and on it in a corner is a strange almost invisible little blue and white hut which was fab...looks aren't everything as you stand outside,my husband has a serious food allergy so we can't just eat anywhere. For restaurants there are a few nice ones just 4/5 minutes stroll from the hotel and they are lovely.Not a lot to do downtown at the weekends its a bit deserted. Overall we had a good time ,hotel is nice and well kept", "Date": "January 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Carolinas", "Title": "“Don't Stay Here!”", "Author": "Carolight", "ReviewID": "UR12871746", "Content": "Horrible Experience - booked and prepaid through expedia and was booted out upon arrive due to overbooking. Unprofessional and rude front desk staff - dishonest. Hotel totally run down not worth a 2 star rating. Three Cheers to Expedia staff for great work at finding a wonderful 5 star hotel to replace this loser.", "Date": "January 22, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Very pleasant”", "Author": "AreAnyNamesNotTaken", "ReviewID": "UR12849512", "Content": "This is my third Fairmont and certainly the best so far. Like all Fairmont hotels (as far as I can tell) the bathroom was surprisingly small; however, the bedroom was huge, especially for the miserly $279/nt that I paid for it. The rooms are as dully conservative as you would expect for a business hotel of this type, but they are at least tasteful and up-to-date, not to mention immaculately maintained. The hotel's restaurants and bars are very pleasant and the staff are efficient and charming. There is nothing extraordinary about this hotel, but it is a pleasant place to spend a night or two.", "Date": "January 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "new jerz", "Title": "“Great Location, Great Value for Price”", "Author": "raxxx", "ReviewID": "UR11960410", "Content": "My boyfriend and I booked this hotel for the downtown Dallas location, which turned out to be great... Most other hotels in the area are either much more expensive (the W) or slightly lower end.... Just a note, the West End district (bars, restaurants and shops) is within walking distance, but the Greenville section (tons of bars and clubs, if that's your scene) is not - which is what we were told by the lobby bartender. Cabride to Greenville is approx. 15 minutes, as opposed to 5. Also, if you want to enjoy a nice breakfast outside the hotel, you have almost zero options (we ended up walking the McKinney Avenue \"free trolley\" route - the trolley never showed - to an area where we stumbled upon a French creperie (not my idea of a great breakfast, but it worked). Dealy Plaza and the American Airlines Center are also within walking distance. Above all, we were suprised by the quality of the hotel for the price we paid. For the same $115 a night we would have spent on a lower caliber chain hotel on the east coast (where we are from), we got a higher class hotel, king room, all the amenities you can ask for - perfect for a weekend getaway. maybe it's the southwest economy? either way, i'd recommend the fairmont to leisure and business travelers (also seems close to alot of downtown corportations).", "Date": "December 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "st. louis", "Title": "“Horrid stay”", "Author": "ben01St_Louis", "ReviewID": "UR11287416", "Content": "I just came back from a horrible stay at this hotel and I had a similar experience as the previous reviewer. The room they gave me also did not have a functional thermostat. It was so uncomfortable i did not sleep a wink. Moreso, the fan was noisy and the room faced the highway, thus more noise to prevent any sleep. Front desk said an engineer will arrive, but no one came. No offer to move me to another room because they were \"fully booked\". My being a President's club Premier member did not help things either. I felt that they have given me the worst room possible. Never ever will i stay here at this Hotel. It is not Fairmont quality. I have had better service at a 4-points sheraton. If you are planning to stay here, the North tower has construction going on, so it will be noisy also in the morning and afternoon.", "Date": "December 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Not a star deserved”", "Author": "SeCe", "ReviewID": "UR11115980", "Content": "It was 40 degrees in Dallas and my room at the Fairmont did not have working thermostat. No matter how high I put the temperature it continued to blow cool air. I phoned front desk, they said they would send an engineer but two more phone calls and two hours later - nearly 11:00 pm, no one had come. By then me and family were in bed clothes and ready to retire for the night. I spoke witho nsite manager and he did offer to move us to another rooim, but it was very late, we had unpacked and settled in the room, so I declined due to the incoonvenience. Also, the TV did not have two of the channels shown available. I was disappointed at this high star hotel for not being up to standard and not offering to comp my room for at least one night.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "California", "Title": "“Lots of Older Folks”", "Author": "CrowneRoyalT", "ReviewID": "UR10697231", "Content": "I stayed at the Fairmont for about a week while in town for a business conference. When we pulled up, all the valets were very helpful and pleasant. The front desk was so-so, felt as if they were indifferent. Walking into the room, I was slightly disappointed with the television size and room decor, mini bar fridge was not working, smelt as if something had died in it.. Bathroom size was average, but the amenities were gross. Shampoo, Conditioner, Lotion smelt awful, and felt like watered down products that didnt work to clean, but were there for decoration only. As I was staying there, I noticed most of the other guest were at least 45 or older, so there wasn't noise issues, but just felt like I was in an expensive assisted living facility. Most positive experience was room service staff. I order a min of 1-2 per day, and staff on phone as well as delivery staff were very kind, and had great personalities. As for my overall experience, it was just a little above average... I Would stay there if I had to, but just wondering if I could find a more contemporary hotel.", "Date": "November 8, 2007"}], "HotelInfo": {"Name": "The Fairmont Dallas", "HotelURL": "/ShowUserReviews-g55711-d98606-Reviews-The_Fairmont_Dallas-Dallas_Texas.html", "Price": "$145 - $319*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1717 North Akard Street</span>, <span class=\"locality\"><span property=\"v:locality\">Dallas</span>, <span property=\"v:region\">TX</span> <span property=\"v:postal-code\">75201</span></span> </span></span></address>", "HotelID": "98606", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/86/27/f0/the-fairmont-dallas.jpg"}}