{"Reviews": [{"Content": "Drug Lord Reigns here Premises look good from road. Lobby looks good. Room was not clean. Towels dingy. TV was awful. But all of that was NOTHING. I think we had a room next to the Drug Lord. Cars were driving up and honking all night. You figure that one out. They offer a weekly rate and I overheard a young girl say that she lived there. May be some left overs from Katrina. I would not recommend this place to anybody.", "Date": "Feb 3, 2008", "ReviewID": "UR690684471", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "melbelle59"}, {"Content": "great location Great place and location. Very easy access to get in and get out, near to major malls and Dallas downtown. great location for Texas-OU games.Prices are great, great breakfast. clean rooms. great staff.thanks", "Date": "Oct 5, 2007", "ReviewID": "UR936167584", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "umdnut"}, {"Content": "Worst Hotel EVER!!!!!!!!! Nasty rooms, snobby and LAZY staff. The local wildlife, such as the dealers and hookers were fun to watch. Breakfast was stale donuts and re heated coffee. The only plus side was it was close to a GAS STATION so I could at least use a clean bathroom!", "Date": "Sep 3, 2007", "ReviewID": "UR507582486", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "ncemt1759"}, {"Content": "worst stay ever noisy all weekend...all night!!!!!!! trash all over the place...i am 55 years of age and have stayed in many a motel in my day but this rates as the worst stay ever!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "Aug 19, 2007", "ReviewID": "UR125529779", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "rth119"}, {"Content": "worst of the worst one of our party was offered service by prostitute and also crack by a dealer. both lived at hotel. Even so, Priceline will always be my fav! this hotel however after calling direct to confirm my payed room, said pool working, got there pool not working and is nassTY. They messed up on our payed stay, but after calling priceline from desk fixed it. pricelines cust service rocks! :) 1st room they put us in had fresh blood stains all over carpet, missing items in room etc. yuck. 2nd rm was fine even if on 3rd floor, has elevator so my cane worked for walking down stairs lol. juice machine broken didnt even have juice in jars. waffles rocked though, gravy did too! staff is very friendly however after meeting new friends at our meetings there, they taught us we were in the middle of the drug/red light district. Being in recovery from addiction over 12 yrs didnt bother me, but those with us that were offered services were new and totally freaked out. Went for Ozzfest and that was the best part of trip!!", "Date": "Aug 7, 2007", "ReviewID": "UR852860194", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "1"}, "Author": "gina_clean2day"}, {"Content": "Great Find in Dallas After our stay in San Antonio, we drove back to Dallas on our way to Tennessee. We found this motel in a Texas coupon book at one of the welcome centers, which, by the way, aren't very sanitary. It advertised $40 a night, cheaper than our previous nights in Dallas. This motel was very clean and had great resources like telephone books, advertisements, and menus to local restaurants. The continental breakfast that morning was fine, it had a make-your-own-waffle machine, but the juice dispenser was not in working order. The coupon said it had laundry services, but there were no facilities onsite. We felt safe in the area, and were located next to a car dealership. If you do decide to venture out into the surroundings, make sure you have a trusty map. My advice would to travel by interstate as much as possible, since it is very unlikely you would get lost. I reccommend this motel to anyone visitng Dallas for a night or two, and make sure you grab a coupon book, because it will save you alot.", "Date": "Aug 4, 2007", "ReviewID": "UR717783321", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "jg2163"}, {"Content": "not good Rather lousy hotel. Although the staff was friendly - the hotelroom wasnt clean and the towels were disgusting. As its a cheap hotel I dont really care about the rooms - the only thing I care about is cleanliness - and this hotel doesnt not in any way meet my standards (and im not unreasonable). Pool was okay.", "Date": "May 18, 2007", "ReviewID": "UR915264297", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "3"}, "Author": "Dasini"}, {"Content": "Hotel Stay Filled with Problems The purpose of this e-mail is to complain about the Best Western Executive Inn in Dallas. You know your T.V. commercial where the black SUV's pull up outside a hotel  allegedly check it out before representing it? Well you guys must have driven PAST this one. I purposely picked this hotel because it stated, in it's description, that it had had a recent million dollar renovation. I checked in Friday 6/30, exhausted, and immediately took a nap then ran out to an appt., so I didn't immediately complain about the dumpiness of the room (torn curtains, stained carpet  furniture). I was out all day 7/1 and when I came back @ 11:20 pm, my card key didn't work. When I went to the front desk, (first to ask what their definition of recent renovation was) the clerk kept telling me that no one was in that room because the room was about to be renovated. It was too late at night to move, so we agreed that I would move the next morning and be credited 6/30  7/1, due to their mistake. This hotel is run by a family of either Pakistani's or Indian's, and they don't seem to communicate with each other. They also don't seem to grasp that the definition of Customer Service is follow through, not just lip service. I had to approach them each day for 4 days to see if they notified you of my 2 night credit. (I finally had you call them to get my credit applied.) That was because I had to keep going to the front desk to have my card key reactivated. They told me that the card key de-activates if I pass by something electronic like a T.V. or a security system? What kind of nonsense is that??? Once I'm moved, I inquire about future incoming calls, since I have given out my old room # to several people including family members, that I was expecting to hear back from. I'm told that they put a do not disturb on my old room # and when the call kicks back, they will transfer it to my new room/v-mail. Needless to say, that never happened. Almost every night when I came in, there were no messages (either v-mail or at the front desk) and the next day I would see people who said they tried calling me hourly the day before and either got no answer at the hotel front desk or, when rarely answered, were told that my phone was busy! I was out every day from 9 am to 10 pm and my callers knew it, and yet the clerks at the front desk insisted that my phone was busy, never took any messages if they answered their phone at all! Their habit of not answering the phone apparently happened as far back as the Monday before my arrival when I called them to verify the amenities I had requested. I also had Hotels.com call them, with no answer, and had Best Western call them also with no answer. They were then sent some kind of intercompany electronic message with instructions to call me...and surprise, that never happened either. Like I said, very poor follow through!!!  This was my first experience with Hotels.com and it was definitely not a positive one.", "Date": "Aug 1, 2006", "ReviewID": "UR215486642", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "VeryParticular"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g55711-d98653-r13227908-Best_Western_Executive_Inn-Dallas_Texas.html", "HotelID": "98653", "Price": "$64"}}