{"Reviews": [{"Content": "Nice Hotel when your have a tight budget       Front Desk", "Date": "Jun 21, 2008", "ReviewID": "UR899355684", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "PMTexas"}, {"Content": "Great Place! Great Staff The staff was so nice everytime I walked in the door. The breakfast was good but just no hot food like eggs and bacon. But it was free! The room was very clean and everything worked. The price was good for the area. The hotel is off the highway and I could get downtown very quickly. I will stay there again if I am in the area!", "Date": "May 23, 2008", "ReviewID": "UR496352309", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "beachlover7492"}, {"Content": "loved it I dont agree with alot of the things that people say about this hotel. I work at a hotel so I know how things should be and I think that this is a great hotel for the price. The staff there is very very kind and more than willing to help with any inconvinence that anyone might have. I would deffinatly suggest this hotel to people if they want a nice comfy room for a great price.", "Date": "Dec 6, 2007", "ReviewID": "UR362844572", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kimblelicious"}, {"Content": "ohh yea This is an amazing place to stay for the place. When I stayed it was very cold and I didnt get to enjoy the pool but had it been warm out I would have been in it because it was right outside my room. The front desk agents were very very kind and helpfuly since we didnt know our way around dallas. but i would definatly reccomend this as a good place to stay if you want low prices.", "Date": "Dec 6, 2007", "ReviewID": "UR510941276", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "dontjudgeme"}, {"Content": "Online Mistake! Avoid if you can... I havent written a review before, but this place inspired me to do so. The location is very sketchy---a warehouse/industrial area, and there are a lot of not so friendly people milling around the parking lot throughout the night. Teens on bikes, people just sitting in cars. It took 15 minutes to check in (and I had a reservation). The room was clean, but was very ragged. The carpet and parts of the walls were stained. The noise from people in the parking lot kept me up, and another noise early in the morning turned out to be a rather large insect in my room. I skipped my 2nd night despite already prepaying. (It may be cheap, but trust me, it isn't worth it).", "Date": "Aug 23, 2007", "ReviewID": "UR947981871", "Ratings": {"Service": "-1", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "1"}, "Author": "joem1097"}, {"Content": "Very good hotel for the price! This hotel was overall a very nice stay. Here are some of the pros and cons I found:Pros:Price was good, hotwire @ 40.00/nightHotel is easily located from the highwayStaff was very friendly, in fact more so than in most 4 star hotels. I was surprised by this and will be a main factor for staying there again.Room was always clean and well kept. We messed it up pretty bad a few nights with stuff everywhere; and it was straightened up perfectly when we returned from the conference.The pool was small but not highly used and the temperature was perfect (its outdoor only though) so this was nice.The breakfast was good (waffles, wrapped pastries, cereal, some fresh fruits, juice, and coffee) Cons:It is an outside entry motel. We didn't see too many questionable people around, but I am always more leary of them. This would be a fine choice though if you even consider outside entry as an option because the blinds absolutely block view of the room, the doors are think and metal and do have a bolt.Getting off the highway is easy to this location, getting back on it can be a little tougher. We tried for days to follow the signs to 635E and never got to it, but I am sure it can be done. Just make sure to ask the desk or get a map. Overall, the 2 cons are very minor. This was a great stay and would love to stay here again. North Dallas with ample shopping and dining is just 10 minutes away, literally about 4 highway exits, but this area will be $40-50 a night where 4 exits away will be $100 minimum. Its worth the short drive and the savings will allow for more spending at the Galleria (huge mall nearby worth the visit as well)", "Date": "Aug 14, 2007", "ReviewID": "UR128691224", "Ratings": {"Service": "-1", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "wtracing"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g55711-d98687-r17104914-La_Quinta_Inn_Dallas_NW_Farmers_Branch-Dallas_Texas.html", "HotelID": "98687", "Price": "$79"}}