{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“False advertising, this place is nothing like the brochure or the sight!!!!”", "Author": "Natasha Wishuwe... S", "ReviewID": "UR119358636", "Content": "first off its the tiniest dormotory look and feel to it, then it is dirty and the bathrooms are hideous, this looks like out of a horror movie \"texas chain saw masacre\" you seriously tell us that it is a non smoking fascility but smoking and the fumes of the ciggarettes would have given an ambiance to the hotel, you should be ashamed of yourselves for advertising falsely, the best part is we went upstairs we looked around i felt i may need to get a tetaneous shot after basking in the ambiance of this hotel, we could not fit in the elevator if my friends and in carried our handbags. now i put my review before and it seems to have mysteriously disappeared nevetheless i think this hotel should be reported to the the BBB cause we are and should not be in the business of false advertising. they were so confident that we will not find a place for cheaper than 700$ for two ridiculous mouse trapped rooms that we got back all our money no cancellation fees. that was the only good thing that happened with the reservation for this hotel is we all got our money back no cancellation fee. i would be happy in a motel 8 or a tractor trailor with clean bathrooms this was less than poor if there was an option i would choose it. maybe you need to tare down this miserable place and actualy recontruct to what the website realy showes (i still would not stay there) but atleast you would not be called out for false advertising, i mean has the management that runs this hotel taken a good look at it? seriously?, it was our first ever trip to NY and this is the hotel we have to gauge it by, luckily the holiday inn painted a much better and on the contrary to what the hotel staff in riverside painted to us, was cheaper and we were right across from the empire state building. thanks Natasha S.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“No regrets. I'd stay here again.”", "Author": "cirejcon", "ReviewID": "UR105389366", "Content": "Pros: You won't find a cheaper hotel this close to everything No bedbugs, as far as I could tell Nice neighborhood that seemed safe A fridge in the room and a market nearby Cons: Pretty much everything else Right up front, if you can't deal with a dirty bathroom that you share with other people, don't stay here! You probably also don't want to stay here if this is a romantic getaway, because I predict no romance on the getaway or for some time afterwards. Otherwise, let's face it; if you go to New York, any time you spend in your hotel is time you're wasting by not doing something awesome, so why pay $300-$400/night just for a place to pass out from exhaustion? Save your money for other things - because you'll need it! This was a trip to New York with my teenage sons before the oldest goes off to college. I'll be honest, I jumped at this place when I saw the price on hotels.com, *then* I noticed some of the reviews and the fact the bathrooms were not in the rooms. It was so cheap that I was tempted to just eat the non-refundable rent and book someplace decent, but it was Easter weekend and by that time, \"decent\" was $400+/night and nothing was available that would hold three people, so I would have needed 2 rooms or a suite!! In the end, I stuck with this, and I'm glad I did. Every time a restaurant bill took my breath away, I just said to myself \"but just think of how much I saved on the hotel!\". If you're from much of the US, you'll be surprised that a place like this even exists. It's more like what one still finds in big cities in Europe. It's OLD, and the walls are smooth with dozens of cut rate paint jobs. The room itself was fairly large and had a fridge. The beds were comfortable, but we had a rollaway that looked like WWII surplus. Nevertheless, we all slept comfortably. We were lucky enough to get an end room, where the door is in a little alcove that also contains a bathroom, so it was \"kind of\" private. As far as I could tell, no one else used it while we were there. Most of the bathroom was actually fairly clean and I did see the maid clean it every day, but by now there's only so much a human can do. At first glance, the tub looked absolutely filthy, but on closer inspection, it was actually mostly mineral deposits from decades of a dripping shower head. Interesting, in its own way. As I said, it had a fridge, and there's a decent market just around the corner, so we could have breakfast and snacks in the room. It's in a lovely neighborhood, steps from the Hudson and just round the corner from Trump Place. It's about a block from an express subway stop, and within walking distance of Central Park, Broadway, Times Square, etc. As they say, \"location, location, location\". We had a fantastic weekend, which in no way suffered from this hotel. In fact, it just added a couple more interesting stories.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great neighborhood location and good value”", "Author": "Happytrails044", "ReviewID": "UR84972303", "Content": "We enjoyed our stay at this small hotel that largely caters to students. It was quiet, safe, clean and the staff was very helpful in replying to requests, giving suggestions, etc. We felt very lucky to have found a such a good value ... we didn't spend our whole trip budget on accommodations. I liked having a small frig and microwave in the room so we could eat breakfast at the hotel. There are good restaurants, coffeeshops and groceries nearby ... City Diner was a favorite spot with excellent food and service.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Great location, safe clean quiet neighborhood, yes I will stay again”", "Author": "OklahomaMikie", "ReviewID": "UR82415450", "Content": "It's New York City, you never get what you pay for. Im 40 yr old female who took her 65 yr old mother. The room and bathroom was clean and, it's not like your hanging around in your room 24 hours a day. We left by 0900 and returned around 2000 give or take. I had a bed, shower, TV, mini fridge, and a microwave, good enough for us. Down fall-last night I was there I had to call them because I didnt get any clean towels. They sent someone right away. We wanted coffee for the morning but the rooms have no coffee pots. They gave us a electric pot to warm water in and we purchesed instant at the local store. They were also nice enough to round up a couple coffee cups for us to use. The day crew at the front desk were nice, the evening crew, not so much. My biggest complaint would be, I called for a 0520 wake up call to make an early morning flight. It was a good thing I set my phone alarm because I never received that wake up call. I also had arranged the night before to have the car service pick us up at 0600 and when I got down front he told me it was for 0630. He did however call and the service was there within 10 min. Would I stay here again? Yes I would. Its a clean safe quiet place in a good location.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cheshire, Connecticut", "Title": "“Very quiet-inexpensive”", "Author": "earthangel4u975", "ReviewID": "UR66105362", "Content": "If you are looking for plush, go to the Hilton. This is a inexpensive way to stay in New York. We had 2 small rooms, private bathroom in-between rooms. The view of the Hudson was beautiful, day and night. 3 blocks from subway, 2 blocks from H & H bagel and Zabars deli. Very quiet neighborhood. Hotel was quiet as well. They held our bags the day we checked out until we were ready to leave that night. Night clerk was very helpful in getting us extra pillows and towels. Fridge and microwave in room were added bonus, although there was no coffeemaker, that was a slight disappointment. Would be planning on staying here again.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Oslo", "Title": "“A dirty, run-down place with lousy service”", "Author": "Liv84", "ReviewID": "UR51259829", "Content": "The welcome from the uninspired staff set the standard, and the rooms were very much in keeping with the rest of the hotel. The aircondition was very noisy and not all that great, the rooms were really dirty and we found bugs in the bathroom. However, the hotel is situated in a lovely area. A great jewish deli is just around the corner, and in the other direction Riverside Park is only a minute away. On the whole, I wouldn't recommend this hotel to anyone, but if you've already booked it; spend as much time as possible out and about, and return to the hotel only late at night.", "Date": "December 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Pennsylvania", "Title": "“Budget Hotel-Not!”", "Author": "divamenot", "ReviewID": "UR38073178", "Content": "Stephen King's scary movie, The Shining, could have been filmed here. The brochure claims the neighborhood and views are lovely and residential--true. It also claims the rooms are small, no they are tinier than dormitory rooms, and cleanliness does not appear to be a big priority. This is just a sad case of \"Let's make believe\" that a once gorgeous building, which has now been ravaged and left to decay, is really up to code and safety and sanitation specs which could entitle it to be called a \"budget\" hotel. Do not stay here unless you are looking for a scary, miserable time.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oakland, CA", "Title": "“Good value for the budget conscious”", "Author": "ShepherdMom", "ReviewID": "UR18859897", "Content": "We chose the Riverside Hotel for its location and price. We were staying in NYC for four nights and it came out to $150 per night including tax for their \"Suite\". You get your own bathroom and shower, microwave, mini-fridge and two small rooms. Everything was very basic, but the good news is, everything worked! The rooms and beds were clean, the maid was very nice and came in every day to make the beds and provide clean towels. The only thing that they didn't seem to have enough of was washcloths. We also borrowed dishes and cups so we could have breakfast in our room. As far as the location, you are two blocks away from one of the most awesome delis and bagel shop in New York. There are lots of restaurants nearby. Also very close to the subway and only one block away from catching a cab with ease. I would stay there again.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "York, United Kingdom", "Title": "“Good quality for price”", "Author": "CCCT63", "ReviewID": "UR8497627", "Content": "gWe first booked in another hotel of the same owner in midtown Manhattan. This first hotel, called the Americanna Inn, was $240 per room per night and didn't have have private bathrooms! They kindly moved us to the Riverside Terrace 88th Street where prices were around $180 per night per room. We had a double room with two double beds, my teenager son and my father-in-law had each a single room and these were very small. The bathroom was very small with a tiny sink. The rooms were clean and the air condition was fine. There was some kind of smell in the lobby and the corridors though. There is no restaurant in this hotel. We usually had breakfast on 90th street, City dinner, and it was very good. We were at walking distance from Central Park and the underground. We didn't have any problem with other guests. The place is basic, rooms are clean, staff friendly and helpful, it's worth the money and personnally it was better than staying in midtown Manhattan with shops and traffic noise.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Windsor, ON, Canada", "Title": "“Yes, Cheap but very dreary”", "Author": "99x", "ReviewID": "UR8249506", "Content": "yes it's inexpensive by New York standards. Great neighbourhood. Parking is not quite as easy as they claim. It is clean, we found no bugs but it really is so dreary. If you are a fussy person this is NOT the place for you. When we walked into the room out first reaction was to leave. We persevered however. there is no real lock on the door. It could be easily sprung open with a credit card. the rooms are so small. We opted for the double room. Lucky we did as we had room to store the luggage. I would never recommend this hotel to anyone but I would say that if you can put up with a dreary, depressing type room- stay there.", "Date": "July 28, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pennsylvania", "Title": "“Good, clean hotel that was great for the money”", "Author": "TennisGirl5", "ReviewID": "UR8067512", "Content": "Inexpensive (for NYC) hotel that was great value for the money. Two blocks from the subway and a McDonald's. Quiet, safe neighborhood of brownstone homes. Excellent and friendly staff who let us into our room early and kept our luggage for us the day we left until it was time for us to get on our train. Bathrooms and showers in the hallways but it was easy to get into one and they were clean. Our only complaint was the noisy children who ran the hallways and the parents who allowed them to bother other people staying there. Also, the cleaning crew started vaccuming early and we'd been out late the night before in NYC and had hoped to sleep later. For the money, you can't beat this hotel and we certainly plan to stay there again when we visit the city.", "Date": "July 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“clean, basic, cheap”", "Author": "dblieberman", "ReviewID": "UR6063299", "Content": "I lived in the apartment building next door to this hotel. I have had my mother, father, and various relatives stay here when they were visiting us. I also stayed here for a few days when my apartment was being painted. The rooms are small, clean, and neatly furnished. The service is helpful and friendly. The rates are the best around for the quality. This is a very good hotel for people who need a place to sleep while they take in Manhattan. It is a short walk to the subway. Again, I think for the quality and cleanliness the price is unbeatable. It is located on West 88th street.", "Date": "November 6, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Milwaukee", "Title": "“NYIT Dormitory”", "Author": "A TripAdvisor Member", "ReviewID": "UR3211628", "Content": "Stay far far away from here. We were overbooked at the Newton (owned by the same family) and sent over to Riverside Terrace 350 w 88th st: they claimed it was a short walk, but it was very cold that night. The room was 8' x 9' plus mini-bath. We couldn't evne open the drawers of the dresser it was so crowded. Our neighbors were unsupervised drunken loud students from NYIT. NYIT rents half the rooms as a dormitory. our room was mixed in with theirs. These kids played load music until well past 2am, despite several complaints to the front desk. The staff is friendly but useless. In the morning we discovered that many frail and/or elderly women have lived here for decades and that NYC doesn't permit tourists (us) in this building! Stay away from this place if you want to sleep at night....", "Date": "February 19, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Santa Clara, CA", "Title": "“Rooms are very small!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2517760", "Content": "My wife and I went to New york during our long weekend and we made our reservation in Riverside Hotel more than 2 months before our travel. When we entered the hotel, the lobby(??) smelt extremely bad, but we thought that won't be a problem as long as our room was ok. Then we got to enter to our room. The room just fits a double bed and exactly one person can walk by its side. If you are carrying any baggage, you will have to place them on your bed (Trust me, its exactly the same size as how I have described above. Nothing more, nothing less) We were so disappointed that we immediately booked a different hotel in midtown and left Riverside immediately. The hotel management was kind enough to allow us to check out without any cancellation penalty fee.", "Date": "September 7, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "San Antonio, Texas", "Title": "“I'm Your Guardian Angel - Do Not Stay Here...I Repeat, Do Not Stay Here”", "Author": "A TripAdvisor Member", "ReviewID": "UR1419561", "Content": "Whatever you read on any other site that applaudes or gives any credit to this hotel, is incorrect. There is absolutely nothing old-world charm or Euro about this place. The pictures on the website are totally inaccurate and did not lend themselves to the room we were provided to stay in. I will be reporting Riverside Inn (319 West 94th Street) to the Attorney General's office and Better Business Bureau for deceptive practices and false advertising. The lobby was very dirty. Upon arriving and peering through a peep window, I was asked to pay for 3 nights stay up front, which wasn't a problem. Then, I was handed 2 rolls of toilet paper ... at check in! You would have thought there was a rationing on toilet paper. I knew then when my husband and I were handed the toilet paper, we were in trouble. I was in town for Columbia University's homecoming and parent's weekend. Everything in the area was booked so we settled on the Riverside Inn. When you're so far from a destination (we were coming from Texas) you rely a lot on website photos, information and what other people post about the hotel. We arrived to our room, there were no towels. None. There wasn't any soap. None. My husband had to return to the front peep window and ask for towels. He returned with something that looked like what you would use to wash your car with. Luckily as always, I had packed some soap in our luggage to use. The room was very small. Smaller than represented. A metal warehouse type unit that could easily be used in one's garage for housing tools was placed in the room for hanging our clothes. Broken clothes hangers were found in a metal standing contraption that was suppose to be a closet. The toilet had to be triggered on several occasion to dispose of waste. The tub dripped the entire three days were were there. Just awful. I tell you again, please, please do not stay here. There was not anything about this hotel that lends itself to me giving it credit.", "Date": "October 23, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York, NY", "Title": "“Good bargain/nice location”", "Author": "TravelerNY9", "ReviewID": "UR977726", "Content": "I've stayed at various places in NY and the Riverside is a quaint, clean little hotel. The double room with shared bath was extremely small but fine for 3 friends looking to hit the town for a weekend. The shared bath was clean and perfectly usable for a short stay. The location is nice if you want to enjoy the trendy, residential area of the upper west side where you can find many cute markets, bars, shops, cafes and restaurants and live amongst New Yorkers. If you plan to spend a lot of time touring downtown or in midtown, plan wisely as the subway trips between those locations and 88th can be a bit long and the cab rides expensive.", "Date": "April 22, 2003"}], "HotelInfo": {"Name": "Riverside Hotel", "HotelURL": "/ShowUserReviews-g60763-d99292-Reviews-Riverside_Hotel-New_York_City_New_York.html", "Price": "$90 - $125*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">350 West 88th Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10024</span></span> </span> </span> </address>", "HotelID": "99292", "ImgURL": ""}}