{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great little trip!!!”", "Author": "SalpalAndover_Nj", "ReviewID": "UR126782842", "Content": "We stayed at the Manhattan Club March 7 - 10. We had a great time. The location could'nt be better!! We had a one bedroom 2 bath penthouse suite on the 28th floor. The unit was very clean, spacious, & nicely decorated. Not one complaint. If you have the opportunity rent a penthouse suite, its worth it!!! Our bed was so comfortable!!! Nice Bose stereo system in your suite, 2 plasma tvs, small kitchenette with all the essentials except there is no stove but who wants to cook when you can wak to all the fabulous restaurants. Parking is only $28/day which is'nt bad but you can't take your car out or you have to pay again. We used cabs to get around to places we could'nt walk to like a couple of the museums, etc.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sandy, Utah", "Title": "“Quiet and Comfortable”", "Author": "Steven B", "ReviewID": "UR126759110", "Content": "We stayed two week nights in March, 2012. The hotel staff was helpful in getting places and in making suggestions for things to do during a short stay. The bed was comfortable and the showers had plenty of warm water. We didn't use the microwave or sink, but it was night to have the refrigerator for keeping drinks cold. We were not too far from the elevator and were concerned that a constant bell ringing would keep us awake, but the bells were either disconnected or very quiet so it wasn't a sleeping problem at all. The location was great, right near Carnegie Hall (undergoing some renovation) and a short walk from most places we wanted to see. I would stay here again.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“So close to everything, so feels like home away from home.”", "Author": "jian9898", "ReviewID": "UR126749730", "Content": "From the valets out front to the front desk, consierge and house keeping- an amazing team of people who are truly there to assist their guests and owners. Our first visit almost 2 years ago was so welcoming that we did purchase. We only bought at a very low level, and still have never regretted our decision. We often use our nights for a one-night stay, and believe it or not- each time we stop, people greet us by name. The rooms vary in size from an efficiency size to much suites with separate bedrooms- you choose your needs and desires. We're not in the room much since it is the BIG APPLE, and we have never been disappointed. Beds are comfortable, coffee, tea and popcorn are in the rooms with the extra sink and microwave. Bathrooms are nice. The accessible rooms are very large and truly wheelchair accessible, including the shower. Inside rooms have, obviously, less of a view, but if you are out to dinner and a show until after 11 or midnight or later- who really needs that! AT 56th you are in view of Carnegie Hall, 2 blocks from Central Park, 2 blocks from the New York City Center-worth checking out- and near many, many wonderful restaurants. We love having a \"home in the city\" where we are always welcomed with a smile and true respect.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great, after changing rooms”", "Author": "bijou59", "ReviewID": "UR126737516", "Content": "Used my timeshare in NYC for the first time. Excited to have a full week in NYC, pre paid....first room was not renovated, had an old fold out couch. Bathroom had peeling paint, the old tub....not sure if it was mold, but around the tub looked icky. They brought us a cot to use until they could change our room the next day....had them waive my entire daily fee for the week it was so bad....second room, much better layout, and new couch. Renovated bath....after the room change, I was very happy. In the end, it was a great week!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“Great Location”", "Author": "Iris Y", "ReviewID": "UR126646676", "Content": "As others already commented the MC has a great location for Broadway, Central Park and the Museums. Thank's to NYC efficient transportation system you can easily move around the city with no effort at all. The suite is a little bit small but nice and cozy. Very compfortable bed. The bathroom is not the best since it lacks space around the sink and doesn't have a hand set in addition to the shower, which could have a better flow. Staff are freindly and helpful. You get a small kichinette with micro wave oven, coffe maker, refrigrator and supply of coffee. It is a very good choice for RCI exchange.", "Date": "March 25, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Bloomfield, New Jersey", "Title": "“Bed Bugs”", "Author": "Lucille B", "ReviewID": "UR126525819", "Content": "I have been an owner at the Manhattan Club in NYC for three years. I have stayed numerous times with no problems. My last visit on March 16, 2012 resulted in waking up with bed bug bites. The hotel staff called in an exterminator who said he saw no evidence of the bugs in the room. However, no one could explain how we got the ugly bites which were on our bodies! I don't feel the management handled this situation properly. There were no guarantees given that the room would be treated or any compensation given to us for the inconvenience. I hope we didn't bring any of the bugs home with us. I have a real problem going back to the hotel for my time share because I am not confident that The Manhattan Club has followed through with extermination treatment. (Stay out of room 226!)", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Highland, California", "Title": "“Great Location For Visiting Manhattan”", "Author": "CityDave", "ReviewID": "UR126426647", "Content": "We had planned this trip to Manhattan back in Oct. 2011. Having been to NY 2 times before we felt we had a feel for the area and where we wanted to stay. I reviewed The Manhattan Club here on TA and had some concerns but felt it was worth a try. I have a time share in Las Vegas with HGV and used some points with RCI to stay at TMC for 7 nights 2/24-3/02. It was a very good trade. We arrived on a wet and rainy Friday evening. From the moment we steped out of the taxi to the second we left we had no regrets other then we had to return to our home in California All of the staff at TMC made us feel welcome and were very helpful. I would like to give a tumbs up to Jerry at the front desk who greeted us when we checked in and was very helpful and answered all of my questions. Great going Jerry :-) I also would like to thank all of the staff from the Door Man who help us arrange a return ride to JFK that was better then a taxi, the house staff who made sure our room was cleaned and in order every day and did some extra things we did not expect, the fast security man who fixed a faulty room safe in a timely manner, and the Bell Hops who made sure our luggage was brought up to our room and put away, to holding it in storage before we left so we could spend our last few hours taking in the scenes of New York. Now for the facts. 1. Check in was fast and without issues. Same with check out. 2. We never had a issue with the elevators. I can see were they do become busy at check out 3. We did have a slight sewer smell in the hallway but it was not something I would not expect in a older building. Never in the room!!!!! 4. We had a One Bedroom Suite on the 22nd floor (2219) that gave us a small view up 7th Ave. and Central Park. 5. The room had a private bedroom with a king bed and a tub/shower bathroom. The bed was comfortable and the room had plenty of space. The closet has a ironing board and iron. The bathroom has a hair dryer and a adjustable vanity mirror. The window can be opened to let in some freah air. Also a flat screen tv. The bathroom was large and layout worked for me. 6. We had a small living room with a hideabed that my college age daughter found to be a pain. Putting some extra blankets that where in the room made it worth while. I would not expect a older and heavy adult to find sleeping on this bed a good thing but what do you want for a hideabed. I have one at home that I would not sleep on. This room also also has a flat screen tv and a view out the window. 7. The kitchenette has a dishwasher, frig, microwave, coffee maker, toaster, all of the dishes you would need. THC provides diswasher soap, coffee, tea, popcorn, suger and creamer that was replaced as it was used. 8. A small dinining table is near the front door. 9.A smaller bathroom also comes with this room, It has a shower and also comes with a hair dryer and a adjustable vanity mirror. The toiletries are Bath and Body Works and are replaced as they are used. 10. TMC does charge $30.00 a night fee. Not sure what you get for the money? We did not use the gym being we walked our feet off or eat upstairs. The business center came in handy for printing our boarding passes. We did get the phone calls to do a timeshare preview but I just did not answer the phone. The location of TMC was everything you would want. Everything was in walking distance. Subway stations are just around the corner or if needed a taxi is just ouside the door. Plenty of places to eat and you have a Whole Foods on Columbus Circle that great for stocking your kitchenette. They also have some great ready made meals that can help keep cost down. As for the size of the rooms I would say it was large by NY standards. When we return to New York this will be Hotel we will be staying at. Great job TMC.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Weekend Getaway in NYC”", "Author": "My1stlove", "ReviewID": "UR126229376", "Content": "My husband and I stayed at the Manhattan club February 2012. The \"door staff\" was very helpful from parking our car, unloading our luggage and storing it until our room was ready. The front desk staff was average, not overly friendly like the \"door staff\" was. We were able to get into our room at 4:30p.m, 1/2 late. Our room was a \"soft\" suite, with 2 bathrooms. facing Carnegie Hall. The room was \"nice\". Not wonderful, not fabulous, not outstanding, just nice. We rented this from a friend of ours who was an owner. The place is in need of an update. We were NOT happy with the lack of services, no room service, limited bar time, limited breakfast. The breakfast was nothing to be desired, overpriced and poorly displayed. We went to the adjoining hotel for a wonderfully displayed, very good, served breakfast with a view, for a few dollars more. The housekeeping department did a wonderful job and was very friendly. The next stay in NYC will be at a full service hotel for the same price, better view and updated facilities.", "Date": "March 17, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ottawa", "Title": "“Perfect Hotel, located perfectly at Times Square”", "Author": "kanasri", "ReviewID": "UR126200711", "Content": "This is a beautiful hotel which is located centrally at Times Square. Across from Carnegie Hall. Walking distance from times square. Excellent .", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Cruces, New Mexico", "Title": "“New York Trip”", "Author": "Harry47087", "ReviewID": "UR126082371", "Content": "This place has the ideal location for Manhattan, close to lots of entertainment, great restaurants, cultural attractions, and best of all, Central Park which is a great place year-round to really getaway from the hustle and bustle of the City, but still 'people watch' and enjoy the outdoors, especially if you have kids or like to recreate with lots of open space. The Manhattan Club has many amenities, and beats any hotel room in terms of space, kitchenette facilities, and areas to relax with no extra charge. Most of the units are spacious, nicely furnished, and well serviced. The location is perfect for walking to many entertainment and dining options, and close to several public transit stops.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Perfect for shows and museums”", "Author": "GaryHiker", "ReviewID": "UR125589031", "Content": "The Manhattan Club is the perfect place if your destination is a Broadway show, Lincoln Center, or the museums by the park. In my case it was near to my mid town business destinations as well. My room was small but nice and it had everything that I needed including a small kitchenette area. The service was good. The only shortfall in the place is the elevator service which is slow. A strategy would be to stay low and use the stairs.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Connecticut, USA", "Title": "“Penhouse Suites at the MC”", "Author": "D0ntFenceMeIn", "ReviewID": "UR125562387", "Content": "We were lucky enough to be gifted a night at one of the MC's penthouse suites. These are found on the hotel's 27th floor and above, and require a special elevator/key card to be reached. I'm not familiar with the rest of the hotel/time share accomodations, but my guess is the penthouse suites are somewhat more snazzy. Our suite was not huge but plenty spacious; galley-efficiency kitchen (coffee provided), sitting area with pull-out queen sofa, bedroom, and two very large bathrooms. The bathrooms are fabulous. The glass/tile walk-in shower in the master bath was, on its own, almost as big as a whole bathroom! Plenty of upscale toiletries are provided; the linens are very good quality and the bed comfy. The suite was clean and quiet. The quality/character of the lobby was not what I expected -- small, and always seemed rather noisy and crowded. We arrived at 4 o'clock check-in time, and the line at the front desk was quite daunting; basically almost backed up to the front door. Luckily, as we were going up to the penthouse suites which have their own check-in procedure, we avoided the line, but I felt sorry for those who could not. And, as everyone says, the elevator situation is totally inadequate to handle the volume of guests. We enjoyed our stay and would return to the penthouse suites. They are comfortable and the Club's location is excellent. I'm not so sure, however, if I would return to stay in one of the other lodging options.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“excellent room/suite”", "Author": "ljkfmk", "ReviewID": "UR123890730", "Content": "Stayed in this fabulous time share accomodation for the second time. Lovely accomodation with well appointed room, kitchenette and huge beautiful bathrooms in our suite. Worth the price just to have those bathrooms.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "vancouver", "Title": "“Wonderful stay during festive season”", "Author": "2dtropic", "ReviewID": "UR123636644", "Content": "We stayed over Christmas for a week with two teenage children. We got a studio suite on the 23rd floor. The layout of the room worked out well, as it allowed me to leave the bedside lights on without disturbing those on the sofa bed. Our room and bathroom was clean. Furnishings were modern and not worn. Housekeeping staff was great. We had no problems waiting for the elevators. The bar/lounge at the very top floor was a nice retreat. Best feature of the hotel is the location. Only issue was the heat in our room.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Windsor, North Carolina", "Title": "“Wonderful location and staff”", "Author": "L0vet0travel433", "ReviewID": "UR122870893", "Content": "We stayed for a week over New Years with our two children. We had a fabulous time and the Manhattan Club was the perfect place to experience New York City. We stayed in a one bedroom, one bath and had plenty of space foe everyone. The room was immaculate and the furnishings were very nice. We had everything we needed in the kitchen. We felt very safe and the staff were excellent. John is so helpful and nice and my children still speak of him since we returned home. I wish I could remember our housekeepers name because she was fantastic too. She cleaned room 1208 from the 28th thru 2nd if management would like to share the review with her. She was friendly and the room was always sparkling when we returned. We will definitely return to the MC when we visit again.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gold Coast, Queensland, Australia", "Title": "“Manhatten club new York”", "Author": "Vicki B", "ReviewID": "UR122788390", "Content": "We are staying here right now! Certainly a fabulous location! Don't agree with reviews of not being clean- yes a little worn - but in a comfy way and spotless bathrooms! Couldn't be happier with the place!!", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Elora, Canada", "Title": "“Perfect for New Years”", "Author": "645propane", "ReviewID": "UR122483270", "Content": "Location. Location, Location, perfect for all New Year festivities, 10 min stroll to Times Square, 5 min to the park, room was large, very clean, all staff very good, would go back anytime, but my wife said I had to much fun, only negative was a noise at night from the elevators because all else was quiet...also my wife trapped one roach in the middle of the living room", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great Hotel and fantastic location”", "Author": "Jacqui K", "ReviewID": "UR122183104", "Content": "We recently stayed for 4 nights in a one bedroom, 2 bathroom room with our 12 year old daughter. What a fantastic location and hotel. The room was large enough for all of us. We had read about the slow elevator but I would have to say with 26 floors and 186 rooms that it was not that slow in the time we stayed. Housekeeping was great and answered all our calls very quickly when we made them (and we stayed over the Christmas period so you might think it would be a little slower). We will definitely stay here again if we return to NYC.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Avoid this one, not clean and outdated.”", "Author": "Travelonbike", "ReviewID": "UR122082455", "Content": "I stayed with a friend who has a time share; my daughter and I have stayed at beautiful hotels worldwide and are not snobs, and we hated this place. The rooms were dirty, the carpeting, upholstery, countertops etc were dirty as well. The staff unhelpful and unfriendly. Rooms are dark and dreary. Filthy would be a better word when it comes to the upholstery! When we walked into the lobby late at night I did not feel safe and felt like I was in a very sketchy place. The halls were dismal and dark, some areas were VERY narrow, could barely walk through without banging luggage against the wall. Luckily, I was not the paying customer, I would have been furious and appalled at the conditions. You could not pay me to stay here again. My friend offered me the place for additional days but we could not stay any longer than one night. I didn't sleep a wink, the fold out was uncomfortable. I would rather pay $500/night somewhere else and feel clean and secure than stay at the Manhattan club for a second. I don't write reviews normally but felt I had to in this case. Trust me you can pay less and have a significanly better experience!!! Previous reviewer was right Howard Johnson's or a Holiday Inn would be a better choice! You can pass on this one!", "Date": "December 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Miami Florida", "Title": "“Please read before you book your stay here”", "Author": "belair100", "ReviewID": "UR121841645", "Content": "I chose this hotel solely based on the location. I should have done the research first. This is a time share hotel. I was not a time share guest but instead I paid about $400 per night and I expected it to be a great experience but it was not. It all started about a week before my arrival. I kept on getting 877 number calls on my cell phone. I finally called back only to find out that it was the Manhattan Club calling. They wanted to schedule a tour of the facilities. I told them that I was a hotel guest and why would I want to tour the facilities and asked them not to call me anymore? It gets worse. Upon check in my hotel package included free parking. The woman at the front desk could not seem to understand this very simple concept. She kept on saying that there was an envelope for me from the manager and she did not know what was in it(almost like I was entitled to some sort of prize). At this point it felt very cheesy and like a time share tour. It turns out my envelope contained my parking vouchers. They asked for my driver's license and took it in the back to make a copy of it. I travel often and I NEVER have anyone make a copy of my license. They also took an imprint of my credit card which is common. Go to their website and look at their choice of words to describe the room like sumptuous. I can tell you the rooms are old and outdated. They also are very small even though I was booked into a jr suite. The bathroom is brass and dated like the 1980's. My carpet and furniture were dirty. My phone rang and it was a gentleman asking what I thought of the room. I told him I was not happy and he said he would get back to me with a solution. I unfortunately did not get his name and no one called back to follow up. I proceeded to leave but had to wait 15 minutes for an elevator. I am not kidding as you look at other reviews you will see this come up over and over as they do not have enough elevators for the demand. I think what made my stay awful was on my last day I was under the weather. My phone kept on ringing and I finally picked it up only to be asked when I wanted to tour the ambassador club. Even though I was paying full rate and not on a reduced rate or being giving some sort of incentive they continued to harass me about a tour of this property. This is unacceptable. If you are visiting as a time share guest you might be ok with all of this. I was not. The parking is unusual. Even if your room comes with free parking you need to pay each day at the front desk with a voucher. I found out the hard way on my way to a meeting. They brought my car around and I gave them the green claim check and a tip. Instead of giving me my keys they said I need to give them a receipt that I paid for parking. I told them I left a credit card imprint at the front desk and that I still had three more nights so why would I pay every time I leave. They said that you need to pay each time you leave and present a receipt. They acted like I would leave and not pay for parking. I had to go back to the front desk and wait in line. I was so happy to check out.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rhode Island", "Title": "“Impressive”", "Author": "valentine214", "ReviewID": "UR121683334", "Content": "My husband and I just returned from a one night stay at the Manhattan Club. We stayed in a one bedroom suite that was more than impressive. The room was clean and very nicely appointed. Two bathrooms is just unbelivable for a Manhattan hotel. The location of the hotel is very convenient to all of the sites in the city. The only thing that we did not like is that we were unable to regulate the temperture in the room. The hotel staff were very helpful and eagar to please. The lobby was very nicely decorated for Christmas. We are definately looking forward to returning to this hotel.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norwalk, Connecticut", "Title": "“Great location”", "Author": "BillSweeney1", "ReviewID": "UR121393295", "Content": "The Manhattan Club is located just below Central Park, across the street from Carnegie Hall. The staff is friendly and helpful. The rooms are spacious for NYC. It's any easy walk to Times Square or any Broadway show.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Winter Park, Florida", "Title": "“Just OK”", "Author": "Peppermint123", "ReviewID": "UR121180854", "Content": "I stayed in a studio for 4 nights. Location of property - fantastic. However, I would not stay here again. The room was plenty big for two people, but I hated the air conditioning/ heating set up. When we were there, the hotel was set to \"HEAT\". I wanted to put on the A/C; however, that was not possible! It was warm and stuffy in the room and all I could do was open the two windows 4\" up. I called the front desk and they said the hotel was set to HEAT only. What an archaic system. Also, the water pressure and volume of water in the shower was dreadful - not good for women with long hair. The kitchen was nice and rooms were cleaned well each day.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“There were some great things, and some not so great!”", "Author": "MMBBOULDER", "ReviewID": "UR121086444", "Content": "I can understand why people give the Manhattan Club varying reviews. It really depends on what you focus on. The good: The location was fabulous. The lobby was clean and bright. We had a 1 bedroom suite which had 2 full bathrooms and was enormous by Manhattan standards and updated/decorated quite nicely. The kitchenette had a coffeemaker that they provided daily coffee for, a dishwasher, fridge, microwave, and plates/utensils. We could not have asked for more and there was a nice grocery store within a half block. We were able to have nice breakfasts in our room and save time and money. The Bad: the elevators (as mentioned by other people) were ridiculous- you can't run a hotel with elevators that take 15 minutes! One of the showers in our full bath didn't work. This didn't bother us, because we just used the other shower but if you were sharing a room between 2 families or couples that each wanted their privacy, it would have been a big deal. The noise was pretty bad from the service elevators in our room, but we used noise machines and ear plugs so we were able to get by. Other members of our family had the smaller rooms, and they were MUCH smaller. Upgrade to the 1BR if you can. The pull out couch was NOT comfortable at all. It didn't bother our small kids, but there is no way an adult could have slept on that thing. Again, we didn't complain because it was fine for our kids as they don't weigh enough to feel how thin the mattress was!", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Binghamton, New York", "Title": "“Great location and more than adequate rooms.”", "Author": "Cfedorick", "ReviewID": "UR121048885", "Content": "For us this was a great value because we rented from an owner for three nights over thanksgiving weekend. The costs would have been much more if we hadn't. We stayed on the 20th floor in a Junior Executive Suite and were very pleased with size. We stay in the city several weekends a year and this is the largest we've stayed in. The location is awesome, subway is real close, plenty of food choices. I have 2 complaints although not significant to us. The elevators were slow a various times during the day. Many people were willing to ride up the elevator just to get back down. And do not attempt to use them during checkout time (11 am). The guest directory is a little misleading when it talks about the club lounge- the continental breakfast is not included with your stay, it is $14.95. The tv in the room was even more misleading. We are going to stay here again in March in the one bedroom suite.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice location, high price for value.”", "Author": "itsvick", "ReviewID": "UR120862803", "Content": "Had to call to have the heat turned on 2 of the 3 nights we were there. Missed our wake up call. Had everything we needed though and quiet. Overall good.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“The Manhattan Club”", "Author": "Leo C", "ReviewID": "UR120830481", "Content": "My wife and I just returned from a one week stay (Nov. 12-19,2011) at the Manhattan Club in the heart of mid-town Manhattan. The staff were courteous, helpful and friendly. Our studio suite was clean. We stayed as guests of another person and so had no choice in booking the room but what we had was suitable. I definitely recommend this location. Rockefeller Center, Radio City Music Hall, Times Square, the theater district, Central Park are all within easy walking distance.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“Great Location and amenities”", "Author": "CaFaHi", "ReviewID": "UR120679253", "Content": "I just returned from three days spent at the Manhattan Club in New York City. It is located within twenty minutes walking distance of Times Square, the theater district, Rockefeller Center, 5th Avenue shopping, the Hudson River and much more!. The rooms are very clean and well appointed. The service staff is accommodating and the concierge staff are extremely helpful. There are lots of good moderately priced eating establishments within a couple of blocks of the hotel. There is a subway stop within a couple of blocks and Central Park is only two blocks away. There is a gym and business center and free wifi in the rooms. All rooms have a kitchen area with a microwave, small refrigerator, sink, dishes and silverware.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Great location for Downtown”", "Author": "Free_Skier", "ReviewID": "UR120673540", "Content": "We spent 4 nights in the Manhattan Club through an exchange with RCI. I had booked a 1 bedroom and a studio unit. Both units were very nice, with the exception of the curtains in the studio unit. We brought to the attention of the front desk staff that the studio unit did not have a black out curtain. As the hotel is located on busy streets, a black out curtain is necessary if you are going to get any rest, unless noise and lights don't bother you. The desk staff did not respond to our request and so the couple that spent the 4 nights in the studio unit had to suffer through the noise and lights. They did go out and purchase ear plugs for the second night, but the fact that the staff made no attempt to respond to our request is not acceptable for a hotel of this calaber. The location is great...10 minute walk to Time Square and you could see Central Park from our 1 bedroom suite. The lounge upstairs is nice, but the bartender only knows how to pour 6 ounce drinks. The price reflects this at $16 a glass, but if all you want is a quick drink before supper it doesn't rally work well. Others have commented on the sales people, we did not find them a problem. We told them we were not interested and they left us alone for the duration of our trip. The concierge and front lobby staff are great at assisting with taxi service. There is a great Thai restaurant just down the block - the Topaz - you have to go there if you like Thai food - best curry dish we had ever had. Enjoyed our trip and would recommend the Manhattan Club.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location, good sized room”", "Author": "CasaMurguia", "ReviewID": "UR120476559", "Content": "We were struggling to find a hotel in the city that was not over $500 a night, we were on a business trip but still we sis not want to pay that kind of rate. We had a quick review of Trip Advisor of the Manhattan Club and decided to give it a go. The hotel was easily found and very bright so you could not miss it. Check was fine, not the most helpful but then what else do you get in New York, the staff were not very rude but not very pleasant either. I had a 1 bed room, the room was big and comfortable, with a kitchenette which I did not use. The decoration was dated and the hallways smelled for lack of air. The bathroom was small but again big enough for 1, the quality of the wares within the bathroom was not the greatest at all, they could really invents in some better supplies. Check was fine, again not the best of manners and the bell guys were over helpful because of the tip they expected, they were quite rude when not tipped on placing the bags in storage but this improved on collection. Overall the location was great, the room comfortable and clean, the dÃ©cor was poor but for New York I guess this was good for a short stay.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location and room size”", "Author": "LL123500", "ReviewID": "UR120389546", "Content": "We stayed for a week booking through RCI. Whilst it was a little pricey, i think it was comparable to other hotels in the area. It was clean and well appointed, having the junior suite we had a small kitchenette and lounge area. Great for those nights you want to stay in -more like a home than a hotel. We were called up by RCI to attend an information night but if you tell them your spouse is not with you they are not interested. The location is fantastic -it is just round the corner from the subway station (N, Q, R line), and a very short walk to Columbus circle, the department stores on 5th Ave. Times square is also walkable (20minutes). We took a taxi to and from LGA -one trip costing close to $40 exc tip and the other slightly over 30 (exc tip). It is very traffic dependant.", "Date": "November 9, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Good-size room and fabulous location”", "Author": "Rumples", "ReviewID": "UR119535677", "Content": "We stayed at The Manhattan Club for two nights in September. Please note that reviews on this site are from both those who have stayed at the club as time share holders and those who have rented a hotel room. The hotel room does not incur additional charges for housekeeping, which is mentioned in some reviews, or at least our hotel room did not incur a charge. We secured our room for an excellent rate on Hotwire and thus did not know this was a time share until after we paid Hotwire. I am uninterested in the time share concept and was less than enthusiastic to receive a \"welcome\" letter when we checked in, inviting us to learn more about the time share possibilities. I felt the same way when a phone call came to our room, inviting us again to a presentation. (I have suggested to Hotwire that they indicate on their site that time shares are included in their hotel offerings so that the buyer is aware.) That said, we found our second floor room to be clean and a good size for Manhattan. The bed was extremely comfortable and there was plenty of storage space ... except in the bathroom, which had minimal space for toiletries. The main drawback was the room's location. It faced a brick wall, so no natural light came in. We felt as if we had entered a bear's den. Carpeting in the second floor corridor resembled a leopard print and seemed a strange interior design choice. To access the nearby guest elevators required using our key card to enter the business office area where the elevators stopped. Elevators are quite slow, so we often had to leave this area and take a walk to the service elevators, located in a dreary back hall that had no air conditioning -- a major drawback because of the high temperatures that weekend in New York. The hotel's location is great -- near Central Park, 5th Avenue, Times Square, etc. -- with plenty of good restaurants and cafes in the vicinity. That is truly a major plus. It is well worth staying here if you can get a good rate, and, based on some other reviews and our experience, secure a room above the second floor.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Long Island, NY", "Title": "“Pricey”", "Author": "Shato296", "ReviewID": "UR119293075", "Content": "Nice hotel but very expensive. Specially when you get a phone call the minute you check in to see if you are interested in properties owned by the hotel. Very distracting when you have reservations for dinner and a show. Other than that the room was comfy and th elocation was near very nice restaurants.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salina, Kansas", "Title": "“Right in the middle of the action”", "Author": "snavefam", "ReviewID": "UR119269218", "Content": "We had friends join us for 3 days out the the week that we were there and sharing the one bedroom suite with them still gave us plenty of room. We each had our own bathroom and although they had to put the mattress from the sofa hide-a-bed on the floor for comfort, they said they slept well after doing that. Having a kitchenette meant snacks and drinks in our room before heading out for a night on the town (an excellent opportunity to save some $$$). If you're all about location, this can't be beat.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Great location in the middle of it all!”", "Author": "Najebo", "ReviewID": "UR118740476", "Content": "We stayed there 14 nights from September 10 to September 24 2011. This was our fourth visit to New York City, and we chose this accommodation for its great location; we were 4 adults in an executive studio unit. The Manhattan Club is a great place to stay as it is right in the middle of it all: 2 blocks from Central Park, a 10-minute walk to Times Square, itâ€™s right in the center of the Theater district and several subway lines minutes away (N, Q, R right around the corner and 1, 2, 3 at Colombus Circle, a couple blocks away). The check-in went very smoothly and we got the unit we had specifically requested a week prior to our arrival. We were on the 20th floor, which was great. Our unit was just as expected: very spacious. We had no view whatsoever (a huge brick wall), but the good thing about it is that it was extremely quiet. We were never woken up by those city sounds and we really appreciated that. The bed and pillows are very comfortable and so was the sofa bed. We tried both because we were 4 adults and thought it was only fair to switch every now and then. The kitchenette is practical for drinks and snacks but there is no cooktop or regular oven. I guess you can heat up some soup in the micro-wave but we didnâ€™t. Housekeeping gives you popcorn and ground coffee every day, so you wonâ€™t need to buy coffee. If you are a Starbucks addict, thereâ€™s one just around the corner. The dÃ©cor was fine, nothing really special. The bathroom was â€œnew york smallâ€� and lacked storage space. We had to have all our beauty products on the floor and the hallway console became our make- up/hair drying area. Housekeeping did a great job; unlike other timeshare properties, they refresh your unit every day. The hotel is well kept: after a day in the filthy new york subway, itâ€™s very pleasant to come â€œhomeâ€� to a very clean and neat hotel. Apparently thereâ€™s a gym but we never used it. On the 26th floor, thereâ€™s a guest lounge with very comfy sofas and chairs. From 2 to 4pm (or maybe 12 to 4) they provide complimentary Starbucks coffee and cookies. I had read many complaints about the elevators. Most of the time we didnâ€™t have to wait that long. The only time we did was check-out mornings because if the elevator has reached a certain weight before getting to your floor, it wonâ€™t stop at your floor. So we decided to call the elevator going up, weâ€™d go up to the 26th and back down to the lobby and it was way quicker this way. Keep that in mind on Friday and Saturday mornings! We liked the Manhattan Club very much for its location and its cleanliness, so we will definitely stay there again when we go back to NY. Some extra practical info: - Groceries: thereâ€™s a Morton Williams a block away (225 West 57th Street). Itâ€™s small but has everything you need: we stocked up on watered bottles, juice, milk, fruit and veggies for salads. - Wi-fi: itâ€™s free at the Manhattan Club, so bring your laptop itâ€™s great to help plan your day. - Laundry: if you stay a while (we stayed 2 weeks) you may need to do some laundry at some point. We went to a Laundromat on W. 50th between 9th and 10th avenue. Itâ€™s very clean and the lady running the place is very helpful. Itâ€™s $4.50 for a large washer and $0.25 per 7 minutes of drying. You have plenty of eateries in the area to have dinner while your laundry is being done. - Concierge: the person at the concierge desk is very helpful. If you need a map of Central Park you can get one there as well.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Excellent Location with Reasonable Rates”", "Author": "VancouverDolce", "ReviewID": "UR118678906", "Content": "Having never been to Manhattan, choosing this hotel was a shot in the dark. And having just spent 5 nights there - we would stay there again anytime and recommend it to all my friends. The location is excellent - within walking distance to so many of the midtown sites, all the theaters, Times Square, Carnegie Hall, Rockefeller Centre & excellent shopping (both on a budget & not!). Also, the hotel is within blocks of the hop-on/hop-off tour bus locations (which we strongly recommend!), great dining (again, both on a budget & not!). Best deli \"Carnegie\" just around the corner and too many more to mention. The hotel rooms have kitchenettes - great for morning coffee, drinks and snacks! The hotel and rooms are a little tired (wallpaper peeling, smalls carpet stains) - but who cares! The rooms are clean, beds comfortable (though no king size available - queen only!) and price is right. Internet is available in the rooms and free. Staff are helpful getting cabs, directions and dining suggestions! There is a gym, fitness center and lounge/bar - no restaurant (thus the kitchenettes!). They offer a continental breakfast, though we never tried it....way to many other great options for dining near the hotel! Highly recommend the Manhattan Club!!", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Excellent Location for NYC Vacation”", "Author": "tennisplayerbbb", "ReviewID": "UR118510904", "Content": "We spent 4 nights in a very nice large, studio unit on the 19th floor of the Manhattan Club. There was daily maid service, daily coffee refills in the room, and daily popcorn which was a treat. In a studio, there is a $15 daily fee for maid and concierge service, (and in a one bedroom there is a $25 daily fee) which can't be eliminated except for a $45 credit if you take a timeshare presentation. However, you also get complimentary coffee and cookies from noon to four in the 26th floor lounge. The staff is super nice and helpful. The location is unbeatable, walking distance to Times Square, Fifth Ave, etc., and the subway is one block away. In fact we took the subway and the M60 bus from Astoria to Laguardia and it took about an hour from the Manhattan Club. We took CitysightsNY tours which the concierge booked for us ( You can save $5 if you book it yourself on line.). It was a two day hop on, hop off tour bus that took us all around downtown Manhattan, uptown, Brooklyn, night touring, cruising on the harbor to the Statue of Liberty and other sites, and even gave us a museum to see on the uptown tour. The guides seemed knowledgable and friendly. We would not hesitate to return to the Manhattan Club. I had one minor complaint about a drape that didn't close properly, and it was repaired immediately. The unit has a half refrig., a microwave, and even a dishwasher. It was an excellent vacation. NYC was clean, and the walking areas were a real treat. Central Park is two blocks away, and again, a treat to stroll in.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“The Manhattan Club, NYC”", "Author": "BraveTraveler", "ReviewID": "UR118332118", "Content": "This accomodation was clean, friendly and conveniently located. We are great walkers and did a ton of walking right from the front door. Great location to Central Park and short walk to Time Square. It was far enough away from the hussle and bussle of Time Square but it only took a few minutes to be in the middle of it. Our room faced the courtyard but could still see the street from our window. The windows are single pane so it was a bit loud. But the traffic was not bad so it was ok. Housekeeping was excellent but they need to be a bit more quiet with slamming doors. We were early risers but felt for those who were hoping to sleep in. Beds very comfortable. We were in a studio and only missed a toaster. But that might be due to fire regulations. Elevators are REALLY slow so don't hesitate to use the service elevator. No biggy though. Blue Line hop on - hop off is right around the corner. It was well worth the money. We took a two day pass and loved it.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Hyannis, Massachusetts", "Title": "“Love this place!! It's close to all my favorite places.”", "Author": "Carol W", "ReviewID": "UR118167060", "Content": "What sold me on the Manhattan Club is the location. Besides being close to Times Square and Central Park, it's close to the Lincoln Center, Columbus Circle, Carnegie Hall, the theater district and some great restaurants. It has a very nice and spacious lounge, a gym and a free business center with ample computers. The rooms are clean and the beds are comfortable. The bathrobes add an extra touch. The staff is very courteous. On the con side the elevators are extremely slow and the lobby could use a makeover. Overall, I really enjoy staying at the Manhattan Club and would highly recommend it.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“The location is great. Near Central Park, Carnegie Hall, Columbus Circle and Times Square”", "Author": "sspc", "ReviewID": "UR118016062", "Content": "located on 56th and 7th, it's in the center of Manhattan. Easily assessable to everything by subway, bus or taxi. The location is the best thing I can say about it. Here are the pros: Location, room size, gym, free business center, nice staff, comfy mattresses and free wi-fi. If you are lucky enough to get room 2511, then it's worth the following cons. But few ever get this large updated room with an incredible view. Here are the cons: the wi-fi is weak and disconnects constantly. The elevators are very slow. There are 'secret' service elevators that I discovered, but they are also slow. The rooms need to be modernized. The decor is traditional and of not very high quality. The marble is from the 70's (it seems) and really ugly. The oversized stuffed leather chairs and sofa in the lobby make me cringe, they are so terrible. The sales staff calls too much to invite you to come down, but after you tell them you are not interested a couple of times, they stop. The shower heads don't produce a steady stream of water. I had two bathrooms and they both were bad. If you need to be in this area, you can do worse. But if you just want to experience Manhattan head downtown. Greenwich Village, Soho, Tribecca, Little Italy, China Town are all vibrant, charming, and unique.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bonita Springs", "Title": "“Very nice place to stay central location 4 star accommodation”", "Author": "BonitaNaples", "ReviewID": "UR118003945", "Content": "Very nice place to stay central location 4 star accomation we had the junior suite which more then enough space for us two, elevators very slow was the only problem we had will go back. Beware they charge why too much for breakfast $40 for 2 dont think so not for what you get", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dissapointed”", "Author": "alex robert c", "ReviewID": "UR117770344", "Content": "The Manhattan Club: I stayed with my friend-owner for the US Open and was greatly dassapointed. The room is big but furnished poorly, old spotted sofa, leaking aircondition from the ceiling, the toilet is not for a 'big' person. Staff is half-friendly. Elevators are just terrible, over slow, wait up to 15 min. There are additonal elevators offered to guests: trashed, dirty, and smell... due to no airconditioning at that area. The only positive is location and roomy space. But for the same price of ~$400-500 Hilton is much better.", "Date": "September 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great location, the rest is average”", "Author": "karensc0tt", "ReviewID": "UR117676877", "Content": "We used rci points to stay here and not sure I would pay to go back - was all ok just not amazing. Our room had no natural daylight which made you feel like you were sleeping in a dungeon! Made it really hard to wake up. Service from staff was ok but not that friendly.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "cape coral, florida", "Title": "“Perfect NYC Vacation”", "Author": "Healthcoach1", "ReviewID": "UR117289508", "Content": "Our stay at the Manhattan Club was nothing short of perfect! From the staff that greeted us upon our arrival, to the bellman, the concierge and the housekeeping staff, they did everything possible for us. Our room was a Jr. Suite and it was clean, comfortable and was well supplied. We really could not have asked for more in the heart of NYC!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Midland, MI", "Title": "“Great place to stay!”", "Author": "cjnd2002", "ReviewID": "UR117254577", "Content": "My husband and I were in town for an extended weekend and we exchanged in through Bluegreen (our timeshare) and were so lucky we did. The place is great! The first night we stayed in a 1 bedroom suite. It had a king sized bed in the bedroom and two great bathrooms; how nice to get ready at the same time in the morning - one in each bathroom! The second night we were in a smaller 1 bedroom and it had a queen sized bed in it and only one bathroom, which was fine for the two of us. (I should note that the reason we were in different rooms each night was because I booked it late and these were cancellations and all that was available - we had no issue with switching rooms). Each room had free wi-fi capabilities and we really appreciated that. We would recommend The Manhattan Club in a heartbeat! It's close to Central Park and plenty of restaurants. The front desk staff was courteous and amiable. One thing I would tell anyone staying at TMC is to be aware that the breakfast available in the Lounge is not free. It's $14.99 and charged to your room account. If you don't want to spend that $$, it's not a big issue when there are plenty of restaurants in the area that you can get breakfast for less at.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Scotland", "Title": "“A great exchange in New York - would definitely request again!”", "Author": "The_Bear_Brigade", "ReviewID": "UR116993037", "Content": "A very convenient location for Times Square and all Midtown destinations and less than one block away from the subway. We had a one bedroom suite which was just right for our family of four. The walls however seemed quite thin (or we just happened to have very loud neighbours) as we could clearly hear what was being said next door on a couple of occasions. Yes, there was a $25 a day hospitality charge, however there was free Internet, coffee, tea and popcorn was replenished daily and if you were around, free hot drinks and cookies in the member's lounge in the afternoon. Before arriving we received at least four invitations to the RCI presentation which we duly ignored. On site we received one written invitation and one call about this. We declined and were left to enjoy the rest of our stay.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Lancaster, PA", "Title": "“Great location, horrible accommodations”", "Author": "Italy4X", "ReviewID": "UR116826393", "Content": "We stayed here for a family weekend. The shower didn't work, the air conditioning was very noisy, the walls were paper-thin. The elevators were super slow. Only two of the 4 seemed to be working most of the time. The pull out couch was incredibly uncomfortable. It is my understanding that some of the rooms had been redone. Apparently on the 12th floor, this was not done. Location was great, walked everywhere, took in a show - Book of Mormon - fabulous!!! There are so many other choices of places to stay in NYC, go elsewhere. the", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Great Location for a Theatre, Shopping, Central Park Weekend”", "Author": "SGTrvlr", "ReviewID": "UR116622944", "Content": "I stayed at the Manhattan Club for a girls' weekend. We went for shopping and theatre, and this place is a great stay for both. It's within walking distance of Central Park, theatres, and 5th Avenue. It was surprisingly quiet, the suites were spacious, and 5 women were surprisingly comfortable in a one-bedroom suite. I even found the other residents friendly and helpful. Nice bar/restaurant on a top floor.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Schenectady, New York", "Title": "“Exact opposite of previous poster...no problems here”", "Author": "jas044", "ReviewID": "UR116473383", "Content": "We also took advantage of the Living Social deal, which, if you add up the regular cost of the room and the gift card we received, saved us about $160. Yes, the tax wasn't included but it was a relatively minor inconvenience. Ours was the opposite experience of the previous poster. We were able to check in at 12:30, our executive junior suite (22nd floor) was quite nice and we had no problems with staff or the whole timeshare element. When making the actual reservation (both Living Social and Manhattan Club do have you jumping through a few hoops), we specified that we weren't interested in the timeshare chat and were weren't bothered once. I have heard that the Metropolitan Suites on the second floor were less impressive. The location was perfect for our needs...within a few blocks of the Central Park Zoo and MOMA...and the N & R subway line was a block up, as was a delicious dinner at Trattoria Dell'Arte.", "Date": "August 9, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Langley, British Columbia", "Title": "“The Manhattan Club: The Good and the .....”", "Author": "MBinBC", "ReviewID": "UR115979865", "Content": "We stayed at the MC for two weeks (July 9 - 23, 2011) and had the opportunity to stay in two of different suites. Using out Hilton points (affiliated with RCI) we felt lucky to get the place for two weeks as there are limited places to stay in Manhattan. Overall, our experience was a very good one. As many other reviewers have mentioned the location is fantastic. We were minutes, by foot, away from Columbus Circle, Central Park, and Broadway. A five minute walk would get you to Times Square and there is a Subway station less than a minute walk away. For you coffee drinkers just remember right, and right again and you will be at a Starbucks in seconds when you exit the MC's main doors. We found the housecleaning staff to be friendly and non-obtrusive. Our rooms were always clean and replenished. We found the housecleaning staff to be extremely pleasant and welcoming, they were also willing to help us if we were waiting for the elevator by offering the service elevator (we did not find the elevators to be particularly slow or inefficient other than the check out/in days). Let me preface the next part of the review by saying we stayed in two different types of rooms which offered two different experiences. The first week we stayed on the 16th floor overlooking the Wellington Hotel. The room was excellent, it was spacious, well planned and came with the usual amenities plus a dishwasher. We thoroughly enjoyed the experience. I believe most RCI/experinced travelers would be satisfied with this type of room. Our second week we stayed on the second floor. More about that in a minute but first a little about our experience with the front desk staff. When we arrived we were told we would have the same room for both weeks. I recall thinking that we really had lucked out. There is no question in mine or my wife's mind that this information was communicated to us so on the following Saturday when we got our check-out notice, I at first ignored it thinking 'it's Saturday, they just throw them under every door'. Nevertheless, I had a niggling feeling that this was not the case. We had an appointment scheduled for nine that morning. At 8:30 am I called down to the desk to make certain we were to stay in the same room and was told that we were to vacate by 11:00 am and relocate to a room on the second floor. It was very frustrating, especially since we had to cancel our 9am appointment and get packing. This inconvenience in itself was not the end of the world however the non-caring, non-helpful attitude of the front desk staff did not help. We had little to do with the front desk during our stay but if this scenario was an indication of how they deal with clients I would suggest they take some lessons from the cleaning staff who seem to have grasped the culture of hospitality. Now to the rooms on the second floor. They are clean and but poorly designed. There is only one bed side table even though there is room for two. The view is of a brick wall and in our case at least, a massive air-conditioning unit. For the life of us, we could not figure out the rationale behind the cups, plates and cutlery -- they were disposable plastic (the type you would get at KFC). The cups were pathetic- they reminded me of a child's play set (we re-used our paper Starbuck cups). Having said that, the room was okay and if we had not been on the 16th floor we would have perhaps been more satisfied with out room on the second (my wife disagrees with this point). We both agree though, that one should not be spending lots of time in the room other than to sleep and get ready for the day if you are staying in NYC, This was definitely the case with us and when we were in the suites we felt like we were in a safe, clean place that drowned out the hustle and bustle of the city regardless of the second floor room's shortcomings. Our stay in NYC was fantastic. Our stay at the Manhattan Club certainly complimented our incredible experience. I would recommend a stay at the MC but be aware the second floor suites are not ideal and don't expect an empathetic front desk staff versed in hospitality fundamentals to look after your concerns.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "NY", "Title": "“Junior Executive Suite is the way to go!”", "Author": "antgina", "ReviewID": "UR115939192", "Content": "Stayed in the city overnight for dinner & a show. Got a great deal to The Manhattan Club through Bloomspot.com (great deals). Pulling up, the valet took our car & offered us help with the bags. Check in was a breeze. We requested a room next to our friends so had to wait until it was ready, no big deal, only 10 minutes. What a great surprise to see the size of the rooms for an NYC hotel!!!!! Nicely appointed, clean, well stocked with coffee, robes, etc. Wish the bathroom had a vanity instead of a pedastal sink - leave no where for your products when getting ready. Only complaint would be thin walls. Unless there were really loud guests! haha! I would go back in a heartbeat! Great location, right off of broadway and close to everything!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Mississauga, Canada", "Title": "“An amazing hotel”", "Author": "mississaugamom", "ReviewID": "UR115937219", "Content": "The room in the Manhattan Club was a generous size compared to other rooms that I have stayed in. There was a double bed and a double pull out couch. The room had a kitchenette that was equipped with disposable dishes and utensils. The bathroom was very modern and clean with a huge walk in shower, the only thing it lacked was a bathtub, which did not bother us. This is a timeshare, which we were aware of. We were contacted about an info session but as soon as they realized it was two women without spouses they were not interested in talking to us. Come into this century Manhattan Club! The location is great very close to Central Park, subway and a easy walk to Times Square. An excellent stay and we will definitely return.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Audubon, New Jersey", "Title": "“Fantastic place can't wait to go back”", "Author": "LucyDesi2010", "ReviewID": "UR115931003", "Content": "Could not find a thing wrong. Clean, friendly and close to everything.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Greenwood, Indiana", "Title": "“Great location in the middle of Everything!”", "Author": "jairoabq", "ReviewID": "UR115765800", "Content": "Spent 4 nights at the Manhattan Club in July, 2011 with my wife and 2 kids (7 &10). The hotel itself was very nice, clean and the 1 bed suite was big enough for the four of us Pros: - Location. This hotel is within walking distance of many of the countless attractions in NYC. Broadway theaters, times square and central park are all around the corner. Also, there are several metro stations very close by. - Sleeper sofa: The quality of the sleeper sofa was superb! The unit had what seemed like a brand new sleeper sofa. It had a very comfortable, memory foam mattress (not one of those cheap coil mattresses you usually find in a sleeper sofa) - Size: The one bedroom unit was big enough for the four of us - huge by NYC standards. It had two full bathrooms, a big master bedroom, kitchen, table with 4 chairs and a living room area. More than enough - No pushy sales people. Once I told them I was not interested in taking their 'tour' (i.e. sales pitch) they did not bother me again CONS: Bathrooms: The bathrooms themselves were fine, but there was not enough room to put our things (toothpaste, contact lense cases, toothbrushes) by the sink. We kept knocking things down to the floor because there was just not enough room. Wallpaper seemed to be peeling a bit, but that was just a minor detail. Overall, this place was very good and we'd stay there again without any reservations.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Marblehead, Massachusetts", "Title": "“Affordable NYC hotel near Central Park”", "Author": "stephso", "ReviewID": "UR115699684", "Content": "The Manhattan Club's location can't be beat. Two blocks from Central Park, one from Carnegie Hall, and close to the MoMA. The online deals right now are fantastic. We booked a junior suite with kitchenette for $250/night. Rooms are clean and comfortable. Bath and Body Works tolietries. Free wifi. The only disappointment is that the living area of the suite is not actually separate from the bedroom. It's small for a jr suite, but the more important part is not having a door to separate the two rooms. Thankfully this wasn't a big deal for us. Valet parking is $28; standard for NYC. Overall very pleased.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Second time at the Manhattan Club”", "Author": "Yordy", "ReviewID": "UR115648035", "Content": "We had been there in Nov 2008 and had loved it, so returned for a 1 week stay and had an almost corner unit in the 18th floor, wonderful view: broadway, central park, skyline...The most beautiful thing at the Manhattan Club is that you can feel at home, the 1 bedroom unit is roomy: living room (with sofabed), kitchenette, 2 bathrooms... a luxury in New York! The top floor lobby with coffee, the, cookies is nice and relaxing after a long day walking and visiting the big apple. The location can't be better, in the middle of everything but quieter than Time Square, walking distance to Lincoln Centre, and most of the museums. Internet wifi free in the rooms and office available at the top floor with computers and printers free of charge. We have spent 3 weeks there and would love to return!", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Langhorne, Pennsylvania", "Title": "“Things are looking up!”", "Author": "Cabana-Boy-and-Girl", "ReviewID": "UR115571535", "Content": "We stay here several times a year and I must mention that as time goes on the staff and management seem to be getting things back under control since the renovations have been completed. For a couple of years it was sketchy at best. Getting a reservation was a hassle, the place was getting run down around the heels, and it seemed to lack the sparkle it once had. Things are looking up. Each trip seems better than the last.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Manhattan Club-NYC”", "Author": "Abe64", "ReviewID": "UR115231429", "Content": "The Manhattan Club timeshare in NYC is unlike any timeshare we've stayed at. It is more like a studio apartment. It's half a block from Broadway, several blocks from Central Park, walking distance to Times Square. It's a great place to stay for a visit to NYC.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Shelbyville, Tennessee", "Title": "“great location”", "Author": "ewadesmom", "ReviewID": "UR115171225", "Content": "This hotel is the perfect place to retreat after a long day of sightseeing. It was very spacious (very uncommon in NYC) for our family of 3. The room(s) were clean and the staff was excellent! We will be back!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Another great stay at Manhattan Club”", "Author": "crissyrod", "ReviewID": "UR115066565", "Content": "My husband and I had a trial ownership and decided to use one of the nights to be able to be in the city for the fireworks for July 4th. We did arrive early because we had a meeting with the ownership program at noon. While our room was of course not ready that early we were able to enjoy snacks in the lounge upstairs. Our room was beautiful and it was quiet even though we were closer to the elevator. Another awesome experience and everyone at the Club was very kind. We have several more nights left and we are anxious to use them. Central Park is close by for a romantic carriage ride. Several excellent restaurants are nearby as well.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "honolulu", "Title": "“Convenient location”", "Author": "hulagirl86", "ReviewID": "UR114945080", "Content": "Stayed here with my family of four. Master bedroom and bathroom were very nice. Sofa bed in living area was uncomfortable and squeaked with every move. Elevators were very slow. Bellman was very friendly and helpful, especially in getting us cabs. It was a very convenient place to stay near everything...Times Square, Broadway shows, shopping, Central Park!", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Average Room”", "Author": "robynzechel", "ReviewID": "UR114683509", "Content": "The room was snug as there were 4 of us in it. The hotel was average, they put us in a rather small room considering we were contemplating buying a time share with them, they didnt treat us as well as I would have expected considering. It is nice and close to central park which was great. It was an average hotel.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Enjoyable weekend in great location”", "Author": "JCD258", "ReviewID": "UR114589074", "Content": "We stayed at this timeshare/hotel for a long weekend and it was very nice. The room was large for a hotel room in Manhattan and well priced for the location. The staff was friendly and helpful. They called and offered the timeshare presentation, but it did not meet our schedule. They accepted this and did not call again. The bell staff was helpful. The concierge staff were all great with advice on transportation, directions and arranging meal reservations. The location was perfect a couple of blocks from Central Park, within view of Carnegie Hall, and easy walking distance to the MOMA and many other locations. We visited as part of a 20th anniversary trip and the ride through the park, and other opportunities close by made the trip. The only issue was a plumbing problem in the middle of the night, and the desk had an engineer to the room to fix it in minutes, and had it mostly cleaned up. The next day after housekeeping had been in the room you could not tell there had been an issue. When it was time to leave they arranged for a car service to transport us to the cruise terminal for the amount estimated for a city taxi. I would certainly stay at this location again!.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brentwood, California", "Title": "“Perfect Location!”", "Author": "Luvem2", "ReviewID": "UR113488563", "Content": "The location was perfect! Close to the subway, within walking distance of Central Park, Times Square, restaurants, shopping, and Starbucks! The rooms were large (living, kitchen, 2 bathrooms, and bedroom. Housekeeping was 5 star!! The Concierge Service was outstanding and so very helpful!! Loved our trip to New York and the Manhattan Club made it perfect!", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Wenham, Massachusetts", "Title": "“Great location”", "Author": "KO1300", "ReviewID": "UR113185924", "Content": "Great location for shopping, theatre and site seeing - third time and we'll be back", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Frontenac, KS", "Title": "“Mislead on a Suite”", "Author": "GITProfessor", "ReviewID": "UR112981820", "Content": "Not my first visit to NYC but it was for my two friends who were with me. This was a trip to celebrate our each turning 60 this year. When I made the reservation I was excited to have a suite and the pictures on the website certainly showed enough space for three adult women. You can imagine our surprise when we walked in to a standard sized hotel room. The only thing that made it a suite was the couch that made into a bed (another bed would have worked instead of making this each night) and the micro kitchenette. We were cramped and barely had room for our clothes let alone the souvenirs we bought! Staff at the desk were not overly helpful, the doormen and maid staff however were very friendly and helpful. Will likely go back to the city, don't think we'll stay here again though.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ontario", "Title": "“Convenient location and spacious unit”", "Author": "timbuk2Ontario", "ReviewID": "UR108223972", "Content": "Stayed at the Manhattan Club during the Easter weekend. We had a one bdroom unit and it's the most spacious accomodation we ever had in NYC. The unit is kept very clean but the furnishings need updated. Prior to arrival, we had asked for an updated unit and was told my request was noted. At check in (a cool reception), we were told the unit was an updated unit. The unit was located right in front of the elevator but it turned out there was no issue with noise at all. But the unit was definitely not one of the updated unit. The fabric on the sofa was worn away and the door to the dishwasher look like it was falling off. We didn't use the dishwasher so we couldn't tell if it works. Aside from that, everything was fine- bed was comfortable and the unit was quiet though not much of a view. The valet parking rate at $28 per 24 hours was very reasonable compared with the lots nearby. Overall, it was a good stay though the service level could be improved.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Regina Saskatchewan", "Title": "“Great Place to Stay”", "Author": "willykim", "ReviewID": "UR107128087", "Content": "Our first time to NY. Location Location Location -walking distance to almost everything and close to the subway for everything else. Room size is great for two, had an inside room so there is no view. $25 a night for housekeeping was a bit much but it saved tipping every time you turned around. Nice to come back to the room and have it cleaned every day. Didn't use the partial kitchen much but it was nice to have a microwave and small fridge. Concierge service was very helpful with directions, tickets for shows etc. I would pass on the timeshare presentation, just not the way to kill 1 1/2 hours.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Dissapointed”", "Author": "britondabayou", "ReviewID": "UR105659581", "Content": "We stayed at this hotel during April. We booked the junior suite as there we had our three teenage children with us. This hotel is situated on the corner of west 56 and 7th avenue. We could see times square from the corner and it was a easily walkable distance. We didnt use the subway at all, so i cant say if it was convenient or not. Not a whole lot of amenities at the hotel, a gym and a lounge - bar opens at 4.30 pm. We paid $399 a night without tax, and this was very good value for money considering new york rooms are small and we would have had to book two rooms in other hotels. I would have given a better review if 1. The staff were friendlier - the reception desk and concierge were particularly frosty. We arrived at 11 and were told we couldnt get an early check in and to come back at 4pm. We actually arrived at about 3.50pm and were told a room wasnt ready and to take a seat and wait. The lobby is small with not much furniture . At 4.35 pm, we went to check again and were told yes the room had been ready since 4pm. They had not bothered to inform us of this.. We had waited sitting on the floor for 35 minutes. The manager later apologised. 2. We were not informed that there was a charge for the rollaway bed ($25), not that it mattered particularly to us, but it would have been nice to have known in advance. 3. They switched the airconditioning off - gave a garbled excuse, but did provide us with a fan. WE were hot and we all had broken nights sleep because of it. 4. We all got soaked on one occasion and there was no laundry service. we had wet clothes draped everywhere. Jason, the bellboy of chinese origin was the only friendly person there. He always greeted us with a smile, and nothing was too much for him. So to summarise, I feel that the Manhatten Club suites could have been a great stay IF the staff and management were more helpful and sensitive to their guests comfort.", "Date": "April 26, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Stewartstown, Pennsylvania", "Title": "“never even made it”", "Author": "J_Jforever", "ReviewID": "UR102554343", "Content": "Had a message on my home answering machinel from Bridget at The Manhattan Cub. She said that we had entered a drawing and even though she didn't quite have all the results, she did have great news for us and a wonderful offer. Well who could resists this, so of course I called her back. Bridget did get on the phone and then she proceeded to ask questions about our employment, income and assets. After a few minutes she came back and said since our income and assets did not meet their requirements, they would keep us in their files. Okay, I told her, but did we win anything? She said no, and did not mean to mislead us. Okay, then what is the great news and offer you had for us? Then she said nothing at this time and was sorry for bothering us. So basically her message was just a ploy to get us to buy into this vacation sharing place. Fool me once, and once only, but shame on you Manhattan Club, you never even offered me a chance to look at your place. Tavelers beware of places that promote this type of behavior and business.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Great location, but thin walls in our room... (noisy neighbors)”", "Author": "EveyBl", "ReviewID": "UR102057101", "Content": "The Manhattan Club has some great things going for it (location, room size), but it also some issues that should be addressed. We booked two nights at the Club via Points with our timeshare and had hoped to extend the stay for one night with cash. Well, that was apparently impossible to do. Though the front desk could confirm that empty rooms were available, they redirected us to the marketing department. At the marketing department, we were told to wait until the morning of checkout and then inquire with the front desk. Well, I certainly didn't want to cancel our reservations elsewhere and hope that the Manhattan Club actually had a room... only to be stuck with no place to sleep on our final night in NYC. I still have NO IDEA how to make a reservation to extend a stay with cash nights at this facility! As a result, we ended up moving to the Hilton Club for our last night in NYC. We had initially considered adding ownership at TMC to our other timeshare ownerships, but with it being so difficult to extend stays with cash (which we frequently do elsewhere), we have decided against this. Extension issues aside, our room at the Manhattan Club was very comfortable during the day. It was in great condition, clean, and laid out well. Unfortunately, though, we had very LOUD neighbors who returned to their room both nights at 2:30am and then proceeded to yell back and forth to each other. This would continue until about 6am each morning as they each showered (yelling to each other the whole time), watched TV at top volume, yelled to each other over the shows, and finally would call people on the phone. I can only guess they had relatives or friends who lived on the other side of the world since they were phoning at these times. We could hear EVERY word they said through the walls. I finally called security at about 4:30am the second morning and asked that someone come up and tell the neighbors to quiet down. The lack of sleep really did affect our ability to enjoy our time in NYC. It was a great relief when we heard the knock on the door, the guard ask them to quiet down, and then the couple discuss how awful it was that we had called and reported them. Yep, we heard it ALL. But, then they finally did give us some peace. All in all, we do plan to return to TMC when we travel to NYC in the future... but next time, we will probably bring along some of those earplugs for soundproof sleeping!", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gladstone, Australia", "Title": "“Don't miss the opportunity if you get it!”", "Author": "Mackasx2", "ReviewID": "UR101978379", "Content": "In New York rooms are generally small because real estate it so expensive. So imagine our surprise and pleasure when we were fortunate enought to get a timeshare exchange. at the Manhattan Club, regardless of the size of the room. Then imagine our delight when we found our one bedroom apartment had a sofa bed which made it a 4 person accommodation so had two bathrooms. As there was only the 2 of us this meant we had a bathroom each!. We had a kitchenette with microwave, coffee maker, firdge and dishwasher plus our rooms were serviced dail. We also had access to gym, large louge with bar which operated form 4.30pm and business centre where printing of documents was free. Also free interent wifi throughout the building. There are more positives I could add from our perspective but realise that I am now prejudiced! Great value, great service and I would go back anyday.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Margate RSA", "Title": "“RCI members from South Africa”", "Author": "GDTravelsMargateRSA", "ReviewID": "UR101832791", "Content": "The Manhannten Club must go down as one of the best RCI resorts and we recommend anyone visiting NYC to stay at the Club. A truly great stay", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Brunswick", "Title": "“Wonderfully Centralized Location”", "Author": "dalejnut", "ReviewID": "UR99942170", "Content": "Two blocks from Central park, about 8 blocks to Time Square, two blocks from Fifth Ave. Can't ask for much more. Broadway on one side and 7th Ave on the other. The Manhatten Club is very nice and clean. Check-in took less than five minutes. The Concierge, Debra and Serge, were very helpful and knowledgeable. Note that any Broadway tickets that they get for you will have an additional $25 added to each ticket. Its cheaper to get your own tickets as the box offices aren't really that far away. The bed and pillows are very soft and comfortable. Love having the two bathrooms. Our view from 1402 was of a brick wall but I wasn't there to look out my window. I found that the continential breakfast, although very good, was over priced for the limited selection. $14.99/person. I recommend the Downtown bus tour at $44/person but if you get the Chinese lady, you may not understand her very well and may not get the full benefit of the tour. The carriage ride around Central Park wasn't required. We could have walked it ourselves in about two hours vice the hour that we did for $80. Our taxi to the airport took about an hour (Friday at 11:00am) and cost $43.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“I was given a room in the 'basement' (really the second floor) however I could not tell if it was day or night”", "Author": "busytravelerr", "ReviewID": "UR99459162", "Content": "Wow - I have traveled for business for 40 years and I have never been so insignificant as I am at the Manhattan Club. I must admit that it is a timeshare - not a hotel however the level of service is minimal at best. 1. I tried to contact the hotel on a Sunday to find out the check in time - all possible phone #s were not available until 9-5 Monday-to Friday - an email was sent to state a 4 PM check in 2. At Check-in @ 3:30 - no rooms were available til 4 PM - most hospitable hotels have some flexibility - very limited customer focus 3. The room was a dungeon, the room in the 'basement' (really the second floor) was so dark at 4 PM I could not tell if it was day or night. It was the same situation the next morning at 8 AM, I could not tell if it was day or night. Imaging my surprise when I went out the front door and I needed sunglasses. I can go on - I think you have the picture You can find much better accomodation on travel zoo dot com to enjoy New York City", "Date": "March 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Great location, spacious rooms, will come again”", "Author": "maiko1", "ReviewID": "UR98471773", "Content": "The one bedroom suite we stayed is was so spacious - as a former Manhattanite - I kept thinking that it would be a nice apartment to live in. Both bathrooms were also spacious - my only complaint there is that they don't have fans! I also wish check in is a little earlier. They have reasonable valet parking but there is also plenty of free parking on the street on Sundays. Free wifi but I could never connect - I just used the cable in the room.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great Experience”", "Author": "auduende", "ReviewID": "UR98296152", "Content": "I have to say, after having read some reviews, mostly on this site, I was very nervous about staying in this hotel. The reviews varied widely between \"wonderful\" and \"horrible\" with very few in between, so I thought I'd take the time to submit my own review. We booked 2 rooms over the President's Day weekend for all 5 of us (3 adults, 2 small children). Initially there was a SNAFU over the rooms, but after a while, things got worked out and they gave us adjoining rooms (we did have to pay $75 extra). Contrary to what some people have said, we thought the rooms were rather spacious as far as NYC rooms are concerned. We even had a king sized bed, which I wasn't expecting but was very glad to have. The kitchenette was very convenient as well as the 2 full bathrooms. There was plenty of room to spread out. The elevators: yes, they were slow at times, but not so much that had us waiting forever. In fact, they run a separate set of elevators around the corner, so if the main ones were busy we could always catch those. Like all the other reviewers, I agree that you just can't beat the location. You're close to Central Park south and just blocks away from Times Square. Everything was so convenient. They also have a mini grocery store nearby as well. The staff were very nice, the lady at the concierge desk was helpful and answered all our questions. The doormen always had a smile. Never encountered anyone who was rude. It isn't the Ritz Carlton, so as long as you know that going in, you'll be happy. It isn't a rundown hotel either. I just think people might be expecting way too much. It was clean and nice looking, superbly located, and met our needs.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bombay", "Title": "“Great Hotel - Brilliant Location in Heart of Manhattan”", "Author": "Jvalant", "ReviewID": "UR97911871", "Content": "Hotels don't come cheap in Manhattan for sure and this one is no exception. But everything about the hotel was great - the service, the staff but above all the location. The suite was well furnished with a small kitchenette including a microwave, coffee maker, fridge and the rooms included a TV and a DVD player could be called for. No complaints - definitely worth staying in .", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nevada City, California", "Title": "“Great base for NYC”", "Author": "Riveroak", "ReviewID": "UR97729063", "Content": "I read the reviews before going here on timeshare exchange. We found the Manhattan Club to be great. It was perfect location in midtown Manhattan in walking distance to many attractions and very convenient to subways. The staff was polite and helpful. Our rooms were clean, nicely appointed and quiet. We enjoyed our stay greatly and hope to return.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huntington Station, New York", "Title": "“Great Girl's Weekend”", "Author": "emscot20", "ReviewID": "UR97590162", "Content": "From the moment we arrived at the Manhattan Club, we were treated wonderfully. From the valet, to the reception representativie, to the bellhops, to the housekeeping staff; everyone went out of their way to make our stay wonderful. I have to admit that from the other reviews on here, I was a little worried about booking. However, all I kept saying while I was there, was \"what customer service\"! Not to admit, the hotel itself is really nice. Our room was tastefully decorated and the bathrooms are beautiful!!!! You will not think that you are in a NYC hotel when you are here. I would highly recommend this hotel to everyone. It has a great location and the staff really goes out of their way to help their guests and to accomodate their every need.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, GA 30062", "Title": "“Wonderful location”", "Author": "dotters", "ReviewID": "UR97004337", "Content": "Quite a small room with no view, but a terrific location. We were surrounded by the best of NY. Bed was quite comfortable, but the couch for our teenager wasn't the best. Otherwise, would stay again, but in a bigger room.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mechanicsville, VA", "Title": "“Clean hotel in great location”", "Author": "AmesnBru", "ReviewID": "UR96886565", "Content": "My husband and I and another couple traveled to NY for a quick getaway and used a Living Social (dot com) coupon for a stay at this hotel. It was clean, fresh and we LOVED the location!", "Date": "February 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sterling, Virginia", "Title": "“DON'T WAIST YOUR TIME AND MONEY”", "Author": "simosito2002", "ReviewID": "UR95622733", "Content": "We stayed at this club last year from 7/2-7/5/10.the same thing happened to us we went with my parents and the room was very small..we didn't know that we cant cook their so we used the rice cooker in the room the room the next day when we came back to our room the rice cooker was missing they took it with out our permission they should have given us the note regards that,, that we shouldn't use the rice cooker not take it without out any notice..The worse part was they damage my car my beautiful new car .the driver who took my car to park it in the parking that was in front of hotel damaged my car.when i told them about that they said it was their before .i know it wasn't I'm not lying they are just bunch of lairs that they feed their stomach with lies.my new car didn't had any scratch...I will never go there and I suggest you that don't go their if you go don't let them park your car for you they are lazy and don't know how to drive a car.they charge us $120 for the car I wish we didn't give them the money.But they are smart they don't give you your car unless you paid the parking first....DON'T WAIST YOUR TIME AND MONEY", "Date": "February 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maine", "Title": "“Owner advice--holding on telephone for 45 minutes--forget service!!”", "Author": "LuxuryExplorer", "ReviewID": "UR94292056", "Content": "I'm writing this review while holding on two telephones for \"owner services,\" which has not answered either line for 45 minutes. As I hold, I am finding more and more fault with our stays--the front desk was never that helpful, and much as we love the two bathrooms with our one-bedroom suite, waiting endlessly for the elevator was exhausting...The maintenance fees about doubled over the six or so years that we have owned, and the automatic billing hits us ever earlier--i.e., August for the next January. To reserve one's floating week, one must pay at the reservation date, which can be almost a year in advance of the date that fees are actually due. We have noticed management selling the rooms via Hotels.com, etc., and wonder if the owners are being squeezed out. Of course, management reserves the right to buy out a timeshare seller if it considers the price too low, so sale prices do not reflect owners true lack of regard for the place...My conclusion: better to pay for a real hotel, with up-front charges and pay-dates, and probably a discount for paying early.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“We loved it!”", "Author": "crissyrod", "ReviewID": "UR92642842", "Content": "We read the reviews online prior to our trip and were not sure we wanted to come. We went to NYC for New Year's Eve, so we wanted it to be nice. People said the rooms were dingy, etc. When we checked in, everyone was friendly and we were taken care of quickly. We had book 5 days and 4 nights, they had us for 4 days and 3 nights once we presented our confirmation, she adjusted it immediately, no questions asked. Very nice. The club was clean and our room was great. We were on 24th floor and we were very pleased with it. Housekeeping was prompt and we never saw them, they did not impose at all on us. Maybe some people just expect to much, we have stayed many places in NYC and this was excellent.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Perfect NYC hotel!!”", "Author": "ClarkL13", "ReviewID": "UR89364977", "Content": "I recently stayed in the Manhattan Club with my family, which included my 2 year old, over Thanksgiving for the Macy's Parade. Every aspect of our reservation and stay was incredibly easy. The Manhattan Club staff was so helpful when we booked our room last spring, we knew we needed to book early because of the parade, and they even gave us a room overlooking the parade route - so we didn't even have to leave our room to watch the parade! Our room was huge (a one bedroom suite with 2 bathrooms and a living room!), and completely affordable. The entire suite was very clean and the bathrooms were spotless. The beds were comfortable and all the linens were top-notch. My family and I cannot wait to return to New York City again and stay in this fabulous hotel...especially since we were able to walk everywhere!", "Date": "December 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Jeffersonton, Virginia", "Title": "“Very Disappointing Stay @ TMC”", "Author": "cnorris34", "ReviewID": "UR89357970", "Content": "We stayed at TMC from 12/3-12/5/10. My parents had never been to NYC city, so we wanted to offer the trip to be a positive experience for them. When we checked into TMC- the room was not ready until 4:05PM and once we arrived at room they place all 4 of us in a metro suite which had a pull out sofa and king size bed that were 1 foot apart and very little room to move throughout the room together. We were promised a divided area between sleeping arrangements for privacy. When I asked to be moved- they avised me that they were completely full and could not accomadate. Once we resided to bed- we pulled out sleeper sofa to find that it was broken and would not support mattress. I insisted to the from desk asst manager that we needed to be moved or bed repaired (at 1AM) and they decided to call repair person to look at sofa bed. Finally at 1:45AM another assistance manager called us to desk and placed us in another suite. Coffee pot in room was broken and repair person came to room after 2 hrs to bring alternate pot and when he hooked up coffee maker- he left the heater on. If we had not been there to see that- the room may have caught fire and our group blamed for damages. Rooms are dirty and hotel arrangements are sub-par. Soda and smack machine on 26th floor remained 90% empty all weekend. I am so glad that we did not purchase timeshare with the Manhatten club- they are far from a 5 star resort in my opionion. If they did offer refunds (which they don't, mainly because they would go out of buiness if they did)... I would certainly ask for my money back. Lesson learned........ DO NOT BOOK WITH THE MANHATTEN CLUB.", "Date": "December 8, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Manhattan Club won't refund prepaid reservation”", "Author": "pafarmer79", "ReviewID": "UR89173877", "Content": "In Oct made reservations for 2 nights at the Manhattan Club for this January. Paid in advance. I asked the lady on the phone to make sure we could cancel. I just tried to cancel and they \"offer\" a policy of no cancellations. I know what they're offering and I don't like the smell of it. Am pursuing other means to get my money back. Don't book here if required to pay up front.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beverly Hills, California", "Title": "“Best location in the city”", "Author": "sofia90210", "ReviewID": "UR87569165", "Content": "We travel to Manhattan on a yearly basis and bought a timeshare at the Manhattan Club three years ago. With two teenaged daughters, it's tough to find something as spacious as the suites at the Manhattan Club that are not exorbitantly expensive, so we purchased there. The service is excellent, and the reservations a breeze when we go through our salesperson, Arnie. Some of the rooms have not been renovated, but he always manages to put us in an updated room. We are very pleased with our ownership there, and the location can't be beat. It's three blocks from Central Park and within a block of Broadway theatres and Fifth Avenue shopping. Subways are right on the corner, and therefore Soho and Chinatown are 5 minutes away by train. We have recommended numerous friends who have also purchased there. It's a great value but Manhattan is not inexpensive. The concierge, Carmi, is also the best! He got us discounted tickets for Million Dollar Quartet on a Saturday night for less than $100 each, fourth row center orchestra! We also got into the Palm, which was completely booked up, through him.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“This is a great, central location for a visit to NYC”", "Author": "bostonterrier", "ReviewID": "UR84960647", "Content": "I just got back from a weekend stay at the Manhattan Club. It was very nice--I stayed in a one bedroom suite, with one bedroom, a living room/dining room/kitchenette combo with a sleeper sofa and two full bathrooms. The suite we had was clean and comfortable. The bathrooms were really spacious, and we had plenty of clean towels. The location was great...within easy walking distance to the seventh avenue express subway train for easy access to downtown. The Manhattan Club doesn't have a restaurant, but there are lots of great restaurants nearby, including Serafina, Carnegie Deli and Banash. There's also a Starbucks right around the corner. Rockefeller Center, 5th Avenue shopping and MOMA are within walking distance. We did not take advantage of the concierge, but we did use the bag check service twice, which was no problem at all. All in all, a very good experience. I would go back.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "canada", "Title": "“Great place in NYC”", "Author": "stewnet", "ReviewID": "UR84959813", "Content": "Ignore all the negative comments - you will enjoy your stay. And to the management - do not listen to complainers that say your staff is rude - absolutely everyone of the staff was quite the opposite. . Check in was easy and fast as was check out. Concierge was friendly and helpful. Bellmen were nice, friendly and helpful. Did they have their hand out for a tip as one poster wrote?? Absolutely not! But did we tip? Of course - that is what you do in a hotel!! Elevators - not sure what some are referring to, but we never waited an excessive amount of time for an elevator. Not even once. It is a non issue. Location - perfect- close to everything. A few blocks from Times Square and close to the Theatre District. Room - Not large, but by NYC standards the room was spacious and good value for the money. (we booked an RCI extra vacation and payed about $1160.00 Cdn for three nights.). We were three sisters sharing a studio, the bed was comfortable, my sister slept on the couch without pulling it out, so not sure what the sofa bed was like, but the couch was fine. The room were clean (no bed bugs and we had a public health nurse in our group who knows how to check), Washrooms were nice - not luxurious but clean, updated. Loved having the small kitchenette - enjoyed cereal and coffee in our room for breakfast and wine and cheese for snacks. I will definitely stay here for my next trip to NYC (which hopefully is soon)!", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“An excellent base for park, museums and city”", "Author": "floatingworld_10", "ReviewID": "UR84648799", "Content": "Two blocks down from Central Park, with spacious, well-maintained suites, Manhattan Club was a great base from which to explore New York. Our suite comprised a double room and bathroom and living room with sofa bed, cooking facilities and a second bathroom. Decoration is somewhat bland and we had to put a duvet on the sofa bed mattress to make it comfortable; otherwise the facilities were great and the staff were very helpful. Access to pcs in the business suite was useful and the free popcorn was good too!", "Date": "October 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“small timeshare hotel”", "Author": "orientallady2010", "ReviewID": "UR84474229", "Content": "We booked three nights through RCI exchange during the Christmas 2009. The room we got was extremely small compared with other timeshare property. I think it was even smaller than other standard hotel rooms that we stayed before in NYC. The location was excellent. We walked to Central Park in the Christmas day. They have a lounge on the 26th floor provides coffee and cookies. Very nice. Since this is a timeshare hotel, the salesmen or women were pretty aggresive. But I don't blame them. They did give us some meal vouchers for participating in their presentation One thing we were unhappy was the valet parking guy damaged our brand new ski rack but the Manhattan Club's management refuse to take responsibility. They claimed that the Ski Rack was not part of the car. The first day the car was parked in the gargage with a high clearance area but the next day someone move the car to the lower level of the gargage and did not pay attention to the ski rack that added a few inches to the car.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Walla Walla, Washington", "Title": "“Great Experience!”", "Author": "travelingolfers", "ReviewID": "UR83945737", "Content": "My husband and I stayed for a week. We found the staff to be very friendly and helpful. the studio was clean and spacious enough for the two of us, and the location was excellent. There were many restaurants, activities, and attractions within walking distance. This was an RCI exchange and were told when we made our reservation that we were fortunate to get in. We booked several months in advance when the week became available, but it was worth planning ahead. We would definitely stay here again.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Great for families!”", "Author": "cassie3375", "ReviewID": "UR83401361", "Content": "I stayed here with 2 young children and it was wonderful...spacious (HUGE for NYC) room with separate bedroom and kitchen! The location was extremely convenient to many restaurants, Times Square, and Central Park. Even though it's not cheap, it's definitely worth it compared to what you get for similar prices elsewhere. I would definitely stay here again.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Don't look at the bad reviews - look at this one!!!”", "Author": "Betzyboo27", "ReviewID": "UR83240581", "Content": "Stayed at this apartment for one week commencing 02/10/10. Stayed in a one room apartment with my husband and 24 year old son. We read all the comments on this establishment and we were slightly concerned with what we read - any fears we had were quashed within 1 min of us arriving at reception. We were slightly early and our room wasn't quite ready. The lovely receptionists said that she could look for another apartment that was ready and did we have any requests - we simply stated that we would take the best that she could offer - she offered us a room with a view or a larger room without a view - we dicided that in new york you go outside to see the view and that we would benefit from a larger apartment. We were not disappointed - the extra space was brilliant - the room was to a high standard and was very clean - not having a view meant we had very little noise as we were away from the hussle of street life. The mini kitchen was well equipped with microwave, coffee maker - plates, mugs, cuttlery, glasses, bottle opener - even a dishwasher. There was also a daily supply of filtered coffee - decaf included and also pop corn. The fridge was a good size and had a freezer compartment - there were free ice machines on the 14th and 26th floors. As for the previous comments on the lifts - yes if you used them at peak times you had a wait - but there were alternative lifts available for use if required - the longest we waited was 5 mins. The location was excellent 5 mins walk from central park and the same to times square. Lots of eateries nearby - the local cafes were good for breakfast - the europa cafe was good for set menu breakfasts the dearest being $6. Check out was good too - we had to check out at 11am but didnt have to leave for airport until 2pm - we left our bags with concierge and we were issued with a ticket to uplift them later - we also still had use of the restroom and the lounge area. After checking out I had a query about my credit card - I was treated with the same level of service of a checked in guest and the reception staff were great. We would definitely use this accommodation again and can't believe the negative reviews that we have read.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great location for mid-town”", "Author": "Jeff_in_Colorado", "ReviewID": "UR83238655", "Content": "We spent 3 nights this trip and found this to be a very convenient location for the theater district, restaurants and the park. Having the use of small kitchen in the room is beneficial and the rooms are large enough to not feel cramped. There is a very good business center in the complex. The hop-on/hop-off buses will stop at the corner one block away if you have already gotten tickets.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Las Vegas, Nevada", "Title": "“DONT BUY HERE!!!!!!!!!!!!!!!!”", "Author": "gomers", "ReviewID": "UR83044877", "Content": "This is a warning to anyone who is even thinking about buying at Manhattan Club...I bought from a family member who was suffered a family crisis and couldn't afford or use the property...BAD MISTAKE!!! They have oversold the property by leaps and bounds and it is IMPOSSIBLE to get time unless you call 9 MONTHS TO THE DAY you want to stay. That is ridiculous! The maintence fees are THROUGH THE ROOF!!! STAY AWAY STAY AWAY!!!!", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Myrtle Beach, South Carolina", "Title": "“Excellent hotel in an outstanding location”", "Author": "KaDo2606", "ReviewID": "UR83012977", "Content": "My wife and I arrived at the Manhattan Club on Oct. 2 and stayed for one week in a junior suite. From one to five stars, I have to rate this hotel 4 1/2 stars. The personnel were very accomodating and a pleasure to speak to. From check-in to the concierage to check out I couldn't stress more how helpful and pleasant everyone was. The room was roomy and well furnished for a NYC hotel. The maid came in daily and made sure the room was clean. She furnished us with our decaf coffee packets daily which was great for the morning. The furnishings were not elegant, but they served their purpose for storing our clothing and accessories. We had a flat screen TV in the living room area which was great, but was not viewable from the bedroom area. It would have been nice to be able to watch television in bed before going to sleep. I found the kitchenette to be sufficient for snacking as there was a small refrigerator, microwave, sink and dishwasher. The bathroom had a stall shower, but no tub which I found odd as the room is very large. We were situated on the 22nd floor facing seventh ave. and there was very little noise unless a siren was passing by the building. But, that is the music of NYC, so it did not affect us at all. I utlized the exercise room a few times and found it sufficient for a decent workout as it contained treadmills, bikes, a universal, a benchpress machine and free weights in the form of dumbells. I was able to get a good sweat before I visited the fantastic nearby restaurants. The only complaint I have which caused me to knock a half star rating from perfect is the room temperature. You cannot control the room temperature, only the speed of the fan. If the temperature outside is cool the heat is on and the only thing you can do is open the windows about two inches to let in cool air. It got so warm that we had to request a fan which was promptly brought to our room. We complained about the temperature and it was explained that some guests were cold and they had to put the heat on. We heard the heat complaint from other people on the elevators. I'veheard complaints from others critiqueing this hotel about the elevators being slow. We did not experience that, however the hotel was not full. There were times we had to wait nearly five minutes for an elevator, but that did not affect us. Overall, I rate this hotel very high and recommend it to anyone who is looking for a very clean, comfortable hotel located in an outstanding location.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Foster City, California (San Francisco Area)", "Title": "“Centrally located”", "Author": "hpisles", "ReviewID": "UR82976232", "Content": "We stayed at the Manhattan Club Hotel for 5 days in September 2010. We found this hotel through our friend's timeshare but did not use the time share option since our friend wanted to use her timeshare week for something else. So we stayed at the Manhattan Club for $350-$375 per night which was comparable with the surrounding hotels in the area. Manhattan is not a cheap place to go so expect high hotel rates! Prior to going I received frequent emails and calls offering free dinners, free shows, reduce rates, etc if we would attend their 90 min timeshare presentation (this is a bit annoying). After finally figuaring our schedule we decided not to attend since there was so much to do in New York and our time was limited so we opt out of the presentation. Also their web site is a bit strange and ended up having to call customer service to reduce our stay by one night. I requested early check-in but it turned out none of the rooms were ready until 4:00 p.m. (wished they had told us that prior to going back/forth to the hotel trying to check in). All the staff was very helpful and friendly (expect for the intial staff we meet - we showed up at 9:00 a.m. after taken a red eye flight) and I guess they got tired of me asking if our room was ready. The rest of the staff was quite friendly and helpful. We stayed in a 1 bedroom suite with 2 bathrooms and flat screen tv in each room and sofabed in sitting room. This worked out exceedingly well since we had 4 adults and also had a rollaway (additional $25 per night) it worked out perfectly for our needs. Having a small kitchen with refigerator, microwave and coffemaker (with coffee) worked out perfectly. King-size bed was very comfortable and the rooms were large compared to what we previously gotten in New York. The only problem with the room was the air conditioner didn't work very well but we discovered if we pulled down all the curtians and turning on the air con full blast that the room would be a comfortable tempature when we returned in the evenings. In the mornings when it was cool and there was a breeze we opened the windows. We skipped the $14 all you can eat buffet breakfast and opted to get pastries at a corner street cart right outside ($2). Also plenty of coffee shops and delis nearby as well as resturants. Hotel was very clean and the bell staff was VERY friendly and helpful. Hotel was clean and nicely done. VERY Centrally located and bus and subway stations were close by. Time Square and Central Park was within walking distance. You couldn't ask for a better location since everything and everyplace was easy to get too / from here. We do plan on staying here again when we return to Manhattan.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "san jose, ca", "Title": "“good stay and location is everything but a tad pricey and noisy A/C”", "Author": "bogelo", "ReviewID": "UR82687187", "Content": "I had no problem from check in till check out. The room was a bit small for a suite (metropolitan suite) and the windows A/C was noisy as hell and smelly. We ended up opening the windows during our stay (luckily it wasnt that hot). I think the room is really pricey but I think for its price, this hotel is the cheapest room at the most strategic location. It was good stay.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Timmins", "Title": "“Came down from my resort at carriage...”", "Author": "mackster101", "ReviewID": "UR82427733", "Content": "Came down from my resort at carriage hills for 4days. Front desk staff very friendly and helpful checked bags in while we toured city by bus, great way to see sites then decide what to see. Room was small but clean and nicely done, air conditioning was not working. Room was located on 2nd floor where they take you in for the tour and try to hard sell you, when you show no interest they boot you right away answer pretty rude about it. Once that crap is done enjoy the free meal voucher for a hundred bucks and go out and enjoy the city. Location is excellent central park is close by and great for running, times swayed and broadway all within walking distance so for that alone stay is well worth it here. I would never buy here though so be prepared to get a hard sell throw that aside and enjoy NY", "Date": "October 7, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York City, New York", "Title": "“Terrible deal for the club owners”", "Author": "fibonacc", "ReviewID": "UR81389203", "Content": "As one who bought into the Manhattan Club 2 years ago, I have to say that owners are treated very poor. We have never been able to book the nights we are \"entitled\" to. This is a typical bait and switch, ponzi scheme. THE ONLY WAY FOR ME TO BOOK is at least 9 months ahead and this doesn't work for me. TMC can care less about its owners, but love prospects....and their \"new\" money. The stuff is rude and aggressive. Biggest mistake I ever made, and now I cannot sell it on the secondary market as they require a primary position for sales. What a racket.... Has the NY Attorney General been contacted yet?", "Date": "September 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg South Africa", "Title": "“Great Location Awful Staff”", "Author": "friendlybear", "ReviewID": "UR80948210", "Content": "The location and room quality cannot be beaten, however the staff are surly, unhelpful and in short make you feel that they are doing you a favour by letting you stay there. We stayed at the Manhattan club as part of an RCi Timeshare exchange and were compelled to attend a sales presentation as part of the exchange. Once we made it clear that we had no interest in purchasing after being exposed to some high pressure selling by two individuals who would be more at home in a gangster movie, we were treated like parhias. We did however enjoy the $100 dinner voucher they had to give us for attending.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Puerto Vallarta", "Title": "“Would definitely stay again”", "Author": "1norcalman", "ReviewID": "UR80830770", "Content": "We traded our time share in Hawaii for a week at this time share in New York. Check-in was quick and easy with a friendly staff. Concierge was very helpful. Our suite on the 21st floor was \"roomy\" for New York standards with a small kitchenette, small living room/dining area, comfortable bedroom and clean bathroom. Cable TV is expansive with about 80 channels (though none in HD). Though in NYC, the room was quiet, and we had partial city views. The location is awesome. Walking distance to two subway stations, Central park, Times Square, and lots of shopping, restaurants, grocery stores (including Whole Foods). The maid service was excellent, and the room was cleaned thoroughly each day. There is an excellent gym on the top floor with universal machine, free weights, bikes, and cross trainers. And, a business center is available with several desk tops and a printer. The only downsides ... the elevators are VERY slow. At times we waited more than ten minutes to get an elevator. And, the only thing slower than the elevators is the Internet. It is complimentary, but honestly, it is as slow as dial-up much of the time. If you're planning on doing work while in NYC with your laptop, you will likely be very frustrated and wish you stayed elsewhere (and don't even think of looking at anything on YouTube ... it will lock up tighter than the vault at the nearby Bank of America). But if you just want to check email or a couple of website, it will likely be OK. Overall, we loved our stay here and will likely return.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“NEW YORK, NEW YORK”", "Author": "screenname009", "ReviewID": "UR77555752", "Content": "Having read some of your other reviews we were concerned about this week, but got there to find that we could not understand the critics. We are timeshare owners who have exchanged to various places and this was a very food one. We only had a studio but it slept 4 there was a large bed and sofa bed. The room was large and well furneshed, lots of wardrobe space which we were evan able to fit in the 3 suite cases we took. There was a half kitchen which was fine for those who do not want cook, which I avoid on holiday. There was a microwave and dishwasher. Tea, Coffee and popcorn was replenished each day. We have stayed in New York once before and this was a much better room both in size and furnishings. This hotel is close to Central Park, Times Sqare and Carnegie Hall. Also walking distance to the Naturnal History musum New York Zoo and the Guggenhiem Museum.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Great place to stay while visiting New York”", "Author": "JDBytheSeaBoston", "ReviewID": "UR77155051", "Content": "We just stayed at The Manhattan Club for the first time on a Monday and Tuesday night. The whole family loved it and we had a great time. I was concerned given some of the past reviews, but was pleasantly surprised when we arrived. We pulled up to the main entrance and were greeted by a very friendly doorman who valet parked our car and mentioned the still-great parking rate of $28/night (a real bargain in NYC). The bellman brought our bags inside and we were greeted by James at the front desk. There was no line at all and he checked us in quickly, could not have been more friendly or helpful, and made us feel very welcome. It was 3:00 and our room would not be ready until 4. We left our bags with the bellman and headed out for some shopping on 5th Ave. which is a very short walk. Our room was ready when we arrived. The elevators to the 25th floor were not a problem at all. Sometimes there was a short wait, but other hotels have been much longer -- try the elevators at the Marriott in Times Square, what a nightmare. We had a 1-bedroom suite with a sofabed in the LR, for 2 adults and 2 kids. There was plenty of room, though the sofabed looked very uncomfortable. We took advantage of the kitchenette and dishwasher. The kids were able to eat breakfast in the room and we were actually able to bring back our leftovers from lunch and eat them for dinner. A nice option to have. The air conditioning worked great. We like it on the colder side, but I could see how some people might think it too cold. The weather was cool and rainy, so even with the fan turned off on the a/c the room was a little chilly. As I said, good for us but maybe not for some. I would always prefer too cold over too hot. We also used the fitness room. It is one of the best hotel fitness rooms I have seen. Very large and with good equipment. Being so close to Central Park, I was also able to go running in the Park. Overall, I would recommend The Manhattan Club. You can't beat the location with the proximity to Central Park, 5th Avenue, and Times Square. The staff were very friendly and approachable. Can't wait to go back.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Island, New York", "Title": "“management responsive to complaints”", "Author": "Teachtag", "ReviewID": "UR76736971", "Content": "I purchased a timeshare at this hotel 3 years ago and several times I experienced difficulty with the room temperature. After complaining to management, I am happy to say that management has been responsive and sensitive to my needs since each time I stay at this hotel. The location is amazing. I walk to Central Park, the theater district and the museums.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "ashington england", "Title": "“Terrible Customer Service Rude Reception & Maid”", "Author": "brianridd", "ReviewID": "UR76347580", "Content": "First the good good points Location is Suberb.No need to get subway as it is close to everything Times Square and Central Park. Treatment on check-in was a disgrace we had a Metropolitan room which was next to the hotel aircon unit which was just outside the room on a flat roof on the 2nd floor. We asked to move to another room which after a few moans the receptionist reluctantly agreed to do. The new room was only 2 doors down the replacement room was worse than the original A damp smell, on returning to reception I was told there were no more rooms so I asked if we could change back. Her response was I canâ€™t keep on changing rooms It was 11pm there was no one else in the reception finally we got the original room back. The maid was very was rude as well asking why we needed or sheets changed half way through our 7 night stay, considering we were paying 15 dollars a night for the service. Hotel needs to sent staff on customer service class.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“It was fine”", "Author": "wannabefree", "ReviewID": "UR75795000", "Content": "The hotel is in a great location, rooms are definitely ready at 4pm, not earlier. The staff was courteous. We were travelling with our 21 and 22 year old daughters, we stayed in a 1 bedroom suite, primarily because it had to full bathrooms. We decided it was more economical to stay in the 1 bedroom suite with a pull out couch for our daughters than to rent two rooms. The space was fine but the sofa bed was really uncomfortable. I'd probably stay at this hotel again but would not subject our daughters to the sofa bed. The only issue I had with our room was that it always felt a little too warm, and VERY humid. In fairness to the hotel, I never called them to complain, we just weren't in the room that much. Having the kitchenette area was handy, grocery store close by so we were able to eat breakfast in our room each morning. We avoided the slow elevators by using the service elevators which were not fancy but were quick! We also did not have any view whatsoever, our windows faced the interior of the building, brick walls, so there was no natural light in our room at all.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Louisville, Colorado", "Title": "“Great Location, but a bit lacking”", "Author": "DocBrien", "ReviewID": "UR74356387", "Content": "We are owners at another vacation club and were able to trade for a week at the Manhattan Club. Since my wife had never been to Manhattan before, we were really looking forward to our stay. The Manhattan Club is in a great location, 3 blocks from Central Park, 3 from Columbus Circle, and about 10 from Times Square. Our welcome to the Manhattan Club was excellent with a Bell Hop right there to help with our bags. Check in was easy and our bags were delivered to our room. Be aware, the room we had was not at all like the rooms you see on their web site. Our room was on the 21st floor and had no view (to be expected in Manhattan), but the room was tiny; only slightly larger than a room at standard hotel. The furniture was not the highest class. All of the \"suites\" come with a refrigerator and microwave. Our microwave never worked, despite notifying the front desk and a promise of it being repaired. Housekeeping is acceptable, but spotty. I noticed a piece of string on the carpet the 2nd day, and it was still there after the 7th day. Give yourself plenty of time when leaving your room, as the elevators are very slow and run on a bizarre cycle. We pushed the down button and actually watched the elevator pass our floor four times going both up and down. Every guest we spoke to commented on it. Some who had been coming to the Manhattan Club for years said that it was actually much better than it had been in the past. I shudder to think what it was like in the past. The lobby staff, housekeeping, and concierge were all very courteous and helpful. The biggest negative for us were the repeated phone call requests to attend a \"property tour\" and get free show tickets. We had already purchased show tickets and didn't care to sit through a sales presentation for Manhattan Club ownership, so we politely told them \"no\" - four times. The last time we actually had to tell the \"leave us alone\" to get them to stop. Free WiFi is included with your room, but it is so slow as to almost be unusable at times. Still it was helpful to us, when we could get it to work. All and all, I would recommend this property if you can put up with the pushy sales people and the small rooms. Not good for families.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Great place to visit, not a great timeshare to own”", "Author": "snork314", "ReviewID": "UR73897622", "Content": "I am an owner at The Manhattan Club. It is a terrific place to stay and the hotel is nice and the staff is professional and couteous. If you are thinking about purchasing a timeshare at The Manhattan Club, buyer beware. The resale value is less than 10% of the amount you will pay if you purchase directly from the onsite sales/marketing staff. The reason is that the annual maintenence fees range from $1,800-$3,000/yr. Read notes from Aug. 4, 2010 owners meeting at tmcnyowners.com.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tracy, CA", "Title": "“Great Location - Spacious room”", "Author": "tripsntraps", "ReviewID": "UR73866443", "Content": "3 blocks from Central Park, 1 block from the Metro, around the block from Carnegie Hall, 15 minute walk to Times Square -- all these add up to one good reason I will re-book (stayed 8 days) when I return next summer. Do Expedia or Priceline otherwise, you'll be paying a lot more if you go through the hotel...unless you do the 90 minute timeshare presentation, in which case the discounted price is about the same. Manhattan Club is far enough away from the maddening crush of tourists but close enough to everything. Area is safe. The kitchenette in our one bedroom was great to have -- there is a supermarket 2 blocks away and of course lots of restaurants all around. Skip the continental breakfast on the 26th floor. It's overpriced. Room was spacious enough for 4 people. The pullout sofa bed in LR was comfortable. Service was good. Asked for 6 extra pillows (3 of us have back problems) -- housekeeping balked for a second then sent them up within 2 minutes. Our room, 2513, was 104 degrees when we arrived at 10:30 pm. Called down for service and an engineer was up in 2 minutes. Meanwhile housekeeping sent up a fan and two bottles of chilled water with a note of apology for the inconvenience. Took a while to cool down but it finally did. Stingy with the coffee -- asked for extra packets and they wanted to charge us. Complained to Asst. Mgr -- left voice mail -- never got a call back. Leaving really early? Go around the corner and grab a cab. Don't let the bellman tell you there may not be any cabs at 4am and convince you to pay $50 for a private car to LaGuardia. This is NY after all! Take advantage of Concierge service if you're looking for hard-to-get Broadway show tickets. They have a runner ($25 service fee per tix) who will grab tickets for you at group rate, no higher than mezzanine seats...so you're not sitting in nosebleed seats. They call you on your cell if they were able to get them and you pick them up at the Concierge desk at end of day. No waiting around. You end up paying full price with the service fee but it beats spending your entire morning in the heat, lining up for cheap tickets at Time Square. Forget the tour buses. Grab a guidebook and walk. Much more interesting and free! Friends took us to Spice Market--trendy, with excellent cuisine, in the Chelsea Area. Take the bike guided tour in Central Park if you've never been there. We negotiated our fee and got an hour's ride for their usual 30 minute tour (must've been a slow day--did it on a weekday, later in the p.m.).", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Very enjoyable stay”", "Author": "naigib", "ReviewID": "UR71598564", "Content": "Was a bit concerned after booking this appartment to see some negative reviews - but they were totally unfounded. Stayed for a week with partner and 15 year old daughter in a smallish but stylish room with a very comfortable sofa bed, small but classy kitchen area and lovely bathroom; which was beautifully serviced daily. No view to speak of (this is NY) but great location for Central Park, Fifth Avenue, Broadway, Times Square, Midtown; and subway to go any further. The buses are also very handy for nipping on and off to cover shorter block distances (and cool off) and were included in the weekly subway pass; which was good value. Subway can be a bit confusing at first - but easy to work out where you are lost because of the 'block' system! There was a very brief telephone attempt to interest us in the timeshare options but no further hassle when we politely declined and contact with staff was always polite and courteous. The lifts were usually fine although they could be slightly slow at busy times - but no real problem. Took the stairs a couple of times (from 2nd) and they do deposit you directly in the lobby of the adjacent hotel - which is slightly confusing at first; but again, no real problem! We all loved the 'hotel' and New York and will return to both!", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taylorville, Illinois", "Title": "“Location!!Location!!!Location!!going to return”", "Author": "mkb607", "ReviewID": "UR71408035", "Content": "My cousin & I just spent a week in a studio apt. One of the best things about the hotel is the location. It is a very nice hotel, clean, good service, nice employees & a great location. We had a very small kitchen area, microwave, frig, coffee pot, dishes, yes they are plastic. We had breakfast everyday in the room & also stopped & picked up something from the vendors on the street or at World Foods & had lunch or our evening meal a couple times. It is true that the elevator is slow at times. We were on the 2nd floor, so we did not really have a problem. We did not know when we booked that it is a timeshare hotel. We did have maid service everyday. We did go to the sales presentation, & there was no high pressure. we did buy 5 nights to use at a later date. We want to return to NYC Christmas time of 2011. We were given two free tickets to see South Pacific which was within walking distance at the Lincoln Center. There were theaters, restaurants, fast food joints, subway, of Central Park all very close. This was our first trip to NYC & it was much easier to get around that I thought it would be, also not as expensive as I thought. We were very lucky to have a Big Apple Greeter met us our first day there. We have to say a special thanks to S to also to BAG. They have a great service. I would recommend the Manhattan Club. Like I already stated, we have already paid for our next trip. I almost forgot about the Today show. We walked to Rockefeller Center & saw the announcers from Today show. Again great location.", "Date": "July 18, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "South Africa", "Title": "“Brilliant!!”", "Author": "R2D2CapeTown", "ReviewID": "UR70719670", "Content": "My wife and I spent a week at the Manhattan Club (over the 4th July weekend 2010) and all I can say is that the overall experience was wonderful. As confirmed by previous members, the location was awesome. The lifts worked fine too! The staff were friendly (especially Lizette - what a pleasant front desk assistant!). I would definitely return to this location. Mr. R Jaga", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern California", "Title": "“Liked it Alot”", "Author": "tempdragon", "ReviewID": "UR70354514", "Content": "Recently stayed at the Manhattan Club. It was a timeshare exchange through RCI. Check in was quick at the Manhattan Club. We were assigned to an interior view 1 bedroom on the 24th floor. The room was clean and the facilities were in good shape, minus the elevators as others had mentioned. It was slow. It seemed to me the issue was that two out of the four lifts were reserved for the penthouse units/floors. Several times, we used the two freight elevators behind the lobby. The suite was kept nice and cool and noise wasnâ€™t an issue. The 1 bedroom consists of a bedroom separated from the living area via a door. In addition to the one bath in the bedroom, there was a Â¾ bath in the living room area. This was nice as there were 3 of us. There was a microwave, however no cooking stove top. There was a mini fridge in the room. Itâ€™s NYC anywaysâ€¦ Who cooks? Daily cleaning was provided and the housekeeping staff did an excellent job everyday. All the staff appeared cheerful and we experienced no problems. The were no spas or pools, however there was a good gym on the top floor. There were 3 flat panel TVâ€™s along with all the necessary machines, including free weights to work off all the great meals to be had nearby. I slept on the sofa bed one night and that was enough for me. Did not feel comfortable, but was okay with my little one. Overall, liked it a lot. It was in a great location with the subway a block away. You couldnâ€™t ask for a better location. Tip: at 55th Street and 9th Avenue, there is a laundromat where you can do some laundry if you have to. Also next door on 9th Avenue, there is a bike shop, Liberty Bicycles that rents bicycles for $6 an hour. Looking forward to coming back.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“All you could want and more!”", "Author": "campo84748", "ReviewID": "UR69234799", "Content": "Ive been to this hotel/ timeshare resort many times. I try to get it on ebay for a discount on a minutes notice. I do live in Brooklyn and it seems worlds away from the city so we like to go now and then and stay, eat, drink & play in the city center. The manhattan club is perfect. The location is perfect, right near central park, carnigie hall, times square, countless other attractions like the met. Most rooms have a seperate bedroom with a huge cozy king sized bed. Top qualtiy sheets, Ice cold AC. Flat screen TVs. 2 1 in the living room and 1 in bedroom. 2 beautiful marble bathrooms. Bathrobes. A kitchenette with everything but a stove (Hey NYC is for eating out!). 2 walk in closets, iron with ironing board, sleeper sofa..living room furniture. All very very nice. Remember this is more timeshare then hotel so dont expect room service but so many places nearby deleiver whatever you want round the clock. These units have much more then most NYers live in. Much more. Understand that before you complain about these units. Your not in Disney, your in NYC. That being said you wont be spending a lot of time in your room, though you'll want to because they are that comfortable. If i had a complaint it would be that someone called me to ask i wanted to take a 90 minute timeshare tour for 100$. I said no thanks and that was that. Carpeting could use a cleaning in the room, but again, no biggy. I love this hotel and location and i will return as much as i can!!! Once youve stayed in another hotel in NYC you will see you get no room at all, and this is beautiful and clean. No bedbugs or anyother things you could fine even at the waldorf. Free wi fi and use of computers and printers in conference room. Free breakfast included.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“swish apartments, clean and very well located”", "Author": "dancingpotato82", "ReviewID": "UR67399803", "Content": "very clean and the apartment was big enough for 3 of us, the sofa bed was a little uncomfortable and the fridge noisy but, the rest of the amenities made up for it . Would definitely stay here again, it was a really wonderful place to stay", "Date": "June 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Don't Come with High Expectations”", "Author": "icecubebabbee", "ReviewID": "UR67224595", "Content": "Booked this room through an RCI (timeshare program) special. The photos of the rooms were lovely and looked extremely spacious (then again when do they not). I was a little skeptical and had to call the hotel to make sure that it was enough for my family of four. The front desk assured me that a STUDIO (in NY?! ridiculous) was enough to fit my family, so I went with it. The price was fairly reasonable for New York ($300 for the night, which at NY is reasonable) and I love New York to bits. I was so excited as I arrived in Manhattan and began looking for the hotel out of the car. The lobby was mediocre at best and having lived in the Waldorf and the Hilton, the lobby did not even compare with those fine hotels. The first red flag was that the room was not ready at 2pm and later at 3pm. A lady in front of us in the line complained that she had been waiting for her room since 7am in the morning. The bellhops were no better. There was one tiny skinny man and a bigger one. The bigger one left the skinny little one to do most of the work (mind you, we had seven pieces of luggage) and gave us attitude when it came time for the tipping. Obviously we gave the smaller one a substantially larger tip, at the expense of us having to quarrel with an obnoxious bellhop that felt his tip was too little. The room was a lot smaller than what I had imagined and smelled strongly of cigarette smoke, even though it claimed to be a no smoking room. I was furious that the front desk felt that the size of the room would be suitable for a family of four with two teenage boys. After some reasoning with the front desk, they gave us a slightly larger room but was still way to small for my family. Now it wasn't all bad, even though it seems like it is. I found the bathroom to be of a generous size, especially for New York. There was also free wifi which surprised me a lot! The location is also impeccable. Overall, I would not book this hotel ever again, especially for its selling price of around USD $500. It really dampened my experience in New York.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“Definately not the room on the website!”", "Author": "Fortyniner", "ReviewID": "UR65723702", "Content": "I researched hotels in Manhattan extensively and my final decision was based on photographs and amenities information online. We were booked in for over a week and I was shocked to find our room was not as expected. We had no view of anything - in fact our window was frosted over!!! Dark and dingy .The room had not table and chairs or a dishwasher. Though who needs a dishwasher when this time share provides only PLASTIC knives and forks, plates and tumblers!! Talk about picnic in Manhattan!! Not even a wine glass for a civilised drink at the end of the day. I rang the front desk to confirm we were in the right room given the photograhs etc and they just said \" well not all rooms have a table and chairs\"! Housekeeping was excellent. Lifts ARE VERY slow. Front desk at check in very efficent and welcoming. I would advise that unless you are genuinely interested in buying into plastic timeshare your time can be much better spent waiting in line in Times Square from 2pm daily for half price tickets to the show of your choice. Try the EUROPA Cafe for eats as well as DUKES who have a comprehensive buffet. This hotel is in a great location but there are lots of others around too. We really got the dud room so based on that I won't be recommending to friends and colleagues.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san diego,ca", "Title": "“Very good experience”", "Author": "prissySanDiego", "ReviewID": "UR64079422", "Content": "We stayed for a week on our RCI points in a full one bedroom (suite 2401) There are 113 one bedroom units on floors 12-25. They range from 500-700 sq. ft. Ours was 622 sq.ft. at the end of a hallway next to a storage room so it was quiet. The windows looked out to the so called courtyard which was a brick building well. Not a problem for me because I didn't come to NYC to sit in the room and look out the window. I was glad I didn't get the 56th street side as it might not have been so quiet. When you take the elevators (2 of them on the smaller size) watch to see if it skips your floor. Housekeeping told us they sometime get \"keyed\" to skip floors. If so- head around the corner to the service elevator which is never busy. Can't complain about the elevators as other have done. Both elevators are clearly marked- just look for the signs. We arrived on a Friday night from JFK. Before we could get out of the town car ( use Carmel car service- fabulous and $5 less than the taxis) the bellman had removed all of our luggage from the trunk and taken it inside. There was another bellman to great you. We arrived at 6pm- no line-very very nice polite check in. Our bags were promptly delivered to our room. The suite has a bathroom with tub/shower which is quite large and shower only bathroom that is small/medium size. Nice linens on a king bed in master. They will give you a rollaway bed if you don't like the pull out couch bed. My friend didn't mind it. We anticipated the dreaded bar found on most pull out couches, but it wasn't there. Maid service was wonderful. On the first night when we returned to the room at midnight we couldn't figure out how to shut the windows we had opened and initially thought there was no air conditioning. We called for assistance. With 2 minutes a maintenance man was there to show 2 women how to close the windows and an engineer to show us how to turn on the air conditioner. (Can't ask for better service than that) They have express check out and handled our bags beautifully. We had a Manhattan cocktail (thought it appropriate on our first night) at the bar on the 26th floor. It was $14 but it was perfectly made. There was a bowl of nibble snacks with the drink. Owner services (the Ambassador Club/sales office) called me a few weeks before my arrival and told me to call the front desk 2 weeks in advance if I wanted to make any special requests. The 1 bedroom suite is good for 2-4 people. More would be too cozy. We went to the business center on the 26th floor to quickly send postcards(check out the Manhattan Club website- they have really cool on line postcards to send) and to run boarding passes. A lot of people hogged the 6 computers and looked like they were working, rather than doing quick checks. It was ridiculous because they have free internet access in the room- just bring your laptop with you if you need to spend that much time on a computer. I will definitely return to the Manhattan Club. I am a very particular person and often RCI properties are not to my standard. This was not the case here.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wallingford, Vt", "Title": "“This was a real treat, location, service and safety. Couldn't ask for more.”", "Author": "Sassy05_10", "ReviewID": "UR63269745", "Content": "We had a wonderful stay, close to everything and the concierge was so helpful. The unit was clean and had all the necessities. Location made our stay wonderful and woke up to look out the window at Central Park. Would be happy to go again.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cypress, California", "Title": "“Good Service... GREAT location!”", "Author": "vegasbaby143", "ReviewID": "UR63138477", "Content": "After witnessing how poor service was previously at this property, I was pleasantly surprised at how nice and efficient the staff has become since our first visit. A special â€œshout outâ€� to Christina at the front desk, even after a long night shift, she was professional, pleasant and helpful with our early check-in! Much different than what we experienced in the past. The housekeeping staff was on top of things all week. Our two JR. Executive suites were in good condition. The head of housekeeping was really concerned about a spot on the carpet. He made sure it was taken care of before we checked in one of our rooms. This unit is the 1 bath unit. There is plenty of room a for a couple. The mini fridge, microwave, dishes and dishwasher are all you need in Manhattan. We were on the 21st floor, so street noise was not an issue for us. FREE Wi-Fi! The gym is really nice and well equippedâ€¦ along with the penthouse bar / lounge. The many complaints about the â€œslowâ€� elevators can be avoided by using the elevators to the left of the front desk when possible. A non-issue for us. The location is as good as it gets in Manhattan. Close to Central Park, Times Square and more importantlyâ€¦ multiple SUBWAY stations! As far as the t/s presentationsâ€¦ though one of the managers and I disagreed on a few thingsâ€¦ the salesman was a pro. Since we are in sales, high pressure is not a problem for us, but he was not that way at all. If we could justify the maintenance feesâ€¦ weâ€™d be owners. For now, weâ€™ll have to settle on trading or renting there. That said, the property is in good condition and exceeded our expectations. We would stay here every time we visit NYC if possible. Last, itâ€™s good to see MC managementâ€™s on TA. It shows they care what travelers have to say. Ratings: Location 10â€¦ Service 9â€¦ Unit 8. We will be back!", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lafayette, LA", "Title": "“Great location, decent room, nice front desk staff”", "Author": "bandman", "ReviewID": "UR62576653", "Content": "As everyone has mentioned, this hotel has a fabulous location. One block from Broadway, the subway, two blocks from great food on 8th avenue, and 2 blocks from a great little grocery/deli on 6th. If you are like us, and you go all day long and will enjoy a meal back in your condo/room, try the Ernst Klein Fine foods. Among other things they had the best chowder I tasted while in NYC. The rooms are nice sized by NYC standards with two very nice baths in each 1 BR condo. The bedroom is about the size of a normal NYC hotel room, and then you have a living room with a small, yet functional, 4 seat dinette. The partial kitchen has a fridge and a microwave. If you will need one, bring your own bottle opener. I find that the unit needs some major updating, but when you are in NYC you leave in the morning and go home in the evening. My family probably spends more time in the unit than most, and we enjoyed it. Several of the people have posted about rude front desk employees. I found the front desk to be great. The concierge was rude, as was the bellman named Jason who actually questioned the amount of the tip I gave him. I should have taken it back, but I didn't. I did speak with the office in Pennsylvania prior to going to NYC. I will say that the people on the phone from the main office were among the rudest people I have ever dealt with at any hotel. They were not onsite, so once you get there you do't have to ask them anything. Elevators -- not bad at all -- not even once during the week did we have an unacceptable wait time. On a scale of 1-10 I would have given the Manhattan Club a 9 based primarily on location.. For TA it is a solid 4 out of 5.", "Date": "April 27, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“DREARY DUMP.”", "Author": "alan6668", "ReviewID": "UR61622292", "Content": "Needed 1 bedroom suite which the booking company assured us of. Their \"suite\" was only a single room unsuitable for a family. The room in no way resembled the misleading picture on their websight. When you book, they charge your credit card and consider it non-cancellable. After taking 1 look at the dingy room, we refused to stay and then spent 4-6 months fighting with them to get the charges cancelled which they refused. Finally, VISA was kind enough to back us up and cancel the charge. Stay away at all cost.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Boston", "Title": "“False Advertising - Not Upper Class Place At All”", "Author": "Imfullofwonder", "ReviewID": "UR61152969", "Content": "Do not stay here if: 1. You want a room like the pictures found on their website online. What you REALLY get is not a suite at all but a small room with a bed in it and a two person sofa that pulls out into the most uncomfortable of \"beds\". The springs polk through - it hurts when you roll over. The fridge is the size of a cardboard box and it's under a counter. No table, no chairs. 2. You want the air conditioner to work. It was HOT! We had to ask housekeeping for a fan to be able to sleep; and it was April! 3. The elevator to work. It doesn't. Get on your walking shoes! [And your pepper spray] The stairs and hallways are dark and kind of scary. 4. The door to lock. It didn't. We moved the furniture in front of the door for the night to feel more secure. 5. Someone to help you. We asked the front desk to help us with all these things and they basically brushed us off like lint. Not helpful at all. I never write reviews but had to in this case; I was VERY disappointed!", "Date": "April 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "California", "Title": "“Great location”", "Author": "LTRCalifornia", "ReviewID": "UR61110886", "Content": "Second visit to the Manhattan Club. Both times we went with concerns after reading reviews. We had no real problem. We asked for an outside room which we were given. Only problems were that room was a bit stuffy so we had to open the windows. Also, there was no bedside table with a reading lamp on one side of the bed. We requested a floor lamp, but they wee unable to find one. The elevators were not a problem and our interactions with the staff were all fine", "Date": "April 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Midwet", "Title": "“Great location!”", "Author": "jeannicer", "ReviewID": "UR59927587", "Content": "The best thing about this place is the location. 3 blocks south of Central Park, 3 blocks from Times Square. Rooms are average size for NYC. We had a one-bedroom which was sufficient for our family of two parents and two teens. The room was remodeled and nice. Comes with a microwave and dishwasher and coffee pot. Coffee and tea provided. No stove or oven. Pull-out sleeper sofa was very uncomfortable, as most are. Our kids took the mattress off and put it on the floor every night. Extra charge for daily housekeeping but it was nice to come back to fully cleaned room every night. Warning about the elevators: they won't stop on your floor after they are loaded to a certain weight limit. After waiting for 10 minutes for an elevator to stop, we got smart . After that, we pressed both the up and down buttons so that whatever one was empty or near-empty would stop. We ordered pizza and pasta and sandwiches from nearby Ray's pizza and the food was good and cheap and huge. Could have ordered 1 entree for every two people. Take the short walk west to 9th in Hells Kitchen to eat. Food around Times sq is insanely expensive and bad. Food in Hells Kitchen is great and cheap. Azuri has the best falafel EVER. Even our kids, who swear they don't like falafel, loved it. West Way Diner cheap and good.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbia, Maryland", "Title": "“Good value and good location”", "Author": "skreps99", "ReviewID": "UR58435056", "Content": "We stayed at The Manhattan Club for 3 nights in March. I had booked as a hotel, not as a timeshare exchange, and the price was reasonable and comparable to other Manhattan hotels. We only had one phone call asking if we wanted to tour the property for broadway tickets, dinner, or Visa card. We said no. We pulled up in the car and the valet took it for a tip and $28/day. Easy. We were early and allowed us to register but had to wait till 4pm for the room. They gave us an option of waiting in the lounge on the 26th floor. We stowed our luggage with the concierge desk (for tip) and hit the streets. Returned at 4, got the room and the luggage was delivered. (tip). I was surprised our room was smaller than the picture showing the round table, but it was fine for just us two- comfy bed, nice sofa (bed), ottoman, furniture closets and flat screen over a desk, mini kitchen with fridge and plastic serving ware, small but lovely bathroom. We were only on the 2nd floor, but the noise didn't really bother us. Another reviewer has posted pictures that were almost identical to ours. The location is super, with Central Park, metro, restaurants, MoMA and shopping nearby. We ate at Carnegie Deli, just around the corner (and others farther away) The exercise room is very well equipped. We had free wifi with easy hookup. My only real complaint was that we could have used another luggage rack in the room (there was one) as we didn't fully unpack. I used the only other chair for my suitcase, but then we had none for the desk area. But, then, when we requested a DVD player, the housekeeping quickly brought (tip) a HUGE ancient concoction of double dvd/vhs which needed to be used as a tuner for the piggyback dvd player (????) and mammoth cables hanging all over the desk area. That took up alot of space. Was quite unsightly. OK, it was raining, so we watched our own Netflix some! I'd stay here again. In this pricerange, it was the best hotel I've been in in NY.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Enjoy stay but do not go for the timeshare presentation”", "Author": "dancesforlove", "ReviewID": "UR56041936", "Content": "Pros: Great location!! We had a nice room with two baths, two wide screen TV's with full cable AND moviesand were able to bring in food to eat in which was nice. Right near Central Park. Go and enjoy stay. BUT.... Cons: Street noise is very bad bring earplugs. Slow elevators Be forewarned: they are timeshare and they are going to try to lure you in with a \"free gift card\" and take up an entire day of your vacation time trying to get you buy into the timeshare. They call and call to get you to see their presentation. Do not be fooled they are overstocked with product. Avoid the timeshare presentation of the Manhattan Club like the plague.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fife", "Title": "“loved staying here.”", "Author": "hoclinda", "ReviewID": "UR55977340", "Content": "Close to Central Park,Time Square,Broadway. Well equiped room for self catering.Staff were really helpfull and friendly.Its timeshare but we didnt have any bother with anybody trying to sell ,they left us alone which was great! This was a really good place to stay .We would love to go there again. One problem was the lifts! You waited an age for one!!!!", "Date": "February 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Long Island", "Title": "“Management is rude, incompetant, dishonest, in short, NOT a classy place!”", "Author": "welltravelled94", "ReviewID": "UR55578051", "Content": "I'm compelled to warn anyone contemplating a visit to the Manhattan Club that you, like I was, may be very disappointed with your reception and the lack of hospitality at this facility. The check-in was a nightmare! The front desk was rude, incompetant and outright dishonest. Other than it's location, this facility is less than mediocre. The one bedroom suite is small and not suited for 4 people. The elevator service is inadequate. The additional fees to have another member of your party check in first ($59.00), housekeeping ($25.00 daily), late checkout ($50.00 per 15 minutes) and others,were a huge ripoff--made me feel like I was at the 'Manhattan Vampire Club\". However, box cookies in the afternoon are free.Think twice bebore coming here.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Houston", "Title": "“Nice Break at our home away from Home!”", "Author": "4150", "ReviewID": "UR54092211", "Content": "This was our second stay here and boy were we surprised! They put us in one of their newer rooms, yay! We came in at 1pm and they held onto our baggage an no fee...we just tipped. We always exchange our timeshare when possible at this particular hotel due to the location and ammenities! We love having a mini fridge, sink, microwave, and they even provide coffee, popcorn, plates, cups, utensils, and bath & body soaps everyday! I always left a tip before housekeeping came in. We noticed the fresh flowers in every floor which was new since our last visit. You have free use to their business center so we didn't take our laptops, which is great! We were asked at check in if we were interested in the timeshare presentation, but I let them know right away that we already owned some and were not interested...they never asked again! Bring Ear Plugs 'cause no matter what floor you're on you'll hear everything outside! The studios had a $15/night service fee which they say goes towards the staff and business center. Larger rooms have more fees... Took Limo Service from airport which was less than taking a taxi ( I save $15 per trip this time), so I don't know about their parking fee...I'm sure it's high! Easy to catch a cab or get on the subway from their entrance! We stayed for 4 nights this time and paid our exchange fee of $99 plus $60 at check out for maintence fee. I think that since we purchased our timeshare (another location) that it was worth the savings at much higher end hotels. We will definitely come back here as often as we can! Many nice restaurants are walking distance, but we loved all the Ethnic Restaurants on 9th ave...our favs. were Empanada Mama, Eatery, Q Thai Restaurant. We also went to Mariella for some pizza just like Gail & Oprah recommended, Papillon for Sat. Opera Night, Serendipity, and Carniege Deli! Many delis and grocery stores are just around the corner. Time Warner building on Columbus Circle is where we hung out when it rained plus they have a whole foods...brought back dinner for that night. If you want dim sum take a taxi to Ping's on Mott St. Yummy!", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ocean City MD", "Title": "“Brilliant Location- comes with some baggage”", "Author": "Surfed69", "ReviewID": "UR52597851", "Content": "This is a timeshare hotel, but it was not clear this is what we were getting into when I booked online through their website. The booking was just like booking any other hotel. Then the emails and phone calls started, trying to sign me up for a tour of the property (of course they give you a voucher for dinner or something like that). One phone call to me before our trip confirming our reservation was completely wrong, that worried me a bit. Part of our package was for a continental breakfast for two in the members club and a free days parking(their parking rate for our 5-day stay was very reasonable $28/day). Glad I didn't pay for the breakfast. Our room was clean, the mattres was excellent, the master bath was tiny, the second bath off the entrance to our suite was much better. The \"Courtyard view\" is a window to 3 walls of other buildingsThe workout room is large and well equipped. They offered free internet connection but had to ask for it. They didn't offer it up and it wasn't easy to connect. Location, location, location! Can walk to everything mid-town has to offer. Overall a good stay, reasonably priced, not over the top fancy but well priced for location.", "Date": "January 4, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Diego", "Title": "“Absolutely Perfect, from a tough critic”", "Author": "sinasohn", "ReviewID": "UR51973765", "Content": "This is my kind of place, spacious, clean, first class, free wifi, great service, AMAZING location. I was amazed that I actually found something with my RCI points that I thought was great. My wife, who is pickier than me loved it too. We have a big family too and there was plenty of room. Two bathrooms was helpful.", "Date": "December 27, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Santa Cruz, California", "Title": "“The Manhattan Club”", "Author": "lunaticcorpse", "ReviewID": "UR50376287", "Content": "I found this hotel to have very comfortable accomodations. Travelling with a family or group, it is ideal as a place to sleep and relax. The services were excellent, catering to just about every need and giving excellent suggestions, whether it be for dining or theatre or a museum. The location is perfect. Right between Times Square and Central Park and across the street from Carnegie Hall", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Torrance", "Title": "“Centrally Located”", "Author": "jtvargas", "ReviewID": "UR46401206", "Content": "Our experience staying at the Manhattan Club was pleasureable. We stayed in a one bedroom and it was spacious for New York standards. There was a fitness room on site,but we didn't use the facilities. They served fresh coffee and tea and cookies from 11am - 4pm in their Owner's Lounge. It's centrally located. We were able to walk to Central Park, Times Square, Broadway and subway entrances.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Mexico", "Title": "“A Great Deal If You Can Get It.”", "Author": "jerrymsf", "ReviewID": "UR46107620", "Content": "My wife and I stayed for a week in September. This was our second stay here. Both times we were in a one bedroom suite. The suite consists of a separate bedroom with a king bed, flat screen TV, closet, plenty of drawers and a bathroom with tub and shower. Then there is a separate living room with a TV, an eating area, a mini kitchen and another bathroom with a shower. There is daily maid service, good towels and bath amenities. We were on the 25th floor with an east view and windows that opened. The decor is functional, mid-level but clean and more than adequate. On our stay the elevators were running and our limited staff encounters wer also fine. We had done the time share tour last visit so they left us alone. I read the mixed reviews. I know they were having elevator problems but they are now ok. Of course, the location is the best. Easy walking distance to MOMA, Lincoln Center, Metropolitan Museum, Central Park, Whole Foods, etc. Plenty of restaurants in walking distance and easy subway and bus access. From our perspective, the best part is that we get in on a timeshare swap thru RCI and the cost is minimal compared to the rack rate. As one of the very few timeshares in NYC its not easy to get into but our timeshare company seems to make a deal to make it available. Don't know if I would pay $500 + a nite but as long as we can do a timeshare swap its a great deal and a great location.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Long Island New York", "Title": "“Great Hotel with the best possible location”", "Author": "jas2004", "ReviewID": "UR38847995", "Content": "I love the Manhattan Club for its location and the energy of New York city. The hotel is well kept and the room size is large for a typical Manhanttan hotel. I can't wait to get back", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent location and value for money”", "Author": "lesorlem", "ReviewID": "UR37422714", "Content": "A last-minute booking but well worth it! Stayed here from 30 July 2009 for 10nts. Spacious rooms & friendly staff. Bath & Body Works amenities. The beds are quite heavenly. Nothing much to say about the lobby and the elevators though, but it's no biggie. We especially loved the business centre on the 26th floor - 5 computers readily available for guests to use, and you can print, too. Times Square is just a 5minute walk. Close to lots of shopping like GAP, Daffy's, etc. Subway is almost next door (57th Street) - Columbus Circle is less than a 5min walk. Very close to Central Park. We really liked this place.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“Heads up.”", "Author": "AmandaO90", "ReviewID": "UR33627411", "Content": "Lets start by saying it's 3:30 in the morning, I'm physically in my room here at the Manhattan club, and I'm so upset I had to write a review. When trying to make reservations one person told us there was nothing available for almost a year. When we tried back again a few days later, a gentleman said \" We have anything you want available, just give me the date you want to come and well make your reservation.\" and with no problem, we were booked. Strange. We get here and TRY to check in at 4 p.m, which is the check in time. We proceeded to wait 45 minutes because our room was \"not ready.\" The lobby filled in no time with people who's rooms were \"not ready.\" The front desk clerk gave us attitude for asking her how much longer it would be. If check out is at 11 and check in is at 4, does it really take 5 hours to clean the room? (word round the building:if you stay past 11 they charge you $50. But no compensation for making us wait in the lobby?) We get to the room and there are paint chips in random places throughout it. Wall paper falling off, numbers on the granite tiles (where the builders were counting pieces or something), there is a huge scaffolding outside our window, the toilet paper roll fell apart because there was no spring in it (tp now sits on the floor), the toilet seat in the other bathroom fell off upon sitting on it,all of the brass fixtures are corroding, the blow dryer burnt out, and the elevators are extremely slow. Ok, not a huge deal. The thing that did it for me was moving from the bedroom to the living/sitting room with the pullout sofa bed. The bed was broken. The entire couch came along with the bed while pulling it out. One side would come out, the other would go in. I finally wrestle it out....3:30 in the morning...to find that when I sit on it, it collapses in on me like a sandwich. I am now forced to sleep horizontally, in the crack/fold of the mattress with my feet on a chair. It makes me think, \"someone came in here and made this broken bed up with sheets, a blanket and a pillow. Then put it back into the sofa, and left it for the next customer/guest\" I am not pleased. To say the least the location is great and the internet works. The TV's do too, but the remotes are missing battery covers. The concierges were ok, got the task done, even though they bickered back and forth about a location of a certain store. This is not as upscale a place as they sell it to be. Maybe a \"Howard Johnson does Manhattan.\" Very disappointing for the amount of money they want.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "PA", "Title": "“Great Stay”", "Author": "Ferocity", "ReviewID": "UR33410803", "Content": "I was very worried after reading the awful reviews, but our stay was great. The room was large and clean, with a queen bed and a pull-out couch. The staff was friendly and helpful, and the location was great.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC", "Title": "“Great Location for Central Park & Times Square”", "Author": "broadfi2", "ReviewID": "UR33157875", "Content": "My wife and I stayed at the Manhattan Club for our annual trip to NYC for a Guggehneim exhibit. We found this place through a Home show in Maryland and knew it was a 'time-share' and we were going to sit through the 'time-share sell'. The hotel is going through renovations but great quality of the rooms. Recommend the 26th floor bar as he pours a mean scotch on the rocks (little ice). Typical elevator problem that every highrise has in Manhattan, slow rise rate so it takes a while but we were going in and out not during 'heavy-rush times'. Would stay there again for the location to Central park, Subway, etc.", "Date": "June 25, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "virginia", "Title": "“Buyer Beware...Stay at the Park Central next door”", "Author": "virginiapeanut", "ReviewID": "UR32732698", "Content": "I use to own a timeshare here. The staff for the most part are RUDE. The tv was broken on one occasion and no one ever showed up to check it. I have seen this place go from very nice to pretty bad over the years. Wall paper coming off the walls, cracked tiles in the bathroom, overall maintenace of the place is very poor. The conceirge desk while helpful, wern't there some of the time and some of them act like they're doing you a favor by helping you. Someone needs to tell them, IT IS YOUR JOB TO HELP ME! Another time the all of the elevator's were broken, yes, broken and they had us go through through the back , in a dark hall and use the service elevators. The elevators in general take forever to get too. The front desk are awful people to deal with...I showed up and they told me check in wasn't for another hour. I waited, and waited only to have some guy walk right up and get his key. When I asked why I was still waiting, there was a snappy, answer back...your room is not ready. The key is to ask are there any rooms open? They will call and bug you on the phone to buy the timeshare. DON\"T BUY!!!!! PLEASE DON'T BUY. This place started with inflated prices and now, have sky rocketed into more inflated prices. AND YOU WILL NEVER SELL IT AND YOU WILL NEVER GET YOUR MONEY BACK AND THE FEES ARE OUTRAGEOUS AND KEEP GOING UP. When I bought one I spent $20,000 and when I sold it, no one could buy it, because they have a buy back clause that they get first crack at it. You don't know if they will buy it, but no one else can either. Then when they buy it back, which happened to me...I only got $4,000. YES, $4,000. iT IS THE BIGGEST LEAGAL SCAM I HAVE EVER SEEN! STAY CLEAR!", "Date": "June 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Location, Location, Location”", "Author": "WISuzyqueue", "ReviewID": "UR30388995", "Content": "This was my fourth stay at the Manhattan Club and on this visit we landed a huge, two bathroom suite on the 22nd floor. It was by far the nicest room I've ever had in NYC. I've stayed in smaller units here which are nice but somewhat cramped. We love the refrigerator, microwave and dishwasher, which makes it nice for leftovers. The king size bed had thick comforters and even the pull out couch was comfortable. Large towels, daily maid service, robes, made it even nicer. One of the best things is the location. The subway station is just down the block so you can get anywhere in Manhattan. You are only two blocks from Central Park and across the street from Carnegie Hall. Down on 7th Ave. are the Carnegie Deli and Stage Deli to grab a huge sandwich - you can store your leftovers in the frige. You can easily walk to Times Square. The staff is adequate, not overly friendly. They had to search awhile for my reservation but once they found it, everything was fine. I would highly recommend this hotel. It is clean and very convenient to get anywhere in the City. Only gripe is elevator is very slow.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Derry", "Title": "“Dissappointing”", "Author": "AMDDerry", "ReviewID": "UR29974128", "Content": "I would not class these suites as 4* we booked a suite for 2couples which was very small and cramped. It was a open plan with living area with sofa bed and small bathroom with no window so got very steamy & stuffy.Our air conditioning didnt work and the heat was horendous when we opened the window for fresh air it was noisy. There was just enough room to get the sofa bed opened out in the living area, when opened out it was almost touching the fridge & units and the couple that slept on it ended up sleeping with the fridge door opened to try cool down. The carpet in the suite& the corriders was worn and tired. The location was good but everything else was really dissappointing especially when it was fairly expensive the pictures were very very deceiving. Much better to stay in a hotel", "Date": "May 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Scotland", "Title": "“When is a suite not a suite?”", "Author": "Sinclair60", "ReviewID": "UR28069440", "Content": "I booked one of the Manhattan Club's Metropolitan Suites (through Expedia.com) for 1st week in March for my birthday. I was very , very disappointed! On my initial booking request form I asked for an outward looking suite and as high up as was available - preferably above the 9th floor. When we arrived we discovered that our suite was on the second floor. I questioned this and pointed out that I had specifically stated that I wanted a high floor but was informed, by very dismissive staff, that ALL the Metropolitan Suites are situated on the second floor! I was really flaming mad as no one had had the courtesy or the decency to let me know when I was booking, that this was the case. Then we went up to our 'suite' only to discover that it was not a 'suite' but one room with a pull down setee! Not enough room to swing the proverbial cat in and when the sofa was pulled down you could not even squeeze past it to get to the bathroom - you had to jump over it! We had booked the 'suite' as it was supposed to have a separate bedroom (according to the descprition and photograph on the web page of their ad.) and accommodate 4 people, there were three of us, myself, my brother and my female friend, she then had to stay with my sister and other friends, as there was absolutely no way we all could have stayed there comfortably for one week. After travelling 3,000 miles from Scotland to say that I was bitterly disappointed is an understatement. I did complain to the sultry, disinterested staff who informed me that it had nothing to do with the Manhattan Club, I would have to complain to Expedia and that it could take two days to get a hold of them. I'm afraid I feel I was well and truly very expensively conned and would not recommend the web site or the Manhattan Club to anyone I know intending to spend time in NY. First impressions are usually lasting ones!", "Date": "April 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "chesterfield", "Title": "“EXCELLENT LOCATION”", "Author": "Lors68", "ReviewID": "UR27813674", "Content": "My husband & I were on our first visit to New York to celebrate our 10th wedding anniversary. We used our points system and booked the Manhattan Club 10 months in advance of our trip. Our accommodation was a junior studio which was ideal for our purpose. It was clean, functional and the bed was so comfortable (I want their pillows). There was limited cooking facilities but we had no intention of doing any cooking. Making coffee was our limit. The location was absolutely perfect for getting around New York especially Broadway, Times Square, Central Park, 5th Avenue and subways. During our week we received one phone call about attending a presentation, which we declined, and were never bothered again. Yes, we could have received vouchers for meals, tickets for shows but our time was more valuable. The only day we had a problem waiting for lifts was on check out, but it wasn't unbearable . When we go back to New York we will definately try and stay at the Manhattan Club.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "South carolina", "Title": "“Too many obstacles tarnish otherwise great location.”", "Author": "TravelinMan714", "ReviewID": "UR26807257", "Content": "This time share/hotel is in a great location on W56, between 7th and 8th Aves. Close to Central Park, Carnegie Hall and Lincoln Center. The elevator wait daily was horrible. The persistent phone calls from time share sales staff wanting \"90 minutes of your time\" was very bothersome. Bellmen and front desk staff were very indifferent. there is a lounge on the 26th floor, open to members and hotel guests alike. Michael, one of the bartenders, was an asset to this property. If you are able to secure a great room rate, don't mind long elevator waits and can handle your room phone ringing when trying to relax, then go for it. Otherwise, I say find a reputable hotel that has a repuation for customer service.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Texas", "Title": "“Timeshare Bully”", "Author": "bevolonghorn", "ReviewID": "UR26584536", "Content": "There was a lady sales representative that had a \"you owe me attitude\" trying to sell us a timeshare. She was very rude, unprofessional, and her \"aggressive\" sales tactics were a total turn off. If I had a $100,000 in my back pocket, I would not buy a timeshare at this location. Everyone that we met in New York was very nice except for this one chick. I know that economic times are bad, however no one should be that desperate for a sale. She made comments such as, \"you lied...\" \"your aunt lied...\" \"are you not in the same financial bracket as your aunt...\" These comments were totally uncalled for by this so-called professional. She needs to get one thing straight--I am the customer, and you SIMPLY work there. If you are there for the timeshare promotion, I am hoping that you are treated with respect. The RESPECT that I did not receive at the presentation. I love New York...not Tiffany!", "Date": "March 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "NEW JERSEY", "Title": "“Rooms are small and Overpriced”", "Author": "timeguy1", "ReviewID": "UR25613647", "Content": "Couch and Chair in room had worn out fabric. The showerhead was broken and did not work right. Bathroom has small sink with no counter. Pull out bed was no good. Save your money and stay in a regular hotel.", "Date": "March 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Location, Better than we expected”", "Author": "Scoobie_8", "ReviewID": "UR25196473", "Content": "We traded one of our RCI weeks and booked close to a year in advance. We had a one bed room suite that had a private bedroom and bath. This unit also had a lovely living area with a pull out couch and another bath with a shower. We travelled with one teenager. When we checked in, we were given a smaller unit than we had been promised, but once we saw the room, we returned to the Front Desk and a new room was assigned with out any hesiation. Minor error ! Our room was on the 25th floor, a view to 7th Avenue... The room was very clean and well stocked for our purposes.Daily maid service, which you pay a small service fee for ,was well worth it. After staying at a high end hotel in NYC before, it was great to have a living space with a small kitchenette . We found a great wine shop around the corner on Broadway and there was a great PAX deli as well as a small supermarket ...We like to have Breakfast in our unit and this trip we found that after enjoying some fabulous lunches around the city, we did not want to eat another meal before the Theatre....Between PAX and the market( Morton and Williams) we were able to enjoy a lighter meal and rest before we headed out on the town again. Transportation around the city from this location is ideal...we liked to walk....and used the Double Decker tour bus to see more of the city. Would use the subway , but it was our daughter`s first trip and either City Sights or Gray LIne will give you Hop on Hop off tours to Manhattan and Brooklyn.Make sure you ask these tour operators for an extra day or 2 for the same price...always a deal in NYC. We did the theatre twice and most theatres were in walking distance. We always go directly to the Box Office for tickets as sometimes we get better seats at a better price....there is a discount ticket agent TKS in Time`s Square, but would rather not waste our New York Minutes waiting in line ups. We did not use the Lounge or the Fitness Center, however a number of guests we met were happy with the service. Elevators were not a big inconvenience, although I must admit they are a bit slow. Overall, we hope to return to The Manhattan Club.I do not think you can beat the location and the accommodations were better than we expected....and I admit I am a really picky when it comes to cleanliness...kudos to the housekeeping staff! I had read all the Horror stories about this hotel before we arrived and it was not part of our experience at all. To those going to visit soon, enjoy your stay and be thankful for the location and to those that are considering a trip, give it a try....New York is such a wonderful city to explore ...and The Manhattan Club is in the heart of it all", "Date": "February 26, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "Charlotte", "Title": "“Great location, very comfortable beds, nice hotel -- crummy hospitality fee”", "Author": "HaveLadyWillTravel", "ReviewID": "UR25052609", "Content": "It's all about location, location, location. Manhattan Club was a perfect location and in walking distance of almost everything we wanted to do. The one bedroom unit, which had 2 bathrooms, was perfect for a couple but would have been a little too crowded for 4 people. The beds were very comfortable and the unit was quiet. We have a great week in New York City. We did not like the fact that we paid upfront through RCI and through our time share, then Manhattan Club wants to tack on a \"hospitality fee\" of $25 per day. My definition of hospitality is entertaining guests or visitors with liberality and goodwill. So, now we have to pay people to be nice to us?? We had a great vacation and enjoyed the location. Would we go back, of course.", "Date": "February 23, 2009"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "thornhill, ontario", "Title": "“worth waiting for”", "Author": "davidleeds", "ReviewID": "UR24063855", "Content": "It took a very long time but we were able to book an RCI exchange six months prior to our stay. From the sound of the agent at RCI it was like winning the lottery. They simply don't see space coming up at the Manhattan Club. I then spent the next six months reading alot of very bad reviews and was more than a little nervousl. Our visit was wonderful. I had phoned and requested a specific type of room and on arrival they said the room set aside for us wasn't ready but if I wanted another room very similar to what we booked we could have it. We chose to wait and went for a walk in Central Park which is about five minutes away. On return the room was ready . The one bedroom unit had two baths a kitchen and a living room with an eating area. There was more than ample storage including in the bathroom which is almost unheard of. The bed was great with fresh linens and a duvet. There was a door to close off the bedroom and one bath. There is no question that the room showed some wear and tear but not in any way that made us feel uncomfortable. There were lots of towels and supplies both in the bath and kitchen. The elevators worked very well. We never heard a sound from any other room. The staff was helpful and pleasant with one exception on checkout. I attempted to pay with travellers cheques and was told they don't accept them. The hotel would cash them but not accept them as payment. The young women was rude as well as unknowledgeable. I asked for the manager and she then phoned someone who told her they were accepted. The location is perfect for wakling and the subway. If you go out via the Park Central Hotel there is a subway about 30 seconds from the door. Buses run crosstown on 57th one block north. We did go to the presentation and were shocked at the cost to buy a timeshare unit. The manager who came out after the salespitch found it very hard to accept that we couldn't afford it. He did not like taking no for an answer. We loved Nocello for dinner which was good value and delicous. The theatre is so easy to get to by subway taking about 20 minutes max from door to door. I would go back in a heartbeat.", "Date": "January 31, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Virginia", "Title": "“Totally ruined our trip to NYC”", "Author": "journeyman411", "ReviewID": "UR23044395", "Content": "I don't normally write these types of reviews, in fact I think I've done this once in the past ten years, despite staying in hotels all over the world. But the experience at this place was, in a word, awful. The first night (which was a warm, humid evening in early November), the room felt quite warm as we went to bed. We adjusted the thermostat as low as it would go and turned in. By three a.m., we were all awake - the room was an oven. A call to the front desk informed us that this place had a \"single pipe\" system - hot or cold only. Due to it being early Nov, it was now heat only. We opened the door into the hallway - no relief. They told us to open the windows (16th floor, small kids in room...), which we did as much as safely possible. A fan was eventually delivered. When we asked for a second fan, we were told they were now out of them - others were presumably suffering this pressure cooker experience also. The second night things got far worse. We awoke to the sound of water dripping, fast and strong - the ceiling was leaking, dripping onto our sleeping children. The ceiling felt soggy, a weird rectangle appeared, like the panel might collapse down. A hotel \"engineer\" arrived. He agreed with my recommendation - we move rooms. At 3am, we carried our half-awake children and belongings to another room (no, it wasn't next door.) After two hours of lost sleep, we collapsed. The next morning, exhausted and red eyed, we discovered that this new room also had a leak - a badly leaking window (the saturated towel sitting on the sill when we arrived was the giveaway), and also, the shower leaked water to the point that literally 1/8\" to 1/4\" of water remained on the floor after use, noticeably rotting out the bottom of all furniture in the bathroom (obviously a long-term, unfixed problem). After we finally checked out, we were given the number of the Manhattan Club's Exec Director to ask for an adjustment to our bill. This man was something to behold. I mean, amazing, right out of a bad movie... not only unsympathetic (offering an apology only after being told we hadn't gotten one), but rude, arrogant and... he actually seemed to be enjoying himself being that way. Dripping with sarcasm over a speakerphone, shuffling papers loudly, he said it wasn't their policy to issue any credits, no matter what the circumstances, and that was \"what made this country great - that we can disagree about this. You think you deserve some kind of credit, and I can say no.\" Yes, that's a direct quote. He confirmed that we had received the coupon for a free continental breakfast (Perhaps a $10 value, even in NYC - Bagels, carton juice etc.) And that was the end of that. And the end of any stays for us this \"timeshare.\" In thinking back over this place, even setting aside our individual awful experience, it was a rotten core. Every time I rode the elevator in that 2 1/2 days, people commented on how long the line was to use the elevator in the lobby (there were never less than a dozen people in line - yes, actually in line, day and night) or how long they had waited on their floor for it (think ten minutes, not 2-3.) The lobby itself was a rush hour traffic jam of people and suitcases for the several hours around check in or check out. And even as we approached the front desk when we first arrived, the first thing we saw was a very angry/heated exchange between a guest and a manager. We should have known then. And now, you know. And have been warned...", "Date": "December 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“great time was had by all”", "Author": "MattyWalter", "ReviewID": "UR22819014", "Content": "We let our daughter and her husband stay at our time share and we stayed at a different location. Boy, were we sorry! They certainly got the better of the deal. They raved about the accommodations, the service, and the location for months afterwords. Next time we're giving them the \"other\" location and we're taking the Manhattan Club.", "Date": "December 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Autumn in New York”", "Author": "Yordy", "ReviewID": "UR22777683", "Content": "We have been at the Manhattan Club for 2 weeks. Wonderful romantic view over Central Park, and therefor excellent location at midtown. The apt 1705 was on the corner of the buildind with 2 sides and 3 windows overlooking the 7th Av and the 56th Street. The apt was warm and cozy, two bathrooms, one bedroom, livingroom, and kitchenette. At the last floor there's a business center (free use of computers) and a big bar and common livingroom where you can find free newspapers and free cofee, tea, and biscuits from 11am to 4 pm.", "Date": "December 16, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Various", "Title": "“Manhattan Club Suites aka Manhattan Time share Hotel 200 West 56th Street NY 100”", "Author": "stargazer43", "ReviewID": "UR22777550", "Content": "Well placed hotel undergoing change. We were offered timeshare whilst checking in! The 'remodelled rooms' are small but have above average decor. The main drawback is that many rooms face inwards into a central shaft that lets in barely any light so your room is in permanent darkness. If you stay at this hotel make sure you get an outward facing room. Staff range from helpful to inefficient and surly dependant on how busy they are. Lifts are programmed badly so you have to wait forever unless you are prepared to use the staircase. Not feasable for elderly or those with young children. Despite all this the hotel was crowded with out of town guests coming into NY for Christmas shopping and the shows. If you can get an outside facing room and resist the timeshare sales spiel it is worth staying here", "Date": "December 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "suffolk", "Title": "“good location but disappointing hotel”", "Author": "prdev", "ReviewID": "UR22497354", "Content": "Spent 5 days here and upon arrival informed of 4pm check in which was fine and bags happily accommodated by concierge but when attempting to get to 23rd floor later with baggage had at least 10 mins wait to access the one working lift!! Long queue of people behind us becoming more and more frustrated. As the only lift working stopped at practically every floor on its way up and down it became really difficult to remain patient particularly by day 5 and the service lift was also out of action by now. We took to walking up/down several times before realising you could use the lift in the adjoining Park Central hotel from floor 11 down and back up to 23rd floor from their lobby. But no-one from the Manhattan Club informed us of this and seeing previous reports on this site I can now see it is an ongoing problem for the hotel and fail to understand why it has not been addressed before now. The room was ok but cold and the heating system was not working. A phone call to reception and we were informed an engineer would have to be called out! As we were now exhausted after flight we gave up waiting half hour later and went to bed. The bathroom was quite dated and the towels small and thin. No complimentary bottles of water but tea/coffee facilites and fridge and microwave in room. The only real advantage of this hotel was the location and the fact that we were out all day and came back to climb the stairs to fall asleep!", "Date": "December 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jonagh", "Title": "“fantastic hotel”", "Author": "jonagh", "ReviewID": "UR21901548", "Content": "I had read a lot of negative reviews about this hotel before I left but found it to be excellent! The staff were very friendly, it is 5 mins walk from times square and 4 of us (friends) shared a suite which had a lovely kitchen area, two double beds (one was sofa-but very comfortable and a lovely bathroom> We couldn't check in until 4 when we arrived but our bags were minded for us and a lovely local restaurant was recommended- we were also able to sit upstairs and enjoy complimentary tea/coffee/biscuits while we waited. The concierge was very helpful. a lot of people mentioned that the lifts were very slow but at the end of the day it was not a big deal. I would definitley recommend this hotel", "Date": "November 16, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Slow elevator, so what!”", "Author": "got2gogolf", "ReviewID": "UR20909944", "Content": "OK, so if you have an appointment, you've got to give yourself a little extra time with the elevators, which may or may not be working, but, wow, this place is so great for weekend visitors! It's on a pretty quiet street that's near theaters, museums, shopping and best of all Central Park! And our suite was just fabulous, with TWO BATHROOMS. And I can tell you, for two women weekending in NYC, this perk is worth a wait at the elevator! Friendly staff too. No restaurant, but I can recommend the Redeye Grill across the street and Trattoria Del Arte. Rooms have fridge and microwave too.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Great location and acceptable room”", "Author": "Oshanda", "ReviewID": "UR20631624", "Content": "In short - We stayed four nights at the Manhattan Club and overall found our Quad room comfortable (if a little on the small side) for our family of two adults and two children (6 and 7 year old boys). We chose the hotel because of price and location and it worked out well on both counts. In detail - when I first opened the door of our room I was taken back by how small it was. Then I remembered I was in New York! It had been 9 years since my last visit and I had forgotten how small the rooms in New York can be. The room was about standard for a New York hotel. We had what was called a \"Quad\" room. It consisted of a Queen size bed and a sofa bed. The sofa bed was just acceptable for our boys to sleep on. The mattress was so thin that an adult would have not slept due to the supporting frame of the mattress pushing into the middle of their back. Also, with the bed folded out the foot of the bed was too close too a glass topped coffee table for our liking - we felt it was awkward and dangerous. To solve this we took the glass top off and stored it under our bed and stood the coffee table on its end in a corner. In hindsight we should have asked the staff to remove the table. But the work around was fine. Other than the issues with the bed the room was completely fine. Our queen bed was quite comfortable and we slept well in it. Other guests have commented previously on the slowness of the lifts (elevators). We didn't have a problem with them, never more than a minute wait. I understand from one of the regular guests that the maintenance work on the lifts that had been going on for some time had been completed and that the accessibility of the lifts had improved significantly ever since. We did receive one call from hotel staff selling time share. They offered tickets to a show or a $150 Visa Cash card for attending one of their \"60 to 90 minute presentations\". But they weren't too pushy about it and when I explained that we didn't visit often and hadn't been to New York for 9 years they backed right off and we did not hear from them again during our stay. We also found a couple of great, reasonably priced restaurants near our hotel. We had great pizza on 57th street and also went to a lovely asian restaurant on 7th avenue called Lili's that did Chinese food and Sushi. The real winner for us was the location. Being close to the subway and Central Park and a few minutes stroll to 5th Avenue and Times Square made this a great place to be based. When our boys had enough of the city we just wandered up to Central Park so they could run around and let off steam ,", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lakeside AZ", "Title": "“Manhattan Club Great location”", "Author": "Traveler477", "ReviewID": "UR20203641", "Content": "The Manhattan Club is in a great location. 3 blocks from Central Park. Easy subway access, Close to Time Square and many other NYC attractions. Lots of restraunts nearby. Very helpful staff. the one bedroom suite has 2 full bathrooms which worked out nice for 2 couples. the fold out bed was not comfortable and we took the mattress out of the couch and put it on the floor to make it more comfortable. The kitchen does not have a stove. Overall we had a great stay and would stay again", "Date": "September 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Utah", "Title": "“Wasn't worth the money we saved”", "Author": "UtahSpaBaby", "ReviewID": "UR20198852", "Content": "We used RCI points, so our stay for a week was about $85. It was not worth the savings. I would easily spend $500 a night for a better place. There weren't enough elevators to for the number of guests they had. There are no amenities at this hotel.", "Date": "September 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "US-Euro-Traveler", "Title": "“Manhatten Club in a SCAM- Prospective Timeshare Buyer, BEWARE!!”", "Author": "US-Euro-Traveler", "ReviewID": "UR19632465", "Content": "We have been a Timeshare owners at the Manhattan Club for over seven years now and we very much regrate ever doing business with this SCAM that called the Manhattan Club. When we joined they were very nice to us. The fee for the week we owned was about $600 and they told us that we own a suit for a certain week of the year we can change it to any week we desired. We have also been told that the week of this Unit we own is Flexible and as owners we are entitled to change our week to any 7 consecutive or non-consecutive nights at our option, and including 3 weekend stays par year. By now The weekly rate jamped to over $2,000 (more than tripled) which we have to pay at the begining of the year but we COULD NEVER GET A WEEK OR EVEN SOME DAYS. FORGET ABOUT WEEKENDS. They keep saying it is all booked for any week or even days we requests BUT WHEN WE CALLED THIER OFFICE IN PHILADELPHIA WE COULD GET THE SAME WEEK THEY HAVE TOLD US WAS TOTTALY BOOKED IF WE WOULD PAY THE RIGHT PRICE. We have purchased our unit because the location was good and still is but, when we did manage to get a room for a couple of days 3 years ago we found out that the service that used to be fair turned to be almost unbearable, the front dask agents are rude and impatience and the stay was no fun. We could get over the bad service because of the location but, we are tierd of bagging and being TURNED DOWN for a week that we paid a lot of money for and we CAN NEVER receive. POTANTIAL TIMESHARE BUYER AT THE MANHATTEN CLUB, BEWARE!!!", "Date": "September 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bangkok", "Title": "“Already paid in full but no room when arrive”", "Author": "BKKAngel", "ReviewID": "UR19447223", "Content": "I contacted the reservation dept. of the property. Firstly, it seemed nice and professional. I understood that the Manhattan Club is a time share property. I was asked to attend the sales presentation and I ageed. I was also asked for the credit card no. only for \"GUARANTEE\" the book. I did specifically mentioned that I will pay by cash - so the please do not charge on my card. This is due to the exchange rate matter. After I agreed on the booking, then the problems started. 1. Changing of the contact person I once tried to contact the same representative for the booking as to change my staying date. I waited for a week before he contacted me back with the message that he only in charge of the booking. I do need to contact another department. 2. My card was charged in full. I specifically mentioned that it was for \"Guarantee\" of the booking only, not to be charge. So I have to pay about USD 100 more due to the exchange rate and the bank charge. 3. No room when arrived When I and the family arrived at the property at 1 am (after a 27 hour-flight), the staff told us that there was no room for us for tonight. He didn't know the cause but he was asked to put us on another hotel nearby for a night. The room should be ready first thing in the morning. I was also suggested to file a complaint with the director who would be in the office tomorow in the morning. I asked the staff if the hotel he put us in was in the equivalent rate we paid. He said \"Yes\". When we arrived at the hotel, we asked for the rate. It was USD 199, but we paid for USD 285. - How equivalent is that? 3.1 When I came back in the in the morning (9.00 am), the director was not in yet. So, I decided to attend the presentation firstly by asking the front desk staff to inform me once the director is in. But until we finished with the presentation (11.00 am), there was no one informing us at all. 3.2 When I contacted the front desk again, I was treated with neglecting behavior. There were 3 staffs behind the counter and they were snobbish and hostile. a) I asked for the director and the answer I got was that the director was in the meeting. b) I asked what time the meeting will end. The reply was in the afternoon. c) I asked if they could inform the director that there was a client waiting to see him because I had appointments in the afternoon. They refused to do so. d) I asked for my room. They said the check-in time is 4.00 pm. I was so upset because this vacation was for my mom's birthday. I had plans in the afternoon and couldn't wait the whole day for this mess. I started to piss off. The staff traited me to lower my voice or they would call the police. I, then, asked them to call the police. I called my lawyer. The police didn't come but the Chief of the Security came to talk with me. She informed me that the director was not working today. (I was surprise with the 3rd different messege I received about the director - so who's the [--].) And the room wouldn't be ready until 4. I said nevermind I already called lawyer. He would be here in a minute. After my lawyer arrived at 12.00 pm, he had a conversation with the same staffs. I got the room immediately with the complimented 1 day continental breakfast for 2 and the reimbursement for my 1st night at the cheaper hotel. I was once a New Yorker. I didn't expect this to be happening in one of my beloved city. Thanks to my friend who is a lawyer, otherwise, we would have been treated as a group of stupid asians who doesn't know anything. However, there was a nice thing. The guard who was asked to watch over me. He has more service mind than the front office staff. He should be promoted to replace them.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harrisburg, PA", "Title": "“Nice place to stay, though I wouldn't buy”", "Author": "georgelovesbosco", "ReviewID": "UR19297873", "Content": "We had been contacted directly from the facility every 3 months for the past 4 years inviting our family to come stay at a reduced rate and take a \"no pressure\" tour of the facility. Being a native New Yorker, I am very familiar with the city. The location is as convienent as any in the city. The concierge was able to get us the theater tickets and restaurant reservations we requested that I was unable to do so directly myself. The 1 bedroom, 2 full bath room was spacious for Manhattan. The 26th floor lounge was large, friendly bar tender but only a few people there late night. The elevator efficieny was poor, average wait 5 minutes, faster using the 2 service elevators. The only disappointment we experienced was the we went for our \"90 minute tour / presentation\" before we checked in. We were expected to make a decision on the purchase right there even before we checked into our room. I found the finance \"money man\" was as pushy and arrogant as they come and this is coming from myself a native new yorker now living 3 hrs away. The \"special deal\" of $10 grand off was only good for those 90 minutes, if the place is so popular, why would they need to put a gun to our heads with this type of pressure sale. I responded that I did not intend to make that type of committment without \"driving the car first\". They responded that this should be a no brainer, and it was we declinded their offer. At that time they became as cold as you could imagine. I was also told originally that I was paying for a 1 bedroom suite however on the initial check in they said they only had a studio and would see what they could do. They gave the impression that they were setting us up to see if we would buy before making the room committment. However, after declining to purchase, to my suprise we did get the 1 bedroom. Honestly speaking, if we took the tour at the end of our stay and if they were not so NY pushy, we may have purchased a week. They should rethink their strategy. Hopefully this helpful to others A New York Native, living in a small country college town for the past 20 yrs (the best of both worlds)", "Date": "August 24, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Maryland", "Title": "“no real problems”", "Author": "MattieMattie", "ReviewID": "UR18966446", "Content": "I stayed at the Manhattan Club with my Husband,30 yr old daughter and 13yr old granddaughter. we were there 7-4-08 to 7-11-08. Our check in was wonderful,the girl at the front desk could not have been nicer ,we exchanged though RCI and checked in at 3:30pm. Our room was 1708 and was very,very clean. It had a mini kitchen,two baths with tubs,a living room with pull out (which my daughter and granddaughter found ok to sleep on)we had a king bed in the bedroom that was very comfy. The maids came in every day for a fee of $25.00 per day but worth it. We rode the subway most of the time. We did take a taxi when we went to a show or out for the night . It was very warm and one would be too sweaty to walk to the theatre area. Location is great and there are little markets to get prepared foods, snacks or food items.There is a small fridge & microwave in the unit. We had two TV's and a table to sit at to eat. The elevators were slow and we did take the service elevators at times but the wait was not that long. The staff helped with anything that we wanted with a smile and in a timely manner. We did not see anyone that was rude or did not want to be helpful from the maids,desk staff to the door men. We would stay here anytime we can. It was a wonderful week.", "Date": "August 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Africa", "Title": "“Great place but the service level was shocking”", "Author": "Susan018", "ReviewID": "UR18739136", "Content": "We stayed at the Manhattan Club for 7 days. Location was great as was the room/studio unit. In general we had a great stay but it was marred by the rudeness of the staff who were rather condescending and abrupt - in particular one of females working at the reception area was so rude that her manner bordered on insolence. We would recommend staying at the Manhattan Club as it is in a great location, easily accessible, clean, rooms are great and well maintained however we would warn people to expect rudeness from the staff . MDC - South Africa - August 2008", "Date": "August 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Better than expected”", "Author": "senorak", "ReviewID": "UR18585895", "Content": "Just back from a week long stay at the Manhattan Club (timeshare exchange via RCI). I was a bit nervous before our stay, after reading many of the reports here, however, we didn't have many of the problems that others experienced. The wait for elevators ranged from no time at all to 5-10 minutes. Longest waits were the days of check in/out on the weekends. Most waits were less than 3 minutes. Our 1 bedroom/ 2 bath unit was one of the smallest I have stayed in at the MC, but even with 5 people, we had room. The king sized bed was huge, and while not a lot of drawer space, we hung most of our clothes in the closet, or placed them on the high shelf in the closet. The desk in the bedroom provided a nice area to check email and search the internet for restaurants in the city. The internet connection was free, but at times, it was \"iffy\". The living room was a nice size.....all of us could fit to watch TV in the evening. It became crowded once we opened the sofa bed (sister and her child slept in that), The two bathrooms were large, and came in handy w/ 5 people getting ready in the morning. We had plenty of towels, (think they gave 6 of each), as well as bath products, which were replenished daily if needed. The mini kitchen was very limited.....just a microwave to do any cooking, along with a small coffee pot (less than 4 cups), and a small fridge. Coffee, tea, and popcorn was replenished each day. There were enough plates/glasses (6 of each, in varying sizes) for everyone, as well as silverware. Some cabinet space to store snacks. Can't beat the location....subways are around the corner and across the street. Starbucks around the corner, full service grocery store within 2 blocks, and a large \"Whole Foods\" store in the Time Warner building (several blocks away). Plenty of restaurants/pubs in every price range within a short walk. Kids loved spending time in Central Park, at the playgrounds and climbing the huge rocks. We did the typical touring, saw some shows, and visited museums. Everyone had a great time.....and would definitely return.", "Date": "August 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Great if you have patience and don't need a full service hotel”", "Author": "rcs249", "ReviewID": "UR18086251", "Content": "I was a bit nervous after reading the reviews, but pleasantly surprised during my stay this month. Starting with the cons: 1) The elevators! We were on the 16th floor and at times just walked down! There was 1 regular elevator and then the service elevators, so we waited from 2-10 minutes based upon time of day. 2) While pleasant, housekeeping was very slow in helping us out our first night with a small issue, but then were fine after that. 3) The concierge was adequate but not particularly helpful. 4) The pullout couch, which my daughters slept on, was awful, so they put the mattress on the floor and layers of blankets on it to deal with the thin covering over the innersprings. Now the pros: 1) Great location just 3 short blocks from Central Park, 10 minutes to Rockefeller Center and 5th Ave shops, diagonally across the street from Carnegie Hall, and the theatres were all within a 5-15 minute walking distance (there are so many sets of lights that it can take a while). 2) The room was a generously sized 1 bedroom corner with views of Central Park, which I loved. 3) The bed was surprizingly comfortable. 4) Two great bathrooms! 5) Despite sweltering 88-92 degree weather, the ACs worked beautifully! So in summary, great location, great room, be careful of the pull-out couch mattresses and hope that both elevators are in service when you go, but I wouldn't hesitate to return!", "Date": "July 21, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "shanebrook", "Title": "“Manhattan Club has gone downhill”", "Author": "shanebrook", "ReviewID": "UR18035211", "Content": "We are timeshare owners at the Manhattan Club and have been so since 2005. We stay here all the time when we come to NYC. We love the Manhattan Club and have no intention of selling our timeshare (we use it so much). However, it has gone downhill since we first began coming here: PROBLEMS: --Service is spotty at bets. Can be good. Can be terrible (unresponsive). However, we have never had rude service. --ELEVATORS!!!! Be prepared to wait a LONG time to catch an elevator. Usually only one (of two) elevator works so they open up the service elevators (which don't help much). STRENGTHS: --Nice clean rooms (usually). --LOCATION!!! You can't beat the location. Close to Time Square and Central Park. This is a nice place to stay. It isn't what it used to be which is a management problem. They need someone who can figure out how to run a timeshare hotel .", "Date": "July 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Great Location, Horrible Service”", "Author": "kwalshyork1", "ReviewID": "UR17152035", "Content": "I was invited to stay here for a package deal to tour the property and check out ownership. Check-in started fine- I was able to check in early and get situated before i went on my tour. After that- here are all of the things that went wrong: 1. The TV in the room didn't work. We had to ask several people to come and check it before it would function. 2. I had to call several times for new towels. 3. The elevator never came to Floor 2. If staff saw you waiting, they would yell at you to take the service elevators where you had to share the elevator with trash bins and garbage. 4. The concierge was rude. When I asked her what there was to do around the hotel she said, \"Didn't you do your homework?\" I had to push her to give me specific suggestions. 5. The \"Executive Level\" boasts a Continental Breakfast and Lounge Service. You have to pay for both. 6. I was overcharged by $700 for my stay. When I went to complain, I was still overcharged by $100. I had to call the original booking company to get it fixed. 7. I valet parked and gave my credit card. No one told me you had to request to be billed for your car so when my car came I was yelled at that I was trying to get away without paying. When I asked the Valet how to get to the Lincoln Tunnel, he said, \"I have no idea\" On the positive side- the location is great. It is walking distance to Central Park, 5th Ave and Times Square. The restaurant across the street, the Red Eagle is wonderful. I would NEVER stay here again.", "Date": "June 23, 2008"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Wallasey, Wirral, England", "Title": "“Absolute Garbish”", "Author": "Salokin1980", "ReviewID": "UR16969939", "Content": "If you like being told lies and treated like rubbish then this is the place for you ! If like any sane and normal person you dont, then give this place a miss.....even if there is a hooters bar over the road !! I have never been treated so badly in all my life than by this place. Keep your eyes peeled for Antonio Munoz (Assistant Front Desk Manager), he's the star performer in this shambolic performance. I can also back up what everybody else says about the elevators. I bet I'm not the only person on here to experience \"plumbing difficulties\"...... Don't stay here or it'll tarnish your experience of this wonderful city.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Manhattan Club was Good”", "Author": "GarySeattleWA", "ReviewID": "UR16173404", "Content": "It amazes me how the ratings for this resort vary. I stayed from May 3 to May 10, 2008. I think the rooms are great. I would rate this resort 3.5 stars. It could easily be 4 or 5 if they refurbished the rooms. Since TripAdvisor only has whole stars and I really enjoyed my stay, I gave it a 4. I got the room through RCI. The park is only 3 blocks away and Carnagie Hall is across the street. GREAT LOCATION! At W 57th and 7th Ave, you are in the middle of the hustle and bustle of New York. I had room 2219. It is a corner \"Executive Studio\" unit so I had 2 windows with a view of Central Park. Nice! My room was very funtional and a great place to relax after walking all day in the city. I don't understand folks that complain about noise in New York. That is part of the experience! If the windows are open, it is noisy. Cole Porter says it best: \"I happen to like New York, I happen to like this town. I like the city air, I like to drink of it, The more I know New York the more I think of it. I like the sight and the sound and even the stink of it. I happen to like New York.\" The rooms do need to be updated. While my room was very clean, the soft goods are showing wear and tear. Faded bed spread, spots on fabric chair/couch, wear and tear, etc. Just needs to be updated. The carpet looked new and the flat screen TV was nice. Air conditioning worked great. The small refirgerator worked but it was too cold. On the lowest setting, it would freeze my soft drinks. Had great cola slurpies. I let them know when I checked out. Elevator Issue RESOLVED: They completely replaced an entire elevator car. For half of my stay there was only one lobby elevator. They did allow you to use the freight elevator but I didn't like it. They opened up the new elevator so both elevators are in service. The new one is very nice. Yea! All of the major subway lines are very close. Very convenient for getting around the city. I recoomend buying a multi day subway pass. I bought a $25 7 days pass which was a really good value as I traveled all over the city. Tip: Get a \"City Pass\" if you plan to visit the museums and tourist attractions. It was great because you bypass many of the ticket purchase lines at the attractions. It also will save you a ton of money. I bought mine at the 3 hour around Manhattan Island Cirlcle Line cruise. Very interesting. Check it out at www.citypass.com. We saw Wicked and The Lion King. Great shows. These are still not available at TKTS (half price tickets) due to still being so popular. The hotel staff were helpful and courteous. They are New Yorkers however. I think some folks that review here don't understand New York culture. It is fast and succinct. This is not a slow paced Carribean resort. I would definately return to The Manhattan Club. If they refurbish the rooms I would even consider becoming an owner. Good times to be had at the Manhattan Club. Good Luck!", "Date": "May 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Hated Manhattan Club!!”", "Author": "Travellerforlife", "ReviewID": "UR16007834", "Content": "Only one elevator was running for guests. The back 2 service levators were opened for guests but we had to go up and down with the help, the garbage and the laundry. Long waits at the elevators. Very poor customer service. Bad management. Front Desk Staff very rude and not very helpful. Lots of banging outside the hotel windows. Would not buy timeshare here and would never stay here again! Beware!!", "Date": "May 13, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sussex, UK", "Title": "“Very Good Value for the money and great location!......”", "Author": "David1958", "ReviewID": "UR15165650", "Content": "We booked direct from the UK. After reading the reviews on here, we were pleasantly surprised when we arrived. Points to note: The Manhattan Club is a timeshare complex (NO sales pressure) and as such has very liitle in in the way of amenites. The concierge desk people are not particulary pleasant to talk to and give an impression of being unhelpful.The lifts are not all working, so be prepared to wait for typically up to 3-4 minutes. No real problem for us. The rooms are clean and comfortable (two bathrooms), but are beginning to look a littele-bit dated, The location is first-class, Times Square and Central Park, all easily within walking distance. Everything is almost on your doorstep and there's even an Irish Pub across the road which shows all the live premiership football (bliss). The rooms facing the front of the hotel can be a bit traffic noisy, but conversly the rooms at the side are next to buliding development works. This is definitely not the prettiest place to stay, but overall, you really would have to go some to beat it on value for money and location!! I am glad we picked this place to stay.", "Date": "April 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Stowe, Vermont", "Title": "“Great location and room if you go at the right time of year”", "Author": "mcm15", "ReviewID": "UR14992525", "Content": "I own several timeshares and rented a one-bedroom suite with two bathrooms from an owner at Manhattan Club. RCI is the timeshare company for all suites except the penthouse suites, which is affiliated with Interval International timeshare management. This is a great property on West 56th and 7th Ave.-near Carnegie Hall, across from Redeye Grill. Easy walk to small grocery and Duane Reed pharmacy/sundry stores. I stayed here before in a studio suite, which is okay for a couple but crowded if you bring a grandchild. The one bedroom suite with 2 baths is large for NYC with nice kitchenette, dining table with 4 chairs. Plenty of dresser drawers and two closets. Best king sized bed I have ever had in a hotel,too. The sheets had several large tears in them but were soft. Only problems were: 1. The elevators are very slow and crowded. Take your chance at the lobby elevator or the service elevator and hope for the best.When we were there, one of the lobby elevators was out of service for \"improvements\". A staff member told us the improvements would make the elevator nicer but would have no affect on speed - too bad! 2. Climate control can be a problem depending on time of year. We stayed in April and the rooms were VERY hot. You can open the windows but we had a room facing another building and ventilation was not great even when we had all four windows open. The temperature outside was between 48 and 62 F. We requested a fan but were told all of the fans were loaned out already for each day of our 3 night stay. We requested a fan twice a day for 3 days with no luck, although everyone was very polite. Why not put two fans in each room? It would have made our stay so much more comfortable. Management and the bell man told us they were not required to turn the air condioner on until late May. They said since this is a very old building there are only two pipes instead of four, which means they could turn on heat for the cooler months and A/C for the warmer months but never a choice of heat or A/C at all times. Everyone in the building was complaining of being too hot. We were considering purchasing a timeshare here, but the lack of individual climate control changed our minds. I would stay here only in December through March (good bet for the heater to be on) or June-August (good bet for the a/c to be on). The housekeeping was excellent, bathrooms were clean and of adequate size. Only complaint in bathroom is that there is a pedestal sink and absolutely no cabinet or stand to put toiletries. No hook on back of bathroom door to hold a hanging toiletry case either. Two nice terry robes were provided but only one hook in the small bath on the wall to hang one robe. The kitchenette had microwave,coffeemaker,small refrigerator, dishwasher, sink and small supply of dishes,bowls,plates and utencils.Maid service was provided daily (unusual for a timeshare) and soundproofing is good between rooms. If you close the windows, you hear minimal Manhattan street noise like horns and sirens. We ended up leaving all windows open to keep the room cooler. We were awakened by construction noise which we assumed were related to sandblasting since sand started coming through the opened windows on two mornings of our 3 night stay. We had to close the windows and leave until later in the day. There is a nice exercise room and business center, along with an owner's lounge on the 26th floor. Wireless internet was free and worked well in our suite. The \"Penthouse suites\" have access to owners or their guests by a key in the elevator on the 26th floor. I don't know if there are similar climate control problems but there are two terraces (north and south) with lovely views. Only problem is the very loud air handlers on the roof near both terraces that make conversation difficult due to noise. I would stay again but only during months when heat or A/C would be on.", "Date": "April 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ma.", "Title": "“Elevators are a HUGE problem.”", "Author": "JD3", "ReviewID": "UR14375369", "Content": "We recently enjoyed a 3 night stay here.We had a 1 BR unit with a King bed, and the kids slept on a pullout in the living room. Both rooms were a really good size, especially for NYC, and there was lots of storage space. There were 2 full baths. One had a tub/shower combo, and the other had a large shower. Bath and Body works soaps/shampoos/lotions were included. The kitchenette area had a table and 4 chairs, microwave, frig., dishes, and dishwasher.There was also a coffeemaker and included coffee We enjoyed being able to have our coffee and breakfast in each morning. A major problem with this hotel/timeshare is the elevators. There are only 2 that serviced the timeshare apts., and 2 service elevators. Since 1 elevator was out of service,guests could use the service elevators, but it took FOREVER to get down from the 17th floor. We waited 40 minutes once, as every time one stopped, it was jammed full Finally we squeezed onto an elevator going up, and we stopped on each of the floors up until the 26th floor, and then on each floor on the way down.Everytime the door opened there were people hoping to get on, but there was no way. Everyone was complaining, and it was a huge problem! One couple squeezed their 2 kids on with us, and they walked down 17 flights to meet us at the bottom. Guess who got there 1st! Other than that, our stay was great..", "Date": "March 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rockwall, Texas", "Title": "“NYC at its best!”", "Author": "jmcgolf", "ReviewID": "UR14309728", "Content": "Just spent a week at the Manhattan Club...we completely enjoyed it (in spite of the negative reviews we had read, we were a little concerned, then were pleasantly surprised. The MC exceeded our expectations.) Great accommodations, close to everything (Broadway, Central Park, 5th Avenue, Times Square, restaurants) and we found the entire staff to be very polite and friendly! The elevators are under renovation (like many buildings in NYC, the building is very old, thus the elevators are being updated)....just be patient. When you visit, do ask the staff for restaurant recommendations to avoid potential tourist traps - and do expect to pay a little more - you are in Manhattan! To get half-priced broadway tickets, be sure to visit the TKTS booth in Times Square. To get around, buy a Metro Card and use the subway - very efficient and seemed safe. In fact, the city in general felt much safer than we expected. We are already looking forward to our next stay at The MC and highly recommend it to others. Can't imagine staying anywhere else in the city.", "Date": "March 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "nyc", "Title": "“beware of the manhatan club”", "Author": "timesharequeenNyc", "ReviewID": "UR13871469", "Content": "this is my 3 time staying at manhattan club the first one before the renovations which was unbelivabley dissapointing as i could not watch tv comforably in the room due the angle of the bed and the t.v. i stayed for a few days in january and the suites are designed nice and the engineer showed me how to operate the dvd player with the hi def tv. you had to ask for a dvd player why they are not standard in the room i dont know. i came back for a few more days as i had expiring points and the tv in one room did not work. my room was changed as i asked to have the dvd/vcr combo brought to my new room and i was told that it was not compatible with the t.v. but it was hooked up to the previous room tv which was defective . then i asked for a plain dvd player and i was told that no dvd players are compatible with the t.v. i told the engineer that i was here 2 weeks ago in the same room with a dvd player which worked and he told me no .the staff acts like you are disturbing them when you ask for something. the location of the building is the only positive thing here. the are so many hotels in n.y. where staff actually smiles when you come in and greets you. the light switches in my room were missing in most of the rooms so i had to leave the bathroom lights on otherwise there was no light in the room. ther is no bathroom bar for the tub and the whole bathroom is marble so it is dangeous for elderly people. this place is toutee as one of the most difficult timeshare exchanges there is so i expected much more from this place since it had been renovated.you also have to pay a per night housekeeping fee .personally i will stay at an affinia hotel next time.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Yorkshire", "Title": "“Wish I lived nearer!”", "Author": "Kazza45", "ReviewID": "UR13460912", "Content": "Stayed here through RCI timeshare exchange for 7 nights in Sept 2007. Was a bit worried about mixed reviews of accommodation but all I can say is that it was fabulous. We had a 1 bed suite with 2 bathrooms, lounge area with kitchenette and separate bedroom with king size bed. Room was at rear of hotel so rather dark and no view but who goes to NY to look out of the window? Location on 56 St is amazing, so close to all attractions. Daily Maid service @$25 per night was well worth it. I would go back time and again if I didn't live so far away Karen", "Date": "February 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great Place to Stay”", "Author": "TravilinMom", "ReviewID": "UR13307135", "Content": "Our family of 2 adults and 2 small children visited New York for the first time. We spent 7 nights in a 1 bedroom unit at this Timeshare/Hotel property. It was fantastic overall. By New York standards, the unit was very good size, including 2 full bathrooms, bedroom, a living room with eating area and a kitchenette, which ended up being our saving grace. There was a refrig., microwave, dishwasher, coffee pot and dishes. We were out walking and seeing from 8:00 am until 7:00 pm each day and it was wonderful to be able to pick up some fresh ready made food from the many markets/food bars in the neighborhood and go back to our room to eat, (instead of dragging 2 tired youngsters to a restaurant) relax, make some hot tea and really rejuvinate for the next day. The unit was clean, quiet and very comfortable. The front desk staff was not particularly friendly, but we had no specific issues with them. The Housekeeping and maintainance staff was great. (the guests in the unit next door left their bathtub running and it flooded our front hall closet). The best part about this property was its location. 2 blocks from the southern edge of Central Park - there was a subway station right downstairs - and only 15 min. walk to Broadway ! We loved this place and will definately be back to stay again.", "Date": "February 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“I love NYC”", "Author": "vosl", "ReviewID": "UR13275203", "Content": "Having never been to NYC before I had no idea where we were staying but we could not have been in a better location. If you walk out the front door to your left is Broadway and to your right is Carnegie Hall, 2 Blocks and you are at Central Park. Times Square is nearby. There are subways close by to transfer you to downtown but we found we walked everywhere most of the time. We had a 1 bedroom unit with 1.7 bathrooms. This means the 2nd bathroom does not have a shower. We had 5 adults stay in the apartment. We had rung and requested a roll away prior to our arrival but it was not in the room when we arrived so my husband went down to the front desk and the roll away was delivered within minutes! Even with the rollaway we had plenty of space for all of us and our 10 bags!! (This was the last stop on a 6 week holiday.) The rooms were kept very clean when we were there but some of the plates in the cupboard were dirty when we arrived. The Club has a recently upgraded gym and the owners lounge looked extremely comfortable but we never spent time there. We did however spend time in the office with free internet access. Having this onsite was very helpful, instead of trying to find internet cafes , the right change etc at locations off site. We found this a very well equipped and high standard of accommodation. Though the lifts are annoying Would definitely stay here again in the future.", "Date": "February 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great for a busy weekend in NYC”", "Author": "travelmadgal", "ReviewID": "UR12288638", "Content": "I stayed in the Manhattan Club with 4 other girls while on a long weekend shopping in New York in December. I was very impressed with the apartment and with the location and would not hesitate to recommend it. We had a one bedroom apartment - with 2 bathrooms which was an unexpected bonus. The sofa bed was not great but most sofa beds are pretty poor - we were so tired after long days shopping we slept well anyway. I've seen a lot of complaints about the slow elevators. We used the service elevators near the reception desk during our stay - there was a sign beside the desk advising guests that there were additional elevators. It meant that sometimes we were sharing the elevator with the laundry or squeezing in with all the housekeeping staff â€“ but nobody minded. We never saw any other guests using them â€“ but you should! It saved lots of time. There is great diner nearby - we had dinner there and were very impressed by the food and service - Brooklyn Diner 212 West 57th Street (between Broadway and 7th Ave.) We go to New York every year shopping and will definitely be staying in the Manhattan Club again.", "Date": "January 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "miami", "Title": "“Nice stay”", "Author": "geligam", "ReviewID": "UR12281281", "Content": "Perfectly good. No complaints. Huge rooms.", "Date": "January 2, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tampa, Florida", "Title": "“Awesome Place”", "Author": "DRPEPPERSSON", "ReviewID": "UR11944188", "Content": "Awesome place. Great location. Fridge and microwave make it perfect. I love this place. Will be back again.", "Date": "December 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fresno, CA", "Title": "“Gorgeous Suite And No Car Needed”", "Author": "conkyebay", "ReviewID": "UR11935224", "Content": "FANTASTIC LOCATION - multiple subway entries close and absolutely no need for a car. A few blocks from Central Park, across the street from Carnegie Hall and few blocks from the main shopping streets. The staff was really helpful and quick. The accommodations were spotlessly clean, spacious, and cleaned well daily. Only downside was waiting at times for the elevator, but the suite itself makes up for it. I will stay there again whenever I can book it.", "Date": "December 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Much better than most reviews.”", "Author": "rbkmrosen", "ReviewID": "UR11010293", "Content": "I am compelled to write since there are many negative reviews of the Manhattan Club. I have stayed in at least 10 other hotels in NY and in my opinion this is one of the best. A family of four, we had a one bedroom suite with 1 3/4 baths. It had a nice size bedroom and the sitting area/kitchen was large enough to contain the open sleeper sofa and a twin air bed without any problems. The condition of the room was excellent, and we had no complaints about the cleanliness. Compared to most NY hotel rooms we have stayed, this is definitely one of the nicest and surely the largest. To address issues of other reviewers: We did not find the elevators particularly slow--only once did we feel the wait was greater than 3 to 4 minutes. The hotel invites patrons to use the service elevators and they can be quicker. The hotel has studios and one bedroom suites. The studios appear per other reviewers to be too small for 4 people. The one bedrooms are not and that may explain some of the poorer reviews. We did not find the staff to be unfriendly or rude. They did not try to be our friends, but they did their jobs adequately. The only negatives we encountered were the air conditioning system which was a bit weak, and difficulty accessing the wireless internet. The AC problem was solved in Nov. by opening the windows an inch. It took several phone calls to the front desk to get the long-on name to be able to access the free wireless internet; and the concierge had no idea how to get online. We would definitely return.", "Date": "November 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Great location...but”", "Author": "CoopVirginia", "ReviewID": "UR10865548", "Content": "After being contacted almost weekly for months by the marketing department we decided to give it a try. We arrived early and our bags were Totally unimpressed with the suites and the price. When we indicated that we were not interested we were asked \"why did you come\"? Well you called us weekly for months and you offered Broadway tickets plus some was our answer. Clearly the \"top seller\" was not happy with us. Was actually somewhat rude after learning our decision. Anyway the perks were great. Got to see Phantom of the Opera, Central Park and everything else within walking and subway(first time to NYC) The room was small and rather drab. The elevators were dreadfully slow. Would not recommend unless a fantastic deal can be obtained. Location is great.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“liked the manhattan”", "Author": "shamrockIreland", "ReviewID": "UR10811045", "Content": "I stayed at the hotel last week with my wife and 2 teenagers,the location is great its a short walk to times square, its beside central park ,the hotel was clean enough,the staff were friendly ,the only problem was that we booked a quad room (the biggest available)which we presume would have consisted of a double bed an 2 singles beds,what we got was a double bed and a sofa bed shoehorned into 1 room which made it a very crowded few days! Its a nice hotel if you go without children,but be wary of the phonecalls home,we were charged 250 dollars for 8 short calls to ireland .", "Date": "November 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Good location but....!”", "Author": "AmelieIreland", "ReviewID": "UR10476414", "Content": "We recently stayed at the Manhattan Club Hotel. Dislikes: The reception staff were not overly friendly. A genuine smile would help! The room was not adequate for 4 people, as it had only one double bed & one double sofa bed to accommodate us. The extractor fan in the bathroom was not working & when we phoned reception, we were told the fan wasn't working. No suggestion given as to when or if it would be fixed. The elevators were very slow and too small. Likes: Good location. Short walk from Central Park & excellent diners. Bellboys (except for one) and the concierge were very friendly & helpful. One of the chambermaids we met was very friendly & had a genuine pleasant smile. The kitchenette was a bonus, with cutlery & plates etc supplied. The beds, while inadequate, were comfortable & the kitchenette, & bathroom were spotlessly clean. Loved New York. Will be back again but not to the Manhattan Club!", "Date": "October 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Hotel, Fab Location”", "Author": "MasseyLondon", "ReviewID": "UR10417432", "Content": "I booked this as a treat for my daughters 13th Birthday and we had a great time. Room was spotlessly clean, good view outside and we had no trouble with the lifts! Staff I would say were polite but not as freindly as other people we met. Although when I had a problem (not to do with the hotel)the Manager was very efficient in sorting it out speedily for me. The location and standard of the room/suite means we would happily reccommend this hotel. One tip, book express passes for Empire State Buliding, well worth the extra cost, you get treated like royalty and we were up to the 86th floor within 5 minutes of entering the building, by passing massive queues. Fab delux deli around the corner and Central Park 5 minutes away, as is 5th Avenue. At the Rockerfeller Centre try the Rainbow Room for cocktails with its fab views. It is walking distance and well worth the mortgage busting cost!", "Date": "October 29, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Gettysburg, Pennsylvania", "Title": "“Great value”", "Author": "SafariToStay", "ReviewID": "UR10375234", "Content": "Wife and I recently (Oct 2007) stayed at the MC. Great value during the week. Nice sized room with modern bath, flatscreen TV with lots of cable channels, 2 wardrobe closets. Great location, across from Carnegie Hall, a couple of blocks from Central Park South, walking distance to braodway theaters. great restaruant (Red Eye) across the street, Carnegie deli around the corner, 2 blocks from 5th Ave shopping. We'd stay again.", "Date": "October 27, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto", "Title": "“A great place”", "Author": "entucasa", "ReviewID": "UR10109694", "Content": "I have just stayed at this hotel, which is in an excellent location. I read a lot of bad reviews about it prior to going, but was more than pleasantly surprised at how nice it was. The room was well furnished, very clean and comfortable. Booked as a package & not as a time share exchange, the check in took less than 5 minutes. I did note that there was chaos on a Sunday check in, which looked like they were all time share guests. I have to admit that the reception staff were not as friendly as in other hotels I have stayed in, but nor were they rude. I would most definitely stay there again. S.S. Toronto", "Date": "October 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "england", "Title": "“Good Location - Bad Hotel”", "Author": "winnie15", "ReviewID": "UR10058344", "Content": "Stayed at his hotel in September, had booked a one bedroom suit and was given a studio apartment, but as there was three adults and one being my stepson who is 19 it was abit embarrassing when getting ready, Location good but hats about it. Staff unfriendly and not helpful what so ever.. Would not recommend this hotel to anyone, stay in a neighboring hotel around the same area.. Rooms and windows could do with a good clean room smelt musty. Really enjoyed the holiday and weather was lovely, but would stay some where else next time. I hope these reviews are read so they can make it better.", "Date": "October 9, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oakland, CA", "Title": "“Comfortable well-located hotel in midtown Manhattan”", "Author": "Oakland-traveler", "ReviewID": "UR8851649", "Content": "The Manhattan Club was better than we had expected after reading TripAdvisor reviews. We stayed in one of their newly renovated Metropolitan Suites on the second floor. Though the room was small, everything was clean and new. A small kitchenette area with a microwave,sink and refrigerator was a plus. The bathroom was modern and a reasonable size. The bed was excellent. The elevators ARE slow, but not impossibly so. (We walked from the main floor using service stairs, but one of our party was on the 15th floor.) The staff at the front desk and concierge desk were consistently pleasant and helpful. Overall, given the extremely high prices of midtown hotels, this was a good choice.", "Date": "September 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "VIRGINIA", "Title": "“Wonderful Place To Stay”", "Author": "DELORESSIMMS", "ReviewID": "UR8723204", "Content": "We just got back for a 4-day stay at the Manhattan Club. It was an ideal location, our junior suite was clean, nicely furnished and larger than most accommodations in NYC. The only negative comment we have is that they let no one check in before 4:00 P.M. Suddenly at 4:00 P.M., all the rooms were ready. We got caught in a terrible rain downpour and were soaked by the time we arrived at The Manhattan Club at 2:00 P.M. we kept checking to see if we could get into our room to change into dry clothes: however, that was not going to happen. We did not let this spoil our stay. The accommodations were excellent. I would not hesitate to stay there again. The Simms Virginia", "Date": "September 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portstewart, Northern Ireland", "Title": "“Small But Comfortable”", "Author": "dbacon", "ReviewID": "UR8696237", "Content": "My son and I stayed at the MANHATTEN CLUB in early July and we had a very nice time, Rooms were a little on the small side if for four people (JR SUITE) But for us it was fine. They say FIRST IMPRESSIONS LAST and having worked in the industry myself and at the front desk, It was a disappointment to find that most of the REVIEWS I READ about this place before we arrived were true regarding the RECEPTIONIST STAFF. There were no smiles and even a little small talk can go along way to someone when they first arrive in a new place, I just couldn't believe how unfriendly they all seemed to be. Thankfully the rest of the staff made up for it. The BELLBOYS are very nice, I'm sorry now i didn't write down there names, but they're great. Tthe CHAMBERMAID was the CLUBS BIGGEST ASSET very nice and very friendly. I was always brought up to believe that a smile doesn't cost you a thing but a frown can cost you the earth. I'm afraid the reception staff in the place are costing it the world and if i were the boss here it would be the one thing i would SORT OUT, BIG TIME!!!! All that aside it is a great location, close to all the usual things to ee and do and we will go back. NEW YORK is a geat city and i'm glad to say I found it to be a very safe place to be.. Don't be afraid to do your own thing and if in any difficulty just ask one of the street vendors, They are very good and seem to know the city better than most. If in a hurry or only there for a couple of days get the day pass on the subway ($7.00 AND KIDS GO FREE) and get on and off all over the city as you please. Hope all who read this and go, have as nice a time AS MY SON AND I HAD.", "Date": "September 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Great Short Getaway”", "Author": "denlyd", "ReviewID": "UR8508466", "Content": "As has been previously stated, The location is great. The employees were friendly and helpful Good size unit i BR, with large BR, 1and 3/4 baths, modern and clean. Yes the elevator's were a little slow but not a big deal. Would go again.", "Date": "August 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Morro Bay", "Title": "“Great location and excellent room”", "Author": "puttputt76", "ReviewID": "UR8496880", "Content": "We stayed at the Manhattan Club for a week in August and found the place to be quite adequate in all departments. The location is excellent with quick access to the subways, Central Park is 3 blocks and many shows we were able to walk to. Restaurants near by. There were 2 teenagers and 2 adults and the 1 bedroom suite was ideal with 2 bathrooms. Would definately stay there again and or recommend to others.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Very pleasant stay”", "Author": "ttinygnome", "ReviewID": "UR8439295", "Content": "We stayed for two nights on July 24th and 25th, 2007 and found this hotel to be very pleasant. It is in a great central location, being a few blocks walk to Times Square in one direction and a couple of blocks walk to Central Park in the other. The lobby was nice, with an inviting sitting area. The first room they gave us was very spacious and well-appointed, but it smelled of smoke despite being on a non-smoking floor. They quickly gave us another room (room 1425), which was a bit smaller, but still roomy enough for three adults and a baby in a bassinet. It had a king-size bed (very comfortable) and a pull-out couch. The bellman waited with us the whole time and was very friendly and talkative. There was not much of a view (we could see down to the corner where the Wellington Hotel and the Ben Ash Deli is), but we werenâ€™t there for the view. The room was very clean and the bathroom pretty, with nice soaps, lotion, etc. from Bath and Body Works. The kitchen nook had a sink, fridge, microwave and coffee maker and was in a nice modern black. The A/C was powerful and much appreciated! We enjoyed our stay here very much.", "Date": "August 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boston", "Title": "“Perfect Location 10th to 12th Aug”", "Author": "jaBoston", "ReviewID": "UR8406255", "Content": "we decided to make this trip on impulse simply because we had extra points and believe it ,we found a 1 bedroom suite on line with 10 days notice this was a points exchange,we did not have to call anyone,very costly for 2 nights/ friday to sunday to say the least,but we had to take the opportunity,since it is said its virtualy impossible to get a reservation especially an exchange. checkin was a breeze maybe 3mins this was at 7.30pm we did valet parking did not use the car again until departure of which we called 10mins ahead at found it waiting for us,very nice. indeed checkout was a breeze too .one thing though it gets busy at the lobby ,but they have alternative checkout dropoff points,where you dont have to go to front desk unless you have to.renovations are going on in the front of the clubso there is scaffolding right now,if its anything like the future pics show its going to be beautiful 1 bedroom suite is fair in size not your typical new resort size but fair size with 2 full bathrooms small kitchenette type place with fridge and microwave.there is a surprisingly small tv maybe15 inch in the living rm and bedroom,with cable service.flat screen lcd/plasma would be nice and definately create more space taken by the huge tv cabinets they say they are in the process of upgrading these really old tvs wireless internet was not available in rooms for free ,but if needed you can use internet at the business ctr on the 26th floor,together with gym ,bars ,etc location is unbeatable ,it is worth it for the location alone the suites are not out of this world but comfortable. we did not interact much with staff but the little we did was pleasant no problems like some reviews here ah !!! the elevators ,they are small ,we were in and out of the club alot but the elevators were fast.2 serving main lobby abd i think extra on the side ,service elevators i believe. for all intent and purposes we enjoyed our stay ,but the bills add up,parking ,room service,wireless internet", "Date": "August 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“An amazing experience!!!”", "Author": "cobs00", "ReviewID": "UR8388426", "Content": "So far in my traveling journeys, I have had very little bad experiences, and many, many great ones, \"The Manhattan Club\" being one of them. I was a little weary I must admit after reading quite a few reviews, but after my week stay there, I was quite impressed. So impressed, that I would definately love to come back to this hotel. After being greeted by the delightful hotel staff, we were blown away by our 1 bedroom suite with 2 spacious bathrooms, 2 plasma tv's, a nice size modern room (compared to New York standards), and a very comfortable king size bed. The greatest thing about this hotel is the location. You virtually are in the heart of everything, and if you want to go out further, just roll out of bed right into the subway. Thats how close you are. There is a ton of dining options around you. If you need help finding out a type of food, just check with the concierge, Furthermore, if you want to save a little on food, there is quite a few grocery stores in the area which would be perfect for your mini fridge in your room. Just a heads up, coffee in your rrom costs $2 per pack.. Just go to the grocery store, and buy your coffee, filters, etc. There is a coffee machine there for you use. Maid service is there daily for the mandatory $25 fee you pay per day, and it is worth it coming back to our freshly clean room. There is a business room on the 26th floor with over 6 computer terminals one of them being a a mac. There is also a nice size weight room with pretty modern machinery. I would definately come back here, and not only had an amazing time in New York, but was very impressed with everything as a whole.", "Date": "August 10, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "California", "Title": "“Great Location”", "Author": "webmobile", "ReviewID": "UR8220470", "Content": "We finally got a trade into the Manhattan Club. The location's great, a block from the subway station, right next to 7th ave and 2 blocks from Central Park. Like in the other reviews that I've read, the front desk people were not friendliest people. Not rude, but expressionless. It was a hit or miss with the elevators. Sometimes the elevator was there within a minute and other times it was so slow that we took the stairs. We were in room 1207 and there's not much of a view unless you like looking at the outside walls of the other units. We had a 1 bedroom suite. The bed was hard and the room was small compared to other timeshares that we stayed in. I was told that all rooms or hotel rooms in Manhattan were small and that this was quite large. We had 2 bathrooms and they were clean and with marbled counters and gold tone fixtures. I thought the room was dark too. The water pressure in the shower was good. There was a kitchenette and we kept sodas in the refrigerator. There were alot of police cars and police on horseback in the area. I felt it was very safe.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "lincoln", "Title": "“What a wonderful holiday friom a british customer”", "Author": "terrien", "ReviewID": "UR8207259", "Content": "We stayed here during june and july and can say was dubious following reading various reviews , however we loved it. The hotel staff yes were short with us however helpful to us , probably due to the nature of their job. I was waiting to book in and a \"american lady \"was complaining that her safe wasnt working and wanted IMMEDIATE action....... get a grip its a safe surely will wait 15 mins. The room was spacious and clean, yes following a comment the windows were slightly dirty however its Manhattan and 20 floors high cant be cleaned every day !!!!!!! The place was central for everything and we hardly were in the room so not as important as if it was in the middle of nowhere. The only people i saw complain were the americans maybe they have different standards to the british but i certainly wouldnt complain about ths place and the service. The lifts yes could be delayed however they were no way as bad as people state also no air con in the business centre however does it matter unless you want to spend all your holiday on the internet. The place was lovely and seem to be a victim of their own success and no doubt will get moans but doesnt everywhere. W have been all over the world as you can nick pick about everywhere This is in the middle of mahattan what more could you ask for 2 streets from central park, broadway , 5 th Avenue and Time square and new yorkers are friendly no matter what people say you smile and talk to them they will be friendly back I would recommend going there and to the manhattan club we waited 9 months and it was well worth the wait. one thing i would say DONT BELIEVE EVERYTHING YOU READ , TAKE A RISK AND USUALLY PAYS OFF .", "Date": "July 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "philadelphia pa", "Title": "“Horrible timeshare/hotel (Manhattan Club)”", "Author": "sue0616", "ReviewID": "UR8116142", "Content": "I recently stayed here for 1 week + it was AWFUL!!!! DO NOT EVER GO HERE!! Every employee at the check-in desk + concierge desk was rude and obnoxious and had their hand out for a tip! There were many unhappy guests and owners (timeshare property) in the lobby who hated it + are making it known to management. But management doesn't seem to care! No air conditioning in the lobby or elevators or computer room-- what, are they that cheap?? The whole place needs a re-do, too. The windows were so filthy you couldn't even see outside. Many things were missing from the room at check-in. The bed was awful. The shower barely had any pressure. The only good thing about this place was the location, but it sure was not worth it to stay here. There are hundreds of other places to choose from, + believe me, myself + the many others I spoke with in the lobby will NEVER STAY HERE AGAIN. RCI (the timeshare owner) is being made aware of the very poor quality of the employees + the place itself. STAY AWAY FROM HERE!", "Date": "July 14, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Smile ! It won't hurt!”", "Author": "Wheaties", "ReviewID": "UR8087696", "Content": "We were in Manhattan for a week of site seeing. Check in was prompt, even though we were there 30 minutes before check in time. The bell hop was very helpful with getting our bags loaded onto the luggage cart and delivering them to our room. We had a one bedroom suite facing the street. It was very spacious with room enough for a blow up mattress in the living area. The bathrooms were clean and well stocked with Bath and Body Works products. The downside to this property is that there are 4 elevators and usually only 1 was working. There were times when we stood for 10 min waiting for the elevator on the 18th floor. Other than this we didn't encounter any problems until the morning of check out. We called for a bellhop or a luggage cart, and called for our car to be brought around from the parking garage. After waiting 15 minutes we hauled all of our luggage out to the elevator. After waiting forever for the elevator we finally made it downstairs to be greeted by one of the other guests loudly complaining that he couldn't get his car to the front of the building because ours had been sitting there for 10 min. If the hotel is short staffed they should say so, instead of saying they will send someone up with a luggage cart right away. Also, training on how to smile and be friendly to the guests might be in order. After we checked in the staff virtually ignored us. Other than these minor things, our stay was VERY comfortable!", "Date": "July 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orange, CA", "Title": "“not nearly as bad as some of the other reviews”", "Author": "312newswannabe", "ReviewID": "UR8054587", "Content": "After finding out that I would be staying at the Manhattan Club, I checked this site for the reviews...I was hesitant after most things I read...I basically thought we were going to be staying in a dump, but when we arrived I was pleasantly surprised...The lobby was very clean and the front desk staff were helpful...no rooms were available at the early hour, so we checked our bags with the bellmen...that staff was mostly helpful except for the older Asian man who continually complained about his back hurting...he also acted as if we were an inconvenience when we came back to get our bags...upon entering the room, it was very clean...I was really surprised to see a 32in flat screen mounted to the wall (reception of all local channels sucked, but there were a ton of cable channels that came in great)...the size was great for 2 adults...we had a \"jr suite\" with the one bed and couch that doubled as a bed...both of which were comfortable...the room even had a little kitchen area with a microwave, sink and dishwasher...plates and all utinsels were included...the in-room safe was in such a position that the door wouldn't open all the way, therefore making it impossible for me to store my laptop while exploring the city...the bathroom was a bit small...there was no counter space at all...I suppose they didn't consider that when people travel, we bring all of our crap and there was no place to put them in the bathroom as the sink was a stand-alone...the shower was decent size, however. Our room looked completely remodeled...there was even FREE WIRELESS INTERNET in the room, which was also a nice surprise...Housekeeping was a charge of $15 daily...they called just about every morning and woke us up to see if we wanted our room cleaned...and some days they called multiple times...that was really annoying, as we couldn't sleep in...The elevators weren't as slow as I was expecting, or as some of the reviews would suggest...there are really only 2 elevators to service the entire hotel...there are also 2 service elevators for guest use...that was a nice secret when the line in the lobby was long...it didn't seem like most people saw the sign for the additional elevators around the corner from the front desk...besides the housekeeping calling, our week long stay was a fine one...the room was great for the most part...I'd recommend it...", "Date": "July 4, 2007"}], "HotelInfo": {"Name": "The Manhattan Club", "HotelURL": "/ShowUserReviews-g60763-d99321-Reviews-The_Manhattan_Club-New_York_City_New_York.html", "Price": "$344 - $599*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">200 West 56th Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10019</span></span> </span> </span> </address>", "HotelID": "99321", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/94/01/94017b65824841eefe31aa36e921a3c16large.jpg"}}